[
  {
    "url": "https://www.9news.com.au/national/nsw-chatgpt-data-breach-northern-rivers-flood-victims/b633075b-1104-4bac-a3a1-9a4d85c46339",
    "title": "Major data breach as flood victims' personal information uploaded to ChatGPT",
    "publish_date": "Mon, 06 Oct 2025 01:04:22 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "The personal data of up to 3000 flood victims in NSW has been exposed after it was uploaded to ChatGPT.\n\nIn a statement released this morning, the NSW Reconstruction Authority (RA) confirmed personal data, including names and addresses, phone numbers and other personal and health information, was uploaded to the platform by a former contractor of the RA.\n\nThe victims of the breach applied for the Northern Rivers Resilient Homes Program in the aftermath of the 2022 floods in northern NSW.\n\nThe data breach impacted flood victims in the Northern Rivers region of NSW. (Getty)\n\nWhilst the RA insist there is no evidence the data has been made public, it admits it will take some time to verify this, as the data was shared in a Microsoft Excel spreadsheet with 12,000 rows of information.\n\n\"The breach occurred when a former contractor of the RA uploaded data containing personal information to an unsecured AI tool which was not authorised by the department,\" the RA said.\n\n\"The process is highly complex and time consuming and we acknowledge that it has taken time to notify people.\"\n\nThe RA believes forensic examination of the issue will be completed in the coming days, offering an insight into the extent of the breach and what specific data could have been exposed.\n\nThey also say there is currently no evidence that any of the uploaded data has been accessed by a third party.\n\n\"We understand this news is concerning and we are deeply sorry for the distress it may cause for those who have engaged with the program,\" the RA said.\n\n\"We know people will want to know exactly what has been shared and we are doing all we can to get that information to them as soon as possible.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/moreton-island-bushfire-unauthorised-campfire-sparks-major-blaze-queensland-news/541b5093-608a-4166-b8c6-a42c1b7b154d",
    "title": "Moreton Island bushfire downgraded after firefighters battle blaze through weekend",
    "publish_date": "Sun, 05 Oct 2025 23:24:52 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "Firefighters have worked through the weekend to control the spread of a major bushfire on\n\nQueensland\n\n's Moreton Island which is believed to have been caused by an unauthorised campfire lit during a total fire ban.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/october-long-weekend-2025-trading-hours-whats-open-closed-state-by-state-explainer/74ddecf0-2629-4ccf-b4bb-bc56b07dafbb",
    "title": "What will and won't be open on the public holiday",
    "publish_date": "Sat, 04 Oct 2025 22:45:53 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "Millions of Australians will have some time off this weekend as they celebrate one of two public holidays.\n\nFor Aussies in South Australia, New South Wales and the Australian Capital Territory, it will be their Labour Day.\n\nQueensland residents will have a public holiday on the same day to commemorate the King's Birthday.\n\nSo what will be the trading hours for Australia's biggest retailers this long weekend?\n\nHere's a quick state-by-state guide. ﻿\n\nColes\n\nStores across NSW, ACT and QLD will be open as normal.\n\n﻿In SA, all stores will be closed except for﻿ Port Lincoln, Port Pirie, Berri, Port Augusta, Mount Barker, Adelaide Rundle Place, Whyalla, Murray Bridge Green, Mount Gambier and Victor Harbor.\n\nFull trading hours can be found on their website .\n\nAldi\n\nStore hours will vary for different stores and states.\n\nFull trading hours for each store can be found on their website﻿\n\nREAD MORE: When October long weekend double demerits apply for motorists\n\nAldi recommends that customers check their local stores trading hours on their website (Nine)\n\nWoolworths\n\nAll stores except for some in South Australia and the Northern Territory will be open.\n\n﻿Full trading hours can be found on their website .\n\nLiquorland\n\nStores in states celebrating the public holidays will trade with reduced trading hours.﻿\n\nIn Queensland,﻿ some stores will be closed for the public holiday.\n\nFull trading hours can be found on their website .\n\nREAD MORE: How to maximise public holidays and make the most of your annual leave in 2025\n\nSome stores in Queensland will be closed for the public holiday. (Jon W / Event Photos Australia)\n\nDan Murphy's and BWS\n\n﻿Dan Murphy's stores nationwide will mostly open from 10am to 7pm.\n\nBWS stores will mostly open from 9am and close between 7pm and 8pm.\n\nFull trading hours can be found on their website﻿ .\n\nBunnings﻿\n\nAll Bunnings stores will be open on the October long weekend.\n\nMost stores in states where there is a public holiday will be open from 7am to 7pm.﻿\n\n﻿Shoppers are advised to use the Bunnings website or app to check their local store's trading hours, as opening times will vary.\n\nBunnings stores statewide will remain open on the public holidays. (Supplied)",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/pat-carrigan-on-wooden-spoon-motivating-2025-nrl-grand-final-win/105856516",
    "title": "How a wooden spoon left at Red Hill helped motivate Broncos star Carrigan",
    "publish_date": "Mon, 06 Oct 2025 01:00:44 +0000",
    "category": "sports",
    "authors": [],
    "text": "Brisbane lock Pat Carrigan credits keeping one of the hundreds of wooden spoons thrown on the club's training ground five years ago for inspiring the stunning grand final win over Melbourne.\n\nThe 27-year-old endured the Broncos' lowest ebb in 2020 when the NRL powerhouse club received its one and only wooden spoon.\n\nFans, in disgust, hurled the spoons on the field at Broncos HQ, so plentiful that they filled a rubbish bin.\n\nHow times have changed.\n\nCarrigan was integral in the 26-22 win over the Storm on Sunday to secure the club's first title in 19 years.\n\nHe recalled the day club stalwart and team gear steward Matt Middleton collected the dreaded spoons, and how he got his hands on one as a driving force.\n\n\"I have kept one of those. I have kept my receipts,\" Carrigan said.\n\n\"Our gear guy, Matty Middleton, means a lot to us. He collected all those spoons off the field, and I was really embarrassed for him because he started with Wayne Bennett and had seen the highs of this place.\n\n\"I always kept one and I said to him, 'We are going to get back there one day'. I am keeping it just to remind me if you keep working hard you will get there in the end.\"\n\nMatt Middleton picks up spoons left on the turf by fans at Red Hill in 2020. (7News)\n\nCarrigan said the premiership was \"more special\" for him after coming through the Broncos with fellow title winners Payne Haas and Kotoni Staggs, who were there for the bad times in 2020.\n\nThe Broncos also lost the 2015 and 2023 grand finals in late drama, and Carrigan was determined it would not happen again.\n\n\"Our members have had two of the worst heartbreaks in the last two of these,\" he said.\n\n\"They ride the waves with us and pay their hard-earned dollars and that's why we do this.\n\n\"I had a giggle to myself with six minutes to go and thought, we've got to get this done because we have shattered these guys the last two times. I was confident. We are a different team that believe in our footy.\"\n\nThe Broncos came back from 16 points down to beat Canberra in the first final, recovered from a 14-point deficit to topple Penrith last week, and trailed 22-12 against the Storm.\n\nBen Hunt finally gets the premiership he 'deserves' Photo shows Kotoni Staggs and Ben Hunt hug as the Broncos celebrate winning the 2025 NRL grand final. Defeat in the 2015 decider was so scarring, Hunt eventually felt the need to move away from the club he loves. Ten years later and back in his home colours, he's a 350-game, premiership-winning NRL player.\n\nCarrigan, who was suspended for the win over the Panthers, credited coach Michael Maguire's tough training program in pre-season for the resilience the side showed.\n\n\"We had two auditions in the last two finals of falling behind and fighting our way back,\" Carrigan said.\n\n\"There's the adversity we have gone through as a group and the willingness to compete.\n\n\"Madge (Maguire) has been flogging us as everyone knows the past 12 months. Earlier on in the year it was questioned, but the back-end has shown our willingness to turn up for each other.\n\n\"Something about our fitness must have worked because we showed we could hang in until the end.\"\n\nHe said the floggings the team received from Maguire at training were \"worse\" than reported.\n\n\"He is tough but fair. We all come to work each day and sign up to get better. He is a big part of why we are here,\" Carrigan said.\n\n\"That foundation that you build in conditioning and all the days we had sore bodies and he was throwing us in the wrestle room took some time to gel, and people were critical of that. Deep down we knew that once we got into a bit of a flow of footy we would be a chance.\"\n\nThe Broncos are expected back in Brisbane today.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/north-melbourne-aflw-untouchable-as-comp-evens-out/105856458",
    "title": "As the AFLW begins to even out, one team remains untouchable",
    "publish_date": "Mon, 06 Oct 2025 00:59:40 +0000",
    "category": "sports",
    "authors": [],
    "text": "In the final quarter of North Melbourne's demolition job on Sydney, Fox commentator Kelli Underwood asked colleague Daniel Harford, \"Are they going to be beaten [this season]?\"\n\nThe answer was a resounding \"No\".\n\nThe Kangaroos claimed their 20th win in a row after downing the Swans by 68 points on Saturday afternoon in Tasmania.\n\nTigers end AFLW drought Photo shows Monique Conti kicks the ball for the Tigers in a 2025 AFLW match. Midfielder Monique Conti plays a starring role in Richmond's shock win over competition heavyweights Adelaide.\n\nIn it, Ash Riddell, for the third time this season, broke her own AFLW record for most possessions in a match with 45.\n\n\"It'll be 12-0. They'll be undefeated again this season,\" said Harfold, the former Carlton AFLW coach.\n\n\"They're a class above, we know that. When they want to put their foot to the floor, there's not much that can stop them.\n\n\"Somewhere in a dark office, somewhere in the dark hours of the night, coaches will be sitting there going 'How do I beat this team? What do we need to do?'\"\n\nEven popular AFL content creator Daniel Goringe joked on Instagram half the All Australian squad this year would be North Melbourne players, as the women's team could probably put the club's men's team to the sword.\n\nUnderwood pointed out an undefeated run in 2025 would mean the Kangaroos would finish the season with 24 consecutive wins, which would break the men's record, which is 23, held by Geelong in 1953-54.\n\nTwo weeks prior, North Melbourne faced then-third-placed Carlton, and beat them by 53 points, and won't play second-placed Melbourne in the home-and-away season.\n\nThe Roos next face Richmond, Adelaide, St Kilda and Hawthorn.\n\nWhile some fans are starting to predict a Kangaroos and Dees grand final, Melbourne only beat Essendon by 14 points over the weekend, a team North downed by 30 points the weekend before.\n\nMany pundits expect North Melbourne to go undefeated again this season. (Getty: Steve Bell)\n\nAs Underwood declared on Saturday: \"They are simply unstoppable. They are the ultimate team.\"\n\nEven Melbourne goalkicking star Eden Zanker was asked after her side's win on Friday night by ABC commentator Chyloe Kurdas, \"What would Melbourne need to do to beat North Melbourne?\"\n\nYet North Melbourne's seemingly uncatchable dominance is in stark contrast to the competitiveness of the rest of the league.\n\nOn Sunday afternoon, success-starved Richmond shocked the AFLW world by beating then-fifth-placed Adelaide, which was gunning for a top-four spot.\n\nThe Tigers, who were yet to win this year, put away three-time premiers the Crows by 11 points, aided by a Monique Conti masterclass.\n\nTiger Ellie McKenzie, who starred with three goals and 24 touches, was candid on the broadcast following the win, saying going seven rounds without a victory was starting to weigh on their confidence.\n\nEllie McKenzie starred with three goals and 24 touches in her side's upset win against Adelaide. (Getty: Daniel Pockett)\n\n\"Honestly relieved, it's been a tough start to the season for us, so really happy to come away with the four points and now we can build from here,\" McKenzie, former number one draft pick, told Fox.\n\n\"We've never beaten Adelaide and I think in times like this it's hard to keep belief in the group, but that's what our group's done.\"\n\nUnfortunately for Tigers fans, Richmond next faces North Melbourne in round nine.\n\nCrows star Anne Hatchard told ABC Sport a few weeks ago \"teams just keep coming and coming\" as the competition gets tougher.\n\nAnd it's showing on the ladder.\n\nAs teams that finished around the middle of the pack in previous seasons begin to rise, the two powerhouses of the AFLW — Brisbane and Adelaide — have become more fallible.\n\nTypically top-four contenders, the Lions and Crows sit fifth and seventh, respectively, after round eight.\n\nA the Kangaroos remain untouchable, the rest of the games are becoming far less easy to predict.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/nrlw-australia-jillaroos-brisbane-broncos-ali-brigginshaw/105856578",
    "title": "Brigginshaw to lead Jillaroos fresh from Broncos' NRLW win",
    "publish_date": "Mon, 06 Oct 2025 00:46:57 +0000",
    "category": "sports",
    "authors": [],
    "text": "Ali Brigginshaw has been named as a Jillaroos co-captain after helping steer the Brisbane Broncos to their fourth NRLW premiership.\n\nBrigginshaw was among the Broncos' best in their 22-18 defeat of the previously unbeaten Sydney Roosters in Sunday's NRLW grand final at Stadium Australia.\n\nThe 35-year-old has played in each of the Broncos' premiership victories since the NRLW's inaugural season in 2018.\n\nShe will join Kezie Apps in captaining the Jillaroos squad for their Tests against Fetu Samoa (October 26) and New Zealand (November 2).\n\nControversial try decides NRLW premiership Photo shows The Broncos score a controversial try Brisbane and the Roosters played one of the greatest games in NRLW history, but the controversial winning try to Mele Hufanga shapes as a football mystery that might never be solved.\n\nFour Broncos players were included, with Brigginshaw joined by Dally M medallist Tamika Upton, Keilee Joseph and Julia Robinson.\n\nThe Roosters, who were minor premiers, will be represented by their captain Isabelle Kelly, Rima Butler, Keeley Davis, Jocelyn Kelleher, Olivia Kernick and Jess Sergis.\n\nButler and Kelleher are among five uncapped players in coach Jess Skinner's squad.\n\n\"This is a strong squad with a number of established Jillaroos as well as players who have progressed to this level through their form in the NRLW competition,\" Skinner said in a statement.\n\n\"This is a really important tournament for us.\n\n\"I expect this squad to perform at the highest level as we continue to look towards not only next year's World Cup but also progressing the women's game at international level.\"\n\nThe Jillaroos play Fetu Samoa in Brisbane, before crossing the Tasman to face the Kiwi Ferns at Auckland's Eden Park.\n\nJillaroos squad:\n\nKezie Apps (C), Ali Brigginshaw (C), Rima Butler, Yasmin Clydsdale, Keeley Davis, Quincy Dodd, Jessika Elliston, Ellie Johnston, Keilee Joseph, Jocelyn Kelleher, Isabelle Kelly, Olivia Kernick, Sienna Lofipo, Tiana Penitani Gray, Julia Robinson, Jess Sergis, Jesse Southwell, Sarah Togatuki, Tamika Upton, Jakiya Whitfeld, Emma Verran",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/what-is-task-paralysis-and-how-to-overcome-it/105816676",
    "title": "What is task paralysis and how do you overcome it?",
    "publish_date": "Mon, 06 Oct 2025 00:30:41 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "If you've ever felt physically unable to begin a project or chore, whether it be at home, work or school, it could be a sign you're experiencing task paralysis.\n\nIt is not laziness or procrastination; rather, it's a physiological reaction to stress and overwhelm, leading to people feeling \"stuck or frozen\".\n\nWe asked three experts how to recognise the signs of task paralysis and what you can do about it.\n\nIs it task paralysis or procrastination?\n\nProcrastination is a behaviour and there's an element of choice to it, according to clinical psychologist Dr Catherine Houlihan from the University of the Sunshine Coast, Kabi Kabi land.\n\nDr Catherine Houlihan is a senior lecturer in psychology at the University of the Sunshine Coast, Queensland. (Supplied: Dr Catherine Houlihan)\n\n\"So, we decide to delay a task because we are feeling overwhelmed, or it might be because we are simply bored and we don't want to do the task, or we find the task frustrating,\" says the senior lecturer in psychology.\n\nOn the other hand, she explains that task paralysis is an involuntary response where a person has become overwhelmed to the point their nervous system initiates a freeze response.\n\n\"It is more of a colloquial term than a clinical one,\" she says, \"[and] it's often called ADHD paralysis, because it's often talked about in the context of attention deficit hyperactivity disorder.\"\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nMelbourne/Naarm clinical psychologist Max von Sabler says ADHD paralysis is linked to executive dysfunction, which is like \"having a car engine that just refuses to start\".\n\nSigns you might be experiencing overwhelm Photo shows A woman sitting at a desk with her eyes closed rubbing her temples Experts say symptoms of overwhelm are important to address early on.\n\n\"Imagine planning to clean your room, yet the mere thought paralyses you,\" he says.\n\n\"There are a variety of cognitive factors involved … it's the possibility of many choices and decisions that can commonly cause the engine to stall.\n\n\"This is an example of the brain crash many adults with ADHD experience.\"\n\nDr Houlihan says people who experience task paralysis don't necessarily have ADHD.\n\n\"People will respond differently to stress,\" she says.\n\n\"So, if your response is to freeze, then potentially you could experience task paralysis in moments of very high stress or high demand.\"\n\nWhat are the signs of task paralysis?\n\nMr von Sabler says common symptoms of task paralysis or ADHD Paralysis include difficulty initiating tasks, feeling stuck, choice paralysis, feeling overwhelmed, emotional distress, physical restlessness or mental exhaustion.\n\nHe says task paralysis manifests when there is an overload of tasks or information.\n\nMr von Sabler says common causes of task paralysis include having too many options or overthinking every detail of a task. (Supplied: Max von Sabler)\n\n\"It's like having an endless list of things to do but being unable to start any of them,\" he says.\n\n\"This often happens because of feeling overwhelmed by the many choices, and thus not knowing where to begin. It's as though there is too much information and so many inputs.\"\n\nHe says common causes include having too many options or overthinking every detail of a task.\n\nCommon triggers can include complex or multi-step tasks, unclear instructions or expectations and stress or anxiety without immediate rewards.\n\nPerfectionism can also be a trigger, according to Dr Houlihan.\n\n\"That pressure of maintaining a high standard or getting a perfect result can also lead to a likelihood that … we're going to become so overwhelmed that we freeze.\"\n\nSharon Collon is a mother of three and a certified ADHD coach. (Supplied: Sharon Collon)\n\nMother-of-three Sharon Collon says she often deals with task paralysis in her household, with several members of the family diagnosed with ADHD.\n\n\"People develop all different sorts of coping mechanisms for masking their task paralysis,\" says the certified ADHD coach, based in Sydney/Dharawal.\n\n\"Sometimes it can appear as avoidant behaviour, like 'I'm not doing that', putting their foot down or doing other things.\n\n\"In some cases, like in our household, creating other urgent situations that need more urgent attention because we don't want to do that one thing.\"\n\nHow can you overcome task paralysis?\n\nDr Houlihan says recognising that task paralysis is impacting your daily activities is the ideal place to start.\n\n\"Asking for help is a really important tool for … any aspect of our mental health,\" she says.\n\n\"Having a chat with your GP, who can tell you the kind of local support options, is probably a good first step.\n\n\"Cognitive behaviour therapy, or CBT, [is a useful therapeutic approach], there are ADHD medications that can help with the kind of brain functioning that can reduce the likelihood of task paralysis.\"\n\nLoading...\n\nWhen you find yourself in a state of freeze, she recommends breathing exercises to help emotionally regulate and calm the nervous system.\n\n\"So, we can do that through tried and tested methods like diaphragmatic or deep breathing.\n\n\"[Do this] for a few minutes and you'll find that your nervous system starts to understand that there's no threat and that it can calm.\"\n\nMs Collon says there are also practical ways people can avoid task paralysis.\n\n\"Break big tasks down into achievable tiny steps,\" she says.\n\n\"Nowadays it's even easier because we have AI and [online tools] which will break down the task for you.\n\n\"If you've got a big day of lots of important things that you're doing, try and stack the easiest, quickest wins up first.\"\n\nAdd to your watchlist Photo shows Mystery Road Origin ABC iview with young detective Jay Swan in the bush. The critically acclaimed Mystery Road: Origin returns as Detective Jay Swan (Mark Coles Smith) and Mary (Tuuli Narkle) uncover dark secrets in a haunted timber town, where the past threatens to tear them apart.\n\nMr von Sabler says other practical tips include setting a timer for a specific period or using the Pomodoro Technique (work for 25 minutes, take a break for 5 minutes).\n\n\"Write down everything that needs doing. This can help clear your mind and provide a visual guide, and is what we refer to as a brain dump,\" he says.\n\n\"Utilise apps and digital tools to organise tasks and set reminders.\"\n\n\"Physical activity can also help boost mental clarity and reduce feelings of paralysis. Even a short walk around the block can make a huge difference.\"\n\nThis is general information only. For personal advice, you should see a qualified medical practitioner.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/nrl-kangaroos-squad-ashes-reece-walsh-broncos-grand-final/105856380",
    "title": "Walsh's grand-final heroics rewarded with Kangaroos call-up",
    "publish_date": "Mon, 06 Oct 2025 00:24:24 +0000",
    "category": "sports",
    "authors": [],
    "text": "Reece Walsh's performance in Brisbane's grand-final victory has sealed his selection in the Kangaroos squad for the upcoming Ashes series in England.\n\nWalsh was awarded the Clive Churchill Medal for player of the match in the Broncos' stunning 26-22 victory over the Melbourne Storm in Sunday night's season decider.\n\nHe was already a likely selection, but his display against Storm — which included a try and three try assists — confirmed he would be among the first picked in the Kangaroos' touring party to face England in three Tests.\n\nWalsh was charged with a grade-one careless high tackle on Storm winger Xavier Coates during the first half of the grand final, but it will not affect his participation in the Ashes series as he can accept a $3,000 fine with an early guilty plea.\n\nThe 23-year-old is among seven uncapped players chosen, with ex-Wallabies winger Mark Nawaqanitawase also named.\n\nNawaqanitawase, who enjoyed a stand-out season with the Sydney Roosters, will become a dual international should he play in any of the three Tests at Wembley (October 25), Everton Stadium (November 1) and Headingley Stadium (November 8).\n\nReece Walsh has won the Clive Churchill medal as player of the grand final. (AAP: Dan Himbrechts)\n\n\"The State of Origin series was highly competitive and we saw some brilliant performances from key players in the finals series,\" Kangaroos coach Kevin Walters said in a statement.\n\n\"There is a mix of youth and experience and all of them have the desire to represent their country on this stage. I cannot wait to coach this squad.\n\n\"England will be a huge Test on their home soil, however, this squad knows what it takes to perform at the highest level and knows what it takes to win.\"\n\nPenrith's Isaah Yeo will skipper the Kangaroos in the first Ashes series since 2003.\n\nThe squad includes seven players who played in the grand final, with Walsh joined by Broncos teammates Patrick Carrigan, Gehamat Shibasaki and Kotoni Staggs.\n\nThe Storm will be represented by their captain Harry Grant, Maroons skipper Cameron Munster and Coates.\n\nKangaroos squad:\n\nIsaah Yeo (C), Blayke Brailey, Patrick Carrigan, Nathan Cleary, Xavier Coates, Lindsay Collins, Reuben Cotter, Angus Crichton, Tom Dearden, Dylan Edwards, Tino Fa'asuamaleaui, Harry Grant, Keaon Koloamatangi, Zac Lomax, Mitchell Moses, Cameron Munster, Mark Nawaqanitawase, Jacob Preston, Gehamat Shibasaki, Lindsay Smith, Kotoni Staggs, Ethan Strange, Reece Walsh, Hudson Young",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/melbourne-builder-mike-harris-under-investigation/105849496",
    "title": "Clients of Melbourne builder lose life savings as company goes bust",
    "publish_date": "Mon, 06 Oct 2025 00:03:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "Builder Mike Harris was persuasive.\n\nIn March last year, he told Tony* and his wife that if they wanted their major renovation to get underway, they needed to pay $140,000 in costs outside their contract so he could quickly buy building supplies.\n\nMJ Harris Group was run by Diamond Creek painter Mike Harris. (MJ Harris Group)\n\n\"He really, really led us to believe that it was critical to lock in prices for those materials and to lock in trades and timing, which was exciting for us at the time,\" Tony said.\n\nMr Harris assured them the job would be \"done by the end of last year\", Tony said.\n\nBut when the ABC visited the couple's Melbourne property last week, Tony was standing in a gutted house littered with construction debris and the back half ripped off — a skeleton of the planned two-storey rear extension jutting into the sky.\n\nTony said Mr Harris's company, MJ Harris group, only bought $900 worth of supplies.\n\nHe regrets signing with the company and paying the money.\n\n\"It's been the single-handed most devastating event in our entire lives so far,\" he said.\n\n\"We are hanging on by a thread and we are now unfortunately in a position where we can't afford to finish our dream home that we've spent years and years planning for and building.\n\n\"So yeah, it's been very tough.\"\n\nTony has told the ABC he regrets signing with MJ Harris Group. (ABC News: Patrick Rocca)\n\nThe couple are among more than a dozen customers of MJ Harris Group — a building company run by Diamond Creek painter Mike Harris in Melbourne's outer north-east — who have been left significantly out of pocket since the company went into administration last week.\n\nMany are furious that the company was able to trade for as long as it did, despite massive debts, many unfinished projects, court orders against it for unpaid wages and complaints to building regulators.\n\nNo building licence\n\nTony and his partner have severed ties with Mr Harris. The couple's renovation has been taken over by another builder.\n\nThis builder's licence number was on official paperwork for the job, but incorrectly attributed to MJ Harris Group.\n\nThe couple didn't realise when they signed up with MJ Harris Group that Mr Harris didn't have a building licence.\n\nThe back half of Tony's house has been demolished and the site is littered with construction debris. (ABC News: Patrick Rocca)\n\n\"We only found out that he wasn't a registered builder after we'd signed the contract,\" Tony said.\n\nThe regulator, the Building and Plumbing Commission, said neither Mr Harris nor MJ Harris Group had ever been registered as a builder in Victoria.\n\n\"The BPC is investigating allegations that Michael J. Harris undertook building work without being registered in circumstances when registration was required,\" a spokesperson said.\n\nBut the project remains in limbo as the couple struggle to come up with the money needed to finish it off and face problems with the plans that mean fresh planning approval might be needed.\n\nCustomers chase Harris leading to collapse\n\nRebecca* signed up with MJ Harris Group to design a major home renovation in July last year.\n\nShe said Mr Harris struck her as \"very engaging [and] really high energy\".\n\n\"I thought, 'This guy is on the same page as me. He is excited by his work. He knows his work.'\"\n\nShe made payments totalling $25,000 on the $32,000 contract.\n\nClients expressed frustration at the difficulty of enforcing orders made against the likes of Mike Harris. (ABC News: Patrick Rocca)\n\nBut she was surprised to get a bill from the company on December 17 — just a couple of weeks after she had paid one that she had been expecting.\n\nThe parties agreed to delay the payment until the new year.\n\nBut just after Christmas, two more invoices for the same amount arrived in short succession.\n\nIn retrospect, Rebecca thinks this shows \"how desperate he was\".\n\n\"I did feel pretty pressured and getting a fair bit of anxiety over it and I buckled to them,\" she said.\n\n\"I did feel like there was a sense of urgency.\"\n\nShe said another red flag was that she could not reach anyone at MJ Harris when it reopened in the new year, after the holiday break.\n\n\"[Mr Harris] finally answered my call. He said the girl working on interior design had left and he had already allocated a new girl to work on it,\" she said.\n\nBy May, she was still waiting on engineering work and made a complaint to Domestic Building Dispute Resolution Victoria (DBDRV).\n\nTony says he fears the money he and his partner paid to MJ Harris Group is gone for good. (ABC News: Patrick Rocca)\n\nShe told the ABC that DBDRV indicated that Mr Harris was unlikely to attend conciliation meetings, so she took her complaint to the Victorian Civil and Administrative Appeals Tribunal in July.\n\nA directions hearing is scheduled for mid-December — but in the meantime, MJ Harris Group has gone bust.\n\nAll Rebecca has to show for her $25,000 are some concept drawings and a 3D design file.\n\n\"I have nothing I can take to a builder,\" she said.\n\n\"I feel the building industry has far too many loopholes.\"\n\nPaying for work that was never done\n\nThe ABC has spoken to more than half a dozen MJ Harris Group customers who have similar stories about paying the company for work that was never done.\n\nAnother customer, Isabella Gualtieri, also took her dispute to the DBDRV without success.\n\nShe and her husband hired MJ Harris Group to renovate their home in Melbourne's north last April.\n\nThey paid $12,700 up-front and another instalment of $6,300 in December after receiving preliminary drawings.\n\nBut no work was done and, in May this year, the couple learned that two of Mr Harris's previous companies, MJ Harris Carpentry and MJ Harris Painting, had gone into administration.\n\n\"Mike later admitted this but reassured us our project would continue under his 'downsized' business,\" Ms Gualtieri said in her statement to DBDRV.\n\nThe carpentry business alone owed customers, suppliers and staff more than $6 million and had assets worth just $160,000, a report to creditors shows.\n\nMr Harris agreed to pay about $115,000 to clear the debts in a deal that would have delivered creditors about two cents in the dollar.\n\nTwo of Mike Harris’s previous companies, MJ Harris Carpentry and MJ Harris Painting, had gone into administration. (ABC News: Patrick Rocca)\n\nBut he failed to make the payments and the companies were liquidated.\n\nThe vast bulk of the multi-million-dollar figure was owed to the Australian Taxation Office (ATO) for unpaid taxes and superannuation.\n\nThe money remained owing despite an earlier agreement by Mr Harris that he personally was on the hook for the debt.\n\nTo resolve County Court proceedings against him in November last year, Mr Harris agreed to orders stating he was liable for $4.4 million in tax and superannuation owed by the two companies from as long ago as 2020.\n\nRebecca said the ATO should have done more to collect its money from Mr Harris.\n\n\"I'm angry at ATO for letting him off the hook — that is pretty crap to everyone who pays taxes,\" she said.\n\nThe ATO declined to comment.\n\nStaff 'couldn't afford groceries'\n\nStaff at Mr Harris's businesses have also been left unpaid.\n\nThe ABC is aware of three workers who have taken legal action over unpaid wages and entitlements.\n\nOne of them, videographer Michael Potts, is owed $18,300.\n\nThe Magistrates Court has ordered MJ Harris Group to pay him the money but he told the ABC the company had not done so.\n\n\"It's extremely distressing because it's like you're going to a job that you're working 40 hours a week, and you're kind of just hoping that you're going to get paid,\" Mr Potts said.\n\n\"I couldn't afford to buy groceries. I couldn't pay my bills on time. I'm having to borrow money off my family.\"\n\nDo you know more about this story? Contact Elise Kinsella at kinsella.elise@abc.net.au. If you're sharing sensitive information, read our tips on how to contact us confidentially.\n\nTwo other workers took Mr Harris's companies to the Federal Circuit Court over unpaid wages.\n\nIn one case, MJ Harris Carpentry was ordered to pay $9,500, while the other claim, for $18,000 against MJ Harris Group, was still on foot when the company collapsed last week.\n\nMr Harris provided a statement through his lawyer, Monica Allen of Blackbay Lawyers.\n\nHe blamed the \"unprecedented pressures\" of the COVID-19 pandemic for the business' woes.\n\n\"Despite our best efforts, the business was ultimately unable to recover,\" he said.\n\n\"I am deeply sorry for the hardship this has caused to staff, clients and their families. I know the impact has been devastating for many, and that is something I carry heavily.\"\n\nMoney gone for good, clients say\n\nNow that it is in liquidation, workers owed money by MJ Harris Group have a chance to get some of what they are owed back through the federal government's Fair Entitlements Guarantee scheme.\n\nBut for suppliers and clients, the prospects are far less positive.\n\nThe clients the ABC spoke to expressed frustration at a slow legal system where it is hard to enforce orders made against the likes of Mr Harris and his companies.\n\nTony says his house is now a skeleton of the planned two-storey rear extension. (ABC News: Patrick Rocca)\n\nBuilding law expert Matthew Bell, an associate professor of law at the University of Melbourne, told the ABC there was \"a real access to justice issue when it comes to domestic building work\".\n\nHe said disputes could be very complex and legal costs could quickly mount, raising the question of whether it was \"worth it to throw good money after bad\".\n\n\"Building a home or renovating a home is one of the biggest investments that we might ever make and yet we often don't have the same level of consumer protection we might have if we're buying a car or for that matter, even buying a toaster,\" he said.\n\nStanding in the ruins of his dream home, Tony told the ABC the money he and his partner paid to MJ Harris Group was gone for good.\n\n\"At this point in time, we're not expecting to see any of our money back. We'd be really hopeful to see even five or 10 cents in the dollar.\"\n\n* Names have been changed.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/data-breach-northern-rivers-resilient-homes-program-chatgpt/105855284",
    "title": "Major data breach as up to 3,000 flood victims' details loaded to ChatGPT",
    "publish_date": "Sun, 05 Oct 2025 23:41:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "A major data breach has exposed the private information of up to 3,000 northern NSW residents affected by the 2022 floods.\n\nThe NSW Reconstruction Authority (RA) said in a statement the breach occurred in March and involved more than 12,000 rows of data in a spreadsheet from the Northern Rivers Resilient Homes Program.\n\n\"Personal information was uploaded by a former contractor of the RA to the artificial intelligence platform ChatGPT,\" an RA spokesperson said.\n\nThe statement said once the full scope of the breach was understood, the RA took steps to contain the risk and began working with Cyber Security NSW and forensic analysts.\n\n\"We are undertaking detailed investigations to understand what was shared, what the risks are and who from the program is impacted,\" the statement read.\n\nThe Northern Rivers Resiliant Homes program assists residents affected by flooding by buying back homes in areas with high flood risk, or making homes more resilient to future floods.\n\nHome buybacks have been underway since flooding hit the Northern Rivers region of NSW in 2022. (ABC North Coast: Bronwyn Herbert)\n\nThe breach shared the names and addresses of program applicants, as well as email addresses, phone numbers, and other personal and health information.\n\n\"There is no evidence that any information has been made public, however this cannot be ruled out,\" the statement said.\n\n\"The process is highly complex and time-consuming and we acknowledge that it has taken time to notify people. Our focus has been on making sure we have all the information we need to notify every impacted person correctly.\"\n\n'Really sensitive data'\n\nHarper Dalton-Earls's South Lismore home was bought as part of the Resilient Homes Program after it was flooded in 2022.\n\nHarper Dalton-Earls has received a buyback from the Resilient Homes Program. (ABC North Coast: Bruce MacKenzie)\n\nMr Dalton-Earls said he had to supply a \"mountain of data\" during the application process, and it was not yet clear if that information had been made public.\n\n\"I feel concerned — the information with the RA was deeply personal,\" he said.\n\n\"There's just so much information that you need to give as part of that program, which is fair and reasonable to ensure it's equitable.\n\n\"But at the same time, there is some really sensitive data on those systems that could be breached.\n\n\"People really gave their whole lives — whether it's financial records, insurance records, experiences of deeply traumatic times, so all of that would be concerning for everybody … and for the RA, in terms of how they manage this type of security breach moving forward.\"\n\nThe breach may have impacted up to 3,000 people from the NSW Northern Rivers. (ABC News: Emma Rennie)\n\nMinister 'really sorry'\n\nNSW Minister for Recovery and Lismore MP Janelle Saffin said she received a preliminary report about the breach in July, and the final report on Friday.\n\nMs Saffin said she had asked the RA to review and report on the situation and the department's processes, including its timeliness.\n\n\"I would prefer [for the RA] to advise people sooner, and I'm also informed they couldn't identify everybody, but I need to see the report first,\" she said.\n\n\" This is our community, my community, so I'm really sorry. \"\n\nMs Saffin said the situation was \"being treated with care and consideration\".\n\nThe RA said it would contact people this week with updates about how they had been affected and the support available.",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/ange-postecoglou-defiant-after-another-loss/105856146",
    "title": "'I've picked fights': Defiant Postecoglou hits out after another Forest loss",
    "publish_date": "Sun, 05 Oct 2025 23:25:26 +0000",
    "category": "sports",
    "authors": [],
    "text": "Ange Postecoglou knows his future at Nottingham Forest is in the balance after yet another defeat in his brief but troubled tenure — but he swears he is up for the fight.\n\nForest didn't play too badly at St James' Park on Monday morning (AEST) but the 2-0 loss to Newcastle — a fifth defeat in seven winless games for the Australian boss in a luckless four-week reign — only makes his position even more precarious.\n\nYet Postecoglou was, as ever, adopting a defiant face as he declared he was relishing the challenge of extricating Forest from their predicament.\n\nHe even referred back to distant memories of his very first managerial job in Australia to explain his love for a scrap, talking about when he took the reins of Western Suburbs in Melbourne.\n\n\"I started in Australia when I was 32-years-old in semi-professional football and I'm here in the Premier League at the age of 60. Do you reckon I lack self-belief or don't like a fight?\" Postecoglou told reporters in a passionate post-match address.\n\n\"I didn't get here because of my connections. In fact, I've picked fights. I have, even in the schoolyard, I've picked fights with people who I knew would beat me up. That's the kind of person I am, so that's fine.\n\n\"If people want to make an assessment of me after three-and-a-half weeks in which I've had six or seven games, there's nothing I can do about that.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"But at the same time, there's nothing wrong with things being tough. That's OK. I'll say it a million times, I did have an option. I could have been sitting on the couch watching the game today, and not be in the middle of it.\n\n\"I love a fight. So it's a fight? So it's a struggle? So what? That's OK. Now, if people outside don't think I'm the right person, or even internally don't think I am, it makes no difference for me.\"\n\nPostecoglou now goes into an international break, and said he \"expects\" to be talking to owner Evangelos Marinakis about \"what we have embarked on here, where we are at and what we are going to do\" following the worst start by any new Forest manager in a century.\n\n\"The results will come,\" he insisted after Newcastle had won through second-half goals from Bruno Guimaraes and Nick Woltemade just three days after Forest's damaging Europa League home defeat against Danish side Midtjylland.\n\n\"In the meantime, it is a struggle and a fight and there is nothing wrong with that. We don't want things handed on plate we have to fight for it, I have fought for things all my life,\" Postecoglou said.\n\n\"I don't get why people think it is a burden but I love a challenge. What I have seen and felt in this period is that we are heading in the direction I want us to.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/red-dust-revival-vintage-car-race-lake-perkolilli-kalgoorlie/105852018",
    "title": "One of Australia's oldest motor racing tracks roars back to life",
    "publish_date": "Sun, 05 Oct 2025 22:00:23 +0000",
    "category": "sports",
    "authors": [],
    "text": "A claypan in outback Western Australia, where red dust covers everything it touches, is perhaps the last place you would expect to find a classic car which until now had been kept in pristine condition.\n\nBut the bright red 1927 Austin 7 was unleashed this week, like so many other vintage cars from around Australia, as one of the country's oldest race tracks roared back to life.\n\nNearly 200 vintage cars and motorcycles made the journey to Lake Perkolilli, on the outskirts of Kalgoorlie-Boulder in WA's Goldfields, to race on the hard claypan surface.\n\nMurray Wood and his daughter Casey with a 1927 Austin 7 at the Red Dust Revival. (ABC Goldfields: Jarrod Lucas)\n\nAmong the car lovers were Kalgoorlie's Casey Wood and her father Murray, who purchased a 1934 Austin for the occasion.\n\nMs Wood was not content to simply be a passenger and borrowed her wheels from a close family friend, classic car collector Geoff Paynter.\n\n\"He's lent it to me to take it out for a spin,\" she said.\n\n\"Initially, Dad was terrified about it. It's been sitting in a shed for 15 years, and he's like: 'I don't want to chip it or dirty it up'.\n\n\"[Geoff's] response was 'Drive it like you stole it, just enjoy it, enjoy the track and have fun,' that's all he cared about.\"\n\nA race car at Lake Perkolilli claypan racetrack in 1928. (Supplied: WA Museum)\n\nRed Dust Revival lives up to name\n\nKnown as the Red Dust Revival, the week-long event was held in 2019 and 2022, re-enacting races held at Lake Perkolilli more than a century ago.\n\nBetween 1914 and 1939, races were held on the lake's hard, smooth surface with drivers reaching speeds of 200 kilometres an hour in a time before quality roads were built.\n\n\"I love it, it's good memory-making,\" Ms Wood said, pointing to the car's bonnet where \"MAKING MEMORIES 2025\" was written in dust.\n\n\"My dad has been coming out here since even before I was born, so I've grown up here ... this is where I learnt to ride my bike.\n\n\" It's grown into something quite extraordinary. \"\n\nRed dust creates a canvas on the bonnet of a 1927 Austin 7. (ABC Goldfields: Jarrod Lucas)\n\nMurray Wood's involvement dates back to the late 1990s when a small number of vintage car lovers made the journey.\n\n\"To feel the need for speed, just to be a part of history, that's what all these race drivers are doing,\" he said.\n\n\"Selfishly, I wanted my daughter to be part of that history, too. She's the youngest ever female to be racing at a Lake Perkolilli event.\"\n\nThis year's Red Dust Revival attracted about 130 vintage cars and 50 motorcycles. (ABC Goldfields: Jarrod Lucas)\n\nThe family theme runs through the event.\n\nFremantle mechanic Daryl Cook, whose father was born in Kalgoorlie, restored a 1939 AJS motorcycle for his wife to ride at Lake Perkolilli.\n\n\"Dad used to come out here on weekends with his mates and yahoo buckaroo on the lake,\" he said.\n\n\"The intention was to bring him out here, but he's 85 now and wasn't well enough, so it's a tribute to him.\"\n\nDaryl Cook and his wife Liselle Carroll restored a 1939 AJS motorcycle for the event. (ABC Goldfields: Jarrod Lucas)\n\nRestoration projects took years\n\nBunbury's Peter Harold, 77, spent more than two years building a replica of a 1925 Chrysler which raced at the world-famous Le Mans endurance race in France.\n\n\"I got it as a timber frame on a chassis and built it up from there,\" he said.\n\n\"We only had photographs to go by ... and we've even tracked down badges of the original agent for Chrysler in France.\"\n\nThe car was painted white for the Red Dust Revival and included a number of original features, including a lap counter.\n\nPeter Harold spent more than two years building a replica 1925 Chrysler. (ABC Goldfields: Jarrod Lucas)\n\nWith the dust now settled and racing complete, it will need more than just a fresh coat of paint after a close call at Lake Perkolilli.\n\n\"In the dust you can't see where you are and I drifted off the track,\" he said.\n\n\"I hit a huge big bump, which spun the back of the car around and I ended up sliding down the track sideways.\n\n\"I managed to straighten it back up but was off the track and went over quite a few shrubs, and broke a few things on the car ... quite a scary moment.\"\n\nPeter Harold inspects some of the damage after drifting off the track at Lake Perkolilli. (ABC Goldfields: Jarrod Lucas)\n\nMotor racing history preserved\n\nEvent founder and vintage car collector Graeme Cocks said the Red Dust Revival was keeping motor racing history alive.\n\n\"This is the only place in the world that you can see pre-war cars and motorcycles racing on an original track from 1914,\" he said.\n\n\" The track is still the same. It's still a red dirt claypan, same as it was when they first came out here for a picnic. \"\n\nHe said the effort put into restoring the vintage cars and motorcycles was astonishing.\n\n\"What gives me the most pleasure is seeing old chassis and wrecks pulled off farms or out of tips and then people spend years rebuilding them and finding engines to put on them,\" he said.\n\nGraeme Cocks has watched the event grow in popularity over the years. (ABC Goldfields: Jarrod Lucas)\n\n\"You look down the pits and most of these cars wouldn't be running if it wasn't for this event ... there would be no motivation to spend money and get them running.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/mount-everest-rescue-hundreds-of-trekkers-escape-snowstorm/105855262",
    "title": "Mount Everest rescue underway as blizzard traps hundreds of trekkers",
    "publish_date": "Sun, 05 Oct 2025 21:40:01 +0000",
    "category": "sports",
    "authors": [],
    "text": "A rescue effort is underway after a snowstorm trapped hundreds of people on Mount Everest in Tibet.\n\nHundreds of local villagers and rescue teams had been deployed to trekkers stranded near the eastern face of the world's highest peak, Chinese state media reported on Sunday, local time, as unusually heavy snow and rainfall pummelled the Himalayas.\n\nAs of Sunday, 350 trekkers had reached the small township of Qudang, while contact with the an additional 200-plus trekkers had been made, CCTV reported.\n\nIt is unclear exactly how many trekkers remain trapped.\n\nIn one video, taken on Sunday, a line of hikers can be seen wading through snow in poor visibility. (Reuters: Geshuang Chen)\n\nVisitors to the remote valley of Karma, which leads to the eastern Kangshung face of Mount Everest, were in the hundreds this week, taking advantage of an eight-day National Day holiday in China.\n\n\"It was so wet and cold in the mountains, and hypothermia was a real risk,\" said Chen Geshuang, who was part of an 18-strong trekking team that made it to Qudang.\n\n\" The weather this year is not normal. The guide said he had never encountered such weather in October. And it happened all too suddenly. \"\n\nIn one video, taken on Sunday, a line of hikers can be seen wading through snow in poor visibility.\n\nVillagers greet trekkers with meal\n\nSnowfall in the valley, which lies at an elevation averaging 4,200 metres, began on Friday evening and persisted throughout Saturday.\n\nMs Chen's party descended from the mountains on Sunday and was greeted by villagers after enduring a harrowing evening of heavy snowfall combined with thunder and lightning.\n\nWith tears in her eyes, Ms Chen accepted their offers of sweet tea and the promise of warmth, she said.\n\n\"Back in the village, we had a meal and were finally warm,\" Ms Chen said.\n\nA photo of the summit of Mount Everest in May. (AP: Pasang Rinzee Sherpa)\n\nThe CCTV report did not say if all local guides and support staff of the trekking parties had been accounted for. It was also unclear if trekkers near the north face of Mount Everest, also in Tibet, had been affected or not.\n\nThe north face of Mount Everest, due to its easy access by paved road, regularly draws large numbers of tourists.\n\nOctober is a peak season, when skies usually clear at the end of the Indian monsoon.\n\nTicket sales and entry to the entire Everest Scenic Area were suspended from late Saturday, according to notices on the official WeChat accounts of the local Tingri County Tourism Company.\n\nTo the south of Tibet in Nepal, heavy rains triggered landslides and flash floods that blocked roads, washed away bridges and have killed at least 47 people since Friday.\n\nThirty-five people died in separate landslides in the eastern Ilam district bordering India.\n\nNine people were reported missing after being swept away by floodwaters, and three others were killed in lightning strikes elsewhere in the country.\n\nReuters",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/afl-trade-period-day-one-live-updates-merrett-curnow-petracca/105853514",
    "title": "Live: Bombers put their foot down in Zach Merrett trade saga",
    "publish_date": "Sun, 05 Oct 2025 21:28:04 +0000",
    "category": "sports",
    "authors": [
      "Chris De Silva",
      "Dean Bilton"
    ],
    "text": "Craig Cameron from the Suns speaking very candidly on all things Gold Coast.\n\nHere's what he had to say on Bailey Humphrey.\n\n\"Damien [Hardwick] has, and we've made it really clear that we're not trading him,\" he says.\n\nCameron then gets asked whether he thinks Humphrey wants to be at the club and pauses like he's been asked which of his children he loves the most.\n\n\"It's a difficult question. I don't think so, I think he likes our football club, but we saw things on Friday that made us scratch our head.\"\n\nMUY INTERESANTE!\n\nHe says the Suns have had \"preliminary discussions\" with the Demons over Christian Petracca.\n\nSome interesting stuff from Cameron on the Suns' interest in Jamarra Ugle-Hagan as well. He's yet to have a medical, so still a fair bit of water to go under that bridge.\n\nCameron says there are \"a number of things we'd like to investigate\" about Ugle-Hagan.\n\n\"We're considering it because he's a phenomenal talent,\" he says.\n\n\"He's got to make a commitment to get himself right to play football, and we're not blind to that.\"\n\nThe Suns are also expecting Brayden Fiorini to make a call on his next club today.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/taxpayer-dollars-leak-offshore-amid-griffin-coal-failure/105846232",
    "title": "Indian backer of embattled WA coal mine handed money from taxpayers",
    "publish_date": "Sun, 05 Oct 2025 21:17:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "An Indian company that is the most senior lender to an embattled West Australian coal mine is receiving money from taxpayers, despite state government assurances it would not allow a bailout package to leak offshore.\n\nSindhu Trade Links, a little-known conglomerate based near the Indian capital of Delhi, became the highest-ranked creditor to Griffin Coal when it loaned the struggling miner $US60 million ($90 million) in 2015 through its Australian arm, Oceania Resources.\n\nGriffin is one of only two WA coal miners and it supplies the 434MW Bluewaters power plant, which generates about 10 per cent of the power used in the state's main grid.\n\nThe Bluewaters power plant is Griffin Coal's biggest customer. (Supplied: Sumitomo)\n\nHowever, Griffin fell into receivership in September 2022 as it buckled under the weight of mounting losses and crippling debts of about $1.5 billion.\n\nMost of that debt is owed to India's biggest privately owned bank, ICICI.\n\n'Baffling' loan\n\nYet in a move that was described as baffling by observers at the time, ICICI provided the money that Sindhu loaned to Griffin.\n\nIn doing so, ICICI subordinated its own much larger claim.\n\nAmid the messy fallout from Griffin's failure, which threatened to take down the grid, WA Premier Roger Cook threw the coal producer a $220 million lifeline in late 2023.\n\nThe WA government said it had paid $14.8 million to the ICICI Bank, to which Griffin Coal owes most of its $1.5 billion debt. (ABC News: Daniel Mercer)\n\nAt the time, the government insisted the money would not be used to pay down the debts owed to Indian creditors including ICICI and Sindhu.\n\n\"The grant funding is designed to help stabilise Griffin's Collie operations and provide certainty to the local workforce,\" a government spokesman said at the time.\n\n\"There are agreed parameters to the funding, which do not include debt repayments.\"\n\nWA coal phaseout in limbo Photo shows Transformers at a power substation. Efforts by WA's government to force the premature closure of a privately owned coal plant appear to be unravelling after the market operator backed the power station to keep running towards the end of the decade.\n\nDespite this pledge, financial reporting in India shows Sindhu Trade Links has been receiving regular payments linked to coal production at Griffin, slashing the amount it is owed by a quarter.\n\nAccording to a report from India Ratings & Research, a subsidiary of global ratings giant Fitch, Sindhu — through Oceania — is collecting about $US1 million ($1.5 million) a month under an arrangement with Griffin and \"involved parties\".\n\n\"[India Ratings & Research] expects the principal outstanding to further reduce to $USD30 million-35 million by June 2026, as per the arrangement,\" the ratings agency reported.\n\nThanks in part to the payments being made to Sindhu, India Ratings & Research lifted Sindhu's credit score from so-called junk status — which implies the company is at a high risk of failure — to an investable grade.\n\nThe Griffin Coal mine fell into receivership in 2022. (ABC News: Gian De Poloni)\n\n'Hush money' claim\n\nBack in Western Australia, the government appeared to confirm payments were being made to \"secured creditors\".\n\nIn parliament, it was revealed the government had so far paid $14.8 million to \"ICICI Bank Limited as the agent for the secured creditors\".\n\nBut the state also distanced itself from the ultimate use of the money, saying it was \"not a party to the distribution of payments between the creditors\".\n\nThe state government has committed to subsidising Griffin's operations until the end of June next year. (ABC News: Hugh Sando)\n\nRevelations about the payments come as the clock ticks down on the government's stated deadline for its support of Griffin.\n\nUnder the deal, the state has committed to subsidising Griffin's operations until the end of June next year.\n\nIt originally said the bailout would cost $220 million — a figure which has since blown out to $308 million.\n\nShadow energy minister Steve Thomas labelled the creditor payments \"hush money\", saying the government was using taxpayers' cash to keep creditors onside.\n\nSteve Thomas questioned why taxpayer money was being used to offset the losses of foreign bankers. (ABC News: James Carmody)\n\nDr Thomas said the payments were likely to total more than $30 million by next June — almost 10 per cent of the total bailout package.\n\n\"The secured creditors of Griffin are going to receive about $30 million out of the $308 million that taxpayers are pouring into the black hole that is Griffin Coal,\" Dr Thomas said.\n\nMining and Energy Union WA secretary Greg Busson was more sympathetic.\n\nHe said Griffin was still an integral part of the state's economy and grid, supplying both Bluewaters and a giant alumina refinery owned by South 32, as well as industrial companies such as cement makers.\n\nGreg Busson is more sympathetic to the state government's predicament. (ABC South West: Jonathon Daly)\n\nUntil other, viable options arrived, propping it up would be a \"nasty\" reality, he said.\n\n\"We need security of supply so their hands were tied,\" Mr Busson said.\n\n\"It is the price of keeping lights on and making sure that we've got consistent, good quality ... base load power.\"\n\nThe state government declined to answer questions about the creditor payments.\n\nAccording to Mr Busson, the need for Griffin would extend beyond the government's self-imposed deadline for a commercial solution of next June.\n\nTo that end, he noted the market operator's decision last week to bank on Bluewaters's availability beyond 2027.\n\nMr Busson says Griffin is still an important part of WA's energy grid. (ABC News: Andrew O'Connor)\n\nGiven the state's vow to close down its own two remaining coal-fired power stations by 2029, he argued it was obvious that Western Australia's two coal mines would have to merge.\n\nTroubled WA coal mine falls $800m further into debt Photo shows Two men stand in front of a haul truck at Griffin Coal Mine in Collie, WA. A key foreign-owned WA coal mine slides almost a billion dollars further into debt, despite the state government pouring hundreds of millions of dollars into the insolvent company.\n\nDr Thomas doubted the government would be able to extricate itself from the situation.\n\n\"That means that $308 million is not the end of the subsidy from the state government,\" Dr Thomas said.\n\n\"They'll be putting their hand back into taxpayers' pockets for more money, or the energy grid is going to start to struggle.\"\n\nUltimately, Dr Thomas questioned why taxpayer money was being used to offset the losses made by foreign bankers — investors who had made terrible bets.\n\n\"If Griffin Coal was profitable, then these companies could quite rightly expect to get a dividend out of it,\" he said.\n\n\"When Griffin Coal continues to lose $7 million a month and it is propped up by the taxpayer, I don't think the investors should be receiving a dividend.\n\n\"But they are.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/outback-wa-retailers-worried-about-centrepay-reforms/105844344",
    "title": "'Risk of losing lots of money': Outback stores slam Centrepay changes",
    "publish_date": "Sun, 05 Oct 2025 21:01:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Retailers and small businesses in northern Australia have expressed alarm over major changes to a debt repayment system coming into effect next month.\n\nCentrepay is a federal government system used by about 500,000 social security recipients to incrementally pay for goods and services such as furniture, food, utilities or clothes.\n\nKimberley-based retailer Brett Perkins said Centrepay worked well because \"it deters humbug\".\n\nThe term refers to people in the Kimberley and Northern Territory being pestered by family to hand over their welfare payments.\n\n\"The cash is actually going into their bank account and they choose to debit it into the supermarket or the furniture shop,\" Mr Perkins said.\n\n\"That money sits in their account for their use only and it really helps when it comes to the humbug situation.\"\n\nPosters in some shops in northern Australia warn of the issues with 'humbug'. (ABC News: Ted O'Connor)\n\nTwo of Mr Perkins's businesses are in the Kimberley town of Derby and will no longer be eligible to use Centrepay from November 3, when a raft of reforms begin, sparked by financial scandals.\n\nHe said between 10 and 20 per cent of customers at his independent supermarket and general store used the money management system.\n\nHousehold goods, sports equipment, furniture, vehicle registration, church donations, funeral plans and in some cases food, are among the items that will no longer be allowed to be bought using Centrepay.\n\nCustomers will still be able to buy food using the scheme at remote Aboriginal community stores — but not other goods sold at the same shop.\n\nFood sold at remote Aboriginal community stores can be bought using Centrepay, but not other items in the same shop. (ABC News: Steven Schubert)\n\nServices Australia customer engagement officer Justin Bott said the changes were being implemented due to financial scandals.\n\n\"We were concerned that when customers were put into ongoing contracts or fee structures they paid more than they needed to, or were put at a disadvantage\" he said.\n\n\"The purpose is to bring Centrepay back to its original goal of providing an ongoing budgeting tool for some services.\"\n\nMr Bott said it was up to businesses to inform clients of the changes rather than Services Australia.\n\nUsing Centrepay for accommodation and utilities is unchanged, while other categories have new low repayment limits while clients pay it off.\n\nMr Perkins, who has been in retail in the Kimberley for 17 years, lobbied for exemptions for food, fridges, washing machines, air conditioners and beds during Services Australia's public consultation period.\n\n\"It's sad that they're taking away the essential goods,\" he said.\n\n\"The sad reality that Canberra doesn't understand the humbug situations in our towns and is making these decisions for the north west and across the Top End.\"\n\nServices Australia says 250 businesses out of 11,000 will be impacted by the reforms. (ABC Kimberley: Vanessa Mills)\n\nHe was critical of the lack of money management support for Services Australia clients and the lack of information about the changes.\n\nHe said it could lead to \"trouble at the till\".\n\n\"The target market that are using Centrepay have no other option and [many] regional and remote areas don't have banks,\" he said.\n\nSmall business in country towns like Derby, are vulnerable to economic downturns. (ABC Kimberley)\n\nFears 'pets might die'\n\nVeterinarian Dr Kelsey Fyffe has already incurred debts of $35,000 from clients unable to pay up-front for pet care in the past two months.\n\nDr Fyffe said 50 per cent of clients at her clinic in Tennant Creek, in the Northern Territory, relied on Centrepay to help manage their vet bills.\n\nDr Kelsey Fyffe says while Centrepay helps many clients manage vet fees, the repayment system leaves her out of pocket. (Supplied: Dr Kelsey Fyffe)\n\nShe has worked at the clinic for six years and took over ownership two months ago, triggering the \"new business\" clause under reforms already implemented.\n\nVet fees remain on the Centrepay scheme but repayments are reduced to $50 a fortnight maximum, meaning a debt could potentially last years.\n\n\"My options are that I don't provide the service because the clients will be unable or unwilling to pay — therefore I'm rejecting treatment of patients that potentially have life-threatening conditions,\" Dr Fyffe said.\n\n\"Alternatively, I provide the treatment … at my own cost and I risk that my business never recoups the costs.\n\n\" You run the risk of losing huge amounts of money. \"\n\nVet fees will be reduced to a maximum repayment of $50 a fortnight under the reforms. (ABC Kimberley: Vanessa Mills)\n\nDr Fyffe feared pets could die because people would be reluctant to seek help.\n\n\"I try and get them to pay a deposit to at least cover a consultation fee so at least I've got something to pay my debts, wages,\" she said.\n\n\"Pet health isn't governed by what [owners] are allowed to put on their Centrepay.\"\n\nThe full list of changes is available through the Services Australia website.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/ben-hunt-wins-nrl-grand-final-with-brisbane-broncos/105854350",
    "title": "'We got it done for him': NRL's oldest player Ben Hunt finally tastes premiership victory",
    "publish_date": "Sun, 05 Oct 2025 20:34:09 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Broncos are a TikTok team and Reece Walsh is the tip of that spear.\n\nHe reaches out to the next generation of fans as much with his piercing eyes and painted nails as he does with his scintillating play.\n\nBut, even as footy games at Lang Park turn into a social occasion for Brisbane's Gen Z crowd, a gravel-voiced 35-year-old father of two is still a welcome presence at the late-night and arvo hangs.\n\nFor most of them, Ben Hunt is of another time. He is the oldest player in the entire league, the man in the NRL who played in the first decade of the 2000s, and the last Bronco who played with Darren Lockyer.\n\nBut they love him. Some of them have ridden the highs and lows of his long career before they were even teammates.\n\n\"I didn't get to play with him the first time he was here. But I remember being a young kid and watching 2015 and I cried myself. I felt for Benny so much,\" centre Kotoni Staggs said.\n\n\"As soon as I heard he was coming back and the talent we had in this team, I knew we could give him something he was missing and we got it done for him.\"\n\nHunt has been around so long, his former teammates — like Ben Te'o — are now his coaches. (AAP: Dan Himbrechts)\n\nEven if he was well and truly done in by a head knock before the party wrapped up on Sunday night, the joy felt by Broncos fans and teammates was directed in Hunt's direction as much as any other.\n\nAfter he returned to the sidelines from his HIA, there were only a few minutes left, but after all this time he didn't care how it happened. He is the most capped first-time premiership winner ever, so that means he has waited longer than anyone.\n\n\"It was a long bloody three minutes,\" Hunt said.\n\n\"When the siren went it hit me like a tonne of bricks. It really knocked me around.\n\n\"There was definitely times you think it's never gonna come. I didn't think I'd have the opportunity to come back to this great club.\"\n\nHunt (centre) could not finish the game after a nasty head knock. (AAP: Dan Himbrechts)\n\nHunt was once a junior superstar like Walsh and that's how Lockyer first came to know him.\n\n\"He was from Rocky and he loved a rum and Coke, but he was a competitor. In the under-20s he was a stand-out, so there was a lot of talk about Ben Hunt coming through,\" Lockyer said.\n\n\"He was a character, and he reminded me a bit of Alf [Allan Langer] — he's a larrikin and a joker, loves a beer, but once he gets on the field he just competes.\"\n\nThe blood and gold of Brisbane's premiership win Photo shows Two men celebrate after scoring a try The Brisbane Broncos are flash and have never made apologies for it but as the dust settles on their premiership win they've also proven they have the true steel of champions.\n\nIn 2015 he played the Walsh role as the Broncos' best player on the field, and we all know how that turned out.\n\nIt was so scarring he eventually felt the need to move away from the club and city and state he loves. Hunt said he lost count of the sleepless nights.\n\nSo this time, 10 years later and back in his home colours, although he would have rather not suffered a brain injury that left him staggering uneasily and forced him from the field early, Hunt was enjoying it for what it was, even if he couldn't set foot on the park until after the siren.\n\nHunt has come a long way from the prodigy who came through the Broncos in the late 2000's. (Getty Images: Matt King )\n\n\"I've dreamt of it the last 10 years, I really have. It's taken 350-plus games but it's all worth it, it really is,\" Hunt said.\n\n\"The family, the friends and the coaches who have put the time into me over the years, it's a little bit of repayment for them.\n\n\"I don't know if it's a weight off my shoulders, but it's OK for me to talk about 2015 now because we've won a grand final now.\"\n\nIt's no coincidence that Hunt and fellow injured half Adam Reynolds were the last Broncos to leave the field on Sunday night, only making their way into the sheds once the groundstaff emerged with rakes and leaf blowers to clean up the confetti.\n\nEventually he made it back to the locker room, and Maguire said he was simply beaming with a grin from ear to ear.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nBoth he and Reynolds are contracted through 2026, but both could safely ride off into the sunset with this inspirational premiership tucked under their arm.\n\nBut this Broncos team is young and still maybe a little reckless.\n\nAs much as they shone outside of and without their two veteran halves in the final stages of the grand final, it may be easy to forget that it was those old hands (or indeed feet) that booted them onto this stage.\n\nNo matter what the future holds, Hunt is now a 350-game, premiership-winning NRL player. And no-one, not even the most jaded Storm or even Dragons fan, would begrudge him that.\n\n\"Maybe last year, he might think he'd never get the chance to right the wrongs of 2015 but everything in life happens for a reason,\" Lockyer said.\n\n\"It was meant to be, for him to come and have this opportunity.\n\n\"I'm so happy for him. I think everyone is happy for him because he's had to deal with shit for a long time.\n\n\"I get so much joy seeing what this does for the fans, but also for blokes like him. He's gotten what he deserved.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-06/victoria-council-insurance-costs-volunteer-groups/105773254",
    "title": "Volunteer groups told to cover insurance costs on Crown land",
    "publish_date": "Sun, 05 Oct 2025 20:30:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "Volunteer-run committees in Victoria's far east will be forced to pay thousands of dollars or forego insurance on their buildings after a council decided to stop paying for their coverage.\n\nThe decision affects 43 groups in the East Gippsland Shire that manage assets on Crown land, including sports clubs, public toilets and community hall committees.\n\nThe council stopped paying for the groups' insurance on July 1, which was expected to save $57,000 a year.\n\nVictorian councils have been complaining that they are being asked to pay for services previously covered by other levels of government.\n\nThe Lindenow South Football Netball Club is among the groups that have lost insurance.\n\nClub president Mick Harrington said the decision would hurt the town.\n\n\"We're just a small club trying to make ends meet and trying to give people in the community somewhere to go and this is just another barrier,\" he said.\n\nMr Harrington said he doubted whether cancelling the insurance would save governments much money.\n\n\"What will happen is, eventually when someone's buildings burn down, they're going to approach the shire [or] the state government to rebuild them,\" he said.\n\n\"So it's not going to end up being very much of a saving when they need million-dollar buildings rebuilt.\"\n\nThe Gelantipy Public Hall was established in 1943. (Supplied: Deborah Woodburn)\n\nGelantipy Public Hall at Butchers Ridge served as a community evacuation point during the Black Summer fires.\n\nThe hall committee chair Deborah Woodburn said the volunteers had no choice but to leave the building uninsured.\n\n\"It's devastating,\" she said.\n\n\" I've had a very rough quote for what it would cost us as a single entity to get insurance on our building and contents, and it's around $5,000 to $6,000 and we just won't have the money. \"\n\nThe community has been meeting in the Gelantipy Public Hall for decades. (Supplied: Deborah Woodburn)\n\nState responsibility, council says\n\nEast Gippsland Shire chief executive Fiona Wiegall said the state government was responsible for paying insurance on state buildings.\n\nShe said that was consistent with the Department of Energy, Environment and Climate Action's (DEECA) committees of management guidelines published in April 2024.\n\n\"Why isn't the state insuring these buildings that it's then asking the community to manage?\" Ms Wiegall said.\n\nThe council said it would continue to support committees with grants and maintenance.\n\nDEECA provides several types of insurance for committees, including public liability, but does not provide insurance for assets, including buildings.\n\nA spokesperson said the department was working to support committees and was \"committed to having ongoing discussions on this issue\".\n\nMunicipal Association of Victoria president Jennifer Anderson said councils were being forced to make tough decisions amid increasing financial pressure.\n\n\"Unfortunately there are increasing costs to council due to the things that the state government is asking councils to do,\" she said.\n\n\"So, things like maternal child health, school crossing supervisors — there's quite a lot of examples where council is paying more than the state government is contributing.\n\n\"There's only ever so much money to go around, so they have to prioritise and look at what they can afford and what they can't afford on behalf of their community.\"\n\nChris Eddy hosts a podcast about local government. (Supplied: Chris Eddy)\n\nFormer council chief executive Chris Eddy asked why ratepayers should pay to insure assets they do not own, such as roads.\n\n\"Councils are more and more looking at whether they can continue to meet those costs when really they've been picking them up on behalf of the state for many years,\" he said.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/afl/afl-trade-period-live-updates-petracca-curnow-merrett-in-the-spotlight-on-day-one-20251005-p5n07r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL trade period LIVE updates: Suitors emerge for Oliver; Essendon will not entertain trading Merrett",
    "publish_date": "Mon, 06 Oct 2025 12:49:03 +1100",
    "category": "sports",
    "authors": [
      "Hannah Kennelly"
    ],
    "text": "Saints’ talent and acquisition boss Graeme Allan said he had not told his own list boss Steve Silvagni that the Saints were pursuing Silvagni’s son, Jack, at Carlton.\n\nJack Silvagni joined the Saints as an unrestricted free agent on a good enough deal to give the Blues an end of first round pick as compensation. Credit: St Kilda Football Club\n\nJack Silvagni, who emerged as a solid defender this year before he was hurt, joined the Saints as an unrestricted free agent.\n\n“I didn’t tell his dad. We are great mates but I didn’t tell him, so he was shocked. He was shocked. He was. Then it was Ross [Lyon] who came over the top. When Ross comes over the top, get out of the way,” Allan said.\n\nAllan said the Saints would be aggressive again next year in their hunt for more high-priced talent, declaring they still had plenty of room under the salary cap.\n\nLoading\n\nThe Saints have recently signed Carlton ruckman Tom De Koning on a long-term $12 million deal, while star midfielder Nasiah Wanganeen-Milera has become the league’s first $2 million-a-season man.\n\nThe Saints have also secured other talent, and are now looking to snare Sam Flanders from the Gold Coast.\n\n“Not a problem. We’ll go hunting again next year,” Allan said when asked how the Saints would fit their recruits under the cap.\n\n“We have plenty of money.”\n\nAllan said the Saints had barely paid 95 per cent of the salary cap this season – the minimum league requirement.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/lifestyle/neighbour-feud-sparks-over-late-night-cooking-20251006-p5n0ew.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Neighbour feud sparks over late night cooking",
    "publish_date": "Mon, 06 Oct 2025 12:43:42 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Neighbour feud sparks over late night cooking\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/corn-flakes-box-vlandys-slams-r360-competition-20251006-p5n0dv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Corn Flakes box': V'landys slams R360 competition",
    "publish_date": "Mon, 06 Oct 2025 12:12:26 +1100",
    "category": "finance",
    "authors": [],
    "text": "'Corn Flakes box': V'landys slams R360 competition\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/southwell-named-for-first-jillaroos-squad-20251006-p5n0ea.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Southwell named for first Jillaroos squad",
    "publish_date": "Mon, 06 Oct 2025 12:07:41 +1100",
    "category": "finance",
    "authors": [],
    "text": "Southwell named for first Jillaroos squad\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/business/markets/us-shutdown-geopolitical-turbulence-drives-gold-to-record-highs-20251003-p5mzxe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fear factor: Why the world is rushing to buy gold",
    "publish_date": "Mon, 06 Oct 2025 12:00:52 +1100",
    "category": "finance",
    "authors": [
      "Elias Visontay"
    ],
    "text": "The price of gold has continued its climb to record heights, and Australians investors are jumping on board, as the US government shutdown becomes the latest element of economic uncertainty pushing investors to seek safety in the precious metal.\n\nAt the end of last week, bullion was trading at $US3886 ($5886) per ounce, after a stand-off over funding in the US Senate triggered a shutdown that sent gold’s spot price to its record high of $US3897 on Thursday. It marks eight weeks of gains for the commodity, beginning its run from a price of $US3290 at the end of July.\n\nGold is trading at more than US$3800, which has never been seen before. Credit: Getty\n\nA range of factors has been driving the surge in the gold value, said Shane Oliver, chief economist and head of investment strategy at AMP.\n\nOne thing at play is that central banks have been increasing their gold holdings recently, “fearful that if they have US dollars, it could work against them”, said Oliver. In particular, BRICS countries – Brazil, Russia, India, China, South Africa, Egypt, Ethiopia, Indonesia, Iran and the United Arab Emirates – have reduced their reserves of US dollars.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/property/news/paddington-family-s-mostly-vacant-guest-house-sells-for-3m-at-auction-20251006-p5n0b7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Paddington family’s mostly vacant guest house sells for $3m at auction",
    "publish_date": "Mon, 06 Oct 2025 11:59:21 +1100",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "A three-bedroom terrace that was kept by a nearby Paddington family – originally from France – for their guests to stay in when visiting Sydney sold for $3,075,000 at auction on Saturday.\n\nGuided at $2.6 million, the home at 4 Queen Road was part of a deceased estate and was offered to market for the first time in 40 years. In this time, the terrace was not leased out or lived in but kept vacant for guests visiting the owners who lived around the corner.\n\nThe property sold for $375,000 above its $2.7 million reserve. There is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.\n\nEight registered, and seven actively bid for the charming and livable residence without parking. Interest came from young families upsizing from apartments, along with a few downsizers and older parents looking to purchase for their adult children.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/nrl-around-the-clubs-october-20251006-p5n0cw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Walsh free to play, a punching ban and facial fractures - the grand final fallout",
    "publish_date": "Mon, 06 Oct 2025 11:59:17 +1100",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "Clive Churchill medallist Reece Walsh will be free to make his Kangaroos debut after dodging a grand final ban.\n\nWalsh’s post-decider relief came as Roosters NRLW back-rower Aliyah Nasio was referred directly to the judiciary for striking following a brawl that saw her and Broncos star Julia Robinson trade punches shortly after full-time.\n\nWalsh can avoid a two-game ban for his first-half high shot on Xavier Coates - which was deemed a grade 1 careless high tackle given the Storm winger was falling into contact - with a $3000 fine and an early guilty plea.\n\nThe Broncos No.1 was named in Australia’s Ashes touring party on Monday and is expected to pip Dylan Edwards as the Kangaroos first-choice fullback.",
    "source": "SMH",
    "cluster_id": 7
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/trump-s-15-billion-band-aid-for-the-problem-he-created-20251006-p5n0ao.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump’s $15 billion Band-Aid for the problem he created",
    "publish_date": "Mon, 06 Oct 2025 11:58:42 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "US soybean farmers are in the midst of harvesting what is likely to be a near-record crop. Thanks to Donald Trump’s trade wars, much of it may be unsold.\n\nSuch are the straits the farmers find themselves in that US Treasury Secretary Scott Bessent – who himself produces soybeans, among other agricultural products – has foreshadowed a $US10 billion-plus ($15 billion-plus) rescue package, perhaps as early as this week, for farmers who have seen demand for their soybeans dive even as their costs have been inflated by US tariffs on fertilisers and tariff-induced price increases for farm machinery.\n\nUS President Donald Trump’s trade war is affecting farmers in the Midwestern states, which tended to be strongly supportive of him and his other policies. Credit: AP\n\nThe US soybean farmers are expected to produce about 4.3 billion bushels in the harvesting season now under way. Their problem is not their bumper crop, but who is going to buy it.\n\nBefore Trump’s first trade war with China in 2018-19, China, the world’s largest consumer of soybeans, bought about 60 per cent of American exports.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/plumber-out-reece-walsh-starred-on-the-field-that-was-just-the-start-of-it-20251006-p5n0aj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Plumber out’: Reece Walsh starred on the field. That was just the start of it",
    "publish_date": "Mon, 06 Oct 2025 11:49:21 +1100",
    "category": "sports",
    "authors": [
      "Frances Howe"
    ],
    "text": "For 80 minutes, Reece Walsh lit up Accor Stadium in a grand final performance for the ages. A premiership and a Clive Churchill Medal were fitting rewards.\n\nBut that was just the beginning of the night’s antics for the 23-year-old.\n\nMichael Maguire and Reece Walsh savour the taste of victory. Credit: Getty Images\n\nFrom jumping into the crowd, live-streaming from the team bus to drinking from a toilet bowl, here’s a play-by-play of Walsh’s off-field display after the grand final.\n\nFull-time whistle: For a brief moment, Walsh’s legs gave out underneath him as the weight of the moment fell on his shoulders. But it wouldn’t keep him down for long, and the full-back couldn’t stand still long enough to finish an interview on the pitch, yelling “baby, I’ll go get my brothers” before running to his teammates.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/politics/victoria/jacinta-allan-snubs-social-services-event-to-spruik-metro-tunnel-20251006-p5n0cg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jacinta Allan snubs social services event to spruik Metro Tunnel",
    "publish_date": "Mon, 06 Oct 2025 11:41:05 +1100",
    "category": "finance",
    "authors": [
      "Daniella White",
      "Chip Le Grand"
    ],
    "text": "Premier Jacinta Allan has cancelled an appearance at a key social services event to hold a press conference promoting the government’s Metro Tunnel project.\n\nAllan was scheduled to appear alongside Opposition Leader Brad Battin on a panel hosted by Victoria’s peak body for social and community services to discuss her vision for the state.\n\nPremier Jacinta Allan held a press conference about the new Metro Tunnel stations on Monday morning instead of attending a social services event, where she was due to speak. Credit: Luis Enrique Ascui\n\nShe was listed on the Victorian Council of Social Services website and scheduled to speak to VCOSS chief executive Juanita Phillips at 10am Monday, but did not end up taking part in the panel.\n\nInstead, she went to a press conference about the completion of the new Metro Tunnel train stations, arriving at the new State Library Station just after 10.15am for an 11am start.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/nrl-beats-afl-as-grand-final-sets-tv-ratings-record-20251006-p5n0dc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NRL beats AFL as grand final sets TV ratings record",
    "publish_date": "Mon, 06 Oct 2025 11:31:08 +1100",
    "category": "sports",
    "authors": [
      "Michael Chammas"
    ],
    "text": "The NRL and Channel Nine are celebrating the best television ratings in the history of the sport, with the Broncos-Storm grand final attracting a record audience of 4.46 million viewers.\n\nThe NRL grand final smashed the television viewing numbers of the AFL, with an average of 4.18 million viewers tuning in to watch the Brisbane Lions topple Geelong to win the flag a week earlier.\n\nBrisbane are the 2025 NRL champions. Credit: Getty Images\n\nThe women’s grand final also had more than a million viewers, passing the numbers of the Bledisloe Cup between the Wallabies and All Blacks (893,000) the night before. It was up 36 per cent on the NRLW grand final the year before.\n\nThe NRL grand final was watched by more people than the highest rating Origin fixture of the year, with an average of 3.9 million tuning in for the decider in game three earlier in the year.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/i-want-to-be-a-winner-where-walsh-stands-among-clive-churchill-medal-champions-20251006-p5n0be.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I want to be a winner’: Where Walsh stands among Clive Churchill Medal champions",
    "publish_date": "Mon, 06 Oct 2025 11:30:30 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Between his match-winning tackles, powerful solo try and crisp cutout passes, Reece Walsh might have just delivered the most emphatic grand final performance in NRL history.\n\nThis was the Brisbane superstar’s moment – one to announce himself as a player made for the game’s greatest stage, and silence his critics.\n\nFrom a statistical standpoint, perhaps only Panthers halfback Nathan Cleary can rival the Broncos fullback with his 2023 grand final exploits.\n\nThat night, Cleary masterminded a 16-point comeback in 18 minutes to break Brisbane hearts.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/wa-news-live-indian-ocean-drive-near-miss-leads-to-international-driver-being-charged-20251006-p5n0c9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Indian Ocean Drive near-miss leads to international driver being charged",
    "publish_date": "Mon, 06 Oct 2025 11:30:18 +1100",
    "category": "finance",
    "authors": [],
    "text": "Turning to education news, Opposition Education Spokesman Liam Staltari has raised his concerns over the poor condition and age of transportables being used as classrooms at WA’s education support centres.\n\nOf the state’s 46 education support centres, transportable classrooms make up more than a third of them.\n\nAn example of a rundown demountable.\n\nStaltari said one transportable classroom at a support centre in the northern suburbs had a fungal farm growing under the floor and all soft furnishings within it had to be destroyed.\n\nHe claimed others had inappropriate wheelchair access, broken windows, uneven floors and a lack of undercover walkways.\n\n“It’s totally unacceptable that children with disabilities, and their dedicated teachers and support staff, are left in ageing transportables while their peers in neighbouring schools – often on the same site – learn in modern brick and mortar classrooms,” he said.\n\n“Mould, a lack of appropriate heating and air-conditioning, are some of the conditions children and their teachers are being forced to return to every day.”\n\nStaltari said some of the buildings had been in place for more than 15 years, despite the Department of Education stating they were temporary and designed to manage changing enrolment demand.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/australia-and-papua-new-guinea-sign-defence-treaty-midday-news-bulletin-6-october-2025/rc1crjxm8",
    "title": "Australia and Papua New Guinea sign defence treaty | Midday News Bulletin 6 October 2025",
    "publish_date": "Mon, 6 Oct 2025 01:14:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nA signing ceremony finalises the defence treaty between Australia and Papua New Guinea.\n\nNew laws imminent on a triple-zero custodian.\n\nAnd in the NRL, Broncos star Reece Walsh reveals how he helped his team overcome Melbourne Storm in the grand final.\n\n----\n\n\n\n\n\nA landmark defence treaty has just been signed by Prime Minister Anthony Albanese and his Papua New Guinean counterpart in Canberra.\n\n\n\n\n\nThe Pukpuk agreement, named after the local word for crocodile, will require each nation to come to the aid of the other if under military attack.\n\n\n\n\n\nIt will also create a pathway for citizens to serve in the other country's defence force.\n\n\n\n\n\nThe treaty, which was originally expected to be signed in Port Moresby two weeks ago, is being seen as positive step towards shoring up Western influence in the Pacific in the face of approaches from China.\n\n\n\n\n\n----\n\n\n\n\n\nCommunications Minister Annika Wells will meet the heads of telcos tomorrow, as the government rushes through new laws to enshrine a triple-zero custodian.\n\n\n\n\n\nIt comes in addition to new rules meaning carriers must share real time information on outages with emergency services and the media regulator.\n\n\n\n\n\nEmbattled Optus chief Stephen Rue - along with Telstra and TPG bosses - have been summoned to Canberra ahead of the peak bushfire season.\n\n\n\n\n\nMs Wells told the Seven Network that two Optus outages since 2023 were the result of Optus failures.\n\n\n\n\n\n\"There's nothing that anybody, whether the independent regulator, other telcos, have has pointed out yet that any of us could have done to stop the failures that happened at Optus from happening at Optus. What happened here was a failure by Optus to comply with existing laws. And the laws that we're bringing in this week, are to further enshrine confidence of taxpayers in the triple-zero system. The laws that are coming this week would not have stopped what happened at Optus a couple of weeks ago, because that was a catastrophic failure, a second (failure) on the part of Optus.\"\n\n\n\n\n\n----\n\n\n\n\n\nActivists of the Gaza humanitarian aid flotilla have accused Israeli authorities of abuse and rights violations after being released from detention.\n\n\n\n\n\nThe 50 vessels of the Global Sumud Flotilla were intercepted by Israel last week in the latest attempt by humanitarians and activists to challenge the naval blockade of Gaza and deliver food and medicine to civilians trapped inside.\n\n\n\n\n\nSpanish activists, who have now arrived home from Israeli detention, are accusing Israeli police officers of physically abusing the activists as well as denying them essential medicines and refusing them contact with lawyers, family and their respective governments.\n\n\n\n\n\nIsrael has so far deported at least 170 of the more than 450 activists it detained, while six Australians reportedly remain in Israeli detention.\n\n\n\n\n\nJuan Bordera, a Spanish politician who joined the flotilla, says he fears for the safety of his colleagues who remain in prison.\n\n\n\n\n\n\"Of course, we fear for them as we've been under the same situation as them, we know water they are getting is not good, rotten food, they are being beaten and other people are doing hunger strikes while they have do not access to drinking water. How are we not going to be worried about them?”\n\n\n\n\n\nThe Israeli foreign ministry denies they are violating the rights of the detained activists.\n\n\n\n\n\n----\n\n\n\n\n\nBritish police are investigating the firebombing of mosque in Sussex as a hate crime, after the assailants set the building alight while two worshippers were inside.\n\n\n\n\n\nA mosque representative tells CNN that two people in balaclavas tried to force the door open on Saturday night before pouring gasoline onto the steps and attempting to burn the building down.\n\n\n\n\n\nSussex police have called the incident an appalling and reckless attack which has left the local Muslim community feeling unsafe.\n\n\n\n\n\nThe incident comes just days after an attack at a synagogue in Manchester claimed the lives of two men.\n\n\n\n\n\nThe British government says additional security will be deployed at synagogues across the country after the deadly attack.\n\n\n\n\n\n----\n\n\n\n\n\nAnd in sport...\n\n\n\n\n\nBroncos fullback Reece Walsh, who starred in Brisbane's thrilling 26 to 22 grand final win over Melbourne, has described how he calmed his nerves before the game.\n\n\n\n\n\nThe Clive Churchill Medallist scored a superb try and set up three others in the come-from-behind victory, while also performing three key try-saving plays in defence.\n\n\n\n\n\nAmid celebrations in the dressing room, Walsh said he felt emotional before the game.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/government-summons-optus-telstra-to-canberra-over-triple-zero-failings/tic2vlzkt",
    "title": "Government summons Optus, Telstra to Canberra over triple-zero failings",
    "publish_date": "Sun, 5 Oct 2025 18:35:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "The CEOs of Australia's big three telcos have been summoned to Canberra to give assurances they can comply with a new suite of safeguards for the triple-zero emergency network.\n\n\n\n\n\nFollowing multiple recent failures, including last month's Optus outage during which four people died , the government is fast-tracking legislation for new reporting requirements.\n\n\n\n\n\nFrom 1 November, telecommunications companies will be required to provide real-time updates on any outages to emergency services, the communications watchdog Australian Communications and Media Authority (ACMA), and the government.\n\n\n\n\n\nOn Saturday, Communications Minister Anika Wells wrote to embattled Optus CEO Stephen Rue, Telstra CEO Vicki Brady, and TPG CEO Iñaki Berroeta to request meetings in Canberra on Tuesday, seeking assurances the operators will be able to meet their legal obligations and avoid further outages.\n\n\n\n\n\n\"With Australia's disaster season approaching , telecommunications providers play an important role. People must have trust in the reliability of our triple-zero service when they need it most,\" Wells said in the letters, seen by SBS News.\n\n\n\n\"Despite this, outages have occurred and more needs to be done by telecommunications companies,\" Wells wrote.\n\n\n\n\n\nShe has directed ACMA to lead an investigation into Optus' compliance with emergency systems, while the Singaporean-owned telco has appointed former investment banker and NBN Co board director Kerry Schott to lead its own inquiry, conceding there have been \"unacceptable\" failures.\n\n\n\n\n\nThe establishment of a 'Triple Zero guardian' to provide independent oversight of the emergency system was a key recommendation of the review into a 2023 Optus outage that affected all customers for twelve hours, during which over 2,000 triple-zero calls failed to get through.\n\n\n\n\n\nIn April 2024, the government labelled the role a \"priority recommendation\" but flagged further consultation.\n\n\n\n\n\nEighteen months later, the position is not yet fully operational, with legislation still outstanding.\n\n\n\n\"Australians should be asking very serious questions of this minister,\" Opposition communications spokesperson Melissa McIntosh told Sky News, calling for an independent investigation into the adequacy of the entire triple-zero system.\n\n\n\n\n\n\"Now we're looking in the closing days of parliament for the year, but there'll be rushed legislation because she didn't act and the government didn't act earlier,\" she said.\n\n\n\n\n\nOn Sunday, Industry Minister Tim Ayres rejected claims that the protracted government response leaves it with some responsibility for the deadly outages.\n\n\n\n\n\n\"The minister's been working on those questions, and the previous minister has been working on those questions; that is all of the architecture that the government has committed to delivering,\" he told Sky News.\n\n\n\n\n\n\"But in the end, this is Optus' failure, and it's a devastating failure for Australian families who just expect triple zero to deliver.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/millions-of-australians-to-see-their-student-debts-slashed-heres-what-you-need-to-know/jk27nb331",
    "title": "We now know when your HECS debt will be slashed, and by how much",
    "publish_date": "Sun, 5 Oct 2025 00:15:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Millions of Australians will see their student debt slashed from next month.\n\n\n\n\n\nThe federal government said the Australian Tax Office would begin applying the 20 per cent cut from mid-November, with most seeing their balances reduced by the end of the year.\n\n\n\n\n\nEducation minister Jason Clare confirmed the timeline on Sunday and said about three million Australians would benefit from the debt relief.\n\n\n\n\n\n\"We promised we would cut your student debt by 20 per cent and we are delivering,\" he said.\n\n\n\n\n\n\"This cut is already locked in to people’s balances at 1 June but soon they will be able to see it and feel it.\"\n\n\n\n\n\nHere's everything you need to know.\n\n\n\nHow much is the cut and who will benefit?\n\nThe cut is a one-off reduction of 20 per cent on all Higher Education Loan Program (HELP) debts, including university loans, known as HECS. The cut will be backdated to balances on 1 June before indexation was applied.\n\n\n\nThe government estimates about three million Australians will see their debt reduced.\n\n\n\n\n\nA person with an average debt of $27,600 will see $5,520 wiped.\n\n\n\nWhen will my debt be reduced?\n\nThe ATO will begin applying the cut from mid-November, with about half of those with student loans to see their debt slashed by the end of the month. Most others will see the cut applied by mid-December.\n\n\n\nWhy is the debt being cut?\n\nThe government says the debt relief is about recognising the financial pressure faced by many Australians, particularly younger Australians. About 70 per cent of student debt is held by Australians aged 35 or younger.\n\n\n\nDo I need to do anything?\n\nNo, the reduction will be automatically applied to your balance by the ATO.\n\n\n\nWill I still receive the cut if I have paid off my loan?\n\nIf you have repaid your student loans and don’t have a debt balance as of 1 June 2025 you will not receive the cut. The reduction will only apply to debt that exists as of 1 June 2025.\n\n\n\nHow can I check my debt?\n\nYou can check your loan balance via the myGov website after linking your account to the ATO's online services.\n\n\n\nHow much will it cost the government?\n\nThe government expects the reduction will wipe out about $16 billion in student debt.\n\n\n\nREAD MORE How does a HECS debt affect your home loan borrowing power?\n\nThis is in addition to $3 billion that was removed after the indexation on student loans was tied to the lower of the wage price index or consumer price index.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/location-tracking-apps-a-great-tool-to-keep-loved-ones-safe-or-a-harmful-invasion-of-privacy/isma6nxvo",
    "title": "Location-tracking apps: A harmful invasion of privacy or a great tool to keep loved ones safe?",
    "publish_date": "Sat, 4 Oct 2025 21:08:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "As her 18-year-old son backpacked around Europe last year, Christine Milostnik found reassurance in watching his exact location on her phone through a simple app.\n\n\n\n\n\nMilostnik said her son had agreed to the arrangement before he left, and it gave both of them peace of mind during his travels.\n\n\n\n\n\n\"I called and said, 'Oh, you haven't moved for 24 hours,' and then he said, 'Yes, I'm sick'. It was also good for him that someone was looking after him,\" she told SBS News.\n\n\n\n\n\nMilostnik said that, as her children are now grown up, she has largely stopped using location tracking apps, but for years she was comforted by knowing when they returned from school.\n\n\n\n\n\nShe also previously used the apps to monitor her mother with dementia, who would sometimes get lost.\n\n\n\n\n\n\"Having that helped me a lot because there was one day that she got a little bit confused from going to the church in the morning, coming back, and then I could ask a friend of mine to pick her up,\" she said.\n\n\n\nPutting some 'nobility' around it\n\nDespite safety and privacy concerns, an increasing number of Australians are tracking the whereabouts of their children, ageing parents, and sometimes even partners and friends, 24 hours a day, using phone applications such as Life360, Find My iPhone, and Find My Device.\n\n\n\n\n\nThe exact number of people in Australia tracking others or being tracked remains unknown.\n\n\n\n\n\nApple said that it doesn't have access to this information, and Life360 — which has previously reported having more than two million users in Australia — didn't respond to an SBS News request for information.\n\n\n\nLISTEN TO Helpful or spying? Do we really need to track where our loved ones are? SBS News 09:43 English\n\nElisabeth Shaw, CEO of Relationships Australia New South Wales, said we find it easy to justify our desire to track loved ones.\n\n\n\n\n\n\"I think part of it is the speed of life,\" she told SBS News. \"Instead of leaving anything to chance — that 'I'm not sure when the family's coming home tonight' — there's a need to know.\"\n\n\n\n\n\n\"Then we put some nobility around that. We say, well, because life isn't as safe as it used to be, then this is a reflection of how much I love my family.\"\n\n\n\n\n\nIn many ways, Australia is actually safer than it ever was.\n\n\n\n\n\nThe number of offenders police dealt with in 2023–24 was at its lowest recorded level since 2008 to 2009, while we've seen a reduction in homicides and robbery, according to the Australian Bureau of Statistics (ABS).\n\n\n\n\n\nHowever, the number of certain crimes, such as domestic violence-related assaults and sexual assaults, has increased in recent years.\n\n\n\nData from the ABS shows that there were 40,087 victims of sexual assault recorded in Australia in 2024, a 10 per cent increase from the previous year.\n\n\n\n\n\nShaw said that, with consent, location-tracking can be an immensely useful safety tool in some situations — such as when a friend tracks another's first date or someone monitors a loved one's trip in an Uber.\n\n\n\n\n\n\"There are ways which are very much in the individual's control, where they can invite people in and then exclude them at other times,\" Shaw said.\n\n\n\n\n\n\"I think in those sorts of ways, where there is regular checking in on consent, the clarity of purpose, all of that is actually a great benefit in how we live our lives.\"\n\n\n\nA normalisation of surveillance?\n\nHowever, some are concerned by what they consider to be a normalisation of surveillance occurring alongside the uptake of location-tracking apps.\n\n\n\n\n\nBridget Harris, director of the Monash Gender and Family Violence Prevention Centre, told SBS News that society has clearly experienced a shift in norms around privacy.\n\n\n\n\n\n\"That's how much information we share, the devices we share, and also expectations about that. So, expectations that we are, for instance, findable by our partners, by our children, by everybody,\" she said.\n\n\n\n\n\nShe said that, as digital surveillance creeps into ever-more aspects of our lives — work, education, interactions with the government — we come to normalise surveillance in our personal lives.\n\n\n\nResearch shared by the eSafety Commissioner in May showed that almost one in five young adults aged 18 to 24 think it's reasonable to expect to track a romantic partner whenever they want.\n\n\n\n\n\nHarris says the normalisation of location-tracking may lead to victims' calls for help not being taken seriously.\n\n\n\n\n\n\"If someone's trying to articulate the violence of their experience ... it might be discounted by someone else. They might say, 'Oh no, that's really normal. My partner and I do it too,' but what is actually happening is very different,\" she said.\n\n\n\n\n\n\n\nShaw said it's \"very important\" that intimate partners openly discuss the use of such technology.\n\n\n\n\n\n\"Even if someone dresses up their behaviour as good intentions or caring and concern, if the other doesn't experience it that way, then the issue has to be dealt with.\"\n\n\n\nLISTEN TO 'It's about power': How sexual harassment affects those on the margins SBS News 09:58 English\n\nShaw also warns that, even if it's mutually agreed upon, tracking a partner can shift expectations in a romantic relationship.\n\n\n\n\n\n\"People are judging the speed at which their partner responds: 'You didn't respond for an hour, so that means you don't love me',\" she said.\n\n\n\n\n\n\"We are conflating, sometimes, access with love and devotion.\"\n\n\n\n'It's definitely spying'\n\nSome, like Alyssa Carter, say they would never allow their partners to track their locations.\n\n\n\n\n\n\"I wouldn't like a partner to track me at all. I think it is absolutely, for myself, an invasion of my own privacy ... There is no reason for a partner, as far as I'm concerned, to want to know where you are,\" she told SBS News.\n\n\n\n\n\nCarter has always refused to monitor the whereabouts of her 16-year-old daughter, and says her daughter would be horrified at the suggestion.\n\n\n\n\n\n\"It's definitely spying … I think she would feel absolutely that it was an invasion of her privacy and her autonomy,\" Carter said.\n\n\n\n\n\nIf you or someone you know is impacted by family and domestic violence, call 1800RESPECT on 1800 737 732, text 0458 737 732, or visit 1800RESPECT.org.au . In an emergency, call 000.\n\n\n\n\n\nThe Men's Referral Service , operated by No to Violence, can be contacted on 1300 766 491.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/yazidi-refugees-in-toowoomba-find-community-through-hockey/j814wa3h1",
    "title": "Yazidi refugees in Toowoomba find community through hockey",
    "publish_date": "Sat, 4 Oct 2025 20:00:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nAmeerah Silo is carefully packing her bag before hockey training.\n\n\n\n\n\nShe's one of the many Yazidi refugees in Toowoomba who are part of a program hoping to give migrants a taste of the sport.\n\n\n\n\n\nThe 21-year-old moved to Australia in 2023 and says playing the sport has helped her build English skills and meet new people.\n\n\n\n\n\n“I don’t know the speaking, I don’t know anybody, difficult, first time living in a different country. Like when I go to hockey, like we make a friend and trying together and talking together and we are running together, everything is together.\"\n\n\n\n\n\nToowoomba has the largest Yazidi population in Australia, according to data from the last census.\n\n\n\n\n\nMany now call the regional centre their home, after fleeing Islamic State in northern Iraq and Syria.\n\n\n\n\n\nThis hockey initiative is aiming to build language skills and a sense of belonging for a community with complex needs.\n\n\n\n\n\n18-year-old Asmhan Kankah is also one of the program's participants.\n\n\n\n\n\n\"Hockey Australia has helped us to forget what we've endured before coming to Australia. It has helped us Yazidis to be happier, and that's what I like about it most.\"\n\n\n\n\n\nHelping to run the program every Friday is Toowoomba Hockey Association manager Jessie McCartney.\n\n\n\n\n\nHe says improving self esteem has helped some Yazidis to find employment.\n\n\n\n\n\n\"We knew that when they first came that they would be nervous and their English language was still developing and they had never played the sport before, so it was really important that we had a very nurturing environment that was just about building connections with people. What we've learnt through the Belong Hockey program is that we actually have to create an environment where people feel like they belong and then that integration happens automatically.\"\n\n\n\n\n\nA big part of making the program accessible is through providing transport to training.\n\n\n\n\n\nLocals like Geoff and Karen Murdoch are some of the many retirees that volunteer each week.\n\n\n\n\n\nThey drive Ameerah to practice and also help out on the field.\n\n\n\n\n\nKaren says she's made many new young friends, which makes her feel younger too.\n\n\n\n\n\n\"We felt these kids deserve to have people welcome them into their circle and it took a little while but I think they have come out here and they have found their group. We have been welcomed into their homes at different times for cups of tea or meals and I think they have looked upon us as mentors and almost grandparents and we have just lapped it up and loved it.\"\n\n\n\n\n\nGeoff says bringing together locals and the refugee community has also helped breakdown misconceptions about refugees.\n\n\n\n\n\n\"I had no understanding of their plight, when we first started. I hadn't heard of Yazidis and where they came from and we have done quite a bit of research on it and you get a much better understanding of what they've been through and what they are trying to deal with and it makes you a lot more caring and understanding of people.\"\n\n\n\n\n\nSome of these players like Ameerah have also joined local hockey clubs.\n\n\n\n\n\nJessie again.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-is-deathmatch-wrestling-and-why-is-it-controversial/nj1sz5e5z",
    "title": "Why Joel spends his evenings being stabbed in the head with skewers — for fun",
    "publish_date": "Sat, 4 Oct 2025 19:42:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "This article contains graphic descriptions and imagery.\n\n\n\n\n\nBetween the hours of 9am and 5pm, Joel Bateman is a \"mild-mannered government official\".\n\n\n\n\n\nBut when night hits, those mild manners are put to bed as he's pummelled into glass panes, thrown off ladders into beds of thumbtacks, and even endures a live whipper snipper ripping the skin raw from his back.\n\n\n\n\n\nIt's all pretty standard fare for the life of a deathmatch wrestler.\n\n\n\n\n\n\"The stunts we do in deathmatch wrestling are only limited by our imagination,\" Bateman tells SBS News.\n\n\n\nWhen Joel Bateman isn't working his government job, he's making himself bleed in unique and gruesome ways. Source: Supplied / Jake Hurdle (@jhmedia.jpeg) \"The fluorescent light tube is the staple of modern deathmatch wrestling. It's the same thing you'd find in your garage. But all the green initiatives are actually making them harder to find and more expensive — so we have to get more creative,\" Bateman says.\n\n\n\n\n\n\"We tend to wrap anything we can find in barbed wire, including the [wrestling] ring itself.\"\n\n\n\n\n\nWeapons in a deathmatch wrestler's arsenal might include: staple guns, fire, concrete blocks, cactus plants, gusset plates, thumbtacks and drawing pins, panes of tempered glass (because \"it won't cut you to the point where you need to go to the hospital\"), and perhaps the most surprising — whipper snippers.\n\n\n\n\n\n\"I've only done whipper snippers three or four times. Every time I do it, I don't remember it being that bad the last time. And then I do it and I go, 'Oh, it hurts exactly as much as I thought it did last time',\" Bateman says.\n\n\n\nIt's like being pink-bellied 150 times in the space of a quarter of a second.\n\nBateman started wrestling in 2001 at the tender age of 11. He had his first match two years later, and his first deathmatch in 2006 at age 16.\n\n\n\n\n\nThe now 36-year-old estimates he's performed over 200 deathmatches — a number that accelerated significantly since the launch of his own wrestling promotion (business), Deathmatch Downunder.\n\n\n\nIn the world of deathmatch wrestling, anything goes — even eating glass tubes, like Japanese professional wrestler Abdullah Kobayashi here. Source: Supplied / Jake Hurdle (@jhmedia.jpeg) At first glance, anyone could think death matches are just blood, gore and violence — and, look, that's partially right — but for those in this niche little world, it's about so much more.\n\n\n\nWelcome to the world of deathmatch wrestling\n\nDeathmatch wrestling is a subgenre of professional wrestling, Bateman explains.\n\n\n\n\n\nThere's standard professional wrestling. Think: World Wrestling Entertainment (WWE), with big names like John Cena and The Rock.\n\n\n\n\n\nThen, under that umbrella is hardcore wrestling. That's a more turbo version of your standard wrestling match, involving weapons such as chairs, ladders, tables and garbage bins.\n\n\n\n\n\nThen there's deathmatch wrestling, which takes hardcore wrestling and turns the dial up by 100.\n\n\n\n\n\n\"Instead of using things like chairs and tables, we find ourselves using things like barbed wire, fluorescent light bulbs and fire,\" Bateman says.\n\n\n\n\n\n\"It's like the Police Academy stunt show at Movie World, crossed with a live-action horror movie with the performance art of pro wrestling.\"\n\n\n\nThe first time Jordan Whyte and Joel Bateman wrestled each other in a deathmatch, Jordan got a fluorescent light tube straight to the face. Source: Supplied / Jaden Lee (@jiwcphotos) While professional wrestling is pre-determined (not to be confused with fake), all props used in deathmatch wrestling are 100 per cent real. Matches are a hotbed of creativity with no rules — except that there needs to be blood. And lots of it.\n\n\n\n\n\nBateman describes it as a \"wide barometer of bloodletting\".\n\n\n\n\n\n\"Everything is legitimate. Through repetition, you learn how to take these household objects and use them in a way that you could draw blood with them safely — like the most [bonkers] surgeon you've ever seen,\" he says.\n\n\n\nA double life\n\nThe first time budding primary school teacher Jordan Whyte met Bateman in the ring, he was smashed in the face by a fluorescent light tube.\n\n\n\n\n\nWhyte is relatively new to the deathmatch scene. While he's wrestled under the name Jesse Flynn for about four years, he competed in his first deathmatch in Sydney two months ago — with Bateman.\n\n\n\n\n\n\"We had light tubes, chairs, tables and gusset plates — the things that hold houses together — which aren't nice,\" Whyte says.\n\n\n\n\n\n\"The first time I got hit was with the glass tube. I thought it was really hot in there.\n\n\n\nThen I wiped the sweat from my face and was like, 'Oh, I'm gushing blood'.\n\n\"Then Joel set his knee on fire and kneed me in the face.\"\n\n\n\nJordan Whyte first entered the niche world two months ago in a match with legacy deathmatcher, Joel Bateman. They say trust and a good relationship are key components of the process. Source: Supplied / Jaden Lee (@jiwcphotos) The venue held about 120 people. One spectator was a university classmate of Whyte's, who was shocked to see the soon-to-be primary school teacher dripping blood on stage.\n\n\n\n\n\nWhyte says he's still not sure how to balance his double life, especially with classrooms filled with tiny people on the horizon.\n\n\n\n\n\n\"Part of me thinks I should finish my degree, then hang the boots up, but then part of me is hoping that I could still wrestle on weekends while teaching,\" he says.\n\n\n\n\n\n\"I know a few wrestlers who are teachers, but they're a very different [wrestling] style … but I'm like, no — hit me over the head with a chair. I think that extra step is what makes it such an insane comparison.\"\n\n\n\n\n\nIn the grand scheme of things, a chair on the head is the least of Whyte's problems. Instead, he says there are three weapons that rank the highest on the pain scale.\n\n\n\nSkewers in the head is one of the most painful stunts in deathmatch wrestling, Jordan Whyte says. (Pictured: Jordan Sampson and Aidan Osbourne). Source: Supplied / Jaden Lee (@jiwcphotos) The first is wooden skewers, which are pierced into the victim's forehead.\n\n\n\n\n\n\"I knew that would hurt, but when we did it, I was like, I don't want to do this again,\" Whyte says.\n\n\n\n\n\nThe second is barbed wire.\n\n\n\n\n\n\"It gets caught on you,\" Whyte explains.\n\n\n\n\n\n\"I'll say yes to using it as long as it stays out of my hair — I don't want to cut my hair.\"\n\n\n\n\n\nThe third: a Guitar Hero guitar, which Whyte describes as \"weirdly painful\".\n\n\n\nIn deathmatch wrestling, anything goes: even Guitar Hero. Source: Supplied / Jaden Lee (@jiwcphotos) \"It was very solid. When I got it off Facebook Marketplace, the lady was like, 'Are you sure you want it? It doesn't work.' And I was like, 'That's fine, I don't need it to work',\" Whyte says.\n\n\n\nControversial, even in the wrestling world\n\nThere's a lot of stigma that follows deathmatches, even in the professional wrestling world.\n\n\n\n\n\nBateman says before he started his promotion, he'd need to convince promoters to let him do a deathmatch — and if he managed to get it over the line, they'd often be so traumatised by the event that they'd refuse to host it again.\n\n\n\n\n\nHe says it's often been called \"organised barbarism\" by critics and that this controversy isn't new by any means.\n\n\n\n\n\nIn the late 1980s, Japanese wrestler Atsushi Onita founded a hardcore promotion in Japan called Frontier Martial-Arts Wrestling, giving birth to the death match genre.\n\n\n\n\n\nThe promotion staged the first-ever 'Exploding Ring Death Match' in 1990.\n\n\n\n\n\nIt's exactly what it sounds like on the tin: barbed wire surrounded the ring and triggered explosions when touched. One iteration featured a countdown timer that, at zero, would cause the entire ring to explode (yes, with people still inside).\n\n\n\nThe death match style started to seep into American television in the 1990s, as a ratings war — known as the Monday Night Wars — that erupted between WWE and its competitors, World Championship Wrestling (WCW) and Extreme Championship Wrestling (ECW).\n\n\n\n\n\nAs the three largest Western wrestling dynasties jostled for the top position, one thing became clear — sex and blood were key, and shock was currency.\n\n\n\n\n\nWWE dabbled in a tamer version. Its 'Buried Alive' match involved tossing an opponent into an open grave and burying them 'alive' with soil. Another derivative was WWE's 'Hell In A Cell' concept, which witnessed two opponents trapped in a ring surrounded by a five-metre-tall wire cage.\n\n\n\n\n\nOver at ECW, things were far more extreme.\n\n\n\n\n\nEach week, matches won with DIY weapons became the standard, making the promotion synonymous with the bloody and violent subculture, but also a haven for those who wanted a more brutal viewing experience. Both Whyte and Bateman credit ECW as the inspiration for their own careers.\n\n\n\nNew Jack was one of the most controversial hardcore wrestlers of all time and carried the label of one of the most dangerous and unpredictable people in the industry's history. Source: Supplied / ECW But it was not without risk: one ECW house show resulted in a 17-year-old aspiring wrestler being injured after he was 'bladed' (the act of intentionally and discreetly cutting oneself in a match to draw blood for dramatic effect) too deeply by another wrestler, New Jack, severing two of his arteries and almost killing him.\n\n\n\n\n\nAnother incident led to New Jack and Vic Grimes falling 15 feet, with a miscue sending them straight to the concrete ground. New Jack sustained brain damage and lost sight in one eye.\n\n\n\n\n\nA year later, in a rematch, New Jack allegedly tried to kill Vic Grimes by intentionally going off-script, tasing him and throwing him off the scaffolding. In the wrestling documentary Dark Side of the Ring, New Jack said: \"I was trying to throw his ass to the floor … He was lying in the ring and I told him, 'Now we're even, you f**cker.\"\n\n\n\nJordan Whyte and Joel Bateman were both inspired by Extreme Championship Wrestling in the 90s, which became synonymous with deathmatch-style wrestling. Source: Supplied / Jaden Lee (@jiwcphotos)\n\n'Organised barbarism' unfairly 'demonised'\n\nWrestling's great debate lies in what constitutes a \"shoot\" — something real and unscripted — and a \"work\" — an intentional and predetermined part of the script that's designed to look spontaneous and real.\n\n\n\n\n\nEven today, there are still debates over whether New Jack's attempted killing of Vic Grimes was real or just a masterful example of 'kayfabe' — the wrestling term for portraying events in a fictional narrative as real and genuine.\n\n\n\n\n\nWhatever the truth, deathmatches in the mainstream died as WWE's competitors did. With the company now firmly in its 'PG Era', blood and violence on screen are largely a thing of the past.\n\n\n\n\n\nSome say that's for good reason.\n\n\n\nDeathmatch wrestling has its share of critics — even from those within the professional wrestling industry. Source: Supplied / Jaden Lee (@jiwcphotos) Critics of deathmatch wrestling say it is inherently dangerous, violent for the sake of violence, and a lesser form of professional wrestling. Others say it's for the talentless and has a low bar for skill. Some say it's dangerous for fans, gives wrestling a bad name, or is just plain repetitive with a limited repertoire.\n\n\n\n\n\nWhyte found that after he entered the world of deathmatches, some local Australian promotions were hesitant to work with him. \"It can be pretty frowned upon,\" he says.\n\n\n\n\n\n\"Certain companies won't use you if you're doing deathmatches.\"\n\n\n\n\n\nBut Bateman says the subgenre is unfairly \"demonised\".\n\n\n\nI take a lot of pride in the fact that we have such a safe space — both for our performers and fans.\n\n\"In over 60 events we've run [in our promotion] in five years, we've never had an insurance complaint. We've never had a fan injured,\" he says.\n\n\n\n\n\n\"Any fans who have gotten little cuts and scratches from flying glass absolutely love it … we'll ask if they want a bandaid and they're like, nah, we're fine. We love it. This is why we come here.\"\n\n\n\nSurprisingly, glass is one of the safer weapons in deathmatches. Joel Bateman says it's because they use tempered glass, which \"won't cut you to the point where you need to go to the hospital\". Source: Supplied / Jake Hurdle (@jhmedia.jpeg) Bateman says the Australian scene was almost decimated in 2002 after a \"disgruntled wrestler\" went to the media about a particular \"family-friendly\" deathmatch, calling it \"organised barbarism\" and claiming blood was sprayed on the crowd. In three weeks, crowd numbers went from 1,200 people to 80.\n\n\n\n\n\nIt almost killed the scene entirely, but it's starting to pick up again, albeit slowly, he says.\n\n\n\n\n\n\"Other companies in Melbourne are pushing the envelope more in that deathmatch direction,\" he says, crediting long-term Australian deathmatch wrestlers like KrackerJak and Mad Dog, who have been performing for over 20 years.\n\n\n\n\n\nBateman says there is \"quite a roster\" of deathmatch wrestlers in Australia right now, estimating there are between 30 and 40 of them.\n\n\n\n\n\n\"[Attitudes] are starting to change and people are becoming more accepting of it,\" he says.\n\n\n\nMore than blood\n\nDeathmatches are a visceral, violent experience. But for Bateman, they're about so much more — a place to connect with his First Nations identity.\n\n\n\n\n\nUntil he started his promotion, the Wotjobaluk man wasn't comfortable leading with his Aboriginality as a character trait in the professional wrestling space.\n\n\n\n\n\n\"It wasn't something I leaned into because anytime I did, I was met with a good amount of racism and a good amount of bullying. It was something I pushed down,\" he says.\n\n\n\n\n\n\"If you're a face in a crowd, people feel comfortable saying racist shit.\"\n\n\n\nAt first glance, deathmatch wrestling might look like needless violence. But for Joel Bateman, it's also about expressing his First Nations identity. Source: Supplied / Jaden Lee (@jiwcphotos) But Bateman says that launching the promotion at the start of the Black Lives Matter movement was a \"turning point\" for him and gave him the confidence to show himself wholly on stage.\n\n\n\n\n\nHe's since changed his entrance music to Solid Rock by Goanna, a song about Aboriginal land rights. He also started wearing the Aboriginal flag on his tights.\n\n\n\n\n\n\"I remember being kind of nervous to do it,\" he says.\n\n\n\n\n\n\"I remember finishing the match and just bursting into tears and then opening my eyes and seeing there was a standing ovation.\n\n\n\nIt was this culmination of 18 years of suppressing my genuine self.\n\nHe says his outward display of his identity has allowed other First Nations wrestlers to lean into theirs.\n\n\n\n\n\n\"There's probably more death match wrestlers in the country than there are First Nations wrestlers in the country, which is something I'm trying to rectify. But it's a very long and very slow journey to do so,\" he says.\n\n\n\nJoel Bateman never felt comfortable with his Aboriginality on display in the ring under he started Deathmatch his promotion (business). Now, he hopes to inspire other First Nations wrestlers in Australia. Source: Supplied / Jake Hurdle (@jhmedia.jpeg) The promotion also started in the midst of professional wrestling's own #MeToo movement — #SpeakingOut — which exposed systemic emotional, physical and sexual abuse in the industry.\n\n\n\n\n\nThis meant that, for Bateman, inclusivity was at the forefront of his promotion.\n\n\n\n\n\n\"We came at a time when people really needed to feel safe, and we put a lot of time and energy into creating that space,\" he says.\n\n\n\n\n\nHe says trans people have come out as their authentic selves for the first time in public at his shows.\n\n\n\n\n\n\"That's something that means the absolute world to me. I have a trans son … the first time they ever [went out in public as themselves] was at a wrestling show as well,\" he says.\n\n\n\n\n\nIt's easy to hate deathmatch wrestling from a distance, he says.\n\n\n\n\n\n\"But there's never been a single person I can recall who's taken the time to come and immerse themselves in an event who hasn't then left and said, 'This is kind of special. There's something different about this'.\n\n\n\n\n\n\"The world is a tough place in 2025 … but in wrestling, the real world just stops when you come into that door. It's a form of escapism.\n\n\n\n\n\n\"You can come and be your authentic self.\"\n\n\n\n\n\nReaders seeking support can ring Lifeline crisis support on 13 11 14 or text 0477 13 11 14, visit lifeline.org.au or find an Aboriginal Medical Service here . Resources for young Aboriginal and Torres Strait Islanders can be found at Headspace: Yarn Safe .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-health-problem-costing-australia-billions/g3usjolbe",
    "title": "'I passed out multiple times at work': The health problem costing Australia billions",
    "publish_date": "Sat, 4 Oct 2025 19:39:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "For Rachel Eleanor Hosking, managing her endometriosis symptoms at work has been \"dire\".\n\n\n\n\n\n\"There's been multiple times where I've actually passed out at work and fainted because of immense pain,\" she told SBS News.\n\n\n\n\n\nOn weekends, the 23-year-old PhD student works in retail, where she said standing up for eight hours at a time \"infiltrates\" her flare-ups.\n\n\n\n\n\nShe carries paracetamol and a TENS machine — a \"discreet\" device that delivers small electrical pulses for pain relief, but said they \"don't scratch the surface\" against the debilitating symptoms.\n\n\n\n\n\n\"It can be really difficult for employers to understand the severity of the condition, especially when you're so fatigued. And when you're fatigued, you don't really want to tell your male manager, who will say something like 'Oh, what's endometriosis?',\" Hosking said.\n\n\n\n\n\n\"And you're like, 'dude, I just want to lie in a ball right now, please look it up'.\"\n\n\n\nHosking is one of an estimated one million Australians with endometriosis, a chronic condition where tissue similar to the uterus lining grows outside of the uterus, sometimes in the pelvis or in organs like the ovaries or fallopian tubes.\n\n\n\n\n\nEach month, this tissue thickens and bleeds, which can cause chronic pain, inflammation, fertility issues, and other symptoms like fatigue, bloating and heavy bleeding.\n\n\n\n\n\nThis week, Endometriosis Australia, the nation's peak endometriosis charity, announced a workplace accreditation scheme designed to address the stigma surrounding the condition in the workplace.\n\n\n\n\n\nThe course, open to all businesses in the country, contains education for employers on endometriosis and how to better support staff.\n\n\n\nRachael Eleanor Hosking poses from a hospital bed on the day she received her endometriosis diagnosis. Living with endometriosis led her to pursue research in the same field. Credit: Supplied Monica Forlano, chair of the board at Endometriosis Australia, said the program \"signals to employees that these employers who are accredited [through the program] understand the condition, and it's a safe place\".\n\n\n\n\n\n\"We know that 70 per cent of people with endo have to take unpaid time off because they've exhausted their personal leave, and people are losing their jobs because they can't make ends meet, and a lot of people actually give up work altogether,\" Forlano told SBS News.\n\n\n\nBillions lost in productivity\n\nEndometriosis affects one in seven Australian women, and a lack of awareness around the disease is costing the country billions each year.\n\n\n\n\n\nA 2019 government study found endometriosis costs Australia between $7.4 billion and $9.7 billion per year, with roughly two-thirds of that figure attributed to lost productivity.\n\n\n\n\n\nForlano said the actual figures for the economic loss were likely to be significantly higher.\n\n\n\n\n\n\"That $9.7 billion was based on 2018 numbers and we know now that to the age of 49, one in seven women will have endometriosis, so we can only assume that figure is much greater,\" she said.\n\n\n\n\n\nAustralian government contributions to research have led to a surge in awareness, but she said we are still far behind.\n\n\n\n\n\n\"We now know that there's not just one type of endometriosis — there's at least three, and in regards to understanding this condition, we are where breast cancer was 20-30 years ago,\" she said.\n\n\n\nThe study further highlighted two key factors that contributed to productivity loss: 'absenteeism', where workers are forced to take leave to manage their symptoms at home, and 'presenteeism', where people may be present in the workforce but are unable to work to their full capacity due to their symptoms.\n\n\n\n\n\nWhen 52-year-old Calli Brown started her career in media, managing her endometriosis symptoms at work was a \"shameful\" and stressful process.\n\n\n\n\n\n\"The stress compounded and it was so debilitating, there was a lot of shame, no-one really talked about periods and so there wasn't an environment that was conducive to actually talk about what was going on for you,\" she told SBS News.\n\n\n\n\n\nBrown said she would need to take sick days off because of \"excruciating\" pain, which would often lead her to black out.\n\n\n\n\n\n\"But because you're junior and you're female, and it's a busy environment, and everybody is supposed to be tough, and there are some women who don't experience period pain, there were very few people I felt like I could turn to for support and for understanding,\" she said.\n\n\n\n\n\n\"And so that was very shameful. I would have to take sick days, and at the beginning of your career, you don't want to be having sick days all the time.\"\n\n\n\nLiving with an 'invisible' illness\n\nA survey of 389 workers with endometriosis conducted by Southern Cross University and Western Sydney University, which was supported by Endometriosis Australia, found one in six had lost their jobs to their diagnosis, while one in three said they had been passed over for promotions due to their condition.\n\n\n\nAnna Fragkoudi, a research fellow at The University of Adelaide's School of Public Health, said because endometriosis is an \"invisible\" disease, managers and superiors might not be understanding of the various methods people may need to manage their pain, such as taking sick leave or working from home.\n\n\n\n\n\n\"It is an invisible condition, so people might think, 'Oh, you're all right, so why would you like need to take leave if there is nothing wrong with you?',\" she told SBS News.\n\n\n\n\n\nThe survey found that flexible work arrangements introduced during the COVID-19 pandemic were the biggest contributor to increased productivity for people with endometriosis.\n\n\n\n\n\nHowever, Forlano said the real challenge is being able to discuss the diagnosis at work and confronting the stigma.\n\n\n\n\n\n\"There's a lot of anxiety and stigma raising your diagnosis, because you are seen as potentially unreliable and consistent,\" she said.\n\n\n\n\n\n\"And that's the experience that I had in my career, when managing the symptoms got so bad that I couldn't function.\n\n\n\n\n\n\"Chronic pain brings up real mental health issues because it's it's exhausting, and with the fatigue that comes with that, it was really hard to take on high-stress roles.\"\n\n\n\n\n\nShe said \"some kind of empathy\" from employers could go a long way.\n\n\n\n\n\n\"Some little things will make so much difference, commuting when you're having an endo flare just makes symptoms worse so if you can log in at home from your bed, close to your bathroom that you can fill a hot water bottle whenever you need to, or even have a nap at in your lunch break just so you can perform and work — that's huge for someone with with endo and they can thrive,\" she said.\n\n\n\nBrown said her experience navigating endometriosis in the workplace affected her mental health.\n\n\n\n\n\n\"You're having to push it down, which then just compounds your symptoms, because you're already really stressed. How can you improve your symptoms and get over something when you're stressed and holding it inside? It just compounds the depression, it compounds the anxiety, it compounds the shame,\" she said.\n\n\n\n\n\nShe said initiatives like the accreditation scheme were important because they established credibility towards a historically hidden and undermined disease.\n\n\n\n\n\n\"A lot of the time, women feel like it has to be a secret — to actually have a formal process means it's a conversation opener, right? The world is changing, a lot of women are working in male dominated industries and this makes it safe for them to actually start the conversation in a way that is already legitimate.\"\n\n\n\n\n\nBrown said she was happy that her daughter, who has endometriosis, won't have to go through what she did.\n\n\n\nCalli Brown and her daughter are both diagnosed with endometriosis. Credit: Supplied But Hosking, who now researches endometriosis at The University of Adelaide's Robinson Research Institute, said when it came to endometriosis in Australia, awareness was still the \"most important\" step.\n\n\n\n\n\n\"It's important not only for women to know so that they can know that their period pain is not normal, but knowing that men are also part of this conversation is something that is so important, because men make up [nearly] 50 per cent of the population, and if 50 per cent of the population do not understand the severity of what we are going through, then we're stuck in this sort of rock and a hard place,\" she said.\n\n\n\n\n\n\"It's been too long that women have stayed silent, people with endometriosis have just suffered in silence, hid their period products, their TENS machines, their Panadol, they've said, 'Oh, can I just pop to the restroom quickly?'. And then been denied that.\"\n\n\n\n\n\nShe said awareness was the first step, and now it's: \"How can we help?\"\n\n\n\n\n\nReaders seeking support with mental health can contact Beyond Blue on 1300 22 4636. More information is available at beyondblue.org.au . Embrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/sport/afl/afl-trade-period-live-updates-petracca-curnow-merrett-in-the-spotlight-on-day-one-20251005-p5n07r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL trade period LIVE updates: Suitors emerge for Oliver; Essendon will not entertain trading Merrett",
    "publish_date": "Mon, 06 Oct 2025 12:49:03 +1100",
    "category": "sports",
    "authors": [
      "Hannah Kennelly"
    ],
    "text": "Saints’ talent and acquisition boss Graeme Allan said he had not told his own list boss Steve Silvagni that the Saints were pursuing Silvagni’s son, Jack, at Carlton.\n\nJack Silvagni joined the Saints as an unrestricted free agent on a good enough deal to give the Blues an end of first round pick as compensation. Credit: St Kilda Football Club\n\nJack Silvagni, who emerged as a solid defender this year before he was hurt, joined the Saints as an unrestricted free agent.\n\n“I didn’t tell his dad. We are great mates but I didn’t tell him, so he was shocked. He was shocked. He was. Then it was Ross [Lyon] who came over the top. When Ross comes over the top, get out of the way,” Allan said.\n\nAllan said the Saints would be aggressive again next year in their hunt for more high-priced talent, declaring they still had plenty of room under the salary cap.\n\nLoading\n\nThe Saints have recently signed Carlton ruckman Tom De Koning on a long-term $12 million deal, while star midfielder Nasiah Wanganeen-Milera has become the league’s first $2 million-a-season man.\n\nThe Saints have also secured other talent, and are now looking to snare Sam Flanders from the Gold Coast.\n\n“Not a problem. We’ll go hunting again next year,” Allan said when asked how the Saints would fit their recruits under the cap.\n\n“We have plenty of money.”\n\nAllan said the Saints had barely paid 95 per cent of the salary cap this season – the minimum league requirement.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/lifestyle/neighbour-feud-sparks-over-late-night-cooking-20251006-p5n0ew.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Neighbour feud sparks over late night cooking",
    "publish_date": "Mon, 06 Oct 2025 12:43:42 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Neighbour feud sparks over late night cooking\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/corn-flakes-box-vlandys-slams-r360-competition-20251006-p5n0dv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Corn Flakes box': V'landys slams R360 competition",
    "publish_date": "Mon, 06 Oct 2025 12:12:26 +1100",
    "category": "finance",
    "authors": [],
    "text": "'Corn Flakes box': V'landys slams R360 competition\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/southwell-named-for-first-jillaroos-squad-20251006-p5n0ea.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Southwell named for first Jillaroos squad",
    "publish_date": "Mon, 06 Oct 2025 12:07:41 +1100",
    "category": "finance",
    "authors": [],
    "text": "Southwell named for first Jillaroos squad\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/business/markets/us-shutdown-geopolitical-turbulence-drives-gold-to-record-highs-20251003-p5mzxe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fear factor: Why the world is rushing to buy gold",
    "publish_date": "Mon, 06 Oct 2025 12:00:52 +1100",
    "category": "finance",
    "authors": [
      "Elias Visontay"
    ],
    "text": "The price of gold has continued its climb to record heights, and Australians investors are jumping on board, as the US government shutdown becomes the latest element of economic uncertainty pushing investors to seek safety in the precious metal.\n\nAt the end of last week, bullion was trading at $US3886 ($5886) per ounce, after a stand-off over funding in the US Senate triggered a shutdown that sent gold’s spot price to its record high of $US3897 on Thursday. It marks eight weeks of gains for the commodity, beginning its run from a price of $US3290 at the end of July.\n\nGold is trading at more than US$3800, which has never been seen before. Credit: Getty\n\nA range of factors has been driving the surge in the gold value, said Shane Oliver, chief economist and head of investment strategy at AMP.\n\nOne thing at play is that central banks have been increasing their gold holdings recently, “fearful that if they have US dollars, it could work against them”, said Oliver. In particular, BRICS countries – Brazil, Russia, India, China, South Africa, Egypt, Ethiopia, Indonesia, Iran and the United Arab Emirates – have reduced their reserves of US dollars.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/property/news/paddington-family-s-mostly-vacant-guest-house-sells-for-3m-at-auction-20251006-p5n0b7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Paddington family’s mostly vacant guest house sells for $3m at auction",
    "publish_date": "Mon, 06 Oct 2025 11:59:21 +1100",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "A three-bedroom terrace that was kept by a nearby Paddington family – originally from France – for their guests to stay in when visiting Sydney sold for $3,075,000 at auction on Saturday.\n\nGuided at $2.6 million, the home at 4 Queen Road was part of a deceased estate and was offered to market for the first time in 40 years. In this time, the terrace was not leased out or lived in but kept vacant for guests visiting the owners who lived around the corner.\n\nThe property sold for $375,000 above its $2.7 million reserve. There is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.\n\nEight registered, and seven actively bid for the charming and livable residence without parking. Interest came from young families upsizing from apartments, along with a few downsizers and older parents looking to purchase for their adult children.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/nrl-around-the-clubs-october-20251006-p5n0cw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Walsh free to play, a punching ban and facial fractures - the grand final fallout",
    "publish_date": "Mon, 06 Oct 2025 11:59:17 +1100",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "Clive Churchill medallist Reece Walsh will be free to make his Kangaroos debut after dodging a grand final ban.\n\nWalsh’s post-decider relief came as Roosters NRLW back-rower Aliyah Nasio was referred directly to the judiciary for striking following a brawl that saw her and Broncos star Julia Robinson trade punches shortly after full-time.\n\nWalsh can avoid a two-game ban for his first-half high shot on Xavier Coates - which was deemed a grade 1 careless high tackle given the Storm winger was falling into contact - with a $3000 fine and an early guilty plea.\n\nThe Broncos No.1 was named in Australia’s Ashes touring party on Monday and is expected to pip Dylan Edwards as the Kangaroos first-choice fullback.",
    "source": "TheAge",
    "cluster_id": 7
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/trump-s-15-billion-band-aid-for-the-problem-he-created-20251006-p5n0ao.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump’s $15 billion Band-Aid for the problem he created",
    "publish_date": "Mon, 06 Oct 2025 11:58:42 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "US soybean farmers are in the midst of harvesting what is likely to be a near-record crop. Thanks to Donald Trump’s trade wars, much of it may be unsold.\n\nSuch are the straits the farmers find themselves in that US Treasury Secretary Scott Bessent – who himself produces soybeans, among other agricultural products – has foreshadowed a $US10 billion-plus ($15 billion-plus) rescue package, perhaps as early as this week, for farmers who have seen demand for their soybeans dive even as their costs have been inflated by US tariffs on fertilisers and tariff-induced price increases for farm machinery.\n\nUS President Donald Trump’s trade war is affecting farmers in the Midwestern states, which tended to be strongly supportive of him and his other policies. Credit: AP\n\nThe US soybean farmers are expected to produce about 4.3 billion bushels in the harvesting season now under way. Their problem is not their bumper crop, but who is going to buy it.\n\nBefore Trump’s first trade war with China in 2018-19, China, the world’s largest consumer of soybeans, bought about 60 per cent of American exports.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/plumber-out-reece-walsh-starred-on-the-field-that-was-just-the-start-of-it-20251006-p5n0aj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Plumber out’: Reece Walsh starred on the field. That was just the start of it",
    "publish_date": "Mon, 06 Oct 2025 11:49:21 +1100",
    "category": "sports",
    "authors": [
      "Frances Howe"
    ],
    "text": "For 80 minutes, Reece Walsh lit up Accor Stadium in a grand final performance for the ages. A premiership and a Clive Churchill Medal were fitting rewards.\n\nBut that was just the beginning of the night’s antics for the 23-year-old.\n\nMichael Maguire and Reece Walsh savour the taste of victory. Credit: Getty Images\n\nFrom jumping into the crowd, live-streaming from the team bus to drinking from a toilet bowl, here’s a play-by-play of Walsh’s off-field display after the grand final.\n\nFull-time whistle: For a brief moment, Walsh’s legs gave out underneath him as the weight of the moment fell on his shoulders. But it wouldn’t keep him down for long, and the full-back couldn’t stand still long enough to finish an interview on the pitch, yelling “baby, I’ll go get my brothers” before running to his teammates.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/politics/victoria/jacinta-allan-snubs-social-services-event-to-spruik-metro-tunnel-20251006-p5n0cg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jacinta Allan snubs social services event to spruik Metro Tunnel",
    "publish_date": "Mon, 06 Oct 2025 11:41:05 +1100",
    "category": "finance",
    "authors": [
      "Daniella White",
      "Chip Le Grand"
    ],
    "text": "Premier Jacinta Allan has cancelled an appearance at a key social services event to hold a press conference promoting the government’s Metro Tunnel project.\n\nAllan was scheduled to appear alongside Opposition Leader Brad Battin on a panel hosted by Victoria’s peak body for social and community services to discuss her vision for the state.\n\nPremier Jacinta Allan held a press conference about the new Metro Tunnel stations on Monday morning instead of attending a social services event, where she was due to speak. Credit: Luis Enrique Ascui\n\nShe was listed on the Victorian Council of Social Services website and scheduled to speak to VCOSS chief executive Juanita Phillips at 10am Monday, but did not end up taking part in the panel.\n\nInstead, she went to a press conference about the completion of the new Metro Tunnel train stations, arriving at the new State Library Station just after 10.15am for an 11am start.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/nrl-beats-afl-as-grand-final-sets-tv-ratings-record-20251006-p5n0dc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NRL beats AFL as grand final sets TV ratings record",
    "publish_date": "Mon, 06 Oct 2025 11:31:08 +1100",
    "category": "sports",
    "authors": [
      "Michael Chammas"
    ],
    "text": "The NRL and Channel Nine are celebrating the best television ratings in the history of the sport, with the Broncos-Storm grand final attracting a record audience of 4.46 million viewers.\n\nThe NRL grand final smashed the television viewing numbers of the AFL, with an average of 4.18 million viewers tuning in to watch the Brisbane Lions topple Geelong to win the flag a week earlier.\n\nBrisbane are the 2025 NRL champions. Credit: Getty Images\n\nThe women’s grand final also had more than a million viewers, passing the numbers of the Bledisloe Cup between the Wallabies and All Blacks (893,000) the night before. It was up 36 per cent on the NRLW grand final the year before.\n\nThe NRL grand final was watched by more people than the highest rating Origin fixture of the year, with an average of 3.9 million tuning in for the decider in game three earlier in the year.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/i-want-to-be-a-winner-where-walsh-stands-among-clive-churchill-medal-champions-20251006-p5n0be.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I want to be a winner’: Where Walsh stands among Clive Churchill Medal champions",
    "publish_date": "Mon, 06 Oct 2025 11:30:30 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Between his match-winning tackles, powerful solo try and crisp cutout passes, Reece Walsh might have just delivered the most emphatic grand final performance in NRL history.\n\nThis was the Brisbane superstar’s moment – one to announce himself as a player made for the game’s greatest stage, and silence his critics.\n\nFrom a statistical standpoint, perhaps only Panthers halfback Nathan Cleary can rival the Broncos fullback with his 2023 grand final exploits.\n\nThat night, Cleary masterminded a 16-point comeback in 18 minutes to break Brisbane hearts.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/wa-news-live-indian-ocean-drive-near-miss-leads-to-international-driver-being-charged-20251006-p5n0c9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Indian Ocean Drive near-miss leads to international driver being charged",
    "publish_date": "Mon, 06 Oct 2025 11:30:18 +1100",
    "category": "finance",
    "authors": [],
    "text": "Turning to education news, Opposition Education Spokesman Liam Staltari has raised his concerns over the poor condition and age of transportables being used as classrooms at WA’s education support centres.\n\nOf the state’s 46 education support centres, transportable classrooms make up more than a third of them.\n\nAn example of a rundown demountable.\n\nStaltari said one transportable classroom at a support centre in the northern suburbs had a fungal farm growing under the floor and all soft furnishings within it had to be destroyed.\n\nHe claimed others had inappropriate wheelchair access, broken windows, uneven floors and a lack of undercover walkways.\n\n“It’s totally unacceptable that children with disabilities, and their dedicated teachers and support staff, are left in ageing transportables while their peers in neighbouring schools – often on the same site – learn in modern brick and mortar classrooms,” he said.\n\n“Mould, a lack of appropriate heating and air-conditioning, are some of the conditions children and their teachers are being forced to return to every day.”\n\nStaltari said some of the buildings had been in place for more than 15 years, despite the Department of Education stating they were temporary and designed to manage changing enrolment demand.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://au.news.yahoo.com/kids-really-vitamin-supplements-011422495.html",
    "title": "Do kids really need vitamin supplements?",
    "publish_date": "2025-10-06T01:14:22Z",
    "category": "lifestyle",
    "authors": [],
    "text": "Walk down the health aisle of any supermarket and you’ll see shelves lined with brightly packaged vitamin and mineral supplements designed for children.\n\nThese products promise to support immunity, boost brain development and promote healthy growth – leading many parents to believe they’re a necessary addition to their child’s diet.\n\nFor parents of fussy eaters in particular, supplements may feel like a quick and reassuring solution. But are they actually needed?\n\nThe nutrients children really need\n\nIt’s true that children require a broad range of vitamins and minerals – such as vitamins A, B, C, D, E, and K, along with folate, calcium, iodine, iron and zinc – for healthy development. These nutrients play essential roles in brain and nerve development, vision, bone strength, immune function, metabolism and maintaining a healthy weight.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHowever, for most healthy children, these nutrients can and should come from food – not from supplements.\n\nEven children with selective eating habits typically receive adequate nutrition from everyday foods, many of which are fortified. Common staples such as breakfast cereals, milk and bread are often enriched with key nutrients such as B vitamins, iron, calcium and iodine.\n\nWhat the science says about supplements\n\nAlthough many children’s supplements claim to support immunity, growth, or overall wellbeing, there is little robust scientific evidence that they improve health outcomes or prevent illness in otherwise healthy children.\n\nLeading health bodies advise that children who consume a varied diet do not need additional supplementation.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nResearch consistently shows that getting vitamins and minerals through whole foods is superior to taking them in supplement form. Foods provide these nutrients along with fibre, enzymes, and bioactive compounds, such as phytochemicals and healthy fats, which enhance absorption, metabolism and overall efficacy in ways isolated supplements cannot replicate.\n\nPotential risks and unintended consequences\n\nParents should also be aware that supplements are not risk-free.\n\nFat-soluble vitamins – such as A, D, E and K – can accumulate in the body if consumed in excess. If they reach toxic levels, they can cause cause health issues. In the case of A and B vitamins, these issues can be severe and even cause death.\n\nHigh doses of other water-soluble vitamins, such as vitamin C, may not be dangerous, but can cause side effects like diarrhoea or interfere with the absorption of other nutrients.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMany children’s supplements are flavoured or sweetened to make them more appealing. While this might make them easier to administer, it also introduces added sugars and artificial ingredients into children’s diets – potentially undermining healthy eating habits.\n\nThere is also a psychological dimension to consider. Routinely giving children supplements in response to normal eating behaviours, such as fussiness or selective food preferences, may inadvertently teach them that pills are a substitute for a nutritious diet, rather than a temporary aid.\n\nSo, what should parents do?\n\nThe most reliable way to provide children with essential vitamins and minerals is through a varied and balanced diet. This means including dairy, meat, poultry, fish, wholegrains, nuts, seeds, legumes, and a colourful array of fruits and vegetables.\n\nIf you’re regularly negotiating with a pint-sized dictator over a single pea, rest assured you’re far from alone. Research shows nearly half of children go through a phase of picky eating – a behaviour rooted in our evolutionary past.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nEarly humans developed an aversion to unfamiliar or bitter foods as a survival mechanism to avoid potential toxins. At the same time, they learned to seek out and store energy-rich, palatable foods to survive periods of scarcity.\n\nSo, how can parents gently encourage toddlers to embrace healthier, more colourful food options?\n\nMix things up . Blend less nutritious beige or white foods with healthier ingredients. For example, add cannellini beans and cauliflower into mashed potatoes to boost nutrient content without sacrificing familiarity.\n\nMake healthy swaps . Gradually replace white bread, pasta and rice with wholegrain versions. Start by mixing brown rice into a serving of white rice to ease the transition.\n\nUse familiarity to your advantage. Pair new, colourful foods with familiar favourites. Offer fruit dipped in yoghurt or add a vibrant red or green sauce to pasta, making new flavours less intimidating.\n\nBy taking these small, strategic steps, parents can support their child’s nutrition and help them develop a positive relationship with food – no matter how selective their tastes may be.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThat said, there are cases where supplementation may be appropriate – such as children with diagnosed nutritional deficiencies, specific medical conditions, or highly restricted diets.\n\nIn these instances, parents should seek advice from a qualified health professional, such as a GP or paediatric dietitian. Warning signs may include symptoms such as persistent constipation or signs of impaired growth.\n\nBut for most children, vitamin supplements aren’t necessary – they may be doing more harm than good.\n\nNick Fuller is the author of Healthy Parents, Healthy Kids – Six Steps to Total Family Wellness. His free, practical recipe ideas for a nutritious, varied diet can be found at feedingfussykids.com.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThis article is republished from The Conversation. It was written by: Nick Fuller, University of Sydney\n\nRead more:\n\n\n\nA/Professor Nick Fuller works for the University of Sydney and RPA Hospital and has received external funding for projects relating to the treatment of overweight and obesity.",
    "source": "Yahoo",
    "cluster_id": 36
  }
]