[
  {
    "url": "https://www.9news.com.au/national/australia-post-2025-christmas-cut-off-dates-domestic-and-international-reminder/eb154aec-255f-413d-8581-e93077b3747d",
    "title": "Australia Post reveals deadline for mailing Christmas parcels",
    "publish_date": "Wed, 15 Oct 2025 01:08:05 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "With the festive season almost upon us, Australia Post ﻿is encouraging Australians to plan ahead to ensure their parcels arrive on time.\n\nThe postal giant has released the cut-off dates ﻿for domestic and international deliveries ahead of its busiest time of the year.\n\nAustralia Post executive general manager﻿ Gary Starr said the corporation was scaling its operations with thousands of extra team members to meet demand.\n\nREAD MORE: Veteran broadcaster Derryn Hinch hospitalised after fall\n\nAustralia Post ﻿is encouraging Australians to plan ahead to ensure their parcels arrive on time. (Getty)\n\n\"Christmas is the busiest time of year for our network and we know how important it is for parcels and cards to arrive on time,\" Starr said.\n\n\"We're sharing these key dates early so people can plan ahead, while also scaling up our operations with thousands of extra team members.\n\n\"Planning ahead is the best way to make sure your gifts reach loved ones, and while we'll still deliver items sent after the recommended dates as quickly as possible, we can't guarantee they'll arrive before Christmas.\"﻿\n\nDomestic mail\n\nFor people living in metro areas, parcels should be sent by Monday, December 22 for same state deliveries﻿ and Friday, December 19 for interstate deliveries.\n\nFor express post deliveries from metro areas, parcels should be sent by Tuesday, December 23.\n\nChristmas letters and cards from metro areas should be sent by Thursday, December 18 for same state deliveries﻿ and Tuesday, December 16 for interstate deliveries.\n\nAustralians sending to or from Western Australia, Northern Territory, Tasmania and regional or remote locations should allow a few extra days.﻿\n\nInternational mail\n\nEconomy air parcels should be sent between November 21 and December 5, depending on the destination.\n\n﻿International standard parcels should be sent between November 28 and December 12.\n\nParcels sent via international express, should be sent between December 5 and December 18.﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/antibiotic-resistance-rising-in-children-around-the-world-australian-experts-say-whats-next/07458f7b-59b9-4138-a582-5e4b37cd924f",
    "title": "Warning as bacterial resistance to antibiotics soars on Australia's doorstep",
    "publish_date": "Tue, 14 Oct 2025 19:18:53 +0000",
    "category": "lifestyle",
    "authors": [
      "Oct"
    ],
    "text": "Disease resistance to antibiotics is rising faster than ﻿medical advances can keep up with, potentially putting billions around the world in danger.\n\nThe World Health Organisation﻿'s Global Antibiotic Resistance Surveillance Report found that one in six laboratory-confirmed bacterial infections that caused common conditions in people worldwide in 2023, were resistant to antibiotic treatments.\n\nBetween 2018 and 2023, the report found antibiotic resistance in people rose 40 per cent, or 5 to 15 per cent each year.﻿\n\nAntibiotic resistance is riding around the world. (Getty)\n\nAnita Williams, from the Centre for Child Health Research at the University of Western Australia, said the findings were \"alarming but not surprising\".\n\n\"Thankfully, the proportion of resistance in Australian children is lower than global averages,\" she said.\n\n\"Whilst globally 45 per cent of E coli were resistant to 3rd generation cephalosporins, in Australian children it was only 21.5 per cent. For methicillin-resistant staph aureus (MRSA), globally it was 27.1 per cent, whilst in Australian children it was 13.6 per cent.\"\n\nWithout effective antibiotics, even routine surgeries could become extremely risky. (Getty)\n\nHowever, she said, antibiotic resistance from bacteria in children was nonetheless on the rise in the country.﻿\n\nProfessor Mark Blaskovich from the Institute for Molecular Bioscience said that the nearby South East Asia region had one of the highest levels of resistance at 31 per cent, which posed a potential danger of transmission to travellers.\n\n\"Particularly worrying is the finding that some of our more powerful antibiotics are being used more widely than they should be, meaning that resistance to these important antibiotics will continue to develop more quickly than it should, leading to their obsolescence,\" he said.\n\nResistance from bacteria that cause diseases like E coli is increasing. (Getty)\n\n\"This leads to the need for new antibiotics, but as outlined in another recent WHO report, the development pipeline for new antibacterial agents is sparsely populated.\n\n\"While Australia is doing relatively well compared to the rest of the world, it must not be complacent and should commit to funding research that combats antibiotic resistance.\"\n\nMultiple experts noted that in countries with weaker health systems - usually poorer countries - the problem was, but that the current hyper-connectivity of the world meant transmission of resistant bacteria could happen very easily.\n\n\"Because about five million deaths were associated with antimicrobial resistance (not just antibiotics, but also antivirals and antifungals),\" Associate Professor Sanjaya Senanayake from The Australian National University said.\n\n\"By 2050, this could reach 10 million deaths a year and have a negative impact on global GDP with global losses of US$100 trillion ($153.4 trillion).\"\n\nHe and others rejected the idea that tightening prescription requirements for antibiotics was a catch-all solution﻿.\n\n\"It is not just an issue of doctors prescribing antibiotics inappropriately. Instead, it also includes the vast spectrum of antimicrobial use not just in humans, but also in animals and plants, the use of the unprescribed over-the-counter antibiotics, the contamination of waterways with antibiotics, and the development of new antibiotics,\" he said.\n\n\"Developing new antibiotics, however, is not cost-effective for businesses, so they require healthy government subsidies to make it attractive for pharmaceutical companies.﻿\"\n\nPeople can help prevent bacterial spread through simple acts like washing their hands. (Getty Images/iStockphoto)\n\nReece Pharmaceuticals chief executive James Graham said most antibiotic classes had been discovered between the 1940s and 1980s.\n\n\"This innovation gap is colliding with escalating global resistance, leaving doctors with fewer options and patients at greater risk,\" he said.\n\n\"Infections that were once easily treated now mean longer hospital stays, higher treatment costs, and, in some cases, preventable amputations such as those seen in diabetic foot infections.﻿\"\n\nAssociate Professor Andreea Molnar from Swinburne University of Technology laid out the problem starkly, saying without effective antibiotics, even \"routine\" surgeries were \"dangerously risky\".\n\nWhile multiple experts are calling for better surveillance and increased incentives from government, Dr Trent Yarwood of the ﻿Australasian Society for Infectious Diseases, said everybody had a part to play.\n\n\"Prevent infections by washing your hands, getting vaccinated and practising good food safety,\" he said.\n\n\"Only take antibiotics when they are necessary and only for as long as is recommended by your doctor.\"",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/dangelo-death-grammy-winning-r-and-b-singer-michael-eugene-archer-untitled-how-does-it-feel-dies-at-51/82b694fb-bf70-4503-aab0-ef86f37c28b0",
    "title": "Grammy-winning R&B singer who became an icon dead at 51",
    "publish_date": "Tue, 14 Oct 2025 17:02:40 +0000",
    "category": "entertainment",
    "authors": [
      "Oct"
    ],
    "text": "D'Angelo, the Grammy-winning R&B singer recognised by his raspy yet smooth voice and for garnering mainstream attention with the shirtless\n\nUntitled (How Does It Feel)\n\nmusic video, has died. He was 51.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/social-media-ban-youtube-requests-exemption-from-new-restrictions-politics-news/7de210e9-9eda-4558-9e5a-6a9d30c56238",
    "title": "YouTube cites Troye Sivan as reason for exemption from social media ban",
    "publish_date": "Mon, 13 Oct 2025 10:39:01 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "Google has claimed Australia's impending social media ban for kids under 16 could make children less safe by removing parental controls.\n\nThe tech giant has not given up on its push for a YouTube exemption to the laws, which come into effect on December 10.\n\nAll child accounts active on that date would be disabled, but kids would still be able to watch without an account.\n\nYouTube is seeking an exemption from the under-16s social media ban. (CFOTO/Future Publishing/Getty Images/File via CNN)\n\n\"Forcing kids to use YouTube without an account removes the very parental controls and safety filters built to protect them﻿,\" Rachel Lord, Google and YouTube's public policy and government affairs manager, told a Senate committee.\n\n\"It's also the ability of parents to set up supervised accounts for their children.\"\n\nLord said the restrictions also prevent a career path for emerging stars such as Troye Sivan, who found fame on YouTube.\n\n\"You don't need to look too hard to find Australian success stories that started their career on YouTube,\" Lord said.\n\nAustralia's own Troye Sivan found early fame on YouTube. (Getty)\n\nNicola Palfrey from Headspace said while young people were unsure of what would happen on December 10, at least a third were sure they would get around the restrictions.\n\nDespite YouTube's plea to the Senate, Communications Minister Anika Wells today told executives from social media giants Meta, Snapchat, YouTube and Tiktok there will be no exemptions and the platforms will be expected to facilitate the new restrictions.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-15/afl-trade-period-day-live-updates-merrett-curnow-petracca/105893932",
    "title": "Live: Merrett and Curnow mega-deals in the balance on AFL trade deadline day",
    "publish_date": "Wed, 15 Oct 2025 01:20:13 +0000",
    "category": "sports",
    "authors": [
      "Chris De Silva",
      "Dean Bilton"
    ],
    "text": "Does Christian Petracca to Gold Coast look likely before the deadline? - Gawny\n\nI think of all the big-name players looking at moving today, Christian Petracca to the Suns appears most likely.\n\nThe latest reports suggest the Suns are willing to table picks 7 and 8 in the deal, which I think is a very fair offer for a player of Petracca's quality.\n\nThere will be some haggling as per usual, but I think this one is one that doesn't necessarily go down to the wire.\n\nIf I had to list the order in which the three big names get done, I'd say it goes Petracca, Curnow and then Merrett (I still think Merrett probably doesn't happen).",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-15/convicted-rapist-selected-to-compete-in-beach-volleyball-event/105892968",
    "title": "Calls to ban convicted rapist from playing at beach volleyball championships",
    "publish_date": "Wed, 15 Oct 2025 00:54:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "Convicted Dutch child rapist Steven van de Velde has been scheduled to play at the Beach Volleyball World Championships in Australia next month, in a prominent match against an Australian team.\n\nIn a draw released on Tuesday, van de Velde and teammate Alexander Brouwer are scheduled to play against Australian pairing D'Artagnan Potts and Jack Pearse on November 14 in Adelaide.\n\nVan de Velde was sentenced to four years in prison in 2016 after admitting to three counts of rape against a child who he had met on Facebook, with the incident taking place in August 2014.\n\nHe was released after serving 12 months of his sentence.\n\nSelection of the Olympian to play at the championships in Adelaide has drawn criticism with a Change.org petition attracting more than 1,600 signatures since it was started over the weekend.\n\nThe petition is calling on the Department of Home Affairs not to grant his visa on legal grounds.\n\n\"Allowing an individual convicted of such a heinous child sexual offence to enter Australia not only undermines our nation's commitment to protecting children and survivors of sexual violence, it sends a devastating message to victim-survivors across the country,\" the petition said.\n\nThe ABC has contacted the Department of Home Affairs.\n\nA spokesperson from FIVB, the international governing body responsible for all forms of volleyball, confirmed van de Velde had qualified and was eligible to participate in the world championships next month.\n\n\"Individual players are selected by the respective country in line with the policies defined by the National Federation and National Olympic Committee,\" the spokesperson said.\n\n\"The FIVB respects the autonomy of National Federations and National Olympic Committees to select the national teams that will represent their country.\n\n\"The FIVB also has an obligation to uphold the right to work of all athletes, provided they meet the established eligibility requirements.\"\n\nSteven Van De Velde served 12 months of his four-year sentence. (Getty Images: Lucio Tavora)\n\nThe spokesperson added FIVB \"condemns all forms of harassment and abuse in the strongest possible terms\".\n\nWhen asked if van de Velde had sought a visa to enter Australia and whether one should be granted, the spokesperson said it was up to the hosting nation's authorities to decide.\n\n\"While the FIVB supports athletes and teams in facilitating the necessary administrative processes, the final decision rests solely with the authorities of each respective country,\" they said.\n\nIn a statement, Volleyball Australia said it was responsible for delivery of the event and hosting obligations, with the eligibility of competitors falling to FIVB.\n\nLast year the Netherlands came under fire after selecting van de Velde to represent the country in beach volleyball at the Paris Olympics.\n\nVan de Velde resumed his volleyball career in 2018 after he was released from prison and has since represented the Netherlands in multiple international tournaments.\n\nDespite his previous conviction, the Dutch Olympic Committee last year said van de Velde met \"all qualification criteria\" to make the Olympic team.\n\nVan de Velde has previously referred to the 2014 incident as \"the biggest mistake of my life\".",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-15/sa-ag-report-finds-hydrogen-office-spent-285-million/105893332",
    "title": "SA government's $285m spend on hydrogen revealed",
    "publish_date": "Wed, 15 Oct 2025 00:40:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "South Australia's Office for Hydrogen Power spent more than $280 million before the state government scrapped the agency amid the failure of its Whyalla hydrogen project.\n\nBut the government says it will be able to recoup much of the cost by selling the generators it purchased for the shelved hydrogen plant.\n\nThe Malinauskas government had allocated $593 million to build a hydrogen power plant in Whyalla, setting up an Office for Hydrogen Power in May 2022 to deliver on its pre-election hydrogen promises.\n\nBut the hydrogen project was effectively cancelled in February 2025 after months of speculation about a cost blowout as the private sector pulled out of green hydrogen projects across Australia.\n\nThe government said it diverted the money for the hydrogen project to support its takeover of the embattled Whyalla steelworks.\n\nMoney from the hydrogen project was diverted to the Whyalla steelworks. (ABC News: Che Chorley)\n\nBut an auditor-general report tabled in parliament on Tuesday found the hydrogen office — which was dissolved in May — has spent $285.2 million over three years.\n\nThis includes capital costs of $209.2 million, with the agency writing off $85.7 million of that because it related to early works on designing hydrogen production and storage in Whyalla.\n\n\"This accounting treatment recognises that there is insufficient certainty that economic benefits will flow to the state,\" the auditor-general report states.\n\nThe office also incurred $53.4 million in operating expenses and $12.5 million for the purchase of land at Whyalla.\n\nThe hydrogen power plant had been proposed for Whyalla. (ABC News: Brant Cumming)\n\nThe state opposition said the report showed the \"eye watering amount of money that Labor has gambled and lost on its hydrogen fantasy\".\n\n\"The Office of Hydrogen Power spent over $285 million in just three years in its existence on their hydrogen power plant that's now destined for the scrap heap,\" shadow energy spokesperson Stephen Patterson said.\n\nMr Patterson said the government could not argue that its $593 million allocated to the hydrogen plant was being transferred to the Whyalla steelworks.\n\n\"In fact, a big chunk of this money is not going to be recovered,\" he said.\n\nStephen Patterson says a \"big chunk\" of the money will not be recovered. (ABC News)\n\nBut the government said it will recoup much of its spending by selling the four gas turbines it purchased for the hydrogen plant.\n\nEnergy and Mining Minister Tom Koutsantonis said the 200-megawatt generator will provide additional generation capacity for the state when it is in private hands.\n\n\"We're buying generators, and those generators have a cost, and what you're seeing reflected in the auditor-general's report is the rough cost estimates of the generators,\" he said.\n\n\"Without wanting to prejudice any potential sale process, obviously the generators have a value, they're an asset that the government will hold.\"\n\nAsked if the sale of the generators would recoup the full $285 million spent by the hydrogen office, Mr Koutsantonis said: \"I would suspect that we'll do exceptionally well given the wait for generators and the demand for these generators globally\".\n\nTom Koutsantonis says the government will recoup much of its spending by selling gas turbines it purchased for the hydrogen plant. (ABC News: Ashlin Blieschke)\n\n'We have the intellectual property'\n\nThe Department for Energy and Mining, which took over responsibility for hydrogen in May, told the auditor-general the sales process for the turbines opened in early August.\n\nIt also advised the auditor-general that it intends to \"recoup the original purchase price\" in the sale.\n\nRegarding the $85.7 million deemed to have \"no immediate future economic benefit\", Mr Koutsantonis said this impairment was \"an accounting standard for projects that have been cancelled\".\n\n\"When you buy infrastructure or you procure reports or you do engineering studies or you do works that might be used for other purposes — but not for the specific purpose — the auditor-general … requires that that become an impairment,\" he said.\n\nTom Koutsantonis says infrastructure acquired for the hydrogen plant could still be used. (ABC News: Justin Hewitson)\n\nHe cited the Port Dock rail extension project as an example.\n\nThe $16.4 million rail extension project was started by the Weatherill government in 2017 and scrapped by the Marshall government in 2019.\n\nThe Malinauskas government restarted the project in 2022 for a cost of more than $50 million, and Mr Koutsantonis said the government was able to use sleepers and rail lines that were acquired before the project was shelved.\n\nHe said the infrastructure acquired for the hydrogen plant, including substations and transmission lines, could still be used.\n\n\"All the studies that we've done as part of the hydrogen jobs plan to get a generator operational can absolutely be used, we have the intellectual property over all that work,\" he said.\n\n\"A lot of it is for infrastructure that can be used for other projects as well.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-15/home-in-place-evicts-morningside-tenants/105885624",
    "title": "Tenants evicted after taxpayer-funded landlord fails to maintain property",
    "publish_date": "Wed, 15 Oct 2025 00:25:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Scott Giuffrida feared he would become homeless after being told he would be evicted from transitional housing due to his landlord's ongoing failure to maintain his apartment.\n\nCommunity housing provider Home in Place initially told Mr Giuffrida there were \"no guarantees\" they would find another home for him by the eviction date of October 31.\n\nMr Giuffrida is one of six transitional housing tenants being evicted from the Morningside apartment, which Home in Place rents from a private landlord.\n\nHome in Place chief operating officer Emma O'Hara said the apartment required \"significant maintenance work\" that the landlord was unwilling to do.\n\n\"While we have previously raised a number of maintenance issues with the owner, not all have been addressed in a timely way,\" Ms O'Hara said.\n\n\"The owner's representative has now indicated a preference to take back possession of the property rather than proceed with these works at this time.\"\n\nA railing dangles in the air over an eroded stairwell. ( ) Mouldy, eroded concrete over a leaky roof. ( ) The Department of Housing says it will try to find alternative accommodation for the five other evicted tenants. ( ) Scott Giuffrida says he spent two years trying to get his broken stove replaced. ( )\n\nThe landlord's representative and his managing agent both declined to comment.\n\nHome in Place would not say why it had not taken the landlord to the Residential Tenancies Authority, the government agency that can enforce tenancy law.\n\nMr Giuffrida said he had lived in that transitional housing unit since 2020 while on the waiting list for permanent social housing.\n\nHe said his repeated requests for repairs were ignored for months and years at a time.\n\nMr Giuffrida said the apartment had broken appliances, doors that would not shut, leaking roofs and mouldy, eroded concrete.\n\nInternal Home in Place investigation documents found \"extensive delays\" in repairs, including a broken stove that was not replaced for two years.\n\nA follow-up investigation found the replacement stove the landlord provided was also non-compliant.\n\nMr Giuffrida says Home in Place had provided taxpayer funding to a private landlord without ensuring he maintained the property to minimum legal standards.\n\n\"I thought coming to government-subsidised community housing that it would be all above board, but it's just been horrendous,\" Mr Giuffrida said.\n\n\" This landlord should not be given a subsidy to provide this lack of service. \"\n\nMr Giuffrida said he planned to move into a share house through the private market, while others in the apartment waited to receive an offer of alternative accommodation.\n\nA Department of Housing spokesperson said Home in Place rented the six units from the private sector under a state-funded Community Rent Scheme.\n\nThe spokesperson said the department was \"not party to this legal arrangement\", but it would assist Home in Place to find the tenants alternative housing.\n\n\"The department is working with Home in Place to provide support to the Morningside tenants who need housing assistance following the decision to end these arrangements,\" the spokesperson said.\n\nPenny Carr says it is difficult to compel a landlord to fulfil their legal obligations. ( )\n\nTenants Queensland chief executive Penny Carr said it was often prohibitively difficult for tenants to enforce their own legal rights, especially if they were in social housing.\n\n\"We find there are many people who are living in properties that are not fit to live in, but generally the tenants don't enforce their rights,\" Ms Carr said.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-15/live-updates-usa-socceroos-international-friendly-fifa-world-cup/105884330",
    "title": "Live: USA strikes back after Socceroos took early lead in Denver",
    "publish_date": "Wed, 15 Oct 2025 00:07:59 +0000",
    "category": "sports",
    "authors": [
      "Simon Smale"
    ],
    "text": "Well, that's got a bit heated thanks to some frankly astonishing refereeing decisions.\n\nThere may be a bit of frustration by the USA players as well, who has dominated this game to the tune of having 70 per cent possession, six shots to one and more than double the number of passes than the Aussies, as well as having their skipper and talisman removed from the field through injury.\n\nHowever, it is 1-1 at the break.\n\nJordan Bos' goal against the run of play the opener, before Haji Wright poked home to level 15 minutes or so later.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-15/uk-us-sanction-south-east-asian-scam-bitcoin-investment-fraud/105892984",
    "title": "US seizes billions in bitcoin linked to 'massive' alleged scam",
    "publish_date": "Tue, 14 Oct 2025 23:38:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "The US government has seized more than $US14 billion ($21.6 billion) in bitcoin and charged the founder of a Cambodian conglomerate over an alleged massive cryptocurrency scam.\n\nPrince Holding Group chair Chen Zhi and unnamed alleged co-conspirators have been accused of exploiting forced labour to dupe would-be investors and using the proceeds to purchase yachts, jets and a Picasso painting.\n\nSouth-East Asia's cyberscammers hiding behind digital masks AI tools such as face-swapping and chatbots are being used by South-East Asia's crime syndicates to make their scams more efficient and effective. However, some operations appear to be having less success with the new tech than others.\n\nUS Attorney Joseph Nocella called it \"one of the largest investment fraud operations in history\".\n\nProsecutors said that at one point Mr Chen bragged that the so-called \"pig-butchering\" scam was pulling in $46m a day.\n\nThe have accused Mr Chen of sanctioning violence against workers, authorising bribes to foreign officials and using his other businesses, such as online gambling and cryptocurrency mining, to launder illicit profits.\n\nMr Chen was the \"mastermind behind a sprawling cyber-fraud empire,\" Assistant Attorney-General John Eisenberg alleged.\n\nThe 38-year-old has been charged with wire fraud conspiracy and money laundering conspiracy offences.\n\nClaims of forced labour in compounds\n\nAccording to Mr Chen's indictment, Prince Holding Group built at least 10 compounds in Cambodia.\n\nWorkers – often migrants held against their will – were forced to contact thousands of victims through social media or online messaging platforms, build rapport and entice them to transfer cryptocurrency with hopes of big investment returns, the indictment said.\n\nScams are often run out of walled compounds such as this one that was raided by Cambodian authorities in 2022. (Reuters: Cindy Liu)\n\nProsecutors said the money was funnelled into other Prince Holding Group businesses and shell companies and used to pay for travel and entertainment, watches, holiday homes, rare artwork and a Rolex watch for an executive's spouse.\n\nOne victim was scammed out of more than $617,000 in cryptocurrency, prosecutors said.\n\nScam centres pop up on Australia's doorstep As scam centres run by organised crime find it harder to operate in South-East Asia, evidence emerges of them moving into the Pacific and setting up lucrative operations estimated to net billions each year.\n\nThe compounds allegedly functioned as forced labour camps and had dormitories surrounded by high walls and barbed-wire fences.\n\nInside the compounds, automated call centres used hundreds of mobile phones lined up on racks controlling tens of thousands of fake social media profiles, prosecutors said.\n\nAccording to the treasury department's sanctions statement, workers at the compounds were held captive, isolated and sometimes beaten after being lured with the promise of high-paying jobs in fields such as customer service or tech support.\n\nPhotographs included in Mr Chen's indictment showed a man with a bloody gash on his face, dozens of men on the ground with their hands bound, and a man with red lash marks on his chest and arms.\n\nMr Chen allegedly personally approved of at least one beating, which involved a man believed to be causing trouble at a compound, but cautioned that he not be \"beaten to death\".\n\nIn 2023, the United Nations estimated about 100,000 people were being forced to carry out online scams in Cambodia, as well as at least 120,000 in Myanmar and tens of thousands in Thailand, Laos and the Philippines.\n\nAlleged victims could be repaid\n\nMr Chen, a native of China who is also known as \"Vincent,\" remained at large as of Tuesday, according to prosecutors.\n\nHe faces up to 40 years in prison if convicted over the US charges.\n\nThe US could use the 127,271 bitcoins it seized to repay victims if the court approves such a course of action.\n\nUS and British authorities have also imposed sanctions on Mr Chen's company, which is involved in real estate development and financial services.\n\nThe US Treasury Department has declared it a transnational criminal organisation.\n\nChinese authorities have been investigating the company for cyber scams and money laundering since as early as 2020, according to court records reviewed by the US Institute of Peace.\n\nCambodian government arrests more than 1,000 people in cybercrime raids A crackdown by Cambodian authorities on cybercrime has led to more than 1,000 arrests.\n\nJacob Daniel Sims, a transnational crime expert and visiting fellow at Harvard University's Asia Center, described Prince Holding Group as \"an essential part of the scaffolding that makes global cyber-scamming possible\".\n\nHe said Mr Chen was a \"central pillar\" of the criminal economy intertwined with Cambodia's ruling regime.\n\nMr Chen has served as an adviser to Prime Minister Hun Manet and his father, former prime minister Hun Sen, and was honoured with the title \"neak oknha\" — the equivalent to an English lord.\n\n\"While the indictment and sanctions don't instantly dismantle these networks, they fundamentally change the risk calculus,\" Mr Sims said.\n\nThey make \"every global bank, real estate firm and investor think twice before touching Cambodian elite money\".\n\nLast year the US and UK imposed sanctions on Ly Yong Phat, one of Cambodia's richest men and a leading member of the ruling Cambodian People's Party, after he was implicated in allegations of forced labour, human trafficking and online scams.\n\nABC/Wires",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-15/paramedic-student-glut-no-jobs-ambulance-victoria/105874740",
    "title": "Hundreds of Victorians graduating as paramedics forced to go interstate for jobs",
    "publish_date": "Tue, 14 Oct 2025 23:34:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Joey, whose name has been changed to protect his privacy, is a qualified paramedic working in the small rural Victorian town he grew up in.\n\nIt means he can keep connected to his community, use his local knowledge in his job, and is more likely to stay in the role long-term.\n\nBut not every budding Victorian paramedic has been so lucky.\n\nLast year in Victoria, more than 800 students graduated with a paramedicine degree but competition for a job is tight.\n\nNew graduates are competing for just 300 placements in Victoria, against experienced paramedics from around Australia.\n\nLucky to stay local\n\nJoey worked for two years as an ambulance community officer (ACO) in his hometown, providing advanced first aid and supporting qualified paramedics, before taking the next step to study paramedicine through distance education at an interstate university.\n\nHe also received a study scholarship that helped ease the financial burden, while allowing him to continue working as an ACO in his community.\n\nWhile he expected to have to move interstate to get a job as a paramedic, his scholarship included a clause from Ambulance Victoria saying it would \"try and get people back from rural areas to support rural communities\".\n\n\"I've been very lucky to stay rural,\" Joey said.\n\nA student glut\n\nAccording to the 2023-2024 Ambulance Victoria annual report, only 134 graduate paramedics were recruited in Victoria that financial year.\n\nAmbulance Victoria said preference is not given to Victorian graduates as it seeks \"the most capable and committed individuals\" from a pool of local university graduates, as well as interstate and international paramedics.\n\nAmbulance Victoria would not say how many interstate graduates it recruited each year.\n\nAmbulance Services Minister Mary-Ann Thomas said recruitment was a matter for Ambulance Victoria to ensure \"the best and most qualified people\" work as paramedics in the state.\n\nAmbulance Victoria Union secretary Danny Hill says it would be \"helpful\" if paramedicine students knew how difficult it is to get a job in Victoria. (ABC News: Peter Healy)\n\nVictorian Ambulance Union secretary Danny Hill said graduates who languish on the jobs waiting list were unable to keep their skills up-to-date.\n\n\"It would be helpful if the likelihood of actually getting employment in [Victoria] was communicated to them earlier because often, they tell us that they weren't told they only take on 300 graduates a year,\" Mr Hill said.\n\nIn a statement, a spokesperson for Victoria University said it was open with students about employment opportunities.\n\nAmbulance Victoria only took on 134 graduate paramedics in the 2023-2024 financial year, but roughly 800 students graduate each year. (ABC News: Margaret Burin)\n\nThe regional retention problem\n\nMr Hill said another issue with Ambulance Victoria's current recruitment policy was staff retention.\n\nHe said recruiting regional people to work in regional locations led to improved staff retention rates in rural areas.\n\n\"Straightaway as soon as a person who's grown up in Melbourne and lives in Melbourne is sent to a remote area, they want to [return to the city] so they put themselves down on a preference list to try and move and then they eventually get a transfer and then they have to re-recruit [for the regions],\" Mr Hill said.\n\nMr Hill said he would welcome moves to train more people who have worked as ambulance community officers in regional areas to become local paramedics.\n\n\"It's better to find people that will actually work in those locations — it makes much more sense to do that rather than have someone come in from interstate,\" he said.\n\nJoey said his local experience had given him intimate knowledge of how to deal with emergency situations in his rural town.\n\n\"You already understand the lay of the land, you know where to go and where other crews are coming from,\" he said.\n\n\"The way we work in rural communities can sometimes be looked at as a lifestyle, so if you don't want to do the lifestyle necessarily and you just want it to be a job, then you can just find another branch.\n\n\"I got to return back to where I kind of started and I'm still here three years later, which is nice.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-15/football-england-thrashes-latvia-to-reach-world-cup-finals/105893278",
    "title": "'Hungry' England thrashes Latvia to qualify for World Cup",
    "publish_date": "Tue, 14 Oct 2025 23:32:33 +0000",
    "category": "sports",
    "authors": [],
    "text": "England has booked its place in the men's World Cup finals, as captain Harry Kane scored twice in a 5-0 romp away to Latvia in Riga.\n\nThe victory ensures England will finish top of its qualifying group ahead of next year's tournament, which will be hosted by United States, Canada and Mexico.\n\nIt took England 25 minutes to break the 0-0 deadlock in the tree-lined Daugava Stadium with Anthony Gordon cutting in from the left to drive a shot past Latvia goalkeeper Krišjānis Zviedris.\n\nLatvia, 137th in FIFA's rankings, was punished twice just before half-time.\n\nJapan makes history against Brazil Japan defeats Brazil 3-2 in their international friendly at a sold-out Tokyo Stadium.\n\nKane drilled home after the hosts were caught playing out from the back and he then converted a penalty awarded after he was pulled back in the area.\n\nDjed Spence's cross was turned into his own goal by Maksims Toņiševs in the 57th minute and substitute Eberechi Eze wrapped up a comfortable night for England with a sweetly hit fifth late in proceedings.\n\nThomas Tuchel's England has a maximum 18 points from its six matches, with Albania second in Group K on 11 points.\n\n\"Another tournament, we make it look easy but we have to fully focus on every game,\" Kane told ITV Sport.\n\n\"It doesn't matter who we play it's about setting a high standard and keeping the momentum.\"\n\nEngland is unbeaten in its last 37 World Cup qualifiers dating back to 2009.\n\nTuchel has completed the easy part of his remit by leading England to next year's finals.\n\n\"A top performance, a top result: six wins, six clean sheets, so very happy,\" Tuchel said.\n\n\"We have been dominant in games and hungry. We are on our way.\n\n\"We play a high-press and a physical game that we play, but everyone buys into it. It's a pleasure to coach them.\n\n\"Step by step we are getting there.\"\n\nReuters",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-15/coolgardie-to-dig-itself-out-of-debt/105881252",
    "title": "Coolgardie council to rebuild trust after avoiding suspension",
    "publish_date": "Tue, 14 Oct 2025 23:02:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Residents in the Shire of Coolgardie say they are happy that local government elections will go ahead this week, but frustrations remain about how the embattled regional council has arrived at this point.\n\nWestern Australian Local Government Minister Hannah Beazley yesterday announced she would not suspend Coolgardie's council, almost two months after issuing a show-cause notice to the shire.\n\nMs Beazley yesterday branded the financial situation at the debt-laden shire as \"unprecedented in the history of this state\".\n\nDespite this, she granted the shire's leadership a further 12 months to \"get their house in order\".\n\nMs Beazely told a busy community meeting that the council would not be suspended, and would be given 12 months to improve its situation. (ABC Golfields: Macey Turner )\n\nWhile the minister's announcement was met with cautious applause during a community meeting held in Coolgardie, concerns were expressed about how the shire would return to a financially stable position\n\nLong-term resident Jan McLeod, from Widgiemooltha, said she was disappointed with the lack of community engagement during the past year.\n\nShire of Coolgardie resident Jan McLeod says she is glad the local election will go ahead. (ABC Goldfields: Macey Turner )\n\n\"They have not involved the community, they have not asked us, and that is what the community needs,\" she said.\n\nShe said community members had been raising concerns for years before the minister intervened, and had made several attempts to escalate concerns to other agencies.\n\n\"We are not the only local government that has had this difficulty, and yet we are the one that they say is 'the worst case in Western Australia', so they should look at themselves very carefully,\" she said.\n\n\"The community had nowhere else to turn.\"\n\nShire of Coolgardie residents had mixed emotions after the council was not suspended. (ABC Goldfields: Macey Turner )\n\nMore than just financial recovery\n\nThe shire financial recovery plan showed it would be able to clear its $27.5 million debt by 2035.\n\nFollowing Ms Beazley's decision, shire president Mal Cullen said they remained confident they would prove they were on the right track in a shorter time frame.\n\nMr Cullen said the sale of their most significant asset, a workers' accommodation village, would \"go a long way\" to proving itself a financially stable shire.\n\n\"For our council and our administration, it's recognition of a lot of hard work that's gone into both the shire's position paper and the financial recovery plan over the past four or five months,\" he said.\n\nMal Cullen and Aaron Cook at a council meeting in September 2025. (ABC Goldfields: Macey Turner )\n\nBut Mr Cullen said stability was not just about clearing debt.\n\nHe hoped that repaying creditors would also rebuild trust.\n\n\"There's certainly a fair bit of concern from a fair few residents, and that's part and parcel of the rebuilding of those relationships with the community,\" he said.\n\nPush for voters\n\nOn a positive note, Ms Beazley said voter turnout for Coolgardie's election this weekend was expected to exceed the state average.\n\nVoting is not compulsory in Western Australian local government elections, though strongly encouraged. Elector participation across all WA local government elections sat at 31.2 per cent in 2023, according to the WA Electoral Commission. Coolgardie recorded a 31.9 per cent participation rate at that election.\n\nBut in the lead-up to Saturday's ballot, Coolgardie resident and council candidate Paul Wilcox said there was a noticeable reluctance to vote due to the uncertainty with the shire.\n\nCouncil candidate Paul Wilcox says he believes the uncertainty regarding Coolgardie's future has deterred people from voting. (ABC Goldfields: Macey Turner )\n\n\"[There's been] a bit of reluctance to get involved because people are asking questions if there's any point in voting,\" he said.\n\n\"I'm hoping even though we've only got five or six days to go, that this gives more of a push for people who were thinking about voting to get out there and vote.\"\n\nBuck stops at the council\n\nCurrent councillors at a meeting in September 2025. (ABC Goldfields-Esperance: Macey Turner.)\n\nMs Beazley hoped that upcoming reforms to the Local Government Act would bring more accountability to the sector.\n\nThis includes the appointment of a local government inspector from January next year. The inspector will have greater powers to investigate and intervene in local government conduct issues.\n\nMs Beazley said while she had frustrations with \"threshold\" limitations imposed by the Local Government Act, it was ultimately the council's responsibility to ensure proper financial oversight.\n\n\"It should not take this level of state government intervention for council to act responsibly,\" she said.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-15/queensland-health-minister-knew-about-caboolture-/105890580",
    "title": "Queensland health minister knew of hospital failures before going on leave",
    "publish_date": "Tue, 14 Oct 2025 22:53:00 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Queensland's health minister has revealed he knew about failures at Caboolture Hospital involving the death of a patient after delays to medical scan results, before he went on holiday when the issue later became public.\n\nIn early September a patient of the hospital's Specialist Outpatient Service went to the emergency department in a serious condition, unaware they had advanced cancer after a five-week delay to receiving their medical scan results.\n\nThe imaging results had not been reviewed by doctors, and the patient later died, triggering an investigation by Metro North Health.\n\nIn a statement to the ABC, health minister Tim Nicholls said his office was alerted to the case late on September 17.\n\nDo you know more? Contact Antonia O'Flaherty at Oflaherty.Antonia@abc.net.au or on antoniaoflaherty@protonmail.com\n\nThe minister did not say whether he alerted other members of government to the issue, but that he asked the health department's director general to determine whether the issue would impact other patients.\n\nBy \"late September\" Metro North Health became aware it was a systemic issue at the outpatient service, initially believing the imaging results of up to 9,000 patients may not have been seen by doctors.\n\nThe number of patients involved has since increased to 12,529.\n\nAfter the issues were revealed by the ABC, Queensland Premier David Crisafulli said the government had only been briefed on the issue on September 29.\n\nThe health minister was on leave from September 19, returning on October 13.\n\nHealth minister says he ordered internal investigation\n\nMr Nicholls was asked in state parliament during Question Time whether he knew about the failures at the health service before he went on leave.\n\nMr Nicholls said when he became aware of the first case at Caboolture Hospital, he directed Queensland Health director-general David Rosengren to \"carry out a thorough investigation\" before he went on leave.\n\n\"So yes I was aware of the one case, and yes I discussed it with the director-general, and yes with the director-general we were concerned about the failures,\" he said.\n\nHealth minister Tim Nicholls. (ABC News: Chris Gillette)\n\n\"And yes we directed metro [north] health and their director of medical services to undertake a full scan and that is the appropriate way to go, we are a responsible government.\"\n\nThe minister told the ABC his office was first alerted to the extent of the issue on September 29.\n\nIn a statement, the Opposition leader Steven Miles said the health minister should not have \"jetted overseas\" after being told about the \"major issue\" at Caboolture Hospital.\n\n\"This is not a health bungle, this is a blatant failure of leadership, of ministerial responsibilities and of accountability\".\n\nThe problem with medical scan results going unchecked at the outpatient service only became public after the ABC sent questions to Metro North Health on September 29.\n\nQueensland hospital investigation Queensland Health will investigate reports patients did not receive crucial test results from Townsville hospital.\n\nIn the statement that day Metro North Health told the ABC that the issue was identified \"early in September\" and described it as \"a gap\" in how medical imaging results were distributed within its Specialist Outpatients department.\n\nThe following day Metro North Health chief medical officer Elizabeth Rushbrook told media the health service became aware that it was a systemic issue by \"late September\" but did not provide specific dates.\n\nThe problem stemmed from an internal change to process in April 2023, which meant paper copies of imaging results may not have been given to clinicians, and the hospital couldn’t be sure that electronic results were checked either.\n\nPremier insists acting minister doing an 'excellent job'\n\nAt a media conference on September 30, Queensland Premier David Crisafulli said the government had only been briefed on the extent of the issue the day before.\n\n\"I've asked the health and hospital network to talk to Queenslanders today.\n\n\"I have this view that where information comes to light, it has to be shared, particularly where it impacts an individual,\" he said at the press conference.\n\nDuring the same week, it also emerged that at Townsville's urology department some patients, some of whom have cancer, had not received test results or follow-up care, with Queensland Health launching a Part 9 investigation into the matter on September 29.\n\nWhen asked if the health minister should return from leave, Mr Crisafulli said the acting minister, Dale Last, was doing an \"excellent job\".\n\nMetro North Health said only patients who had imaging at the specialist outpatient service between April 1 2023 and September 4 2025 are affected and concerned patients can call the hospital on 07 5316 5163.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-15/japan-beats-brazil-in-football-international-friendly/105893036",
    "title": "Japan makes history as Brazil records 'unacceptable' loss",
    "publish_date": "Tue, 14 Oct 2025 22:49:20 +0000",
    "category": "sports",
    "authors": [],
    "text": "Japan has staged a remarkable second-half comeback to defeat five-time world champion Brazil 3-2 in a men's friendly at a sold-out Tokyo Stadium.\n\nIt is Japan's first victory over Brazil in 14 meetings, following 11 wins by the South Americans and two draws.\n\nThe match was a tale of two halves, with Brazil dominating the opening 45 minutes before collapsing after the break.\n\nTrailing 2-0 at half-time after goals from Paulo Henrique and Gabriel Martinelli, the hosts capitalised on Brazilian defensive errors before Ayase Ueda's late header sealed a famous victory.\n\nTakumi Minamino halved the deficit in the 52nd minute after Fabrício Bruno's misplaced pass allowed the forward to score from just inside the box.\n\nKeito Nakamura levelled scores in the 62nd minute, before Japan's substitute Junya Ito provided the decisive moment.\n\nIto delivered a pinpoint corner in the 71st minute, which Ueda met with a powerful header after beating defender Lucas Beraldo to the ball.\n\nJapan fought back from 2-0 down to defeat Brazil. (Reuters: Kim Kyung-Hoon)\n\n\"It was a blackout from everyone in our side in the second half,\" Brazil captain Casemiro told TV Globo.\n\n\"This is the highest level, if you fall to sleep in an entire half it can cost you a World Cup, a Copa America, an Olympic medal.\n\n\"It's just unacceptable and we must learn from it because the World Cup is just a few months ahead of us.\n\n\"We have to take care of the details because they can cost you everything.\"\n\nBrazil's early control came despite coach Carlo Ancelotti fielding a heavily rotated side compared to last week's commanding 5-0 win over South Korea.\n\nAncelotti only kept midfielders Casemiro and Bruno Guimarães and forward Vinícius Júnior.\n\nIn the first half, Guimaraes orchestrated proceedings in Brazil's midfield and set up the opener in the 26th minute with a perfectly weighted through ball to right back Henrique, who beat the offside trap and slotted home.\n\nSix minutes later, Martinelli doubled the lead with a composed finish after a clever lobbed pass from Lucas Paquetá, as Brazil's measured build-up play and high pressing left Japan chasing shadows.\n\nReuters",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-15/illawarrra-academy-of-sport-pen-testing-day-young-athletes/105878204",
    "title": "Young athletes get glimpse into pro careers at open testing day",
    "publish_date": "Tue, 14 Oct 2025 22:46:07 +0000",
    "category": "sports",
    "authors": [],
    "text": "Sixteen-year-old basketball player Cody Luzuriaga wants to play professionally and he does not mind where, but first he needs to see how he stacks up against elite athletes his age.\n\nHe will need excellent endurance to succeed in the high-intensity sport, as well as strength to use his body against defenders and explosive jumping ability.\n\nAustralian sports stars such as swimmer Emma McKeon, surfer Sally Fitzgibbons and skateboarder Keiran Woolley came through the Illawarra Academy of Sport (IAS).\n\nNow it has opened its doors to the public to see who has what it takes.\n\n\"I was most interested in testing my jumping ability because I play basketball, as well as my speed and strength,\" Cody said.\n\n\" I'd love to play professionally anywhere, but you have to seek out people who are better than you and have more knowledge than you. \"\n\nCourtney Gallagher says the day provides information the athletes can use as they develop. (ABC Illawarra: Justin Huntsdale)\n\nAbout 50 students were tested by staff at the IAS in Wollongong.\n\n\"A lot of the kids have never been through testing before,\" strength and conditioning coordinator Courtney Gallagher said.\n\n\"So it's good data for them to have to improve on and develop their athletic ability and, if they do similar tests in the future, they can look back on how far they've come.\n\n\"We'll compare them against the athletes already in the IAS and provide them with averages and where their results sit — that gives them an idea if sport is something they want to pursue.\"\n\nStudents were measured on their athletic endurance at the final stage of the testing. (ABC Illawarra: Justin Huntsdale)\n\nTesting provides vital yardstick\n\nAthletes aged between 12 and 17 underwent sprinting, jumping, mobility, power and endurance tests at the University of Wollongong Sports Hub.\n\nMs Gallagher said the day could provide a reality check for students, but also valuable advice to help them reach a higher level.\n\n\"It's quite difficult [to make it professionally] — you've got to get that development early on, but even if you don't, you can still get into pathways at a later adolescent age,\" she said.\n\n\" It's really useful for the athletes to get that insight of where they're sitting and what they can do to be at that professional level in the future. \"\n\nThe open testing day aims to attract children from Aboriginal or Torres Strait Islander backgrounds, as well as culturally diverse and low socio-economic backgrounds.\n\nSalv Carmusciano has worked in sports management in AFL and football. (ABC Illawarra: Justin Huntsdale)\n\nIllawarra Academy of Sport chief executive Salv Carmusciano said the day was an important part of ensuring people from disadvantaged backgrounds had a pathway to professional sport.\n\n\"For us, it's about being accessible — we've been around 40 years and prided ourselves on having a scholarship program where the kids don't pay anything,\" he said.\n\n\"Costs can be a barrier and we like to think an organisation like ours has been able to remove that and, for us, we'd like to have more places closer to those [disadvantaged] communities that don't require a 30-minute trip in the car, and be more accessible.\n\n\"They all have a dream and I believe they feel they've got what it takes — and so they should.\n\n\"Our job is to nurture that ambition and willingness to be the best they can be.\n\n\" Hopefully they leave today with a bit of hope. \"\n\nIAS staff measured the attendees' jumping ability. (ABC Illawarra: Justin Huntsdale)\n\n'A great day to experience'\n\nGerringong soccer player and runner Ada Houldsworth said the data from the day would provide a valuable resource as she continued to progress through her early sporting career.\n\n\"I came to see where I'm at and when I'm older to see how far I've come,\" the 12-year-old said.\n\n\"I've found the weighted lunges today challenging, but I was surprised how far I could actually jump, because I didn't know how to jump until I was 10.\n\n\" I think I've gone pretty well but it's definitely been challenging. \"\n\nStudents say the day will give them useful data to measure their improvement over time. (ABC Illawarra: Justin Huntsdale)\n\nAoife Moroney from Bowral in the Southern Highlands plays Oztag and touch football.\n\nShe said she played at a representative level for both sports but would like to make national teams in the future.\n\n\"Today gave me more confidence, because when I'm out on the field I can lose my confidence if there's a lot of new people around,\" Aoife said.\n\n\"Today was a great day to experience that.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-15/farmers-cutting-crops-for-hay-as-decent-spring-rain-doesnt-come/105884166",
    "title": "Farmers 'on a knife edge' as forecast rain fails to appear",
    "publish_date": "Tue, 14 Oct 2025 22:25:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Victorian farmers are cutting their crops for hay as the drought continues to bite across south-east Australia.\n\nIt's been a terribly dry spring so far in many places, defying the long-term weather forecast that predicted favourable warm and wet conditions.\n\nThe lack of rain has reduced the chance of good grain yields and many farmers are cutting their losses and making hay.\n\nIn some grain-growing regions, like the Victorian Mallee, the die has already been cast.\n\nMick Foott has cut 350 hectares of barley and wheat respectively, and is keeping a close eye on the rest of his crops.\n\nCrops are fast running out of moisture in the Mallee. (Supplied: Mick Foott)\n\n\"They’re hitting the wall big time,\" Mr Foott said.\n\n\"The barley was just not filling the head and wasn’t going to come to anything.\n\n\"At least if we cut if for hay, we'll get something,\" he said.\n\nMr Foott said his crops have done incredibly well, despite the fact forecast rain failed to appear.\n\n\"The Bureau has said that a lot lately and they’ve buggered this one up again,\" Mr Foott said.\n\nGrain crops like wheat and barley are being cut for hay across south-east Australia, as the dry weather persists. (Supplied: Katrina Dunn)\n\nTough all the way through\n\nUp the road in Hopetoun, grain grower Pat Hallam said his crops were \"hanging in there\".\n\n\"September was pretty dry and October’s given us nothing,\" Mr Hallam said.\n\nHe said he was unlikely to see \"big yields\" as a result.\n\n\"It’s just been a tough year. A tough start and a tough finish,\" he said.\n\nDespite the dry, Mr Hallam isn't planning to cut his crops for hay.\n\n\"We’re not geared up for hay and I can’t imagine the hay yields would be very high anyway,\" he said.\n\n\"We’ll just run it out to grain and cross our fingers and hope there’s a bit there.\"\n\nA 'shocker'\n\nRon Hards in far north-west Victoria has also endured a rough year with dry conditions.\n\n\"It's been patchy. Very light rain. I think we're up to about 80 or 90 millimetres for the year,\" he said.\n\n\" The highest rainfall we've had at once is around 12 millimetres. \"\n\nIan Arney says his region has missed out on the spring rain that could have turned the season. (ABC Rural: Cherie von Hörchner)\n\nIn the same region, grain grower Ian Arney has a similar story.\n\n\"We didn’t really get any decent opening rain until June,\" he said.\n\n\"Our largest rain event so far has been 11 millimetres, and we’re sitting at about 104 millimetres total for the year.\"\n\nMr Arney said just one decent rain in spring would have been enough to turn the season.\n\n\"Another 20 millimetres would’ve made a massive difference,\" he said.\n\n‘On a knife edge’\n\nIt’s been particularly dry around Lake Bolac, in south-west Victoria, which has had about half of its long-term average rain this season.\n\nAgronomist and rural supplies store manager, Cam Conboy, said the typically high rainfall region was in desperate need of a soaking.\n\n\"We’ve had about 220 millimetres for the growing season, whereas normally that would be about 400 millimetres,\" he said.\n\n\"We’re really on a knife edge of which way the season can go. We could sort of scrape to an average yield if we got 25 to 50 millimetres in the next two or three weeks.\n\n\"If we don’t, then we’ll have to make some pretty serious decisions, so everything is hanging in the balance at the moment.\"\n\nHay is an attractive option this season, given it is in short supply. (Supplied: Katrina Dunn)\n\nMr Conboy said his clients were also weighing up whether to cut crops for hay.\n\n\"Particularly crops that might have a bit of bulk to them, there could be a lot of that being considered,\" he said.\n\n",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/international-friendly-live-popovic-s-unbeaten-socceroos-take-on-pochettino-s-usa-20251013-p5n213.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "International friendly LIVE: Popovic’s unbeaten Socceroos take on Pochettino’s USA",
    "publish_date": "Wed, 15 Oct 2025 12:58:22 +1100",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "And now Aiden O’Neill has just gone in hard on Sands, too, sparking a bit of a scuffle between players from both teams, and an intervention from the referee - who, again, chooses not to reach into his pocket. O’Neill just gets a talking to.\n\nAnyway, the two minutes of stoppage time for this first up have almost elapsed - indeed, they have. That is half-time. And a fiery finish to the first 45 minutes it was.\n\nIt’s 1-1 after Jordan Bos’ fantastic opener and the response from Haji Wright, which came 15 minutes later.\n\nWe’re set for a cracking second half, I reckon.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/lifestyle/fashion/how-to-pronounce-the-name-of-summer-s-hottest-shoe-birken-sh-tock-20250930-p5mz22.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Apparently, we’ve all been saying Birkenstock wrong",
    "publish_date": "Wed, 15 Oct 2025 12:57:07 +1100",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "“We are more like a medical item than a fashion piece,” says Jochen Gutzy, Birkenstock chief communications officer. “As our chief executive says, ‘we’re like aspirin for the feet’.” Fashion is a relative newcomer to the Birkenstock business, with supermodel Heidi Klum launching their first official fashion collaboration in 2003. But the brand’s medical history runs far deeper than Klum’s noughties denim designs. Loading The footwear company’s journey began in 1774, with German shoemaker Johann Birkenstock. It picks up pace in 1897 with great-grandson Konrad Birkenstock and his fixation on orthopaedic shoe lasts. That foot-health fixation remains, outlasting a series of Carls and Karls in the family, which gave up control of the business in 2012. It has even survived an IPO in 2023, when the company was valued at up to $US8.3 billion ($12.8 billion).\n\n“Walking is like breathing and drinking water, and the footbeds are the ingredient that the human being needs for healthy living,” Gutzy says. “We care about people’s health and wellbeing. Now I think fashion is looking for the real thing because the consumers are better informed.” Birkenstocks being assembled at the company’s German factory in Görlitz. While Gutzy is happy with growing sales to fashion consumers, the business is not chasing collaborations, having declined potentially lucrative partnerships with former Louis Vuitton creative director Marc Jacobs, streetwear giant Supreme and Guram Gvasalia’s French fashion brand Vetements. A year after Louis Vuitton said yes to a partnership with Supreme in 2017, which was greeted with fanfare by Vogue and GQ, Birkenstock said no.\n\n“There’s no benefit for us except prostitution because this is just prostitution,” Reichert told The Cut. Marc Jacobs unofficially adapted Birkenstocks for the runway for his seminal grunge spring 1993 collection for Perry Ellis. More recently, when Jacobs approached Birkenstock with sketches for an official collaboration, it was time to raise the red flag, again, Gutzy says. “We said ‘thank you, but no’ because the ideas that he had in mind for the outsole... it might get some attention out there, but from an orthopedic standpoint, it’s wrong, so let’s not do it. “We feel comfortable with what we’re doing. When I joined the company in 2012, we produced 12.3 million pairs. Now we are sitting [at] around 40 million. We plan on doubling that capacity in the coming years.” At Birkenstock factories outside the picturesque German town of Görlitz, automated machines are being introduced alongside the 1900 workers supervising the production of cork innersoles, the cutting of leather and precise placement of buckles.\n\nDuring a workshop, where I designed my own pair of sandals (sorry Supreme and Marc Jacobs) I learnt that it’s pronounced Birken-sh-tock. Say the name correctly and no one will question your decision to wear sandals with socks. An off-duty Gigi Hadid in New York. Right: Birkenstock “Boston Big Buckle” clogs. Birkenstock manufactures 95 per cent of its shoes in Germany, and has a factory outpost in Portugal. Last month the company said it had bought a facility near Dresden to further increase its manufacturing capacity. Entrepreneur Margot Fraser distributed the shoes through Californian health food stores in the ’60s, cementing their hippie reputation for crunchy granola feet. The US is still crucial to the brand’s success. In Australia, Marcel Goerke pioneered an appetite for the footwear, challenging the supremacy of the thong as summer footwear in 1992, with a catalogue aimed at the local market. In 1993 Birkenstock opened its first store in Melbourne. Sydney had to wait until 2024.\n\nLoading “Marcel was raised in a family that distributed Birkenstock shoes over the span of three generations and then moved to Australia,” says Gutzy. “Australian consumers understand the product. It’s one of the markets with the highest per capita usage of Birkenstock products worldwide.” In the ’90s Goerke noticed that Birkenstocks wore down more quickly in Australia than in Germany, and pushed a repairs program. Last year more than 5000 pairs were repaired in Australia. “They are designed to be repaired,” Gutzy says. Having found their feet in the world of fashion, Birkenstock has one more obstacle to face.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/afl/afl-trade-period-live-2025-blues-reject-swans-offer-for-curnow-as-trades-enter-last-day-20251014-p5n2j7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL trade period LIVE 2025: Petracca move close for Suns; Blues reject Swans offer for Curnow",
    "publish_date": "Wed, 15 Oct 2025 12:57:06 +1100",
    "category": "finance",
    "authors": [
      "Roy Ward"
    ],
    "text": "Predictions as we edge closer to the 7.30pm deadline:\n\nSometimes, you can divine what will happen in trades by the tone of the negotiations, by how far hard each party is willing to go and, most obviously, by the sticking points.\n\nThat’s why I’m confident that Charlie Curnow will get traded to Sydney and Christian Petracca will get his wish and become a Gold Coast player.\n\nCharlie Curnow marks in front of Steven May in July. Credit: Getty Images\n\nCarlton are objecting to giving back pick 22 – when this kind of pick is the grievance holding up a trade, the deal almost invariably lands.\n\nSimilar logic applies to Melbourne’s line on Petracca – the Suns have put up picks seven and eight, which is a super deal, no matter what the Demons say, and they’d be silly to let that opportunity go.\n\nPicks coming back to Gold Coast will get sorted. How many players will draw two top-10 picks in any draft (even if this one is comprised and thin)?\n\nClayton Oliver will become a Giant, for sure. It will just be a question of how much of that massive $1.3 million (times five) contract Melbourne pays. Quite a bit.\n\nMarshall going down to wire\n\nI’m less confident about Rowan Marshall’s wish to head down the highway with Nathan Buckley and play for the Cats.\n\nSt Kilda will take some persuading.\n\nMy guess is that deal will be done very late after brinksmanship.\n\nBuku Khamis will end up at Carlton, yes. They aren’t arguing over sheep stations in that transaction.\n\nToo late on De Goey?\n\nCollingwood appear to have left their run too late to deal Jordan De Goey.\n\nHe doesn’t have a clear suitor – Melbourne or Hawthorn would be logical (Hawks only if Zach Merrett is stranded at Essendon) since they could have picks just inside the top 10 and it will only take one proper first rounder.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/queensland/magic-mushrooms-mdma-therapy-covered-by-private-health-in-brisbane-first-20251015-p5n2mc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Magic mushrooms, MDMA therapy covered by private health in Brisbane first",
    "publish_date": "Wed, 15 Oct 2025 12:48:43 +1100",
    "category": "lifestyle",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "Queenslanders suffering post-traumatic stress disorder and treatment-resistant depression will soon have access to MDMA and magic mushrooms through their private health insurance, saving tens of thousands of dollars.\n\nThe world-leading psychotherapy program involves the prescribed use of psychedelic substances MDMA and psilocybin, commonly known as magic mushrooms, and will be delivered by authorised practitioners at private mental health hospital Avive Health in Windsor.\n\nPsychedelic-assisted psychotherapy is facilitated by authorised and specially trained psychiatrists in controlled environments. Credit: Chris Hopkins\n\nPrivate health provider Medibank will offer the service to eligible customers after becoming the first insurer in Australia to launch a fully rebated psychedelic-assisted psychotherapy program for PTSD and TRD treatment in Perth this year.\n\nMedibank chief medical officer and practising psychiatrist Dr Andrew Wilson said the specialised treatment, which had been approved in Australia since July 2023, was only facilitated by a small number of psychiatrists and was financially out of reach for most people.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/queensland/three-die-in-queensland-house-fire-police-declare-crime-scene-20251015-p5n2ot.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Woman, two girls killed in Queensland house fire, police declare crime scene",
    "publish_date": "Wed, 15 Oct 2025 12:46:01 +1100",
    "category": "finance",
    "authors": [
      "Julius Dennis"
    ],
    "text": "The bodies of a woman and two children have been found in the remains of a house that burned to the ground in central Queensland.\n\nParamedics did not treat anyone at the scene, in the Gladstone suburb of Toolooa, with emergency services called to the Whiting Street house just before 6am.\n\nFive fire crews arrived at the scene shortly after, where they found the house engulfed by flames.\n\nStructural damage hampered firefighters’ attempts to search the house before the fire was extinguished about 9am.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/bos-burns-horrible-usa-defence-20251015-p5n2qu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bos burns 'horrible' USA defence",
    "publish_date": "Wed, 15 Oct 2025 12:42:27 +1100",
    "category": "finance",
    "authors": [],
    "text": "Bos burns 'horrible' USA defence\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/queensland/plans-for-traffic-lights-to-fix-city-s-third-most-dangerous-intersection-20251015-p5n2ob.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Plans for traffic lights to fix city’s third-most dangerous intersection",
    "publish_date": "Wed, 15 Oct 2025 12:39:48 +1100",
    "category": "finance",
    "authors": [
      "Felicity Caldwell"
    ],
    "text": "This suburban intersection is one of the most dangerous in Brisbane, and drivers must rely on their knowledge of road rules to work out who has to give way, via two Stop signs and white painted lines.\n\nAnd the road width means waiting motorists tend to squeeze their cars up beside other vehicles, adding to the confusion.\n\nBrisbane City Council has released plans for an update, which includes four sets of traffic lights, separate turning lanes and pedestrian crossings.\n\nBrisbane City Council has released a concept design for traffic lights at the intersection of Archerfield Road, Azalea Street and Pine Road at Inala. Credit: Brisbane City Council\n\nThe intersection of Archerfield Road, Azalea Street and Pine Road carries almost 22,000 vehicles a day, connecting people travelling through Inala and Richlands.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-kayaker-fights-for-life-after-falling-in-brisbane-river-20251014-p5n2du.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Kayaker dies after falling in Brisbane River; Plane turned around after midflight emergency; Instagram limits teens to PG-13 content",
    "publish_date": "Wed, 15 Oct 2025 12:36:29 +1100",
    "category": "finance",
    "authors": [],
    "text": "Developers have lodged plans for a 37-storey apartment tower next to the Go Between Bridge in South Brisbane, featuring an above-ground six-level car parking podium.\n\nMosaic Property Group plans to build a 37-storey apartment tower next to the Go Between Bridge. Credit: Mosaic Property Group\n\nMosaic Property Group’s proposal for the new tower on the corner of Montague Road and Bouquet Street along the Brisbane River comprises 204 apartments and car parking built on a six-storey podium on the lower levels of the building, which will be concealed by lush planting.\n\nA publicly accessible “pocket park” beneath existing fig trees along the river is included in the design, as well as a rooftop recreation deck spanning two levels, which will feature a wellness zone complete with hot and cold plunge pools and treatment rooms.\n\nThe current development application forms part of a broader proposal, with a second tower planned for the adjoining site at a later date.\n\nDetails of the proposal come after developer Aria was given the green light from Brisbane City Council to build three huge new towers, also in South Brisbane, on a block bordered by Manning, Melbourne and Edmondstone streets.\n\nThe massive Aria development includes a 50-story tower, which is set to be taller than any existing building outside the CBD, and the seventh-biggest in the city. The two other towers will be 40 storeys and 24 storeys.\n\nThe location of the proposed tower, next to the Go Between Bridge.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/dare-to-dream-the-emerging-x-factor-bowler-ready-for-ashes-20251014-p5n2g6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Dare to dream’: The emerging X-factor bowler ready for Ashes",
    "publish_date": "Wed, 15 Oct 2025 12:27:59 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Queensland quick Xavier Bartlett says he’s ready to an answer Ashes SOS to support an injury-ravaged Australian bowling attack.\n\nThe battle with the English enemy is five weeks away, and Australia’s fast-bowling stocks have been plunged into crisis.\n\nSkipper Pat Cummins was in doubt with stress fractures in his back, while Lance Morris, Jhye Richardson, Spencer Johnson and Brendan Doggett have all been felled.\n\nXavier Bartlett looms as an option to come into the Ashes fold should injuries strike the nation’s frontline trio. Credit: Getty\n\nBut Bartlett, who has overcome his own torrid injury history – side strains, calf concerns and stress fractures – was adamant he was as prepared as he would ever be to make his debut in the Ashes furnace.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/technology/instagram-limits-teens-to-pg-13-content-20251015-p5n2kl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "No sex, drugs or dangerous stunts: Instagram limits teens to PG-13 content",
    "publish_date": "Wed, 15 Oct 2025 12:26:20 +1100",
    "category": "finance",
    "authors": [
      "Tim Biggs"
    ],
    "text": "Young users of Instagram in Australia will soon face a significantly restricted experience after Meta announced new global changes to its Teen Accounts program, in addition to the federal government’s incoming social media restrictions.\n\nThe Facebook and Instagram parent company said all users under 18 would have their accounts restricted by default, meaning they would not see content involving sex, drugs or dangerous stunts, and would be blocked from viewing accounts flagged as including such content. Adults supervising teens with their own account will be able to override the restrictions or impose harsher ones.\n\nMeta has announced that teenagers on Instagram will be restricted to seeing PG-13 content by default. Credit: Bloomberg\n\nCombined with the government’s new social media rules, coming into effect in two months, this means users will not be able to use Instagram until they are 16, at which point they will be able to access a censored version unless their parents agree to remove the restrictions.\n\nSwinburne University digital media expert Belinda Barnet said Meta’s move showed that Australia’s pressure was having a global positive effect, despite criticism of the social media ban on technical grounds.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/culture/music/melbourne-exhibition-swoops-as-powerhouse-passes-on-piece-of-rock-n-roll-history-20251015-p5n2me.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Melbourne exhibition swoops as Powerhouse passes on piece of rock’n’roll history",
    "publish_date": "Wed, 15 Oct 2025 12:20:22 +1100",
    "category": "entertainment",
    "authors": [
      "Linda Morris"
    ],
    "text": "A Sydney museum has passed up a chance to bid for and display Midnight Oil drummer and songwriter Rob Hirst’s drum kit, acquired at a charity auction by a fan club for $77,500.\n\nThe important piece of Australian rock memorabilia is instead headed for Melbourne’s Australian Music Vault after the Powerhouse Museum said the “timing did not align with our acquisition processes on this occasion”.\n\nRob Hirst of Midnight Oil at the drum kit.\n\nSydney-based Hirst parted with the kit he used from 1979 to the band’s 2022 farewell concert due to his battle with pancreatic cancer. Money raised is going towards First Nations musicians and support for band crew who have fallen on hard times.\n\nFan group Powderworkers purchased it on Monday after emailing a group of institutions asking for potentially matching donations. The Australian Music Vault invited Matthew Yau, who spearheaded the campaign, to talk about its potential display.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/business/banking-and-finance/cba-boss-matt-comyn-to-stay-on-for-another-three-years-20251015-p5n2or.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "CBA boss Matt Comyn to stay on for another three years",
    "publish_date": "Wed, 15 Oct 2025 12:14:44 +1100",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "Commonwealth Bank chair Paul O’Malley has signalled that chief executive Matt Comyn is likely to remain in the job for another three years, which would mean serving for a decade as the boss of Australia’s largest bank.\n\nSpeaking to CBA shareholders at the bank’s annual meeting on Wednesday, O’Malley said he intended to stand for his final three-year term as chair, with the support of the board.\n\nCBA chief executive Matt Comyn is likely to remain the boss of the bank until at least 2028. Credit: Oscar Colman\n\nO’Malley added that the next chair would appoint the successor to Comyn, who has been the CEO of CommBank since April 2018.\n\n“One of the board’s key roles is appointing the CEO and ensuring appropriate succession plans. We have been pleased with the performance of Matt as CEO,” O’Malley said at the meeting in Brisbane.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/crispy-miso-fish-tacos-with-edamame-guacamole-20251014-p5n2cp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Crispy miso fish ‘tacos’ with edamame guacamole",
    "publish_date": "Wed, 15 Oct 2025 12:09:50 +1100",
    "category": "lifestyle",
    "authors": [
      "Jessica Brook"
    ],
    "text": "Step 1 Cook the edamame in boiling, salted water for about 2 minutes, or until they are bright green and just tender. Drain and run under cold water to stop the cooking and preserve their colour. In a food processor, combine the blanched edamame, avocado, lime zest and juice, and 1 tablespoon of the pickled ginger. Pulse until the mixture is smooth and creamy. Taste and season generously with salt and pepper. Set aside until ready to assemble the tacos.\n\nStep 2 Combine the miso, soy sauce, vinegar and 1 tablespoon of water in a shallow bowl. Whisk to combine and season with salt and pepper, and set aside.\n\nStep 3 Pour about 3cm of vegetable oil into a large pan. Heat over high heat until the oil reaches 180C and you see shimmering, ripple-like waves across the surface.\n\nStep 4 Season the cornflour generously with salt and pepper in a wide, shallow bowl. Dredge the fish fillets in the cornflour, shaking off any excess.\n\nStep 5 Working in two batches, carefully add the fish and fry for about 2 minutes each side, or until the fillets are golden brown and crisp. Remove and drain on a wire rack or paper towels.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/culture/books/white-lotus-without-the-awful-people-the-new-trend-for-luxury-writers-retreats-20251009-p5n1co.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "White Lotus without the awful people: the new trend for luxury writers’ retreats",
    "publish_date": "Wed, 15 Oct 2025 12:00:00 +1100",
    "category": "finance",
    "authors": [
      "Jane Sullivan"
    ],
    "text": "“There’s one born every minute” is the ominous headline on Richard Z. Santos’s article for Slate about the booming business of luxury writers’ retreats. And yes, there is this vague suggestion throughout his piece that the people who sign up for these expensive adventures could be conning themselves.\n\nSpend a few thousand to get to Guatemala and enjoy a beach massage and a traditional Mayan shaman fire ceremony, Santos writes. Spend a week on the Queen Mary 2, or a Tuscan estate, or a French chateau. “Maybe – if your jet lag and the wine from the night before have worn off – you can even sneak in a little writing time.”\n\nThe ocean liner Queen Mary 2 is one of the options for a luxury writers’ retreat. Credit: Cunard\n\nOn the internet, there are dozens of these tempting offers for writers or wannabe writers with deep pockets, all sounding like White Lotus without the horrible people. These are not venerable writers’ retreats such as Yaddo in New York State, where applicants compete to get in. Anyone with the cash can go.\n\n“Wouldn’t it be fantastic if someone was serving you delicious, healthy food, and there was a crackerjack writing coach on call if you have a question or get stuck?” it says on the website of Jennifer Louden, who organises retreats in the US. “And a glorious wise circle of women to giggle with.”",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/culture/comedy/people-who-want-to-be-offended-are-always-going-to-be-offended-harry-enfield-20251012-p5n1ul.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "People who want to be offended are always going to be offended: Harry Enfield",
    "publish_date": "Wed, 15 Oct 2025 12:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "Lenny Ann Low"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Harry Enfield, legendary British comedian, pioneering 1990s satirist, is sitting in a small, brightly lit London kitchen beside a sink. It’s almost a surprise. Early communications from his people suggested Enfield would only be interviewed about his upcoming Australian tour, Harry Enfield: And No Chums, if he did it as one of his famous comedy characters. Cash-waving Cockney loudmouth Loadsamoney perhaps. Or maybe well-bred fool Tim Nice-But-Dim Esq, or cheesy radio DJ Dave “Nicey” Nice (my vote). All part of the cavalcade of characters he played in BBC TV shows that made Enfield a household name in Britain from the 1980s onwards. But here is the real Enfield, hands clasped on top his head as he explains why there is a hammer an arm’s reach away on the sink top. “Well, one of my people is sitting here shaking his head and giggling,” Enfield says of a confidant just beyond the laptop’s screen. “One has to discipline one’s people sometimes, right?” In the 1990s, more than 10 million people tuned in to watch Enfield’s sketch TV shows, from Harry Enfield’s Television Programme to Harry Enfield & Chums and Harry & Paul, the latter adding his longtime collaborator Paul Whitehouse to the title. Harry Enfield as his character Kevin the Teenager. Credit: Alamy Stock Photo Enfield was already famous in late-1980s Britain for TV appearances as Greek kebab-shop owner character Stavros and Loadsamoney, the bravado-infused figure satirising prime minister Margaret Thatcher’s ideology and politics. When Enfield got his own show, a plethora of comedy guises and double acts was unleashed, ranging from clueless upper-class twit Tim Nice-But-Dim Esq, working-class caricatures Wayne and Waynetta Slob, witless young Conservative Tory Boy and cheesy radio DJs Smashie and Nicey.\n\nAdvertisement\n\nSuch was the fame of Enfield’s recalcitrant adolescent character Kevin the Teenager, he and best friend Perry, played by actor, director and regular collaborator Kathy Burke, got their own feature film, Kevin & Perry Go Large, in 2000. The movie’s promotional tour 25 years ago brought Enfield to Australia for the first time, although he barely saw the place. “It’s the only time I’ve been there, and I just really sat in a hotel room for two days,” he says. “Then I went out at lunchtime, cuddled the Sydney Opera House and then ran back. That was all I did. It was nice to fondle it.” Enfield’s TV shows in the 1990s and 2000s were shown here, but he may be better known for The Windsors (2016-2023), a sitcom lampooning the British royal family in which Enfield played Prince Charles and then the King. His portrayal of the monarch – all furrowed brow, cuff-twiddling and starchy downturned mouth – was, he says, parody but not without empathy. That’s been his approach with every character, no matter their stature. Enfield with frequent collaborator Paul Whitehouse as their characters The Old Gits. Credit: Alamy Stock Photo “What Paul Whitehouse and Kathy Burke and I have always done is a lot of stuff that’s full of truth,” he says. “With Kevin the Teenager, everyone has teenagers, they know that kind of thing, but it’s always nice, it’s never nasty. It might be mischievous, but it’s never malicious. And I think that’s what people like really. Or most people.” Enfield, who rarely gives interviews and eschews celebrity status, is segmenting Harry Enfield: And No Chums between character performance, talking about his career and answering questions from the audience. “Obviously, I’m very old to be doing Kevin now,” he says. “I’m 64. But I’ll be talking about how he affects my life these days. There will be loads of characters in the show, but I’ll also be talking about my life in comedy and how [comedy has] changed and also the people I’ve done that I’ve got into trouble for doing, maybe a little bit.”\n\nAdvertisement\n\nThere are some characters from decades ago that he wouldn’t do now. “Because things have changed a bit,” he says. “People are more wary. I’m not really sure who invents the rules these days.” He recalls working on satirical TV puppet show Spitting Image and voicing boxer Frank Bruno, a casting that wouldn’t happen today. He’s not certain Women, Know Your Limits!, his satire about misogyny – presented as a 1930s-style British public service announcement about the terrors of letting women think for themselves – would be allowed now either. TAKE 7: THE ANSWERS ACCORDING TO HARRY ENFIELD Worst habit? Some might say I’m big-headed. Greatest fear? Losing my staggeringly good looks. The line that stayed with you? How Peter Cook described me: “Lauded by his equals, feared by his rivals and loathed by all and sundry.” Biggest regret? I wish I had drowned my sisters. I have had to share my mummy’s affections with them. Favourite book? I haven’t written one about myself yet. But when I do, it’ll be that. The artwork/song you wish was yours? Release The Bats by Nick Cave’s Birthday Party. If you could time travel, where would you choose to go? I would travel forward 200 years. By then there will be a vast statue of me in every world metropolis. “There’d probably be a lot of people saying you’re perpetuating stereotypes,” he says. “Which is rubbish, obviously, but that’s just an example. In fact, a few years ago, I went on this yoga week and there was this German woman who was very sweet but kept on frowning at me. “I thought, oh, I don’t know what I’ve done. And then one day, she came up and said, ‘I’ve realised who you are. You’re Women, Know Your Limits!’ She was a professor in gender studies, and she said every year, the first thing she shows her new students is that sketch, and then they start from there. That was lovely, you know? Pretty much everything I do is that kind of thing.” Enfield’s era of TV crammed with sketch comedy shows is over. Drama wins over comedy, he says, in terms of funding. He’s pleased to see David Mitchell and Robert Webb have a new TV sketch show, Mitchell and Webb Are Not Helping, but equally cheered by the diversity and number of people making new comedy online. “There are more people frightened of more things nowadays and more people frightened of offending anyone,” he says. “Well, people who want to be offended are always going to be offended. As I say, my thing is mischief, not malice. Some people will find that offensive because they’ve got a fixed view of what’s right and what’s wrong and they don’t really have a sense of humour about things.”\n\nAdvertisement\n\nEnfield is a big fan of Australian comedian Sam Campbell and British poet, comedian and actor Tim Key, and is regularly taken to see new comedians by his adult children. He and Whitehouse get together as much as possible. “He’s the loveliest man,” Enfield says. “I once upset Richard Curtis. He said to me, ‘I’m still trying to get over when you said I’m the second-nicest man in the world after Paul Whitehouse.’” What does he think of fans from the other side of the globe, in a place he visited once 25 years, wanting to see his show? Enfield may be part of a steady groundswell of tours by comics of his generation – Ben Elton, Tony Robinson, Alan Davies, Eddie Izzard, Bill Bailey to name a few – but their TV and live shows are perhaps better known here. Loading “Do you mean I’m culty?” Enfield says, leaning forward with a quizzical smile. “I’ve never been culty over here, I’ve just been on the telly. So, I like being a cult. That’s good.” He is greatly looking forward to being in Australia again, although his friend Elton, a longtime Australian resident, will be away. “I’m coming to talk to everyone about everything,” he says. “Including meeting Camilla in real life.” What was that like? “It was cool,” Enfield says. “She was very nice. I sat next her in church, and we had a little chat. I didn’t tell her some of the nastier things … not nasty, but some of the silly and naughty things that we’ve done [about her].”\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/hamas-hands-over-bodies-of-hostages-to-red-cross-midday-news-bulletin-15-october-2025/vrpu153r2",
    "title": "Hamas hands over bodies of hostages to Red Cross | Midday News Bulletin 15 October 2025",
    "publish_date": "Wed, 15 Oct 2025 00:52:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nHamas hands over four bodies of hostages to the International Committee of the Red Cross\n\nGrim milestone reached for Aboriginal deaths in custody in New South Wales\n\nAustralia's women's cricket side prepares for their showdown with Bangladesh\n\nThe bodies of four Israeli hostages have been handed to the International Committee of the Red Cross in Gaza.\n\n\n\n\n\nThe bodies were then taken to the National Center for Forensic Medicine in Tel Aviv where they will be identified and the families notified.\n\n\n\n\n\nIt comes after the exchange of the last 20 living hostages in Gaza - for some 2,000 prisoners and detainees held in Israeli prisons, as part of the ceasefire’s first phase.\n\n\n\n\n\nChristian Cardon is from the ICRC.\n\n\n\n\n\nHe says the organisation has reopened its presence in Gaza City, and there remains a lot of work to do over coming weeks.\n\n\n\n\n\n\"The dignity of the human remains can be respected. And also the identification of the people to make sure as soon as possible. And what we also see as top priority at the moment it is about aid coming to the people. It is very important that in addition to the emergency aid that will be in the trucks, there is also materials to allow the key actors to rebuild these infrastructures.\"\n\n\n\n\n\n---\n\n\n\n\n\nAuthorities say the triple zero system in Victoria is back to normal after an early morning power outage.\n\n\n\n\n\nThe outage took out the computer-aided dispatch system at around 12.30am, forcing emergency call operators to revert to pen and paper to record information.\n\n\n\n\n\nThe system was down for a number of hours before gradually coming back online.\n\n\n\n\n\nThe Victorian government says the incident is being thoroughly investigated.\n\n\n\n\n\nBut opposition leader Brad Battin says the outage is a symptom of a much larger problem with the service.\n\n\n\n\n\n\"We've seen this too often, and we saw the results and outcomes in the past. When they ended up doing a review it came up with the conclusions of how you could fix triple zero. And at the same time they're supposed to be implementing those changes, the government cut the funding.\"\n\n\n\n\n\n---\n\n\n\n\n\nTwelve Aboriginal and Torres Strait Islander people have died in custody in New South Wales so far in 2025.\n\n\n\n\n\nIt is the highest number ever recorded in a single 12-month period.\n\n\n\n\n\nThe figures come from an open letter published by State Coroner Teresa O'Sullivan, who has called the deaths a profoundly distressing milestone and part of an entrenched over-representation of First Nations peoples in the criminal justice system.\n\n\n\n\n\nThe coroner has referred to data showing the number of Aboriginal people in custody has increased by almost 19 percent in the past five years, while the non-Aboriginal population in prison has declined.\n\n\n\n\n\nShe says nearly half of Indigenous adults in custody are on remand or have been refused bail awaiting further court outcomes.\n\n\n\n\n\n---\n\n\n\n\n\nAn Australian man has been charged after he allegedly transferred hundreds of thousands of dollars to accounts in sanctioned Iranian banks.\n\n\n\n\n\nAuthorities say the 34-year-old, from Auburn in Sydney's west, ran a legitimate business helping Australian residents to send money overseas to families and friends.\n\n\n\n\n\nBut it is alleged that over the course of a year he sent almost $650,000 to banks in Iran that are subject to the Australian government's sanctions list.\n\n\n\n\n\nThe funds were sent over 543 international money transfers.\n\n\n\n\n\nThe alleged breach carries a maximum penalty of ten years’ imprisonment - and the possibility of steep fines.\n\n\n\n\n\nThe regulator tasked with fighting money laundering and counter-terrorism financing, has suspended the Auburn company’s remittance registration for one year.\n\n\n\n\n\n---\n\n\n\n\n\nTo sport and in cricket, Australia is talking up their chances ahead of the women's national squad's upcoming match against Bangladesh tomorrow.\n\n\n\n\n\nAustralia are the women's ODI World Cup defending champions, and will be aiming to win an unprecedented eighth 50-over World Cup title, as well as becoming the first women's team to claim consecutive titles since 1988.\n\n\n\n\n\nCaptain Alyssa Healy scored 142 to help Australia to beat India by three wickets on Sunday.\n\n\n\n\n\nShe has told the Willow Talk podcast, the team is preparing to bring their A-game against Bangladesh.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/our-shining-star-has-dimmed-celebrated-soul-musician-dangelo-dies-at-51/7vo00osym",
    "title": "'Our shining star has dimmed': Celebrated soul musician D'Angelo dies at 51",
    "publish_date": "Tue, 14 Oct 2025 19:04:21 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Celebrated soul musician D'Angelo has died at the age of 51 after battling pancreatic cancer, several United States media outlets have reported.\n\n\n\n\n\nThe R&B icon and neo-soul pioneer melded genres and opened doors as he stretched the boundaries of Black pop traditions while producing sensuous hits, including Brown Sugar and Untitled (How Does It Feel).\n\n\n\n\n\nThe risque, shirtless music video for the latter track catapulted the artist to superstardom, though he struggled with the weight of his newfound pop culture fame.\n\n\n\n\n\n\"The shining star of our family has dimmed his light for us in this life ... After a prolonged and courageous battle with cancer, we are heartbroken to announce that Michael D'Angelo Archer, known to his fans around the world as D'Angelo, has been called home,\" his family said in a statement to Variety.\n\n\n\nMusician D'Angelo won plaudits for albums including his 1995 debut Brown Sugar and Voodoo, released in 2000. Source: Getty / Andrew Burton D'Angelo was an acclaimed R&B singer and won plaudits for albums including his 1995 debut Brown Sugar and Voodoo, released in 2000.\n\n\n\n\n\nVoodoo's lead single Untitled (How Does It Feel) won him the Grammy for Best Male R&B Vocal Performance and the album was named Best R&B Album.\n\n\n\n\n\nD'Angelo was known for blending styles and employing an improvisational approach.\n\n\n\n\n\nHe was a fan of analog production, favouring long jam sessions, and was a serial collaborator.\n\n\n\n\n\n\"Such a sad loss to the passing of D'angelo. We have so many great times. Gonna miss you so much. Sleep Peacefully D' Love You KING,\" DJ Premier wrote on X in tribute.\n\n\n\n\n\nD'Angelo and DJ Premier collaborated on the 1998 single Devil's Pie.\n\n\n\n\n\nThe musician's passing was reported by People magazine and TMZ, among others.\n\n\n\nMusic industry publication Pitchfork credited D'Angelo with helping to \"define the neo-soul movement\".\n\n\n\n\n\nBorn in Virginia, D'Angelo was something of a recluse and only periodically surfaced to release music, most of which was received favourably by fans and critics.\n\n\n\n\n\nIn 2016, he featured on a playlist used by former US president Barack Obama, alongside other musical greats like pop superstar Janet Jackson, soul singer Janelle Monae and blues rocker Gary Clark Jr.\n\n\n\n\n\nTyler, the Creator, posted a black and white photograph of D'Angelo on X, while the Alchemist wrote simply, \"Man. Rest in peace D'Angelo\".\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/venezuela-closes-embassy-australia-maduro-trump/mpgcbcetq",
    "title": "'Mystified': Concern for thousands in Australia after Venezuela's surprise move",
    "publish_date": "Tue, 14 Oct 2025 18:35:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "Venezuela's government has announced it will be closing its embassies in Australia and Norway in a restructuring of its foreign service, as tensions escalate between the South American country and the United States.\n\n\n\n\n\nThe closures are part of the \"strategic re-assignation of resources\", President Nicolás Maduro's government said in a statement on Monday.\n\n\n\n\n\nThe Venezuelan government said consular services to Venezuelans in Norway and Australia will be provided by diplomatic missions, with details to be shared in the coming days.\n\n\n\n\n\nVenezuela has also announced it will be opening new embassies in Burkina Faso and Zimbabwe, which it described as \"two sister nations, strategic allies in the anti-colonial fight and in the resistance against hegemonic pressures\".\n\n\n\n\n\nBoth countries have governments that are aligned with Russia, which recently expressed support for Venezuela at the United Nations while criticising the US .\n\n\n\n\n\nRaul Sanchez-Urribarri, an associate professor from the School of Humanities and Social Sciences at La Trobe University, called Venezuela's decision to close its embassy in Australia a \"strong disappointment\" and said he is concerned about the lack of consular services for Venezuelans in Australia.\n\n\n\nSanchez-Urribarri said he was first made aware of the news that the embassy would be closing after a friend reached out to him asking how he would renew his passport.\n\n\n\n\n\n\"The Venezuelan population in Australia is not terribly big, but it's still significant,\" Sanchez-Urribarri said.\n\n\n\n\n\n\"It's calculated at about 10,000 to 15,000 Venezuelans who use those services, and Australia being so distant from other locations, then there is concern that by shutting down the consular services, it will be hard for Venezuelans to avail themselves of those services if they're moved to another location.\"\n\n\n\n\n\nLuis Patino, the vice president of the Venezuelan Community of South Australia, told SBS News he was not surprised the Venezuelan government chose to close its embassy in Australia as it has been changing many aspects of its foreign policy in recent years.\n\n\n\n\n\nHowever, Patino — who moved to Australia in 2019 as a refugee — said the change makes him concerned for Venezuelans living in Australia.\n\n\n\n\n\n\"As a country, they're leaving all your citizens without permits and passports and any kind of documents they need to do,\" he said.\n\n\n\n\n\nPatino also said visa applications for Australian citizens who want to visit their families in Venezuela could be impacted.\n\n\n\nWhy is Venezuela closing its embassy in Australia?\n\nSanchez-Urribarri said he's \"mystified\" about Venezuela's decision to close its embassy in Australia.\n\n\n\n\n\nHe said it may be loosely related to Venezuelan opposition leader María Corina Machado winning the 2025 Nobel Peace Prize last week for her \"tireless work promoting democratic rights for the people of Venezuela\".\n\n\n\nREAD MORE Venezuelan opposition figure María Corina Machado awarded Nobel Peace Prize\n\nIn 2023, Machado won a resounding victory in the opposition's primary election, and her rallies attracted large crowds, but a ban on holding public office prevented the democracy campaigner from running for president against Maduro in 2024, and she went into hiding.\n\n\n\n\n\nJørgen Watne Frydnes, chair of the Norwegian Nobel Committee, announced on Friday that Machado had been awarded the prize for \"her struggle to achieve a just and peaceful transition from dictatorship to democracy\".\n\n\n\n\n\nSanchez-Urribarri said the award was an \"unforeseen\" development but represents a \"further dent\" in the Maduro regime's legitimacy.\n\n\n\nMaría Corina Machado won the 2025 Nobel Peace Prize last week for her work fighting for democracy. Source: AAP / Matias Delacroix/AP \"It bolsters the legitimacy and the visibility for the claim for redemocratisation in Venezuela,\" he said.\n\n\n\n\n\nPosting on X after her win, Machado dedicated the prize \"to the suffering people of Venezuela and to [US] President [Donald] Trump for his decisive support of our cause!\"\n\n\n\n\n\nThe Nobel Peace Prize recipient is decided by the Norwegian Nobel Committee each year.\n\n\n\n\n\nIt is independent of the Norwegian government, but the Scandinavian country said it received notice of the Venezuelan embassy closure and no reason for the decision.\n\n\n\nA Norwegian foreign ministry spokesperson said Venezuela's decision was \"regrettable\".\n\n\n\n\n\n\"Despite the fact that we have different views on several issues, Norway wishes to keep the dialogue with Venezuela open and will work towards that,\" the spokesperson said.\n\n\n\n\n\nSanchez-Urribarri said he believes the Venezuelan government may have decided to \"lump\" the closure of the Australian embassy in with the closure of the Norwegian embassy to give the announcement more heft.\n\n\n\n\n\n\"Nothing has happened recently [between Australia and Venezuela] that I know of that would merit that kind of reaction. In the case of Norway, I think it's quite clear — without a doubt,\" he said.\n\n\n\n\"But in the case of Australia, my main hypothesis right now is that this was something that was announced for bombastic effect, but there isn't really a reason.\"\n\n\n\nAustralia's relationship with Venezuela\n\nSanchez-Urribarri said Australia doesn't have a \"functional relationship\" with Venezuela right now due to the decline of democracy and rise of authoritarianism under Maduro, who has been president since 2013.\n\n\n\n\n\nIn 2019, Australia was among several countries, including the US and the United Kingdom, along with the European Union, that recognised the former Venezuelan opposition leader Juan Guaidó as the legitimate president until free and fair elections were held.\n\n\n\nLISTEN TO Venezuelan opposition leader awarded Nobel Peace Prize SBS News 01:05 English\n\nThe validity of Maduro's presidential election and win last year was rejected by the US, European governments and 10 Latin American countries, including those with left-wing governments with strong historical ties to Venezuela.\n\n\n\n\n\nMany countries said the election was rigged and backed opposition candidate Edmundo González's claim that he had won, but González fled Venezuela and sought asylum in Spain last September after a warrant was issued for his arrest.\n\n\n\nEscalating tensions with the US\n\nTensions between the US and Venezuela have been escalating in recent months as Maduro alleges Trump is attempting to drive him from power.\n\n\n\n\n\nTrump has explicitly accused Maduro of leading drug cartels and called him one of the \"largest narco-traffickers in the world\", although he has played down accusations that he is seeking to oust the Venezuelan president.\n\n\n\n\n\nIn September, Trump delivered the 'Major's List' to Congress — a list of 23 countries the US government says are responsible for sourcing and transporting illegal drugs into the US.\n\n\n\n\n\nVenezuela was listed as one of five countries the US said had \"failed demonstrably to make substantial efforts\" to stop the drug trade.\n\n\n\n\n\nThe US also recently doubled a bounty for Maduro's arrest to US$50 million ($75 million).\n\n\n\nCarlos Eduardo Morreo, a lecturer at the University of Melbourne and Latin American studies researcher, told SBS News earlier this year that the US government is attempting to paint Venezuela as a \"narcoterrorist\" state.\n\n\n\n\n\nHowever, Morreo said there is \"no proof really that Maduro and the government is involved in the shipments or benefits from these shipments or that the state is involved in any of these things directly.\"\n\n\n\n\n\nMilitary tensions have also increased between the US and Venezuela.\n\n\n\n\n\nThe US government has recently conducted fatal military strikes on alleged Venezuelan drug trafficking boats that some international experts say violate international law.\n\n\n\n\n\nThere has also been a significant US military build-up in the southern Caribbean, with at least seven US warships reported in the region, along with one nuclear-powered submarine and F-35 stealth fighter aircraft deployed to Puerto Rico, posing a growing threat to Maduro.\n\n\n\nThe president has called for citizens to train for a potential US attack, and the president has deployed 25,000 troops along Venezuela's coastline and its border with Colombia.\n\n\n\n\n\nSanchez-Urribarri said it is difficult to get a true sense of how Venezuelans are responding to these threats due to fear of speaking freely under the Maduro government, but he is seeing a \"strong anticipation or anxiety\" in social media comments about what will happen between Venezuela and the US.\n\n\n\n\n\n\"There are a wide range of attitudes about it — from people who think something will happen any time soon to others that are in more of a 'watch and see' situation.\"\n\n\n\n\n\nSBS News has contacted the Department of Foreign Affairs and Trade for comment.\n\n\n\n\n\n— With additional reporting by Reuters.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/what-are-rare-earths-and-why-are-the-share-prices-of-companies-mining-them-surging/ahkd2o2f8",
    "title": "What are rare earths, and why are the share prices of companies mining them surging?",
    "publish_date": "Tue, 14 Oct 2025 07:51:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/concern-over-prime-ministers-phone-being-leaked/rrh4ae0o5",
    "title": "'Concern' over prime minister and Opposition leader's phone numbers being leaked",
    "publish_date": "Tue, 14 Oct 2025 00:55:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Authorities are investigating a \"concerning\" data leak that has resulted in the public release of dozens of high-profile phone numbers, including Prime Minister Anthony Albanese and Opposition leader Sussan Ley.\n\n\n\n\n\nThe information was allegedly obtained by a third-party data site using artificial intelligence to scrape sites, including social media profiles, for user details. It is then collated to create a digital phonebook.\n\n\n\n\n\nActing Prime Minister Richard Marles said the government was aware of the breach.\n\n\n\n\n\n\"We've notified authorities, and that is being worked through. But obviously, there is concern,\" he told reporters on Tuesday morning.\n\n\n\nActing Prime Minister Richard Marles said authorities are looking into the breach. Source: AAP / James Ross Initial reporting by Australian website Ette Media claimed both major party leaders' details, as well as those of Marles and former prime minister Scott Morrison, were \"scraped\" by the US-based site from professional networking platforms including LinkedIn.\n\n\n\n\n\nIt prompted Ley's office to request that LinkedIn \"remove the information\" from the Opposition leader's profile.\n\n\n\n\n\n\"This is obviously concerning, and we have reached out to LinkedIn to understand what occurred here. We are waiting for their response,\" an Opposition spokesperson said.\n\n\n\n\n\nLinkedIn told SBS News that the third-party use of personal data is prohibited, with the platform having several measures in place to protect users.\n\n\n\n\"In addition to the technology and teams we've long had in place to stop unauthorised data scraping, we continue to invest in new defences and take legal action when necessary, to detect and prevent our members' information being used without their consent,\" a LinkedIn spokesperson said in a statement.\n\n\n\n\n\nThe security breach follows new data from the Australian Signals Directorate (ASD), which shows 42 per cent of cyber incidents last year were the result of stolen credentials.\n\n\n\n\n\nThe agency responsible for detecting and disrupting malicious cyber threats released its annual report on Tuesday, revealing a rise of 11 per cent in cyber incidents.\n\n\n\nASD director-general Abigail Bradshaw said the way cyber criminals and state actors are gaining access to organisations, critical infrastructure, and businesses is changing.\n\n\n\n\n\n\"Networks are increasingly not being hacked, but are being breached through compromised or stolen credentials to gain unauthorised access,\" she said.\n\n\n\n\n\nIn almost half of the incidents impacting large organisations, access was gained using real usernames and passwords, often stolen or bought by cyber criminals on the dark web.\n\n\n\n\n\nGiven that the access is genuine, instead of a hack, it is harder to track.\n\n\n\n\n\nASD urged Australians to opt out of using passwords and replace them with multi-factor authentication, among a series of other measures , to keep their families' data safe.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/cape-verde-historic-world-cup-qualification/kyjoflpjv",
    "title": "'I don't have words': Cape Verde erupts in celebration after historic World Cup qualification",
    "publish_date": "Tue, 14 Oct 2025 00:39:48 +0000",
    "category": "sports",
    "authors": [],
    "text": "A carnival-like atmosphere erupted in the streets of Cape Verde's capital Praia on Tuesday AEDT after the tiny archipelago nation qualified for the first time ever for the World Cup.\n\n\n\n\n\nAmid honking horns and street fireworks, euphoric fans poured out of the Cape Verde National Stadium following the 3-0 victory over Eswatini, which secured the Blue Sharks a place in the 2026 finals, to be held in the United States, Canada and Mexico.\n\n\n\n\n\nIn the streets, people danced to the sound of reggae tunes and local funaná music.\n\n\n\n\n\nIt was \"an incredible moment\", 37-year-old fan Jorge Junior Livramento told Agence France-Presse not far from the stadium.\n\n\n\n\n\n\"I don't have words. I was at the stadium and I supported our team unconditionally,\" he said.\n\n\n\nCape Verde clinched their qualification for the 2026 World Cup after beating Eswatini. Source: AP / Cristiano Barbosa Cape Verde, located off the coast of Senegal, is the country with the smallest population to represent Africa in the global showpiece, with just 550,000 inhabitants.\n\n\n\n\n\nIt becomes the second-least populous nation to reach the World Cup, after Iceland, with just over 350,000, at Russia 2018.\n\n\n\n\n\n\"I shouted a lot during the match and now my voice is bad, but I am happy,\" Praia resident Jose Vieira said after the victory, which he watched live in the stadium.\n\n\n\n\n\nThe celebrations were expected to continue into the night with a concert at Praia's municipal stadium featuring local artists such as Djodje and Soraia Ramos.\n\n\n\nFootball fans celebrated in the streets after Cape Verde qualified for the FIFA World Cup for the first time. Source: AFP / Queila Fernandes Blue Sharks coach Pedro 'Bubista' Brito told the press, \"giving this happiness to these people is enormous\", adding that \"it's a victory for all the Cape Verdean people\".\n\n\n\n\n\nCape Verde won Group D with 23 points, four more than Cameroon, who hold the African record for World Cup appearances with eight. Cameroon drew 0-0 with Angola in Yaounde.\n\n\n\n\n\nAn archipelago of 10 islands in the Atlantic Ocean, Cape Verde gained independence from Portugal in 1975 and first attempted to reach the 2002 World Cup in Japan and South Korea.\n\n\n\n\n\n\"It's a special moment in this celebration of the 50th anniversary of our independence,\" Bubista said.\n\n\n\n\n\n\"It's a victory for all the Cape Verdean people and, above all, a victory for those who fought for our independence.\"\n\n\n\nCape Verde is the country with the smallest population to represent Africa in the global football showpiece, with just 550,000 inhabitants. Source: AFP / Queila Fernandes An emotional Vozinha, the 39-year-old goalkeeper, admitted: \"I have been dreaming of this moment since I was a child. It's time to celebrate.\"\n\n\n\n\n\n\"We knew we could do better (in the second half), and that's it ... it's time to celebrate,\" he said.\n\n\n\n\n\n\"It's too emotional. I embrace all the Cape Verdean people, at home and in our great diaspora,\" said scorer Stopira.\n\n\n\n\n\nCaptain and striker Ryan Mendes said: \"Honestly, I don't have the words to describe this moment. I'm very, very happy.\"\n\n\n\nCape Verde's Stopira (bottom) celebrates with his teammate after defeating Eswatini. Source: AP / Cristiano Barbosa The team reached the Africa Cup of Nations quarter-finals on their debut in 2013 and again in 2023, and are currently ranked 70th in the world.\n\n\n\n\n\n\"It's time to celebrate,\" 39-year-old goalkeeper Vozinha told the press, saying he had \"been dreaming of this moment since I was a child\".\n\n\n\n\n\nAlgeria, Egypt, Morocco, Tunisia, Ghana and Cape Verde have now won groups and filled six of the nine places automatically reserved for Africa at the 2026 World Cup.\n\n\n\n\n\nFan Jose Jorge Borges, a 60-year-old journalist, said it was a very memorable moment for Cape Verdeans.\n\n\n\n\n\n\"The emotions are visible and difficult to describe.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/freed-israeli-hostages-hug-loved-ones-in-tears-of-joy/jxif449lm",
    "title": "In pictures: Freed Israeli hostages hug loved ones in tears of joy",
    "publish_date": "Mon, 13 Oct 2025 20:39:56 +0000",
    "category": "sports",
    "authors": [],
    "text": "Freed Israeli hostages and their family and friends bounded into one another's arms on Monday, beaming and crying with joy at the end of the captives' two-year ordeal in Gaza.\n\n\n\n\n\nWrapped in blue and white Israeli flags, those returning waved and smiled as military helicopters landed them back in Israel after militants freed the remaining 20 living hostages from the Palestinian territory under a US-backed ceasefire deal.\n\n\n\n\n\nVideos filmed and released by the Israeli military captured some of the raw emotion of the reunions.\n\n\n\nMatan Zangauker (right) was received by his mother Einav Zangauker (left). Source: AFP / Israeli Army \"My life, you are my life ... you are a hero,\" cried Einav Zangauker as she embraced her smiling son Matan, in one video.\n\n\n\n\n\n\"Love of your mother, bless you, bless you, my dear.\"\n\n\n\nEitan Mor (middle) aboard an Israeli military helicopter with his family. Source: AFP / Israeli Army Eitan Mor's father wailed in relief as he and the young man's mother squeezed him tight, the footage showed.\n\n\n\nBar Kuperstein waves from the window of a bus at Sheba Tel-HaShomer Medical Centre in Ramat Gan, Israel. Source: AFP / Ahmad Gharabli Other young hostages such as Bar Kuperstein and Yosef Haim Ohana waved from the windows of vans that brought them to the Sheba medical centre near Tel Aviv, as cheering crowds nearby raised Israeli flags.\n\n\n\n\n\nFreed Israeli-German twins Gali and Ziv Berman smiled and gave the thumbs-up, wearing the yellow and blue shirts of their favourite football team, Maccabi Tel Aviv.\n\n\n\nZiv (left) and Gali (right) Berman after being handed over in the prisoner-hostage swap. Source: AFP / Israeli Army\n\nHostages' families rejoice\n\nIn nearby Tel Aviv, hundreds of people erupted in joy, tears and song on Tel Aviv's Hostages Square on Monday as news of the releases broke.\n\n\n\n\n\nMany had come at sunrise, carrying pictures of the hostages and waving Israeli flags bearing a yellow ribbon, a symbol of the movement calling for their release.\n\n\n\n\n\n\"It's so exciting and overwhelming that it's finally happening,\" said Shelly Bar Nir, 34.\n\n\n\nOmri Miran (left) was received by a family member. Source: AFP / Israeli Army \"What we've been fighting for, for over two years — finally our hostages are coming home.\"\n\n\n\n\n\nAnother woman on the square, Noga, who wore a badge that read \"Last day\", shared her pain and joy.\n\n\n\n\n\n\"I'm torn between emotion and sadness for those who won't be coming back,\" she said.\n\n\n\nElkana Bohbot greeted upon his arrival at the Sheba Tel-HaShomer Medical Centre. Source: AFP / Ahmad Gharabli Hamas and its militant allies took 251 hostages into Gaza during the October 7 attack on Israel in 2023.\n\n\n\n\n\nMany of them were released in earlier truces, but 47 people seized on October 7 remained in Gaza. Only 20 of them are alive.\n\n\n\n\n\nSince that day, Noga has worn a small badge each day, counting the days of their captivity.\n\n\n\n'Welcome home'\n\nFor the past two years, people have held frequent rallies and gatherings on this spot in Tel Aviv that has become known as Hostages Square.\n\n\n\n\n\nWhen the news broke that the first seven of the remaining hostages had been released on Monday, the square broke out in cheers and song.\n\n\n\n\n\nIsrael later confirmed all living 20 hostages had returned to the country, with a series of posts on X that read: \"Welcome home\".\n\n\n\nAvinatan Or greets well-wishers upon arriving at Beilinson Hospital in the Rabin Medical Centre in Petah Tikva, Israel. Source: AFP / Menahem Kahana The Hostages and Missing Families Forum, the main organisation representing their relatives, had called on people to gather at the site with the yellow ribbons.\n\n\n\n\n\nAs the war in the Gaza Strip has dragged on, the ribbons became ubiquitous in public spaces in Israel, from roundabouts to car door handles and stroller grips.\n\n\n\n\n\nIsrael did not expect all of the dead hostages to be returned on Monday.\n\n\n\n\"Our struggle is not over. It will not end until the last hostage is located and returned for proper burial,\" the forum said in a statement.\n\n\n\n\n\n\"Only then will the people of Israel be whole.\"\n\n\n\n\n\nIn exchange for the hostages, Israel freed nearly 2,000 prisoners and detainees held in its jails, most of them Gazans detained since the start of the war.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/international-friendly-live-popovic-s-unbeaten-socceroos-take-on-pochettino-s-usa-20251013-p5n213.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "International friendly LIVE: Popovic’s unbeaten Socceroos take on Pochettino’s USA",
    "publish_date": "Wed, 15 Oct 2025 12:58:22 +1100",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "And now Aiden O’Neill has just gone in hard on Sands, too, sparking a bit of a scuffle between players from both teams, and an intervention from the referee - who, again, chooses not to reach into his pocket. O’Neill just gets a talking to.\n\nAnyway, the two minutes of stoppage time for this first up have almost elapsed - indeed, they have. That is half-time. And a fiery finish to the first 45 minutes it was.\n\nIt’s 1-1 after Jordan Bos’ fantastic opener and the response from Haji Wright, which came 15 minutes later.\n\nWe’re set for a cracking second half, I reckon.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/lifestyle/fashion/how-to-pronounce-the-name-of-summer-s-hottest-shoe-birken-sh-tock-20250930-p5mz22.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Apparently, we’ve all been saying Birkenstock wrong",
    "publish_date": "Wed, 15 Oct 2025 12:57:07 +1100",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "“We are more like a medical item than a fashion piece,” says Jochen Gutzy, Birkenstock chief communications officer. “As our chief executive says, ‘we’re like aspirin for the feet’.” Fashion is a relative newcomer to the Birkenstock business, with supermodel Heidi Klum launching their first official fashion collaboration in 2003. But the brand’s medical history runs far deeper than Klum’s noughties denim designs. Loading The footwear company’s journey began in 1774, with German shoemaker Johann Birkenstock. It picks up pace in 1897 with great-grandson Konrad Birkenstock and his fixation on orthopaedic shoe lasts. That foot-health fixation remains, outlasting a series of Carls and Karls in the family, which gave up control of the business in 2012. It has even survived an IPO in 2023, when the company was valued at up to $US8.3 billion ($12.8 billion).\n\n“Walking is like breathing and drinking water, and the footbeds are the ingredient that the human being needs for healthy living,” Gutzy says. “We care about people’s health and wellbeing. Now I think fashion is looking for the real thing because the consumers are better informed.” Birkenstocks being assembled at the company’s German factory in Görlitz. While Gutzy is happy with growing sales to fashion consumers, the business is not chasing collaborations, having declined potentially lucrative partnerships with former Louis Vuitton creative director Marc Jacobs, streetwear giant Supreme and Guram Gvasalia’s French fashion brand Vetements. A year after Louis Vuitton said yes to a partnership with Supreme in 2017, which was greeted with fanfare by Vogue and GQ, Birkenstock said no.\n\n“There’s no benefit for us except prostitution because this is just prostitution,” Reichert told The Cut. Marc Jacobs unofficially adapted Birkenstocks for the runway for his seminal grunge spring 1993 collection for Perry Ellis. More recently, when Jacobs approached Birkenstock with sketches for an official collaboration, it was time to raise the red flag, again, Gutzy says. “We said ‘thank you, but no’ because the ideas that he had in mind for the outsole... it might get some attention out there, but from an orthopedic standpoint, it’s wrong, so let’s not do it. “We feel comfortable with what we’re doing. When I joined the company in 2012, we produced 12.3 million pairs. Now we are sitting [at] around 40 million. We plan on doubling that capacity in the coming years.” At Birkenstock factories outside the picturesque German town of Görlitz, automated machines are being introduced alongside the 1900 workers supervising the production of cork innersoles, the cutting of leather and precise placement of buckles.\n\nDuring a workshop, where I designed my own pair of sandals (sorry Supreme and Marc Jacobs) I learnt that it’s pronounced Birken-sh-tock. Say the name correctly and no one will question your decision to wear sandals with socks. An off-duty Gigi Hadid in New York. Right: Birkenstock “Boston Big Buckle” clogs. Birkenstock manufactures 95 per cent of its shoes in Germany, and has a factory outpost in Portugal. Last month the company said it had bought a facility near Dresden to further increase its manufacturing capacity. Entrepreneur Margot Fraser distributed the shoes through Californian health food stores in the ’60s, cementing their hippie reputation for crunchy granola feet. The US is still crucial to the brand’s success. In Australia, Marcel Goerke pioneered an appetite for the footwear, challenging the supremacy of the thong as summer footwear in 1992, with a catalogue aimed at the local market. In 1993 Birkenstock opened its first store in Melbourne. Sydney had to wait until 2024.\n\nLoading “Marcel was raised in a family that distributed Birkenstock shoes over the span of three generations and then moved to Australia,” says Gutzy. “Australian consumers understand the product. It’s one of the markets with the highest per capita usage of Birkenstock products worldwide.” In the ’90s Goerke noticed that Birkenstocks wore down more quickly in Australia than in Germany, and pushed a repairs program. Last year more than 5000 pairs were repaired in Australia. “They are designed to be repaired,” Gutzy says. Having found their feet in the world of fashion, Birkenstock has one more obstacle to face.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/afl/afl-trade-period-live-2025-blues-reject-swans-offer-for-curnow-as-trades-enter-last-day-20251014-p5n2j7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL trade period LIVE 2025: Petracca move close for Suns; Blues reject Swans offer for Curnow",
    "publish_date": "Wed, 15 Oct 2025 12:57:06 +1100",
    "category": "finance",
    "authors": [
      "Roy Ward"
    ],
    "text": "Predictions as we edge closer to the 7.30pm deadline:\n\nSometimes, you can divine what will happen in trades by the tone of the negotiations, by how far hard each party is willing to go and, most obviously, by the sticking points.\n\nThat’s why I’m confident that Charlie Curnow will get traded to Sydney and Christian Petracca will get his wish and become a Gold Coast player.\n\nCharlie Curnow marks in front of Steven May in July. Credit: Getty Images\n\nCarlton are objecting to giving back pick 22 – when this kind of pick is the grievance holding up a trade, the deal almost invariably lands.\n\nSimilar logic applies to Melbourne’s line on Petracca – the Suns have put up picks seven and eight, which is a super deal, no matter what the Demons say, and they’d be silly to let that opportunity go.\n\nPicks coming back to Gold Coast will get sorted. How many players will draw two top-10 picks in any draft (even if this one is comprised and thin)?\n\nClayton Oliver will become a Giant, for sure. It will just be a question of how much of that massive $1.3 million (times five) contract Melbourne pays. Quite a bit.\n\nMarshall going down to wire\n\nI’m less confident about Rowan Marshall’s wish to head down the highway with Nathan Buckley and play for the Cats.\n\nSt Kilda will take some persuading.\n\nMy guess is that deal will be done very late after brinksmanship.\n\nBuku Khamis will end up at Carlton, yes. They aren’t arguing over sheep stations in that transaction.\n\nToo late on De Goey?\n\nCollingwood appear to have left their run too late to deal Jordan De Goey.\n\nHe doesn’t have a clear suitor – Melbourne or Hawthorn would be logical (Hawks only if Zach Merrett is stranded at Essendon) since they could have picks just inside the top 10 and it will only take one proper first rounder.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/queensland/magic-mushrooms-mdma-therapy-covered-by-private-health-in-brisbane-first-20251015-p5n2mc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Magic mushrooms, MDMA therapy covered by private health in Brisbane first",
    "publish_date": "Wed, 15 Oct 2025 12:48:43 +1100",
    "category": "lifestyle",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "Queenslanders suffering post-traumatic stress disorder and treatment-resistant depression will soon have access to MDMA and magic mushrooms through their private health insurance, saving tens of thousands of dollars.\n\nThe world-leading psychotherapy program involves the prescribed use of psychedelic substances MDMA and psilocybin, commonly known as magic mushrooms, and will be delivered by authorised practitioners at private mental health hospital Avive Health in Windsor.\n\nPsychedelic-assisted psychotherapy is facilitated by authorised and specially trained psychiatrists in controlled environments. Credit: Chris Hopkins\n\nPrivate health provider Medibank will offer the service to eligible customers after becoming the first insurer in Australia to launch a fully rebated psychedelic-assisted psychotherapy program for PTSD and TRD treatment in Perth this year.\n\nMedibank chief medical officer and practising psychiatrist Dr Andrew Wilson said the specialised treatment, which had been approved in Australia since July 2023, was only facilitated by a small number of psychiatrists and was financially out of reach for most people.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/queensland/three-die-in-queensland-house-fire-police-declare-crime-scene-20251015-p5n2ot.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Woman, two girls killed in Queensland house fire, police declare crime scene",
    "publish_date": "Wed, 15 Oct 2025 12:46:01 +1100",
    "category": "finance",
    "authors": [
      "Julius Dennis"
    ],
    "text": "The bodies of a woman and two children have been found in the remains of a house that burned to the ground in central Queensland.\n\nParamedics did not treat anyone at the scene, in the Gladstone suburb of Toolooa, with emergency services called to the Whiting Street house just before 6am.\n\nFive fire crews arrived at the scene shortly after, where they found the house engulfed by flames.\n\nStructural damage hampered firefighters’ attempts to search the house before the fire was extinguished about 9am.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/bos-burns-horrible-usa-defence-20251015-p5n2qu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bos burns 'horrible' USA defence",
    "publish_date": "Wed, 15 Oct 2025 12:42:27 +1100",
    "category": "finance",
    "authors": [],
    "text": "Bos burns 'horrible' USA defence\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/queensland/plans-for-traffic-lights-to-fix-city-s-third-most-dangerous-intersection-20251015-p5n2ob.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Plans for traffic lights to fix city’s third-most dangerous intersection",
    "publish_date": "Wed, 15 Oct 2025 12:39:48 +1100",
    "category": "finance",
    "authors": [
      "Felicity Caldwell"
    ],
    "text": "This suburban intersection is one of the most dangerous in Brisbane, and drivers must rely on their knowledge of road rules to work out who has to give way, via two Stop signs and white painted lines.\n\nAnd the road width means waiting motorists tend to squeeze their cars up beside other vehicles, adding to the confusion.\n\nBrisbane City Council has released plans for an update, which includes four sets of traffic lights, separate turning lanes and pedestrian crossings.\n\nBrisbane City Council has released a concept design for traffic lights at the intersection of Archerfield Road, Azalea Street and Pine Road at Inala. Credit: Brisbane City Council\n\nThe intersection of Archerfield Road, Azalea Street and Pine Road carries almost 22,000 vehicles a day, connecting people travelling through Inala and Richlands.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-kayaker-fights-for-life-after-falling-in-brisbane-river-20251014-p5n2du.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Kayaker dies after falling in Brisbane River; Plane turned around after midflight emergency; Instagram limits teens to PG-13 content",
    "publish_date": "Wed, 15 Oct 2025 12:36:29 +1100",
    "category": "finance",
    "authors": [],
    "text": "Developers have lodged plans for a 37-storey apartment tower next to the Go Between Bridge in South Brisbane, featuring an above-ground six-level car parking podium.\n\nMosaic Property Group plans to build a 37-storey apartment tower next to the Go Between Bridge. Credit: Mosaic Property Group\n\nMosaic Property Group’s proposal for the new tower on the corner of Montague Road and Bouquet Street along the Brisbane River comprises 204 apartments and car parking built on a six-storey podium on the lower levels of the building, which will be concealed by lush planting.\n\nA publicly accessible “pocket park” beneath existing fig trees along the river is included in the design, as well as a rooftop recreation deck spanning two levels, which will feature a wellness zone complete with hot and cold plunge pools and treatment rooms.\n\nThe current development application forms part of a broader proposal, with a second tower planned for the adjoining site at a later date.\n\nDetails of the proposal come after developer Aria was given the green light from Brisbane City Council to build three huge new towers, also in South Brisbane, on a block bordered by Manning, Melbourne and Edmondstone streets.\n\nThe massive Aria development includes a 50-story tower, which is set to be taller than any existing building outside the CBD, and the seventh-biggest in the city. The two other towers will be 40 storeys and 24 storeys.\n\nThe location of the proposed tower, next to the Go Between Bridge.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/dare-to-dream-the-emerging-x-factor-bowler-ready-for-ashes-20251014-p5n2g6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Dare to dream’: The emerging X-factor bowler ready for Ashes",
    "publish_date": "Wed, 15 Oct 2025 12:27:59 +1100",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Queensland quick Xavier Bartlett says he’s ready to an answer Ashes SOS to support an injury-ravaged Australian bowling attack.\n\nThe battle with the English enemy is five weeks away, and Australia’s fast-bowling stocks have been plunged into crisis.\n\nSkipper Pat Cummins was in doubt with stress fractures in his back, while Lance Morris, Jhye Richardson, Spencer Johnson and Brendan Doggett have all been felled.\n\nXavier Bartlett looms as an option to come into the Ashes fold should injuries strike the nation’s frontline trio. Credit: Getty\n\nBut Bartlett, who has overcome his own torrid injury history – side strains, calf concerns and stress fractures – was adamant he was as prepared as he would ever be to make his debut in the Ashes furnace.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/technology/instagram-limits-teens-to-pg-13-content-20251015-p5n2kl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "No sex, drugs or dangerous stunts: Instagram limits teens to PG-13 content",
    "publish_date": "Wed, 15 Oct 2025 12:26:20 +1100",
    "category": "finance",
    "authors": [
      "Tim Biggs"
    ],
    "text": "Young users of Instagram in Australia will soon face a significantly restricted experience after Meta announced new global changes to its Teen Accounts program, in addition to the federal government’s incoming social media restrictions.\n\nThe Facebook and Instagram parent company said all users under 18 would have their accounts restricted by default, meaning they would not see content involving sex, drugs or dangerous stunts, and would be blocked from viewing accounts flagged as including such content. Adults supervising teens with their own account will be able to override the restrictions or impose harsher ones.\n\nMeta has announced that teenagers on Instagram will be restricted to seeing PG-13 content by default. Credit: Bloomberg\n\nCombined with the government’s new social media rules, coming into effect in two months, this means users will not be able to use Instagram until they are 16, at which point they will be able to access a censored version unless their parents agree to remove the restrictions.\n\nSwinburne University digital media expert Belinda Barnet said Meta’s move showed that Australia’s pressure was having a global positive effect, despite criticism of the social media ban on technical grounds.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/culture/music/melbourne-exhibition-swoops-as-powerhouse-passes-on-piece-of-rock-n-roll-history-20251015-p5n2me.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Melbourne exhibition swoops as Powerhouse passes on piece of rock’n’roll history",
    "publish_date": "Wed, 15 Oct 2025 12:20:22 +1100",
    "category": "entertainment",
    "authors": [
      "Linda Morris"
    ],
    "text": "A Sydney museum has passed up a chance to bid for and display Midnight Oil drummer and songwriter Rob Hirst’s drum kit, acquired at a charity auction by a fan club for $77,500.\n\nThe important piece of Australian rock memorabilia is instead headed for Melbourne’s Australian Music Vault after the Powerhouse Museum said the “timing did not align with our acquisition processes on this occasion”.\n\nRob Hirst of Midnight Oil at the drum kit.\n\nSydney-based Hirst parted with the kit he used from 1979 to the band’s 2022 farewell concert due to his battle with pancreatic cancer. Money raised is going towards First Nations musicians and support for band crew who have fallen on hard times.\n\nFan group Powderworkers purchased it on Monday after emailing a group of institutions asking for potentially matching donations. The Australian Music Vault invited Matthew Yau, who spearheaded the campaign, to talk about its potential display.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/business/banking-and-finance/cba-boss-matt-comyn-to-stay-on-for-another-three-years-20251015-p5n2or.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "CBA boss Matt Comyn to stay on for another three years",
    "publish_date": "Wed, 15 Oct 2025 12:14:44 +1100",
    "category": "finance",
    "authors": [
      "Clancy Yeates"
    ],
    "text": "Commonwealth Bank chair Paul O’Malley has signalled that chief executive Matt Comyn is likely to remain in the job for another three years, which would mean serving for a decade as the boss of Australia’s largest bank.\n\nSpeaking to CBA shareholders at the bank’s annual meeting on Wednesday, O’Malley said he intended to stand for his final three-year term as chair, with the support of the board.\n\nCBA chief executive Matt Comyn is likely to remain the boss of the bank until at least 2028. Credit: Oscar Colman\n\nO’Malley added that the next chair would appoint the successor to Comyn, who has been the CEO of CommBank since April 2018.\n\n“One of the board’s key roles is appointing the CEO and ensuring appropriate succession plans. We have been pleased with the performance of Matt as CEO,” O’Malley said at the meeting in Brisbane.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/crispy-miso-fish-tacos-with-edamame-guacamole-20251014-p5n2cp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Crispy miso fish ‘tacos’ with edamame guacamole",
    "publish_date": "Wed, 15 Oct 2025 12:09:50 +1100",
    "category": "lifestyle",
    "authors": [
      "Jessica Brook"
    ],
    "text": "Step 1 Cook the edamame in boiling, salted water for about 2 minutes, or until they are bright green and just tender. Drain and run under cold water to stop the cooking and preserve their colour. In a food processor, combine the blanched edamame, avocado, lime zest and juice, and 1 tablespoon of the pickled ginger. Pulse until the mixture is smooth and creamy. Taste and season generously with salt and pepper. Set aside until ready to assemble the tacos.\n\nStep 2 Combine the miso, soy sauce, vinegar and 1 tablespoon of water in a shallow bowl. Whisk to combine and season with salt and pepper, and set aside.\n\nStep 3 Pour about 3cm of vegetable oil into a large pan. Heat over high heat until the oil reaches 180C and you see shimmering, ripple-like waves across the surface.\n\nStep 4 Season the cornflour generously with salt and pepper in a wide, shallow bowl. Dredge the fish fillets in the cornflour, shaking off any excess.\n\nStep 5 Working in two batches, carefully add the fish and fry for about 2 minutes each side, or until the fillets are golden brown and crisp. Remove and drain on a wire rack or paper towels.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/culture/books/white-lotus-without-the-awful-people-the-new-trend-for-luxury-writers-retreats-20251009-p5n1co.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "White Lotus without the awful people: the new trend for luxury writers’ retreats",
    "publish_date": "Wed, 15 Oct 2025 12:00:00 +1100",
    "category": "finance",
    "authors": [
      "Jane Sullivan"
    ],
    "text": "“There’s one born every minute” is the ominous headline on Richard Z. Santos’s article for Slate about the booming business of luxury writers’ retreats. And yes, there is this vague suggestion throughout his piece that the people who sign up for these expensive adventures could be conning themselves.\n\nSpend a few thousand to get to Guatemala and enjoy a beach massage and a traditional Mayan shaman fire ceremony, Santos writes. Spend a week on the Queen Mary 2, or a Tuscan estate, or a French chateau. “Maybe – if your jet lag and the wine from the night before have worn off – you can even sneak in a little writing time.”\n\nThe ocean liner Queen Mary 2 is one of the options for a luxury writers’ retreat. Credit: Cunard\n\nOn the internet, there are dozens of these tempting offers for writers or wannabe writers with deep pockets, all sounding like White Lotus without the horrible people. These are not venerable writers’ retreats such as Yaddo in New York State, where applicants compete to get in. Anyone with the cash can go.\n\n“Wouldn’t it be fantastic if someone was serving you delicious, healthy food, and there was a crackerjack writing coach on call if you have a question or get stuck?” it says on the website of Jennifer Louden, who organises retreats in the US. “And a glorious wise circle of women to giggle with.”",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/culture/comedy/people-who-want-to-be-offended-are-always-going-to-be-offended-harry-enfield-20251012-p5n1ul.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "People who want to be offended are always going to be offended: Harry Enfield",
    "publish_date": "Wed, 15 Oct 2025 12:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "Lenny Ann Low"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Harry Enfield, legendary British comedian, pioneering 1990s satirist, is sitting in a small, brightly lit London kitchen beside a sink. It’s almost a surprise. Early communications from his people suggested Enfield would only be interviewed about his upcoming Australian tour, Harry Enfield: And No Chums, if he did it as one of his famous comedy characters. Cash-waving Cockney loudmouth Loadsamoney perhaps. Or maybe well-bred fool Tim Nice-But-Dim Esq, or cheesy radio DJ Dave “Nicey” Nice (my vote). All part of the cavalcade of characters he played in BBC TV shows that made Enfield a household name in Britain from the 1980s onwards. But here is the real Enfield, hands clasped on top his head as he explains why there is a hammer an arm’s reach away on the sink top. “Well, one of my people is sitting here shaking his head and giggling,” Enfield says of a confidant just beyond the laptop’s screen. “One has to discipline one’s people sometimes, right?” In the 1990s, more than 10 million people tuned in to watch Enfield’s sketch TV shows, from Harry Enfield’s Television Programme to Harry Enfield & Chums and Harry & Paul, the latter adding his longtime collaborator Paul Whitehouse to the title. Harry Enfield as his character Kevin the Teenager. Credit: Alamy Stock Photo Enfield was already famous in late-1980s Britain for TV appearances as Greek kebab-shop owner character Stavros and Loadsamoney, the bravado-infused figure satirising prime minister Margaret Thatcher’s ideology and politics. When Enfield got his own show, a plethora of comedy guises and double acts was unleashed, ranging from clueless upper-class twit Tim Nice-But-Dim Esq, working-class caricatures Wayne and Waynetta Slob, witless young Conservative Tory Boy and cheesy radio DJs Smashie and Nicey.\n\nAdvertisement\n\nSuch was the fame of Enfield’s recalcitrant adolescent character Kevin the Teenager, he and best friend Perry, played by actor, director and regular collaborator Kathy Burke, got their own feature film, Kevin & Perry Go Large, in 2000. The movie’s promotional tour 25 years ago brought Enfield to Australia for the first time, although he barely saw the place. “It’s the only time I’ve been there, and I just really sat in a hotel room for two days,” he says. “Then I went out at lunchtime, cuddled the Sydney Opera House and then ran back. That was all I did. It was nice to fondle it.” Enfield’s TV shows in the 1990s and 2000s were shown here, but he may be better known for The Windsors (2016-2023), a sitcom lampooning the British royal family in which Enfield played Prince Charles and then the King. His portrayal of the monarch – all furrowed brow, cuff-twiddling and starchy downturned mouth – was, he says, parody but not without empathy. That’s been his approach with every character, no matter their stature. Enfield with frequent collaborator Paul Whitehouse as their characters The Old Gits. Credit: Alamy Stock Photo “What Paul Whitehouse and Kathy Burke and I have always done is a lot of stuff that’s full of truth,” he says. “With Kevin the Teenager, everyone has teenagers, they know that kind of thing, but it’s always nice, it’s never nasty. It might be mischievous, but it’s never malicious. And I think that’s what people like really. Or most people.” Enfield, who rarely gives interviews and eschews celebrity status, is segmenting Harry Enfield: And No Chums between character performance, talking about his career and answering questions from the audience. “Obviously, I’m very old to be doing Kevin now,” he says. “I’m 64. But I’ll be talking about how he affects my life these days. There will be loads of characters in the show, but I’ll also be talking about my life in comedy and how [comedy has] changed and also the people I’ve done that I’ve got into trouble for doing, maybe a little bit.”\n\nAdvertisement\n\nThere are some characters from decades ago that he wouldn’t do now. “Because things have changed a bit,” he says. “People are more wary. I’m not really sure who invents the rules these days.” He recalls working on satirical TV puppet show Spitting Image and voicing boxer Frank Bruno, a casting that wouldn’t happen today. He’s not certain Women, Know Your Limits!, his satire about misogyny – presented as a 1930s-style British public service announcement about the terrors of letting women think for themselves – would be allowed now either. TAKE 7: THE ANSWERS ACCORDING TO HARRY ENFIELD Worst habit? Some might say I’m big-headed. Greatest fear? Losing my staggeringly good looks. The line that stayed with you? How Peter Cook described me: “Lauded by his equals, feared by his rivals and loathed by all and sundry.” Biggest regret? I wish I had drowned my sisters. I have had to share my mummy’s affections with them. Favourite book? I haven’t written one about myself yet. But when I do, it’ll be that. The artwork/song you wish was yours? Release The Bats by Nick Cave’s Birthday Party. If you could time travel, where would you choose to go? I would travel forward 200 years. By then there will be a vast statue of me in every world metropolis. “There’d probably be a lot of people saying you’re perpetuating stereotypes,” he says. “Which is rubbish, obviously, but that’s just an example. In fact, a few years ago, I went on this yoga week and there was this German woman who was very sweet but kept on frowning at me. “I thought, oh, I don’t know what I’ve done. And then one day, she came up and said, ‘I’ve realised who you are. You’re Women, Know Your Limits!’ She was a professor in gender studies, and she said every year, the first thing she shows her new students is that sketch, and then they start from there. That was lovely, you know? Pretty much everything I do is that kind of thing.” Enfield’s era of TV crammed with sketch comedy shows is over. Drama wins over comedy, he says, in terms of funding. He’s pleased to see David Mitchell and Robert Webb have a new TV sketch show, Mitchell and Webb Are Not Helping, but equally cheered by the diversity and number of people making new comedy online. “There are more people frightened of more things nowadays and more people frightened of offending anyone,” he says. “Well, people who want to be offended are always going to be offended. As I say, my thing is mischief, not malice. Some people will find that offensive because they’ve got a fixed view of what’s right and what’s wrong and they don’t really have a sense of humour about things.”\n\nAdvertisement\n\nEnfield is a big fan of Australian comedian Sam Campbell and British poet, comedian and actor Tim Key, and is regularly taken to see new comedians by his adult children. He and Whitehouse get together as much as possible. “He’s the loveliest man,” Enfield says. “I once upset Richard Curtis. He said to me, ‘I’m still trying to get over when you said I’m the second-nicest man in the world after Paul Whitehouse.’” What does he think of fans from the other side of the globe, in a place he visited once 25 years, wanting to see his show? Enfield may be part of a steady groundswell of tours by comics of his generation – Ben Elton, Tony Robinson, Alan Davies, Eddie Izzard, Bill Bailey to name a few – but their TV and live shows are perhaps better known here. Loading “Do you mean I’m culty?” Enfield says, leaning forward with a quizzical smile. “I’ve never been culty over here, I’ve just been on the telly. So, I like being a cult. That’s good.” He is greatly looking forward to being in Australia again, although his friend Elton, a longtime Australian resident, will be away. “I’m coming to talk to everyone about everything,” he says. “Including meeting Camilla in real life.” What was that like? “It was cool,” Enfield says. “She was very nice. I sat next her in church, and we had a little chat. I didn’t tell her some of the nastier things … not nasty, but some of the silly and naughty things that we’ve done [about her].”\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 31
  }
]