[
    {
        "url": "https://www.9news.com.au/national/weather-australia-where-the-day-zero-droughts-will-hit/eab56697-770c-4314-adc0-5da3c36a5029",
        "title": "Water taps risk running dry in vast swathes of Australia",
        "publish_date": "Wed, 24 Sep 2025 01:39:51 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Southern Australia is among the global regions forecast to experience \"day-zero droughts\", periods of extreme drought and water shortages﻿ in the years ahead, according to new research.\n\nThe study, published in the journal Nature this week, examined how periods of drier and warmer weather driven by climate change will impact agriculture and ecosystems, including water supply.\n\nAustralia's southern states are ﻿projected to endure more prolonged day-zero drought events with less time between each one, limiting their ability to recover.\n\nSenior farmer looking over the drought stricken land, during summer and fire season. (Getty)\n\nIt could face this situation as early as the 2020s or 2030s.\n\nThe scientists used a large number of climate models to assess the timing and likelihood of day-zero droughts.\n\nChristian Franzke, a climate scientist at Pusan National University in South Korea and an author of the report, said they are \"unprecedented water scarcity events, events which haven't occurred so far\".\n\n\"It's when you turn on your water tap and no water comes out,\" he said.\n\nSouth Australia has already had a taste of what may come in the years ahead following the severe drought earlier this year.\n\nParts of South Australia, south-west Victoria and north-west Tasmania had their driest start to the year on record.\n\nIt left farmers pleading for emergency supplies of hay, or selling stock to stay in business, while some isolated communities depended on water being trucked in as reservoirs ran dry.\n\nFranzke said the study's findings point to the clear need to speed up the clean energy transition, he said, as well as improve water management — huge amounts are wasted through leaky pipes, for example.\n\n- With CNN﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/university-student-burned-after-phone-charger-explodes-overnight-armidale-nsw/7c78d572-7651-481f-aca7-68d6987507d1",
        "title": "'I freaked out': Uni student's arm 'torched' after phone charger exploded",
        "publish_date": "Wed, 24 Sep 2025 01:12:57 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "A NSW university student is urging people to check their phone chargers after his exploded while he slept, leaving him with serious burns.\n\nOllie Anderson, 21, borrowed ﻿the device from his friend about three weeks ago to charge his phone overnight.\n\nHe woke up abruptly some time later.\n\nREAD MORE: Popular beef mince recalled over plastic found in packets ﻿\n\nUniversity student Ollie Anderson suffered painful burns after his phone charger exploded. (Supplied)\n\n\"I looked down and the whole side of my body is kind of engulfed in flames,\" Anderson told 2GB's Ben Fordham .\n\n\"I freaked out, jumped up, I thought I might burn the whole college down.\"\n\nHe said he didn't even realise he had been burned for several minutes when somebody told him his arm looked \"kinda torched\".\n\nHis burns extend along most of his right arm. (Supplied)\n\nAnderson was left with very painful burns along nearly the full length of his right arm.\n\n\"I think I am pretty lucky, you look at it and think that's probably the best case scenario,\" he said.\n\n\"It could have been a lot worse.﻿\"\n\nThe Armidale resident treks into the hospital every two days for the nurses to peel off the dying skin and treat his wounds.\n\nAnderson continues to receive care weeks after the incident. (Supplied)\n\nLuckily, no skin grafts were needed.\n\nThe charger in question was a Zap Pad from Australian company Zip Zap.\n\nIt was among a number of the company's chargers that were subject to a recall last year, with the company confirming it had sent out several emails to customers.\n\nThe recall covered Zap Pads purchased from October 15, 2023, to December 27, 2023.﻿\n\nAnderson said his friend's father, who originally bought the charger, did not recall receiving an email.\n\nAnderson said the company had been good to deal with as he and his friend chased up some answers, but that he was struggling a bit overall - particularly with completing his current exams.\n\n\"I wouldn't say I was too happy, it's made life pretty hard,\" he said.\n\n\"You don't realise how much you need to bend your right arm until you can't.﻿\n\n\"I don't even charge my phone at night anymore.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/most-trusted-brands-australia-revealed-bunnings-aldi-kmart-apple/568fcb47-7b1c-4e72-85dd-19c1006dae21",
        "title": "Coles and Woolies named among country's most 'distrusted' brands",
        "publish_date": "Wed, 24 Sep 2025 00:51:38 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Australia's big four banks have surged up the list of the most \"trusted\" brands , while the country's biggest supermarkets have once again been named among the most distrusted.\n\nHardware ﻿giant Bunnings topped the quarterly list for the seventh time after being recognised as the \"best of the best\" most trusted brand for 2025 by research company Roy Morgan.\n\nThe top five trusted brands have remained the same over the past three quarters, with Aldi sitting in second place, Kmart in third, Apple in fourth and Toyota in fifth.\n\nREAD MORE: Millions of Aussies to have thousands in debt wiped from today\n\nColes and Woolworths were listed among the most distrusted brands in Australia. (Supplied)\n\nMeanwhile, the quarterly ranking named Woolworths and Coles as the most distrusted Australian brands, in first and second place respectively.\n\nThe embattled supermarket giants have ﻿weathered a tough 12 months as the retailers face ACCC action over allegations of price gouging.\n\nFacebook (Meta) closely followed in third place in the top 10 most distrusted brands list, ahead of Optus, Qantas, Temu, Telstra, Tesla, X and News Corp.﻿\n\nHowever Roy Morgan chief executive Michele Levine said there are \"green shoots of recovery\" for the least trusted brands.\n\n\"Woolworths, Coles and Qantas – four of Australia's biggest brands – have all experienced reputational crises in recent years, but there are positive signs for all of them in the latest trust data,\" Levine said.\n\n\"Underneath the surface, and despite continuing high levels of distrust, it's worth mentioning Qantas has continued to improve their trust significantly, and even the two most distrusted – Coles and Woolworths – are showing green shoots of recovery, albeit with a very long way to go.\"\n\nCommonwealth Bank was ﻿the only big four Aussie bank to make it into the top 10 list. (Wayne Taylor)\n\nDespite a similarly bleak year for banks, all four major financial institutions improved﻿ their ratings on the trusted list.\n\nCommonwealth Bank was ﻿the only one to make it into the top 10 list at number seven.\n\nNAB rose among the ranks by 29 spots to settle in at 19th place, while Westpac moved into 21st position.\n\nANZ also achieved an impressive reputational boost in the June 2025 report﻿ after climbing 104 places to 51st.\n\nRoy Morgan noted this \"rapid increase\" for ANZ took place before ASIC imposed a recoed $240 million fine for misconduct.﻿\n\n\"All four of the big banks have improved their rankings in both quarters of 2025 so far – a period which included the first cuts to official interest rates for nearly five years after a sustained period of interest rate increases,\" Levine added.\n\nThe quarterly Roy Morgan report surveys about 1500 to 2000 Australians every month to measure levels of trust and distrusts of ﻿around 1000 brands.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/hecs-debt-reduction-how-it-will-change-your-pay-from-july-this-year/763cad42-a590-424e-b7f0-a4920cecb367",
        "title": "Millions of Aussies to have thousands in debt wiped from today",
        "publish_date": "Tue, 23 Sep 2025 21:51:49 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Australians with student debt will save thousands of dollars from today as the government's new HECS and HELP repayment rules kick in.\n\nThe promised legislation to slash student debt by 20 per cent was one of the federal government's early post-election priorities and passed the senate in July.\n\nAt the time, Education Minister Jason Clare admitted it would be a while before the savings kicked in.﻿\n\nAustralians with student debt will save thousands of dollars from today as the government's new HECS and HELP repayment rules kick in. (Getty Images/iStockphoto)\n\n\"The next step is for the tax office to do the work they need to do. Now that the bill has passed, they've got the certainty they need to make the changes to their systems to pass this on to three million Australians,\" Clare said then.\n\n\"That will take a bit of time. They've got to write about 50,000 lines of code to implement this and make sure that they get it right.\n\n\"But this is now going to happen. It's guaranteed. And it will be backdated to 1 June this year, before indexation happened.\"\n\nMinister for Education Jason Clare said the changes will \"take a bit of time\". (Alex Ellinghausen)\n\n﻿From today, graduates earning around $70,000 a year will save about $50 every fortnight, adding up to about $1300 in savings each year.\n\nThe minimum income to start repaying loans is also rising from $54,435 to $67,000.\n\nThree million Australians are set to benefit from the bill, with $5520 wiped from the average debt of $27,600.\n\nMore than three million Australians are expected to have their student debt cut by 20 per cent next month. (9News)\n\nHow will it all work?﻿\n\n\"The ATO will automatically apply the 20 per cent reduction to your outstanding debt and retrospectively adjust any indexation applied to your debt,\" CPA Australia's business lead Gavan Ord told 9news.com.au.\n\n\"No action is required from individuals. The government will notify you when the changes are implemented, and balances can be checked via myGov.\"\n\nThis reduction will be applied on top of any repayments made throughout the year after your tax return is completed.\n\nOrd said Australians﻿ should avoid listening to financial advice from online influencers about how to optimise their tax returns.\n\nAustralians﻿ should avoid listening to financial advice from online influencers about how to optimise their tax returns, an expert says. (Dominic Lorrimer)\n\n\"We urge Aussies not to follow misleading advice from social media 'finfluencers' suggesting you delay lodging your tax return,\" he said.\n\n\"Lodging your return is a legal responsibility and essential for accurate assessment.\"\n\nWhat happens if my HECS debt is finally paid off?\n\nCompulsory ﻿HECS repayments aren't allocated to your debt until after you have lodged your tax return.\n\nAfter this, it might mean your debt has reached the all-important zero balance.﻿\n\nIt means yo﻿u will no longer see the compulsory repayments taken out of your weekly, fortnightly or monthly pay.﻿\n\nYou'll need to let your employer know about this though, as it won't automatically stop.\n\nIt involves filling out a tax form ﻿called a \"withholding declaration\", which indicates to your employer that you no longer have a HECS debt.\n\nIt's as simple as ticking the box ﻿\"no\" on the form when it asks if you have a higher Education Loan Program (HELP), VET Student Loan (VSL), Financial Supplement (FS), Student Start-up Loan (SSL) or an Australian Apprenticeship Support Loan (AASL) debt.\n\nOnce your employer stops withholding extra tax, your next paycheck may slightly increase.\n\nCompulsory ﻿HECS repayments aren't allocated to your debt until after you have lodged your tax return. (Getty Images/iStockphoto)\n\nThis amount will vary depending on your salary and what your regular contributions were.﻿\n\nYou have to be earning above the threshold for it to impact﻿ your pay.\n\n﻿Australian taxpayers earning between $54,435 and $62,850 pay one per cent on their income and the figure rises the more you earn.\n\n\"Another proposed change to HECS is raising the income threshold at which people are required to start repaying their debt from $54,435 to $67,000, starting 1 July 2025, subject to the law being changed,\" Ord added.\n\n\"This means that if you earn less than $67,000, you won't need to make repayments, although voluntary repayments remain an option.\n\n\"This change also means your repayments will be lower.\"\n\nIf you've overpaid your HECS debt throughout the previous financial year, the ATO will take this into account and it will be refunded to you when you lodge your tax return.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/auspork-australia-organic-beef-mince-recall/200e98ba-a222-4a76-9d3e-4ea2bbb4e0c8",
        "title": "Popular beef mince recalled over plastic found in packets",
        "publish_date": "Tue, 23 Sep 2025 23:38:08 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "A﻿ popular organic beef mince sold across Australia is being recalled over a potential health hazard.\n\nFood Standards Australia and New Zealand issued the recall for Auspork Australia countryorganic beef mince due to plastic pieces being found within it.\n\nIf consumed, they may cause illness or injury, the regulator says.\n\nREAD MORE: Millions of Aussies to have thousands in debt wiped from today\n\nPacks of Auspork Australia organic beef mince are being recalled over a potential health hazard. (Supplied)\n\nThe mince is sold in 500g packs at independent food stores, including IGA in NSW, Queensland, Victoria, Tasmania, SA, the Northern Territory and Supabarn in the ACT.\n\nThe affected packs carry a best before date of September 28, 2025.﻿\n\nConsumers are advised against eating the mince.\n\nThey should return the product to the place of purchase for a full refund.\n\nAnyone concerned about their health should seek medical advice.\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/westpac-cuts-200-jobs/407a05c6-c951-450e-8d6b-17f8eac16403",
        "title": "Westpac axes 200 teller jobs in digital overhaul",
        "publish_date": "Tue, 23 Sep 2025 22:07:09 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "W﻿estpac is cutting 200 teller jobs across its branches as it pushes customers to using digital services.\n\nThe bank says it will move the teller positions to home and business lending, where Westpac plans to take on 200 bankers.\n\nThe job cuts were driven by increasing numbers of Westpac ﻿customers using its app, website and ATMs, the bank said.\n\nWestpac bank is shedding 200 teller jobs. (iStock)\n\n\"This year we've invested in our digital-first strategy to support our customers' changing needs and our digital citizens focus,\" Westpac's general manager of retail banking, Damien MacRae, said in an email to staff.\n\nThe plan will be supported by a $200 million investment over the next three years in ATMs and branches.\n\nStaff will be trained to help customers use the app for advanced tasks as it becomes upgraded.\n\nA Westpac spokesperson said the bank needed to alter the make-up of its workforce to reflect its investment goals.\n\n\"While we continue to invest in extra bankers, other areas may need fewer resources,\" they said.\n\nWestpac says more customers are using digital services and ATMs. ( AFR photo Louie Douvis) (Nine)\n\n\"We try to keep as many employees in the Westpac Group as we can, through retraining and redeployment.\"﻿\n\nThe Finance Sector Union said the loss of the 200 teller jobs will remove critical services for customers.\n\nThe digital drive meant staff were being encouraged to make their own jobs redundant by reducing the need for face-to-face banking.﻿\n\n\"Communities still rely on face-to-face banking and workers should not be sacrificed for cost-cutting dressed up as innovation,\" said FSU national secretary Julia Angrisano.\n\nThe announcement comes amid reports Westpac is carrying out a major restructure that will see up to 1500 jobs go.\n\nEarlier this month, ANZ announced it was cutting 3500 full-time roles and 1000 contractor jobs, while NAB shed 410 jobs and moved 127 more overseas.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/jimmy-kimmel-norman-lear-post-on-instagram-first-time-since-cancellation/17bf4520-6099-45d2-a5b6-434c5cc8e7e9",
        "title": "Jimmy Kimmel's cryptic social media post ahead of show return",
        "publish_date": "Tue, 23 Sep 2025 20:28:40 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "U﻿S television host Jimmy Kimmel has taken to social media for the first time since his television show was pulled off the air, posting a cryptic photo.\n\nKimmel﻿'s show Jimmy Kimmel Live! was pre-empted by Disney-owned ABC last week after the late-night host criticised the MAGA movement's reaction to conservative activist Charlie Kirk's death, and claimed they were trying to score political points.\n\nDespite praise for the decision from US President Donald Trump and others in the MAGA movement, Disney and ABC copped a barrage of backlash from critics and subscribers, and have now relented, with Kimmel to return to the airwaves tonight US time.\n\nIn the lead-up, and posting for the first time since his controversial monologue, Kimmel took to Instagram with a picture of himself and screenwriter Norman Lear.\n\n\"Missing this guy today,\" Kimmel wrote.\n\nLear﻿, who created and produced numerous classic US sitcoms including All In The Family, Sanford and Son, and The Jeffersons, was also a prominent liberal activist and thorn in the side of then-president Ronald Reagan.\n\nKimmel's show is returning to TV tonight US time. (Richard Shotwell/Invision/AP)\n\nLear founded the organisation People for the American Way, a group which sought to counter the rise of the Christian right wing that helped propel Reagan to power.\n\nIn his later years, Lear, who died in 2023 aged 101, was a vehement critic of Trump, saying in one speech in 2016 that if Trump threatened the First Amendment, it would be time to \"hunker down and fight\".﻿\n\nSinclair and Nexstar Media Group, which together own about one in five ABC affiliates nationwide, both said they would continue pre-empting Kimmel's show in a controversy that's gone beyond late-night talk shows into questions of free speech and the First Amendment.\n\nCharlie Kirk speaks before he is shot during Turning Point's visit to Utah Valley University in Orem, Utah. (AP)\n\nSinclair, one of the country's biggest owners of local TV stations, said its ABC affiliates will preempt the show \"beginning Tuesday night.\" Sinclair said it will air news programming in the time slot instead.\n\n\"Discussions with ABC are ongoing as we evaluate the show's potential return,\" a Sinclair spokesperson told CNN.\n\nAnd Nexstar said its ABC affiliates will also continue to preempt Kimmel's show.\n\n\"We made a decision last week to preempt 'Jimmy Kimmel Live!' following what ABC referred to as Mr Kimmel's 'ill-timed and insensitive' comments at a critical time in our national discourse,\" the company said in a statement on Tuesday morning.\n\nTyler Robinson is (AP)\n\n\"We stand by that decision pending assurance that all parties are committed to fostering an environment of respectful, constructive dialogue in the markets we serve.\"\n\nBrendan Carr, Trump's close ally atop the Federal Communications Commission, cheered the affiliate owners' preemption of the resumed show in a social media post Tuesday. Carr wrote that \"local TV stations – for the first time in years – stood up to a national programmer & chose to exercise their lawful right to preempt programming.\"\n\nTuesday night's guests of Jimmy Kimmel Live! will be actor Glen Powell, with musical guest Sarah McLachlan. The show will feature Ethan Hawke, Lisa Ann Walter and musical guest Yungblud on Wednesday, and Peyton Manning, Oscar Nuñez and musical guest Alex G on Thursday.\n\nBoth Powell and MacLachlan are promoting Disney-owned projects: Powell for Hulu's upcoming sports comedy series Chad Powers , and MacLachlan is behind the Hulu documentary Lilith Fair: Building a Mystery , which follows the '90s-era female-focused music festival founded by MacLachlan.\n\nThis past weekend, while Kimmel's show was off air, MacLachlan refused to perform at the documentary's premiere, stating that she was taking a stand in support of free speech.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/women-construction-workers-face-big-obstacles-report-says/18f3bb29-97ef-43e4-bb2f-312ccda367be",
        "title": "Call for improved parental leave to keep women construction workers",
        "publish_date": "Tue, 23 Sep 2025 19:49:21 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "More women are being encouraged to become construction workers a﻿mid the housing shortage in Australia, but they face major hurdles in a male-dominated industry.\n\nThat is the conclusion of a new report by the University of Sydney, commissioned by the National Association of Women in Construction.\n\nWomen make up only 13 per cent of the residential building industry workforce, but the federal government is pushing for thousands more to join to help close a skills shortfall.\n\nWomen make up only 13 per cent of construction workers and face big hurdles, a new report says. (AAP)\n\nBut the research, partly based on the experiences of women working in the industry, says the construction sector is lagging behind others in recruiting and retaining women.\n\nA \"career-breaking\" challenge facing female building workers is parental leave, with some even putting off having children to fit around the job.\n\nSeveral women interviewed said they had waited until they had been promoted to a particular level, or been with the company for several years, before trying to become pregnant.\n\nThe study's co-author Natalie Galea says the industry's strong health and safety culture doesn't extend to pregnant workers.\n\n\"Many of the women we spoke to were the first in their workplace to take parental leave and received little support from managers who lacked knowledge and experience,\" she said.\n\nA \"career-breaking\" challenge facing female building workers is parental leave, with some even putting off having children to fit around the job. (Getty)\n\n\"In fact, they reported serious issues including forced disclosures, withheld promotions, demotions and redundancies.\n\n\"Even in supportive workplaces, there are widespread issues including inadequate health and safety policies, lack of basic amenities, such as women's toilets and lactation rooms, and lack of clear and transparent parental leave policies.\"\n\nThe report's authors are urging the NSW government to consider an industry levy to fund parental leave, especially for small businesses and sole traders, to help tackle the problem. ﻿\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australias-10-most-culturally-powerful-people-in-2025-afr-magazines-full-list-in-pictures/3332e536-a5de-422c-a5c3-0cfe4d4de5e8",
        "title": "The 10 most culturally powerful people in Australia in 2025",
        "publish_date": "Tue, 23 Sep 2025 11:31:22 +0000",
        "category": "sports",
        "authors": [
            "Sep"
        ],
        "text": "Popular cook Nagi Maehashi's RecipeTin Eats books have been a constant companion for hundreds of thousands of time-poor and conscious Australians this year.\n\nNow the author's influence ﻿will be recognised in The Australian Financial Review Magazine 's upcoming Power issue.\n\nMaehashi has been named the most culturally powerful person in Australia for 2025.\n\n﻿The list ranks the movers and shakers of Australian society and their ability to shape the nation's view of itself.\n\nScroll through to see who made the list for 2025.\n\n10. Gout Gout\n\nAt the age of 17, sprinter Gout Gout has already been described as a generational talent.\n\nHailing from a South Sudanese family who migrated to Ipswich, he has emerged as a poster child for the migrant community.\n\nAustralians have rallied around the teenager, who went on to break the Oceania 200m record and reach the semi-finals at the World Athletics Championships in Tokyo.\n\n10. At the age of 17, sprinter Gout Gout has already been described as a generational talent. Hailing from a South Sudanese family who migrated to Ipswich, he has emerged as a posterchild for the migrant community. Australians have rallied around the teenager, who went on to break the Oceania 200-metre record. (Getty)\n\n9. Peter V'landys\n\nAs the head of two of the biggest sports in NSW, Peter V'landys has made the cultural power list for a second consecutive year.\n\nThe Rugby League Commission boss has lobbied for $600 million to add a Papua New Guinea team to the competition.\n\nHe has also made strides to attract millennials to racing with The Everest race in his role as head of Racing NSW.\n\n(Paul Kane/Getty Images)\n\n8. Dom Dolla\n\nMusic producer and DJ Dom Dolla has made waves in the international music scene.\n\nBack in July, the artist pulled what organisers of Lollapalooza told him was the biggest crowd ever to a single stage at the US festival.\n\nIn December the DJ will play to a sold out 40,000-strong crowd at Sydney's Allianz Stadium.\n\n(Getty)\n\n7. Jo Horgan\n\nJo Horgan opened her first Mecca store on Toorak Road in Melbourne in 1997.\n\nThe business has since become a powerhouse in the retail sector, employing more than 7400 people.\n\nThis year Horgon opened up a 4000-square-metre mega store in Melbourne's Bourke Street Mall.\n\n6. Jo Horgan opened her first Mecca store on Toorak Road in Melbourne in 1997. The business has since become a powerhouse in the retail sector. This year Horgon opened up a 4000-square-metre mega store in Melbourne's Bourke Street Mall which employs more than 7400 people. (Nicole Reed)\n\n6. Kip Williams\n\nAt the age of 30, Kip Williams is the youngest artistic director in the history of the Sydney Threate company.\n\nHis work both at the theatre company and on the smash hit The Picture of Dorian Gra y has earned praise and attracted new audiences.\n\n5. At the age of 30, Kip Williams is the youngest artistic director in the history of the Sydney Threate company. His work on the both theatre company and the smash hit The Picture of Dorian Gray has earned praise and attracted new audiences. (Mark C. O'Flaherty)\n\n5. Khaled Sabsabi and Michael Dagostino\n\nArtists Khaled Sabsabi and Michael Dagostino were selected by Creative Australia earlier this year to represent Australia at 2026's Venice Biennale.\n\nTheir invitation was revoked when some of Sabsabi's earlier work, which referenced terrorism, was raised in federal parliament.\n\nAfter calls from more than 4000 people, their invitation was reinstated.\n\nThe saga raised conversations about art's role in provoking conversation.\n\n(Steven Siewert)\n\n4. Nicole Kidman\n\nAustralian actor and producer Nicole Kidman is a force to be reckoned with in Hollywood.\n\nBack in 2017, Kidman vowed to work with a female writer or director every 18 months through her production company Blossom films.\n\nShe has since worked with 28 talented women on a range of projects including the critically acclaimed film Babygirl .\n\n(Getty)\n\n3. Inman Grant\n\nIt is safe to say 2025 has been a big year for Australia's eSafety Commissioner, Inman Grant.\n\nGrant is championing a world-first ban on social media for children under 16, with new laws due to come into force on December 10.\n\n(Alex Ellinghausen)\n\n2. Oscar Piastri\n\nWith nine Formula 1 Grand Prix wins under his belt, the world is Oscar Piastri's oyster.\n\nThe racing driver's skill and success has helped boost the sport's popularity in Australia following beloved Aussie Daniel Ricciardo's retirement.\n\n(Getty)\n\n1. Nagi Maehashi\n\nPopular cook Nagi Maehashi has inspired Australians to save money and time in the kitchen with her RecipeTin Eats website and books.\n\nHer recipes have been viewed 30 million times a month online and her 2022 cookbook sold more than 500,000 copies.\n\n(Louise Kennerley)",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/paracetamol-australia-tylenol-uses-everything-to-know-explainer/87b991f1-c4d2-41cb-9793-8d81963040f5",
        "title": "Trump just blamed autism on paracetamol. Here's the official advice for Aussies",
        "publish_date": "Tue, 23 Sep 2025 01:20:13 +0000",
        "category": "lifestyle",
        "authors": [
            "Sep"
        ],
        "text": "US President Donald Trump has suggested that the use of a common painkiller during pregnancy \"can be associated with a very increased risk of autism\".\n\nTrump said that women should not take acetaminophen, known by the brand name Tylenol in the US or as paracetemol in Australia, \"during the entire pregnancy\".\n\nHe claimed that he and Health and Human Services Secretary Robert F. Kennedy Jr understood ﻿\"a lot more than a lot of people who studied\" autism.\n\nUS President Donald Trump and Health and Human Services Secretary Robert F. Kennedy Jr have blamed autism on paracetamol. (AP Photo/Mark Schiefelbein)\n\nHere in Australia the Therapeutic ﻿Goods Administration (TGA), which regulates the safety of medicines, said there are no \"current active safety investigations\" into any links between paracetamol and autism.\n\nNor have any changes been made to the rules or advice around paracetamol use in Australia in response to Trump's claims.\n\n\"Paracetamol remains Pregnancy Category A in Australia, meaning that it is considered safe for use in pregnancy,\" a spokesperson for the TGA told 9news.com.au.\n\n\"The TGA has no current active safety investigations for paracetamol and autism, or paracetamol and neurodevelopmental disorders more broadly.\"\n\nThey explained that the use of any medication during pregnancy is ﻿subject to strict clinical, scientific and toxicological testing to ensure its safety when being registered in Australia.\n\nNo changes have been made to TGA guidelines around paracetamol in response to Trump's claims. (AP Photo/Mark Schiefelbein)\n\n\"The TGA maintains robust post-market safety surveillance and pharmacovigilance processes for all medicines registered in Australia, including paracetamol,\" the spokesperson said.\n\n\"This includes detailed analysis of adverse event reports made by medicine consumers, clinicians and pharmaceutical companies, review of published medical literature, and close liaison with international medicines regulators.﻿\"\n\nWhen safety concerns are raised about a medication, ﻿they are subject to detailed clinical and scientific investigation to confirm the concerns are legitimate.\n\n﻿If a safety issue does exist, the TGA will take appropriate regulatory actions to mitigate the risk.\n\nAussies concerned about ﻿paracetamol use during pregnancy are encouraged to consult their treating healthcare professionals for \"clinical advice tailored to their specific circumstances\".\n\n\"Paracetamol remains Pregnancy Category A in Australia, meaning that it is considered safe for use in pregnancy.\" (Getty)\n\nThe current TGA guidelines for paracetamol use recommend adults and children 12 years or older take 500 to 1000mg every four to six hours as necessary.\n\nThe maximum adult dose is ﻿4000mg in any 24-hour period.\n\nThe optimal dose for younger children ﻿15 mg per kg, which can be given every four to six hours as required.\n\nChildren should have no more than four doses in 24 hours.\n\nParacetamol should always be used in accordance with the directions on the label and individuals should not take more than one medication containing paracetamol at the same time.\n\nOverdosing on paracetamol can cause liver damage and, in severe cases, death.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/golf-course-redevelopments-providing-housing-financial-lifelines/105799100",
        "title": "Golf course redevelopments providing housing and financial lifelines",
        "publish_date": "Wed, 24 Sep 2025 01:38:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "At the Yowani Country Club in Canberra's inner north, the thwack of golf clubs hitting balls will soon be muffled by the rumble of excavators.\n\nThe site is being redeveloped for between 800 and 1,000 dwellings — including retirement living — as well as commercial spaces, a hotel and a new clubhouse to sit alongside the club's golf course.\n\nThe ACT government has committed to developing 30,000 new homes by 2030, and acknowledges greater urban density is needed to get there.\n\nAnd redevelopments like the one at Yowani, on the northern end of Northbourne Avenue in Lyneham, will go some way towards reaching that goal.\n\nAce Popovich, senior development manager at TP Dynamics — the builders behind the project — said it was the culmination of a long process involving a lot of red tape.\n\nAce Popovich of TP Dynamics says the Yowani Country Club redevelopment will put the club on a firm financial footing. (ABC News: Stuart Carnegie)\n\n\"It took about five years in master planning and approvals and getting the site re-zoned,\" Mr Popovich said.\n\n\"The clubhouse should be finished probably within about six months, and the golf course should be completed by then as well.\"\n\nMr Popovich said the desire to keep the course functioning added additional complexities — but ultimately, it would put the club on a firm financial footing.\n\n\"At the end of the day, the golf club has been struggling for a while,\" Mr Popovich said.\n\n\"So we're giving them some new amenities and hopefully that's going to sustain it in the future.\n\n\" We're both heading towards a sustainable development, both for the club's future and also this community development. \"\n\nThe Yowani Country Club runs through Lyneham. (ABC News: Andrew Kennedy)\n\nCourses costly to maintain\n\nContributing to the financial viability of golf clubs, is that courses can be expensive to upkeep.\n\nThe Federal Golf Club, for example, has an 85 hectare lease adjacent to the Red Hill Nature Reserve in Canberra's south.\n\nIt's a habitat for kangaroos and bird species including the endangered gang-gang cockatoo and superb parrot — but the site has no natural water source and the club relies on storage ponds and mains water to irrigate the course.\n\nClub president Regina Neary argued the cost of water — particularly in years of drought — had left its budget in dire straits.\n\n\"There was one year that the amount that was spent on buying potable water was $400,000,\" Ms Neary said.\n\nFederal Golf Club president Regina Neary says the cost of water has caused financial woes for the club. (Supplied: Federal Golf Club)\n\n\"Not only was that financially crippling for the club but from an environmental perspective, buying potable water is not particularly environmentally friendly either.\n\n\"We have got two small dams here, but they are not sufficient to actually green the area and keep the club alive.\n\n\" During that point in time, the club actually lost a lot of members because it was not as pleasant and green. \"\n\nMs Neary said the course's watering system also needed to be replaced — a project she estimated could cost more than $2.2 million.\n\nIn 2016, the club looked to development as a solution to its financial woes.\n\nIt's partnered with retirement community operator MBark to build and run a 125 residence retirement village in a corner of its land; modify the course to maintain 18 holes; increase water storage; and improve maintenance and clubhouse facilities.\n\n\"So the size that we're talking about is actually a parcel of land of approximately 7 hectares out of 85 hectares — so it is a small parcel of land that we're actually considering,\" Ms Neary said.\n\n\"It has been heavily endorsed by ACT government through their Red Hill Integrated Plan.\n\n\"The concerns that we have — if our irrigation system, for example, was to breakdown to a catastrophic level — then that absolutely puts the club financially into a tumultuous position.\"\n\nA 125 residence retirement village is proposed in the corner of the Federal Golf Club's land. (ABC News: Callum Flinn)\n\nNot all members agree\n\nJust as pressure for the Federal Golf Club to develop its land stems from its own operational costs, so too does the most determined opposition to its plans.\n\nThe ACT Civil and Administrative Tribunal (ACAT) halted construction of the retirement village in April this year, after advocacy group Friends of Federal Fairways raised concerns the development application hadn't been properly authorised.\n\nThe tribunal also highlighted conflicting evidence about development's potential environmental impacts, noting \"had it been necessary for the tribunal to decide this matter, it would have remitted the Development Application to the Planning and Land Authority with a direction to seek further advice from the conservator\".\n\nAfter an appeal by the club and MBark, the ACT Supreme Court set aside the ACAT decision earlier this month.\n\nThe case is expected to again be considered by the tribunal in the coming months.\n\nRoss McLeod is among club members who worry the development will interrupt a suburban oasis for golfers and wildlife alike.\n\nMember Ross McLeod says he's worried the Federal Golf Club redevelopment will see it deteriorate in quality as parts of the course are sold. (ABC News: Callum Flinn)\n\n\"I think it's a great course and one of the nicest parts about it is that it's right in the middle of Canberra and yet you don't really realise you're right in the middle of Canberra,\" Dr McLeod said.\n\n\"A much earlier generation of golfers in Canberra worked to establish this course, through their own sweat — they literally built the thing themselves — and they left that as a legacy for we who came along later.\n\n\" So I think we have a responsibility to maintain that and improve it if possible — not to sell off bits of it and really make it deteriorate in quality. \"\n\nDr McLeod argued other investments by the club, including its hospitality business, were the reason for its financial woes and could be restructured to stabilise the budget.\n\nHe also took umbrage with the idea of development on publicly owned land creating a financial gain for the club.\n\n\"I don't deny that we need to find some more land for additional residential development, but to me the sensible thing to do is to look for some land which is available but not being used for anything much at the moment,\" Dr McLeod said.\n\nGolf Australia's general manager said \"without question,\" golf courses play an important role in our urban areas. (ABC News: Jed Cooper)\n\nMs Neary insisted those opposed to the development were a minority, and she thought the development plans would stand up to deeper scrutiny of its environmental impacts.\n\n\"We have the support of the membership, and I think if we consider how the more recent board election was voted in, that was really an overwhelming support for the development,\" she said,\n\n\"And prior to that, the membership had a positive vote for enabling the board to go into a business arrangement and sign commercial documents with our business partners.\"\n\nPlanning consideration\n\nCanberra isn't the only city where governments are casting about for land to meet the needs of a growing population.\n\nIn Sydney, the New South Wales government has pledged to spend $50 million to convert half of Moore Park Golf Course into a public park, to provide green space for nearby apartment dwellers.\n\nThe state government also plans to convert Carnarvon Golf Course into a cemetery.\n\nACT chief planner George Cilliers said the Territory government currently held no such plans for golf courses in Canberra.\n\nThe Yowani Country Club sits in Lyneham. (Facebook: Yowani Country Club)\n\n\"Canberra golf courses are a vital part of the blue-green network, part of the open space network,\" Mr Cilliers said.\n\n\"That's captured within the planning strategy, that's captured within our district strategies — they're carefully planned.\n\n\"We just don't have that sort of pressure yet or those sorts of applications yet.\"\n\nMr Cilliers said a number of development applications for golf course redevelopments were currently on-foot, and he expected there would be more in the future.\n\n\"I think we will foresee some applications for densification or repurposing of parts of golf courses,\" he said.\n\nACT Chief Planner George Cilliers says there are currently a number of applications for golf course redevelopments, and he expects more to come. (ABC News: Callum Flinn)\n\nA growing game\n\nWhile there's demand for land to house a growing population, Golf Australia's general manager of clubs and facilities Damien de Bohun said the number of people seeking a fairway to play on was also on the rise.\n\n\"There's more than 4 million adult Australians playing golf now, which has grown by 50 per cent over the last three years,\" Mr de Bohun said.\n\n\"What we're seeing is there are a number of new golf courses coming and being built, but there's also a whole lot of new ways that people are engaging with golf, like indoor simulators, technology enabled driving ranges, right through to mini golf venues — so there's a lot more golf venues.\"\n\nMr de Bohun said there was no doubt some clubs were struggling but he expected some of the growth in demand for places to play would help offset rising costs.\n\n\"We do see a whole lot of conversations around the country about what golf course land could be used for,\" he said.\n\nDamien de Bohun of Golf Australia says there's no doubt some clubs are struggling, but he thinks the growth in demand will help offset rising costs. (AAP: Dan Peled)\n\nA University of Melbourne study of biodiversity of green spaces in the Victorian capital's south-eastern suburbs found golf courses contained the greatest diversity and abundance of beetles, bees, birds and bats.\n\n\"All the evidence points towards that golf courses are in fact more effective in areas like biodiversity and also rain catchment than in fact just general parks are,\" Mr de Bohun said.\n\n\"So there's a really important role for golf courses going forward in our urban areas without question.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/wallabies-andrew-kellaway-ruled-out-bledisloe-cup-all-blacks/105810670",
        "title": "Wallabies lose another fullback ahead of Bledisloe showdown",
        "publish_date": "Wed, 24 Sep 2025 01:38:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "Wallabies fullback Andrew Kellaway will miss Saturday's Bledisloe Cup Test match against the All Blacks in Auckland, ruled out with a calf strain.\n\nKellaway is the second Wallaby ruled out with a calf strain for the Test, round five of the Rugby Championship, after forward Rob Valetini was ruled out last weekend.\n\nHe is also the second starting fullback to be ruled out during the Rugby Championship after Tom Wright suffered an ACL injury during the Wallabies' second match against South Africa.\n\nKellaway started the two Tests at fullback since Wright's injury, a win and a loss against Argentina, after starting the international campaign coming off the bench.\n\nThe Wallabies team will be named on Thursday, and despite losing his first and second-choice fullbacks, coach Joe Schmidt still has options.\n\nWestern Force outside back Harry Potter has played five Tests since debuting for the Wallabies last November against Scotland.\n\nPotter started three Tests for the Wallabies in 2025, but injured his hamstring during the second Test against the Lions at the MCG.\n\nSchmidt could also elect to go with 21-year-old rising star Max Jorgensen.\n\nThe NSW Waratahs outside back has made an impact in his 15 matches for the Wallabies, debuting against the Springboks in August 2024.\n\nMax Jorgensen has made an impressive start to his international career, with crucial tries in his 15 Test caps. (AP Photo: Rick Rycroft)\n\nJorgensen announced himself on the world stage with an 83rd-minute match-winner against England at Twickenham, and two tries during the Lions series.\n\nSpeaking to media on Tuesday ahead of what potentially could be his first Bledisloe Cup match, Jorgensen said playing against the All Blacks would be a major milestone in his career.\n\n\"It's such a big game. Every game counts, and if given the opportunity this week at the play-in, it would be a dream come true,\" Jorgensen said.\n\n\"Yeah, it's definitely a challenge, but it's an exciting one.\n\n\"I think for our group, coming back off a couple of games as a team to get the opportunity to play at Eden Park against a team like the All Blacks, it's always cool.\n\n\"They're a world-class team, they've always been good and always will be.\"\n\nAustralia has not held the Bledisloe Cup since losing the trophy to the All Blacks in 2003.\n\nThe Wallabies have not won at Eden Park since 1986, while the All Blacks have not been defeated at the venue since 1994.\n\nBut the Wallabies come into Saturday afternoon's Test with plenty of confidence.\n\nSince defeating the British and Irish Lions in the third Test in Sydney, the Wallabies broke a 62-year hoodoo at Ellis Park in Johannesburg with a famous win over the Springboks and a come-from-behind win over Argentina in Townsville.\n\nThe Wallabies are coming off a loss in their second Test against Argentina, coming from 21 points behind in the second half to narrowly lose 28-26 in Sydney.\n\nWith history not on the Wallabies' side, Jorgensen said each member of the Wallabies team was well aware of the challenge that awaits them on Saturday.\n\n\"It's pretty known within the group, and it really gives us a good opportunity this weekend to go out and win it back,\" he said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It's always been a massive rivalry, the Bledisloe Cup. Watch it growing up, [I] always dreamt of playing in something like the Bledisloe Cup, and if given the opportunity, it would be awesome.\"\n\nThe All Blacks are coming off a loss, hammered by the Springboks 43-10 in Wellington.\n\nAustralia is on top of the Rugby Championship standings with 11 points, followed by South Africa and New Zealand on 10, and Argentina on 9.\n\nThe Wallabies and All Blacks face each other home and away to end the championship.\n\nThe Springboks and Pumas will also play each other home and away in the final two rounds.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/sandy-brondello-axed-by-wnba-side-new-york-liberty/105810534",
        "title": "Opals coach axed by WNBA team less than year after winning championship",
        "publish_date": "Wed, 24 Sep 2025 01:17:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "Opals coach Sandy Brondello has been let go by the New York Liberty after a disappointing first-round exit from the WNBA play-offs.\n\nThe Liberty opted against renewing Brondello's contract, less than a year after the Australian guided the team to its first league championship.\n\nBrondello, also coach of the Australian women's national team, boasts a 107-53 record in her four seasons with the Liberty, giving her the most wins in franchise history.\n\nLoading...\n\nBut the Liberty struggled with injuries to stars Breanna Stewart, Jonquel Jones and Sabrina Ionescu in this year's title defence, placing Brondello's job in jeopardy.\n\nNew York made the call to part ways with the 57-year-old following the game three loss to Phoenix Mercury last week, having earned the No.5 seed in the play-offs.\n\nBrondello, who will coach the Opals at the 2028 Los Angeles Olympics, had guided the Liberty to a franchise-best start of nine consecutive victories before injuries took their toll.\n\n\"It has been a privilege to have coached the NY Liberty these last four years,\" Brondello said to The Associated Press in a text message.\n\n\"Bringing the first-ever championship to New York will always be the most amazing feeling.\n\n\"I wish the team and organization (sic) more success moving forward.\"\n\nBrondello had her players' support after the team lost in the play-offs last week.\n\n\"To anybody that kind of questions Sandy being here, this is a resilient group,\" Stewart said after the loss to Phoenix.\n\nHeartbreak for Smith in WNBA Photo shows Alanna Smith in tears during game five of the WNBA Finals Opals coach Sandy Brondello leads the New York Liberty to its first WNBA championship at the expense of fellow Australian Alanna Smith and the Minnesota Lynx.\n\n\"And she has our back, and we have hers.\n\n\"The way that she continued to kind of deal with the cards she was dealt was incredible.\"\n\nBrondello becomes a top target for other head coaching vacancies throughout the league.\n\nSeattle has parted ways with Noelle Quinn, while Portland and Toronto haven't yet named a coach.\n\nBefore coming to New York, Brondello led the Phoenix Mercury to a championship in her eight seasons with that team.\n\nShe was hired before the 2022 season by the Liberty after she helped the Mercury reach the WNBA Finals in 2021.\n\nNew York lost in the finals to Las Vegas in 2023, before winning the championship last year in a decisive Game 5 overtime victory over Minnesota.\n\nOn the international stage, Brondello — who has been Opals coach since 2017 — steered Australia to bronze at the 2024 Paris Games.\n\nIt was the first time the Opals had returned to the Olympic podium in 12 years.\n\nThe LA Games will represent a remarkable seventh Olympics for Brondello, who played in four (1988, 1996, 2000, 2004) and will coached in Tokyo and Paris.\n\nAAP/AP\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/sa-childcare-temporary-closure/105810184",
        "title": "Childcare centre temporarily shut amid claims children were left unsupervised",
        "publish_date": "Wed, 24 Sep 2025 01:13:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "A childcare centre in Adelaide's inner south-west has been ordered to close for two weeks after being handed an emergency action notice following claims children were left unsupervised.\n\nEdge Early Learning, in Plympton, sent a letter to parents on Tuesday evening which said it would be closing temporarily following the issue of the notice, but assured caregivers that \"no child has been harmed\".\n\n\"The Education Standards Board (ESB) has this evening issued an Emergency Action Notice ordering Plympton to temporarily close for a two-week period from Wednesday 24 September until Tuesday 7 October 2025,\" CEO Annie Bryce wrote in the letter.\n\n\"The ESB's concerns relate to a supervision matter where a teacher on placement was left alone with two children.\n\n\" The placement teacher left the two children unsupervised in the classroom for approximately two minutes while she sought guidance. \"\n\nMs Bryce said the incident had not been reported internally \"as per our policy\" which resulted \"in a failure to notify the ESB\".\n\n\"We take the ESB's concerns extremely seriously. Whilst this direction does not reflect the dedication and care of our Plympton educators, it is an important opportunity to strengthen our systems and reinforce our reporting culture,\" she wrote.\n\nSecond closure in term three\n\nKrystil, said she and her partner were teachers.\n\nShe said while she supported \"regulators doing their job and protecting the care of children\" it was the second time in term three that they had experienced a closure.\n\n\"Both our children and students need stability,\" she said.\n\n\"If I could start my son in government kindergarten with OSHC I would, the corporatisation of early childhood education is not in the best interest of our young people.\"\n\nEdge Early Learning Centre provides care for children aged between six weeks and school age. (ABC News: Kyle Harley)\n\nEducation Minister Blair Boyer told ABC Radio Adelaide on Wednesday that the centre, which is one of 24 run by Edge Early Learning in South Australia, had been brought to the attention of the board prior to this incident.\n\n\"They have had issues around supervision of children and the regulator has been out there a couple of times in August and September and haven't been satisfied they've been rectified,\" he said.\n\n\"Poor supervision of children … has been identified on more than one occasion.\"\n\nMinister wants to 'send message' to sector\n\nMr Boyer said he believed \"about 60 families\" had children at the centre and said it would \"really inconvenience\" them.\n\n\"As Minister though I'm not going to agree to a situation where we are putting the convenience of families above the safety of their children,\" he said.\n\n\"It's about sending a message to the entire sector.\n\n\"If you aren't doing the right thing, we're going to take action.\"\n\nSophie, the mother of a 14-month-old who was enrolled in the centre, told ABC Radio Adelaide her son \"won't be going back\".\n\n\"It's really disappointing,\" she said.\n\nEdge Early Learning Centre, has offered families temporary placements at three of its other centres.\n\nIt has been contacted by ABC News for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/panthers-broncos-nrl-preliminary-final-grand-final-cleary/105809026",
        "title": "Ahead of Broncos-Panthers, the legacy of the 2023 grand final still endures",
        "publish_date": "Wed, 24 Sep 2025 00:14:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "It takes a lot to distract a Panther this time of year, even for a second, days out from the rapidly approaching preliminary final.\n\nPenrith have a belief in process that borders on worship and ahead of Sunday's clash with Brisbane, a task can be as big as a training session or as small as an interview and they'll still look to do it well.\n\nBut Moses Leota, their hardman prop, is looking over someone's shoulder.\n\nWe are out the front of the Panthers Rugby League Academy and there is a television in the foyer. It's running a loop of highlights from the club's four-straight premiership titles.\n\nPenrith remind Canterbury there can be only one Photo shows A man celebrates after scoring a try Canterbury is a team built in Penrith's image, but the Panthers served Canterbury a stark reminder that there can be only one.\n\nLeota's played in all four and did a damn fine job in each. Like everyone who's lasted at Penrith, his ability to focus on whatever is in front of him at the expense of everything else is one of his greatest strengths.\n\nBut there is a second when his mind goes to other things. He seems to be looking past the tinted glass doors just as the business end of the 2023 grand final starts heating up.\n\n\"Ah, yeah, maybe I was watching a little,\" Leota said.\n\n\"I saw my try, so I was smirking a bit.\"\n\nThat 26-24 victory, where Penrith came back from 24-8 down with 18 minutes left, is perhaps the only thing that could get a Panther feeling a little nostalgic this time of year.\n\nThey're only human, even if they don't always seem it, and even if there's still work to be done right now, that night two years ago is a memory worth basking in.\n\nIt was not their first premiership together nor their last. It did not avenge the defeat that created them nor give them eternal bragging rights over their fiercest local rivals.\n\nThat year's top 17 was not the best team of the dynasty and the game itself was not their most complete performance.\n\nBut it was Penrith's greatest win and finest hour, the biggest comeback in grand final history and the truest expression of everything that has led to all the glory and the trophies and the winning.\n\nIt started with Leota's try and ended with Nathan Cleary's premiership score in the 78th minute. Most of that night is a blur for Leota, but the memory of what happened after his four-pointer stands out.\n\n\"It was all positive, thinking about the process. We were still two tries down and had a lot of work to do, so there was no celebrating,\" Leota said.\n\n\"It was back to the process. The rest of it is a bit of a blur. I just remember after the game celebrating with anyone and everyone.\"\n\nWhenever all this ends — and after their win over Canterbury last weekend, it's fair to ask if it ever will — the 2023 grand final will be the first game that comes up whenever someone makes the case that these Panthers are the greatest team of all time.\n\nIt's the kind of match that will bring an extra weight to every Panthers-Broncos finals match for many years to come and it looms over Sunday like an approaching storm cloud, darkening the sky and heralding thunder.\n\nEleven Panthers players will be backing up for the rematch versus nine returning Broncos and watching a replay of the game now, less than two years after the fact, is an easy finals footy gift to give to yourself, assuming you're not of a maroon and gold persuasion.\n\nIn one of the best games of the NRL era, Leota stands out as an unsung hero, not just with the try that got the fightback started, but with the same punishing carries he always seems to find when things matter most.\n\nNathan Cleary is just as remarkable as you remember with his three try assists, a 40/20 and the match-winning score in the 78th minute. The departed Jack Cogger rides shotgun and Stephen Crichton shows the full breadth of his skill and class with a try and two forced dropouts.\n\nPanthers hooker Mitch Kenny is not known for his attacking craft, but he finds just enough of it in the lead up to Cleary's try, faking to go open before hitting his halfback down the blind and forcing an overchase from Brisbane's Jordan Riki as he comes back across to cover.\n\nThe Panthers and Broncos are widely acknowledged to have played one of the greatest grand finals of all time in 2023. (AAP: Mark Evans)\n\nWatch it enough times when you already know the end of the story and new moments, great and small, reveal themselves.\n\nWith 10 minutes to go and Brisbane's lead cut down to four, Reece Walsh rounds a cluster of defenders and bursts into space. Ezra Mam is on his left in support, but can't be positioned for what would have been his fourth try of the night.\n\nAt the end of that set, Adam Reynolds does not put a kick in but instead hits Brendan Piakura with a crash ball on the last for a turnover on Penrith's 20. From there until full-time, Brisbane only had possession for 10 more tackles.\n\nDown the stretch, Brisbane became desperate and conservative. The freewheeling football that built their lead in the first place vanished well before the lead itself.\n\nWalsh grabs the Sun to light up Brisbane's season Photo shows A man celebrates after winning a rugby league match Brisbane and Canberra went to the great beyond in their golden point finals match and it was Reece Walsh who led the Broncos to the promised land.\n\nIt wasn't a grand final, but it's exactly the same place where the Broncos sent Canberra two weeks ago in their own riotous comeback victory, which delivered them this home preliminary final and set them on the path to potential deliverance.\n\nIn that game, they showed a resilience which has been in short supply since the grand final loss and the 29-28 classic was a sign of what has changed for them in the years since, from the coach on down.\n\nWhile painful memories are not easily banished, it's a different kind of Brisbane team who will take the field at Lang Park as they search for a way to exorcise these demons in front of 52,000 true believers.\n\nThey will have to overcome Pat Carrigan's suspension and Penrith themselves, who seem to have hit that championship form just at the right time, just as they have for four years in a row now.\n\nBilly Walters' ACL injury and Adam Reynolds and Ezra Mam's return from hamstring problems mean the halves situation is unclear, but with Reece Walsh playing the way he is nothing else seems to matter all that much, and through him and Payne Haas, all things feel possible.\n\nThey will attempt to leave 2023 behind, but even if we're through with the past, that doesn't mean it's through with us.\n\nThe Panthers will happily tell you how losing the 2020 grand final to the Storm propelled them to greatness and before that grand final win over the Broncos, the best win of the dynasty was the 2021 preliminary final victory over their one-time conquerors.\n\nIf the Broncos can get up and end the Panthers 14-match finals winning streak, it means Penrith will have, in some way, created something that ends up destroying them just as Melbourne did with them all those years ago.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nBut Penrith has survived such reckonings before. Plenty of challengers have shown up on the season's biggest days running with the steel of vengeance in their hearts due to one former battle or another, only to be struck down without mercy.\n\nTheir dynasty is built on the shattered remains of their challengers and that's a pile so high it'll be a landmark in rugby league history forever.\n\nAnd right at the top, staring down at the world they have created, is the last 20 minutes of that grand final win over Brisbane.\n\nFor the Broncos, that game can be a beacon calling them to vengeance and if they can get it, perhaps some greatness of their own beckons in this year's decider.\n\nIt can be their inspiration, but Penrith gave up needing to be inspired long ago. Their worship of process is enough and 2023 is eternal proof of that concept.\n\nIt's the reason they seem like they can go forever and it's perhaps the only thing that can get them looking back, even for a moment, when there's still so much in front of them.\n\nThere have been many great wins for them over the years and there could still be plenty more to come, but there's only one jewel in their crown of black iron.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/what-the-experts-are-saying-about-paracetamol-use-lead-to-autism/105806230",
        "title": "What experts say is wrong with Trump's claims about paracetamol use in pregnancy",
        "publish_date": "Wed, 24 Sep 2025 00:12:32 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "The Trump administration has issued controversial advice about the possible causes of autism, suggesting the neurodevelopmental condition could be linked to the use of paracetamol in pregnancy.\n\nThe claim has been criticised by medical experts, who say there's no evidence the drug causes the condition.\n\nIn Australia, they're also concerned it will deter expectant mothers from using paracetamol to treat fever or pain, which could prove detrimental to the health of the child.\n\nHere's what they had to say.\n\nAndrew Whitehouse\n\nThe Kids Research Institute Australia\n\nProfessor Whitehouse, who researches autism in children, said that there is categorically no evidence that paracetamol use causes the condition.\n\nLoading...\n\nHe says some studies have suggested a \"small, weak\" association, but they haven't proven a cause or link.\n\n\"At best, this is a misreading of science; at worst, it is a misuse.\"\n\nHe pointed to other studies that suggest there is no connection and is concerned that this will deter use of the drug when it may be necessary.\n\n\"Women don't take paracetamol during pregnancy on a whim,\" he told AM.\n\n\"What we know is that paracetamol is really effective in reducing fever in pregnancy, and also reducing pain. And there are consequences of not reducing fever or pain that can have implications for the health of the mum, as well as the health of the baby.\n\n\"So any kind of research in this area must always look at a balance of what could be the effects of not taking this.\"\n\nDanielle McMullen\n\nPresident of the Australian Medical Association\n\nDr Danielle McMullen says Australian regulators consider paracetamol safe to use during pregnancy. (Supplied)\n\nDr McMullen says paracetamol is considered a category A medicine, which means the TGA and other regulators consider it safe to use in pregnancy.\n\n\"Certainly for pain or fever in pregnancy, the advice is still here that paracetamol in pregnancy is a reasonable and safe option for Australian women to use,\" she said.\n\n\"It's really important that we think about that science and critically analyse it before causing fear in families, and hence, why the medical community today is responding and saying all medicines should be used with caution during pregnancy, but paracetamol has been widely used and is still considered a safe option.\"\n\nNorman Swan\n\nRadio National's Health Report host\n\nDr Swan says the studies that Mr Trump is pointing to are \"messy\" and \"poorly conducted\".\n\n\"When you have looked at the studies, the definition of what is wrong with the children has been loose, you're not quite sure if the woman did take Tylenol, the paracetamol and what they took it for,\" he said.\n\n\"Women are taking it for a reason.\n\n\"What is known is that fever in pregnancy is not good for the unborn child and you want to prevent fever, hence influenza immunisation, hence COVID immunisation.\n\n\"You want to minimise the chances a woman will get infected with a virus.\n\n\"If you do get a fever, paracetamol is what will get rid of it.\"\n\nHannah Kirk\n\nNational Health and Medical Research Council\n\nDr Kirk, a fellow at Monash University, said Mr Trump's announcement had raised concern among expectant parents.\n\n\"Autism is a neurodevelopmental condition with no known single cause; however, research shows that genetics play a large role, with hundreds of genes being linked to autism,\" she said.\n\n\"No study has shown that acetaminophen, the main ingredient in Tylenol, causes autism.\n\n\"Some studies have reported an association between acetaminophen use and autism, while others have not.\n\n\"Importantly, association does not mean causation.\"\n\nScott White\n\nRoyal Australian and New Zealand College of Obstetricians and Gynaecologists (RANZCOG)\n\nThe chair of RANZCOG said robust scientific evidence shows no link between paracetamol use in pregnancy and autism or ADHD, with several large and reliable studies directly contradicting the Trump administration's statement.\n\nHere's why paracetamol is safe to take during pregnancy Photo shows A stack of pills on a table Donald Trump's advice that pregnant women should limit the use of paracetamol in pregnancy has been criticised as \"baseless\". So what does it mean for you?\n\n\"Previous research raised concerns that exposure to paracetamol during pregnancy may increase the chance of the offspring being diagnosed with ASD or ADHD during childhood,\" Professor White wrote in a statement.\n\n\"The earlier studies showed an association between paracetamol exposure and these diagnoses, but were importantly limited by a methodological inability to differentiate between the effect of paracetamol as a causative exposure as opposed to a statistical association.\n\n\"The most recent and robust study to evaluate this association was published in 2024 by Ahlqvist et al.\n\n\"This study of 2.5 million Swedish children found that, when controlling for important factors including parental neurodivergent diagnoses and sibling relationships, there was no association between paracetamol exposure and offspring neurodivergence.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/natisha-dingle-wins-fai-world-cup-speed-skydiving-title/105805486",
        "title": "Australian speed skydiver hangs on to title of fastest woman in the world",
        "publish_date": "Tue, 23 Sep 2025 22:46:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "A chance encounter at a school jobs fair led Natisha Dingle to her passion in life — jumping from a plane and freefalling at nearly 500 kilometres per hour.\n\n\"There's nothing quite like it,\" she said.\n\n\"I've tried other things, but this is what I'm passionate about.\"\n\nThe now 37-year-old has been an avid skydiver since receiving a $25 voucher to try out the sport at the age of 15, and she has not looked back.\n\nDingle has also retained her World's Fastest Female title at the FAI World Cup of Speed Skydiving in Austria, after reaching a top average speed of 497.31kph, setting a new Oceanian record.\n\nLast month, she joined more than 60 competitors at the competition as they attempted to go as fast as possible in freefall, before deploying their parachutes and landing safely.\n\nNatisha Dingle has retained her title as World's Fastest Female speed skydiver. (ABC Southern Qld: Aisling Brennan)\n\nDingle also won gold in the mixed team category, breaking Oceanian and world records with teammate Mervyn O'Connell.\n\nShe ventured into speed skydiving after competing in four-way formation skydiving.\n\n\"It feels like freedom to me,\" Dingle said.\n\n\"You're not thinking about what's happening in your life, you're not thinking about what you're having for dinner. You're thinking about the task at hand.\"\n\nWhat speed skydiving can feel like\n\nDingle said it was difficult to describe the feeling of freefalling at nearly 500kph.\n\n\"The only thing I can put it to that relates to people that don't skydive is, and I don't recommend it but we've all probably done it, putting your hand out of the car window at 100kph and then times that by five,\" she said.\n\nNatisha Dingle has represented Australia in speed skydiving around the world. (Suplied: Mason Corby)\n\n\"As you can imagine, the air's going over your body and you sometimes can wobble a little bit, but the trick is to try not to move very much and just hold your body position and let the wind flow over you.\n\n\" Every time you move, every time you put something into the wind, you're slowing down … so the trick is to not try too hard. \"\n\nBut travelling at such speed requires more than just craving that adrenaline rush.\n\nShe explained the sport was a \"head game\", so time spent on the ground preparing for jumps was just as important as the moments in the air.\n\n\"I meditate and I balance my chakras on the ground before I take off. I really try and focus all of my energy into my energy centre,\" she said.\n\nDingle said sharp focus was vital as there was \"always going to be distractions\".\n\n\" [At the World Cup] there was a whole weather day, so you've got like a whole day to sit on the ground and think about what you've done right, what you've done wrong, what you're going do next,\" she said.\n\n\"I try to really not worry about things that you can't control, and I think that's a really good thing to take into everyday life.\"\n\nNatisha Dingle has been skydiving since she was a teenager. (Supplied: Steve Fitch)\n\nDingle has been doing her jumps for about a decade at Toogoolawah, about 120km west of Brisbane, while also teaching others how to safely skydive.\n\n\"I know at the beginning it can be nerve-wracking, and we get the sensory overload, but I just think being calm and confident leads to successful skydives,\" Dingle said.\n\n\"That's the energy I try and give to my students.\"\n\nShe said it was all about finding and building confidence but warned it could be \"quite addictive\".\n\n\"I don't ever feel bad about spending money on skydiving but if I go to a nice restaurant and the steak's a bit chewy, I'm a bit annoyed,\" she said.\n\nAustralia dominates competition\n\nThe Australian team dominated the World Cup this year, with Dingle and Mervyn O'Connell winning gold and a world record in the mixed team event with the highest average speed, 507.58kph.\n\nHailing from Merrijig in Victoria, O'Connell also set Oceanian records in several events, including reaching a maximum vertical speed without a drogue parachute at 541.51kph.\n\nNatisha Dingle and Mervyn O'Connell won gold in the mixed team speed skydiving event in Austria. (Supplied: Australian Parachute Federation)\n\nO'Connell and his Australian teammates, Simon Walsh and Heath Baird, also claimed a world record with a highest average speed in the team event of 506.13kph.\n\nDingle said she would love to see the sport get wider recognition and even hoped it could be added to the Olympics one day.\n\n\"I think there's a lot of time and dedication and personal money that goes into achieving this and we do it really for the love [of the sport],\" she said.\n\n\"We already have a world-sanctioned event, so I don't see why it can't be a part of the Olympics.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/health/2025-09-24/scientific-journal-retracts-apple-cider-vinegar-study/105803958",
        "title": "Controversial apple cider vinegar weight-loss study retracted",
        "publish_date": "Tue, 23 Sep 2025 22:32:26 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A high-profile journal publisher has retracted a study that suggested apple cider vinegar could help with weight loss.\n\nThe study — published last year in the journal BMJ Nutrition, Prevention & Health — claimed people drinking apple cider vinegar could lose weight at dramatic rates.\n\nBut after an investigation, the journal's publisher BMJ Group has found the study's results didn't hold up.\n\nResearchers flag flaws with study\n\nThe study described a clinical trial where 120 overweight and obese people, aged between 12 and 25, consumed small amounts of apple cider vinegar in water each day for three months.\n\nIt received widespread attention when it was published, both in traditional and social media, but it also drew critical attention from academics.\n\nResearchers flagged several concerns with the study in letters to the journal, such as the clinical trial not being publicly registered, and problems with the statistical analyses.\n\nOne critique pointed out that the study's findings suggested apple cider vinegar worked as well as GLP-1 agonist drugs such as Ozempic for weight loss.\n\nIf this result panned out, \"the economic and public health impact would be virtually unprecedented\" the study's critics said.\n\nRe-analysis of the study data could not replicate the finding that apple cider vinegar helped with weight loss. (Wikimedia Commons: Phongnguyen1410)\n\nKatrina Kissock, a nutrition researcher at the George Institute for Global Health, said the study's lack of public clinical trial registration stood out to her in the retraction notice.\n\n\"This is super important to have when it comes to clinical trials, as it really ensures there's this transparency in what the researchers do,\" Dr Kissock said.\n\nABC Health in your Instagram feed Follow @abchealth on Instagram, where we're busting myths and sharing practical, smart health advice.\n\nIn a statement, BMJ Group said it referred the paper to independent statisticians to examine its data, and they found they couldn't replicate the results the researchers had reported.\n\nThe statisticians also found \"irregularities in the data set\" and said participant data required further scrutiny.\n\nIn BMJ Group's statement, the study's authors said these were \"honest mistakes\", but they agreed with the publisher's decision to retract the paper.\n\nRony Abou-Khalil, the corresponding author of the retracted paper, did not respond to the ABC's request for comment.\n\nRetractions are part of scientific review\n\nGideon Meyerowitz-Katz, a senior research fellow at the University of Wollongong, said the study's data was \"very unreliable\".\n\nBut he praised BMJ Group for investigating the criticisms and announcing it was retracting the study.\n\n\"They're really trying to bring attention to a mistake that they made in publishing the study and giving a good explanation for why it happened,\" Dr Meyerowitz-Katz said.\n\n\" In theory, this is how it should happen all the time, but it's so rare that this happens that it feels very remarkable to me. \"\n\nA spokesperson for the BMJ Group told the ABC the retraction was part of their policy to \"foster transparency and uphold the integrity of the scientific process.\"\n\nThey said this approach was especially important for studies that had gained widespread international attention.\n\n\"\"We believe this approach has a positive impact and can help strengthen public trust in science,\" they said.\n\nEvangeline Mantzioris, a nutrition researcher at the University of South Australia, noted problems with the study's statistics when it was published last year.\n\nShe said that she wasn't surprised by the paper's retraction.\n\n\"It shows that science is backed up by continual review, even past its publication,\" Dr Mantzioris said.\n\nDr Meyerowitz-Katz said that, ideally, an investigation and retraction like this would enhance public trust in scientific publishing.\n\n\"Peer review is presented to the public is as a sort of a bastion against bad evidence,\" Dr Meyerowitz-Katz said.\n\n\" Retractions like this, in theory, should enhance public trust because peer review is an imperfect process. \"\n\nBut in practice, he was less optimistic.\n\n\"I personally doubt this retraction will harm public trust in science all that much, because I very much doubt that the majority of people who read the initial study, or saw Tik Toks about its results, will ever know about the retraction.\"\n\nDoes apple cider vinegar have any weight-loss benefits?\n\nDr Mantzioris said there were \"limited health benefits\" to apple cider vinegar.\n\n\"We know that it's no different to other vinegars,\" she said.\n\n\"I'd rather have a balsamic vinegar on my salad, or a red wine vinegar. But that's just me.\"\n\nIs apple cider vinegar good for you? Photo shows Glass and spoon of apple cider vinegar surrounded by red apples. Apple cider vinegar is so popular in the wellness world that it's being used as the title of a new TV series about disgraced influencer Belle Gibson. But does it really do anything for your health?\n\nDr Kissock said that while there were a few small studies linking apple cider vinegar and weight loss, there was not enough evidence to draw long-term conclusions about its merit.\n\nThe publication and retraction of this study did not change her assessment.\n\n\"Generally, when we are making these evidence-based recommendations, it is based on multiple different studies looking at the same topic, and we're just not there yet,\" Dr Kissock said.\n\nDr Mantzioris agreed, and said replication was important for collecting health information.\n\n\"You want the data to be replicated again and again. You don't just want one study that's shown it, for this very reason.\"\n\nHow do I know if health information is credible?\n\nDr Kissock said that when assessing a promising health claim in a study, it was important to check the credibility of the journal it was published in, the credentials of the authors, and any public clinical trial data.\n\n\"Similarly, looking at any funding sources as well for a study — this could also influence how the study is done, or the findings.\"\n\nShe added it was important to see if any other similar research had been published.\n\n\" Is this study showing something completely different to what's already been reported or published or does it align with where the evidence is at currently? \"\n\nDr Mantzioris said that, in addition to looking for other research to back the claim up, it was important to check there was \"a biological pathway that would explain the result\".\n\nThis might mean, for instance, asking which nutrients or ingredients in a food could produce the given health benefit.\n\nDr Meyerowitz-Katz said that, while there were trusted sources that studies can be checked against, they also sometimes make mistakes.\n\n\"I don't know if there is any good way to prevent yourself from being bamboozled when it is a published scientific article that's doing the bamboozling,\" he said.\n\nNo method for checking the reliability of research papers was completely foolproof, according to Dr Meyerowitz-Katz.\n\n\"It's worth being cautious about even a published study, because this clearly shows that sometimes they can be problematic.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/asx-markets-business-live-news/105809708",
        "title": "Live: ASX falls as Optus investigates triple-0 failure",
        "publish_date": "Tue, 23 Sep 2025 22:04:01 +0000",
        "category": "finance",
        "authors": [
            "David Chau",
            "Emily Stewart"
        ],
        "text": "The Australian share market has fallen in morning trade ahead of the latest inflation data from the Bureau of Statistics (ABS).\n\nThe ASX is also following a weak lead from Wall Street, which dropped from its record highs after Federal Reserve chair Jerome Powell suggested US stocks appear to be \"fairly highly valued\".\n\nMeanwhile, Optus has appointed former Sydney Water CEO Kerry Schott to lead an independent review into the triple-0 failure last week, which resulted in at least three deaths.\n\nSee how the trading day unfolds on our blog.\n\nDisclaimer: this blog is not intended as investment advice.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/ange-postecoglou-nottingham-forest-europa-league/105809674",
        "title": "Postecoglou 'excited' to defend his trophy with Forest",
        "publish_date": "Tue, 23 Sep 2025 21:53:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "Four months after leading Tottenham Hotspur to Europa League triumph in Bilbao, Ange Postecoglou has returned to Spain and UEFA's second-tier club competition with a new challenge, and he cannot wait.\n\nPostecoglou ended Spurs' 17-year wait for a major trophy with that win over Manchester United — and was rewarded with the sack.\n\nHe is now at Nottingham Forest, and trophy drought is twice as long at 35 years. But it is not that 1990 Football League Cup win that Forest fans are recalling as they prepare for the club's visit to Seville to play Real Betis.\n\nAnge's Spurs sacking the sad reality for awful league campaign Photo shows Tottenham Hotspur head coach Ange Postecoglou looks on during the post-season friendly match Ange Postecoglou flew into the Spurs job on a wing and a prayer, and surpassed expectations immediately. But long-standing structural issues and Postecoglou's own pigheadedness ensured a reversion to Tottenham's 'Spursy' norm.\n\nForest is a two-time European champion, having won the European Cup (now Champions League) in 1979 and 1980 under the charismatic managerial genius Brian Clough, and the memories still burn brightly.\n\nBut this will be its first continental tie in 10,781 days, since a UEFA Cup quarterfinal against Bayern Munich in March 1996.\n\nAsked if it feels like a big moment for the club, the Australian said: \"Oh, absolutely. Without a shadow of a doubt.\n\n\"Thirty years, a club that's absolutely climbed to the peak of European football in the past and you can just imagine how the supporters are feeling.\n\n\"There's probably a couple of generations in there who've heard the stories but not lived the experiences. Now they can live their own experiences.\"\n\nFor Postecoglou himself, the campaign is a title defence and he added: \"I'm excited by it. When I made the decision to accept the position, it was one of the most enticing bits.\"\n\nForest will be cheered on by 3,385 travelling fans at the cavernous La Cartuja in Seville, where Betis is playing while its Estadio Benito Villamarin is redeveloped.\n\n'Mic drop': Ange told you he always wins a trophy in his second season Photo shows Ange Postecoglou holds his hand on his chest When Spurs hired Ange Postecoglou, he was seen as an alternative to the \"winners\" who had gone before him. Now he's backed up his pre-season statement of always winning a trophy in his second season to silence the doubters. Again.\n\nPostecoglou is in the early stages of transforming Forest from the safety-first football practised by his predecessor Nuno Espirito Santo to the attacking style he is known for.\n\nHe is yet to win a match after two defeats and a draw, all away from home, since taking over earlier this month.\n\nWhile the team transitions, he recognises he may have to compromise, in Europe at least.\n\n\"It's fair to say that the world is crying out for me to be pragmatic,\" he said. \"But I'm just not built that way.\n\n\"I've always said what I like to do and what I enjoy more than anything is winning, so whatever it takes we'll do.\n\nAnge's rise from the failed dream of the NSL to European glory Photo shows Ange Postecoglou holds a trophy In 2008, Ange Postecoglou was a Fox Sports pundit who felt unemployable. Now he's the first Australian football manager to win a major European club trophy.\n\n\"In the final we [Tottenham] had to play a certain way because of the availability of the players we had.\n\n\"I think you do have to approach the Europa League a little bit differently.\n\n\"Tactically, there's some tweaks you need to make to allow the players to perform at their best. I still want to win every game.\"\n\nReal Betis midfielder Giovani Lo Celso, who played under Postecoglou at Spurs, praised the Australian.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Obviously, he is a great coach,\" the Argentina international said. \"He is a coach that likes the best kind of football.\"\n\nBetis lost the third-tier Conference League final to Chelsea last season and with Forest is among the Europa League favourites.\n\nCoached by former Real Madrid and Manchester City boss Manuel Pellegrini, Betis has made a mixed start to the Spanish league season with three draws away and two wins and a loss at home.\n\nAAP/wires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/qld-adelaide-street-bus-tunnel-opening-september-29/105809706",
        "title": "Underground tunnel could reduce bus traffic in Brisbane CBD 'by up to a third'",
        "publish_date": "Tue, 23 Sep 2025 21:51:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "After more than two years of construction, an underground tunnel set to alleviate congestion in Brisbane will officially open to commuters next week.\n\nThousands of passengers are expected to tour the now complete 213-metre Adelaide Street tunnel today, ahead of it being added to routes on September 29.\n\nConstruction on the tunnel was originally expected to be completed in mid-2024.\n\nRunning under one of the city's oldest streets, around 16 Olympic swimming pools worth of soil and rock have been removed over the life of the project to deliver the underground infrastructure.\n\nThe tunnel's opening will mark the completion of the near decade-long campaign to reshape transport solutions in the city.\n\nTunnel to provide dedicated busway connection\n\nThe Adelaide Street opening is the final piece of the Brisbane Metro puzzle, first touted by Brisbane City Council in 2016.\n\nIn 2019, the council announced a plan to turn Adelaide Street into a walkable boulevard and gateway to the city, replacing its busy lanes of traffic with a safer environment for pedestrians and active travellers.\n\nA purpose-built drill rig installed over 20 kilometres of steel canopy tubes to form the roof of the tunnel. (ABC News: Alicia Nally)\n\nThe tunnel provides a dedicated link for busways between North Quay, on the bank of the Brisbane River, and King George Square in the heart of the CBD.\n\nServices would otherwise move through the streets of the city, causing further congestion.\n\nWhen construction got underway in 2023, then Brisbane City Council transport committee chair Ryan Murphy said the tunnel would provide a \"missing link\" in the public transport network.\n\n\"[It] will reduce the number of buses clogging CBD streets by up to a third, during the morning and evening peaks,\" he said.\n\nAbout 1,400 bus and metro trips are expected to be carried through the tunnel each weekday.\n\nAndrew Wines says the tunnel will help ensure the public transport network is more predictable. (ABC News)\n\nThe current chair, Councillor Andrew Wines, said the tunnel would take \"pressure off\" Adelaide Street and Victoria Bridge.\n\n\"Ensuring that our public transport network is more predictable, more reliable, and ready for growth,\" he said.\n\n'We've got to make sure we plan for population growth'\n\nQueensland Deputy Premier Jarrod Bleijie said the tunnel — and the Brisbane Metro pitch more broadly — would prepare the city as it grapples with population growth, alongside hosting the 2032 Olympic Games.\n\n\"We've always said 2032 is not just about the two weeks of the Games. It's about the legacy — one of those is public transport,\" Mr Bleijie said.\n\n\"South-east Queensland is one of the fastest growing regions in Australia, but we've got to make sure we plan for the population growth.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/offshore-wind-pioneer-henrik-stiesdal-lessons-for-australia/105783010",
        "title": "Offshore wind pioneer urges Australia to learn from UK's renewables push",
        "publish_date": "Tue, 23 Sep 2025 21:32:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "If the offshore wind industry was to name a founder, Henrik Stiesdal would be a contender.\n\nHe helped build the world's first offshore wind farm in Denmark in 1991, before serving as chief technology officer at Siemens Wind Power, the world's dominant renewable energy supplier at the time.\n\nHe has influenced the industry for more than three decades.\n\nAnd he thinks Australia has the key ingredients to establish its own successful offshore wind industry.\n\n\"Australia has huge opportunities because you have such good wind resources,\" Mr Stiesdal said.\n\nHenrik Stiesdal has played a key role in creating the modern wind energy industry. (Supplied: Stiesdal)\n\n\"And you [Australia] have a fairly well-developed network, a grid that could distribute the energy supply from offshore wind.\"\n\nAustralia's offshore wind industry is in its infancy, but federal and state governments want it to play a key role in the shift to renewable energy.\n\n\"Australia is now very outspoken and very clear in the language that the government wants it to happen,\" Mr Stiesdal said.\n\nBut he cautioned against expecting rapid progress.\n\n\"The permitting process is not something you just pull out of the high hat,\" he said.\n\nHenrik Stiesdal has his name on 94 European patents for wind technology. (Supplied: Stiesdal)\n\nMr Stiesdal said once the first project was approved, future decision times would be shorter.\n\n\"There's a serious piece of work in that, and then the actual construction time from when you sign a contract in a new location like Australia … to now we're going to do this, should typically be three to four years,\" Mr Stiesdal said.\n\nPush for a local industry\n\nAustralia last week pledged to cut carbon emissions by 70 per cent by 2035.\n\nWith most coal plants set to close over the next decade, the federal government believes offshore wind has a role to play in replacing them and meeting its climate targets.\n\nIn 2022, the federal government designated six coastal zones where offshore wind turbines could be built.\n\nThe Gippsland offshore wind zone, in Victoria's south-east, is home to Australia's most advanced project, the 2.2 gigawatt Star of the South.\n\nOffshore wind delays Photo shows An impression of large white wind turbines in the ocean The Victorian government pushes back its timeline for new offshore wind farms in the state's east.\n\nIts developers aim to have the plant operating by 2030, which would allow Victoria to meet its goal of 2.2GW of power from offshore wind by 2032.\n\nThat is enough to replace the state's largest coal plant, Loy Yang A, which is set to close in 2035.\n\nWhile Victoria’s offshore wind industry is moving forward, albeit with some delays, elsewhere in Australia community backlash over the visual impact of turbines has stalled or sunk projects.\n\nIn South Australia, the sector never gained traction; a proposed site near Port MacDonnell in the state’s south east was scrapped after locals raised concerns about tourism and the fishing industry.\n\nSeveral other projects have collapsed in recent years as major international investors pulled out. Norwegian oil and gas giant Equinor abandoned four ventures, including in New South Wales, after entering the Australian market in 2022.\n\nMeanwhile, the latest National Climate Risk Assesment warns 1.5 million Australians are at risk from sea level rises by 2050 unless climate change can be mitigated.\n\nTaiwan has a fast-growing offshore wind industry and is considered a global leader in wind technology. (Supplied: Orsted Energy)\n\nWhy Europe rules the industry\n\nMr Stiesdal said while Denmark was the offshore wind pioneer, it was the United Kingdom that had leapt ahead.\n\nHe said the reason for the UK's success in getting projects off the ground was good planning.\n\n\"Denmark and Britain very quickly got the arrangement of what we in our daily terms called a one-stop shop… a single point of contact arrangement,\" he said.\n\nThe UK's first commercial offshore wind farm began operating in 2003.\n\nBritain now has 52 offshore wind farms that produce 15.9GW of power, the equivalent of enough electricity to power more than half of the homes in the UK.\n\nMr Stiesdal said the key was to \"uncomplicate\" things.\n\n\"In countries that have not realised that, the planning processes tends to be very drawn out,\" he said.\n\nEmployment opportunity\n\nAccording to the federal government, a single 2GW offshore wind farm has the potential to create 1,200 jobs during construction and 600 ongoing roles for operations and maintenance.\n\nIven Mareels (right) has visited Taiwan to study its offshore wind industry. (Supplied: Federation University)\n\nIn May, Federation University pro-vice chancellor of research and innovation Iven Mareels and electro-technology graduate Mia Danko travelled to Taiwan as part of an industry trip to look at the island nation's industry.\n\n\"Taiwan at this point in time is the fifth largest wind farm installation country... and it is the one that is growing the fastest,\" Professor Mareels said.\n\n\"Visiting Taiwan gave us an idea of the broad spectrum of skills required — not just engineers but others.\"\n\nMia Danko has visited Taiwanese offshore wind farms as part of a sponsored trip. (Supplied: Federation University)\n\nMs Danko said she hoped to work in Gippsland's offshore wind industry and was impressed by the employment possibilities.\n\n\"[Taiwanese workers] said a lot of people currently working in the coal and gas industry can actually transfer those skills to offshore wind with short courses,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/england-name-squad-to-face-australia-in-men-s-ashes-series/105809606",
        "title": "England pick a battery of pace bowlers for Ashes series",
        "publish_date": "Tue, 23 Sep 2025 21:12:07 +0000",
        "category": "sports",
        "authors": [],
        "text": "England will come to Australia with a battery of pace bowlers spearheading their attempt to regain the Ashes, but with questions over their batting line-up and the fitness of several players.\n\nThe tourists have named 16 men for the five-Test series, including a shock pick as back-up spinner, and Harry Brook taking over from Ollie Pope as vice-captain. Eleven of the party have never played a Test in Australia.\n\nEngland squad for 2025/26 men's Ashes series Ben Stokes (captain)\n\nHarry Brook (vice-captain)\n\nJofra Archer\n\nGus Atkinson\n\nShoaib Bashir\n\nJacob Bethell\n\nBrydon Carse\n\nZak Crawley\n\nBen Duckett\n\nWill Jacks\n\nOllie Pope\n\nMatthew Potts\n\nJoe Root\n\nJamie Smith (wicket keeper)\n\nJosh Tongue\n\nMark Wood.\n\nChris Woakes, whose last act as an England player was to bat with a dislocated shoulder on the dramatic last day of the England-India series, has not been included, but six quicks have, including the very rapid duo of Jofra Archer and Mark Wood.\n\nBrook's promotion suggests that Pope's place as number three is under threat after a long period of mixed form. Jacob Bethell, who is yet to score a first-class century, is the most likely candidate to replace him, but Will Jacks is an outside pick.\n\nThe spinning all-rounder was a surprise choice as back-up twirler to Shoaib Bashir having previously been mostly considered for the white-ball set-up.\n\nJacks took six wickets in Rawalpindi on his Test debut in December 2022, did not add to that tally in his next appearance at Multan and had appeared to slip out of England's red-ball plans entirely.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nIn the intervening period, England have picked six other spinners including Bashir, even dragging Moeen Ali out of retirement to plug a gap during the 2023 Ashes.\n\nNow, after three first-class appearances delivering five wickets this season, Jacks is back in contention because, like Bashir, he has the height England believe makes spinners effective in Australia.\n\nHe is also a fine fielder and versatile batter but is currently nursing a broken finger and will miss next month's pre-Ashes white-ball tour of New Zealand to complete his recovery.\n\nBen Stokes will captain England during the 2025/26 Ashes, however it is unclear whether he will be fit to bowl during the five-Test series. (Reuters: Action Images/Lee Smith)\n\nAlso needing to prove their fitness are Bashir, who broke a finger in the fourth Test with India, Wood, who missed the entire northern summer after a knee operation, and the captain Ben Stokes himself, who also missed the last India Test with a shoulder problem.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe England and Wales Cricket Board said Stokes \"remains on track to be available for the start of the Test series\" but there is a doubt about his fitness to fully contribute as a bowler. If he is unable to play any of the Tests Jacks may well take the all-rounder role with Bashir axed.\n\nIn addition, Archer is two Tests into his comeback after four years of setbacks, Brydon Carse has been troubled by a long-standing toe issue, and Gus Atkinson missed the first four Tests against India with a hamstring injury.\n\nWith five Tests in seven weeks, starting in Perth on November 21, keeping bowlers fit could be key to who wins. Australia have their own problems with captain Pat Cummins a doubt for the first Test with a back problem.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/act-commonwealth-avenue-bridge-shrink-three-lanes-construction/105808342",
        "title": "'Essential works' to shrink major Canberra bridge to three lanes",
        "publish_date": "Tue, 23 Sep 2025 20:43:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's one of Canberra's most important pieces of infrastructure, connecting the capital's north and south.\n\nThousands drive, cycle and walk across Commonwealth Avenue Bridge every day, but major work addressing its structural safety will soon get underway, starting two years of significant traffic disruption.\n\nThe bridge has not undergone any significant upgrades since it opened to traffic in 1963, but work to strengthen it is now required.\n\nThe Commonwealth Avenue Bridge was opened more than six decades ago. (Richard Clough, National Library of Australia.)\n\n\"These works are to ensure that it remains a useful asset that reflects the growth of Canberra and the needs of community,\" National Capital Authority (NCA) chief executive Karen Doran said.\n\n\"This work will safeguard it for the next 60 years for the Canberra community.\n\n\" It will cause some disruption, but it's essential works that need to be done. \"\n\nWhile the $137.5 million project focuses on strengthening the bridge, the shared pathways will also be widened, new lighting will be installed and safety barriers will be replaced.\n\nKaren Doran says the strengthening will safeguard Commonwealth Avenue Bridge for the next 60 years. (ABC News: Harry Frost)\n\nWork will be completed in two stages: first the western span of the bridge, impacting the northbound lanes, followed by the eastern span, impacting southbound lanes.\n\nIt means only one side of the bridge will be open at a time, seeing its six lanes shrink to three to accommodate traffic, pedestrians and cyclists travelling in both directions.\n\nConstruction is anticipated to begin later this year, with each stage to take around 12 months to complete.\n\n\"I acknowledge that is a long time and we will have issues of disruption for the community which we're looking to manage,\" Ms Doran said.\n\nWhat will the impact on public transport be?\n\nChris Steel says there will be a temporary reduction in the frequency of weekday bus services. (Facebook: Chris Steel MLA)\n\nAlmost 1,400 Transport Canberra bus services cross the bridge every day during the week.\n\nTransport Minister Chris Steel says the works will have a cascading and unavoidable impact across the entire bus network and there will be a direct impact on the frequency of bus services.\n\n\"All of those buses — including general traffic — will now be squeezing into half the road space once bridge works commence,\" Mr Steel said.\n\n\"To deliver a reliable bus service that takes into account the impact of the NCA's bridge works, this unfortunately means the frequency of bus services on weekdays will need to be reduced temporarily during construction.\n\n\"There will be a range of mitigations that we can put in place, but we can't fully mitigate the impacts of this.\"\n\nThe works will see shared pathways widened, new lighting installed, and safety barriers replaced. (ABC News: Joel Wilson)\n\nThe exact number of bus services that will be impacted is not yet clear, but Mr Steel said the ACT government was working closely with the NCA.\n\nThe NCA has been undertaking a traffic management assessment and once that's finalised, it will provide a clearer idea on the impact on travel times and will allow the government to release a new bus timetable.\n\nOptions to prioritise public transport are being considered by the NCA, but no decisions have been made yet about what that will look like.\n\n\"We have been considering options around having dedicated lanes for buses and how we run the three available lanes to traffic to reflect the peak flows,\" Ms Doran said.\n\n\"As soon as we know the option we are going to be pursuing, we are going to be communicating that with the public.\"\n\nAre the works connected to light rail?\n\nLight rail Stage 2B will see a new bridge built between the two spans of Commonwealth Avenue Bridge. (Supplied: ACT government)\n\nThe works aren't connected with the plan to extend light rail across Lake Burley Griffin.\n\nThat project is still in the planning and approval stage, and involves building a new bridge in between the existing two spans of Commonwealth Avenue Bridge.\n\nMr Steel said even if the government wanted to progress its light rail expansion plans at the same time as the NCA works, that would not have been possible.\n\n\"Light rail stage 2B works to build a new bridge over Lake Burley Griffin can't be constructed concurrently with the bridge strengthening project as there would be a direct conflict between the two projects,\" he said.\n\nBut if light rail's extension to Woden is eventually approved, there'll be more traffic chaos well after the NCA's works are complete.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-24/nt-government-open-to-state-square-art-gallery-subdivide-darwin/105807672",
        "title": "Leading art critic labels NT government gallery plan 'pure madness'",
        "publish_date": "Tue, 23 Sep 2025 20:28:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Northern Territory government has been accused of \"vandalising\" a major cultural asset, as it considers \"partial occupancy\" as an option for use of the near-complete State Square Gallery building in Darwin.\n\nIn August, the government began seeking expressions of interest (EOI) for the purpose-built facility, after a surprise announcement in May that the Museum and Art Gallery of the NT (MAGNT) would not necessarily be awarded the lease.\n\nLast week, the government told prospective tenants it would consider splitting the lease between interested parties, and that they could submit proposals for either single floors or galleries within the building.\n\nThe NT government has announced it is open to subdividing the lease for Darwin's new gallery when construction is complete. (ABC News: Michael Donnelly)\n\nIn May, Treasurer Bill Yan said the decision to open bids for use of the building was driven by a construction cost blowout of $100 million and a lack of budgeting for MAGNT's operations at the site.\n\nNT museum chair resigns amid CBD gallery plan fallout Photo shows An architectural design shows a terracotta-coloured art gallery standing on a green lawn. The long-standing chair of the Museum and Art Gallery of the NT has quit her position, just weeks after an announcement that a planned Darwin CBD art gallery may not be going ahead.\n\n\"It's quite possible it will become a gallery, but we'll have to have a look at those EOIs that come back,\" he said.\n\nThe government has told potential bidders their use of the gallery should \"promote livability\", be \"financially sustainable\", \"maximise broader social, cultural and economic benefits\" and \"stimulate private investment\".\n\nArt critic and former head of Australian art at the National Gallery of Australia, John McDonald, said the original proposal would have achieved those goals.\n\n\"This is a tourism asset of the first order,\" he said.\n\n\" To try and turn a purpose-built, purpose-designed, architect-quality art gallery into some amorphous shopping centre is pure madness. \"\n\nThe building will feature a foyer and two large galleries, a gallery shop and cafe, photography and art conservation rooms and two smaller gallery spaces. (ABC News: Marcus Kennedy)\n\nThe building is comprised of three storeys with a foyer and two large galleries, a gallery shop and cafe, photography and art conservation rooms and two smaller gallery spaces, according to tender documents.\n\nIn April, the Department of Logistics and Infrastructure announced a specialised temperature control system was being installed in the basement.\n\n\"The basement works include installing the air handling unit and chiller pumps to regulate temperature and humidity for the artworks once installed in the gallery, and a back-up generator to maintain uninterrupted climate control,\" a department spokesperson said.\n\nIn tender documents released last week, the government said it would be up to bidders to investigate the cost of running the system.\n\nA concept design of the planned State Square precinct, with the new gallery in the background. (Supplied)\n\n\"The Northern Territory government is not in a position to provide estimates for ongoing operational costs,\" the documents read.\n\n\" It is the responsibility of the proponent to undertake their own investigations to determine the likely costs associated with operating the building. \"\n\nNT home to renowned art collections\n\nMr McDonald said MAGNT's current premises, just outside the Darwin CBD, were no longer fit for purpose as an art gallery, and were unable to properly display the NT's substantial art collection.\n\n\"The National Aboriginal and Torres Strait Islander Art Awards has been a device for securing the best, most original, the most innovative Aboriginal art in Australia for a long time now, for 40 years,\" he said.\n\n\"That has enabled [MAGNT's] collection to grow and grow and grow and to have things which are groundbreaking, major works by big names in the whole Aboriginal art industry.\n\nArt critics say the NT's major gallery contains some of the world's best Australian Aboriginal art, and the new facility is being built to ensure those works are housed in the right conditions. (ABC News: Michael Donnelly)\n\n\"Darwin has sold itself short for years and years by not being able to show those works and provide a proper showcase.\"\n\nIn the 1970s, MAGNT purchased more than 200 of the first paintings produced by men at Papunya, which has been credited with starting one of Australia's most significant art movements, according to the National Museum of Australia.\n\n\"It's ridiculous for so long that the Northern Territory has been seen as this frontier place where everybody just drinks a lot of beer and every newspaper has stories about crocodiles,\" Mr McDonald said.\n\n\" This is a chance for the Northern Territory to step up and show that it is the home of an amazing cultural movement. \"\n\nReturn by Thea Anamara Perkins was a finalist in the 2024 NATSIAA and acquired by MAGNT. (Supplied)\n\nMAGNT did not respond to questions about its EOI for the State Square building, citing a government requirement that proponents not discuss their bids with media.\n\nA number of architectural and construction firms, as well as MAGNT, have sought the EOI documents from the government's online tender portal.\n\nApplications close next month, with the winning bid expected to be revealed by mid-2026, along with the building's completion.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-racq-accused-of-misleading-customers-over-price-hikes-20250923-p5mx9y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: RACQ accused of ‘misleading’ customers over price hikes; Public to get first sneak peek of new Adelaide Street tunnel; Does Brisbane need a larger rectangular stadium?",
        "publish_date": "Wed, 24 Sep 2025 11:53:50 +1000",
        "category": "finance",
        "authors": [],
        "text": "International tourism has hit a new high in Queensland, federal government data reveals, with more visitors spending hundreds of millions more in the Sunshine State.\n\nThe Tourism Research Australia figures show international spending in Queensland climbed 10.6 per cent above the previous year’s record high of $6.9 billion, in the year to June.\n\nSome 2.2 million international tourists touched down – an increase of 2.7 per cent.\n\nSurfers Paradise on the Gold Coast, where international tourists spent $1.5 billion last financial year. Credit: Education Images/Universal Images Group via Getty Images\n\nThey spent the most money on the Gold Coast ($1.5 billion) and in the state’s tropical north ($1.2 billion).\n\nNew Zealanders made up the largest cohort of visitors, but more tourists also arrived from India, France and Taiwan.\n\nQueensland remains the third-largest market behind NSW and Victoria.\n\nTourism Minister Andrew Powell suggested the results were a sign his government’s 20-year tourism plan, dubbed “Destination 2045” and released in June, was “gaining momentum”.\n\n“Queensland is the home of the holiday, and our visitor economy is clear proof of that on the global stage,” Powell said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/labor-said-morrison-had-no-plan-on-net-zero-but-the-government-is-using-a-big-part-of-his-playbook-20250923-p5mx6u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Labor said Morrison had no plan on net zero, but the government is using a big part of his playbook",
        "publish_date": "Wed, 24 Sep 2025 11:53:40 +1000",
        "category": "finance",
        "authors": [
            "Mike Foley"
        ],
        "text": "Australia finally has a clear energy policy and an ambitious climate target to drive investment required to modernise the electricity grid. But the Albanese government’s new plans to reach net zero by 2050 lack the same details for which the Morrison government was criticised.\n\nThe Albanese government last week announced its 2035 climate target, committing to cut emissions by 62-70 per cent from 2005 level by 2035 in a major upgrade to its 2030 goal and a huge increase in ambition compared to past governments.\n\nPrime Minister Anthony Albanese and former PM Scott Morrison both released net zero plans. Credit: Nine.\n\nArresting climate change and meeting that ambition means more than just cleaning up the power grid, where the government is making valuable gains with clear policy to drive private investment into renewable energy.\n\nIt will also require decarbonising every part of the economy that releases dangerous emissions, such as Australia’s factories that need fossil fuels or farms that use lots of diesel and emit methane from livestock.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/judge-reveals-abc-s-penalty-in-antoinette-lattouf-unlawful-sacking-case-20250923-p5mx8m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Judge reveals ABC’s penalty in Antoinette Lattouf unlawful sacking case",
        "publish_date": "Wed, 24 Sep 2025 11:53:39 +1000",
        "category": "finance",
        "authors": [
            "Michaela Whitbourn"
        ],
        "text": "The ABC has been ordered to pay a penalty of $150,000 to Antoinette Lattouf for unlawfully terminating her Sydney radio contract after a judge found it “let down the Australian public badly” by capitulating to pro-Israel campaigners.\n\nThe sum is in addition to $70,000 in compensation that Federal Court Justice Darryl Rangiah ordered the national broadcaster to pay Lattouf after delivering his principal decision on June 25.\n\nAntoinette Lattouf and one of her barristers, Philip Boncardo, outside the Federal Court in Sydney earlier this month. Credit: Sam Mooy\n\nRangiah said in his penalty decision, delivered in Brisbane on Wednesday, that the ABC had chosen to “surrender to the lobbyists’ political campaign by sacrificing” Lattouf. He ordered the ABC to make the payment to Lattouf within 28 days.\n\n“The ABC is seen as an important public institution at a time when trustworthy sources of news and information are increasingly hard to find,” Rangiah said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/experts-question-the-benefits-of-taking-supplements-and-vitamins-20250924-p5mxkm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Experts question the benefits of taking supplements and vitamins",
        "publish_date": "Wed, 24 Sep 2025 11:47:19 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Experts question the benefits of taking supplements and vitamins\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-cheeky-two-metre-wall-standing-in-the-way-of-afl-s-most-lethal-attack-20250922-p5mx2h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The ‘cheeky’ two-metre wall standing in the way of AFL’s most lethal attack",
        "publish_date": "Wed, 24 Sep 2025 11:47:02 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size There is a “cheeky” side to Harris Andrews the public rarely see, a personality unlikely to be on show when he takes on his greatest challenge of the season: thwarting the AFL’s most lethal attack. The three-time All Australian’s knowledge of when to flick the switch is his key to thriving again in the grand final furnace, teammate Darcy Gardiner believes. “He’s very impressive, very professional, very meticulous about how he does things. He gives you such confidence out there when you’re in a bit of trouble, you know he’s usually going to be coming across to help,” Gardiner says. “[But] there’s definitely that other side of him when we let the hair down and have a few beers. He can be quite funny and cheeky and a bit of a larrikin. “He had a great time at my wedding, I won’t go into detail.” Harris Andrews, Logan Morris, Kai Lohmann with coach Chris Fagan after beating Collingwood in the prelim. Credit: AFL Photos via Getty Images Come Saturday afternoon’s grand final, the Lions co-captain will face a Geelong outfit that has scored more points than any other in 2025.\n\nAdvertisement\n\nSpearheaded by Coleman Medal winner Jeremy Cameron, the Cats have been destructive against rival backlines. But Andrews is a different animal. Loading For one, he will be seeking retribution for the club’s humbling against the same foe three weeks ago. For another, the 28-year-old fullback is coming off a defensive masterclass against Collingwood en route to a third-straight decider. The Magpies’ early pressure game kept the Sherrin pinned deep inside Brisbane territory for the opening five minutes. Yet despite 13 first quarter inside 50s, Collingwood had only seven points to show for it. Collingwood rallied emphatically to hit the front by the major break, but once the Lions began to dominate the clearance battle, their attack lost potency.\n\nAdvertisement\n\nWhen they did probe forward, Andrews was a constant presence. His 13 marks included five intercepts, before finding halfbacks Dayne Zorko, Jaspa Fletcher and Darcy Wilmot to facilitate service down field. Jaspa Fletcher has credited Harris Andrews for accelerating his own move to the backline. Credit: Getty Images “He’s been massive for us, especially in the finals he’s really hitting his straps, and it’s good to see him in the blazer again this year,” Fletcher told this masthead, referring to Andrews’ third All Australian selection. Loading “It makes it a lot easier to get on the offence knowing you’ve got such a great intercept marker and such a big body down the line. Any time he goes near it, he’s going to either spoil it or hang onto it. “He’s been huge for us and for me in helping me build my game as a defender. I haven’t played too much footy as a defender, so to have that help positioning-wise has been huge for me.”\n\nAdvertisement\n\nThe Andrews-Cameron clash will be pivotal at the MCG, with the pair sharing history dating back to 2018. Geelong’s goal-scoring wizard was playing for the Giants at the time, and copped a five-game suspension for a striking incident when he lashed out with his elbow and left Brisbane’s key defender with a small brain bleed. Andrews, 21 at the time, was left with blood gushing from his mouth, and while he missed a month of football, later stressed he harboured no grudge towards Cameron. No man has claimed more marks inside 50 than Cameron in 2025 (79). Yet, Andrews’ read of the contest has made him one of the most prolific intercept markers in the game – his 194 trailing only Adelaide duo Mark Keane (195) and Josh Worrell (201). When the Lions were thwarted by the Cats three weeks ago, Ryan Lester was initially tasked with pinning Cameron down, before Gardiner was moved onto him after Geelong blew out to a healthy lead. The following week, Gardiner was given an early lesson by Suns giant Ben King, before Andrews was relocated to stifle the Gold Coast sensation.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/why-craig-fitzgibbon-is-sharks-best-signing-of-the-past-five-years-20250923-p5mxdi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Craig Fitzgibbon is Sharks’ best signing of the past five years",
        "publish_date": "Wed, 24 Sep 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "When it comes to Cronulla’s best signing of the last five years, it’s difficult to go past coach Craig Fitzgibbon.\n\nProp Addin Fonua-Blake has added some mongrel and leadership to the pack, while star halfback Nicho Hynes is one of the most marketable players in the game. But has anyone done more for the club than Fitzgibbon, who has quietly steered the Sharks into the finals in each of the four years since becoming head coach?\n\nFriday night’s clash against Melbourne will be his second straight preliminary final. He also made it to the semi-finals in 2022, and an elimination final in 2023.\n\nFitzgibbon has overseen 104 games for 66 wins at a win percentage of 63.5, including eight finals matches.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/liverpool-star-sent-off-for-needless-and-stupid-goal-celebration-20250924-p5mxie.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Liverpool star sent off for ‘needless and stupid’ goal celebration",
        "publish_date": "Wed, 24 Sep 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Football, as Johan Cruyff once said, is a game you play with your brain. You can try to play without it – but as Hugo Ekitike found out on Wednesday morning (AEST), that will only get you so far.\n\nEkitike’s brain was either malfunctioning or missing entirely when he came off the bench for Liverpool at half-time of their Carabao Cup tie against Southampton, when he replaced Alexander Isak, his direct positional rival, who had scored just before the break.\n\nEkitike, 23, has it all: size, speed, strength, vision and technique. But he has some serious work to do between the ears.\n\nEight minutes after coming on, the lanky Frenchman was yellow-carded for dissent after throwing the ball away in frustration at a decision by the referee. That left him walking a disciplinary tightrope for the remainder of the match.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-albanese-and-trump-to-meet-next-month-at-white-house-trump-stuns-un-with-address-on-disaster-of-immigration-and-con-job-of-climate-change-20250924-p5mxgg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Albanese and Trump to meet next month at White House; Trump stuns UN with address on ‘disaster’ of immigration and ‘con job’ of climate change",
        "publish_date": "Wed, 24 Sep 2025 11:44:01 +1000",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Monthly inflation has lifted to 3 per cent, its highest level in a year, as subsidies to keep a lid on electricity prices came to an end.\n\nThe Australian Bureau of Statistics said although electricity prices fell by 6.3 per cent in August, over the past year they have lifted by 24.6 per cent.\n\n“’The annual rise in electricity costs is primarily related to households in Queensland, Western Australia and Tasmania having higher out-of-pocket costs in August 2025 than they did in August 2024,” the bureau’s head of price statistics, Michelle Marquardt, said.\n\nThe 3 per cent rate is the highest since July last year. It had been 2.8 per cent last month.\n\nWhile the 3 per cent headline rate is at the top of the Reserve Bank’s target range, the bank focuses more heavily on underlying inflation and the quarterly inflation report.\n\nUnderlying inflation at the monthly level eased from 2.7 per cent to 2.6 per cent.\n\nRents, which have been one of the driving forces of inflation over the past two years, continue to ease, with inflation in this area easing to 3.7 per cent, its lowest level since November 2022.\n\nThe RBA’s monetary policy committee meets next week but markets are not expecting interest rates – which have been sliced three times this year – to be lowered until at least November.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/cats-tragic-books-last-minute-flight-from-amsterdam-for-grand-final-20250922-p5mwx5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Has been awesome’: Nathan’s AFL hunch paid off in cheaper grand final flights",
        "publish_date": "Wed, 24 Sep 2025 11:36:30 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Footy fans are flying into Melbourne from interstate and beyond ahead of Saturday’s AFL grand final, with some travelling from as far away as Europe.\n\nGeelong play the Brisbane Lions in Saturday’s decider, when the Lions make their third successive grand final appearance. Some supporters have benefited by booking well before knowing for certain who would play at the MCG.\n\nBrisbane-based Nathan Christensen, wife Jessica and their daughter will be in Melbourne for the grand final.\n\nBrisbane-based Nathan Christensen, wife Jessica and their two-year-old daughter will fly to Melbourne with Virgin on Friday night.\n\nChristensen, who has a background in science and maths, said he calculated the odds of the Lions’ success this year based on draft picks before booking $300 flights in August.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/more-than-a-game-singer-chris-doheny-remembered-by-mcguire-20250924-p5mxkf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'More Than a Game' singer Chris Doheny remembered by McGuire",
        "publish_date": "Wed, 24 Sep 2025 11:34:14 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "'More Than a Game' singer Chris Doheny remembered by McGuire\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/jorgensen-primed-for-bledisloe-debut-20250924-p5mxke.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jorgensen primed for Bledisloe debut",
        "publish_date": "Wed, 24 Sep 2025 11:34:04 +1000",
        "category": "finance",
        "authors": [],
        "text": "Jorgensen primed for Bledisloe debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/really-nice-brisbane-gives-verdict-on-new-adelaide-street-tunnel-20250924-p5mxj8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Really nice’: Brisbane gives verdict on new Adelaide Street tunnel",
        "publish_date": "Wed, 24 Sep 2025 11:33:20 +1000",
        "category": "finance",
        "authors": [
            "William Davis",
            "Neesha Sinnya"
        ],
        "text": "Thousands of people have poured through the new Adelaide Street tunnel beneath Brisbane’s CBD for a community open day, five days before it officially takes its first bus and metro traffic.\n\nGavin, who took his family along, described it as “a really nice tunnel”.\n\n“I think the electrical installation is probably the best in the world,” he quipped, adding that he was the project manager who had worked on it.\n\nGavin and his family explore the Adelaide Street tunnel by foot. Credit: William Davis\n\nFather and son Richard and Jorge Pfuhl also went to the open day, with Jorge quizzing engineers about how the tunnel would cope with fires.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/channel-seven-splashes-12-million-for-rugby-league-world-cup-20250924-p5mxhy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Channel Seven splashes $12 million for Rugby League World Cup",
        "publish_date": "Wed, 24 Sep 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "Channel Seven will fork out close to $12 million to secure the exclusive rights to the Rugby League World Cup in Australia in 2026.\n\nWith the NRL set to begin negotiations for the sport’s next broadcast cycle in the coming months, Channel Seven has signalled its intention to be at the table by committing itself to the largest broadcast deal in international rugby league history.\n\nThe NRL has been in negotiations with broadcasters for months and Seven West Media has picked up the rights to the tournament despite interest from DAZN and Nine Entertainment Co, the publisher of this masthead.\n\nSources with knowledge of the situation talking on the condition of anonymity due to confidentiality said Nine were not willing to pay such a high fee for the rights in the off-season and preferred to save its money for when it heads to the negotiating table for the NRL and State of Origin rights from 2028.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/western-australia/insurance-giant-signs-on-as-inaugural-sponsor-of-perth-bears-20250924-p5mxjm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Insurance giant signs on as inaugural sponsor of Perth Bears",
        "publish_date": "Wed, 24 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Hamish Hastie"
        ],
        "text": "Insurance giant Budget Direct has signed on as the Perth Bears sleeves partner, marking the NRL club’s first major commercial deal.\n\nThe sponsorship is thought to be worth more than $1 million annually, making it the most lucrative sleeves deal in the league at nearly twice the typical price.\n\nPerth Bears chief executive Anthony De Ceglie. Credit: Stefan Gosatti\n\nPerth Bears chief executive Anthony De Ceglie said the record-breaking deal pointed to the club becoming one of the most commercially successful in the league.\n\n“The Perth Bears are a rare and special club – unlike anything else in the country – that allows brands the chance to have a monopoly on the NRL in Western Australia while also having a second home and supporter base in the bustling North Shore of Sydney,” he said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/england-make-shock-pick-as-ashes-squad-announced-20250924-p5mxi2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This England Ashes squad will light up Australia – or go down in flames",
        "publish_date": "Wed, 24 Sep 2025 11:21:03 +1000",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "This is an England Ashes squad that has the capacity to blow Australia away – or go down in a flaming heap itself.\n\nWhatever happens, the 16-man touring party led by Ben Stokes and Brendon McCullum has not been devised to surrender meekly, as each of the past three England teams in Australia have done.\n\nMost importantly, if at this stage only on paper, Stokes will have the fast bowling firepower to trouble the hosts.\n\nJofra Archer in the third Test match between England and India at Lord’s earlier this month. Credit: Getty Images\n\nMark Wood was England’s outstanding bowler on the last trip in 2021-22, and also turned the 2023 series from a likely Australian victory to a 2-2 draw. This time, Wood will have the assistance of Jofra Archer, after a multi-year plan to nurse the whippy fast man back to full bowling health with this assignment in mind.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/jorgensen-to-debut-at-fullback-as-more-injury-chaos-hits-wallabies-20250924-p5mxit.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jorgensen to debut at fullback as more injury chaos hits Wallabies",
        "publish_date": "Wed, 24 Sep 2025 11:14:22 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Max Jorgensen will make his debut at fullback against the All Blacks after more injury drama in the Wallabies camp, with in-form veteran Andrew Kellaway ruled out of the opening Bledisloe Cup clash with a calf strain.\n\nKellaway’s injury was announced by the Wallabies as it also emerged James O’Connor is set to start at five-eighth, less than a week after flying back from England on the understanding he wasn’t needed for the first Test against New Zealand in Auckland.\n\nThe Wallabies backline for the Eden Park clash on Saturday is set to have a new look from the last Test against Argentina in Sydney.\n\nHaving replaced Tom Wright at fullback, Kellaway was outstanding in the two Tests against the Pumas but picked up a calf strain at training and was ruled out.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/opera/win-1-of-6-opening-night-experiences-to-pinchgut-opera-s-messiah-20250923-p5mx9s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Win 1 of 6 Opening Night experiences to Pinchgut Opera’s Messiah*",
        "publish_date": "Wed, 24 Sep 2025 11:03:27 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "This year, Pinchgut Opera are celebrating the holiday season with one of the most beloved works of Baroque music, Handel’s Messiah. As a subscriber, you have the chance to enjoy an exclusive Opening Night experience.*\n\nRenowned for its profound beauty and spiritual depth, Messiah is a deeply moving and transcendent experience. In a work that has become synonymous with Christmas and the holiday season, this is a rare opportunity to discover it afresh, as the original audience did almost 300 years ago.\n\nHandel’s Messiah Credit: Pinchgut Opera\n\nOffer Details:\n\nHerald subscribers can enter to win 1 of 6 exclusive Opening Night packages for Pinchgut Opera’s Messiah at City Recital Hall, 27 November 2025.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/penrith-broke-broncos-hearts-but-a-shock-mam-ploy-can-redeem-finals-fall-20250923-p5mxal.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Penrith broke Broncos’ hearts, but a shock Mam ploy can redeem finals fall",
        "publish_date": "Wed, 24 Sep 2025 11:00:15 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Broncos leaders Kotoni Staggs and Ben Hunt believe the shock decision to deploy Ezra Mam off the bench can inflict the same heartbreak upon the Panthers as the southern club dealt Brisbane two years ago.\n\nThis is a stage Mam knows well, having come within two minutes of clinching a Clive Churchill Medal on the back of his grand final hat-trick in 2023, before Penrith’s Nathan Cleary orchestrated a 16-point comeback.\n\nThis has also been a season fraught with turmoil for the Brisbane five-eighth, who was suspended for the opening nine weeks after being charged with driving without a licence and with drugs in his system.\n\nEzra Mam will come off the bench in the Broncos’ preliminary final clash with Penrith at Suncorp Stadium on Sunday. Credit: Getty Images\n\nHis NRL comeback started emphatically – he scored five tries while coming up with 10 try assists and 10 linebreak assists from as many games – before he suffered a hamstring injury in round 23 against the Melbourne Storm.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/are-your-blueberries-safe-pesticides-scare-raises-alarm/tf1nqutcv",
        "title": "Are your blueberries safe? Why a pesticide scare has some concerned",
        "publish_date": "Tue, 23 Sep 2025 19:41:08 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Key points: An Australian researcher found high levels of a dangerous chemical in store-bought berries.\n\nA review by the pesticides regulator recommended a suspension of products containing the chemical.\n\nConsumers are advised to reduce their pesticide intake by washing or peeling vegetables.\n\nAustralia's agricultural chemicals regulator has proposed suspending the use of a pesticide on certain fruits after high levels of a harmful chemical were detected in store-bought blueberries.\n\n\n\n\n\nWhen professor of marine science at Southern Cross University Kirsten Benkendorff tested blueberries and raspberries bought at Australian supermarkets last November, she found high levels of a pesticide banned in the EU, as well as amounts of another chemical not approved for use in Australia.\n\n\n\n\n\nThe Australian Pesticides and Veterinary Medicines Authority (APVMA) said it would take action immediately if evidence indicated that there was an imminent risk of harm to the Australian community.\n\n\n\n\n\nBut levels of banned chemicals have raised questions around pesticide regulation in Australia.\n\n\n\nREAD MORE Why a splash of water on your veggies may not be enough to clean them\n\nWhat happened?\n\nBenkendorff had been testing creeks exposed to run-offs from blueberry crops, as well as crabs, oysters and turtles in the marine environment when the presence of a certain chemical raised suspicion.\n\n\n\n\n\n\"I was just really interested to see if it was getting into our food,\" she told SBS News.\n\n\n\n\n\nAfter buying punnets of berries from three different supermarkets in NSW's south-east coast, Benkendorff brought them to her lab for testing, where she found high levels of dimethoate, a chemical considered a \"possible human carcinogen\" by the United States Environmental Protection Agency.\n\n\n\n\n\nDimethoate is a common neurotoxin that has been in use since the 50s, and is legal in Australia. The EU banned its use in 2019, with the European Food Safety Authority concluding its use posed a risk to consumers, operators and workers.\n\n\n\n\n\nAll of Benkendorff's samples contained between four and 11 different kinds of pesticides, which were all generally below the recommended limit.\n\n\n\n\n\nBut three samples contained dimethoate levels high enough to exceed the daily acceptable intake, if consumed every day.\n\n\n\nHow are pesticides regulated in Australia?\n\nPesticides are a fact of Australian agriculture, targeting aphids, fruit flies and weevils. But they also impact us.\n\n\n\n\n\nThe Australian Pesticides and Veterinary Medicines Authority (APVMA) is the regulatory body overseeing pesticides and chemicals in Australia.\n\n\n\n\n\nIt sets maximum chemical limits for pesticides used in crops, which include \"generous safety margins\" to ensure chemical residues in produce remain between 10 and 100 times below the point where there could be \"measurable impact\".\n\n\n\n\n\nBut for those safety mechanisms to be effective, consumption level data needs to be accurate.\n\n\n\n\n\nIn February this year, the APVMA received \"updated consumption figures\" for blueberries, raspberries and blackberries, which indicated consumption levels had increased between 285 and 962 per cent.\n\n\n\n\n\nPrevious data for berry consumption had not been provided since 1995. The APVMA said 2017 approval for dimethoate products was \"based on the most recent evidence available at that point in time\".\n\n\n\n\n\nIn March, the updated consumption figures prompted the APVMA to initiate a review of dimethoate, which resulted in its decision to propose a suspension of \"certain dimethoate products\" for use on blueberries, raspberries and blackberries.\n\n\n\n\n\nThe APVMA said the residue is unlikely to cause issues for humans but has proposed the suspension as a precautionary measure.\n\n\n\n\n\nIt said it was satisfied that all other approved uses of dimethoate were safe.\n\n\n\nBenkendorff said she was \"alarmed\" about regulation of chemicals, especially with foods promoted as superfoods like berries.\n\n\n\n\n\n\"When you look at the maximum residue limits for a lot of pesticides set by the APVMA it's actually higher in berries than in other foods, and people's kids are eating punnets at a time, my colleagues are eating six punnets a week,\" she said.\n\n\n\n\n\nHer research detected low levels of Thiometon, a toxic insecticide that has been banned in Australia since 2001, in six of 11 blueberry samples, and all raspberry samples.\n\n\n\n\n\nBenkendorff suggested its presence was likely coming in as a contaminant in another product used on crops.\n\n\n\n\n\n\"When pesticides are first registered in Australia, the company has to provide a chemical analysis, but it's not independently tested,\" she said.\n\n\n\n\n\n\"If the industry wants to use pesticides, it should be demonstrating that food is clean or giving information on which pesticides are problematic.\n\n\n\n\n\n\"Any packaged food needs to be labelled with details of its chemicals and additives, but when it comes to our fresh food, there isn't any detail of what toxic chemicals might be in there.\"\n\n\n\nAre your blueberries safe?\n\nThe APVMA said its evidence supports the safety of Australian blueberries.\n\n\n\n\n\nWhen it comes to which fruits and vegetables have fewer pesticides than others, Australia lacks clear data. The United States' Environmental Working Group publishes its annual 'Dirty Dozen', listing the fruits and vegetables with the most pesticides.\n\n\n\n\n\nThe 2025 Dirty Dozen is crowned by spinach, followed by strawberries, kale, grapes and peaches. Blueberries are at number 11 on the list.\n\n\n\n\n\nTo help mitigate pesticide intake, Food Standards Australia New Zealand recommends washing or peeling produce, choosing organic or low-residue options, or varying your diet so that you're not consuming large quantities of the same chemicals.\n\n\n\n\n\nOrganic produce in Australia still contains pesticides, however the amounts Benkendorff found in her organic samples were significantly low.\n\n\n\nREAD MORE Rapid rise in Australians with allergies prompts inquiry\n\nWhile washing can remove some chemicals from fruit, it can't remove all. Benkendorff's tests were run on washed blueberries.\n\n\n\n\n\n\"Berries have a semi-permeable skin and the chemicals get in. Washing may help but I think it's important for the public to know my tests were done on washed berries,\" she said.\n\n\n\n\n\nA 2024 study published in the American Chemical Society's journal Nano Letters found the best way to \"effectively eliminate nearly all pesticide residues\" from produce was by peeling, instead of washing.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/cost-of-living-relief-the-new-charity-hub-in-sydneys-west-hoping-to-meet-growing-community-demand/pnfismj8y",
        "title": "Cost of living relief: the new charity hub in Sydney's west hoping to meet growing community demand",
        "publish_date": "Tue, 23 Sep 2025 09:45:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Cost of living relief: the new charity hub in Sydney's west hoping to meet growing community demand\n\nPublished 23 September 2025, 8:41 am\n\nCharities say they're struggling to keep up with increasing numbers of people in need. A first of its kind solution now aims to ease the pressure, by giving vulnerable Australians better access to essential, everyday items.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/eu-signs-off-on-major-trade-deal-with-indonesia/7978hz6vy",
        "title": "EU signs off on major trade deal with Indonesia",
        "publish_date": "Tue, 23 Sep 2025 09:43:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "EU signs off on major trade deal with Indonesia\n\nPublished 23 September 2025, 8:41 am\n\nEuropean Union representatives are in Bali, where they've just signed off on a major trade deal with Indonesia. The long-sought agreement will see tariffs removed on almost all goods traded between them. SBS International Correspondent Claudia Farhart is in Jakarta with the details.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/nvidias-huge-openai-deal-and-myers-profit-tumbles/snhqvpyxp",
        "title": "Nvidia's huge OpenAI deal, and Myer's profit tumbles",
        "publish_date": "Tue, 23 Sep 2025 08:02:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/trump-is-pushing-an-unproven-link-between-paracetamol-and-autism-what-does-the-science-say/e4xjw79sr",
        "title": "Trump is pushing an unproven link between paracetamol and autism. What does the science say?",
        "publish_date": "Tue, 23 Sep 2025 02:01:05 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Australian doctors and medical experts have pushed back against claims made by US President Donald Trump linking the use of popular over-the-counter pain medication Tylenol, also known as paracetamol, and the development of autism during pregnancy.\n\n\n\n\n\nParacetamol remains 'Pregnancy Category A' in Australia, meaning that it is considered safe for use in pregnancy. The most popular paracetamol brand name in Australia is Panadol.\n\n\n\n\n\nTrump used a White House event on Tuesday to announce that the US Food and Drug Administration (FDA) will tell doctors to advise pregnant American women against using Tylenol, known as acetaminophen, because of an increased risk of autism. He did not present evidence for the claim.\n\n\n\n\n\nTrump also suggested leucovorin, a form of folic acid, as a treatment for autism symptoms.\n\n\n\nUS President Donald Trump did not provide evidence during his White House announcement around paracetamol and autism links. Credit: Francis Chung/POOL/EPA \"Taking Tylenol is not good. I'll say it. Not good,\" he said. \"You shouldn't give the child a Tylenol every time he gets a shot,\" he added.\n\n\n\n\n\nExperts say there is no firm evidence of a link between the use of Tylenol — widely known as paracetamol outside the US — and autism. They say leucovorin, used to treat some cancer patients on chemotherapy, has shown some promise in very small trials, but that large, randomised trials are still needed.\n\n\n\nWhat is Tylenol?\n\nTylenol is an American brand of paracetamol and has the same main ingredient, acetaminophen. Tylenol is made by consumer health company Kenvue, which was spun off from Johnson & Johnson in 2023.\n\n\n\n\n\nKenvue said on Tuesday any claimed link between its product and autism was not based on science.\n\n\n\n\n\nParacetamol is one of the most common over-the-counter medicines in Australia and around the world.\n\n\n\n\n\nPregnant women in Australia are advised that they \"can use paracetamol to help with mild to moderate pain during pregnancy\", and this advice remains unchanged.\n\n\n\nParacetamol safe to use in pregnancy, TGA says\n\nIn a statement on Tuesday, the Therapeutic Goods Administration (TGA) said it was aware of the US administration's announcement, but rejected claims that the use of paracetamol in pregnancy posed a risk of the development of autism and ADHD in children.\n\n\n\n\n\n\"Robust scientific evidence shows no causal link between the use of paracetamol in pregnancy and autism or ADHD, with several large and reliable studies directly contradicting these claims,\" the medicines regulator said.\n\n\n\n\n\nHealth Minister Mark Butler had tasked the TGA with providing \"some very quick advice\" on the use of the active ingredient in Panadol and Tylenol during pregnancy in anticipation of Trump's announcement.\n\n\n\n\n\nThe TGA had earlier told SBS News in a statement: \"Paracetamol remains Pregnancy Category A in Australia, meaning that it is considered safe for use in pregnancy.\"\n\n\n\n\n\n\"The TGA has no current active safety investigations for paracetamol and autism, or paracetamol and neurodevelopmental disorders more broadly.\n\n\n\n\n\n\"When safety signals are identified for a medicine, they are subject to detailed clinical and scientific investigation to confirm that a safety issue exists, and if confirmed, what regulatory actions are most appropriate to mitigate the risk.\n\n\n\n\n\n\"The use of medications in pregnancy is subject to clinical, scientific and toxicological evaluation at the time of registration of a medicine in Australia.\n\n\n\n\n\n\"The TGA maintains robust post-market safety surveillance and pharmacovigilance processes for all medicines registered in Australia, including paracetamol. This includes detailed analysis of adverse event reports made by medicine consumers, clinicians and pharmaceutical companies, review of published medical literature, and close liaison with international medicines regulators.\"\n\n\n\nREAD MORE Thriving Kids: The plan to move children with autism and developmental delays off NDIS\n\nWhat evidence is there to link paracetamol with autism?\n\nA recent scientific review by researchers at Harvard University and the Icahn School of Medicine at Mount Sinai in New York explored the association between paracetamol and autism.\n\n\n\n\n\nAndrew Whitehouse, an autism researcher who is deputy director of the Kids Research Institute Australia, said researchers involved in that project reviewed all the studies in the area that have looked at whether taking paracetamol during pregnancy increases the likelihood that the offspring of that pregnancy has a neurodevelopmental condition such as autism or ADHD.\n\n\n\nAndrew Whitehouse says while some studies have proven an association between paracetamol taken during pregnancy and a slight increase in the chance of autism in offspring, causation has not been proven. Credit: . He said what had been found was \"nothing new\".\n\n\n\n\n\n\"What that study found, which is replicating previous systematic reviews in this area, is that taking paracetamol during pregnancy slightly, in a very, very small way, increases the chances that the offspring may receive a diagnosis of autism or ADHD,\" Whitehouse said.\n\n\n\n\n\n\"It's really important to put this in context. What they identified is about a 20 per cent increased likelihood above the population rate — so, in relation to autism, this means that the rate goes from the chances an offspring might have a diagnosis of autism from 1 per cent up to 1.2 per cent.\"\n\n\n\n\n\nAn association does not necessarily mean one thing has caused the other, so more research would be needed to prove what the 0.2 per cent increase was caused by.\n\n\n\n\n\nWhitehouse said there was potential that the reasons women were taking paracetamol in the first place led to the slightly increased prevalence of autism in the children of those women.\n\n\n\n\n\n\"People take paracetamol during pregnancy because they might have a fever, or they might have pain. What we do know is that a fever or other illness during pregnancy in and of itself, particularly a severe fever, can increase the likelihood of offspring having neurodevelopmental differences, and it's extremely hard to disentangle this through the study,\" he said.\n\n\n\n\n\nA major 2024 Swedish study found no association between use of paracetamol in pregnancy and risk of autism, ADHD or intellectual disability.\n\n\n\n\n\nThe study looked at nearly 2.5 million children born in the country between 1995 and 2019, with nearly 186,000 children exposed to paracetamol in pregnancy.\n\n\n\n\n\n\"[The study] found that when researchers compared siblings (a method to control for genetic and environmental factors) any apparent links between acetaminophen and autism disappeared,\" Dr Hannah Kirk, a senior lecturer in the Turner Institute for Brain and Mental Health at Monash University, said.\n\n\n\n\n\n\"This suggests that other factors such as genetic or underlying maternal health conditions may better explain the findings.\"\n\n\n\n\n\nOn Tuesday, the TGA said articles suggesting an association between maternal paracetamol use and childhood autism had \"methodological limitations\".\n\n\n\n\n\n\"More recent and robust studies have refuted these claims, supporting the weight of other scientific evidence that does not support a causal link between paracetamol and autism or ADHD,\" it said.\n\n\n\nWhat is known to cause autism?\n\nIdentifying the root of autism — a complex condition connected to brain development that many experts believe occurs for predominantly genetic reasons — has been a pet cause of Trump's health chief, Robert F Kennedy Jr.\n\n\n\n\n\nKennedy has for decades spread debunked claims that vaccines cause autism.\n\n\n\n\n\nKirk said there was no known single cause of autism.\n\n\n\n\n\n\"However, research shows that genetics play a large role, with hundreds of genes being linked to autism,\" she said.\n\n\n\nAutism is a neurodevelopmental condition that can affect a person's communication, sensory sensitivity and social interactions and may present in obsessive interests or repetitive behaviours. Source: Getty / dragana991\n\nTrump administration's suggestion\n\nThe Trump administration also suggested leucovorin, a form of folic acid, as a treatment for autism symptoms.\n\n\n\n\n\nThe FDA approved a version of the drug made by GSK, which it had previously withdrawn for a condition it associated with autism.\n\n\n\n\n\nThe FDA, in its approval, cited a review of the use of leucovorin in 40 patients with a rare metabolic disorder called cerebral folate deficiency that can lead to a range of neurological symptoms, some of which are seen in people with autism.\n\n\n\nREAD MORE Pathological demand avoidance: The autism profile growing in recognition\n\nWhitehouse from the Kids Research Institute said there was no evidence that leucovorin could treat autism.\n\n\n\n\n\nLeucovorin acts in the same way as folic acid does in the body and is used as an antidote to the harmful effects of cancer medicine.\n\n\n\n\n\n\"It is so preliminary to identify any kind of biological agent as an intervention for autism, and it is highly misleading to say otherwise,\" he said.\n\n\n\n\n\n\"There have been a small number of very small studies that have investigated this as a potential biological intervention for autism.\n\n\n\n\n\n\"It doesn't meet any threshold of any kind of standard level of science to indicate that this should be used other than for further research.\"\n\n\n\n'Nothing burger': Calls for more funding and research\n\nNicole Rogerson, director and CEO of Autism Awareness Australia, said many in the autism space had viewed the US plan to find \"the cause\" of autism in a number of months perplexing, given decades of research had failed to do so.\n\n\n\n\n\nBefore the Trump administration's expected announcement, Rogerson told SBS News: \"If the special secret sauce is a tenuous link to pregnant women taking Tylenol, it will be absolutely what it is and a nothing burger.\"\n\n\n\n\n\nShe said such an announcement just added \"a lot of poor science into an area that actually does need a lot more research, it does need a lot more focus\".\n\n\n\nNicole Rogerson from Autism Awareness Australia says more research needs to be done into autism in Australia. Source: Supplied \"Autism research in Australia is chronically underfunded and even worse when we look at research around those with profound autism, which make up 25 per cent of the autism community in Australia,\" she said.\n\n\n\n'Inherently sexist'\n\nWhitehouse said it was disappointing that autism was being used as a \"plaything for culture wars\".\n\n\n\n\n\n\"Kids who are struggling in their day-to-day environment, families who are struggling to support the person they love more than anything in the world and here we are wasting precious attention, energy and effort, focusing on things that will not make a single difference in their lives,\" he said.\n\n\n\n\n\nDavid Tonge is the chief executive of Amaze, the peak body for people with autism and their supporters.\n\n\n\nThe head of Amaze, David Tong, says the debate around taking paracetamol in pregnancy and autism rates was not helpful. Source: Supplied Tonge said any attempt to link a complex neurodevelopmental disability like autism to a single potential factor was both short-sighted and sexist.\n\n\n\n\n\n\"The framing of this, from a behavioural perspective, is inherently sexist as it ties decisions of a mother to the potential disability of her child,\" he said.\n\n\n\n\n\n\"This is an insidious line of discussion that is hurtful to mums.\"\n\n\n\n\n\n— With additional reporting by Reuters\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/albanese-uses-un-speech-to-call-on-israel-to-accept-responsibility-over-gaza-catastrophe/8v5qcvckp",
        "title": "Albanese uses UN speech to call on Israel to 'accept responsibility' over Gaza 'catastrophe'",
        "publish_date": "Mon, 22 Sep 2025 21:55:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prime Minister Anthony Albanese has defended Australia's stance on Palestinian statehood recognition in an address at the United Nations General Assembly, using his speech to compare the plight of Palestinians to that of the Jews before the creation of Israel.\n\n\n\n\n\nThe address at the high-level two-state solution session in the UN came a day after his government officially recognised the State of Palestine.\n\n\n\n\n\n\"In recognising Palestine, Australia recognises the legitimate and long-held aspirations of the Palestinian people,\" Albanese said. \"It means real hope for a place they can call home. This is the same hope that sustained generations of Jewish people.\"\n\n\n\n\n\nAlbanese described the October 7 Hamas attacks in 2023 as \"horrific\" and called for the return of hostages.\n\n\n\n\"We stand with Jewish people around the world, who feel the cold shadow of history's darkest chapter in any act of antisemitism,\" Albanese said.\n\n\n\nPM calls for Israel to accept responsibility over 'humanitarian catastrophe'\n\nIn his speech, Albanese urged the Israeli government to \"accept its share of responsibility\" for the \"humanitarian catastrophe\" in Gaza.\n\n\n\n\n\nHe said Australia has added its voice to global calls for a ceasefire and defended his cabinet's decision to independently endorse the government's recognition of a Palestinian state, which came into effect on Sunday.\n\n\n\n\n\nA swathe of countries are using this session of the UN General Assembly to recognise a Palestinian state, including Australia, the United Kingdom, Canada, France, Portugal, Malta and Andorra.\n\n\n\n\n\nRoughly 150 of the UN's member states, or more than three-quarters, now recognise its statehood.\n\n\n\n\n\n\" Right now, Gaza is in the grip of a humanitarian catastrophe. And for this, the Israeli government must accept its share of responsibility,\" Albanese said.\n\n\n\n\"The international community's vision for a just and lasting peace in the Middle East always encompassed two states. A state of Israel and a state of Palestine. Living side by side, within internationally recognised borders. And recognising each other's right to live in peace and security,\" Albanese said.\n\n\n\n\n\nThe government says its decision to recognise Palestinian statehood is conditional on Hamas having no role in the future state and is based on assurances from the Palestinian Authority that it will demilitarise, hold democratic elections and reform governance, finance and education.\n\n\n\nLey vows to reverse recognition during call with Israeli minister\n\nOpposition leader Sussan Ley spoke to Israeli foreign minister Gideon Sa'ar on Tuesday night, vowing to reverse the recognition of a Palestinian state if her party came to power.\n\n\n\n\n\n\"I expressed our appreciation for her position opposing the government of Australia's recent decision and for her announcement that, should there be a change of government in Australia, this decision would be reversed,\" Sa'ar posted to X following the call.\n\n\n\n\n\n\"I stressed that Israel is well aware of the many friends it has in Australia and distinguishes between the government and the people of Australia.\"\n\n\n\nREAD MORE Albanese excluded from Trump's UN schedule as France recognises State of Palestine\n\nLey reiterated the Coalition's position in a letter to US Republicans — who had issued a warning to Australia and other nations of punitive measures for recognising Palestinian statehood.\n\n\n\n\n\n\"I write to reassure you, and the Congress, that this decision taken at this time by the Labor Government does not enjoy bipartisan support here in Australia,\" Ley wrote, adding that she would make the United States her first overseas visit as Opposition leader, later this year.\n\n\n\nUS opposed to push for statehood\n\nUS President Donald Trump is vehemently opposed to the international push for statehood, joined by Australia, the UK, Canada, France and multiple other countries this week.\n\n\n\n\n\n\"[Trump] feels this does not do anything to release the hostages, which is the primary goal right now in Gaza. It does nothing to end this conflict and bring this war to a close,\" White House press secretary Karoline Leavitt told reporters at the UN briefing.\n\n\n\n\n\n\"And frankly, he believes it is a reward to Hamas. He believes these decisions is just more talk and not enough action from some of our friends and allies.\"\n\n\n\nAustralia faces pushback from 25 US Republicans who suggest \"punitive measures\" could be imposed on countries that recognise a Palestinian state.\n\n\n\n\n\nThe grouping of hardline Israel supporters, including former presidential candidate Ted Cruz, says the countries choosing to recognise a Palestinian state now are \"rewarding terrorism\".\n\n\n\n\n\n— With additional reporting by the Australian Associated Press\n\n\n\n\n\nThis is a developing story and this article will be updated.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/experts-question-the-benefits-of-taking-supplements-and-vitamins-20250924-p5mxkm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Experts question the benefits of taking supplements and vitamins",
        "publish_date": "Wed, 24 Sep 2025 11:47:19 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Experts question the benefits of taking supplements and vitamins\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-cheeky-two-metre-wall-standing-in-the-way-of-afl-s-most-lethal-attack-20250922-p5mx2h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The ‘cheeky’ two-metre wall standing in the way of AFL’s most lethal attack",
        "publish_date": "Wed, 24 Sep 2025 11:47:02 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size There is a “cheeky” side to Harris Andrews the public rarely see, a personality unlikely to be on show when he takes on his greatest challenge of the season: thwarting the AFL’s most lethal attack. The three-time All Australian’s knowledge of when to flick the switch is his key to thriving again in the grand final furnace, teammate Darcy Gardiner believes. “He’s very impressive, very professional, very meticulous about how he does things. He gives you such confidence out there when you’re in a bit of trouble, you know he’s usually going to be coming across to help,” Gardiner says. “[But] there’s definitely that other side of him when we let the hair down and have a few beers. He can be quite funny and cheeky and a bit of a larrikin. “He had a great time at my wedding, I won’t go into detail.” Harris Andrews, Logan Morris, Kai Lohmann with coach Chris Fagan after beating Collingwood in the prelim. Credit: AFL Photos via Getty Images Come Saturday afternoon’s grand final, the Lions co-captain will face a Geelong outfit that has scored more points than any other in 2025.\n\nAdvertisement\n\nSpearheaded by Coleman Medal winner Jeremy Cameron, the Cats have been destructive against rival backlines. But Andrews is a different animal. Loading For one, he will be seeking retribution for the club’s humbling against the same foe three weeks ago. For another, the 28-year-old fullback is coming off a defensive masterclass against Collingwood en route to a third-straight decider. The Magpies’ early pressure game kept the Sherrin pinned deep inside Brisbane territory for the opening five minutes. Yet despite 13 first quarter inside 50s, Collingwood had only seven points to show for it. Collingwood rallied emphatically to hit the front by the major break, but once the Lions began to dominate the clearance battle, their attack lost potency.\n\nAdvertisement\n\nWhen they did probe forward, Andrews was a constant presence. His 13 marks included five intercepts, before finding halfbacks Dayne Zorko, Jaspa Fletcher and Darcy Wilmot to facilitate service down field. Jaspa Fletcher has credited Harris Andrews for accelerating his own move to the backline. Credit: Getty Images “He’s been massive for us, especially in the finals he’s really hitting his straps, and it’s good to see him in the blazer again this year,” Fletcher told this masthead, referring to Andrews’ third All Australian selection. Loading “It makes it a lot easier to get on the offence knowing you’ve got such a great intercept marker and such a big body down the line. Any time he goes near it, he’s going to either spoil it or hang onto it. “He’s been huge for us and for me in helping me build my game as a defender. I haven’t played too much footy as a defender, so to have that help positioning-wise has been huge for me.”\n\nAdvertisement\n\nThe Andrews-Cameron clash will be pivotal at the MCG, with the pair sharing history dating back to 2018. Geelong’s goal-scoring wizard was playing for the Giants at the time, and copped a five-game suspension for a striking incident when he lashed out with his elbow and left Brisbane’s key defender with a small brain bleed. Andrews, 21 at the time, was left with blood gushing from his mouth, and while he missed a month of football, later stressed he harboured no grudge towards Cameron. No man has claimed more marks inside 50 than Cameron in 2025 (79). Yet, Andrews’ read of the contest has made him one of the most prolific intercept markers in the game – his 194 trailing only Adelaide duo Mark Keane (195) and Josh Worrell (201). When the Lions were thwarted by the Cats three weeks ago, Ryan Lester was initially tasked with pinning Cameron down, before Gardiner was moved onto him after Geelong blew out to a healthy lead. The following week, Gardiner was given an early lesson by Suns giant Ben King, before Andrews was relocated to stifle the Gold Coast sensation.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/why-craig-fitzgibbon-is-sharks-best-signing-of-the-past-five-years-20250923-p5mxdi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Craig Fitzgibbon is Sharks’ best signing of the past five years",
        "publish_date": "Wed, 24 Sep 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "When it comes to Cronulla’s best signing of the last five years, it’s difficult to go past coach Craig Fitzgibbon.\n\nProp Addin Fonua-Blake has added some mongrel and leadership to the pack, while star halfback Nicho Hynes is one of the most marketable players in the game. But has anyone done more for the club than Fitzgibbon, who has quietly steered the Sharks into the finals in each of the four years since becoming head coach?\n\nFriday night’s clash against Melbourne will be his second straight preliminary final. He also made it to the semi-finals in 2022, and an elimination final in 2023.\n\nFitzgibbon has overseen 104 games for 66 wins at a win percentage of 63.5, including eight finals matches.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/liverpool-star-sent-off-for-needless-and-stupid-goal-celebration-20250924-p5mxie.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Liverpool star sent off for ‘needless and stupid’ goal celebration",
        "publish_date": "Wed, 24 Sep 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Football, as Johan Cruyff once said, is a game you play with your brain. You can try to play without it – but as Hugo Ekitike found out on Wednesday morning (AEST), that will only get you so far.\n\nEkitike’s brain was either malfunctioning or missing entirely when he came off the bench for Liverpool at half-time of their Carabao Cup tie against Southampton, when he replaced Alexander Isak, his direct positional rival, who had scored just before the break.\n\nEkitike, 23, has it all: size, speed, strength, vision and technique. But he has some serious work to do between the ears.\n\nEight minutes after coming on, the lanky Frenchman was yellow-carded for dissent after throwing the ball away in frustration at a decision by the referee. That left him walking a disciplinary tightrope for the remainder of the match.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-albanese-and-trump-to-meet-next-month-at-white-house-trump-stuns-un-with-address-on-disaster-of-immigration-and-con-job-of-climate-change-20250924-p5mxgg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Albanese and Trump to meet next month at White House; Trump stuns UN with address on ‘disaster’ of immigration and ‘con job’ of climate change",
        "publish_date": "Wed, 24 Sep 2025 11:44:01 +1000",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Monthly inflation has lifted to 3 per cent, its highest level in a year, as subsidies to keep a lid on electricity prices came to an end.\n\nThe Australian Bureau of Statistics said although electricity prices fell by 6.3 per cent in August, over the past year they have lifted by 24.6 per cent.\n\n“’The annual rise in electricity costs is primarily related to households in Queensland, Western Australia and Tasmania having higher out-of-pocket costs in August 2025 than they did in August 2024,” the bureau’s head of price statistics, Michelle Marquardt, said.\n\nThe 3 per cent rate is the highest since July last year. It had been 2.8 per cent last month.\n\nWhile the 3 per cent headline rate is at the top of the Reserve Bank’s target range, the bank focuses more heavily on underlying inflation and the quarterly inflation report.\n\nUnderlying inflation at the monthly level eased from 2.7 per cent to 2.6 per cent.\n\nRents, which have been one of the driving forces of inflation over the past two years, continue to ease, with inflation in this area easing to 3.7 per cent, its lowest level since November 2022.\n\nThe RBA’s monetary policy committee meets next week but markets are not expecting interest rates – which have been sliced three times this year – to be lowered until at least November.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-racq-accused-of-misleading-customers-over-price-hikes-20250923-p5mx9y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: RACQ accused of ‘misleading’ customers over price hikes; Public to get first sneak peek of new Adelaide Street tunnel; Does Brisbane need a larger rectangular stadium?",
        "publish_date": "Wed, 24 Sep 2025 11:41:32 +1000",
        "category": "finance",
        "authors": [],
        "text": "International tourism has hit a new high in Queensland, federal government data reveals, with more visitors spending hundreds of millions more in the Sunshine State.\n\nThe Tourism Research Australia figures show international spending in Queensland climbed 10.6 per cent above the previous year’s record high of $6.9 billion, in the year to June.\n\nSome 2.2 million international tourists touched down – an increase of 2.7 per cent.\n\nSurfers Paradise on the Gold Coast, where international tourists spent $1.5 billion last financial year. Credit: Education Images/Universal Images Group via Getty Images\n\nThey spent the most money on the Gold Coast ($1.5 billion) and in the state’s tropical north ($1.2 billion).\n\nNew Zealanders made up the largest cohort of visitors, but more tourists also arrived from India, France and Taiwan.\n\nQueensland remains the third-largest market behind NSW and Victoria.\n\nTourism Minister Andrew Powell suggested the results were a sign his government’s 20-year tourism plan, dubbed “Destination 2045” and released in June, was “gaining momentum”.\n\n“Queensland is the home of the holiday, and our visitor economy is clear proof of that on the global stage,” Powell said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/cats-tragic-books-last-minute-flight-from-amsterdam-for-grand-final-20250922-p5mwx5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Has been awesome’: Nathan’s AFL hunch paid off in cheaper grand final flights",
        "publish_date": "Wed, 24 Sep 2025 11:36:30 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "Footy fans are flying into Melbourne from interstate and beyond ahead of Saturday’s AFL grand final, with some travelling from as far away as Europe.\n\nGeelong play the Brisbane Lions in Saturday’s decider, when the Lions make their third successive grand final appearance. Some supporters have benefited by booking well before knowing for certain who would play at the MCG.\n\nBrisbane-based Nathan Christensen, wife Jessica and their daughter will be in Melbourne for the grand final.\n\nBrisbane-based Nathan Christensen, wife Jessica and their two-year-old daughter will fly to Melbourne with Virgin on Friday night.\n\nChristensen, who has a background in science and maths, said he calculated the odds of the Lions’ success this year based on draft picks before booking $300 flights in August.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/more-than-a-game-singer-chris-doheny-remembered-by-mcguire-20250924-p5mxkf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'More Than a Game' singer Chris Doheny remembered by McGuire",
        "publish_date": "Wed, 24 Sep 2025 11:34:14 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "'More Than a Game' singer Chris Doheny remembered by McGuire\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/jorgensen-primed-for-bledisloe-debut-20250924-p5mxke.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jorgensen primed for Bledisloe debut",
        "publish_date": "Wed, 24 Sep 2025 11:34:04 +1000",
        "category": "finance",
        "authors": [],
        "text": "Jorgensen primed for Bledisloe debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/really-nice-brisbane-gives-verdict-on-new-adelaide-street-tunnel-20250924-p5mxj8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Really nice’: Brisbane gives verdict on new Adelaide Street tunnel",
        "publish_date": "Wed, 24 Sep 2025 11:33:20 +1000",
        "category": "finance",
        "authors": [
            "William Davis",
            "Neesha Sinnya"
        ],
        "text": "Thousands of people have poured through the new Adelaide Street tunnel beneath Brisbane’s CBD for a community open day, five days before it officially takes its first bus and metro traffic.\n\nGavin, who took his family along, described it as “a really nice tunnel”.\n\n“I think the electrical installation is probably the best in the world,” he quipped, adding that he was the project manager who had worked on it.\n\nGavin and his family explore the Adelaide Street tunnel by foot. Credit: William Davis\n\nFather and son Richard and Jorge Pfuhl also went to the open day, with Jorge quizzing engineers about how the tunnel would cope with fires.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/channel-seven-splashes-12-million-for-rugby-league-world-cup-20250924-p5mxhy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Channel Seven splashes $12 million for Rugby League World Cup",
        "publish_date": "Wed, 24 Sep 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "Channel Seven will fork out close to $12 million to secure the exclusive rights to the Rugby League World Cup in Australia in 2026.\n\nWith the NRL set to begin negotiations for the sport’s next broadcast cycle in the coming months, Channel Seven has signalled its intention to be at the table by committing itself to the largest broadcast deal in international rugby league history.\n\nThe NRL has been in negotiations with broadcasters for months and Seven West Media has picked up the rights to the tournament despite interest from DAZN and Nine Entertainment Co, the publisher of this masthead.\n\nSources with knowledge of the situation talking on the condition of anonymity due to confidentiality said Nine were not willing to pay such a high fee for the rights in the off-season and preferred to save its money for when it heads to the negotiating table for the NRL and State of Origin rights from 2028.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/western-australia/insurance-giant-signs-on-as-inaugural-sponsor-of-perth-bears-20250924-p5mxjm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Insurance giant signs on as inaugural sponsor of Perth Bears",
        "publish_date": "Wed, 24 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Hamish Hastie"
        ],
        "text": "Insurance giant Budget Direct has signed on as the Perth Bears sleeves partner, marking the NRL club’s first major commercial deal.\n\nThe sponsorship is thought to be worth more than $1 million annually, making it the most lucrative sleeves deal in the league at nearly twice the typical price.\n\nPerth Bears chief executive Anthony De Ceglie. Credit: Stefan Gosatti\n\nPerth Bears chief executive Anthony De Ceglie said the record-breaking deal pointed to the club becoming one of the most commercially successful in the league.\n\n“The Perth Bears are a rare and special club – unlike anything else in the country – that allows brands the chance to have a monopoly on the NRL in Western Australia while also having a second home and supporter base in the bustling North Shore of Sydney,” he said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/england-make-shock-pick-as-ashes-squad-announced-20250924-p5mxi2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This England Ashes squad will light up Australia – or go down in flames",
        "publish_date": "Wed, 24 Sep 2025 11:21:03 +1000",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "This is an England Ashes squad that has the capacity to blow Australia away – or go down in a flaming heap itself.\n\nWhatever happens, the 16-man touring party led by Ben Stokes and Brendon McCullum has not been devised to surrender meekly, as each of the past three England teams in Australia have done.\n\nMost importantly, if at this stage only on paper, Stokes will have the fast bowling firepower to trouble the hosts.\n\nJofra Archer in the third Test match between England and India at Lord’s earlier this month. Credit: Getty Images\n\nMark Wood was England’s outstanding bowler on the last trip in 2021-22, and also turned the 2023 series from a likely Australian victory to a 2-2 draw. This time, Wood will have the assistance of Jofra Archer, after a multi-year plan to nurse the whippy fast man back to full bowling health with this assignment in mind.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/jorgensen-to-debut-at-fullback-as-more-injury-chaos-hits-wallabies-20250924-p5mxit.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jorgensen to debut at fullback as more injury chaos hits Wallabies",
        "publish_date": "Wed, 24 Sep 2025 11:14:22 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Max Jorgensen will make his debut at fullback against the All Blacks after more injury drama in the Wallabies camp, with in-form veteran Andrew Kellaway ruled out of the opening Bledisloe Cup clash with a calf strain.\n\nKellaway’s injury was announced by the Wallabies as it also emerged James O’Connor is set to start at five-eighth, less than a week after flying back from England on the understanding he wasn’t needed for the first Test against New Zealand in Auckland.\n\nThe Wallabies backline for the Eden Park clash on Saturday is set to have a new look from the last Test against Argentina in Sydney.\n\nHaving replaced Tom Wright at fullback, Kellaway was outstanding in the two Tests against the Pumas but picked up a calf strain at training and was ruled out.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/penrith-broke-broncos-hearts-but-a-shock-mam-ploy-can-redeem-finals-fall-20250923-p5mxal.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Penrith broke Broncos’ hearts, but a shock Mam ploy can redeem finals fall",
        "publish_date": "Wed, 24 Sep 2025 11:00:15 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "Broncos leaders Kotoni Staggs and Ben Hunt believe the shock decision to deploy Ezra Mam off the bench can inflict the same heartbreak upon the Panthers as the southern club dealt Brisbane two years ago.\n\nThis is a stage Mam knows well, having come within two minutes of clinching a Clive Churchill Medal on the back of his grand final hat-trick in 2023, before Penrith’s Nathan Cleary orchestrated a 16-point comeback.\n\nThis has also been a season fraught with turmoil for the Brisbane five-eighth, who was suspended for the opening nine weeks after being charged with driving without a licence and with drugs in his system.\n\nEzra Mam will come off the bench in the Broncos’ preliminary final clash with Penrith at Suncorp Stadium on Sunday. Credit: Getty Images\n\nHis NRL comeback started emphatically – he scored five tries while coming up with 10 try assists and 10 linebreak assists from as many games – before he suffered a hamstring injury in round 23 against the Melbourne Storm.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/hatton-details-hilarious-ryder-cup-celebrations-20250911-p5mu5w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hatton details hilarious Ryder Cup celebrations",
        "publish_date": "Wed, 24 Sep 2025 10:53:09 +1000",
        "category": "sports",
        "authors": [],
        "text": "Hatton details hilarious Ryder Cup celebrations\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://ca.news.yahoo.com/steal-deal-hockey-world-reacts-170941934.html",
        "title": "'Steal of a deal': Hockey world reacts as Oilers sign power forward for 3 years",
        "publish_date": "2025-09-23T17:09:41Z",
        "category": "sports",
        "authors": [],
        "text": "This in from the Edmonton Oilers, news that they have signed 24-year-old power forward Vasily Podkolzin to a three year deal at $2.95 million per.\n\nThe reaction from hockey world was as fast and furious as Podzilla on the forecheck, with the Cult’s Kurt Leavin’s post a story here, and heated reaction on-line.\n\nOilers podcaster Karman Gill @Kgill39\n\nSteal of a deal.\n\nOilers hockey writer for the Daily Hive Preston Hodgkinson @NHLHodgkinson\n\nOilers REALLY love what Podkolzin brings to the team… and it’s no secret that Draisaitl loves playing with him. The Russian is a helluva forechecker, and it’s obvious there is more offensive talent than what the stats show. Don’t mind this at all.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOilers fan Bone @bonejrp\n\nDon’t hate it. Don’t love it. Could be a steal if he gets some offense figured out, but a bit of an anchor if not. But not such a big anchor to hurt the team big time in light of cap increases.\n\nCanucks fan Troy @MrTRoyJenkins\n\nMakes you wonder if he could of found a role with the team that drafted him, if it wasn’t for the old coaches system!\n\nWhat Chaos podcaster DJ Bean @DJ_Bean\n\nLove this. Think he could score 20 this season.\n\nCanucks fan Matt Pisko @MattPisko\n\nYou could have signed Holloway (who is a better player) for less.\n\nOilers Now host Bob Stauffer @Bob_Stauffer\n\nVasily had an impressive 1st season with the Edmonton Oilers. Respected by his teammates for his relentless work ethic. Led Oilers in hits last season (211). Middle-six forward who continues to work at his game and should add more offence in the future.\n\npodz\n\nLeafs fan EveryDayLeafs @thatssoleafy77\n\nI mean he has to take a step offensively for this to be a good signing. Average deal don’t hate it but don’t like it either.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOilers fan Node Newb @NodeNewb21\n\nI’ll take what he brings over J. Skinner and Arvidsson but feels like a slight overpay.\n\nOilers commentator and Inside Sports host Brenden Escott @BrendenEscott\n\nCan play up and down the lineup, brings some grit and Leon speaks glowingly of him. Could add some more finish to his game to really make this contract worth every penny.\n\nCult of Hockey contributor Ira Cooper OriginalPouzar @coopsie39\n\nWas hoping to keep the AAV around $2.5MM (for as many years as he’s willing to give) but Stauff said it wasn’t’ coming in < $3M.Had arb rights this year and 30 points gets > than $3MM in arb.Would have liked more terms but we’ve got him here for 4 years and he’ll be a good player.\n\nEdmonton hockey write Jackie Bondurant 🇨🇦 @JackieBee_16\n\nPODDDZILLLLAAA 🦖 I’m totally good with this deal\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOilers fan Jerry T @JerryTurin\n\nJust what McD was waiting to see before confirming with the Oilers!\n\nNashville Predator beat reporter for the Tennessean Alex Daugherty @AlexDaugherty1\n\nPodkolzin, 24, scored 8 goals and 16 assists in 82 games last year. Just got $2.95 million AAV. (Preds restricted free agent) Evangelista, 23, scored 10 goals and 22 assists in 68 games last year. About to get ????\n\nNational Sports Editor at the Daily Hive, Rob Williams @RobTheHockeyGuy\n\nOilers really love Podkolzin. I get why… but also he scored 8 goals last season, while playing a ton on Draisaitl’s line… I like Podkolzin. Hope he succeeds. But he’s 24 now. Tick tock.\n\nVancouver sports podcaster JABO Vancouver @jabo_vancouver\n\nHate the team, happy for the guy. No bad words for Podz. I wish him the best.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOilers fan Barry Kachur @Tehbigbear8\n\n3 more years of The Podfather! Solid deal for both sides.\n\nOilers fan Joey @_TheIronCowboy\n\nDraisaitl gets his man back and the Oilers obviously feel he has more offence to give yet.\n\nOilers fan Brad Lauder @OILfanincowtown\n\nThis is the way…. Podzy is a beast\n\nOilers fan Joe Hutzal @JoeHutzal\n\nOh boy. I believed the Oilers got a bargain getting Podkolzin in the first place and honestly felt he was as good of a prospect as Holloway…. With this deal he better be!\n\nOilers fan Bendro @Bouchslapper\n\nGreat deal wish they got more term but that’s would of been stupidly expensive\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOilers fan TylerDT @qauckenbush17\n\nALL THE PODKOLZIN JERSEYS.\n\nSide bar, I’m especially excited about this one, I said he’d be a positive factor from the minute they made the trade, I double downed and bought a jersey that day, f*cking amped for this guy to continue to grow with us, work ethic is unmatched. YES.\n\nOilers fan Mathew Panchyshyn @mathewjdp\n\nThe 24 y/o Russian is a sublime two-way player that is only missing finishing ability. 59% xG share is sure to go places and for 2.95m, it’s bringing Edm to better places.\n\nGreat contract 👏\n\nOilers Nation writer Sid 🇨🇦 @NHL_Sid\n\nLove this deal. Podkolzin was a very strong complementary winger for Draisaitl last season, and I hope the two continue to play together.\n\nOilers fan Finn 🇨🇦 @oilersjayscan\n\nLoved his work ethic last year, and I have no doubt he’s going to continue to work hard here! This is a person that wants to be here, great move by Bowman and co. Glad to have you sticking around for the next few years, Vasily!!! Hopefully McDavid is next now🤞\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOilers fan Madi@Madi39\n\nLove this deal. I wasn’t the biggest podz fan but he grew on me. Great value for him as this cap rises massively the next 3 years. Just need Walman next\n\nOilers fan Randy @hemigod1\n\nCongratulations Podz! Looking forward to an additional 3 seasons of you destroying defencemen\n\nOilers fan Rob Suggitt @30G30N\n\n#92 signed. Now do #97.\n\nOilers fan Davis Riar @DavisRiar\n\nPodkolzin got that dawg in him. Helluva signing\n\nOilers fan Mac-T Fan Club @Wade87847973\n\nI don’t see obvious potential for offensive numbers to spike. But he’s an absolute tank of a player who will provide value battling for pucks/providing depth minutes. I think 2.9 is around the going rate for a blood & guts guy nowadays…so…is what it is.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOilers fan Scott Kaufmann @ScottKaufmann7\n\nI think if he put a few more pucks in the net that it could be excellent value. B+\n\nOilers fan Jarod Okemow @okemow_jarod\n\n450k too much but it’s ok.. McDavid will take less ..AGAIN\n\nOilers fan Jake @OilAcumen\n\nToo much money IMO. Player goes from a value deal to an overpay at that number, even with a rising cap.\n\nMy take\n\nA year ago we couldn’t spell his name. Now he’s something of a folk hero in Edmonton.\n\nI’m good with this deal, even as Podkolzin didn’t score much last season. The deal presents a risk, but it’s a solid bet on a useful player who has already proven he can make an impact as a second or third line winger.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhy get fired up about Edmonton signing such a player? As wrote earlier this summer in assessing Podkolzin, he brings many qualities that the Oilers need, namely youth, hitting, durability, hitting, hard work, more hitting, dedication, and even more hitting.\n\nSuch is his prowess at the physical game, which includes the ability to win pucks through aggressive forechecking and backchecking, that Draisaitl was reportedly satisfied to play with him through the year, which is no small accomplishment.\n\nIf we rank NHL forwards by their rates of goal scoring, assisting on goals and hitting at even strength for the 2024 and 2025 playoff season, giving equal weight to each of the three categories, Podkolzin ranks as the top forward in the NHL.\n\nNHL power forwards 5-on-5 play 2024 and 2025 playoffs, minimum 10 games played, 177 qualifying forwards\n\nHe made the most of limited ice-time, just 10.1 minutes per game at 5-on-5. He found a way to help out on scoring players while delivering 25.6 hits per 60 at 5-on-5, the fifth highest of any forward in the last two playoff years.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOf course this is a small sample size, and if we do a similar ranking for the entire 2024-25 regular season, Podkolzin ranks just 246th out of all regular NHL fowards due to his unexceptional goals and assists rates.\n\nBut we can see that if he can just pick up his offensive game a bit, he’ll be a very useful power forward for years to come, one that can hold his own in a Top 9 slot, if not playing in the Top 6.\n\nMore evidence of Podkolzin’s worth? At the Cult of Hockey video review project, we track hard plays that Oilers players make on Grade A shots, the goalie screens, hard charges, battles won, tips and jams that lead to Grade A shots and goals.\n\nIn the regular season, Podkolzin was the second best Oiler — after the superlative Zach Hyman — at executing such hard plays to create dangerous shots on net.\n\nIn 82 games, Podkolzin executed eight goalie screens, seven tip shots, 14 jam shots, five hard charges or drives on net, and won 31 battles leading to Grade A shots, 65 hard plays on Grade A shots in total, 0.79 per game, behind Hyman at 1.64 per game and just ahead of the increasingly frisky and mean Ryan Nugent-Hopkins at 0.78 per game.\n\nIn the playoffs this year, Podkolzin’s rate of hard plays at the net on Grade A shots dropped off to 11 in 22 games, just 0.50 per games, but he also get less ice time and less opportunity with Draisaitl.\n\nIn the playoffs, Corey Perry went beast-mode, as did RNH, both of them increasing their rates of such hard plays from the regular season, but Perry is gone now, off to Los Angeles, as is Evander Kane, a true hard man of hockey, but now a Vancouver Canuck.\n\nThe grit and ferocity of both Kane and Perry will be missed.\n\nOne hopes that Trent Frederic, who was pretty much a non-factor in the 2025 playoffs when it came to making hard plays to create Grade A shots (just three in 22 games) will be much, much, much better this coming season with improved fitness and health. Frederic will be counted on to bring much of what Edmonton lost with Perry and Kane departing.\n\nBut Podkolzin will also be a key for Edmonton this coming year.\n\nIs there risk in such a deal? Yes.\n\nMaybe the extra point scoring never materializes and he can’t cut it on a skill line over time.\n\nMaybe you’re stuck paying more over the long term for a bottom line player. There is risk here, but I’m comfortable enough with Podzilla’s game to endorse this move.\n\nEdmonton is short on what he brings. What he brings can help win Stanley Cups.",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/blue-jays-waiting-best-version-212824857.html",
        "title": "Blue Jays hoping for 'best version' of Anthony Santander while parting ways with Alek Manoah",
        "publish_date": "2025-09-23T21:28:24Z",
        "category": "sports",
        "authors": [],
        "text": "In there was any shot of Anthony Santander being a part of the Blue Jays’ post-season plans, it was beginning to feel like more of a long shot of even getting into game action this week.\n\nUntil it wasn’t.\n\nAnd Alek Manoah’s return to the big leagues with Toronto? Forget about it after the Jays designated the big righty for assignment.\n\n“It was a very tough, very difficult decision,” Jays general manager Ross Atkins said of parting ways with his former first-round pick. “This just came down to a roster crunch, and a feeling (it was) the best decision … as we push forward in very important weeks.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIt certainly was perceived as a wild bombshell of an announcement by the team less than an hour prior to Tuesday’s big game against the Boston Red Sox, as the Jays announced that Santander would be activated for the contest, this after sitting out 100 games with a shoulder ailment. The Manoah move was made to clear a roster spot for Santander but certainly spoke volumes at how it felt about Manoah’s performance while recovering from Tommy John surgery.\n\nIn another transaction, first baseman Ty France was placed on the injured list with left oblique inflammation.\n\nToronto Blue Jays’ Anthony Santander runs to first base after his single off Tampa Bay Rays pitcher Garrett Cleavinger during the sixth inning of a baseball game Saturday, May 24, 2025, in Tampa, Fla.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAtkins said he spoke with Manoah personally, not an easy call obviously, but one the team felt it needed to make.\n\n“He worked extremely hard, really impressed by his dedication to coming off Tommy John,” Atkins said of Manoah, who was third in American Cy Young Award voting after a terrific 2022 season. “He was disappointed. We wish him the best.”\n\nManoah, who has missed more than a year while recuperating from elbow surgery, can now be claimed by any other MLB team now that he’s on waivers. The 11th overall pick of the 2019 draft could elect to pursue free agency should he go unclaimed.\n\nWhen Schneider spoke shortly before 4 p.m., he said the team hoped to have an answer regarding Santander’s status by Wednesday. With the Manoah decision made, the team suddenly swerved to get the big hitter, who signed a five-year, $92.5-million US deal in the off-season, back in action. Santander wasn’t in the starting lineup against the Red Sox, but activated.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“He looked like himself,” Atkins said when asked what impressed about Santander’s at-bats in a rehab assignment in triple A. “And then I think there will be another gear, with that adrenaline coming into the fold here.”\n\nMeanwhile, Schneider said that the other big hitter the team hopes to have in action come playoff time — that being shortstop Bo Bichette — continues to make progress.\n\nSchneider said that Bichette, who has missed 15 games with what the team is describing as a knee sprain, was hitting in the cage on Monday at the Rogers Centre and had “probably one of the best days so far” since sustaining the injury in a crash at home plate at Yankee Stadium.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBichette was hitting in the cage again on Tuesday but has yet to resume running.\n\n“We’ll continue to take it one day at a time,” Schneider said. “The recovery part has been as we expected but it’s going to take time for him to feel more and more comfortable and kind of letting it go a little bit.\n\n“He’s still got to get back in the routine of swinging. He has a very deliberate routine in the cage. It’s getting that back first and making sure you feel okay and then kind of letting it eat a little bit.”\n\nRECOMMENDED VIDEO",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/maple-leafs-goalie-joseph-woll-144054404.html",
        "title": "Maple Leafs goalie Joseph Woll taking leave of absence - what it means for Toronto",
        "publish_date": "2025-09-23T14:40:54Z",
        "category": "sports",
        "authors": [],
        "text": "Joseph Woll has taken a leave of absence from the Maple Leafs.\n\nThe Leafs announced on Tuesday that the 27-year-old goaltender will be away from the team to attend to a personal family matter.\n\n“There is no timeline (for Woll’s return),” Leafs general manager Brad Treliving said. “We obviously support him 100% and I would just ask that everybody respect his privacy. We’re not going to get into a whole lot of detail on it.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“For context, it’s not a substance abuse issue. It’s a personal family matter that Joe is going to deal with and we will go from there.”\n\nTreliving wouldn’t provide further detail.\n\n“Certainly our expectation is that Joe is going to be back with us and we will see when that is,” Treliving said. “All our worry is just supporting and looking forward to getting him back.”\n\nTreliving said he didn’t know whether Woll would be back in time for the start of the regular season. For the Leafs, that’s Oct. 8 at home against the Montreal Canadiens.\n\n“It’s a tough situation for him,” Leafs coach Craig Berube said. “We’re all here to support him, do what we can to help. That’s really it. He needs to do what he needs to do. We’re all thinking about him. We miss him and we’re all here to support him as best we can.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSaid Matthew Knies: “We feel for him and we’re going to try our best to support him and give him space, let him take this on his own. We’re always there for him and wish him the best.”\n\nWHAT WOLL’S ABSENCE MEANS\n\nNothing changes for Anthony Stolarz, who was in line to be the starter for the opener. He just has to continue to get himself prepared as he would had Woll not been gone.\n\nThe Leafs remain solid in net with Stolarz, who is looking to use his NHL-leading .926 save percentage last season as a springboard.\n\n“The timing and speed of the game,” Stolarz said of his focus. “I’ll probably get in the next couple of games (Thursday in Montreal or Saturday at home against the Canadiens), so looking forward to that.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Just going out there and enjoying yourself again. Being out there with the guys, battling out there again, seeing the fans. You start getting a little anxious, a little jittery, to get the games and season going.”\n\nWill the Woll development have an impact on contract negotiations with Stolarz? We don’t think so. Stolarz has said he wants a new deal done before the regular season begins. There’s little reason for the status of Woll to change that.\n\nThe Leafs signed Dennis Hildeby to a three-year contract earlier in September and there’s confidence that he can be the backup for the time being.\n\n“It’s up to me to earn that trust every day,” Hildeby said. “Just keep working hard. I’m a big guy. Last year, I moved a lot more than I had to in some situations, I felt like. When I feel good, it doesn’t look too hard with my size. That’s where I want to be.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nTreliving during the off-season didn’t sign a veteran goalie so the club could have some insurance in the wake of an injury and he won’t scour the market for one now.\n\nBut if one of Stolarz or Hildeby gets hurt? That’s where the Leafs would be in bind. Treliving would have no choice but to seek help.\n\n“You’re always looking at your team,” Treliving said. “We just have to wait and see right now.\n\n“We’re comfortable with the goalies we have. Our expectation is Joe is going to be back with us, but we’ll see.”\n\nUP NEXT\n\nBerube said Hildeby will start on Tuesday night and play a couple of periods at Scotiabank Arena as the Leafs play host to the Ottawa Senators in another pre-season Battle of Ontario.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBerube isn’t going with a full NHL lineup, as Easton Cowan and Ben Danford will play after impressing on Sunday afternoon in the Leafs’ 4-3 win in Ottawa. Luke Haymes also will get another look.\n\n“I loved their games in Ottawa, both of them,” Berube said. “I thought Easton played a real direct game, did some good things. Those are the types of things I’m looking for. A young kid like that — how is he going to fit in our lineup? Can he do certain things?\n\n“Danford has great feet. He’s very composed for a young kid, in my opinion. And he made some really nice outlet passes. He’s simple. He doesn’t get himself into trouble.”\n\nCowan will skate on a line with centre Scott Laughton and Steven Lorentz. Danford will be paired with Oliver Ekman-Larsson on the blue line.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nDefenceman Simon Benoit continues to nurse an upper-body injury and was not on the ice on Tuesday, though Berube said he doesn’t think the issue was serious.\n\nMax Domi, meanwhile, was absent as he was attending the funeral of his grandfather.\n\nTHE LEAFS LINEUP\n\nFORWARDS\n\nMatthew Knies-Auston Matthews-Matias Maccelli\n\nBobby McMann-John Tavares-William Nylander\n\nDakota Joshua-Luke Haymes-Nick Robertson\n\nSteve Lorentz-Scott Laughton-Easton Cowan\n\nDEFENCE\n\nJake McCabe-Chris Tanev\n\nMorgan Rielly-Brandon Carlo\n\nOliver Ekman-Larsson-Ben Danford\n\nGOALTENDERS\n\nDennis Hildeby\n\nArtur Akhtyamov\n\ntkoshan@postmedia.com\n\nX: @koshtorontosun",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/blue-jays-kevin-gausman-reveals-141116135.html",
        "title": "Blue Jays’ Kevin Gausman reveals love for this iconic B.C. beer",
        "publish_date": "2025-09-23T14:11:16Z",
        "category": "sports",
        "authors": [],
        "text": "In the past, Kevin Gausman has professed his love for Toronto and Canada in different ways.\n\nThe foodie scene. The city itself. And his fondness for the fan base.\n\nAnd now, a little-known slice of his admiration for his work home that extends beyond the Ontario borders.\n\nGausman’s beer of choice, which per his request is well-stocked in the Blue Jays clubhouse? That would be B.C.’s own, Kokanee.\n\nThe affinity for the lager that the Creston, B.C., brewers bill as having a “glacier fresh taste” came from Gausman’s older brother, Brian, who pitched for the Kelowna Falcons back in 2006.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWorking the mound for the West Coast League outfit, Brian Gausman finished with a 2-3 record with a 2.61 ERA while striking out 28 over 41.1 innings in 12 appearances.\n\nThe elder Gausman was there in the prospect league long enough to acquire a taste for the popular B.C. beer and pass it on to Kevin, who has been a fan ever since.\n\nAs much as the 34-year-old Jays starter appreciates many things Canadian, he’s in particular admiration of the Blue Jays team in full drive mode to become the only last-to-first-place squad in franchise history.\n\nAnd Gausman, who is slated to make his 31st start of the season on Tuesday when the Jays begin their final homestand of the season with the first of three against the Boston Red Sox, thrives on the challenge ahead.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I mean, this is what you, as a player, you dream of to be playing meaningful games,” Gausman said in a recent interview. “It’s fun to watch what’s going on with other teams and other races\n\n“But it’s exciting just because of the guys we have. This team has been just so much fun. I mean 2021 was kind of the same way when I was (with the San Francisco Giants) and we won 108 games and it was a lot of no-name guys. But also superstars that kind of had resurgent years.\n\n“That’s what we are.”\n\nDespite the remaining stress in the pursuit of the AL East crown, the Jays current position is in stark contrast to where the team was a year ago when Gausman was as frustrated as anyone in the clubhouse and wasn’t shy about sharing his thoughts.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I’m sick of the ‘talent’ talk,” Gausman said in an interview during the final week of the 2024 season. “We’re so talented, this and that. We’ve got to start winning games. We’ve got to figure it out. We’ve got to do it quickly. I’m only getting older. (Fellow starter Chris) Bassitt is only getting older. If we want it to happen with this group, it has to happen soon. So what are we going to do?”\n\nWhat has happened since then, of course, has rejuvenated Gausman and his fellow veterans. With 90 wins and six games remaining, the Jays already have won 16 games more than last season with bigger prizes tantalizingly within reach.\n\nFrom Gausman’s perspective, it’s exactly where he wants to be — getting the start in a huge game for a team determined to maintain its status as the best in the American League.\n\n“I definitely appreciate this a little bit more now, you know,” Gausman said. “I don’t know how many more of these (opportunities) I’ll have. I hope next year we’re in the same boat, but you never know as a player.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“So yeah, just trying to soak it in and have as much fun and be the best teammate I can be on the days I’m not pitching.”\n\nIn his 13 big league seasons, Gausman has seen plenty of highs and lows — from last-place teams to starting for the Giants in the National League Championship Series. All the more reason, then, to be soaking up what’s happening with the Jays now.\n\n“I think we’re just a really close-knit group that we don’t really feel too much pressure,” Gausman said. “We just kind of try to win the day and these guys have been resilient all year. They seem to know when to say, ‘All right, we need to take it to another level.’\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“It’s been fun to watch guys take the next step. It takes being here the last couple of years to kind of see the big picture. Hats off to the organization for taking the next step as well when it comes to personnel.”\n\nHis final start of the 2025 season on Tuesday obviously is a big one, only to be topped by what happens in what will be his ninth post-season appearance.\n\n“It’s go time,” Gausman said. “If you love sports, this is the best time of year. It’s going to be fun from here on in.”\n\nAll the better to enjoy with an ice-cold B.C. brew.",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/ontario-mother-wins-lottery-twice-in-one-year-after-striking-60m-jackpot-with-coworkers-250k-solo-120017305.html",
        "title": "Ontario mother wins lottery twice in one year after striking $60M jackpot with coworkers, $250K solo",
        "publish_date": "2025-09-23T12:00:17Z",
        "category": "finance",
        "authors": [],
        "text": "Trang Pham of Mississauga, Ont., has had a year most lottery players can only imagine. After splitting a $60-million Lotto Max jackpot with four co-workers in January, the mother of two has now claimed another life-changing prize — $250,000 from an Instant Golden Multiplier ticket (Game #2449).\n\n“It’s unbelievable! It feels like I was struck by lightning twice in one year. You have to give yourself a smack just to make sure it’s real!” said Pham, who could hardly believe she was back at the OLG Prize Centre so soon.\n\nA long-time lottery player, Pham has been playing with OLG since she turned 18. Over the years, she has tried her hand at everything from Lotto Max and Lotto 6/49 to Daily Grand and a range of Instant tickets.\n\nThis most recent win happened almost by accident.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I was shopping at an outlet mall and got thirsty, so I stopped at a nearby gas station to grab a bottle of water,” said Pham, who purchased her winning ticket at Petro-Canada on Steeles Avenue West in Hornby, Ont.\n\n“While I was there, I ended up buying a couple of tickets.”\n\nThe next morning, sitting in her car, she decided to scratch her Golden Multiplier ticket.\n\n“I uncovered the top prize and realized it was a winning ticket,” she said. “Then I scanned it using the OLG app on my phone — and there it was: $250,000! I was so happy and excited.”\n\nMoments later, she called her husband to share the incredible news. “His response was, ‘Really?’ He was surprised and overjoyed,” said Pham, who also told a few friends about her astonishing win.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“They were also shocked but thrilled for me at the same time.”\n\nWhat makes the win even more remarkable is that this isn’t Pham’s first jackpot of the year. In January, she and four colleagues from a construction company matched all seven numbers in the Jan. 21, 2025 Lotto Max draw, making them the winners of a $60-million prize. Pham, who had been part of the workplace pool for years, said the life-changing windfall was almost impossible to believe.\n\nNow, just months later, she’s experiencing the thrill of winning again — but this time on her own. With her $250,000 prize, Pham says she’ll cover some bills and indulge in some well-deserved travel.\n\nInstant Golden Multiplier is a $10 ticket with a top prize of $250,000. Players scratch to match their numbers to the lucky numbers, with multipliers that can boost the prize up to five times. There are also extra games on the ticket where three matching symbols give players another win.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOverall odds of winning any prize are 1 in 3.40, making Pham’s second jackpot this year feel all the more surreal.\n\nIf you're looking to take a break from gambling, self-exclusion programs can be effective tools. See here for resources that are available across Canada.",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/barry-appleton-canadas-hopium-u-100041880.html",
        "title": "Barry Appleton: Canada's 'hopium' U.S. trade strategy all talk, no troops",
        "publish_date": "2025-09-23T10:00:41Z",
        "category": "finance",
        "authors": [],
        "text": "Canada just announced consultations for the Canada-United States-Mexico (CUSMA) trade agreement, copying America’s homework while forgetting we don’t have the same tools to complete the assignment. It’s like showing up to a gunfight with a strongly-worded letter.\n\nHere’s the stark reality: The United States has over 700 trade experts on standby, ready to defend their interests. Canada? Zero. We dismantled our Sectoral Advisory Groups on International Trade (SAGITs) in 2013 to save pennies. Now we’re paying in billions.\n\nAs an international trade lawyer who has testified twice before U.S. trade authorities this year — with a third appearance likely — I can tell you firsthand: we’re not just outgunned, we’re not even in the fight.\n\nThe consultation charade\n\nYes, Canada needs consultations. But consultations without strategy are just expensive focus groups. The U.S. has a mandatory consultation process backed by deep expert advisory bodies that actually shape policy. The U.S. shares drafts being negotiated and the experts enhance the U.S. negotiators’ abilities in realtime. Their system works because it’s built on substance, not symbolism.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMeanwhile, Canada’s approach amounts to what I call “hopium” — the delusional belief that good intentions and polite dialogue will somehow protect our $3.6-billion daily trade relationship. We can smoke all the hopium we want, but it’s our economy getting smoked.\n\nTime and again, we enter negotiations hoping for the best and getting the worst. Then we act surprised when we get steamrolled.\n\nThe missing army\n\nThis is not about bureaucratic infrastructure. It is about economic survival. We have world-class expertise in energy, critical minerals, digital innovation, financial technology, quantum computing and cross-border services sitting idle. These aren’t random volunteers; these are battle-tested professionals who understand the chess game of international trade.\n\nYet Ottawa hasn’t even asked for their help.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWe’re facing economic hostilities — let’s call them what they are — and our government won’t mobilize the very experts who could defend our interests. It’s organizational malpractice on a national scale.\n\nConsider our recent humiliations: When Washington demanded Canada withdraw the collection of its Digital Services Tax, Ottawa folded within hours. When Meta blocked Canadian news, we had no countermeasure. These weren’t tactical defeats; they were strategic surrenders that exposed what happens when you enter negotiations without a plan.\n\nBeyond denial\n\nU.S. Ambassador Pete Hoekstra recently stated that strengthening the trading partnership is a priority — but make no mistake, this means strengthening it on America’s terms. The Americans are laser-focused on protecting their interests, sector by sector, provision by provision. They’re playing hardball while we’re still looking for our glove.\n\nThe Trump administration’s transactional aggression has started to become institutionalized. And why wouldn’t it continue? It’s working for them.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMeanwhile, Canada clings to the fantasy that our “special relationship” will shield us from economic reality. There are no friends in trade negotiations, only interests. Trade with the U.S. isn’t marriage therapy — there’s no monogamy here, only hard power.\n\nThe path forward\n\nHere’s what Canada must do, starting yesterday:\n\n• First, immediately reconstitute our trade advisory infrastructure. Not after more consultations — now. Every day we delay, Canadian businesses lose market share and Canadian workers their jobs.\n\n• Second, develop an actual strategy before launching consultations. Define our objectives, identify our leverage points, and determine our red lines. Then consult on tactics, not fundamentals.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n• Third, mobilize sectoral experts immediately. We need to create formal advisory committees for a large number of areas — including energy, critical minerals, automotive, agriculture, intellectual property and digital trade. Give them security clearances, real influence, and direct access to negotiators.\n\n• Fourth, stop treating trade policy as public relations. This isn’t about announcements; it’s about results. Every empty press release weakens our position.\n\n• Fifth, acknowledge that we’re in an economic battle and act accordingly. Co-ordinate with provinces, industries and unions as if our economic future depends on it — because it does.\n\nThe bottom line\n\nThe CUSMA review clock is already ticking. The Americans aren’t waiting for us to get our act together. Every day we spend on performative consultations instead of substantive preparation is a day our competitors gain ground.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nCanada’s economy is one-tenth the size of America’s. Without strategy, size dictates outcomes. We cannot afford to negotiate from weakness, yet that’s exactly what we’re doing — entering every negotiation under-resourced, unprepared, and hoping goodwill will save us.\n\nThe question isn’t whether we can afford to resource our trade strategy properly. The question is whether we can afford not to.\n\nRight now, while we’re holding consultations about consultations, America is eating our lunch. And they’re using our own trade agreement to do it.\n\nIt’s time to stop the hopium and face reality: Canada needs to wake up, mobilize its expertise, and design a plan for the future — before the U.S. dictates one for us.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBecause in this relationship, power is the only currency that matters. And unless Canada stops hoping and starts planning, we’ll keep getting smoked.\n\nNational Post\n\nBarry Appleton is an international trade lawyer, Distinguished Senior Fellow and co-director at the Center for International Law at New York Law School, and a scholar and Fellow at the Balsillie School of International Affairs.",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/canucks-joe-labate-everyman-every-232145016.html",
        "title": "Canucks: Joe LaBate is the Everyman every fan should know",
        "publish_date": "2025-09-23T23:21:45Z",
        "category": "sports",
        "authors": [],
        "text": "There is 100 per cent one thing left to do on Joe LaBate’s professional hockey to-do list: score a goal in the NHL.\n\n“Yes, absolutely,” he says with a knowing smile, his eyes lighting up as well. And, yes, he’s come home.\n\n“Oh yeah man, full circle,” he laughed about signing with the Canucks seven years after he left. “They feel like the right fit. They’ve got some openings and they need what I bring. Some grit. Some sandpaper.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe’s not a name that jumps off the page, and he’s likely headed for Abbotsford to start the season. But there’s little doubt that if he does make it back to Rogers Arena, he’ll quickly remind everyone why he was a bit of a cult figure in his first NHL go-round with the Canucks, nine seasons ago.\n\nIn a career that’s seen it all, that’s one thing that stands out about LaBate. He’s long known the value of hard work and of knowing your role.\n\nLong ago he worked his tail off to make the NHL. Along the way he suffered a near-career-ending hip injury in the AHL. He also learned to be a fighter, figuring that would help him stay in the league.\n\nKraken centre John Hayden and Joseph LaBate of the Canucks scrap in the first period on Sunday in Seattle.\n\nThen he spent eight years away from the show, including a season in the KHL. A season in Russia for a team that won 14 games — but at least he got to be a first line centre for a bit.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWait, what?\n\n“That was really fun,” he recalled, of his one season playing for Barys Astana in Kazakhstan. The team wasn’t good, but he got to play a ton and experience the world.\n\nTo say the 32-year-old LaBate has been around the block and is more than happy to be back where it all started is a bit of an understatement. The Canucks drafted the 6-foot-5 Minnesotan in 2011. Then he spent four years playing collegiate hockey with the University of Wisconsin before beginning to chase the NHL dream in 2015. It took him just over a season to make it to the NHL: 13 games over three call-ups for Willie Desjardins’ Canucks in 2016-17.\n\nHe didn’t pick up a point but he did drop the globes and skate his tail off. It’s the wheels that got him to the NHL.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAnd then near disaster struck. A hip injury in February 2018 nearly ended his career.\n\n“You’re right there, trying to make yourself into an everyday NHLer, and then your body just fails and you got to kind of climb back,” he said, looking back at the hip injury. “And it makes you realize how quick things can change. It turned me into an everyday, very detailed professional. And I’ve grown a lot from it.”\n\nJoe Labate (62) in the middle of the action against the Calgary Flames during third period 2016 NHL Young Stars Classic action at the South Okanagan Events Centre in Penticton.\n\nBut he found his way back to health and signed on with the Belleville Senators. He played three years there, then started to bounce around a little: a season in Milwaukee, then one with the Chicago Wolves. Then he tried out Kazakh cuisine.\n\n“I got to play 20 minutes a night. First line centre. Power play,” he said of his time with Astana. “That was really good for me.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThen the Columbus Blue Jackets came calling, looking for exactly what the Canucks are looking for this year: a guy who has some miles on his resume, who knows the meaning of everyday professional.\n\nHis hard-working season earned him a late season call-up and six more games in the NHL.\n\n“I just love hockey. I’m obsessed with it. I love the chase,” he said. “I think it was 2,886 days between games? It was pretty special to get back in it.”\n\nHe admitted to having some tears in his eyes when he got the call last spring. He called his fiancée Clara, then his parents. He got to play for a team that was dealing with all kinds of emotional trauma, but one that found unity in the wake of the Johnny Gaudreau tragedy.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“It was obviously a very hard year. But I think as an organization, as a group, everyone came together, and it made them stronger. Once I got there. Everyone was super welcoming,” he said.\n\nFor the record it was 2,888 days between games, but that’s impressively close enough. And in a sport where the word “special” gets overused, this was a very good use of the word.\n\nSpecial, indeed.\n\nAnd now he’s back where it started. He’s playing for a team run by Ryan Johnson, a guy he’s known since he was just a prospect. Johnson was hired by the Canucks to work as a development coach in 2013, when LaBate was starting his third year at Wisconsin. And now-Abbotsford head coach Manny Malhotra was in his first season as a development coach when LaBate made his NHL debut. He’s pumped to work with the defending Calder Cup champion.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I know he’s a phenomenal coach, so that’s a huge plus. And then obviously the organization as a whole, you know, the Sedins are here; I used to play with them! RJ and me, we go way back. Yeah, a lot of ties here. So it just felt right.”\n\nAnd yeah, he wants to get that first NHL goal.\n\npjohnston@postmedia.com",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/premier-danielle-smith-wants-fast-005902957.html",
        "title": "Premier Danielle Smith wants a fast track for Alberta teacher training",
        "publish_date": "2025-09-24T00:59:02Z",
        "category": "finance",
        "authors": [],
        "text": "Premier Danielle Smith wants Alberta's education and advanced education ministers to create an \"abbreviated\" teacher training program for people who already have post-secondary credentials.\n\nShe's also tasked Education and Childcare Minister Demetrios Nicolaides with negotiating a new federal-provincial child-care agreement.\n\nIn her mandate letters to Nicolaides and Advanced Education Minister Myles McDougall, Smith instructs the ministers to develop a teaching certification program for people with training in \"relevant fields\" that doesn't require an education degree.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"The real goal here is to help get individuals that have some expertise in any industry, in any field and … help them to qualify to teach and bring their wisdom, their experience and their knowledge into the classroom in a much faster manner,\" Nicolaides said in an interview on Monday.\n\nThe move would be a departure from the current requirement for Alberta classroom teachers to have a minimum of four years of university education, including a teacher training preparation program.\n\nAn existing \"bridge-to-teacher\" program that enables skilled tradespeople, health professionals and information technologists to teach with an interim certificate while completing teacher training coursework takes too long and has low uptake, Nicolaides said.\n\nNicolaides' press secretary, Garrett Koehler, said 113 people have received provincial grants to complete the bridge program in the last five years.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nNicolaides said an abbreviated teaching credential would only allow the person to teach in their area of expertise. Questions about pay and whether other provinces would recognize the credential have yet to be worked out, he said.\n\nThe program should be ready before the next provincial election, scheduled for Oct. 18, 2027, he said.\n\nATA says move undermines teachers' skills\n\nAlthough creating a shorter program was in Nicolaides' previous mandate letter, Alberta Teachers' Association (ATA) president Jason Schilling said he is concerned to see the goal remains.\n\n\"We don't want to find an expedited teaching certificate process that undermines the profession and the quality of teachers that we're seeing in our schools,\" he said.\n\nAlberta Teachers' Association president Jason Schilling says teachers need more skills to succeed in K-12 classrooms than the government seems to think. (Nathan Gross/CBC)\n\nSchilling said teachers in training learn how to interpret curriculum, instruct, assess and manage students, work with students who have exceptional needs, and complete a practicum of in-classroom experience.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nHe said understanding how to teach isn't the same as having subject matter expertise.\n\nSchilling said legal changes would be needed to create different categories of teacher certification. He has questions about how such instructors would be paid and how their wages and working conditions would be bargained.\n\n\"We're pointing these things out to government — that it's just not as easy as they think it is,\" he said.\n\nBradley Lafortune, executive director of Public Interest Alberta, says lowering the bar for teacher certification could decrease the quality of teaching in the province. He said deprofessionalizing teachers could be a move toward a more American system, where teachers are paid less.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"I think it's a slap in the face to the profession,\" Lafortune said.\n\nRenewed emphasis on trades\n\nSmith's mandate letter also repeated previous education goals, including creating more avenues for junior and senior high school students to be exposed to skilled trades careers.\n\nSmith asked Nicolaides to design and implement a high-school apprenticeship system, advertise trades careers to teens, launch an online career counselling website and invest in more mobile career and technology studies (CTS) labs.\n\nAlberta's premier wants to see schools create more pathways for students to enter trades careers. (Submitted by Build a Dream)\n\nNicolaides is also tasked with reviewing, assessing and better supporting K-12 students with complex needs. The proportion of students with disabilities, medical needs, mental health challenges or who are learning English is increasing in Alberta schools.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe minister said he doesn't have a timeline or a format yet for that review. Nicolaides said he wants to explore whether his ministry can work together with health and social services to serve students more efficiently.\n\nDaycare deal expires in March 2026\n\nNicolaides is the third minister since Smith became premier in October 2022 to work with Ottawa on a federal-provincial deal to make child care more affordable.\n\nAlberta's $3.8-billion agreement with the federal government is supposed to reduce the cost of care in participating centres to $10 a day by 2026.\n\nThe province has also committed to creating 68,700 new licensed child-care spaces by March 2027. The provincial government's website says that in June, Alberta had added about 67 per cent of those new spaces, but it is closer to meeting its goals in for-profit and day home centres.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nKoehler said there are 130,000 children in licensed child-care spaces across the province, from babies to kindergarten.\n\nThe federal funding agreement with Alberta expires on April 1. Alberta is one of two provinces that has not extended the agreement by five years.\n\nNicolaides says officials at both levels of government have been in touch, and he has requested a meeting with his federal counterpart.\n\n\"We have notified them that we do want to see some changes, and we do want to see a little bit more flexibility,\" he said.\n\nA federal-provincial agreement has subsidized participating Alberta daycares to offer an average of $15-a-day child care fees to families. (Courtney Jennings)\n\nSmith's letter instructs Nicolaides to ink a deal that doesn't discriminate between non-profit and for-profit child-care centres when funding new spaces.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nChild Care Now Alberta chair Susan Cake says Alberta's mixture of non-profit and for-profit child care isn't unique among the provinces, and doesn't merit special consideration.\n\nCake says the province is right to want more funding for the program to make child care affordable for all parents.\n\nHowever, she says Alberta seems to be demanding special treatment, much like in 2021, when Jason Kenney's UCP government wanted a \"no strings attached\" deal.\n\n\"Unfortunately, it looks like a political fight with the federal government,\" Cake said. \"However, it'll be Alberta families that are ultimately losing out.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nShe said the province would have a better chance of customizing the agreement if it was willing to contribute more funding.\n\nCake says she was disappointed to see no more child-care goals in Nicolaides' letter.\n\nShe wants the government to prioritize creating more child-care spaces in \"deserts\" where care is hard to find, and to offer more training for early childhood educators, as well as collecting data on daycare demands across the province.",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/whos-whos-flames-lineup-against-185455248.html",
        "title": "Who's in and who's out? Flames lineup against Kraken on Tuesday night",
        "publish_date": "2025-09-23T18:54:55Z",
        "category": "sports",
        "authors": [],
        "text": "Dustin Wolf will get his first start of the pre-season and Jonathan Huberdeau is back in the lineup.\n\nHe won’t be playing alongside Nazem Kadri, though.\n\nWith the Calgary Flames playing on back-to-back nights are their pre-season picks up pace this week, they’ll be fielding a mix of veterans and young guns at the Saddledome on Tuesday night against the Seattle Kraken.\n\nThere’s no Mikael Backlund. No Blake Coleman. No MacKenzie Weegar and no Rasmus Andersson, among other notable names.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe puck drops at 7 p.m. Tuesday night, here’s how the Flames will look:\n\nForwards:\n\nJonathan Huberdeau – Morgan Frost – Matt Coronato\n\nConnor Zary – Justin Kirkland – Adam Klapka\n\nMatvei Gridin – Rory Kerins -Yegor Sharangovich\n\nWilliam Stromgren – Sam Morton – Sam Honzek\n\nDefence:\n\nKevin Bahl – Zayne Parekh\n\nIlya Solovyov – Brayden Pachal\n\nYan Kuznetsov – Hunter Brzustewicz\n\nGoaltenders:\n\nDustin Wolf\n\nOwen Say",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/john-ivison-liberals-easiest-days-214815082.html",
        "title": "John Ivison: The Liberals' easiest days may be behind them",
        "publish_date": "2025-09-23T21:48:15Z",
        "category": "finance",
        "authors": [],
        "text": "Mark Carney has long maintained that “a plan beats no plan” and in his speech to the Council of Foreign Relations in New York on Monday, he outlined his strategy for middle power survival in the new era of great power rivalry.\n\nHe said Canada has what the world wants — clean energy like LNG; five of the top 10 critical minerals; 40 per cent of the world’s listed mining companies; some of the best AI, computing and quantum talent found globally; capital, in the form of sophisticated pension funds; and a federal government with the fiscal capacity to act.\n\nHe conceded that much of the brain power drains south to the U.S., as does much of the capital (only a quarter of the total assets of Canada’s Maple Eight pension funds is invested at home).\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nBut he said Canada still offers people and businesses values to which most of the world still aspire. “We’re a pluralistic society that works… Our public square is loud, diverse and free,” he said, taking a not-so-subtle dig at an America where the law and natural justice seem to be splintering in different directions.\n\nThe Canadian government recognizes what is going on, he said — a rupture in international relations — and is building resilience at home by cutting taxes, diversifying trade relations, removing barriers to interprovincial trade, fast-tracking large infrastructure projects, making efforts to double the rate of housing construction, and doubling defence spending by 2030.\n\nThe core capabilities in AI, quantum, cyber security and critical minerals will be developed with an eye toward dual use for defence and the economy, in line with the calls by people like U.S. economist Noah Smith to adopt industrial policy that builds up the country’s “electro-industrial stack” — a suite of core technologies needed to manufacture a wide array of products from drones to phones, using lithium ion batteries.\n\nYet, as Carney himself suggested in his book Value(s), voters should trust those who seek the truth but doubt those who say they have found it (quoting French writer André Gide).\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAll of these initiatives are at the inception stage, but Carney must be concerned that things are not going as smoothly as he might have hoped. As a central bank governor, he acted as a benevolent dictator, who could expect things to happen as planned when he pulled a lever. In the federal government, the levers are often not attached to anything.\n\nAs head of a minority government, he has to use cordials as well as discipline. He has to assuage progressive backbenchers and even opposition parties, given he needs three votes to pass his budget. Yet Elizabeth May, the Green leader, told Politico this week that the PMO won’t even return her emails. This is a circumstance with which many journalists will sympathize, given the Carney government seems to be adopting the Stephen Harper “off the record, no comment” playbook when it comes to the media.\n\nMinisters and MPs have, apparently, been told to only speak when there’s something good to say, which may not be bad advice, but it is likely to burn much of the goodwill that was generated by the incoming government. Meanwhile, Pierre Poilievre is doing the rounds of the political shows, even if his “good to be here… it’s a privilege” response to CTV’s Vassy Kapelos sounded less than sincere.\n\nThe Conservative leader will have a tough time convincing Canadians that everything is worse under Carney than it was under Justin Trudeau but his line: “Let’s hold Mr. Carney to the standards he set for himself” is a winner, if things start to unravel.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThere are storm clouds ahead for this government.\n\nThe Building and Land Development Association released Toronto new home sales figures for August that showed an 81 per cent drop on the 10-year average. This might reduce prices but it creates more inventory and reduces the incentives for homebuilders to build more homes.\n\nThe government has promised 500,000 homes a year over the next four years but BILD said it will be a stretch to keep annual housing starts in the 200,000 range. Mike Moffatt, founding director at the Missing Middle Initiative, said Ottawa’s housing numbers are looking unrealistic. “The CMHC (Canada Mortgage and Housing Corporation) has housing starts falling by four per cent a year, every year through 2027. Tough to see how we’ll double housing starts in a decade,” he said.\n\nRegulating the housing market may be like controlling the wind. But as a government you can adjust your sails to avoid squalls in foreign policy.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn the case of Ottawa’s recognition of a Palestinian state, the government has navigated into the teeth of a perfect storm.\n\nOn the eve of the Jewish new year, Carney said Canada’s recognition of Palestinian statehood is consistent with this country’s policy since 1947. He said the prospect of a two-state solution is “receding before our eyes” because of the actions of the current Israeli government.\n\nHe said the move was taken alongside “a host of influential but not decisive countries” — like France, the U.K. and Australia.\n\nIt seems the motivation comes more from aligning with the Europeans in trade and security partnerships than from any conviction that this is a sound idea.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe normally sure-footed Carney looked less than convincing when asked at the Council of Foreign Relations event about one of the conditions for recognition — namely, the disarmament of Hamas.\n\n“Who if not Israel will carry out the disarmament of Hamas? And if a party committed to Israel’s destruction wins Palestinian elections, won’t you in effect have granted Hamas their own state to launch more invasions of Israel?” the questioner asked.\n\nCarney said the disarmament and elimination of Hamas as a political force is one of the conditions for the cessation of hostilities and that a combination of Arab and European states, “to which Canada would be party,” could form a multinational force to enforce the peace. It all sounded optimistic in the extreme.\n\nHamas proceeded to underline its humanitarian credentials by publicly executing three alleged Israeli collaborators on Monday.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThings are unlikely to get better for this government. A career in politics is no preparation for being a minister. Newbies are apt to step in it, as Public Safety Minister Gary Anandasangaree did this week when he was recorded saying he didn’t believe the government’s gun buyback plan would work and that it was being done to appease Quebec. Unless the PMO can instill an omertà like code of silence on the caucus and cabinet, others will follow suit.\n\nWith a budget due in early November, and nearly a third of Canadians expecting bad news, the government’s plain sailing days are over.\n\nWere it not for the public’s unwavering approval in Carney and his plan — at least compared to Poilievre — the Liberals would be taking on more water.\n\njivison@criffel.ca\n\nTwitter.com/IvisonJ",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/american-travellers-flag-jacking-maple-202719348.html",
        "title": "American travellers ‘flag jacking’ the Maple Leaf met with frosty response in Canada",
        "publish_date": "2025-09-23T20:27:19Z",
        "category": "finance",
        "authors": [],
        "text": "While U.S. president Donald Trump’s repeated comments about making Canada his country’s 51st state have raised the ire of many Canucks, news that Americans travelling abroad are now posing as Canadians will no doubt further fan the flames of discord.\n\nWhile it has long been the practice of Canadians travelling abroad to affix their country’s flag on their backpack or other luggage, American media giant CNN recently reported that U.S. residents have, in recent months, “revived a decades-old practice of masquerading as Canadians in order to avoid anti-American sentiment abroad under the Trump administration. They’re hiding behind the Maple Leaf, falsely identifying themselves as Canadians and displaying the Canadian flag on their bags in a phenomenon known as flag jacking.”\n\nThe Canadian flag has long been positively received abroad, leading many Canadians to display the Maple Leaf on their luggage while travelling.\n\nAnd Canadians are understandably reacting to the trend — none more so, perhaps, than Canadian cultural commentator Tod Maffin, who stated in a short video on social media: “For some reason, Americans think that we are their backup passport. The world’s first dual-action moral absolver. Just apply gently and watch the shame disappear.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe news comes at a time when Canadians are already shunning travel south of the border. In fact, a July report from Statistics Canada revealed that, for the first time in five years, fewer Canadians were travelling to the U.S. than Americans making the trip to Canada.\n\nAccording to the report: “In July 2025, the number of Canadian-resident return trips by automobile from the United States totalled 1.7 million, a steep decline (-36.9 per cent) from the same month in 2024.”\n\nThe report also showed that in July 2025, the number of returning Canadian-resident trips by air from the United States declined by 25.8 per cent to 383,700 from the same month one year earlier.\n\nAnd Canadians aren’t the only ones shying away from travel to the U.S. According to data from the U.S. National Travel and Tourism Office, in the first seven months of the year, the number of overseas visitors, excluding travellers from Canada and Mexico, declined by more than three million, or 1.6 per cent, compared to the same period in 2024.",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/leamington-based-mushroom-grower-fined-125113715.html",
        "title": "Leamington-based mushroom grower fined $115K after worker 'critically injured'",
        "publish_date": "2025-09-23T12:51:13Z",
        "category": "finance",
        "authors": [],
        "text": "A provincial court has fined a Leamington-based mushroom grower $115,000 after a worker was badly injured on the job more than two years ago.\n\nIn July 2023, an unidentified worker was \"critically injured\" at Highline Produce Limited's facility in Kingsville, Ont., after becoming entangled in a net that a machine was rolling and washing, according to the province.\n\n\"To be removed and reused effectively, nets had to be aligned correctly on the Net Washer so they did not shift and become entangled in either end of the machine's bar,\" the Ontario ministry of labour said in a press release Monday.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Misalignment of the nets was a normal occurrence that required workers to adjust nets with their hands,\" the release said. \"The worker was attempting this realignment but became entangled in the net that was threaded on the rotating bar. This resulted in a critical injury.\"\n\nThe ministry's investigation concluded that there \"were no measures, procedures, guards or other devices in place to prevent workers from becoming entangled when adjusting nets on the machine,\" per the release.\n\nHighline pleaded guilty to violating the Occupational Health and Safety Act, the province said. Last month, a justice of the peace imposed the fine as well as a 25 per cent victim surcharge, as required by law.\n\nHighline did not immediately respond to a request for comment.\n\nIt's not the first time the company has faced penalties over serious worker injuries at its facilities. In May 2019, Highline was fined $75,000 after a worker was caught in a moving cable. Later that year, the company was fined $90,000 after a worker was caught and dragged into a conveyor.",
        "source": "Yahoo"
    },
    {
        "url": "https://ca.news.yahoo.com/jimmy-kimmel-arrives-74th-primetime-154732093.html",
        "title": "Composite illustration featuring Canadian musician Sarah McLachlan, left, and U.S. talk-show host and comedian Jimmy Kimmel. Two groups of ABC affiliates, Nexstar and Sinclair, said Tuesday they will not air Jimmy Kimmel Live!, despite ABC returning it to the airwaves with McLachlan as a special guest.",
        "publish_date": "2025-09-23T15:47:32Z",
        "category": "finance",
        "authors": [],
        "text": "Composite illustration featuring Canadian musician Sarah McLachlan, left, and U.S. talk-show host and comedian Jimmy Kimmel. Two groups of ABC affiliates, Nexstar and Sinclair, said Tuesday they will not air Jimmy Kimmel Live!, despite ABC returning it to the airwaves with McLachlan as a special guest. (Sammy Kogan/The Canadian Press, Kevin Winter/Getty Images - image credit)\n\nABC's Jimmy Kimmel Live! is set to return to the air on Tuesday, after a nearly weeklong suspension that triggered a national discussion about freedom of speech, with Canadian musician Sarah McLachlan announced as a surprise guest.\n\nBut two groups of ABC affiliates that denounced the late-night talk show host last week said they would not carry Kimmel's return.\n\nNexstar Media Group — which operates 32 ABC affiliate stations in the U.S. — said it would continue to pre-empt the show, \"pending assurances that all parties are committed to fostering an environment of respectful, constructive dialogue in the markets we serve.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSinclair Broadcast Group — the country's largest ABC affiliate operator — also said it would keep Kimmel off its stations.\n\nThe two corporations collectively control about one-quarter of ABC affiliates in the United States. Citytv, which is owned by Rogers Communications and holds the Canadian rights to Kimmel's show, confirmed to CBC News that they will resume broadcasting it on Tuesday night.\n\nSarah McLachlan to perform\n\nActor Glen Powell was originally the sole celebrity scheduled to appear on Kimmel's Tuesday broadcast, but Sarah McLachlan posted on Instagram on Tuesday that she would be joining the show.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nEarlier, McLachlan cancelled a performance at the U.S. premiere for her documentary Lilith Fair: Building a Mystery, which was released on Disney+ on Sept. 21, \"in support of free speech.\" Disney is ABC's parent company.\n\n\"It's a gift for all of us to see [this documentary], but also I've grappled with being here tonight and around what to say about the present situation that we are all faced with,\" McLachlan said at the Ford Theater in Los Angeles on the weekend.\n\nShe referred to \"the insidious erosion of women's rights, of trans and queer rights, the muzzling of free speech.\"\n\nPublicists for both the Hulu-distributed documentary and the musician have confirmed she is also booked as an interview guest on Kimmel's show tonight.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nRepresentatives for McLachlan noted she was already slated to appear on Kimmel's show to promote her new album, Better Broken, before the host was pulled from the air.\n\nAlso Tuesday, Kimmel made his first comments on social media since his show was pre-empted.\n\nOn Instagram, he shared a photograph of himself with writer, producer and activist Norman Lear. In a tribute to the All in the Family-creator, who died in 2023, Kimmel called him \"not only a giant in the world of television, but a great man who was one of the most important and impressive people I ever had the pleasure of meeting.\"\n\nLear was outspoken against the Federal Communications Commission (FCC), a government agency tasked with regulating radio, television and internet content. Lear stated that the agency's adoption of \"family viewing time\" — an FCC-designated window in which programing must be suitable for all age groups — was a \"deceit\" and form of censorship.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAccording to the Smithsonian Magazine, Lear was on former U.S. President Richard Nixon's \"enemies list\" the goal of which then White House Counsel John Dean said was to \"use the available federal machinery to screw our political enemies.\"\n\nWhen Trump won his second term, Kimmel joked on-air that he was on the president's \"list of enemies.\"\n\nWATCH | Former FCC chairman offers his take on suspension of Jimmy Kimmel show:\n\nABC suspended Kimmel indefinitely after comments he made in a monologue last week, when Kimmel said the U.S. had hit \"new lows over the weekend with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nKimmel made similar statements in his followup show the next night.\n\nThe next day, FCC chair Brendan Carr appeared on conservative podcaster Benny Johnson's show, decrying Kimmel's words as \"appearing to directly mislead the American public\" about the alleged shooter's political affiliations.\n\n\"We can do this the easy way or the hard way,\" Carr said on the podcast, hinting that the FCC has \"remedies that [they] can look at,\" even as market pressures that could lead to Kimmel's firing mounted.\n\n\"These companies can find ways to change conduct to take action, frankly, on Kimmel. Or, you know, there's going to be additional work for the FCC ahead.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nSoon after, Nexstar said they would replace Jimmy Kimmel Live! with other programming. Sinclair then said they would do the same in a statement thanking Carr, before ABC announced they were pre-empting Kimmel's show entirely.\n\nThat was followed by posts by U.S. President Donald Trump on Truth Social, saying the move was \"great news for America.\"\n\nDebates around free speech\n\nSome characterized Carr's involvement as government overreach. U.S. Sen. Elizabeth Warren told CNN on Thursday that \"we know there was federal interference\" given Carr's appearance on Johnson's podcast. Earlier, she took to X to compare ABC pre-empting Kimmel's show with Paramount cancelling Stephen Colbert — a decision they made shortly after Colbert criticized Paramount for settling a defamation case with Trump.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nParamount said they made the move for purely financial reasons, but were also in late stages of a merger with the company Skydance — a move the FCC could have blocked.\n\nWarren opened an investigation in May into whether Paramount engaged in bribery with the Trump administration in order to secure the deal. Both Carr and Paramount denied the two issues were related.\n\nNexstar is seeking a merger with station owner Tegna, which would also require FCC approval.\n\n\"First Colbert, now Kimmel,\" Warren wrote Tuesday. \"Last-minute settlements, secret side deals, multi-billion dollar mergers pending Donald Trump's approval.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn reference to Kimmel, Senate Democrats issued a statement claiming Carr \"weaponized\" the FCC to \"act as a roving press censor, targeting broadcasters based on their political commentary.\"\n\nAt a New York appearance on Monday, Carr denied that the FCC had any involvement in ABC removing the show, instead citing poor ratings as the reason Kimmel \"is in the situation that he's in.\"",
        "source": "Yahoo"
    }
]