[
    {
        "url": "https://www.9news.com.au/national/police-investigate-brawling-nrl-fans-at-shark-park/e5a9498a-1e00-4b62-88d5-28f7e170d909",
        "title": "Police investigate brawling NRL fans at finals match",
        "publish_date": "Sun, 14 Sep 2025 01:43:18 +0000",
        "category": "sports",
        "authors": [
            "Sep"
        ],
        "text": "P﻿olice are investigating a brawl last night between rival rugby league fans during an NRL finals match in southern Sydney.\n\nSupporters traded blows during the Cronulla Sharks versus Sydney Roosters elimination final encounter at Shark Park.\n\nPolice and stewards were forced to step in to separate the brawling fans inside the stadium.\n\nPolice are investigating a brawl between NRL fans at Shark Park in Sydney. (Nine)\n\nNSW Police said in a statement today that investigations have started.\n\n\"An investigation is underway after a brawl involving up to 10 people broke out within the grounds of a football stadium in Cronulla last night.\n\n\"Police have commenced inquiries into the circumstances surrounding the incident.\"\n\nAnyone with mobile phone footage or information is urged to call Crime Stoppers on 1800 333 000.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/side-hustle-success-story-candy-claws-founders-made-20-million/50ed5853-0318-4358-9d86-9eb116821ebb",
        "title": "These siblings started a business with a few hundred bucks. It's made $20 million",
        "publish_date": "Sat, 13 Sep 2025 21:25:28 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Nearly three years ago, siblings Maddy and Dylan Jarvis invested a few hundred dollars of their personal savings into a quirky business idea.\n\nNow Candy Claws, their press-on nail brand, is about to hit $20 million in sales.\n\n﻿It's a milestone most Australians who start side hustles never hit.\n\nSiblings Maddy and Dylan Jarvis started their press-on nail brand with a few hundred dollars. It's made $20 million in sales since. (Supplied)\n\nA 2024 report showed that, of the 55 per cent of Aussies who hoped to start a small business or side hustle by 2030, most were motivated by the idea of a better income.\n\nBut Maddy, 26, just wanted a way out of her dull corporate job when she and Dylan started Candy Claws.﻿\n\n\"It was my first corporate job out of uni, and I was really young,\" she told 9news.com.au.\n\n\"I'd always wanted to do my own thing, so I was like, 'I'm just going to start it now and see how it goes.'\"\n\nLooking for an extra buck? These are Australia's top side hustles View Gallery\n\nThe idea for a press-on nail business struck her in the aisles of her local chemist.\n\nLike many young Aussies, ﻿Maddy couldn't ﻿afford to get her nails done at a salon every few weeks in a cost-of-living crisis.\n\nBut the ﻿press-ons available at her local shopping centre looked cheap, felt flimsy and fell off within a few hours.\n\n\"I was like, what if you could create press-ons that looked and felt like a salon manicure, and lasted weeks rather than days?\" she said.\n\nDylan, 30, was totally on board with the idea.\n\nThe siblings started looking into manufacturers right away and pooled a few hundred dollars from their savings accounts to pay for the first batch of Candy Claws nails.\n\nOrders started coming in soon after.\n\nMaddy spent ages packing orders by hand in Candy Claws' early days. (Supplied)\n\nBy that stage, Maddy had quit her corporate job, so she had all stock delivered to her place, where she packed thousands of orders in her living room.\n\n﻿\"I couldn't even get through my front door some days when we just got a stock order in,\" she laughed, but the inconvenience quickly paid off.\n\nAs soon as the first batch of nails sold out, she and Dylan invested all their earnings into paying for the next batch.\n\nWithin the first month, Candy Claws had made $6000 in sales.\n\nBy the end of the first year, it had hit $1 million.\n\nNow the business is approaching the $20 million mark, has moved into a proper warehouse and office, and Maddy and Dylan are both working on it full-time.\n\nThe brand has also ﻿expanded to New Zealand and the UK, with plans to explore the US market in the future – hopefully once the Trump administration's import tariffs have been lifted.\n\nMaddy and Dylan have since moved the business into a proper warehouse space. (Supplied)\n\nSo what made it work when so many side hustles fail?﻿\n\nAccording to Maddy, it was hard work, careful money moves, and ﻿investing in social media advertising.\n\n\"We couldn't really afford to hire content creators at the start,\" she said.\n\n\"So I just accepted that I was going to have to be the one to get in front of the camera and talk about the brand [and] we quickly picked up on the fact that that's what people liked.\"﻿\n\nNow they have more than 70,000 Instagram followers.\n\nFounder-forward brands can do extremely well on social media, where small business and entrepreneurial content has been booming of late.\n\nPress-on﻿ nails have also enjoyed a massive spike in popularity recently, both online and in Aussie shopping carts.\n\nCandy Claws has more than 70,000 Instagram followers and a huge customer base now. (Supplied)\n\nThe global press-on nail market size was estimated at $US696.6 million ($1 billion) in 2023 and is projected to hit $US1 billion by 2030, according to Grand View Research.\n\nMore than ﻿2.6 million TikTok videos and 6.5 million Instagram posts are tagged #pressonnails, reflecting a shift towards more cost-effective beauty options amid the cost of living crisis.\n\nMany Aussies have been forced to cut back on luxuries like gel or acrylic manicures to prioritise essentials, making press-ons a popular alternative.\n\n\"It's the cost-saving element, but also the time-saving element,\" Maddy said.\n\n﻿Candy Claws' biggest customer groups are Aussie mums who don't have the time or money to get a manicure and pensioners who can no longer afford trips to the salon.\n\nAnd with the cost of living crisis showing no signs of easing, it looks like Candy Claws' business will be booming for some time to come.﻿\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/gouldian-finch-sightings-drop-northern-wa/105763736",
        "title": "Drop in WA Gouldian finch sightings sparks concern",
        "publish_date": "Sun, 14 Sep 2025 01:04:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "The number of endangered Gouldian finches at a critical site in the far north of Western Australia has halved in the past year, according to a new population count.\n\nConservation charity Save the Gouldian Fund has just completed its annual survey of the colourful birds in Wyndham — home to the largest known population of the species — located about 3,300 kilometres north-east of Perth in the East Kimberley.\n\nOnce among the most common finches found across northern Australia, Gouldian numbers have plummeted over the past century, from hundreds of thousands to an estimated 2,500 in the wild.\n\nGouldian finch numbers appear to be declining in the Wyndham region. (Supplied: Kacie Austin)\n\nSave the Gouldian Fund chief executive Gary Fitt said the population in Wyndham had been steadily falling.\n\n\"In 2023, we were counting on average about 1,700 Gouldians a day,\" Dr Fitt said.\n\n\"The following year, it dropped to 1,500.\n\n\"Last year was 1,200, and this year, under 500.\"\n\nLack of rainfall causes decline\n\nDr Fitt attributed the sharp decline to poor wet season rainfall earlier in 2025, which likely stunted the growth of native sorghum, a key food source for the birds.\n\nHe also raised concerns about frequent burning around Wyndham, which could destroy nesting habitat and force the birds to travel further in search of food.\n\n\"The level of fires and level of burning around Wyndham is really concerning,\" he said.\n\nGouldian numbers have plummeted over the past century. (Supplied: Bruce Doran)\n\n\"Because that means the birds have to move around a lot more to find what remaining food there is.\"\n\nDespite the drop, Dr Fitt remained optimistic.\n\n\"I think if there's a good wet season next year and there's plenty of sorghum, the numbers may well come back up,\" he said.\n\n\"The numbers that we're seeing now are still well above what we were seeing back in the late 1990s, as the population was declining to the point where the bird was declared endangered.\"\n\nWA government under investigation\n\nThe low numbers in Wyndham come as the federal government investigates whether the WA government has breached environmental conditions tied to protecting Gouldian finches in the nearby Ord Valley.\n\nThe WA Department of Primary Industries and Regional Development (DPIRD) is behind the Weaber Plain Development Project, also known as the Goomig Project — a large-scale irrigation scheme involving the clearing of nearly 10,000 hectares of land.\n\nThe WA government is under federal investigation over conservation zones in the Ord Valley. (ABC Kimberley: Alys Marshall)\n\nWhen the project was approved in 2011, the federal government imposed strict environmental conditions, including an 11,545-hectare buffer zone and installation of artificial nest boxes to support Gouldian finches.\n\nBut in the past five years, surveys have found no evidence the endangered birds were using the nest boxes within the protected area.\n\nAustralian Conservation Foundation national nature campaigner Jess Abrahams said the WA government was failing to meet its obligations.\n\n\"We are seeing Gouldian finches disappear from parts of the landscape that are no longer suitable to support them, and that's a real tragedy,\" he said.\n\n\"If governments continue to approve the destruction of their habitat, continue to fail to act on climate change, if agricultural production continues to encroach on its habitat, I do fear that Gouldian finches will be a thing of the past in this part of Australia.\"\n\nDPIRD said it recorded Gouldian finch activity in the environmental buffer zone in 2025 through acoustic monitoring trials, which detected juvenile and adult Gouldian finch calls throughout the day, and visual surveys.\n\n\"Despite the demonstrated presence of Gouldian finches in the general area, the artificial nesting boxes installed to satisfy Weaber Plain development requirements remain unoccupied,\" a spokesperson said.\n\n\"Survey and trial results will form part of DPIRD's federal compliance reporting obligations for the Weaber Plain development.\"\n\nThe federal Department of Climate Change, Energy, the Environment and Water has not yet released the findings of its investigation.\n\nA spokesperson said it would be inappropriate to comment while the process was ongoing.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/all-blacks-regroup-after-springboks-defeat/105771568",
        "title": "All Blacks preparing for 'real discomfort' after record loss to Springboks",
        "publish_date": "Sun, 14 Sep 2025 00:33:57 +0000",
        "category": "sports",
        "authors": [],
        "text": "New Zealand captain Scott Barrett has called on the All Blacks players to use the \"discomfort\" of their record 43-10 defeat to South Africa as fuel to rebound ahead of their next Rugby Championship clash against Australia.\n\nA week after beating the Springboks 24-17 at Auckland's Eden Park, the All Blacks crashed to their worst Test loss on Saturday night as the visitors piled on 36 unanswered points in Wellington.\n\nLock Barrett, part of a forward pack that was well beaten on the night, said the sting of the defeat would not fade quickly over the two weeks before meeting the Wallabies at Eden Park.\n\n\"There'll be some real discomfort this week,\" he told reporters.\n\n\"But I'm sure this team will use that to bounce forward. We've got the Bledisloe [Cup] ahead and a chance to respond.\"\n\nThe All Blacks' final two Tests of the Rugby Championship double as the Bledisloe Cup, the annual trans-Tasman series contested with Australia.\n\nWallabies go down to Pumas despite fightback Photo shows A Wallabies rugby union player grimaces as he is wedged between two Pumas players in a tackle. The Wallabies fall just short of a magical comeback against Argentina, losing 28-26 in a thrilling Rugby Championship Test in Sydney.\n\nAfter the Auckland encounter on September 27, the two sides meet again in Perth on October 4.\n\nThe Wallabies, who were beaten 28-26 by Argentina in Sydney on Saturday, lead the Rugby Championship with 11 points, one ahead of second-placed South Africa and New Zealand.\n\nHaving beaten South Africa with a smart aerial game at Eden Park, All Blacks coach Scott Robertson said his team failed to deal with their high balls in Wellington during the six-tries-to-one rout.\n\n\"When they [Springboks] got rolling, they were relentless. We couldn't buy a moment, and they punished us,\" Robertson said.\n\n\"They've been criticised for it in the past, but they own that space now. They put pressure on us, and it worked.\"\n\nWhile declining to blame his players, Robertson said the entire squad needed to take responsibility for the setback before they could move forward.\n\n\"Firstly, [we need to] own it,\" he said.\n\n\"Get some responsibility and find out what we need to fix.\n\n\"We're not going to be chasing too many things. We've got to be clear about what matters most to us on and off the field.\n\n\"Then, get a plan and look forward to this next game.\"\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/how-to-watch-the-emmys-2025-primetime-awards-los-angeles/105751936",
        "title": "How to watch the 77th primetime Emmys",
        "publish_date": "Sat, 13 Sep 2025 23:55:38 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "US television's night of nights is fast approaching and Apple TV+ show Severence is the stand-out, with 27 nominations, including for Best Drama.\n\nThe 77th Annual Primetime Emmys will broadcast live from Los Angeles's Peacock Theater, with winners chosen by 26,000 performers, directors, producers and other members of the Television Academy.\n\nHere's when they're on and how to watch.\n\nWhen are the 2025 Primetime Emmys?\n\nThe Primetime Emmys will take place on the evening of September 14 in LA, which is 10am AEST on September 15 in Australia.\n\nIf you're interested in the frocks, the red carpet pre-show will kick off about 9am AEST.\n\nWhere can I watch the 2025 Primetime Emmys?\n\nIf you have Foxtel, you can watch it on the Arena channel.\n\nYou can also stream it on Binge.\n\nThere will also be a live blog of the ceremony on the ABC News website.\n\nWho will host the 2025 Primetime Emmys?\n\nFor the first time, American comedian Nate Bargatze will host the Emmys this year.\n\nHe has hosted Saturday Night Live twice and won a Grammy for best comedy album.\n\nWho will present?\n\nSydney Sweeney and Stephen Colbert are among some of the famous faces tapped to present at this year's Emmys.\n\nOther actors announced as presenters include:\n\nElizabeth Banks\n\nIke Barinholtz\n\nAngela Bassett\n\nJason Bateman\n\nKathy Bates\n\nKristen Bell\n\nSterling K Brown\n\nJennifer Coolidge\n\nAlan Cumming\n\nEric Dane\n\nColman Domingo\n\nTina Fey\n\nWalton Goggins\n\nTony Goldwyn\n\nKathryn Hahn\n\nMariska Hargitay\n\nJustin Hartley\n\nCharlie Hunnam\n\nJude Law\n\nAre there other Emmys?\n\nYes, there are several other Emmy award ceremonies that recognise different sectors of the television industry and take place at different times.\n\nAs well as the Primetime Emmys there are, Daytime, Sports, News & Documentary, and International Emmys, in addition to various Regional Emmy Awards.\n\nThe Creative Arts Emmys, which celebrate technical and artistic achievements in prime-time television, also took place this week.\n\nThey generally honour behind-the-scenes crews the week before stars of the same shows take to the stage for the prime-time ceremony.\n\nWho is nominated for the Primetime Emmys?\n\nYou can see the full list of Primetime Emmy nominations here.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/australias-press-gallery-problem-with-political-coverage/105762464",
        "title": "Australia's press gallery has a unique problem with its political coverage",
        "publish_date": "Sat, 13 Sep 2025 23:27:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Last week's Media Watch raised some fascinating questions about political reporting in Canberra.\n\nIn one segment, host Linton Besser talked about the culture of \"drops\".\n\nA \"drop\" is when a political reporter is given a story under embargo, which means the story can't be published before a certain time.\n\nBut a norm has existed for decades, for a particular kind of drop, that finds journalists agreeing to run a story, given to them by a government or opposition MP, on the proviso that they don't include any quotes from third parties in the first version of their story.\n\nIf you didn't see the Media Watch segment, it's worth watching.\n\nSee the segment below.\n\nIt suggests that the culture of strings-attached drops has become more blatant in Canberra in recent years.\n\nLoading...\n\nIs it time for the practice to end, as Besser suggested?\n\nBecause if we want it to end, the press gallery will have to overcome its collective action problem.\n\nA glutton for punishment\n\nA quick anecdote.\n\nOne of the most memorably abusive phone calls I've received in my time in Canberra came from a staffer in then-prime minister Malcolm Turnbull's office.\n\nThat staffer was an ex-journalist.\n\nI was working at Guardian Australia at the time, in 2018, when Turnbull decided to announce his plan to turn Australia into one of the world's top 10 weapons exporters.\n\nAustralia's Future Fund invests in the global arms industry Photo shows Loyal Wingman plane in flight Would the Future Fund's financial returns suffer if it stopped investing in the global arms industry?\n\nI was working the Sunday shift that day, as a political reporter, so I was sent the \"drop\" to write up the story for online.\n\nThe story was embargoed until 8pm that evening (if I recall), which meant lots of news outlets would be publishing the story that evening.\n\nThe long-established \"norm\" for that kind of drop was that, when you wrote the story up, you couldn't include comments from opposition MPs or other third parties in your initial article, because it was a major policy announcement from the government.\n\nBut there was no rule that said you couldn't provide political context in the story.\n\nSo, when I wrote the story up, I included this context in my article:\n\nThe controversial plan has been anticipated since mid-2017 when Christopher Pyne, the defence industry minister, said he wanted to start selling far more Australian-made weapons overseas. At the time, Tim Costello, the World Vision Australia chief advocate, attacked the plan, saying the government had cut humanitarian aid which saved lives while simultaneously discussing the merits of becoming a major weapons manufacturer and exporter. \"The government says this is an export and investment opportunity, but we would be exporting death and profiting from bloodshed,\" Costello said last year. \"There is only one purpose in making a weapon and that is to kill someone with it. Do we really want that to be what people think of when they see the brand 'made in Australia'?\" Costello said at the time that the contemporary Syrian war — now in its eighth year — could not have lasted for more than a year without armaments profiteering. As a result, there had been more than 300,000 people killed, including thousands of children, 13.5 million people in need of humanitarian assistance, 6.3 million people internally displaced and 5 million people turned into refugees.\n\nI filed the story and went home.\n\nThe initial headline on the story included the phrase \"exporting death\" or \"profiting from bloodshed\" (I can't remember which), which was a reference to the criticism that Tim Costello had made of the idea six months earlier, to which I'd alerted readers.\n\nAnd an hour or so after the story went live that night, I was in my kitchen cooking dinner when I got a phone call from Turnbull's staffer.\n\nHe was furious. He accused me of breaking the norm for drops.\n\n\"What do you mean?\" I asked.\n\nHe said I'd gone to Tim Costello for a quote.\n\nI tried to explain to him that I hadn't gone to Costello. That quote in my story from Costello was six months old. Costello had made that criticism of the Coalition's policy in July 2017 when the idea was floated by Christopher Pyne.\n\nBut he was having none of it. His anger had shut his brain down.\n\n\"You're a f***ing disgrace,\" he seethed.\n\n\"You're a s*** journalist. You're pathetic. This is journalism 101. You don't deserve to be in the gallery. You're not good enough.\"\n\nOn and on it went. A stream of personal abuse.\n\nA collective action problem\n\nNow, generally speaking, it hasn't been my experience that editors care that much if their journalists get verbally abused by staffers or politicians, unless the abuse is turned up to 11.\n\nThey're too busy with other things. We're all adults. And what could they do about it anyway?\n\nLabor to water down transparency laws, allow blanket FOI refusals Photo shows Albanese water The government will argue the \"proper functioning\" of government is hampered by disclosure laws and push for wide-ranging restrictions on the information that can be released to the public.\n\nBut there's not enough recognition from editors that journalists in the press gallery are trapped in a toxic dynamic when they're expected to keep staffers and MPs on side, regardless of how they're treated, so they don't miss any \"drops\" on big policy announcements.\n\nIt's a gross situation to be put in, and it creates an intolerable power imbalance in the staffer's favour.\n\nWhy do some daily news editors care so much about drops?\n\nBecause they hate waking up in the morning to discover that a rival news outlet has a big story on a major policy announcement and their own outlet doesn't have the same story.\n\nWhy don't they just refuse to take drops that come with strings attached?\n\nBecause if one news outlet in the press gallery is willing to accept such drops, other news outlets feel pressure to accept such drops too.\n\nThe fear is that, if your news outlet never accepted drops with strings attached, your rival (which had no qualms about it) would look like the agenda-setting news outlet that always had the big policy announcements, and you'd always look like you were chasing your rival's coverage.\n\nFor the press gallery, it's a collective action problem.\n\nThe gallery has the power to kill the culture of strings-attached drops in Parliament House. If every news outlet in the hallway believed it was in their collective interest to do so, and they acted as one, they could kill the practice tomorrow.\n\nBut who expects that to happen?\n\nThe temptation for one news outlet to break away from any gallery pact, to get the \"scoop\" on their rivals with a juicy drop that kicked off the next major news cycle, would be too great.\n\nAnd once that happened once, other outlets would go back to receiving strings-attached drops again.\n\nThere's a solution\n\nHow does the press gallery break out of that logic?\n\nIn last week's Media Watch, the segment included a quote from the Sydney Morning Herald's Peter Hartcher.\n\nMr Hartcher said when reporters received a drop from an MP's office, they should simply ignore any demand that the initial write-up of the drop can't include quotes from third parties.\n\n\"Reporters should ignore this unethical constraint and remember that their main responsibility is to their readers, viewers and listeners, not their sources,\" he said.\n\nBut Hartcher should know that that's not how the world works.\n\nAs the media works to win trust, people say they want the truth Photo shows A graphic showing someone looking at their phone with social media icons around their head. Australians want journalists to tell the truth. Is that a simple request?\n\nLowly ranked individual journalists in major newsrooms can't just refuse to do that, if they want to keep their job.\n\nThey'd need to know that their editors backed them first.\n\nAnd that would require editors announcing to their newsrooms that no more stories will be published based on drops, if the drops come with certain demands from an MP's office.\n\nSometimes you'll see an editor trying to improve the quality of their political coverage by telling their political reporters that they won't be publishing any more stories that include quotes from anonymous sources.\n\nThey could issue a similar diktat for drops, if they wanted to.\n\nAnd if they did that, they might be surprised to see how quickly it would rebalance the power dynamic between their journalists and the MPs and staffers their journalists have to deal with.\n\nIn one move, it would create a slightly better working environment for their journalists in Canberra, and it would strip some power from arrogant MPs and staffers who consider it their right to have some news framed in certain ways by controlling the flow of information through the press gallery with divide-and-conquer tactics.\n\nEditors could even use that editorial policy to their market advantage by loudly publicising the fact that their news outlet doesn't accept strings-attached drops, but their rivals do.\n\nIf they don't respect the way their rivals \"do news,\" why would they want to mimic them anyway?\n\nAnd if morning TV and radio hosts felt the need to follow a drop-based story from a rival news outlet one morning, they could tell their listeners that the story was clearly a drop, and that's why they're interrogating it now.\n\nWho cares if a \"norm\" has existed for decades?\n\nIf we think the press gallery should still exist as an institution, there's no reason why a few practices shouldn't be overhauled for the 21st century.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/collarenebri-hosts-pilot-diabetes-and-holistic-health-program/105600544",
        "title": "Outback nurse tackles diabetes with cans, rocks, bush tucker and chat",
        "publish_date": "Sat, 13 Sep 2025 23:25:15 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When Rishoniy Caine arrived in a tiny outback NSW town with one general store, no gym and the task of fixing its diabetes problem, she decided to do things a differently.\n\nThe Bundjalung woman knew from her experience as a nurse in remote Kimberly and Cape York communities the difficulties residents faced buying healthy food.\n\n\"If you can imagine the nearest town is 1,000 kilometres away, it can be very challenging to get fresh food. It's almost non-existent,\" she said.\n\n\" Also a lettuce might be $16 and two litres of milk $12, while a can of coke is $2, a pie is cheap. \"\n\nShe incorporated what she learnt from elders about bush foods and traditional medicine into a pilot program in a rural NSW town that faces similar issues — Collarenebri, about 75 kilometres from Walgett in the state's north-west.\n\nRishoniy Caine knows the challenges of healthy living in remote communities. (ABC Western Plains: Zaarkacha Marlan)\n\nCooking and gardening lessons are provided alongside medical treatment and, instead of weights, participants are encouraged to lift cans.\n\n\"Many of my patients are told to stop eating the foods they know and take tablets, but they're not given the tools or support to make long-term change,\" Ms Kaine said.\n\n\"I wanted to educate people on why this is so important and then I needed to actually walk alongside them and support them with how to look after their own health long-term.\"\n\nTailoring treatment to limited resources\n\nThe Healthy Communities Foundation program includes group and one-on-one sessions, in-home cooking visits, mental health support, nutrition education and culturally safe conversations about type 2 diabetes care and prevention.\n\nAccording to the Rural Doctors' Network, 6.1 per cent of people in western and far western NSW live with type 2 diabetes, higher than the national average of 5.5 per cent.\n\nWestern NSW residents are also 40 per cent more likely to die from diabetes-related causes compared to the rest of the state.\n\nSome of the 29 participants in the program told Ms Caine they struggled to follow dietary advice from a specialist who visited town every three months, and healthy food was often unaffordable or unavailable locally.\n\nInstead, the program promotes traditional foods like kangaroo, fish and native greens, and encourages growing or sharing food locally.\n\nRiverside Collarenebri might not have a gym or specialist health services, but there are healthy options. (ABC Western Plains: Zaarkacha Marlan)\n\nExercise is reframed as everyday movement — not gym workouts or costly routines — but simple tasks like cleaning the house or walking around town.\n\n\"In Collarenebri, we don't have a gym, but we do have a beautiful river and a small community that's safe to walk around,\" Ms Caine said.\n\n\"I'm not asking people to buy expensive weights, I'm asking them to get that can of food out of your cupboard and use that.\"\n\nCommunity part of the cure\n\nOne of Collarenebri's approximately 600 residents, Kellie Henderson discovered she had diabetes in a consultation with Ms Caine 12 months ago.\n\n\"It came as a great big shock,\" she said.\n\nSince joining the program, the 44-year-old has lost almost 30 kilograms, reduced her blood sugar to near-normal levels and reshaped her daily habits.\n\nRishoniy Caine says people can exercise with whatever they have on hand, like canned food or even rocks. (ABC Western Plains: Zaarkacha Marlan)\n\n\"I find things fun — just going for a walk, time to myself, experimenting with different foods,\" she said.\n\n\" If something's worrying me, I'll just ask Rishoniy and she'll explain the good and the bad of it. She's been honest and has explained things to me in a way that I could actually understand. \"\n\nRishoniy Caine shows Kellie Henderson how to prepare a diabetes-friendly meal. (ABC Western Plains: Zaarkacha Marlan)\n\nMs Henderson said she still had \"ups and downs\" but felt better supported than in the past.\n\n\"I'm determined not to go back to where I was,\" she said.\n\n\"I'm feeling a lot happier.\"\n\nA model for other communities\n\nMs Caine said restoring cultural and community connection was as important as managing physical health.\n\n\"If you don't look after your body, your mind is not well, and if you don't look after your mind then your spirituality and connection to your community and your culture is not well either,\" she said.\n\nEarly results from the pilot program show improvements in weight, blood sugar levels, mood and social connection.\n\nHerbs, vegetables and bush tucker are affordable options in remote communities. (ABC Western Plains: Zaarkacha Marlan)\n\n\"People are becoming healthier, they're losing weight, they're happier, their mental health has improved,\" Ms Caine said.\n\n\" People are starting to share what they grow in their gardens. Communities are coming together and they're starting to teach children and other people in the community. It's become a real community approach. \"\n\nMs Caine presented the model at the Australian Primary Health Care Nurses Association's national conference in July, and believes it could be a blueprint for other communities across Australia.\n\n\"You could use this for any chronic disease or for health promotion to keep people well and educate people in holistic wellness before they become unwell,\" she said.\n\nFinal results from the pilot program are expected in November.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/wombats-take-over-robe-south-australia/105763680",
        "title": "Wombat makes home in main street bowls club amid habitat loss",
        "publish_date": "Sat, 13 Sep 2025 22:45:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "A wombat has made its home in the main street of Robe, evidence of an influx of the animals in the South Australian coastal town.\n\nTheir numbers appear to be increasing in Robe, as more land in the area is taken up by housing.\n\nLast week, a wombat burrow was discovered leading from Mundy Terrace under a rock retaining wall at the Robe Bowling Club.\n\nThe wombat burrow that has appeared under the Robe Bowling Club on Robe's main street. (Supplied: District Council of Robe)\n\nDistrict Council of Robe chief executive Nat Traeger said the situation was not yet like the movie Caddyshack, in which a gopher messes with a greenskeeper by digging holes all over a golf course.\n\n\"It doesn't really look like it's going to pop out, but we did certainly have a chat with the bowling club just in case they were fearful that it might pop up under their bowling green and do damage there, but they're not too worried about it,\" she said.\n\n\" We certainly don't wish the little fella harm, but we certainly don't want to see it damage our infrastructure as well. \"\n\nWombats at the Robe Golf Club in March 2024 (left) and March 2021 (right). (Supplied: Robe Golf Club)\n\nMore wombats on roads\n\nSouthern hairy-nosed wombats populate the state's Murraylands and far west, but in the South East, common or bare-nosed wombats are becoming more abundant.\n\nMs Traeger said Robe had good habitat for wombats but, sadly, more were dying on roads after they were hit by cars.\n\n\"If the population gets to a point, it's probably not surprising that they do spill into Robe streets,\" she said.\n\n\"You see seals in our marina and you see kangaroos and wallabies hopping through the main street.\"\n\nWombats are regularly seen on greens at the Robe Golf Club, which is surrounded on two sides by houses, another by bushland and a third by coastal dunes.\n\nA burrow recently appeared in a sand bunker on the 11th hole.\n\nA wombat burrow in the sand bunker on the 11th hole at the Robe Golf Club. (Supplied: Robe Golf Club)\n\nBut club president Luke Whitbread, who also has about seven or eight living on his rural block, said he was not worried.\n\n\"They've been around forever and a day,\" he said.\n\nPossible habitat to be cleared\n\nIn 2023, a judge upheld a decision by the Robe council to knock back a development on the southern edge of the town, saying it was \"likely\" the land was a \"significant\" habitat for wombats, although the Native Vegetation Council said they appeared to have abandoned it.\n\nMore recently, the Environment, Resources and Development Court has directed the council to approve the land to be cleared for 18 new housing blocks.\n\nAn abandoned wombat burrow seen on the subdivision site in Robe. (Supplied: Native Vegetation Council)\n\nAfter previously advising the council to refuse the subdivision, the Native Vegetation Council approved the land clearing after the developer reached an agreement with the Robe Golf Club to protect 40 hectares of coastal dune vegetation in exchange for 1.5 hectares of land to be razed for housing.\n\n\"We have approval to clear the entire block — it only took three years and $550,000,\" one of the men behind the development, Warren Tucker, said.\n\nCo-existence possible\n\nWombats SA owns 29 hectares of land just east of the main part of Robe, known as Cullen Reserve.\n\nVolunteers recently visited to remove weeds on the property.\n\nVice-president Peter Clements said the animals appeared to be doing \"quite well\", with lots of droppings at the site.\n\nHowever, he said some of their habitat had been taken up by housing over the past two years.\n\n\"There is a new housing development where there would have been a lot of wombat habitat, so they may have to go elsewhere and they're looking around for places and bowling greens might be very tempting,\" he said.\n\nA wombat at Long Gully campground in Little Dip Conservation Park, near Robe. (Supplied: Rob Brooks)\n\nLuckily for wombats, though, Dr Clements said home owners were \"delighted\" to see them and friendly towards them, even if they left holes and cube-shaped faeces.\n\n\"It's a bit of a difficult balance, but as long as people are aware of them and not destroying them or willingly destroying their habitat, it should work,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/world-athletics-championships-steeplechase-tim-van-de-velde/105771466",
        "title": "Steeplechaser stops to help struggling rival at World Athletics Champs",
        "publish_date": "Sat, 13 Sep 2025 22:37:12 +0000",
        "category": "sports",
        "authors": [],
        "text": "As his heat of the men's 3,000 metres steeplechase neared its conclusion at the World Athletics Championships in Tokyo, Tim Van de Velde looked back over his shoulder.\n\nWhat he saw was a fellow competitor gingerly crawling over the last barrier that went terribly wrong for both.\n\nVan de Velde's hopes of qualifying for the final were already crushed.\n\nThe Belgian turned around, put an arm around stumbling Carlos San Martin and helped the Colombian limp to the finish line.\n\nTim Van de Velde (right) fell at a water jump during his heat in Tokyo. (Reuters: Eloisa Lopez)\n\nThe show of sportsmanship on Saturday evening between the 10th and 11th-place finishers came in an otherwise routine heat.\n\nBut it was a highlight of a busy opening night at the World Athletics Championships, even on a day when five gold medals were handed out.\n\n\"I saw him stumbling and thought, 'Why not?'\" Van de Velde said after the race.\n\n\"We both had bad luck, I guess. Maybe we can share some bad luck together.\"\n\nEarlier, Van de Velde was racing at the front of the leading pack as they approached the water pit in the third lap of the heat.\n\nSteeplechasers are required to vault five three-foot-high barriers placed around the track, one of which fronts the two-foot-deep water obstacle.\n\nHe clipped the barrier and fell in the water, and by the time he got up, his hopes were dashed.\n\nVan de Velde raced the rest of the way just to say he finished.\n\nThe 25-year-old is no stranger to these sorts of slip-ups.\n\nHe broke his collarbone after a fall at the European Championships in Rome last year.\n\nAt the 2022 World Athletics Championships in Eugene, he fell into the water and injured his ankle.\n\n\"I know what it's like to feel helpless on the track,\" Van de Velde said.\n\nCarlos San Martin needed assistance as he left the track. (Getty Images: Hannah Peters)\n\nAs does San Martin, who was helped off the track in a wheelchair and did not come through the media's mixed zone.\n\nVan de Velde said it would take time to recover from his latest disappointment.\n\nThe positive news is there is a great chance he will be remembered for something other than where he finished.\n\n\"We're both competitors. We both work very hard,\" Van de Velde said.\n\n\"Of course, the main goal was the final and we both had bad luck, so that's why I did it.\"\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/hungry-ghost-festivities-mark-christmas-island-troubled-past/105747320",
        "title": "Appeasing the hungry ghosts of Christmas Island's painful past",
        "publish_date": "Sat, 13 Sep 2025 22:09:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Twilight on Christmas Island, about 2,600 kilometres north-west of Perth, grows heavy with the memory of lost souls.\n\n\"We know that at least 300, maybe more than 400 Chinese people especially, died in the first 10 years of settlement,\" acting shire chief executive Chris Su says.\n\n\"They were worked to death, essentially, by the regime of the day.\n\n\"We believe that they come back this month every year, so we should make offerings for them and thank them for their contribution to establishing life on Christmas.\"\n\nThe seventh month of the Chinese lunar calendar is known as \"hungry ghosts month\" to Christmas Island residents.\n\nEach Saturday over four weeks, they congregate at one of several Taoist and Buddhist temples scattered across the remote Indian Ocean territory.\n\nCandles are lit and offerings burnt to appease passed ancestors. (ABC Pilbara: Mietta Adams)\n\nChinese communities around Australia and the world mark the festival, but Christmas Island's event pays special homage to its distinct history.\n\nChris Su was born in Singapore amid ongoing medical restrictions that bar island births.\n\nBrought to Christmas Island as an infant, he has observed the ancient tradition all his life.\n\nChris Su has taken part in the ceremony since he was a child. (ABC Pilbara: Mietta Adams)\n\n\"These [ghosts] are people who have died far from home,\" Mr Su says.\n\n\"They didn't get a proper burial, they didn't have any descendants to make them offerings\n\n\" We believe they are hungry, of sorts, in the afterworld. \"\n\nThe festivities are to appease the \"hungry ghosts\" on the island. (ABC Pilbara: Mietta Adams)\n\nOfferings in flames\n\nAbout 100 people meet at a small temple in Drumsite, near a dusty industrial area that still houses the remnants of an incline railway.\n\nLoading...\n\nIn the early 1900s, small hopper cars carried precious mounds of phosphate through the neighbourhood, moving steeply from jungle quarries to port.\n\nMr Su explains that the temple, tucked away on a now-suburban street, is dedicated to the deity Sheng Wong.\n\n\"He [Sheng Wong] and his two marshals on the left and right of him open the gates of the underworld and let the hungry ghosts pass through to walk the material world to take offerings,\" Mr Su said.\n\nHonouring Sheng Wong, deity of the underworld. (ABC Pilbara: Mietta Adams)\n\nThe former phosphate transport hub is a fitting place for the community to gather.\n\nThe precious mineral, often used in fertilisers, was in high demand in the 19th century, leading to the recruitment of hundreds of indentured workers, or \"coolies\", from China to Christmas Island.\n\nUnder the Christmas Island Phosphate Company, they were forced to dig four-to-seven tonnes per man each day, often with their bare hands.\n\nMoney and incense wrappers are offered to the island's \"hungry ghosts\". (ABC Pilbara: Mietta Adams)\n\nIn 1901, an outbreak of beri-beri killed more than half the labourers, who subsisted almost entirely on white rice.\n\n\"Beri-beri … is a type of deficiency disease, not having enough nutrition, a very painful way to die,\" Mr Su says.\n\n\" It was very, very hard yards working for the British Empire back in the day and for a pittance. \"\n\nOfferings to the restless spirits go up in flames. (ABC Pilbara: Mietta Adams)\n\nWorshippers lay out tables of food and burn paper money in a large bonfire, with hopes the offerings will ease the ghosts' hunger.\n\nBut it is not just the \"coolies\" Christmas Island residents remember.\n\nFifteen children were among 50 Iraqi and Iranian asylum seekers who drowned off Christmas Island when their vessel crashed into its rocky cliffs in 2010.\n\nThe ceremony takes place in the seventh month of the Chinese lunar calendar. (ABC Pilbara: Mietta Adams )\n\nIt was a brutal chapter for an island so closely associated with its immigration detention centre.\n\nThe controversial facility spent decades at the centre of Australia's boat turnbacks policy and was being briefly mothballed in 2018, before it was reopened for pandemic quarantine.\n\nIt remains in a limbo-like \"hot contingency\" state to this day.\n\nIn the aftermath of the 2010 disaster, residents offered a paper boat (bottom), baby shoes, and formula for those who lost their lives. (Supplied: Chris Su)\n\n\"You will see baby formula and baby food and baby shoes at the offering ceremony sites, because baby spirits can't eat adult food,\" Mr Su says.\n\n\" We make formula; we offer it to them. \"\n\nCommunity around the table\n\nFoo Kee Heng, a community elder and committee president of the Drumsite temple, sits at a corner table as people shuffle through, lighting candles and offering prayers.\n\nFoo Kee Heng says offering the ghosts food and money will give people peace. (ABC Pilbara: Mietta Adams)\n\nHe says the ceremony brings peace to the living and the dead.\n\n\"The celebration of this ghost festival, [we] offer them the money, the food and they will give you peace too,\" he says.\n\n\"That's what all this festival is about.\"\n\nIslanders of different backgrounds and generations come together to mark the festival. (ABC Pilbara: Mietta Adams)\n\nAttendees are invited to share in a traditional feast — no small feat on an island where a head of lettuce can cost upwards of $16.\n\nFood offerings are an important part of the ceremony for the \"hungry ghosts\". (ABC Pilbara: Mietta Adams)\n\nPowerful superstitions\n\nDuring the month-long festival, Mr Su warns the scent of frangipanis should be avoided.\n\n\"If you're walking around at night time and you start to smell a very fragrant smell, especially franjipani, it means the spirits are near,\" he says.\n\n\" Avoid cutting your fingernails at night ... [and] don't hang out too close to banana trees. \"\n\nChinese temples are dotted throughout Christmas Island. (ABC Pilbara: Mietta Adams)\n\nYet even the superstitions are a respected part of Christmas Island's colourful cultural tapestry.\n\n\"Christmas Island has a mix of people from the east and the west and what you find here is something that happens in neither the east nor the west today,\" Mr Su says.\n\n\" People just living pluralistically together ... you share the island and you share it with all the people who aren't exactly like you. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/with-a-few-added-pieces-carlton-have-flown-up-the-ladder-aflw/105770732",
        "title": "Inaugural Blue hopes for finals berth after hot start",
        "publish_date": "Sat, 13 Sep 2025 21:34:36 +0000",
        "category": "sports",
        "authors": [],
        "text": "Carlton defender Harriet Cordner said if she was to sum up playing for the Blues right now in one word, it'd be \"fun\".\n\nIf you'd asked her back in January if she expected Carlton to be in the top four come round five, she admittedly probably wouldn't have said yes.\n\nYet the Blues sit in third spot — with games left to play this round — with a high percentage after claiming their third straight win against Gold Coast on Saturday by 46 points.\n\n\"We did all the hard work in the off-season and the pre-season and now Bucky [head coach Mathew Buck] is really leaning into our ability to actually just enjoy what we're doing out there,\" Cordner told ABC Sport.\n\n\"We've added speed with the ball to our game plan and I think you can see that. And so it's fun to play in.\"\n\nHarriet Cordner joined Carlton for the 2023 season. (Getty: Robert Cianflone)\n\nCarlton made the grand final in 2019, back when the league was in a conference system, yet fell to Adelaide by 45 points at Adelaide Oval in front of 53,034 people.\n\nThe Blues looked a chance to make the following decider after qualifying for a preliminary final the next year, but the 2020 season was cancelled during finals due to COVID.\n\nHaving not made finals since, the club then attempted to navigate somewhat of a rebuild while the competition went through expansions in 2020 and 2022.\n\nThey lost significant players to expansion teams, including league best and fairest Maddy Prespakis and goal sneak Georgia Gee to Essendon, Lucy McEvoy to Sydney and Grace Egan to Richmond.\n\nJust Darcy Vescio, Pound and Breann Moody remain from the 2017 side.\n\nLast year the Blues finished 14th on the ladder and 12th the year before that.\n\nSaturday's win was the first time they have won three consecutive games since 2022, which included a shock upset victory against the reigning grand finalists Brisbane in round three.\n\nCarlton kicked seven goals to nothing in the second half to run away from Gold Coast. (Getty: Robert Cianflone)\n\nSidelined inaugural Blue Gab Pound said it felt like the club was turning a corner this year. Something that has been exciting to watch, if not difficult having to watch on given her shin injury.\n\n\"It really feels like we're [in] a little turning point here,\" Pound told ABC Sport.\n\n\"There isn't many in our team from that 2019 grand final … But I'm really hoping that we can play some really continuous and good football and hopefully have some sort of finals berth year.\n\n\"Early wins at the start of the season are so important for everything, for not only the points, but also the belief coming into the rest of the season.\"\n\nPart of the change at Carlton has been the few added list pieces, including former Suns captain Tara Bohanna, and the young talent coming through in Sophie McKay (three goals against Gold Coast), Poppy Schloz and Lila Keck.\n\n\"The depth that we're running on the entire list is something that's really exciting,\" said Pound, who is expected to be available for selection come round seven or eight.\n\n\"I know when I'm going to try and get back into the side, it's going to be really hard, but that's something that we really want.\"\n\nIn his third year as Carlton head coach, Mathew Buck has seen the Blues start 4-1. (Getty: Michael Willson/AFL Photos)\n\nIn the third year under Buck, Cordner said the Blues have wanted to move the ball quickly.\n\n\"We've added speed with the ball to our game plan, and I think you can see that,\" Cordner said.\n\nPound agreed, and said there'd been a focus on \"really brave and exciting\" footy.\n\n\"We really recognised that our fundamentals were something that we really wanted to work on,\" Pound said.\n\n\"Bucky, he's changing a few things and adapting for us, and it's really working.\"\n\nThat game plan will be properly challenged next week as Carlton front up against the reigning premiers and undefeated North Melbourne at Arden Street Oval before facing Fremantle back at their home in Princes Park.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/why-regional-victorians-are-angry-at-state-government/105761034",
        "title": "'White-hot anger' in the bush as Victorians take on Allan government",
        "publish_date": "Sat, 13 Sep 2025 21:31:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Yellow has become the colour of discontent and defiance in rural Victoria.\n\nBright yellow volunteer firefighter overalls are draped on fence lines and outside country fire stations in protest at the Emergency Services and Volunteer Fund announced in the May state budget.\n\nFormerly known as the Services Property Levy, the Victorian government says the increased tax will provide a broader range of disaster response services.\n\nCFA volunteers have been hanging up their uniforms in protest at the Emergency Services and Volunteers Fund. (ABC Rural: Warwick Long)\n\n\"We stand ready with well-resourced emergency services to help those communities in the event of a natural disaster,\" Victorian Treasurer Jaclyn Symes told Landline.\n\nBut many country people, like western Victorian farmer and Country Fire Authority volunteer Pat Millear, are not buying that explanation.\n\nA message for Premier Jacinta Allan at a bakery in Willaura, western Victoria. (Landline: Tim Lee)\n\n\"It's an absolute kick in the guts for them [volunteer firefighters] to be told that they're going to have to pay into an emergency services volunteer fund,\" Mr Millear said.\n\n\" All they're doing is just putting money in their big black hole in Melbourne. \"\n\nPat Millear says the fund is a \"kick in the guts\" for volunteer firefighters. (Landline: Tim Lee)\n\nMr Millear has publicly opposed the levy at protest rallies, including one outside Parliament House in Melbourne, when farmers filled city streets with tractors.\n\nFurther rallies about a range of grievances are planned for regional centres.\n\nMs Symes defended the new volunteer levy and said all Victorians must pay it as part of their local government rates.\n\nThis year, they will rise by an average of 29 per cent for residential property owners and about 63 per cent for commercial and industrial properties.\n\nPrimary producers have been granted a temporary pause on increases this financial year, but the variable rate for them will increase significantly after that.\n\nAn effigy dressed in Country Fire Authority overalls, part of a protest at Gre Gre, north-west Victoria. (Landline: Tim Lee)\n\nIts representative body, Rural Councils Victoria (RCV), sought legal advice on how to avoid collecting the levy for the state government, but found councils were compelled to do so.\n\nRural Victoria rates notices now include disclaimers explaining the increase is due to the state government levy.\n\nCorangamite Mayor Kate Makin, the RCV's South West Region representative, warns that if residents refuse to pay their rates, councils will have to use their own finances to pay the levy.\n\nKate Makin says rural councils are also unhappy about the state of roads. (Landline: Tim Lee)\n\nThe levy is just one RCV grievance.\n\n\"We've got multiple taxes, we've got housing shortages, childcare shortages, workforce shortages and, of course, our roads,\" Cr Makin said.\n\nEmergency services levy anger Photo shows Firefighters walk between a row of emergency vehicles. The backlash against Victoria's emergency services levy is intensifying and some councils fear refusal to pay will generate a revenue shortfall.\n\n\"I would say most are undriveable and we are sick of not being able to make this infrastructure and make our communities better going forward.\n\nMs Symes said she was well aware of the challenge of poor roads.\n\n\"Roads is probably the issue that I hear about the most,\" she said.\n\nPotholes at Timboon, south-west Victoria. (Landline: Tim Lee)\n\n\"We are spending almost $1 billion on maintenance. That is something that we're very much focused on as a government.\"\n\nRenewable energy infrastructure is also highly contentious.\n\nSheep and crop producer Jason Barratt, of Gre Gre, in Victoria's north-west, said he and others who own property in the path of massive high-voltage transmission lines would willingly risk heavy fines to halt the proposed work.\n\nJason Barratt says he is prepared to risk heavy fines to stop transmission lines on his Gre Gre property. (ABC: Kyle Harley)\n\n\"We don't want these transmission towers, these 280-metre tall wind turbines, batteries, solar panels. We just don't want that out here,\" Mr Barratt said.\n\n\"We don't want this environment destroyed.\"\n\nProtest signs opposing power transmission lines at Gre Gre, in the Northern Grampians. (Landline: Tim Lee)\n\nThe treasurer conceded building renewable power infrastructure on private farm land could have been handled better in the past.\n\nBut she defended her government's recently passed legislation that imposes heavy fines on people who obstruct power infrastructure as in line with other jurisdictions.\n\nKatherine Myers, a potato farmer and vice-president of the Victoria Farmers' Federation, labelled it a heavy-handed escalation in the conflict.\n\nKatherine Myers says there is anger over penalties for people who obstruct power infrastructure. (Landline: Tim Lee)\n\nShe said people were angry that police could be used to \"force access on farms, where farmers don't want that, and that fines will be issued up to $12,000 for an individual and $50,000 for a business\".\n\n\"It just feels like a punch from the city, saying rural Victoria doesn't matter,\" Ms Myers said.\n\nMs Symes said the government wanted to work with farmers and compensation was available if properties were affected.\n\n\"That's why we've set up the community benefits fund to ensure that communities can come to government and talk about things that are important to them,\" she said.\n\nMs Myers wants the Western Renewables Link, set to be built across her family property, to be installed underground.\n\nBut Ms Symes said that option was both too expensive and ineffectual.\n\nJaclyn Symes lives in regional Victoria and says she understands the issues facing rural residents. (Landline: Tim Lee)\n\nShe said she was sympathetic to the challenges facing rural Victorians but believes their discontent is also due to drought, the high cost of living and interest-rate pressures.\n\nBut Cr Makin said there were more rural challenges and listed proposed mining projects on agricultural land, regional job cuts to the Agriculture Department, housing shortages and a declining rate base for councils.\n\n\"Our communities are really resilient but that resilience is wearing very thin,\" Cr Makin said.\n\nFarmer outcry over new electricity laws Photo shows A replica transmission tower is burned. Farmers say they will continue to refuse access to transmission line builders, despite the passing of legislation that could see them arrested for doing so.\n\nMr Barratt said rural Victorians were fed up with feeling neglected by what he described as a city-centric government.\n\n\"At the moment in our community there is white-hot anger,\" he said.\n\n\" People are at their wits' end. \"\n\nThe treasurer said rural Victorians had to be patient and trust her government.\n\n\"We are passionate about rural and regional Victoria,\" she said.\n\n\"We're listening to you, we're responding to your needs, we're making tough decisions but we're putting you at the front of those decisions.\"\n\nWatch ABC TV's Landline at 12:30pm AEST on Sunday or stream anytime on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/world-famous-bee-sanctuary-under-threat-from-parasite/105766650",
        "title": "World-famous bee sanctuary under threat from destructive parasite",
        "publish_date": "Sat, 13 Sep 2025 21:20:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Shawn Hinves and his family have created an idyllic life for themselves on their Kangaroo Island farm.\n\nFrom the verandah of their home, they can see their sheep, goats, cows and two pet kangaroos.\n\nKoalas lounge in the trees that they planted 20 years ago.\n\nBut at the heart of their existence is one fascinating insect, the Ligurian honey bee.\n\n\"It's sort of changed my whole life completely,\" Shawn Hinves, a former tyre fitter said.\n\n\"They've been recognised as the most pure strain of Ligurian bee left in the world.\n\n\"I have a great appreciation of what they are, what they do, and everything that they produce has a positive effect on the human body.\"\n\nKangaroo Island is home to purest strain of the Italian Ligurian bee. (ABC News: Che Chorley)\n\nThe Ligurian bees were brought from Italy to the island, 13.5 kilometres off South Australia's Fleurieu Peninsula, in 1884 and it was declared a sanctuary in 1885. It is said to be the oldest bee sanctuary in the world.\n\nThere are now five-to-six commercial beekeepers on the Island that have opened shops and tourism operations, running beekeeping tours and employing more than 50 locals. There are also up to 100 hobby apiarists who keep hives on the island too.\n\nBut their bees and the businesses they sustain are now facing perhaps their greatest threat as the Varroa destructor spreads quickly across Australia.\n\nThe island's industry is under threat from the deadly Varroa mite that arrived in Australia in 2022. (ABC News: Che Chorley)\n\nThe deadly mite was first detected in the Port of Newcastle in NSW, in June 2022 and has since spread to Victoria, Queensland, ACT and two weeks ago, was found in South Australia for the first time.\n\nSouth Australian Apiarists Association president Brenton Davis said the mite would have a \"big impact\" and more needed be done to protect Kangaroo Island's bees.\n\n\"It's an internationally-significant population and very much needs to be protected,\" Mr Davis said.\n\n\"[Varroa] is one of the most significant pests the Australian beekeeping industry has ever seen, so it's going to have a big impact on the industry.\n\n\"We need to do everything we can to in order to stop the Varroa from getting to Kangaroo Island.\"\n\nMr Davis says more needs be done to protect Kangaroo Island's bees from Varroa mite. (ABC News: Stephen Opie)\n\nThe mite is about the size of sesame seed, but can wipe out hives with thousands of bees.\n\n\"It actually drills a hole into the bee and then lives on the bee's fat deposits,\" Mr Davis said.\n\n\"So, opening up the bees to the susceptibility to viruses it weakens them and it can actually kill out colonies quite quickly.\"\n\n'Ferocious' mite\n\nAttempts to eradicate the mite from Australia were abandoned in September 2023 with the national strategy now aimed at slowing the spread.\n\nBut that has proved difficult as bees are regularly transported across state borders to help pollinate different crops, including almonds. It was bees brought in from Queensland that led to the Varroa mite reaching SA's Riverland.\n\nThe former tyre-fitter turned beekeeper began as a hobbyist before his passion became his vocation. (ABC News: Che Chorley)\n\nShawn Hinves said greater effort should have been taken to contain the Varroa mite.\n\n\"It's very frustrating … if the end game is just to get Australia infected and just deal with it that way, then that's just how they're gonna do it,\" Mr Hinves said.\n\n\"But if they're serious about biosecurity and protecting beekeepers, the food industry, and everything that wraps around it, then they need … to have more regulation, more rules, higher monitoring, but I just don't think that they're putting enough time, enough effort, enough staff into these big issues.\"\n\nLegislation in South Australia forbids people bringing a number of products to Kangaroo Island. (ABC News: Che Chorley)\n\nBrian Morrison is a retired diver who lives in picturesque Emu Bay and is one of the island's enthusiastic hobby beekeepers.\n\n\"They are just a fascinating critter, and the more you learn, the more you find out you don't know anything about them,\" Mr Morrison said.\n\nMr Morrison, like most of the island's beekeepers, is worried that there are not enough biosecurity checks being put in place to protect the bees on the island.\n\n\"I am very, very concerned that we're it's not being taken seriously by the government,\" Mr Morrison said.\n\n\"The Varroa mite … that thing is ferocious and in … three-to-four years it will just completely wipe out a hive.\n\n\"We've got a unique opportunity to protect it, but they're going to have to start looking seriously at beefing up the biosecurity, something similar to the West Australian border, where every vehicle is stopped and searched.\n\nBrian Morrison is one of up to 100 hobby beekeepers who keep hives on Kangaroo Island. (ABC News: Che Chorley)\n\n\"At the moment, these guys at the biosecurity do a good job, but they basically just ask you, 'do you have honey?' So, if you're a dishonest person or you're having a problem with language, which we've found that people from overseas are bringing honey in and not realising because they didn't understand the biosecurity officer.\"\n\nFrontline checks\n\nPrimary Industry Minister Clare Scriven defended the South Australian Government's Varroa management strategy but said she did want to boost frontline services.\n\n\"No used bee equipment can go to the island, no honey products can go to the island, no hives can go to the island,\" Ms Scriven said.\n\n\"We have our checks at the ferry terminal.\n\n\"We're certainly happy to expand that if it is necessary and I've been speaking with my department today about the staffing levels that we have there and they're currently recruiting for extra staff.\"\n\nMany hives on the island are still recovering following bushfires in 2019/2020. (ABC News: Che Chorley)\n\nThe threat of the Varroa mite comes as the island's honey production levels remain low.\n\nThe 2019/2020 Kangaroo Island bushfires wiped out many hives on the western end of the island and trees in the area are yet to start producing nectar that the bees collect for honey production.\n\nBev Nolan's family owns Clifford's Honey Farm, which has three generations working in the business, and employees 14 people.\n\n\"There's still a lot of areas that either got wiped out completely or are still in recovery mode,\" Ms Nolan said.\n\nBev Nolan says the Ligurian bees have been vital to Kangaroo Island's tourism industry. (ABC News: Che Chorley)\n\nMs Nolan said her family had upgraded its shop and diversified products to keep it profitable.\n\n\"The Ligurian bees are a really big tourist story,\" Ms Nolan said.\n\n\"It's also … important for the world to have a honey bees that are nice and calm and hardworking and isolated from pests and diseases as well.\"\n\nBut as the threat continues to grow, some like Brian Morrison are considering their future in the industry if Varroa mite makes it onto the island.\n\nThe bees were brought to Kangaroo Island in 1884. (ABC News: Che Chorley)\n\n\"I'll probably end up getting out of beekeeping, I think that's what will happen,\" Mr Morrison said.\n\n\"I'll be devastated, and you know, maybe then I'll start looking and moving somewhere else … that's how I'm feeling already.\n\n\"This algal bloom [after the fires] has kind of been like the last straw.\n\n\"I do love it here and the people that live here are fantastic and we do have a good life, but [there] just seems to be one thing after the next at the moment.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/premier-league-ange-postecoglou-nottingham-forest-arsenal/105771400",
        "title": "Postecoglou faces 'Tottenham in disguise' jibe in Forest debut",
        "publish_date": "Sat, 13 Sep 2025 21:20:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "Ange Postecoglou has promised a quick response after a brutal re-introduction to the Premier League, with Nottingham Forest defeated by Arsenal 3-0.\n\nPostecoglou was appointed Nottingham Forest manager on Tuesday following the sacking of Nuno Espírito Santo.\n\nThe move came three months after Postecoglou was let go by Tottenham Hotspur.\n\nGiven Arsenal's rivalry with Spurs, the Australian was taunted mercilessly by the Gunners' home crowd as he watched his new Forest charges succumb from the sidelines.\n\nThey chanted, \"Are you Tottenham in disguise\", as the goals rolled in for the Gunners.\n\nWhile admitting the result was a \"disappointing\" start to life at Forest, Postecoglou insisted there was no time to waste as he looks to get his side firing, starting against Swansea in the Carabao Cup on Thursday AEST.\n\nAnge vows to take Forest back to the top Photo shows Ange Postecoglou claps his hands after a Tottenham win in the Premier League. Nottingham Forest fans have been made a promise by Ange Postecoglou that he'll give his all to help them bring back their glory days.\n\n\"This is not a project,\" Postecoglou told reporters.\n\n\"This football club had a strong season last year, they need to be stronger this year, and my job is to get us to where I want us as quickly as possible.\n\n\"On Wednesday night [Thursday AEST], we will start seeing principles being embedded. It won't take long and I will not let it take long.\n\n\"I will make sure we turn it around because we have an unbelievable opportunity to make an impact this season, and I am not going to let that slip.\n\n\"We've got two sessions before that. We've got another couple of sessions before the next Premier League game, so whatever's happened this week, and how disruptive it's been, we can put a line through it and start looking ahead.\"\n\nPostecoglou said his preparation for the Arsenal match was far from ideal.\n\n\"Seven days ago, their world was totally different to what it was today,\" he said.\n\n\"You've got to understand that. Some players were away on international duty. The other players had the whole weekend off. They only got back in on Tuesday.\"\n\nPostecoglou, who steered Tottenham to Europa League success last season, said he was determined to help Forest achieve success.\n\n\"They're all big jobs,\" he told TNT Sports.\n\n\"I haven't taken over an easy one yet but that's why I'm here. I love the challenge and we'll get to where we want to.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/lord-howe-island-sniffer-dog-sebbi-retires-to-brisbane/105762486",
        "title": "Paradise's four-legged guardian retires from pest-hunting role",
        "publish_date": "Sat, 13 Sep 2025 21:16:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Paradise's four-legged guardian is hanging up his leash.\n\nFor almost a decade Sebbi the springer spaniel has been Lord Howe Island's last line of defence.\n\nAs the longest-serving biosecurity dog on the idyllic land mass, he has helped to keep the island untouched and free of contamination for most of his life.\n\nBoth he and his son Zuma have been invasive pests' worst enemy in the island's battle to preserve its unique natural environment.\n\nLord Howe Island is in the Tasman Sea, located 700 kilometres off the coast of Sydney.\n\nSebbi's pest detection role helped to preserve the island's unique natural environment. (Supplied)\n\nNow, after years of sniffing and scavenging for pests, Sebbi is off to the doggy retirement village — otherwise known as suburban Brisbane with his former handler.\n\nIt is a day everyone on the island who loves Sebbi knew was going to come, especially after he took on an \"ambassador\" role in his later years where he entertained crowds.\n\nAs Sebbi's bright white and copper fur faded, he turned his talents to greeting arrivals at the airport, where he could still put that nose to good use.\n\nAnd it was his keen nose that was vital in playing a mentoring role to the new dogs ready to fill his prior position.\n\nSebbi is enjoying his retirement in Brisbane. (Supplied)\n\nSo what is next for Sebbi? Embracing everything retirement has to offer, including a new sibling.\n\n\"He has settled into our home extremely well and is enjoying going on walks and adventures with his new pup-sister, Lacey,\" his former handler and new owner Saxxon Thompson said.\n\nSebbi has settled into the Brisbane lifestyle well, his owner said. (Supplied)\n\nIt is thanks to Sebbi and his handlers that in 2023 the island was able to report that it had been free of rodents for two years straight.\n\nConsidered a living laboratory by the scores of scientists who conduct research on the island, Sebbi was the knight in shining armour for protecting its over 200 endemic native species.\n\nAdd to your watchlist Photo shows Mystery Road Origin ABC iview with young detective Jay Swan in the bush. The critically acclaimed Mystery Road: Origin returns as Detective Jay Swan (Mark Coles Smith) and Mary (Tuuli Narkle) uncover dark secrets in a haunted timber town, where the past threatens to tear them apart.\n\nFrom endangered palms and at risk coral reefs, there is barely a plant on Lord Howe Island that does not have Sebbi to thank.\n\nBut the change of scenery on the mainland is not all that bad.\n\n\"After years of dedication and hard work, Sebbi's days are now filled with rest, play and endless cuddles on the couch,\" Mr Thompson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/g8-childcare-genius-darren-misquitta-adrian-portelli/105757230",
        "title": "A $26m unorthodox childcare deal with devastating fallout",
        "publish_date": "Sat, 13 Sep 2025 21:06:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "The warning lights were flashing for giant childcare operator G8 Education.\n\nIt had an unorthodox $26 million deal on the line to sell centres to Genius Education, a venture whose subsequent collapse would strand staff and parents, and whose boss Darren Misquitta would later plead guilty to receiving suspected proceeds of crime unconnected to the child care industry.\n\nDespite G8 knowing about problems, an ABC investigation can reveal how the childcare giant downplayed concerns and maintained it had conducted checks.\n\nGold Coast-based G8 even passed on information packages detailing Genius's success to key stakeholders. It was replete with pictures of centres refurbished with sandpits, sunshades and climbing equipment, and glowing references from businessmen including Adrian \"Lambo Guy\" Portelli.\n\nThe deal's fallout was devastating.\n\nDarren Misquitta pleaded guilty last month to receiving $120,000 in suspected proceeds of crime unrelated to the childcare industry. (LinkedIn)\n\n\"Genius is like this thunderstorm that just came in and wiped us all out within months,\" said Samantha White, who resigned as assistant director at one Canberra centre.\n\n\" G8 is accountable for their actions and how this has affected thousands of children and hundreds of educators. \"\n\nG8 is Australia's biggest for-profit operator, running almost 400 centres under brands including Bambino's and Kindy Patch Kids. The ASX-listed company, valued at almost $600 million, is among big corporates in a sector that was, until the early 2000s, more a cottage industry.\n\nA hodgepodge amalgamation of childcare businesses, G8 owned 175 centres by 2012. Its annual report that year featured a giggling infant wearing thick black glasses, with the company crowing operations were going from \"strength to strength\". It kept growing.\n\nBut earnings see-sawed between losses of $189 million in 2020 to profits of $68 million in 2024. Investors savaged shares this year after a former staffer was charged with child abuse.\n\nIn 2023, G8 made a deal to offload 31 outlets to Genius. (ABC News: Joel Wilson)\n\nThe deal\n\nBack in October 2023, red ink oozed from some underperforming centres, so G8 fashioned an unorthodox solution: offload 31 outlets to another childcare operator, Genius.\n\nOddly, G8 would pay $26.5 million to Genius.\n\nThe logic, G8 said, was trading the centres through to lease end would be more expensive than handing cash to Genius, which would take on associated liabilities.\n\nBut the deal immediately raised industry hackles.\n\nThe director of Genius entities was Misquitta, now 41.\n\nHe boasted the trinkets of entrepreneurialism: the black t-shirt of new-wave chief executives and a trophy property — an acreage residence on Victoria's elite Mornington Peninsula. He had Deakin University law and commerce degrees, and a resume in banking, mining, education and private equity.\n\nGenius director Darren Misquitta looked the part of a modern millionaire. (Supplied)\n\nBut harsh headlines about Genius were published before the deal, involving landlords suing over unpaid rent. A key Misquitta family company that largely owned Genius also faced winding up applications.\n\nG8's new chief executive Pejman Okhovat, a retail industry veteran recruited from Big W, reassured stakeholders. He expressed confidence Genius would \"provide the ongoing high level of service that the children, families and our team at these centres expect and deserve\".\n\nG8's new chief executive Pejman Okhovat reassured stakeholders Genius would provide an ongoing high level of service. (Supplied)\n\nThat month, a Genius subsidiary for a Melbourne's Collins Street childcare centre, which boasted an in-house chef, was tipped into court-ordered liquidation, owing $5 million in a lease dispute. The liquidator complained Misquitta had not supplied financial records as required.\n\nMisquitta maintained he would work with the liquidator, and \"external noise\" would not disrupt the G8 deal.\n\nLandlords and Lambo guy\n\nG8 was in a bind. To offload centres, G8 needed to convince landlords to transfer leases to Genius. But some landlords were wary of Genius.\n\nThe ABC has seen information packs from Genius that G8 forwarded to landlords.\n\nThey included accounts, in which Misquitta was listed as sole director of companies, showing earnings within Genius entities.\n\nThere were also pretty photographs of refurbished centres; a once sad-looking centre with a faux grass play area, for instance, was transformed with a cute garden with a tree and water pump.\n\nPhotos showing the refurbishment of Genius centres were included in an information pack to G8 landlords. (Supplied)\n\nThe pitch was Genius could revive poorly performing centres.\n\nThe package also included letters of recommendation.\n\nOne was from Adrian Portelli, the controversial lottery businessman who in 2022 drove up in a yellow Lamborghini to bid $4.5 million on a home for TV show The Block.\n\nAdrian Portelli with a new Lamborghini. (Supplied: Instagram)\n\nIn the letter, Mr Portelli wrote his business had already developed childcare centres and \"Genius has been an excellent tenant\".\n\nMr Portelli told the ABC the business had an agreement with Genius to lease centres but they ultimately were not tenanted.\n\n\"After that letter, [Misquitta's] and Genius' issues surfaced, so we terminated those agreements,\" he said. \"I did not have direct dealings with him.\"\n\nAdrian Portelli was among those who wrote a letter of recommendation for Genius. (ABC News: Lisa Batty)\n\nSome financial information also concerned landlords. A Genius group balance sheet, for instance, was bolstered by millions of dollars owed by other Misquitta-linked entities.\n\nLandlord Fiona O'Donnell and extended family had three childcare properties with G8 — they transferred one lease to Genius but withheld two more.\n\n\"We were not comfortable about the standing of Genius,\" she told the ABC. \"The financial information provided appeared to be smoke and mirrors.\"\n\nThe pledge\n\nThe 26-storey Brisbane offices of law firm Allens is the opposite of a childcare centre — the windows reveal a spectacular CBD view, but the meeting room itself is sterile.\n\nIt was May 2024, and G8 was holding its annual shareholder meeting. Mr Okhovat, the chief executive — who at centres can wear a company-labelled polo shirt — was dressed in a businessman's tan suit.\n\nG8 admitted the Genius deal was stumbling. Only 17 centres had transferred to Genius — landlords were edgy and regulatory approvals taking time.\n\nMr Okhovat told media that G8 was \"well aware\" of landlord lawsuits entangling Genius, and Genius had provided appropriate evidence \"for us to go ahead\".\n\nPejman Okhovat told media that G8 was \"well aware\" of landlord lawsuits entangling Genius. (Supplied: Instagram)\n\nGiven children were involved, did G8 have a responsibility to ensure centres going to Genius would be open for the long-term?\n\n\"Very clearly and very concisely: Yes, absolutely,\" he replied. \"We exercise our due diligence at the highest level.\"\n\nThat included to ensure \"Genius's financial position was at the right level\".\n\nThree weeks later, the United Workers Union published a letter, complaining Genius was not paying staff wages on time. A landlord also claimed Genius defaulted on rent after acquiring one ACT centre in February 2024. The landlord evicted Genius within a year.\n\nIt goes to questions including whether G8 was blindsided — or simply did not care if centres floundered once off its books.\n\nOne source who has worked with Mr Okhovat regarded him as a straight-dealing businessman, who would have been working to secure a deal genuinely assisting stakeholders. G8 also maintained to the ABC it always intended for \"a continuity of care and employment for families and team\" in the Genius deal.\n\nThe opposite happened.\n\nThe takeover tragedy\n\nMs White's G8 facility in Gowrie, on Canberra's southside, was originally called the Blinky Bill early childhood centre, after the cute koala book character.\n\nIt was a well-performing centre, Ms White said, and staff fretted after hearing of Genius services potentially lacking resources and wages were not being paid elsewhere.\n\nSamantha White resigned from her role after the Genius takeover. (Supplied)\n\nWorried staff even stocked up on extra supplies such as nappies while G8 remained owner.\n\nAfter the transfer, wages were late on the first payday. Then long-planned fixes, such as of fencing and sandpits, also stopped, she said.\n\nMs White fumes at reassurances G8 provided about Genius.\n\n\"It was all lies. You know, we had a full team here at the service and you know, we had beautiful families,\" she said.\n\nEighteen centres ultimately were signed over; Genius shut 12 between August 2024 and March this year. The Gowrie centre is one of five still trading under administrators WLP Restructuring.\n\nEighteen centres were signed over and Genius shut 12 between August 2024 and March this year. (ABC News: Joel Wilson)\n\nThe administrators' initial investigations are damning. WLP wrote the Genius subsidiary that acquired the G8 centres may have been insolvent upon commencing trading.\n\n\"The director [Misquitta], through related companies, continued to withdraw funds from [that subsidiary and another running centres] resulting in insufficient funds being available to meet the payment of employee wages and statutory liabilities,\" they wrote.\n\nAdministrators also uncovered concerns about accounts for the other subsidiary, alleging amendments were made transforming a balance sheet from an insolvent position of $40 million to a positive $50 million.\n\n\"We do not consider that the financial accounts provide an accurate reflection of the true nature of the transactions,\" they wrote.\n\nIt's not clear which Genius company received G8's cash (at least one entity is not in administration). G8's accounts indicate up to $10 million went to Genius.\n\nBreak-ups and bankrupts\n\nMisquitta is bankrupt and his marriage has broken down, a court heard. The Mornington estate is gone, seized and sold by lenders.\n\nHe pleaded guilty last month to receiving $120,000 in suspected proceeds of crime in 2019, drawn from a business loan from a venture not associated with the childcare deal. Attempts to obtain comment from him were unsuccessful.\n\nG8's chief executive Mr Okhovat, whose take home pay last year was $1.5 million, declined to comment to the ABC.\n\n\"If you have any more questions you can send them via email,\" he said briefly. \"Thank you. Appreciate it. Bye.\"\n\nG8 acknowledged people \"may be impacted\" by Genius's takeover. (ABC News: Lucas Hill)\n\nG8 emailed anodyne statements that did not answer questions, but argued regulators and landlords had consented to Genius deals.\n\nIt acknowledged people \"may be impacted\" by Genius's takeover.\n\n\"However, as G8 Education no longer owns or operates these centres, questions regarding their operation following the change of ownership should be addressed to Genius,\" it said.\n\nMs O'Donnell, the landlord, also owns G8 shares and questions checks done on Genius.\n\n\"The CEO should be accountable for the due diligence performed and explain how the obvious was missed,\" she said. \"The staff, families and children were treated so poorly.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-14/fear-of-being-cringe-is-holding-young-people-back/105762928",
        "title": "Young people want to avoid being seen as 'cringe' but there's a cost",
        "publish_date": "Sat, 13 Sep 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Marshall and his friends Ashton, Chad, Noah and Lucas see cringe-worthy content on social media a lot.\n\n\"I'd say it's pretty popular,\" says Marshall, 18, from Adelaide.\n\n\"It's probably the fact that it's stupid, which makes it fun,\" Noah says.\n\nEven though it can be fun, being cringe in any way is something many young people want to avoid at all costs.\n\nChad says: \"It can be funny sometimes, but just depends on what it is.\"\n\nMarshall, Ashton, Chad, Noah and Lucas see cringe content on social media. (BTN High: Michelle Wakim)\n\nSo, what is cringe?\n\nWhy we love (and hate) cringe TV Photo shows Still of Jan sitting on Michael's lap in The Office episode The Dinner Party Could laughing at awkwardness actually help us release some of our own complicated feelings about it?\n\nThe Oxford Dictionary defines \"cringe\" as an inward feeling of acute embarrassment or awkwardness.\n\nIt has been a storytelling device used in movies and popular TV shows, such as US sitcom The Office, for a long time.\n\nMore recently, it has appeared in advertising and online content, generating engagement by evoking strong emotions while being relatable to audiences.\n\nFrom fashion to social media posts\n\nHowever, cringe culture has now taken the word beyond the dictionary definition.\n\nSometimes it is a compliment, sometimes it is an insult, and working out what makes us cringe in a good or bad way is subjective.\n\nFor Henry, 12, dance videos on TikTok and the hit Netflix movie KPop Demon Hunters are cringe.\n\nAva, 20, has a similar definition.\n\n\"When people try to do thirst traps [raunchy posts] on TikTok,\" she says.\n\nCringe brings different things to mind for Jorja and Ava (left), pictured with Taylor and Aida. (BTN High: Michelle Wakim)\n\n\"Cheese grater jeans, to be honest,\" Jorja, 20, says.\n\nFor others, cringe is harder to define.\n\nNoah says: \"Probably something that's, like, really out of the ordinary, not just unique.\"\n\n\"Being cringe is like, you're sort of acting uncool,\" Tianyi, 19, says.\n\nAsha, 17, says: \"People just being odd in public and then people giving them strange looks makes me cringe.\"\n\nLoading...\n\nFear of being 'cringe'\n\nPsychologist Lauren Zannettino says the word \"cringe\" is now being used more often to describe how we think someone else should feel.\n\nLauren Zannettino says cringe is causing young people to be anxious and self-conscious. (BTN High: Michelle Wakim)\n\nShe says cringe is being used \"as a way to bully other people\" and she is noticing a change in young people's behaviours.\n\n\"It's causing a lot of anxiety and worry about how we're being perceived,\" she says.\n\nWhy is no-one dancing? Photo shows DJ playing a set in a Perth nightclub DJs think mobile phones might have killed the dance floor.\n\n\"I've noticed that young people are more self-conscious around trying new things.\n\n\"They're stopping themselves from being authentic … and doing the things that they want to do out of fear that it's going to be filmed by someone and posted online.\n\n\"Or that someone will look at it and think that what they're doing is embarrassing.\"\n\nTianyi, 19, is conscious of what he says around friends.\n\n\"I feel like I can't say something because they might see it as a bit weird,\" he says.\n\nTianyi says he is conscious of being seen as weird by friends. (BTN High: Michelle Wakim)\n\nNoah thinks it also has to do with people being more judgemental nowadays.\n\n\"People are just afraid to be embarrassed in front of a lot of people,\" he says.\n\n\"I don't think it affects the way I behave. But you don't want to do anything just in case you can be seen as cringey,\" Ava says.\n\nLauren says while people were critical of others before the advent of social media, \"now we're really comfortable with being judgemental to someone via comment online or by sharing it\".\n\nThis cringe-averse mindset can have negative impacts on how young people present themselves, especially when it comes to dating or meeting new people.\n\n\"Cringe culture in dating is definitely a real thing and sometimes I hold myself back, not just with dating, but also meeting new people in general as well,\" Tianyi says.\n\nSarah, 16, and Asha reckon lots of young people act the same as one another to try to fit in.\n\n\"They want to be seen as, like, a normal person to the person that they're dating,\" Asha says.\n\nSarah and Asha say many young people want to fit in and be seen as \"normal\". (BTN High: Michelle Wakim)\n\nImpact on work and study\n\nIt is not just a problem for young people's personal lives.\n\nWhen it comes to education, teachers and university lecturers around the world say, anecdotally, students now tend to be less likely to speak up or take part in open conversations — something Taylor, 19, has experienced.\n\nIn her university classes, Taylor has to take part in pretend scenarios.\n\n\"Sometimes it's just very cringe,\" she says.\n\nThen, there is the workplace.\n\nCringe culture may also be affecting the way young people behave in their personal lives and at work. (Adobe stock)\n\nA study from Intelligent.com surveyed 966 business leaders in the US last year and found one in six were reluctant to hire Generation Z employees, saying a lack of motivation or initiative, lack of professionalism and attitude were concerns.\n\n\"I feel like some people don't want to sort of over-achieve because they feel like, oh, they're try-harding,\" Tianyi says.\n\nAshton, 18, says: \"I've seen people scared to do what they want to do because they're scared of being cringe and how others see them.\"\n\nTo be cringe is to be human\n\nLauren Zannettino says being cringe is a totally normal human experience and something to be embraced.\n\n\"In order to be free, we have to be a little bit cringe,\" she says.\n\n\" Instead of saying, being cringe is being shameful, we need to look at it as a sign of authenticity and vulnerability. \"\n\nSubscribe to the BTN Newsletter Photo shows BTN Logo with the letters b, t and n in a comment bubble shape. Do you want to be notified when the next BTN High stories arrive? Join our weekly newsletter.\n\nLucas says there isn't any way to avoid being cringe.\n\n\"So, if it happens, oh well,\" he says.\n\nHenry reckons the key is for young people to do what they like and not care what others think.\n\nSarah thinks people should just be themselves, as \"no-one is going to remember at the end of the day\".\n\n\"Just be who you are, because whether you're cringe or not, people are going to love you for you,\" Asha says.\n\n\"And it's fun. Like, don't be someone you don't want to be just to fit in with society.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/minns-announces-parramatta-rd-housing-proposal-20250914-p5muvo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Minns announces Parramatta Rd housing proposal",
        "publish_date": "Sun, 14 Sep 2025 11:54:12 +1000",
        "category": "finance",
        "authors": [],
        "text": "Minns announces Parramatta Rd housing proposal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/one-try-toby-asks-albanese-to-give-us-your-money-after-sealing-win-for-sharks-20250914-p5muuk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "One-try-Toby asks Albanese to ‘give us your money’ after sealing win for Sharks",
        "publish_date": "Sun, 14 Sep 2025 11:52:47 +1000",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "Toby Rudolf scores one try a season. No more, no less.\n\nAnd the Sharks’ prop picked a heck of a moment to hit his 2025 quota, scoring in the 75th minute of the Sharks 20-10 elimination final win against the Roosters to put the match to bed.\n\n“I was telling Blayke Brailey all year, ‘Just one (try) mate, all I need is one’,” Rudolf said after Saturday’s match.\n\n“He kept giving me decoys, and tonight he finally listened. Credit to Blayke, it was an eyes up play, 75 minutes in and he nailed it.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/which-nrlw-stars-could-make-a-code-switch-20250914-p5muv6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Which NRLW stars could make a code-switch?",
        "publish_date": "Sun, 14 Sep 2025 10:34:17 +1000",
        "category": "finance",
        "authors": [],
        "text": "Which NRLW stars could make a code-switch?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw4-newcastle-vs-wolves-20250914-p5muv2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW4: Newcastle vs Wolves",
        "publish_date": "Sun, 14 Sep 2025 10:15:13 +1000",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW4: Newcastle vs Wolves\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw4-everton-vs-aston-villa-20250914-p5muv1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW4: Everton vs Aston Villa",
        "publish_date": "Sun, 14 Sep 2025 10:15:01 +1000",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW4: Everton vs Aston Villa\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/why-we-re-holding-on-to-billions-in-cash-but-not-using-it-20250830-p5mr2s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why we’re holding on to billions in cash but not using it",
        "publish_date": "Sun, 14 Sep 2025 09:30:00 +1000",
        "category": "finance",
        "authors": [
            "Madeleine Heffernan"
        ],
        "text": "Heather Lewis is among the 7 per cent of Australians who like to pay for most of their purchases with cash.\n\nLewis, who is in a wheelchair, uses cash to pay for everything but her health insurance. She said the practice helped manage her money and maintain her independence.\n\nHeather Lewis uses cash for almost all her transactions. Credit: Arsineh Houspian\n\nLewis is angry that this month’s Melbourne Royal Show will not allow patrons to buy tickets at the gate with cash. The Show said digital purchases helped it manage crowd flow, save time and reduce queues.\n\n“A lot of us who use cash only feel like we’re being forced to go digital,” Lewis said. “It’s going to get to the point where you can’t do anything [without paying online].”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/drug-smuggling-match-fixing-scandals-and-a-pop-song-who-is-ange-s-new-boss-20250912-p5mujh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Drug-smuggling, match-fixing scandals … and a pop song: who is Ange’s new boss?",
        "publish_date": "Sun, 14 Sep 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Emma Kemp"
        ],
        "text": "Marinakis, who is from Piraeus, on the edge of Athens, and long married with four children, is the founder and chairman of international shipping company Capital Maritime & Trading Corp, having taken over his father’s fleet of seven tankers and grown it into some 120 vessels. In 2018 he merged his fleet with that of Donald Trump’s former commerce secretary Wilbur Ross (Diamond S Shipping), which he later labelled his “worst business decision”. In 2017, he was named Greek Shipping Personality of the Year by British publication Lloyd’s List. Last year, he received an honorary doctorate from the renowned US-based Massachusetts Maritime Academy. He has also been at the forefront of reducing greenhouse gas emissions within the shipping industry, as part of an alliance that founded the Maritime Emissions Reduction Centre (MERC) in Greece. Ange Postecoglou with Nottingham Forest owner Evangelos Marinakis in July. Marinakis the media mogul owns two of Greece’s most influential daily newspapers, Ta Nea and To Vima, and in 2019 launched a Greek television channel, One Channel. His company, Alter Ego Media, is the largest media organisation in Greece. A little-referenced detail is that he has also dabbled in songwriting and wrote lyrics for Greek pop artist Natasa Theodoridou’s smash hit Excitement (Exapsi), which reportedly had 1 million YouTube views within the first six days of its release in 2021. Marinakis’ foray into football started in 2010, when he bought his hometown team Olympiakos and became president. The club has since won 11 domestic league titles and the 2023-24 Europa Conference League.\n\nHe became the majority shareholder of Forest in 2017 when the two-time European Cup winners (1979, 1980) had been struggling in the second-tier English Championship for almost two decades and narrowly avoided relegation to League One. He pledged to restore the club to its glory days and, under his stewardship and Steve Cooper’s management, they earned promotion to the Premier League in 2022 – for the first time since 1999. In 2023, he also acquired Portuguese club Rio Ave. These investments have cemented Marinakis as one of Greece’s most powerful figures, to the point where he was called an oligarch by Greece’s former prime minister and opposition leader Alexis Tsipras. It was not meant as a compliment. This is where the controversial headlines begin.\n\nThe most enduring was a years-long investigation by the Greek state into allegations Marinakis was involved in trafficking the largest amount of heroin ever seized in Europe. The bust involved two tonnes of the stuff with a street value of more than €400 million ($705 million), smuggled into Piraeus aboard a small tanker called Noor One and hidden in warehouses and private homes. The case triggered a war of retribution that has left at least 17 people dead on three continents, and phone records exposed scores of police who the smugglers bought off, from Turkey to the United Arab Emirates. Marinakis was embroiled in 2018, charged with financing and storing drug substances and setting up a criminal group to traffic and sell drugs. He denied any wrongdoing and accused the country’s leftist-led government of plotting against him, which his newspapers described as “a game of many years”. The case was closed in 2021 due to a lack of evidence. Evangelos Marinakis, pictured at a home game at the City Ground last year, has his eye on everything at his football clubs. Credit: Getty Images At the time those charges were laid, Marinakis had just been cleared of his second set of match-fixing charges. The first related to the Koriopolis scandal – irregular betting patterns mostly involving Greek Cup and second-tier games in 2009 and 2010 – and he was acquitted in 2015. The second came in 2017, when he was one of 28 Greek football figures due to face trial as part of the country’s 2015 match-fixing scandal, in which players, referees, club executives and the football federation were accused of fraud, blackmail and forming a match-fixing ring. Eventually most charges were dropped, and courts acquitted all 28 defendants. He was accused of being involved in the 2012 bombing of a referee’s bakery, which occurred days after Olympiakos suffered a 1-0 defeat to Xanthi. The bakery’s owner, Petros Konstantineas, was that game’s referee and claimed he had been pressured before kick-off to ensure Olympiakos “definitely” won. Again Marinakis denied any wrongdoing, and again all charges were dropped.\n\nHe is, right now, being investigated in relation to civil misdemeanours, prompted by the death of a riot police officer who was injured by a flare following an Olympiakos v Panathinaikos volleyball game in December 2023. Allegations once more denied, this time with a claim of a blackmail attempt. Marinakis has taken his fight against the “smear campaign” all the way to the High Court in London, suing Irini Karipidis (chair of Greek club Aris Thessaloniki) and Ari Harow (formerly the chief of staff to Israeli prime minister Netanyahu) for allegedly waging a six-month campaign of “false and defamatory” claims. They include linking him to heroin smuggling and match fixing, and also being head of a criminal organisation known as The System. The libel case was filed late last year; in January, a judge ruled it can continue. Nonetheless, the strenuous denial has been a semi-regular fixture in the repertoire of a man who gets about Greece with black-clad bodyguards but is also known for extensive philanthropic efforts. Marinakis is a former city councillor for Piraeus and still carries out mayor-like duties, personally funding projects such as building playgrounds and soup kitchens. His personal website is replete with stories about his charity work: everything from providing refugee children from Syria, Afghanistan and Iraq with meals, clothing and toys, to inviting Shakhtar Donetsk to play a “Stop War” fundraising friendly against Olympiakos in their first match since Russia’s invasion of Ukraine. In 2018, he donated €1 million to the emergency effort after wildfires killed 103 people and devastated the Attica coastline, and in 2017 coordinated the relief efforts when flash floods hit Mandra, killing 25 people.\n\nThe juxtaposition is weird to reconcile, but then much about him is unorthodox. He reportedly likes the colour red. He does not like the colour green (Panathinaikos’ colour). Or purple (bad luck). Or black (unknown). He has a tattoo on his arm that reads: “Dream, Love, Create, Fight, Survive, Win.” He takes defeat as a personal insult and will threaten – and sometimes take – action. Even if it is the start of the season, as Nuno Espírito Santo learnt this past week. He churns through players and managers at a rate ruthless even to rivals in the notoriously fickle Premier League. So far at Olympiakos he has employed 17 managers. At Forest, Postecoglou will be his eighth. Marinakis celebrates with Olympiakos after winning the 2024 UEFA Europa Conference League final. Credit: Getty Images He likes – needs – to control the narrative. Apparently he even put out feelers to add some British media to his portfolio, offers that were declined. He keeps his cards close to his chest and values privacy. But he can also be volatile in public.\n\nIn 2011, after the full-time whistle in a Olympiakos-Panathinaikos derby (“the derby of the Eternal Enemies”), Marinakis had an on-field row with opposition striker Djibril Cisse that sparked a lawsuit and counter-suit for slander, verbal abuse and threats, and then libel (guess which was which). In 2024, he was banned for five Premier League matches for spitting towards match officials after a 1-0 home loss to Fulham during which the visitors were awarded a penalty on VAR advice but denied Forest two penalty appeals. Marinakis argued he was merely disposing of phlegm, caused by his cigar habit, and the incident was unintentional. “He cannot now remember if any spittle left his mouth but if it did (and he does not challenge that some might well have done) it certainly was not aimed at the referee’s feet and did not hit anybody,” his witness statement read. The English Football Association rejected the defence as “completely implausible” based on statements and CCTV footage, and condemned the action as “an egregious display of disrespectful behaviour”. In May he banned Gary Neville from the City Ground and told Jamie Carragher to “f--- off” for backing his Sky Sports colleague.\n\nAnd, of course, he had stormed onto the pitch to confront the highly respected Nuno after a draw with Leicester City guaranteed the club would compete in Europe for the first time in three decades and took their Champions League hopes out of their hands. Neville called the move “scandalous” in a post on X, which might have had something to do with being denied access to the stadium as a co-commentator later that month. Other observers just couldn’t believe a shipping magnate with a net worth of about $US5.1 billion went in for the kill holding a long-discontinued iPhone 7, complete with wired EarPods. Loading Such public temperamentality is, based on the public record, matched behind the scenes. The Forest boardroom has, at times, been in a state of civil war. The rift with Nuno really ramped up with the July appointment of Edu, Arsenal’s former sporting director, as Forest’s new global head of football. The Brazilian is now one part of an informal triumvirate alongside Marinakis and super-agent Kia Joorabchian, whose extensive portfolio includes Edu. Joorabchian, who runs Amo Racing, has co-invested in a racehorse with Marinakis and appears to have his paws all over his friend’s stable of football clubs. Marinakis, for his part, is said to be so hands-on his staff feel micromanaged. “Marinakis runs that club with the same obsessive influence as a chap who runs a corner shop,” Mail sport football editor Ian Ladyman told the Whistleblowers podcast this week.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/welcome-back-ange-postecoglou-taunted-by-arsenal-fans-as-forest-hammered-20250914-p5muu9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Welcome back, Ange: Postecoglou taunted by Arsenal fans as Forest hammered",
        "publish_date": "Sun, 14 Sep 2025 09:25:19 +1000",
        "category": "sports",
        "authors": [
            "John Percy",
            "Oliver Brown",
            "Daniel Zeqiri"
        ],
        "text": "Ange Postecoglou directs traffic duing the match. Credit: Getty Images “That’s my job to try and embed that over the next few weeks and I’m sure we will because there is a willing group of players to do that. You will see a difference at Swansea on Wednesday night.” Postecoglou did spot some positives, especially with the performance of “brilliant” midfielder Elliot Anderson. The England international was clearly on a wave of confidence after two impressive displays under Thomas Tuchel in the World Cup qualifiers, and was Forest’s stand-out performer. High-pressing was clearly the order for Postecoglou’s new players, but Forest were forced to defend so deep for much of the afternoon that they could barely venture out of their own half. Inspired by the brilliance of new signings Noni Madueke and Eberechi Eze, plus midfielder Martin Zubimendi, Arsenal were irresistible at times. Madueke, in particular, was outstanding and it feels like a trick of the imagination that some Arsenal supporters seemed so averse to his arrival from Chelsea.\n\nArsenal will begin their latest Champions League journey this week away against Athletic Bilbao and this was a delicious response to the defeat at Liverpool before the international break. Arteta clearly has more strength in depth than before, and do not overestimate the presence of a specialist centre-forward in Viktor Gyokeres. Martin Zubimendi of Arsenal scores his team’s first goal past Matz Sels of Nottingham Forest. Credit: Getty Images The only disappointment was a recurrence of Martin Odegaard’s shoulder injury, with the captain joining a casualty list that includes Gabriel Jesus, Kai Havertz and William Saliba. Forest did cope well for half an hour, despite being penned back, but from the moment Zubimendi broke their resistance it was game over.\n\nTime on the training ground over the next few weeks will be precious for Postecoglou. Loading It was Arsenal’s players who took centre-stage, and Zubimendi provided a moment of magic which enabled them to break down their opponents. Chris Wood’s header from a Madueke corner arced into the path of the Spanish midfielder outside the penalty area and he crashed a dipping volley past Matz Sels. Zubimendi’s first Arsenal goal was a masterclass in technique, albeit taking a deflection off Forest centre-back Murillo.\n\nWithout key defender Ola Aina until the end of the year with a hamstring injury sustained on international duty this week, Murillo was withdrawn soon after the goal in clear discomfort. Arsenal required only 46 seconds of the second-half to extend their lead with a goal of brutal simplicity. Eze and Gyokeres combined with the Swede providing the finish, following a lofted pass over the top from Riccardo Calafiori. Postecoglou stood with his arms folded, shaking his head. As Arsenal threatened to overrun his new team, the inevitable chants of “sacked in the morning” echoed around the Emirates. Zubimendi added the third goal 11 minutes from the end with a header from substitute Leandro Trossard’s cross and, in the end, it could have been even worse.\n\nWelcome back, Ange. Meantime, Newcastle United’s new signing Nick Woltemade enjoyed a dream debut, scoring in their 1-0 win over Wolverhampton Wanderers for their first victory of their campaign, while Bournemouth continued their strong start with a 2-1 victory over Brighton & Hove Albion, Tottenham Hotspur cruised to a 3-0 win over West Ham United, and a late Brentford goal denied Chelsea moving atop the table. Fulham recorded their first win of the season by beating Leeds United 1-0 thanks to a late own goal, while Crystal Palace were held to a 0-0 draw by Sunderland and neither Everton nor Aston Villa could find the back of the net in a scoreless draw. Villa have failed to score in their opening four league games of a season for the first time in their history.\n\nChelsea looked poised to leapfrog Arsenal to the top of the table after Cole Palmer scored an equaliser in his return from a groin injury to cancel Kevin Schade’s first-half goal, and Moises Caicedo celebrated what he thought was the winner in the 85th minute. But Fabio Carvalho poked home the equaliser from six yards out in the 93rd after Schade’s long throw-in. “Delighted with the approach of the group, the character we constantly show,” Brentford boss Keith Andrews told the BBC. Micky van de Ven of Tottenham Hotspur celebrates scoring. Credit: Getty Images\n\n“The equaliser came very late but it’s what I felt we deserved from the game in terms of the application, the quality the players showed for large parts.” Newcastle’s new club record signing Woltemade stole the show in Tyneside in their first game since their former hero Alexander Isak departed for Liverpool, scoring in the 29th minute when he arrived at the back post to send a header past Sam Johnstone. “The fact we haven’t won a game puts more pressure on you in the latter stages,” Newcastle boss Eddie Howe told the BBC. “The win was all that mattered but we’d love to win in a better style and score more goals. “It was great to see Nick score on his debut. Very strong, I was very pleased with him.”\n\nTottenham left West Ham languishing in the bottom three, with the Hammers suffering another blow as midfielder Tomas Soucek was sent off for a dangerous tackle. Pape Matar Sarr, Lucas Bergvall and Micky van de Ven all scored second-half goals in Spurs’ first game since executive chairman Daniel Levy’s exit from Tottenham. “So happy that the goal came in the second half because you never know, the momentum can change after half-time but we kept going and scored a good goal after and then 3-0 done,” Spurs boss Thomas Frank said. “So a very good clear win, a good performance and I think we all know the derby and the importance of the game for the fans.”\n\nAt Bournemouth, Alex Scott opened scoring with a brilliant strike from outside the box in the 18th minute. Brighton drew level in the 48th on a goal from Kaoru Mitoma but Antoine Semenyo sealed the victory for Bournemouth’s third win on the bounce with a penalty in the 61st after Evanilson was brought down. “The mood in the camp is perfect. We can’t ask for any more, we just have to keep going,” Semenyo told the BBC. Fulham appeared headed for another draw when Gudmundsson scored a horror own goal from a corner kick in the 94th minute, stooping to head in the ball with great force. Loading",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/federal-government-to-spend-12-billion-on-aukus-submarines-facility-20250914-p5muuj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal government to spend $12 billion on AUKUS submarines facility",
        "publish_date": "Sun, 14 Sep 2025 09:13:52 +1000",
        "category": "finance",
        "authors": [],
        "text": "Federal government to spend $12 billion on AUKUS submarines facility\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw4-fulham-vs-leeds-20250914-p5muue.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW4: Fulham vs Leeds",
        "publish_date": "Sun, 14 Sep 2025 09:08:58 +1000",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW4: Fulham vs Leeds\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw4-bournemouth-vs-brighton-20250914-p5muug.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW4: Bournemouth vs Brighton",
        "publish_date": "Sun, 14 Sep 2025 09:08:38 +1000",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW4: Bournemouth vs Brighton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw4-west-ham-vs-spurs-20250914-p5muuf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW4: West Ham vs Spurs",
        "publish_date": "Sun, 14 Sep 2025 09:06:59 +1000",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW4: West Ham vs Spurs\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw4-crystal-palace-vs-sunderland-20250914-p5muud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW4: Crystal Palace vs Sunderland",
        "publish_date": "Sun, 14 Sep 2025 09:06:37 +1000",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW4: Crystal Palace vs Sunderland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/traveller/inspiration/short-international-holidays-20230314-p5crxs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Quick getaways: The best destinations for a short break",
        "publish_date": "Sun, 14 Sep 2025 08:43:27 +1000",
        "category": "finance",
        "authors": [],
        "text": "Holiday guide\n\nQuick getaways: The best destinations for a short break\n\nLess taxing on the wallet and easier to plan than a longer trip, short breaks are the antidote to the daily grind. Immerse yourself in nature on a guided walk, sleep beneath the stars, or jet off to a tropical island and lose track of time. Traveller’s special annual report is once again bursting with short-break inspiration at home and overseas. Because let’s face it: who doesn’t love the spontaneity, and simplicity, of a last-minute getaway?",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/torrie-lewis-breaks-her-own-australian-100m-record-at-world-athletics-championships-2025/3md4p5y2e",
        "title": "Torrie Lewis breaks her own Australian 100m record at World Athletics Championships 2025",
        "publish_date": "Sat, 13 Sep 2025 23:30:25 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian sprinter Torrie Lewis has made light of a stacked field and a headwind to smash her own national 100m record and storm into the semi-finals on day one of the world athletics championships in Tokyo.\n\n\n\n\n\nLining up against defending world champion Sha'Carri Richardson from the US, two-time world 200m champ Shericka Jackson from Jamaica and two other runners with career sub-11 second PBs, Lewis could well have been overwhelmed.\n\n\n\n\n\nInstead she was inspired.\n\n\n\n\n\nThe 20-year-old flew out of the blocks on Saturday and held her form in the closing stages to clock 11.08 seconds into a 0.8m per second headwind.\n\n\n\n\n\nShe finished a close third behind Richardson (11.03) and Jackson (11.04), with only the top three in each heat guaranteed to advance.\n\n\n\nLewis stripped two-hundredths of a second from her previous national record of 11.10 set last year in Canberra, with the promise of even better to come in Sunday's semi-finals.\n\n\n\n\n\n\"I was super nervous before this competition because I knew in training that these are the times I can hit,\" she said.\n\n\n\n\n\n\"Actually this is the slowest time in my mind that I had, so hopefully I can build on that.\"\n\n\n\n\n\nLewis was proud of how she handled the cards she was dealt in the heats.\n\n\n\n\n\n\"It was like 'thanks guys for giving me the hardest one',\" she said.\n\n\n\n\"But after I let it sink in I was very glad I had them because I can run with them, and who cares if they beat me, because they're the best in the world ever, almost.\n\n\n\n\n\n\"So I just wanted to run as fast as I could with them and see how I go.\"\n\n\n\nJessica Hull wins 1500m heat\n\nLooking every inch the runner who claimed a historic silver at last year's Paris Olympics, Jessica Hull was a commanding winner of the first of three women's 1500m heats.\n\n\n\n\n\nHull sat near the front for the duration of the race and covered all moves in the final straight to win in 4:04.40.\n\n\n\n\n\nShe will be joined in Sunday's semi-finals by compatriot Linden Hall, who was fourth in her heat.\n\n\n\n\n\nHull showed no after-effects from her shocking defeat at the recent Diamond League final in Zurich when she ran out of gas and was pipped on the line by Kenyan Nelly Chepchirchir.\n\n\n\nJessica Hull kept a close eye on the chasing pack as she won her 1500m heat at the world titles. Source: AP / Matthias Schrader \"It's hard when it's the first race after something like that so I definitely was a little bit more intuitive in my body,\" she said.\n\n\n\n\n\n\"I wanted to feel what I was feeling and just trust it.\n\n\n\n\n\n\"I had the gears I thought I would have when I was fully tapered and fresh.\"\n\n\n\n\n\nWatch every session of the 2025 World Athletics Championships live and free across SBS VICELAND, including the World Athletics Championships 2025 Hub via SBS On Demand.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-is-there-life-on-mars-new-research-seems-to-show-there-was-once/ssg4qoqep",
        "title": "INTERVIEW: Is there life on Mars? New research seems to show there was, once.",
        "publish_date": "Sat, 13 Sep 2025 22:30:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-the-new-aged-care-act-and-the-unintended-consequences-preventing-transformational-change/inu3t2y1l",
        "title": "INTERVIEW: The new Aged Care Act and the 'unintended consequences' preventing transformational change",
        "publish_date": "Sat, 13 Sep 2025 22:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nA new law for government-funded aged care in Australia is due to come into effect on November 1.\n\n\n\n\n\nThe commencement of the new Aged Care Act comes more than four years after the final report of the Royal Commission into aged care was handed down, with 148 recommendations for change.\n\n\n\n\n\nThe new law aims to address 58 of the recommendations, including a universal right to aged care based on assessed need.\n\n\n\n\n\nThe Inspector-General of Aged Care, Natalie Siegel-Brown, has conducted a detailed assessment of progress made in implementing the Royal Commission recommendations to date.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/loo-scrolling-study-investigates-link-between-this-bathroom-habit-and-a-painful-health-condition/jil9sefun",
        "title": "Loo scrolling: Study investigates link between this bathroom habit and a painful health condition",
        "publish_date": "Sat, 13 Sep 2025 21:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\n\"I am my phone a lot, like way too much. But the people who use their phone - while they are on the toilet - that is disgusting. And I am one of those people (audience laughter). Sometimes I go to the bathroom and I sit down and I'm like: oh man, I forgot my phone. And I sit there all bored. I wonder what my phone is doing?\"\n\n\n\n\n\nThat's US stand-up comedian Anjelah Johnson-Reyes on Tik Tok, confessing about her phone use while on the toilet.\n\n\n\n\n\nAnd it's not only a phone full of germs you should be worried about.\n\n\n\n\n\nSitting on the toilet for too long and scrolling through your social media accounts or clearing out your emails can increase your risk of developing haemorrhoids.\n\n\n\n\n\nProfessor Rupert Leong is a gastroenterologist based at Concord Hospital in Sydney.\n\n\n\n\n\n\"The theory is that the pathogenesis (way the condition develops) of this vascular swelling is due to straining. So people that sit on toilets especially those that sit on for extensive periods of time and may not be focused on just defecating. They are distracted doing other things whilst defecating i.e. on smartphones. This activity may be prolonging the defecation process, resulting in excessive straining, which can then increase the pressure of the blood vessels that lead to the vascular swelling; and eventually rupture of the vessels that lead to bleeding.\"\n\n\n\n\n\nHaemorrhoids is one of the most common anorectal health conditions in Australia.\n\n\n\n\n\nFlinders University Emeritus Professor Graeme Young is a gastroenterologist.\n\n\n\n\n\nHe says there are number of clear signs of a haemorrhoid.\n\n\n\n\n\n\"Haemorrhoids are in the beginning internal and small. It's only in the modern day TV and news that we would be discussing this sort of detail isn't it? It's only when they start to bulge down a bit through the anus that they become apparent and you can feel uncomfortable in that area. And usually when you're wiping yourself after passing a bowel action you will feel something is not right. You'll even feel haemorrhoids and if they get really big and bulge well yes they're big and bulging and they feel like a couple of grapes in there. You will know if you've got haemorrhoids either because of the physical presence or the suggestion they are there because of the bleeding.\"\n\n\n\n\n\nA new US study published in peer-reviewed PLOS ONE journal surveyed 125 adults, aged 45 and older, who were having a colonoscopy at a hospital in Boston (Beth Israel Deaconess Medical Center).\n\n\n\n\n\nThe were asked how often they used their phones while on the toilet - and for how long.\n\n\n\n\n\nThe survey found 66 per cent of all participants used smartphones while on the toilet, with that group spending more time - over five minutes - on the toilet than non-phone toilet users.\n\n\n\n\n\nChecking the news and using social media were the most common smartphone toilet activities.\n\n\n\n\n\nThe researchers suggest that smartphone use may inadvertently prolong toilet time, potentially increasing pressure in anal tissues, which may then lead to haemorrhoids.\n\n\n\n\n\nProfessor Young says the focus should be on being efficient and strain-free in your bowel movements.\n\n\n\n\n\n\"For people who have a difficult bowel habit in terms of initiating the bowel action, the chances are they are going to be sitting longer on the toilet and straining. What It really boils down to is it's not a good idea to be sitting on the toilet for ages; waiting and hoping for something to happen, and especially straining to achieve that. If you go to the toilet and nothing is happening fairly quickly, you really need to get up and leave it; and come back to it later on.\"\n\n\n\n\n\nThe pain and inflammation from haemorrhoids can often be easily treated with over-the-counter medications from the pharmacy.\n\n\n\n\n\nFor more severe cases, your doctor may prescribe a corticosteroid cream.\n\n\n\n\n\nLess often, a surgical procedure might be needed.\n\n\n\n\n\nAlong with time spent on the toilet, other commonly believed haemorrhoid risk factors, include: low fibre intake, straining, constipation, age, sex differences and pregnancy.\n\n\n\n\n\n\"If there is a real problem of constipation - and by constipation we mean not going to the toilet often enough - then you really need to get the constipation dealt with by dietary fibre; and discussion with the doctor if that doesn't work. So I'm not sure that it's to do with reading the phones (scrolling on the phone). I think people are reading the phones cause they're sitting there waiting for something to happen and what are they going to do? So it's an interesting study, but I think it's more about sitting on the toilet for too long than it is about scrolling down the phone.\"\n\n\n\n\n\nHow are haemorrhoids diagnosed?\n\n\n\n\n\nExperts say you should firstly visit your general practitioner who will ask you about your symptoms and will examine your anal passage to look for any swollen blood vessels.\n\n\n\n\n\nDr Leong says the GP visit could also be useful in ruling out more serious conditions, including bowel cancer.\n\n\n\n\n\n\"The symptoms of haemorrhoids is non-specific so passage of red blood can be something as benign as a haemorrhoid or it can be something more sinister that includes bowel cancer. So anyone who has got bleeding in the bowel should present to the general practitioner who would perform an external examination. Just by looking can help to confirm haemorrhoids however somebody who has not had sufficient investigations they should have a colonoscopy. So I'm talking about someone who hasn't had a colonoscopy before or now getting in the age group where bowel cancer can be common. Then they should present to a gastroenterologist who can then perform a colonoscopy which is a fixable telescope that goes up the rectum into the bowel to have a good view on the inside. I think that's the true way to exclude something sinister.\"\n\n\n\n\n\nDr Kate MacKrill is gastroenterology psychologist at Middlemore Hospital, and a lecturer at the University of Auckland.\n\n\n\n\n\nShe told the Australian Science Media Centre that smartphone use on the toilet might be disrupting gut-brain communication.\n\n\n\n\n\nShe says the human digestive system is controlled by what's called the enteric nervous system - a neural network within the gastrointestinal tract, which is often described as the body’s second brain.\n\n\n\n\n\nDr MacKrill says sitting on the toilet for longer than you need to might start to change the signals the bowel sends, making the bowel unsure whether it has completely evacuated, leading to abdominal pain, actual constipation, discomfort, and an even longer time sitting on the toilet.\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-next-for-the-coalition-after-its-entirely-unedifying-week/asgpia7ch",
        "title": "What next for the Coalition after its 'entirely unedifying week'?",
        "publish_date": "Sat, 13 Sep 2025 20:37:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Coalition needs to learn some hard lessons from a fortnight dominated by fallout after Senator Jacinta Nampijinpa Price falsely claimed Labor was prioritising the intake of Indian migrants to boost its vote, experts say.\n\n\n\n\n\nPrice has since been demoted from the frontbench and Opposition leader Sussan Ley has apologised on behalf of the Liberal Party \"to all Indian Australians and indeed others who were hurt and distressed by the comments\".\n\n\n\n\n\nHowever, despite calls from some Indian Australian figures for a direct apology from Price, that has not been forthcoming. She has, however, said her comments were \"clumsy\" and that she \"never intended to be disparaging towards our Indian community\".\n\n\n\n\n\nLiberal senator Jane Hume said there had been \"mishandling on all sides\" and hoped the Coalition would learn from its \"entirely unedifying week\".\n\n\n\n\n\n\"The good news is, we have cauterised the wound,\" she told Seven's Sunrise on Friday.\n\n\n\n\"We are going to move on now and talk about what's important to ordinary Australians,\" Hume said.\n\n\n\n\n\nBut what are the lessons the Coalition should take from this \"unedifying\" episode, and how should they better connect to \"ordinary Australians\"?\n\n\n\n'Acting like a bunch of babies'\n\nRedbridge director of strategy and analytics Kos Samaras said the imbroglio showed the Coalition still hadn't learned important lessons from the last two elections.\n\n\n\n\n\nThe former Labor Party strategist said that, while it's true that Indian Australians do skew towards supporting Labor, the Coalition needed to take a far more constructive approach to dealing with its lack of popularity.\n\n\n\n\n\n\"With the Labor Party, when we were presented with stats about how Labor was struggling with particular constituencies, we did not reject them … we did not demonise the community that was attached to them. We tried to find out ways to fix that problem,\" he said.\n\n\n\n\n\n\"So, instead of acting like a bunch of babies at a creche, perhaps they need to be professional about their profession and work out ways to fix this.\"\n\n\n\nRedbridge's research showed two-party-preferred support for Labor among Indian Australians in the 2025 election was in the \"mid-60s\", Samaras said recently.\n\n\n\n\n\nMeanwhile, new polling from Roy Morgan suggests that, among Indian-born Australians, 45 per cent back the ALP, compared to 39 per cent support for the Coalition.\n\n\n\n\n\nSamaras said the effect of Price's comments could be comparable to former prime minister Scott Morrison's \"ham-fisted approach\" to the Australian Chinese community, which resulted in many voters from that community turning away from the Coalition.\n\n\n\n\n\nAround 48 per cent of Chinese-born Australians now support Labor, while only 34 per cent favour the Coalition, the recent Roy Morgan poll suggested.\n\n\n\n'They don't like us'\n\nWhile many Chinese and Indian Australians had socially conservative values that the Coalition should be able to appeal to, Samaras said, this opportunity had been squandered by a perceived antipathy towards these groups.\n\n\n\n\n\n\"When we interview Indian Australians in particular … they have socially conservative views on a whole range of issues. We say: 'Well then, why aren't you voting for the Liberal Party?' Their answer is: 'They don't like us'.\"\n\n\n\n\n\nHe said to avoid continuing electoral erosion, the Coalition needs to \"embrace the reasons why diverse Australians come to this country in the first place\".\n\n\n\n\n\n\"And that is to start a family, be prosperous and enjoy a peaceful life. They need to understand that that's why most new Australians arrive here, looking for that life, looking for that prosperity,\" he said.\n\n\n\nSuccessful political leaders in Australia understand that elections in Australia are won from the centre, Samaras said, warning that Price's comments seemed to be imported \"from an environment which is all about mobilising and energising your base\".\n\n\n\n\n\nImporting United States-style culture war issues into a country with compulsory voting was bound to fail, Samaras said, \"because you have to actually find out ways to connect with the disengaged, the undecided\".\n\n\n\n\n\nPrice's suggestion that Labor was prioritising groups of migrants who were inclined to politically support them echoes an accusation commonly made by conservative Americans against the Democratic Party.\n\n\n\n'A cautionary tale to get the house in order'\n\nContinuing fracture in the Coalition will also be poorly received by voters, Zareh Ghazaria, a political scientist in the School of Social Sciences at Monash University, said.\n\n\n\n\n\n\"One of the things that we've seen in Australian politics is that once voters get a sense that a political party is divided over policy, over personnel, then they tend to turn away from that party,\" he said.\n\n\n\n\n\nVictoria, where the Coalition has been out of power for over 10 years, provided federal conservatives with \"a cautionary tale to get the house in order\", he said.\n\n\n\n\n\n\"[The Victorian Coalition] has been rife with internal instability, a party that has had debates about its personnel and policy settings, and voters have responded accordingly by not voting for them,\" he said.\n\n\n\nWhile the Liberal Party has always had ideological divisions, Ghazaria said, \"the trick has been for successful leaders to somehow accommodate both strands\".\n\n\n\n\n\n\"The current situation and the current tension between the more progressive and more conservative Liberals has really been amplified by the fact that it suffered such a heavy loss at the last election,\" he said.\n\n\n\n\n\nFollowing the Coalition's disastrous 2025 federal election result, many Coalition figures pushed for a change of direction.\n\n\n\n\n\nOutgoing veteran senator Simon Birmingham called for \"a reshaping of the party to connect it with the modern Australian community\" and explicitly criticised \"judgemental attitudes that exclude or isolate some\".\n\n\n\nOpposition immigration spokesperson Paul Scarr told The Guardian it was a \"profound tragedy\" that Chinese, Indian and other diaspora communities had turned away from the Liberal Party.\n\n\n\n\n\nIn a television interview this week, he again emphasised the importance of ensuring that debate about immigration \"doesn't become a debate about any particular part of the Australian community\".\n\n\n\n\n\n\"When we're talking about these issues, we're talking about failures of government policy.\"\n\n\n\nA 'contest for what the party stands for'\n\nGhazarian also said if the Coalition wanted to have a debate about immigration, it should be \"a debate that focuses on the government's performance\".\n\n\n\n\n\n\"I think we've seen hints of it, where it's been linked to economic prosperity and service delivery,\" he said.\n\n\n\n\n\n\"That provides the Opposition with a platform to demand more from the government to increase investment in infrastructure, to demand investment in service delivery, to demand investment in schools, education, hospitals, and so on.\n\n\n\n\n\n\"That plays to the Liberal Party's strengths, you'd think, in that it focuses on economic management.\"\n\n\n\n\n\n\"I don't think migration was a huge turning point for this election or the previous election. The election was very much focused on cost of living and economic policy,\" he added.\n\n\n\nREAD MORE Accusing others of a woke agenda, Peter Dutton became a victim of his own culture war\n\nThe recent controversy showed the Liberal Party was still in the midst of a \"real contest for what the party stands for,\" Ghazarian added.\n\n\n\n\n\n\"Is the party wanting to potentially portray itself as being a broad party that can represent the interest of all sorts of views in the community, or is it going to seek to pursue much more narrower policy focus, which looks at things like immigration, things like cultural identity, and so on.\"\n\n\n\n\n\nSince demoting Price, Ley has said the Coalition would remodel its policy development processes to seek input from a wider range of voices.\n\n\n\n\n\nShe told The Australian that the Coalition's policy development process would \"evolve throughout the term in response to internal and external feedback, emerging issues, and ongoing engagement with the community\".\n\n\n\n\n\nHowever, Samaras believes the Coalition won't find it easy to shift towards a more centrist policy platform.\n\n\n\n\n\n\"I think the grip that right-wing echo chambers have on the Coalition's membership is strong.\n\n\n\n\n\n\"And I think the Coalition's membership is going to continuously animate their MPs and make it very difficult for the parliamentary wings to completely detach from a form of politics that clearly is not popular in this country.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/paradigm-shift-over-2-million-households-to-get-internet-speed-boost-this-weekend/yun6p6kua",
        "title": "'Paradigm shift': Over 2 million homes to get internet speed boost starting this weekend",
        "publish_date": "Sat, 13 Sep 2025 00:11:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than 2.7 million households and businesses will unlock a free broadband speed boost in the coming days in a move experts are calling one of the biggest changes to the industry in years.\n\n\n\n\n\nBut not all homes will be eligible to receive faster downloads and many more may miss out on their full benefit due to outdated equipment.\n\n\n\n\n\nNBN Co will launch its internet upgrade program, Accelerate Great, starting on Sunday for homes connected to the network using fibre-to-the-premises and hybrid fibre coaxial (HFC) technology.\n\n\n\n\n\nThe free upgrade program will boost download and upload speeds for customers on three broadband plans, affecting about 2.77 million users.\n\n\n\nCustomers on 100 megabits per second plans will see their download speeds raised to 500mbps, 250mbps plans will lift to 750mbps downloads, while upload speeds will double to 100mbps on the fastest plans.\n\n\n\n\n\nNBN Co will also launch a two gigabit per second download plan as part of the program, chief executive Ellie Sweeney said, in a bid to boost Australia's internet use.\n\n\n\n\n\n\"We take great pride in delivering a reliable, high-speed and high-capacity network to Australians and it is our investment in the network that is enabling us to Accelerate Great, as we say,\" she said.\n\n\n\n\n\nMost Australian households are connected to 50mbps broadband plans, however, and would have to upgrade to receive the additional speed.\n\n\n\nThe speed boosts will be delivered to eligible customers automatically, Vodafone fixed line products general manager Andy O'Connor said, and will be a significant change for broadband users.\n\n\n\n\n\n\"I call it a paradigm shift,\" he said.\n\n\n\n\n\n\"It is genuinely the biggest change in the market we've ever seen.\"\n\n\n\n\n\nMore than half of the company's internet users would be able to receive the speed boosts, he said, although some could be short-changed if they failed to check connection options or check their hardware.\n\n\n\n\n\nNBN users who could not access higher speeds should ask if they were eligible for a free fibre-to-the-premises upgrade, O'Connor said, while those expecting a speed boost should check that their modem could deliver it.\n\n\n\n\"Not everybody's home modem is capable of going at that speed right now,\" he said.\n\n\n\n\n\n\"Some older models are only capable of going to about 200 or maybe 250 megabits per second.\"\n\n\n\n\n\nWhile the speed updates will begin on Sunday, upgrades could take several days to take effect.\n\n\n\n\n\nAustralia currently ranks 63rd in the world for fixed broadband speeds, according to the Speedtest Global Index, with an average download of 92mbps.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-you-missed-from-the-pacific-islands-forum/87abvie53",
        "title": "PM's wardrobe malfunction and SUV diplomacy: What you missed from the Pacific summit",
        "publish_date": "Fri, 12 Sep 2025 21:40:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Regional security and climate change loomed as major themes as Prime Minister Anthony Albanese embarked on a colourful and at times chaotic visit through Vanuatu and Solomon Islands.\n\n\n\n\n\nThe centrepiece was the Pacific Islands Forum (PIF) leaders' meeting in Honiara. The summit's communique will outline the key outcomes of the forum’s discussions but is yet to be released.\n\n\n\n\n\nBut while Albanese has been keen to highlight a blossoming relationship with the Pacific family, not all has gone to plan.\n\n\n\nA Vanuatu eruption\n\nThe first stop on Albanese's Pacific trip was Vanuatu, where it was widely expected a long-awaited $500 million pact would be signed with leader Jotham Napat.\n\n\n\n\n\nThe Nakamal Agreement, which would have seen Australia provide an additional $50 million in aid per year to the nation for the next decade, was meant to have been finalised and settled well before the prime minister boarded his RAAF jet.\n\n\n\nIt was widely expected that Australia would sign a long-awaited $500 million pact with Vanuatu leader Jotham Napat (centre) at the Pacific Islands Forum. Source: AFP / Department of Foreign Affairs and Trade Last month, Australian ministers trekked to the summit of an active volcano with their Vanuatu counterparts to mark the \"finalisation\" of the deal — a stratospheric spectacle to celebrate the end of negotiations.\n\n\n\n\n\nPerhaps the smoke rising in the background was an omen, because in the days before this visit, it became clear support within Vanuatu's coalition government was far from solidified, and on Tuesday before leaving, Albanese admitted on breakfast radio the deal was unlikely to happen.\n\n\n\n\n\nAt Friday's joint press conference in Port Vila, instead of a signing, Napat revealed the reason for the collapse in support: fears the pact's wording would limit Vanuatu's ability to sign infrastructure deals with partners like China.\n\n\n\n\n\nPacific analyst Tess Newton Cain said: \"Their [Vanuatu's] main driver is to ensure that they have available to them the resources that they need to guarantee human security in Vanuatu.\"\n\n\n\n\n\n\"That means working with a wide range of partners.\"\n\n\n\n\n\nThe Nakamal Agreement was to replace a previous security deal Vanuatu never formally ratified over concerns the terms agreed with Australia would impinge on its status as a non-aligned nation.\n\n\n\n\n\nAlbanese remains optimistic the agreement can be resurrected, and after sipping some cava with Napat to the tunes of King Stingray's live vocals, gave his counterpart a lift to Honiara the following morning.\n\n\n\nForeign Minister Penny Wong was pressed about whether Vanuatu's ties to China were cause for concern.\n\n\n\n\n\nShe told the Today Show: \"You might be able to speak for Vanuatu, I don't choose to,\" before a fire alarm rang out in her office, forcing the interview to be abandoned as \"evacuate now\" warnings drowned out her words. Auspicious timing indeed.\n\n\n\n4WD diplomacy\n\nSolomon Islands' hosting of the PIF in the bustling, muggy capital of Honiara has further fuelled the contest for influence in the Pacific region.\n\n\n\n\n\nAnd among the new displays of calculated charity from international partners were rival fleets of vehicles.\n\n\n\n\n\nAustralia promised a fleet, including Ford Rangers and Toyota Hiluxes, to be liveried in the colours of Solomon Islands police, but it was China's high-end Great Wall Motor SUVs that would ferry the leaders from venue to venue.\n\n\n\n\n\nThe duelling announcements, made within hours of each other, dominated Australian coverage in the lead-up to the event, with stories of Pacific power plays retopped with an angle reflecting the Antipodean fondness for four-wheel drives.\n\n\n\nSolomon Islands' hosting of the Pacific Islands Forum in the bustling capital of Honiara has further fuelled the contest for influence in the Pacific region. Source: AAP / Poppy Johnston And so considerable eyebrows were raised when Albanese stepped off the plane on the Honiara tarmac and hopped into an awaiting Chinese-supplied vehicle.\n\n\n\n\n\nAsked if he was disappointed not to be picked up by an Australian-supplied Hilux, Albanese responded glibly: \"It's a car. You know, cars get you from A to B.\"\n\n\n\n\n\nAcross Honiara, international aid partners have plastered their logos on various projects, ranging from billboards to bus stops.\n\n\n\n\n\nWhile Australia has long been the largest partner for development, China has its own expensive contributions, including the national stadium, which hosted the PIF opening ceremony and the media centre.\n\n\n\n\n\nSolomon Islands Prime Minister Jeremiah Manele addressed the increased strategic interest in the region directly in his opening address to the summit.\n\n\n\nSolomon Islands Prime Minister Jeremiah Manele did not invite PIF partner nations, including China, the US and Taiwan, to this year's meeting. Source: AAP / Ben McKay \"The world around us is changing fast, competition from powerful interests is intensifying,\" Manele said.\n\n\n\n\n\n\"The Pacific must never be seen as an arena for others.\"\n\n\n\n\n\nManale opted not to invite PIF partner nations, including China, the US, and Taiwan, to this summit in an attempt to avoid those tensions that could upend the forum's agenda.\n\n\n\n\n\nThose partners have, on the whole, respected the decision, and the move was criticised by Australia as well as independent Solomon Islands MP Peter Kenilorea Jr.\n\n\n\nA long-time China sceptic, he views infrastructure as \"front line\" of the strategic contest across the region.\n\n\n\n\n\n\"While Australia has been very helpful throughout our history … in perhaps a softer policy support capacity, I think the infrastructure space is where the real issues are now decided,\" he said.\n\n\n\n'Big dog' Australia's climate record questioned\n\nWhen leaders attend these summits, weeks of preparation go into planning the schedule, keeping up with customs, and drafting announcements.\n\n\n\n\n\nBut often things don't stick to the plan.\n\n\n\n\n\nWednesday's program witnessed several changes, delaying the sign-off on the Pacific Resilience Facility — a fund to help the region cover the costs of climate change.\n\n\n\n\n\nDelegates wept as the ceremony started — acknowledging the existential threat that this will go some way to addressing, and years of frustration over struggles to gain international support for mitigation and recovery.\n\n\n\n\n\nAustralia contributed an opening $100 million, but Albanese initially made a striking impression when he entered.\n\n\n\n\n\nUnlike the dapper blue dress of other leaders, he was adorned in a pink-patterned shirt.\n\n\n\n\n\nAfter a few minutes the wardrobe malfunction was identified and while speeches were still ongoing, Albanese, in full view of the cameras, walked out of the room for a frantic shirt change before walking back in a matching garb.\n\n\n\nThe pink shirt was never seen again.\n\n\n\n\n\nThe wardrobe malfunction greatly amused New Zealand Prime Minister Christopher Luxon, teasing Albanese the following morning about wearing the right shirt to the family photo.\n\n\n\n\n\nAsked by New Zealand media if the faux pas was a sign of Australia \"being the big dog and thinking they can wing it\", Luxon drily replied: \"I think he just forgot the instructions to be honest.\"\n\n\n\n\n\n\"You've got to reiterate quite a lot to the Australians what they need to be doing in the rules sometimes,\" he said.\n\n\n\n\n\nWhile Albanese often speaks fondly about the closeness of the government to the \"Pacific family\", a coordination cock-up at a major climate event only served to highlight some of the dissonance felt by other nations around Australia's track record on emissions.\n\n\n\n\n\nWhile the region is on board with a bid for a Pacific COP Climate Summit, Vanuatu's climate minister Ralph Regenvanu said Australia would need to match its climate ambitions in line with its island neighbours if it were to be a good host, as a decision on 2035 climate targets fast approaches.\n\n\n\n\n\n\"We also want Australia to start to talk seriously about addressing its fossil fuel production pipeline,\" he said.\n\n\n\n\n\nRegenvanu argues the July International Court of Justice ruling finding nations have a legal obligation to prevent climate impacts means Australia's view that it can meet its Paris commitments by completing a domestic transition, while still exporting fossil fuels like coal and gas, is \"now untenable\".\n\n\n\nOn Thursday, Albanese maintained gas is an important part of the transition and the domestic economy, while also talking up his government's climate record, describing the region's support for the COP bid as a show of trust in Australia's \"leadership\".\n\n\n\n\n\nAn impasse over the hosting rights remains — with Türkiye also jostling for the event, with the hope a resolution can be worked out with President Recep Tayip Erdoğan on the sidelines at the upcoming United Nations General Assembly.\n\n\n\n\n\nPalau will host next year's PIF before COP31, and President Surangel Whipps Jr said it would be \"an act of good faith if others would clear the way\" to allow the Pacific a global climate platform.\n\n\n\n\n\n\"The coming weeks are make or break, which is why we agreed to work very closely with Prime Minister Albanese.\n\n\n\n\n\n\"We don't want this major international opportunity to pass us by.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-supermarket-sweep-how-making-wise-choices-could-save-you-money/h0onz3s69",
        "title": "INTERVIEW: Supermarket sweep: How making wise choices could save you money",
        "publish_date": "Fri, 12 Sep 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-three-years-after-the-death-of-mahsa-amini-in-iran-whats-changed/gn6snvk02",
        "title": "INTERVIEW: Three years after the death of Mahsa Amini in Iran, what's changed?",
        "publish_date": "Fri, 12 Sep 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nIt has been about three years since the death in custody of Mahsa Jina Amini, which sparked a nationwide movement in Iran.\n\n\n\n\n\nWhile things have changed for Iranian women in different ways since then, experts say the government's crackdown still persists in new forms.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australias-emerging-golden-age-and-the-run-that-inspired-us-all/qtxwgdtgj",
        "title": "Bruce McAvaney on Australia's emerging athletics 'golden age' and the run that inspired us all",
        "publish_date": "Fri, 12 Sep 2025 20:41:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "Legendary sports commentator Bruce McAvaney says \"it's no illusion\" that Australian athletics is at the beginning of a \"golden age\" of development and success in the sport.\n\n\n\n\n\nSpeaking ahead of his role commentating SBS' coverage of the World Athletics Championships in Tokyo, McAvaney said he believes Australian athletics is in the best shape it's ever been, with several serious medal contenders among the country's 80-odd member team.\n\n\n\n\n\nMcAvaney said the event, running from 13-21 September and broadcast on SBS, is potentially the third most significant global sporting event behind the Olympics and the FIFA World Cup, with athletes from 198 countries participating.\n\n\n\n\n\n\"It doesn’t get bigger than this,\" he said.\n\n\n\n\n\n\"A diverse group of Australians from all sorts of backgrounds, come together … with 197 other countries. There are very few global opportunities like this.\"\n\n\n\nMcAvaney says Australian athletics competitors have been building impressive momentum that he believes will lead to victories in this year's championships and continue through to the Brisbane Olympics in 2032.\n\n\n\n\n\n\"I think we’re at the beginning of a golden age, and at the Brisbane Olympics, in seven years time, that’s not going to go away.\n\n\n\n\n\n\"And this really all began in Tokyo four years ago, where you could see the writing on the wall so I believe this group are representing a team that is in a period the whole country is going to be very excited right now and going forward.\"\n\n\n\nAustralian runner Jessica Hull won the silver medal in the Women's 1500m final at the 2024 Paris Olympic Games. Source: AAP / Dean Lewins At the Paris Olympics in 2024, Australia's athletics team won seven medals, the most at an Olympic Games since 1956, and the year before won six at the World Championships, also a record high.\n\n\n\n\n\nMcAvaney says momentum on and off-track makes him believe in the emergence of a golden age.\n\n\n\n\n\n\"It’s not manufactured, it’s very real, it’s not an illusion what’s happening out there in terms of the depth of talent in our country\".\n\n\n\n\n\nOff the track he says Australia is being considered a more serious player in global athletics, with events like the Sydney marathon gaining a huge global following as one of five major marathons.\n\n\n\n\n\nHowever, two major medal hopes have become late scratchings — Olympic pole vault champion Nina Kennedy and racewalker Jemima Montag, who won bronze in the 20km in Paris, have pulled out of the championships through injury, threatening Australia's overall medal tally hopes.\n\n\n\nPressure on young stars\n\nNearly a quarter of Australia's team are 21 or younger, another reason why McAvaney predicts they will shine at a home Olympics.\n\n\n\n\n\nThe highest-profile young Australian athlete is undoubtedly Gout Gout, who at just 17-years-old and running 100 metres in under 10 seconds, is being compared to sprinting great Usain Bolt.\n\n\n\n\n\nSpeaking about the Australian teenager while in Tokyo for the competition, Bolt said even though Gout is talented, it's never going to be \"just easy\" for him to win.\n\n\n\n\"He's very talented, with the times he's running now and he's really been doing well,\" Bolt said.\n\n\n\n\n\n\"That's something that you love to see because you want athletes to do well. The more athletes do well, the bigger the sport is, and I'm always a supporter of track and field getting bigger and doing bigger things.\n\n\n\n\n\n\"So if he continues on this track he's going to be good, but it's all about getting everything right.\"\n\n\n\n\n\nGout will compete in the men's 200m heats on Wednesday 17 September.\n\n\n\n\n\nMcAvaney said Gout is \"so interesting\" given he's about to start his year 12 studies while dealing with global fame and pressure to perform.\n\n\n\nBruce McAvaney hugs Gout Gout as he celebrates winning his Under 20s 200m final at the Queensland Athletics Championships in Brisbane in March. It was the first time Gout had run below 20 seconds for the 200m. Source: AAP / Jono Searle \"There’s a lot of expectation on him and noone really knows how he’s going to perform.\n\n\n\n\n\n\"But we do know he’s a rare talent and we haven’t seen anything like him in Australia. I think he will run particularly well.\"\n\n\n\n\n\nMcAvaney said he thinks middle-distance runner Peter Bol is another athlete who could perform well, given he's running faster now than he was when he placed 4th in the 800m at the 2020 Tokyo Olympics.\n\n\n\n\n\nThe master commentator flagged distance runner Jess Hull and discus star Matt Denny as other standouts, as well as high jumper Nicola Olyslagers, who won silver in Paris, as Australia's best medal hope.\n\n\n\n\n\n\"She’s the Diamond League champion and the world indoor champ, at the moment I think it’s a 50-50 bet between her and [Ukrainian Olympic champion Yaroslava] Mahuchikh, she’ll be on the podium and she’s a great competitor,\" McAvaney said.\n\n\n\nREAD MORE How to watch 2025 World Athletics Championships LIVE on SBS\n\nThe 'one lap' that inspired the whole world\n\nThis year marks the 25-year anniversary of the Sydney Olympic Games — and for many Australians, Cathy Freeman's gold medal win in the 400 metres is among their favourite sporting memories of all time.\n\n\n\n\n\nAsked about role models in athletics, McAvaney said the Indigenous runner is one of the greats.\n\n\n\n\n\n\"I think Cathy’s legacy is even stronger right now than it was 25 years ago,\" he said.\n\n\n\n\n\n\"That’s how pure and rich that whole performance was from the lighting of the cauldron to winning that gold medal. She carried the nation on her back. The pressure was unbelievable. It would have diminished so many people but she actually took it on and soared.\"\n\n\n\nCathy Freeman's gold medal-winning 400m run at the 2000 Sydney Olympics. Credit: Dean Lewins McAvaney said the \"one lap run of hers\" laid down a benchmark for others to follow.\n\n\n\n\n\n\"Great performances are fleeting. What Cathy did is forever.\"\n\n\n\n\n\nBruce McAvaney will lead the expert commentary along with former world indoor 800m champion Tamsyn Manou to call the track events, while renowned SBS commentator David Basheer will bring audiences all the action in the field.\n\n\n\n\n\nEvery session from the nine-day event will be broadcast live and free across SBS VICELAND, including the World Athletics Championships 2025 Hub via SBS On Demand, which will also feature full replays, mini recaps and Aussie Focus clips for every session.\n\n\n\n\n\nMorning sessions will run from 8am to 1.30pm AEST on September 13–15 and 20–21, while evening sessions will be from 8pm to 11.30pm AEST each night of the championships.\n\n\n\n\n\nHere's the full schedule for SBS's broadcast of the World Athletics Championships.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/robodebt-class-action-compensation-whats-next-for-victims/yturl57q3",
        "title": "$548.5 million: The price the government is willing to pay 'to avoid a public trial' of robodebt",
        "publish_date": "Fri, 12 Sep 2025 20:36:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "\"Are we good enough?\"\n\n\n\n\n\nThis question has stayed with Felicity Button since the day she discovered $11,571 had been withdrawn from her bank account.\n\n\n\n\n\nIt was 2017, and Button had just taken her baby daughter to a doctor's appointment. She says she had recently been paid, and knew she could afford the appointment, medication and petrol to return home.\n\n\n\n\n\n\"I went to go and pay for my appointment, and my card declined,\" she says.\n\n\n\n\n\nButton contacted Centrelink and found out that a debt collector had withdrawn the money, claiming she owed a historical robodebt.\n\n\n\nFelicity Button (pictured) was one of the lead applicants in the robodebt class action and appears in SBS's docu-drama The People vs Robodebt. Source: SBS News / Simon Morris Several years prior, Button had received income support from Centrelink — Youth Allowance and Austudy — while studying for her nursing degree and working several jobs. However, that support ended in 2015.\n\n\n\n\n\nShe recalls receiving a letter in September 2016, alleging she owed a debt, which she subsequently queried with Centrelink. She says the service \"couldn't really give [her] any answers\". After nearly a year of correspondence, she was moved onto a payment plan of $20 per week. Then the money was unexpectedly withdrawn from her account in September 2017.\n\n\n\n\n\nWhile driving home, she recalls feeling powerless and saying: \"I may as well run my car off the road.\"\n\n\n\n\n\nBetween 2015 and 2019, the debt recovery scheme set up by the then Coalition government relied on an automated assessment of tax office and welfare payment data to calculate average earnings and issue debt notices to welfare recipients. The process often failed to accurately reflect earnings, with many recipients pursued for debts they did not owe, including Button.\n\n\n\n\n\nThe scheme raised $1.76 billion from around 526,000 recipients through approximately 794,000 debt recovery transactions.\n\n\n\n\n\nA royal commission into the scheme, which ran between 2022 and 2023, described robodebt as a \"crude and cruel mechanism\" that was \"neither fair nor legal\" and \"made many people feel like criminals\".\n\n\n\n\"In essence, people were traumatised on the off-chance they might owe money. It was a costly failure of public administration, in both human and economic terms,\" the commission wrote in its final report in 2023.\n\n\n\n\n\nVictims suffered severe impacts from being falsely accused of owing debts, the report found. In some circumstances, the despair robodebt caused led to recipients taking their own lives .\n\n\n\n\n\nButton, now a mother of two, appears in SBS' upcoming docu-drama series The People vs Robodebt. She has been one of the lead applicants in a years-long class action lawsuit brought against the federal government over the botched debt recovery scheme, including a landmark appeal settled last week . Her money was returned; however, the ordeal has had a lasting impact.\n\n\n\n\"I think mothers inherently always question ourselves on whether or not we're doing a good enough job … and are we good enough? That's unfortunately ingrained in being a woman and a mother, for the most part,\" Button says.\n\n\n\n\n\n\"But this brings it to a much deeper level … It makes you think, all it takes is one thing to completely derail your life.\"\n\n\n\n\n\nShe's one of many robodebt victims who have fought for compensation and are now seeking accountability.\n\n\n\n'Financial vindication' or 'accountability avoided'?\n\nButton first joined the legal fight against robodebt in 2019.\n\n\n\n\n\nLaunched by Gordon Legal, the initial class action was settled in 2020, with the federal government agreeing to repay wrongfully raised debts and accrued interest — amounting to a settlement of $1.8 billion. (The majority of this cleared the $1.76 billion in unlawful deductions).\n\n\n\n\n\nLast week, it announced that an appeal led by the firm had been settled for a further $548.5 million , including $475 million in compensation for victims.\n\n\n\nGordon Legal says the appeal was launched following the release of the royal commission's report in 2023, which uncovered new evidence of misfeasance — the wrongful use of legal authority — by senior public servants who designed and ran the scheme.\n\n\n\n\n\nThe appeal argued that the new evidence should be considered to allow victims to seek further compensation.\n\n\n\n\n\n\"The allegations were that very senior public servants knew that the scheme they were implementing was unlawful,\" Gordon Legal partner Andrew Grech says.\n\n\n\n\n\n\"If we were able to establish that in court, as we believed we would be able to … that would have meant group members who suffered distress or further financial loss, or in some tragic cases, had loved ones who took their own lives, would have been able to seek financial damages compensation for the distress that they suffered,\" he says.\n\n\n\nThat was very significant because many group members felt the original class action didn't really answer some of those questions, and didn't make the public servants involved truly accountable for what had occurred.\n\nGrech hopes victims feel a \"sense of finality\" and that their concerns \"have been listened to\".\n\n\n\n\n\nAttorney-General Michelle Rowland said the settlement shows the Albanese government's \"ongoing commitment to addressing the harms caused to hundreds of thousands of vulnerable Australians by the former Liberal government's disastrous robodebt scheme\".\n\n\n\n\n\n\"Settling this claim is the just and fair thing to do,\" she said.\n\n\n\n\n\nThe agreement includes up to $60 million in administration costs and up to $13.5 million to cover the applicants' legal costs, with the remaining $475 million for compensation.\n\n\n\n\n\nIf approved by the Federal Court, the government said this would be the largest class action settlement in Australian history. According to Gordon Legal, it would deliver more than $2.4 billion in financial redress for victims.\n\n\n\nAttorney-General Michelle Rowland said settling the claim is the \"just and fair thing to do\". Source: AAP / Lukas Coch For Button, the settlement brought some relief.\n\n\n\n\n\n\"[It] was really reflective of the financial penalty that the government has to now pay for such an egregious act, which is sad, because we're looking at it from a financial penalty point of view … but there's no compensation to the families that lost people,\" she says.\n\n\n\n\n\n\"You can give them all the money in the world; it's not going to bring the person back.\"\n\n\n\n\n\nAustralian Council of Social Service chief executive Cassandra Goldie welcomed the settlement but said it does not \"deliver full justice\" for victims.\n\n\n\n\n\n\"Ten years on from when robodebt commenced, no-one responsible for its design, implementation and continuation has been publicly held accountable in a way that delivers justice for its victims and their families,\" she said in a statement.\n\n\n\nAustralian Council of Social Service chief executive Cassandra Goldie said the settlement does not \"deliver full justice\" for robodebt victims. Source: AAP / Mick Tsikas Christopher Rudge is a lecturer at Sydney Law School, researching welfare law. Beyond the settlement being \"a day of financial vindication\" for victims, he also believes it's \"a day of accountability avoided for those who designed the scheme\".\n\n\n\n\n\n\"This isn't just a payout; it's the price the government was willing to pay to avoid a public trial based on the royal commission's evidence of misfeasance in public office,\" he says.\n\n\n\nThe settlement ensures the central legal claim of the litigants will never be tested in court.\n\nWhile the Commonwealth may have been able to successfully defend the claim, Rudge argues: \"We still would have been able to better scrutinise the standards we expect of public servants in Australia.\"\n\n\n\n\n\nGrech says that in any litigation process, \"the answers are never complete\".\n\n\n\n\n\n\"What we think we've been able to do is to shine a light on what was unlawful conduct and to ensure that people harmed by it get some sense of closure and some redress for the harm that was caused to them,\" he says.\n\n\n\nWhat happens now?\n\nIt could take up to six months for the Federal Court to approve the settlement, Grech says. A minimum of $475 million would then be available to distribute among members who choose to participate; however, the specifics of how that will be allocated to individuals have yet to be determined.\n\n\n\n\n\nWith up to 471,000 members in total, Grech expects there to be tens of thousands of people who would opt to receive a fixed payment or individualised assessment. To put that in perspective: if 471,000 registered, the average compensation amount for each person would be $1,008.\n\n\n\n\n\nRudge says the settlement's billing as the largest of its kind in Australia is \"a reflection of the size of the cohort rather than the generosity of the payments to victims\".\n\n\n\n\n\nMeanwhile, an investigation into six referrals from the royal commission is being led by the National Anti-Corruption Commission (NACC), based on an announcement made by an independent decision maker for the NACC in February. The referrals were contained in a sealed chapter, recommending individuals for civil action or criminal prosecution.\n\n\n\nThis reversed an earlier decision by the NACC not to commence a corruption investigation against the six individuals.\n\n\n\n\n\n\"If any of those six referred individuals committed a breach of public trust, then we should expect that private hearings will be held — or could have already been held — and we await any findings emanating from those hearings,\" Rudge says.\n\n\n\n\n\n\"The powers of the NACC are primarily referral-based. It doesn't have the power to prosecute, lay charges or convict in its own right.\"\n\n\n\nWhile Button is relieved with the class action win, she wants to see individuals held to account.\n\n\n\n\n\n\"I just want to see criminal charges laid on the people that orchestrated, designed and constructed the scheme,\" she says.\n\n\n\n\n\n\"And I want to see further mental health support for people who lost more than money can recoup.\n\n\n\nAnother scheme: Addressing a historical debt calculation\n\nRobodebt is not the only instance of unlawful debt calculations by government agencies.\n\n\n\n\n\nOn 27 August, the government announced it would be rolling out \"resolution payments\" for those potentially impacted by a historical debt calculation method known as income apportionment.\n\n\n\n\n\nThe practice was used by Centrelink between 1991 and 2020 to calculate debts for recipients where it was unclear when income was earned. It involved averaging income evenly across two or more fortnightly payment blocks.\n\n\n\n\n\nThe Commonwealth Ombudsman found the method was unlawful in 2023, but said this arose from agencies \"genuinely holding an incorrect understanding\" of the law.\n\n\n\n\n\nThe government estimates that around 5.5 million debts — previously or currently held by around three million people and worth around $4.4 billion — may be affected. The vast majority have already been repaid.\n\n\n\n\n\nA bill introduced to parliament seeks to address income apportionment by validating its use for past calculations, and setting up a resolution scheme for those with potentially affected debts.\n\n\n\nSocial Services Minister Tanya Plibersek introduced a bill to Parliament on 4 September, seeking to address income apportionment by validating its use for past calculations and establishing a resolution scheme for those with potentially affected debts. Source: AAP / Lukas Coch This follows the Federal Court's approval of a method for the government to recalculate debts owed in July.\n\n\n\n\n\n\"Nevertheless, the government instead said, rather than go back and recalculate all these unlawful debts, we will put forward legislation that validates those past unlawfully calculated debts, and we will pay a $600 resolution payment to anyone identified as affected,\" Rudge says.\n\n\n\n\n\nIntroducing the bill to parliament on 4 September, Social Services Minister Tanya Plibersek said reopening debts and recalculating them \"would cause distress and protracted uncertainty for the people affected\", and divert critical government resources away from frontline services.\n\n\n\n\n\n\"This was not robodebt,\" she stressed.\n\n\n\n\n\nRudge says the government has been clear in distinguishing income apportionment from robodebt. However, while they are distinct methods of calculating debts, he argues there is overlap.\n\n\n\n\n\n\"A single debt could be affected by both,\" he says.\n\n\n\nAutomatic cancellation of job seeker payments 'unlawful'\n\nMeanwhile, the Commonwealth Ombudsman has been investigating the cancellation of job seeker payments by a government department under an automated system.\n\n\n\n\n\nThe Targeted Compliance Framework (TCF) was set up in 2018 to ensure job seekers complete specific activities, called mutual obligation requirements, in order to continue receiving payments. This process is managed by the Department of Employment and Workplace Relations (DEWR) and Services Australia.\n\n\n\n\n\nNew laws were introduced in April 2022 that required consideration of a job seeker's circumstances before deciding to cancel a payment.\n\n\n\n\n\nHowever, the ombudsman found 964 people had their income support automatically cancelled between April 2022 and last July, when the DEWR secretary paused cancellations.\n\n\n\n\n\n\"A further 45 job seekers received automated cancellations after the secretary's decision to pause cancellations, when they should not have,\" ombudsman Iain Anderson said in a report, published on 6 August.\n\n\n\nLISTEN TO Ombudsman scolds government agencies over automatic cancellation of welfare payments SBS News 01:30 English\n\nThe ombudsman said agencies' cancellation of income support was not lawful and did not ensure processes and computer systems were complying with amended legislation.\n\n\n\n\n\nHe cited conclusions from the robodebt royal commission about the use of automated processes, and the \"serious impact\" these can have on vulnerable people.\n\n\n\n\n\nThe report recommended the department not resume cancellations until errors are rectified and cancellations are compliant with the law.\n\n\n\n\n\nSeparately, the government commissioned an independent assurance review into the IT system that underpins the framework. Undertaken by Deloitte and released on 14 August, it found a \"critical lack of traceability\" linking legislation, operational policy and \"automatic compliance logic\" embedded within the system.\n\n\n\n\n\nIn a statement to SBS News, a DEWR spokesperson confirmed it has accepted all recommendations from the ombudsman's report, noting it and Deloitte's review made \"a number of important findings and recommendations, including areas for urgent action and longer-term improvements\".\n\n\n\nThe department is taking immediate steps to address the urgent actions identified.\n\nThe spokesperson confirmed all payment reductions and cancellations remain paused.\n\n\n\nThe Australian Financial Review also reported that the Deloitte report includes a number of fabricated references, including to academic works. Rudge, who discovered the errors, suspects these were generated by artificial intelligence.\n\n\n\n\n\nThe DEWR spokesperson said Deloitte has confirmed some footnotes and references in its final report were incorrect.\n\n\n\n\n\n\"The department has requested that Deloitte provide a corrected version of the statement of assurance and final report as soon as possible,\" the spokesperson said.\n\n\n\n\n\nSBS News understands Deloitte is managing the matter.\n\n\n\nIn Rudge's view, the TCF has a \"broad policy commonality\" with other scandals.\n\n\n\n\n\n\"It's a framework designed to ensure that welfare recipients are never permitted to receive an entitlement that is in any way suspected of being an overpayment,\" he says.\n\n\n\n\n\n\"When a policy initiative is pursued relentlessly, internal decision-making becomes siloed and overly goal-oriented, and decisions are made in an unexamined way that is contrary to law. That is what has happened here, just as in the other schemes, although in a very different way.\"\n\n\n\nCould robodebt happen again?\n\nRudge points to a growing risk of technological error, particularly with the rise of AI interacting with complex legislation.\n\n\n\n\n\n\"I think all of the variables combine to become the ingredients of another scandal,\" he says.\n\n\n\n\n\n\"If we're not careful and if there isn't a paradigm shift … we could see it [robodebt] happening again.\"\n\n\n\nREAD MORE Meet the regional mums taking on the government's automated debt recovery scheme\n\nRudge argues a change in policy approach is needed, one that focuses on the entitlement of welfare recipients to support.\n\n\n\n\n\n\"The principle should be that rather than assume there is fraud in every area of the system, it should be the working assumption that people are entitled to the welfare that they are receiving, and there should be a much higher threshold for investigating fraud,\" he says.\n\n\n\n\n\nButton hopes the robodebt settlement is a \"wake-up call to the government to say 'we're not going to tolerate this'\".\n\n\n\n\n\nShe says her fight was never about the money.\n\n\n\n\n\n\"More importantly, the future looks a bit brighter for my kids.\"\n\n\n\n\n\nAll three episodes of The People vs Robodebt will premiere on 24 September on SBS on Demand. Episodes will air weekly on SBS.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/minns-announces-parramatta-rd-housing-proposal-20250914-p5muvo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Minns announces Parramatta Rd housing proposal",
        "publish_date": "Sun, 14 Sep 2025 11:54:12 +1000",
        "category": "finance",
        "authors": [],
        "text": "Minns announces Parramatta Rd housing proposal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/one-try-toby-asks-albanese-to-give-us-your-money-after-sealing-win-for-sharks-20250914-p5muuk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "One-try-Toby asks Albanese to ‘give us your money’ after sealing win for Sharks",
        "publish_date": "Sun, 14 Sep 2025 11:52:47 +1000",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "Toby Rudolf scores one try a season. No more, no less.\n\nAnd the Sharks’ prop picked a heck of a moment to hit his 2025 quota, scoring in the 75th minute of the Sharks 20-10 elimination final win against the Roosters to put the match to bed.\n\n“I was telling Blayke Brailey all year, ‘Just one (try) mate, all I need is one’,” Rudolf said after Saturday’s match.\n\n“He kept giving me decoys, and tonight he finally listened. Credit to Blayke, it was an eyes up play, 75 minutes in and he nailed it.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/which-nrlw-stars-could-make-a-code-switch-20250914-p5muv6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Which NRLW stars could make a code-switch?",
        "publish_date": "Sun, 14 Sep 2025 10:34:17 +1000",
        "category": "finance",
        "authors": [],
        "text": "Which NRLW stars could make a code-switch?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw4-newcastle-vs-wolves-20250914-p5muv2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW4: Newcastle vs Wolves",
        "publish_date": "Sun, 14 Sep 2025 10:15:13 +1000",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW4: Newcastle vs Wolves\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw4-everton-vs-aston-villa-20250914-p5muv1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW4: Everton vs Aston Villa",
        "publish_date": "Sun, 14 Sep 2025 10:15:01 +1000",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW4: Everton vs Aston Villa\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/why-we-re-holding-on-to-billions-in-cash-but-not-using-it-20250830-p5mr2s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why we’re holding on to billions in cash but not using it",
        "publish_date": "Sun, 14 Sep 2025 09:30:00 +1000",
        "category": "finance",
        "authors": [
            "Madeleine Heffernan"
        ],
        "text": "Heather Lewis is among the 7 per cent of Australians who like to pay for most of their purchases with cash.\n\nLewis, who is in a wheelchair, uses cash to pay for everything but her health insurance. She said the practice helped manage her money and maintain her independence.\n\nHeather Lewis uses cash for almost all her transactions. Credit: Arsineh Houspian\n\nLewis is angry that this month’s Melbourne Royal Show will not allow patrons to buy tickets at the gate with cash. The Show said digital purchases helped it manage crowd flow, save time and reduce queues.\n\n“A lot of us who use cash only feel like we’re being forced to go digital,” Lewis said. “It’s going to get to the point where you can’t do anything [without paying online].”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/drug-smuggling-match-fixing-scandals-and-a-pop-song-who-is-ange-s-new-boss-20250912-p5mujh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Drug-smuggling, match-fixing scandals … and a pop song: who is Ange’s new boss?",
        "publish_date": "Sun, 14 Sep 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Emma Kemp"
        ],
        "text": "Marinakis, who is from Piraeus, on the edge of Athens, and long married with four children, is the founder and chairman of international shipping company Capital Maritime & Trading Corp, having taken over his father’s fleet of seven tankers and grown it into some 120 vessels. In 2018 he merged his fleet with that of Donald Trump’s former commerce secretary Wilbur Ross (Diamond S Shipping), which he later labelled his “worst business decision”. In 2017, he was named Greek Shipping Personality of the Year by British publication Lloyd’s List. Last year, he received an honorary doctorate from the renowned US-based Massachusetts Maritime Academy. He has also been at the forefront of reducing greenhouse gas emissions within the shipping industry, as part of an alliance that founded the Maritime Emissions Reduction Centre (MERC) in Greece. Ange Postecoglou with Nottingham Forest owner Evangelos Marinakis in July. Marinakis the media mogul owns two of Greece’s most influential daily newspapers, Ta Nea and To Vima, and in 2019 launched a Greek television channel, One Channel. His company, Alter Ego Media, is the largest media organisation in Greece. A little-referenced detail is that he has also dabbled in songwriting and wrote lyrics for Greek pop artist Natasa Theodoridou’s smash hit Excitement (Exapsi), which reportedly had 1 million YouTube views within the first six days of its release in 2021. Marinakis’ foray into football started in 2010, when he bought his hometown team Olympiakos and became president. The club has since won 11 domestic league titles and the 2023-24 Europa Conference League.\n\nHe became the majority shareholder of Forest in 2017 when the two-time European Cup winners (1979, 1980) had been struggling in the second-tier English Championship for almost two decades and narrowly avoided relegation to League One. He pledged to restore the club to its glory days and, under his stewardship and Steve Cooper’s management, they earned promotion to the Premier League in 2022 – for the first time since 1999. In 2023, he also acquired Portuguese club Rio Ave. These investments have cemented Marinakis as one of Greece’s most powerful figures, to the point where he was called an oligarch by Greece’s former prime minister and opposition leader Alexis Tsipras. It was not meant as a compliment. This is where the controversial headlines begin.\n\nThe most enduring was a years-long investigation by the Greek state into allegations Marinakis was involved in trafficking the largest amount of heroin ever seized in Europe. The bust involved two tonnes of the stuff with a street value of more than €400 million ($705 million), smuggled into Piraeus aboard a small tanker called Noor One and hidden in warehouses and private homes. The case triggered a war of retribution that has left at least 17 people dead on three continents, and phone records exposed scores of police who the smugglers bought off, from Turkey to the United Arab Emirates. Marinakis was embroiled in 2018, charged with financing and storing drug substances and setting up a criminal group to traffic and sell drugs. He denied any wrongdoing and accused the country’s leftist-led government of plotting against him, which his newspapers described as “a game of many years”. The case was closed in 2021 due to a lack of evidence. Evangelos Marinakis, pictured at a home game at the City Ground last year, has his eye on everything at his football clubs. Credit: Getty Images At the time those charges were laid, Marinakis had just been cleared of his second set of match-fixing charges. The first related to the Koriopolis scandal – irregular betting patterns mostly involving Greek Cup and second-tier games in 2009 and 2010 – and he was acquitted in 2015. The second came in 2017, when he was one of 28 Greek football figures due to face trial as part of the country’s 2015 match-fixing scandal, in which players, referees, club executives and the football federation were accused of fraud, blackmail and forming a match-fixing ring. Eventually most charges were dropped, and courts acquitted all 28 defendants. He was accused of being involved in the 2012 bombing of a referee’s bakery, which occurred days after Olympiakos suffered a 1-0 defeat to Xanthi. The bakery’s owner, Petros Konstantineas, was that game’s referee and claimed he had been pressured before kick-off to ensure Olympiakos “definitely” won. Again Marinakis denied any wrongdoing, and again all charges were dropped.\n\nHe is, right now, being investigated in relation to civil misdemeanours, prompted by the death of a riot police officer who was injured by a flare following an Olympiakos v Panathinaikos volleyball game in December 2023. Allegations once more denied, this time with a claim of a blackmail attempt. Marinakis has taken his fight against the “smear campaign” all the way to the High Court in London, suing Irini Karipidis (chair of Greek club Aris Thessaloniki) and Ari Harow (formerly the chief of staff to Israeli prime minister Netanyahu) for allegedly waging a six-month campaign of “false and defamatory” claims. They include linking him to heroin smuggling and match fixing, and also being head of a criminal organisation known as The System. The libel case was filed late last year; in January, a judge ruled it can continue. Nonetheless, the strenuous denial has been a semi-regular fixture in the repertoire of a man who gets about Greece with black-clad bodyguards but is also known for extensive philanthropic efforts. Marinakis is a former city councillor for Piraeus and still carries out mayor-like duties, personally funding projects such as building playgrounds and soup kitchens. His personal website is replete with stories about his charity work: everything from providing refugee children from Syria, Afghanistan and Iraq with meals, clothing and toys, to inviting Shakhtar Donetsk to play a “Stop War” fundraising friendly against Olympiakos in their first match since Russia’s invasion of Ukraine. In 2018, he donated €1 million to the emergency effort after wildfires killed 103 people and devastated the Attica coastline, and in 2017 coordinated the relief efforts when flash floods hit Mandra, killing 25 people.\n\nThe juxtaposition is weird to reconcile, but then much about him is unorthodox. He reportedly likes the colour red. He does not like the colour green (Panathinaikos’ colour). Or purple (bad luck). Or black (unknown). He has a tattoo on his arm that reads: “Dream, Love, Create, Fight, Survive, Win.” He takes defeat as a personal insult and will threaten – and sometimes take – action. Even if it is the start of the season, as Nuno Espírito Santo learnt this past week. He churns through players and managers at a rate ruthless even to rivals in the notoriously fickle Premier League. So far at Olympiakos he has employed 17 managers. At Forest, Postecoglou will be his eighth. Marinakis celebrates with Olympiakos after winning the 2024 UEFA Europa Conference League final. Credit: Getty Images He likes – needs – to control the narrative. Apparently he even put out feelers to add some British media to his portfolio, offers that were declined. He keeps his cards close to his chest and values privacy. But he can also be volatile in public.\n\nIn 2011, after the full-time whistle in a Olympiakos-Panathinaikos derby (“the derby of the Eternal Enemies”), Marinakis had an on-field row with opposition striker Djibril Cisse that sparked a lawsuit and counter-suit for slander, verbal abuse and threats, and then libel (guess which was which). In 2024, he was banned for five Premier League matches for spitting towards match officials after a 1-0 home loss to Fulham during which the visitors were awarded a penalty on VAR advice but denied Forest two penalty appeals. Marinakis argued he was merely disposing of phlegm, caused by his cigar habit, and the incident was unintentional. “He cannot now remember if any spittle left his mouth but if it did (and he does not challenge that some might well have done) it certainly was not aimed at the referee’s feet and did not hit anybody,” his witness statement read. The English Football Association rejected the defence as “completely implausible” based on statements and CCTV footage, and condemned the action as “an egregious display of disrespectful behaviour”. In May he banned Gary Neville from the City Ground and told Jamie Carragher to “f--- off” for backing his Sky Sports colleague.\n\nAnd, of course, he had stormed onto the pitch to confront the highly respected Nuno after a draw with Leicester City guaranteed the club would compete in Europe for the first time in three decades and took their Champions League hopes out of their hands. Neville called the move “scandalous” in a post on X, which might have had something to do with being denied access to the stadium as a co-commentator later that month. Other observers just couldn’t believe a shipping magnate with a net worth of about $US5.1 billion went in for the kill holding a long-discontinued iPhone 7, complete with wired EarPods. Loading Such public temperamentality is, based on the public record, matched behind the scenes. The Forest boardroom has, at times, been in a state of civil war. The rift with Nuno really ramped up with the July appointment of Edu, Arsenal’s former sporting director, as Forest’s new global head of football. The Brazilian is now one part of an informal triumvirate alongside Marinakis and super-agent Kia Joorabchian, whose extensive portfolio includes Edu. Joorabchian, who runs Amo Racing, has co-invested in a racehorse with Marinakis and appears to have his paws all over his friend’s stable of football clubs. Marinakis, for his part, is said to be so hands-on his staff feel micromanaged. “Marinakis runs that club with the same obsessive influence as a chap who runs a corner shop,” Mail sport football editor Ian Ladyman told the Whistleblowers podcast this week.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/welcome-back-ange-postecoglou-taunted-by-arsenal-fans-as-forest-hammered-20250914-p5muu9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Welcome back, Ange: Postecoglou taunted by Arsenal fans as Forest hammered",
        "publish_date": "Sun, 14 Sep 2025 09:25:19 +1000",
        "category": "sports",
        "authors": [
            "John Percy",
            "Oliver Brown",
            "Daniel Zeqiri"
        ],
        "text": "Ange Postecoglou directs traffic duing the match. Credit: Getty Images “That’s my job to try and embed that over the next few weeks and I’m sure we will because there is a willing group of players to do that. You will see a difference at Swansea on Wednesday night.” Postecoglou did spot some positives, especially with the performance of “brilliant” midfielder Elliot Anderson. The England international was clearly on a wave of confidence after two impressive displays under Thomas Tuchel in the World Cup qualifiers, and was Forest’s stand-out performer. High-pressing was clearly the order for Postecoglou’s new players, but Forest were forced to defend so deep for much of the afternoon that they could barely venture out of their own half. Inspired by the brilliance of new signings Noni Madueke and Eberechi Eze, plus midfielder Martin Zubimendi, Arsenal were irresistible at times. Madueke, in particular, was outstanding and it feels like a trick of the imagination that some Arsenal supporters seemed so averse to his arrival from Chelsea.\n\nArsenal will begin their latest Champions League journey this week away against Athletic Bilbao and this was a delicious response to the defeat at Liverpool before the international break. Arteta clearly has more strength in depth than before, and do not overestimate the presence of a specialist centre-forward in Viktor Gyokeres. Martin Zubimendi of Arsenal scores his team’s first goal past Matz Sels of Nottingham Forest. Credit: Getty Images The only disappointment was a recurrence of Martin Odegaard’s shoulder injury, with the captain joining a casualty list that includes Gabriel Jesus, Kai Havertz and William Saliba. Forest did cope well for half an hour, despite being penned back, but from the moment Zubimendi broke their resistance it was game over.\n\nTime on the training ground over the next few weeks will be precious for Postecoglou. Loading It was Arsenal’s players who took centre-stage, and Zubimendi provided a moment of magic which enabled them to break down their opponents. Chris Wood’s header from a Madueke corner arced into the path of the Spanish midfielder outside the penalty area and he crashed a dipping volley past Matz Sels. Zubimendi’s first Arsenal goal was a masterclass in technique, albeit taking a deflection off Forest centre-back Murillo.\n\nWithout key defender Ola Aina until the end of the year with a hamstring injury sustained on international duty this week, Murillo was withdrawn soon after the goal in clear discomfort. Arsenal required only 46 seconds of the second-half to extend their lead with a goal of brutal simplicity. Eze and Gyokeres combined with the Swede providing the finish, following a lofted pass over the top from Riccardo Calafiori. Postecoglou stood with his arms folded, shaking his head. As Arsenal threatened to overrun his new team, the inevitable chants of “sacked in the morning” echoed around the Emirates. Zubimendi added the third goal 11 minutes from the end with a header from substitute Leandro Trossard’s cross and, in the end, it could have been even worse.\n\nWelcome back, Ange. Meantime, Newcastle United’s new signing Nick Woltemade enjoyed a dream debut, scoring in their 1-0 win over Wolverhampton Wanderers for their first victory of their campaign, while Bournemouth continued their strong start with a 2-1 victory over Brighton & Hove Albion, Tottenham Hotspur cruised to a 3-0 win over West Ham United, and a late Brentford goal denied Chelsea moving atop the table. Fulham recorded their first win of the season by beating Leeds United 1-0 thanks to a late own goal, while Crystal Palace were held to a 0-0 draw by Sunderland and neither Everton nor Aston Villa could find the back of the net in a scoreless draw. Villa have failed to score in their opening four league games of a season for the first time in their history.\n\nChelsea looked poised to leapfrog Arsenal to the top of the table after Cole Palmer scored an equaliser in his return from a groin injury to cancel Kevin Schade’s first-half goal, and Moises Caicedo celebrated what he thought was the winner in the 85th minute. But Fabio Carvalho poked home the equaliser from six yards out in the 93rd after Schade’s long throw-in. “Delighted with the approach of the group, the character we constantly show,” Brentford boss Keith Andrews told the BBC. Micky van de Ven of Tottenham Hotspur celebrates scoring. Credit: Getty Images\n\n“The equaliser came very late but it’s what I felt we deserved from the game in terms of the application, the quality the players showed for large parts.” Newcastle’s new club record signing Woltemade stole the show in Tyneside in their first game since their former hero Alexander Isak departed for Liverpool, scoring in the 29th minute when he arrived at the back post to send a header past Sam Johnstone. “The fact we haven’t won a game puts more pressure on you in the latter stages,” Newcastle boss Eddie Howe told the BBC. “The win was all that mattered but we’d love to win in a better style and score more goals. “It was great to see Nick score on his debut. Very strong, I was very pleased with him.”\n\nTottenham left West Ham languishing in the bottom three, with the Hammers suffering another blow as midfielder Tomas Soucek was sent off for a dangerous tackle. Pape Matar Sarr, Lucas Bergvall and Micky van de Ven all scored second-half goals in Spurs’ first game since executive chairman Daniel Levy’s exit from Tottenham. “So happy that the goal came in the second half because you never know, the momentum can change after half-time but we kept going and scored a good goal after and then 3-0 done,” Spurs boss Thomas Frank said. “So a very good clear win, a good performance and I think we all know the derby and the importance of the game for the fans.”\n\nAt Bournemouth, Alex Scott opened scoring with a brilliant strike from outside the box in the 18th minute. Brighton drew level in the 48th on a goal from Kaoru Mitoma but Antoine Semenyo sealed the victory for Bournemouth’s third win on the bounce with a penalty in the 61st after Evanilson was brought down. “The mood in the camp is perfect. We can’t ask for any more, we just have to keep going,” Semenyo told the BBC. Fulham appeared headed for another draw when Gudmundsson scored a horror own goal from a corner kick in the 94th minute, stooping to head in the ball with great force. Loading",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/federal-government-to-spend-12-billion-on-aukus-submarines-facility-20250914-p5muuj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal government to spend $12 billion on AUKUS submarines facility",
        "publish_date": "Sun, 14 Sep 2025 09:13:52 +1000",
        "category": "finance",
        "authors": [],
        "text": "Federal government to spend $12 billion on AUKUS submarines facility\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw4-fulham-vs-leeds-20250914-p5muue.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW4: Fulham vs Leeds",
        "publish_date": "Sun, 14 Sep 2025 09:08:58 +1000",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW4: Fulham vs Leeds\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw4-bournemouth-vs-brighton-20250914-p5muug.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW4: Bournemouth vs Brighton",
        "publish_date": "Sun, 14 Sep 2025 09:08:38 +1000",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW4: Bournemouth vs Brighton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw4-west-ham-vs-spurs-20250914-p5muuf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW4: West Ham vs Spurs",
        "publish_date": "Sun, 14 Sep 2025 09:06:59 +1000",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW4: West Ham vs Spurs\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw4-crystal-palace-vs-sunderland-20250914-p5muud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW4: Crystal Palace vs Sunderland",
        "publish_date": "Sun, 14 Sep 2025 09:06:37 +1000",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW4: Crystal Palace vs Sunderland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/traveller/inspiration/short-international-holidays-20230314-p5crxs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Quick getaways: The best destinations for a short break",
        "publish_date": "Sun, 14 Sep 2025 08:43:27 +1000",
        "category": "finance",
        "authors": [],
        "text": "Holiday guide\n\nQuick getaways: The best destinations for a short break\n\nLess taxing on the wallet and easier to plan than a longer trip, short breaks are the antidote to the daily grind. Immerse yourself in nature on a guided walk, sleep beneath the stars, or jet off to a tropical island and lose track of time. Traveller’s special annual report is once again bursting with short-break inspiration at home and overseas. Because let’s face it: who doesn’t love the spontaneity, and simplicity, of a last-minute getaway?",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/government-sinks-defence-billions-ships-173000560.html",
        "title": "Billions sunk into AUKUS defence hub ahead of US visit",
        "publish_date": "2025-09-14T01:28:59Z",
        "category": "finance",
        "authors": [],
        "text": "A $12 billion funding pledge aimed at boosting Australia's naval capabilities is part of the \"biggest peacetime increase\" in defence spending, the government says.\n\nThe money will be funnelled into constructing docks and shipbuilding facilities for the AUKUS submarines in Western Australia.\n\nThe announcement comes as the Trump administration reviews the trilateral security deal with Australia, UK and the US and puts pressure on its allies to boost defence spending.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nPrime Minister Anthony Albanese is due to fly to the United States next week for the United Nations General Assembly, where a face-to-face meeting with Donald Trump may be on the agenda.\n\nAnthony Albanese and Defence Minister Richard Marles will invest heavily in WA's Defence precinct. (Lukas Coch/AAP PHOTOS)\n\nThe $12 billion will go towards the delivery of a Defence precinct within the maritime hub on Cockburn Sound in Perth's south.\n\nThe design of the Henderson facility will aim to deliver continuous shipbuilding and reinforce Australia's AUKUS capacity.\n\nAustralia's defence spending is presently sitting at two per cent of gross domestic product and the US has been pushing the nation to bump it to 3.5 per cent.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nDefence Minister Richard Marles said the government was focused on the \"dollar amount\" rather than the \"range of different measures\" for accounting for spending as a percentage of GDP.\n\nThe government has pledged funds for docks and shipbuilding facilities in WA. (Dan Himbrechts/AAP PHOTOS)\n\n\"When you include what we are spending here, it is the better part, relative to what we inherited when we came to government back in 2022, of an additional $70 billion of defence spending over the decade,\" he told ABC Insiders program on Sunday.\n\n\"And what that represents is the biggest peacetime increase in our defence spending in Australia's history.\"\n\nThe prime minister is set to confirm the mammoth investment along Mr Marles, Defence Personnel Minister Matt Keogh and WA Premier Roger Cook on Sunday.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Marles refused to pre-empt the review outcome of the AUKUS review, but was confident the security deal was viewed favourably in the US.\n\n\"In all the conversations that I've had, there has been an enormous sense of positivity about the role that AUKUS can play for the United States.\"\n\nThe upgraded Defence facilities will support Australia's planned Virginia-class submarines. (Colin Murty/AAP PHOTOS)\n\nThe $12 billion will amount to a down payment for Henderson, with independent planning and advice indicating it will consume about $25 billion over the decade.\n\nThe initial funding will go to kick-starting early works while more detailed planning and designs are finalised.\n\nIt will underpin the construction of ADF surface vessels, starting with Army landing craft and then the local construction phase of Australia's future general purpose frigates.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nFacilities will also be built to support surface combat vessels and docking capabilities for conventionally-armed but nuclear­-powered submarines from the early 2030s.\n\nThe undertakings will clear the decks for delivery of Australia's first Virginia-class submarine.",
        "source": "Yahoo"
    }
]