[
    {
        "url": "https://www.9news.com.au/national/australia-house-market-crisis/443abcf6-5d4a-4eef-9630-b8378632c5ae",
        "title": "Why home ownership is out of reach for millions of Aussies",
        "publish_date": "Mon, 11 Aug 2025 00:12:00 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "More than one-third of Aussies believe they will never afford to buy a home, a new survey has revealed.\n\nHouse prices have boomed in the last two decades, with the gap between income and the price of property rising to an all-time high.\n\nNew research from data comparison firm Finder showed 35 per cent of Australians - up to 9.5 million people - now say they will never own property.\n\nREAD MORE: Reserve Bank poised to bring interest rates relief for millions\n\nMillions of Aussies are being pushed out of the housing market. (Joe Armao/The Age)\n\nFinder's Graham Cooke said many are feeling like they are being shut out of the market, even if they have good jobs.\n\n\"Record prices, steep borrowing costs, and saving for a deposit are locking people out,\" he said.\n\n\"In many suburbs, even a six-figure salary won't comfortably cover a mortgage.\"\n\nThe survey also found almost half of all Australians are living paycheque to paycheque, and 12 per cent feel insecure in their current job.\n\nThe housing crisis is a conundrum experts around the country are trying to solve, and one theme has become clear, according to the survey of housing experts.\n\nExperts in Australia agree that housing supply must be increased restrictions must be eased. (Getty Images/iStockphoto)\n\n\"We need to increase the housing stock. That means the government should play an enabling role by introducing and coordinating policies that remove barriers to housing development,\" Mala Raghavan from the University of Tasmania said.\n\nAddressing immigration is also a potential solution, according to another expert.\n\n\"The only options are to reduce demand or increase supply,\" Noel Whittaker from the Queensland University of Technology said.\n\n\"The way to reduce demand is to limit immigration and reduce all these government schemes that are allegedly making homes more affordable.\n\n\"As far as supply goes, I'm pessimistic; there's a huge bottleneck, and the bureaucratic processes of government at all levels make it nearly impossible.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-victoria-melbourne-meteor/bce84761-dba1-43cb-9c56-450dd2f9c3a1",
        "title": "Meteor streaks across the night sky in Victoria",
        "publish_date": "Mon, 11 Aug 2025 00:28:26 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Dash cam and CCTV footage in places such as Bendigo, Ballarat and the western fringes of\n\nMelbourne\n\ncaught a glimpse of the rare and stunning sight, with some on social media reporting they felt the ground shake.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/hawaii-ferry-rides-huge-waves-in-hawaii-before-becoming-grounded/d3d6d59a-3e34-46f9-b9f6-79d925fcb938",
        "title": "Ferry rides big wave in Hawaii before running aground",
        "publish_date": "Sun, 10 Aug 2025 09:45:35 +0000",
        "category": "sports",
        "authors": [
            "Aug"
        ],
        "text": "There were heart-stopping scenes in Hawaii when a passenger ferry was caught out by wild waves with surfers racing to paddle out of its path.\n\nBut the 15-metre vessel held its own, riding one of Waikiki's most popular breaks, Kewalos, before running aground on a nearby reef.\n\nThe boat, operated by Atlantis Adventures, is used to transport guests to and from a local dive site.\n\nREAD MORE: F ootage shows agonising near misses on light rail tracks\n\nThere were no guests hanging 10, just two crew members holding on as the ferry carved the unusually high surf.\n\n\"I'm just really grateful that nobody was hurt in terms of any of the surfers out on the water, hopefully they didn't cause damage to the reef,\" Maliny Soukkhasen, board member of the Friends of Kewalo, said.\n\nThe US Coast Guard was called in as tourists watched",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/city2surf-sydney-2025-in-photos/8b6267f9-3155-4a2a-87ba-a396535e9753",
        "title": "Tens of thousands of runners brave rainy Sydney for wettest City2Surf in years",
        "publish_date": "Sun, 10 Aug 2025 00:20:27 +0000",
        "category": "finance",
        "authors": [
            "August"
        ],
        "text": "1 of 21 Attribution: Oscar Colman\n\nAround 90,000 people took to the rainy streets of Sydney today for the 2025 City2Surf.\n\nThe sold-out event was a sea of colour (and rain) as the early birds made the 14km trek from the city's CBD to the iconic Bondi Beach.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/hong-kong-stablecoin-regulations-china-cryptocurrency/dbb8d467-f23b-44e1-90a3-2a87dd2ccc5b",
        "title": "China eyeing off huge $43 trillion system you've probably never heard of",
        "publish_date": "Sat, 09 Aug 2025 21:32:38 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "If some of the less trustworthy corners of the internet were to be believed, China took a fairly drastic step against cryptocurrencies last weekend by banning them.\n\nAs it turns out, that was fake – or at the very least old – news; Beijing did put a ban on trading and mining crypto, but that was handed down on September 24, 2021, a lazy 1409 days earlier.\n\nBut if you zoomed out just slightly from the Chinese mainland, then there was a genuine development.\n\nChina didn't ban cryptocurrency last weekend. (AP Photo/Ng Han Guan)\n\nOn August 1, new regulations in Hong Kong came into effect, allowing companies to apply for a licence to issue stablecoins.\n\nUnlike more typical cryptocurrencies like Bitcoin, whose value fluctuates wildly, the value of stablecoins is pegged to that of currencies or commodities, removing the volatility that deters some investors.\n\nThey don't just account for pocket change, either.\n\nAccording to ANZ, stablecoin transactions were worth $US27.6 trillion ($42.5 trillion) last year alone.\n\nThat's more than all transactions made using Visa and Mastercard combined, and about 15 times the value of the entire Australian economy.\n\nHong Kong isn't the only jurisdiction to regulate stablecoins recently.\n\nUS President Donald Trump signed the GENIUS Act (officially the Guiding and Establishing National Innovation for US Stablecoins Act) on July 18, one of three major bills to clear the House during what was touted as \"crypto week\".\n\nUnlike volatile cryptocurrencies like Bitcoin, stablecoins' value is intended to be more reliable. (AP Photo/Kin Cheung)\n\n\"The regulations in the US and Hong Kong have attracted significant market attention,\" ANZ chief greater China economist Raymond Yeung wrote.\n\n\"Companies involved in issuing and trading stablecoins have seen their stock prices rally massively.\"\n\nIn Australia, meanwhile, the RBA has ruled out the idea of a central bank digital currency for now, but announced the start of a trial of tokenised currencies﻿, including stablecoins, in July.\n\nNot that everyone thinks they're a good idea.\n\nLaw professor and prominent crypto critic Hilary Allen compared the GENIUS Act to the pre-regulated financial era that led to the Great Depression.\n\nDonald Trump signed the GENIUS Act to regulate stablecoins last month. (AP Photo/Evan Vucci)\n\n\"It won't just be crypto taking advantage, it'll be everybody,\" Allen told CNN last month.\n\n\"And then we get to unregulated markets for all kinds of investments, which is where we were in the 1920s, and we saw how that ended.\"﻿\n\nThe Hong Kong regulations come as some Chinese tech giants, including e-commerce behemoth JD.com and the Alibaba-linked Ant Group, have reportedly pushed Beijing to allow stablecoins linked to the yuan to counter the surge of US dollar-backed crypto.\n\nMore than a few commentators and analysts have talked of Hong Kong acting as a testing ground for the mainland.\n\n\"The emergence of stablecoins in the 2020s gave hope to the internationalisation of the (yuan), and the passing of Hong Kong's stablecoins ordinance was viewed as a further step in that direction,\" Yeung said.\n\nAt the same time, it's no secret China wants to get away from the reliance on the US dollar in international transactions, and promote the yuan in its place.\n\nSo could a yuan-backed stablecoin offer a way to do just that?\n\nREAD MORE: Where your dog sits in the car could cost you thousands in fines ﻿\n\nChina wants to decouple from the US dollar and promote its own currency in its place. (Chinatopix via AP)\n\nAccording to Yeung, even if Beijing does allow them, a stablecoin on its own won't drive dedollarisation – it'll come down to a host of other factors.\n\n\"Some observers think it could help,\" he wrote.\n\n\"But it's likely any currency diversification will depend on the popularity of the yuan, rather than any one technology…\n\n\"Should China want to allocate less foreign reserve to $US, then stablecoins backed by other currencies are the alternative, not the yuan-backed stablecoin.\n\n\"The issuance of yuan-backed stablecoin requires sufficient high-quality liquid assets.\n\n\"This could be limited by the issuers' access to renminbi deposits, offshore China sovereign and sub-sovereign bonds and their access to the onshore bond market.\n\n\"Stablecoin issuance, and their reserve funds, will increase demand for these assets.\n\n\"But ultimately, the success of renminbi internationalisation will drive yuan-backed stablecoins — not the other way round.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-11/university-of-western-australia-uwa-suffers-major-data-breach/105636074",
        "title": "University of Western Australia suffers major data breach",
        "publish_date": "Mon, 11 Aug 2025 01:53:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "One of Australia's major universities has suffered a data breach, with the password information of thousands of staff and students exposed.\n\nThe University of WA (UWA) confirmed it was investigating a cybersecurity incident on Saturday night, which involved unauthorised access of password information.\n\nAfter detecting the breach, UWA locked staff and students out of the system and urged people to change their passwords.\n\nUWA chief information officer Fiona Bishop said a critical incident management team was activated to begin \"countermeasures\".\n\n\"Our IT and many teams worked tirelessly overnight on Saturday and through the weekend to lock and reset all students', staff and visitor passwords,\" she told ABC Radio Perth.\n\nHave something to share with the ABC's WA newsroom? Photo shows Perth City and Claisebrook Cove Whether it's an image, video, story, or tip-off, you can send it to the ABC's West Australian newsroom here.\n\nMs Bishop said there was no evidence to suggest any information aside from passwords had been accessed and the investigation would continue.\n\nHowever, she said the breach was like \"following footprints in the sand.\"\n\n\"We've already moved on to recovery and investigation,\" she said.\n\nMs Bishop said she was \"exceptionally pleased\" with the responsiveness of the university's IT teams and digital experts.\n\n\"We're working feverishly to ensure everyone can log on, staff and students have [been] provided a three-day extension to student assessments,\" she said.\n\nA notice posted to the UWA website following the data breach. (ABC News: Gian De Poloni)\n\nMs Bishop said the university had no communication from anyone who might have been responsible for the breach and \"no indication it was ransomware\".\n\nShe said UWA would continue to work on its cybersecurity measures.\n\nCyber attack causing campus chaos Photo shows Students walking at the University of Notre Dame Fremantle campus A cyber attack on Perth's Notre Dame University IT systems nine weeks ago is still playing havoc on campus with students reporting uncertainty with graduations, finding classes, and submitting assignments.\n\n\"Universities are powerhouses of information and learning and the sector as a whole is a cyber target, which is only increasing as they become more digital and modernised,\" Ms Bishop said.\n\n\" The sector is continuously under attack. \"\n\nThe university did not expect interruptions to teaching and classes could proceed as planned.\n\n\"We do know that people will continue to need support in resetting their password and so we will continue to man that effort over the course of the next couple of days,\" Ms Bishop said.\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-11/live-music-venues-given-green-certification-in-nsw/105623852",
        "title": "Live music venues reduce power bills with simple green initiatives",
        "publish_date": "Mon, 11 Aug 2025 00:48:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Nathan Stratton's popular Wollongong venue La La La's has a power-hungry amplification system booming out live music most nights of the week, and his fridges run all day.\n\nBut some simple, inexpensive changes to improve the efficiency of his building have reduced his power bill.\n\n\"The impact of just window and door seals is a very cheap and effective way to mitigate noise and draught and keep weather out,\" he said.\n\n\"It can be daunting taking on environmental initiatives because you always feel like you're not doing enough but I think if it has to be done step-by-step, it still makes a difference.\"\n\nMr Stratton's venue is one of just nine in Australia to receive Green Venue certification through Green Music Australia.\n\nNathan Stratton is keen to share his knowledge with other live music venues. (ABC Illawarra: Justin Huntsdale)\n\nChanges that pay for themselves\n\nGreen Music Australia is an organisation that aims to encourage and facilitate musicians and the music industry to improve their environmental performance around areas of energy use, packaging, waste and transport.\n\nIt piloted the program this year with an open expressions of interest process to assess venues for their environmental impact.\n\nThey were scored on criteria like single-use plastics, energy use, waste and how they encouraged patrons to travel to their venue.\n\nA certified Green Venue appeals to environmentally conscious bands and booking agents. (Supplied: Chris Frape)\n\nGreen Music Australia's research from its NSW Venue Sustainability Health Check, released this year, found venues could save an average of $10,388 each year through environmental improvements.\n\nThis included changes like switching energy providers, improving efficiency through appliance maintenance and installing solar power.\n\nVenues could also reduce their electricity emissions to zero by switching their energy contract to GreenPower, which uses 100 per cent renewable electricity and is available through most energy retailers in Australia.\n\n\"We're trying to help venues do better for the planet, but there's some great opportunities to save money,\" Green Music Australia spokesperson Emma Bosworth told ABC Illawarra Drive.\n\n\"We launched the certification because Green Music Australia works with labels and artists and they were asking us, 'Where should we book our shows? Which venues are doing the right thing?'\n\n\"It's been born out of a need.\"\n\nExpanding the program nationally\n\nMr Stratton said while he did not own the venue, installing a 6 kilowatt solar system made good business sense.\n\nHe said the system would provide sufficient power for the venue's needs during the day and would pay for itself in three years.\n\n\"We're really chuffed and we've put a lot of work into this and we've got a lot of work to do, but we're happy to share the education we've learnt to pass on to any other venues that are interested,\" Mr Stratton said.\n\nGreen Music Australia hopes to expand its Green Venues program nationally and expressions of interest will be open to any live music venue.\n\nOther venues to receive the certification were ICC Sydney, Bondi Pavilion, Club 77, Brunswick Picture House, The Metro Theatre, King St Newcastle, Lansdowne Hotel and Anita's Theatre, also in Wollongong.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-11/yass-and-upper-lachlan-farmers-pushback-on-wind-farm-development/105618694",
        "title": "Towns 'lumped' with 'burden of energy production' push back on wind farms",
        "publish_date": "Sun, 10 Aug 2025 23:31:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Third-generation farmer Emma Webb believes the region surrounding her family's property on the NSW Southern Tablelands is becoming an \"industrial junkyard\" due to the rollout of renewable energy projects.\n\nFrom her farm at Binalong, near Yass, the horizon is peppered with dozens of turbines, and she is worried there will be more to come.\n\nSix more wind and solar projects have recently been approved in the Yass Valley, and the neighbouring Upper Lachlan Shire, by the New South Wales Department of Planning.\n\nThe districts already host 42 per cent of the state's wind turbines.\n\n\"There is an overwhelming sense of powerlessness,\" Ms Webb said.\n\n\" There needs to be a consideration of the cumulative impacts … this region is already saturated. \"\n\nThe Rye Park Wind Farm, near Yass, is home to 66 wind turbines. (ABC Central West: Hamish Cole)\n\nMs Webb said while farmers understood the impacts of climate change, she wanted to see a \"better balance\" with the rollout of renewables.\n\n\"People in the cities delegate the enormous responsibility of growing their food to farmers and we do that under very difficult circumstances,\" she said.\n\n\" Now we are also being lumped with the burden of energy production. \"\n\nLatest wind project\n\nMs Webb is president of the Binalong Bowning Community Action Group, which has been created in opposition to the latest renewable energy proposal in the area.\n\nThe company Wind Prospect is preparing a scoping report for the Bendenine Wind Farm that would feature up to 90 turbines, each 260 metres tall.\n\nEmma Webb's property near Binalong has been in her family for three generations. (ABC Central West: Hamish Cole)\n\nThe project would be located less than 2 kilometres from Ms Webb's home.\n\n\"The consequence is that our home, our community, our landscape will never be the same again,\" she said.\n\n\"There are huge impacts being felt from this proposal immediately.\"\n\nWind Prospect said it understood concerns about the number of renewable energy projects proposed across the region.\n\n\"Cumulative impacts, including social factors, will be carefully assessed as part of the Environmental Impact Statement,\" a Wind Prospect spokesperson said.\n\n\" We remain committed to open, respectful engagement and to delivering a well-considered project that minimises impacts and brings lasting local benefits. \"\n\nCouncil pressure\n\nYass Valley Council, where Ms Webb lives, has passed a motion calling for the state government to stop approving renewable projects in the district.\n\nMayor Jasmin Jones said 18,000 people lived in her community and existing wind and solar projects generated enough power for 500,000 homes.\n\nJasmin Jones says the shire has done enough to support renewable energy. (ABC Central West: Hamish Cole)\n\n\"We are not NIMBYs [Not In My Backyard], we have clearly done some heavy lifting,\" Cr Jones said.\n\n\" There seems to be no line in the sand coming from the state or federal government. \"\n\nThe council does not fall within one of the five renewable energy zones (REZ) the state government identified in 2021 as being ideal locations for wind and solar power.\n\nProponents of REZ wind farms were required to engage with councils and residents over community funding programs, consultation sessions and neighbourhood agreements among affected landholders.\n\nOpposition to renewable energy projects has been growing in the region. (ABC Central West: Hamish Cole)\n\nSince 2021, there have been 22 renewable energy projects approved within the REZs, while 25 have been given the go-ahead outside the five zones.\n\n\"These companies have really cottoned on that it is easier to get their projects approved in non-REZs,\" Cr Jones said.\n\nIn a statement, NSW Minister for Planning and Public Spaces Paul Scully said the guidelines for renewable projects ensured that communities received \"equitable benefit\" as part of the planning process.\n\n\"The guidelines are transparent, community-focused and deliver positive, tangible and long-term socio-economic benefits.\"\n\nMr Scully said the planning process for renewables projects assessed the \"social and environmental impacts,\" and how they could be managed.\n\nRural communities targeted\n\nThe neighbouring Upper Lachlan Shire is home to more than one-third of the state's operational wind turbines.\n\nThe Bango Wind Farm near Boorowa hosts 46 turbines. (ABC Central West: Hamish Cole)\n\nIn June, councillors voted 5-4 against a motion calling for the shire to be exempt from further renewable energy developments.\n\nMayor Paul Culhane said the way in which the transition to renewables was occurring was turning people away from the energy source.\n\n\"Everywhere we drive in the shire we will be seeing turbines,\" Cr Culhane said.\n\n\"It is starting to turn public opinion against renewable energy in our area, which I think is not in the national interest.\"\n\nThe Upper Lachlan Shire and Yass Valley Council are mostly made up of agricultural land. (ABC Central West: Hamish Cole)\n\nCr Culhane said there needed to be a change in how projects were assessed to ensure rural councils were not unfairly targeted.\n\n\"The framework of the planning instruments for this are pushing them towards small communities with not a lot of people and a lot of space,\" he said.\n\n\"We don't want to become a dumping ground.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-11/scott-pendlebury-signs-collingwood-contract-21st-afl-season/105635758",
        "title": "Pendlebury signs on for 21st AFL season, with games record in sight",
        "publish_date": "Sun, 10 Aug 2025 23:23:36 +0000",
        "category": "sports",
        "authors": [],
        "text": "Collingwood great Scott Pendlebury will extend his stellar career next season, when he is set to break the AFL's record for most games played.\n\nPendlebury, who has played 421 AFL games, is just 11 shy of the all-time VFL/AFL record of North Melbourne's retired legend Brent Harvey.\n\nThe 37-year-old Pendlebury has signed a one-year contract extension, while ruckman Darcy Cameron has inked a fresh three-year deal to remain at Collingwood until the end of 2029.\n\nPendlebury, a dual premiership Pie, six-time All Australian and former club captain, had been weighing up his future but decided to continue for a remarkable 21st season next year.\n\n\"Everyone throughout the league appreciates the influence and experience that Scott brings to our side,\" Collingwood list manager Justin Leppitsch said in a statement on Monday.\n\n\"His professionalism is second to none, always ensuring he sets himself up to get the best out of himself and his teammates.\n\n\"In addition to his on-field contribution, it is the guidance he will provide his fellow teammates, setting the standards and embodying what it means to be a Collingwood person, that will be influential throughout our 2026 campaign and beyond.\"\n\nDarcy Cameron has signed a fresh three-year deal with Collingwood. (AAP: Joel Carrett)\n\nRuckman Cameron was contracted until the end of next season, but has signed an extension amid interest from rival clubs in the 30-year-old.\n\n\"Recommitting to Collingwood was an easy decision,\" Cameron said in a statement.\n\n\"This club means a lot to me and now feels like the right time to commit again.\n\n\"We have such a special group here, from the players to the coaches and all staff, and I can't wait to see what we achieve over the coming years.\"\n\nCollingwood holds third spot ahead of a trip to Adelaide to play the ladder-leading Crows on Saturday night.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-11/charlotte-caslick-ruled-out-of-world-cup-in-wallaroos-blow/105635722",
        "title": "Caslick ruled out of World Cup in massive Wallaroos blow",
        "publish_date": "Sun, 10 Aug 2025 22:39:36 +0000",
        "category": "sports",
        "authors": [],
        "text": "Wallaroos trump card Charlotte Caslick has been ruled out of the side's Women's Rugby World Cup campaign.\n\nThe three-time Olympian and rugby sevens gold medallist is recovering from ankle surgery.\n\nShe was included in the squad, with an eye to returning for their second Cup pool game later this month.\n\nThe 30-year-old had paused her sevens career, making a full-time switch to the 15-a-side code this year to add clout to the Wallaroos' Cup charge.\n\nBut the backline talent, who last week said rehabilitation was on track, was ruled out on Monday as the team prepared to fly to England.\n\nCaslick had made the switch from sevens with an eye on this World Cup. (Getty Images: Chris Hyde)\n\nUncapped Wallaroos centre Manu'a Moleka has replaced Caslick, who could still feature as an injury replacement later in the tournament.\n\n\"Charlotte's timeline to get back for our pool matches has changed following medical advice,\" coach Jo Yapp said.\n\n\"The decision was made to allow her to continue on an accelerated recovery program, where she could be available as an injury replacement should we require a player later in the tournament.\n\n\"We're really fortunate and excited that Manu'a can join us for the World Cup.\n\n\"Manu'a has been part of the touring squad since the start of the international Test season and thoroughly deserves her opportunity to join us.\"\n\nCaslick had played five Tests and was beginning to find her feet in the centres, scoring with her first touch against New Zealand before suffering the injury late in that same game last month.\n\nAustralia, whose best result is third in seven Cup appearances, begins its campaign against Samoa on August 23.\n\nMoleka joins sister Faitala in the Wallaroos' squad.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-11/nt-darwin-aboriginal-art-fair-2025-celebrates-culture/105634242",
        "title": "Darwin Aboriginal Art Fair estimated to generate $4 million of revenue",
        "publish_date": "Sun, 10 Aug 2025 22:17:17 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "For Barbara Nasir, art and history are firmly entwined.\n\n\"My mother was stolen from Borroloola under the law of the time,\" she said.\n\n\"Being a descendant of the Stolen Generation, you're always searching for where you belong.\"\n\nMs Nasir has spent much of her life learning about her mother's country, her grandmother's dreaming, and the Garrawa and Yanyua people of Borroloola.\n\nNow, her experiences manifest in her daughter Joanne's paintings.\n\nJoanne Nasir (right) creates paintings inspired by the experiences of her mother Barbara Nasir (left). (ABC News: Marcus Kennedy)\n\n\"We put the story into the painting,\" she said.\n\n\"When you see the painting, it belongs to that country, it belongs to the Borroloola people, our loved ones and our descendants.\"\n\nJoanne Nasir was among dozens of artists exhibiting their works at the Darwin Aboriginal Art Fair (DAAF) on the weekend.\n\nFirst Nations artists from all around Australia travel to the NT to participate in this unique art fair. (ABC News: Marcus Kennedy)\n\nMore than 80 art centres participated in the four-day event, representing more than 1,500 artists from across the country.\n\n\"It's beautiful for people from all different states to come under one roof,\" Larrakia artist Naomi Briston said.\n\n\" There's so much love, so much art and so much culture being shared in this one room. \"\n\nYvonne Odegaard and Naomi Briston are both local Larrakia artists. (ABC News: Marcus Kennedy)\n\nThe room is a smorgasbord of artistic styles and Indigenous communities, heralding from regional Victoria to the Central Desert to Australia's tropical north.\n\n\"It's not just about the exchange that takes place between artists and the market, it's about the exchange between artists themselves,\" creative director Simon Carmichael said.\n\n\"We often see new partnerships and collaborations born that extend well outside the art fair.\"\n\nIn the stall next door to Larrakia Nation, Teneille Nuggins from Hope Vale Arts & Culture Centre shares the work of artists from north Queensland.\n\nTeneille Nuggins works with First Nations artists in north Queensland at the Hope Vale Arts & Culture Centre. (ABC News: Marcus Kennedy)\n\n\"It's amazing, I've been able to meet artists from all over the place — desert artists, coastal artists, artists from Western Australia,\" she said.\n\n\"It inspires you, speaking with them and asking what they do at their centre.\"\n\nArt centre sales 'not just about the arts'\n\nOrganisers estimate DAAF generates more than $4 million in revenue every year, with some art centres making around a quarter of their annual income at the event.\n\n\"One hundred per cent of those sales go back to the arts centres, which supports artists, the art centres and their communities,\" Mr Carmichael said.\n\nKate Murphy is the creative development officer of the Tjanpi Desert Weavers, an organisation facilitating art-making in remote communities across the Central Desert.\n\n\"It's an area about the size of Germany containing lots of very small remote communities with populations of four or five hundred people or smaller,\" she said.\n\n\"We spend a lot of money on petrol.\"\n\nKate Murphy says for many remote First Nations artists, selling their work through events like DAAF is one of the best ways to secure a \"direct stream of income\". (ABC News: Marcus Kennedy)\n\nMs Murphy said the organisation and the funds generated from sales have manifold benefits.\n\n\"Often in remote communities, there's not a lot of employment because there's not a lot of jobs in those communities, so this provides a direct stream of income to women,\" she said.\n\n\"It's not just about the arts — when we go into community there's an opportunity for people to come together, to sit and chat, so there's that social support and cultural connection.\"\n\nMel George of Bula'bula Arts in Ramingining agreed.\n\n\"The art centre is their space, they own it. It's a locally owned and operated Aboriginal business. It's a place of self-determination,\" she said.\n\n\"There's a lot of talk about creating 'jobs', but painting and running classes for kids and providing culturally appropriate income — it's really meaningful.\"\n\nBut the curation of the show is not without its challenges.\n\nMel George describes Aboriginal art centres as \"a place of self-determination\" for First Nations communities. (ABC News: Marcus Kennedy)\n\n\"We call ourselves an anti-fair because most art fairs are commercial, whereas because we ensure that 100 per cent of the sales are returned to communities and our event is free … that comes at a huge cost for us,\" DAAF executive director Claire Summers said.\n\n\"Since the return of the fair after the pandemic, we've constantly been operating in deficit.\"\n\nWhile organisers are constantly looking for more avenues of support, they said the benefit of the fair was obvious.\n\n\"It's a really important part of the local economy and it helps to sustain living cultures,\" Mr Carmichael said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-11/high-school-students-given-taste-of-nursing-allied-health-career/105573296",
        "title": "Students get look at life as an 'exhausted' nurse in a hospital ward",
        "publish_date": "Sun, 10 Aug 2025 22:15:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "It did not take long for Felicity Bacon to realise she was keen on nursing.\n\nThe Riverina Anglican College year 11 student identified her likely career path after taking part in the Be a Health Hero program, run by the Murrumbidgee Local Health District (MLHD).\n\n\"I was a health hero twice last year … and I loved it so much,\" she told ABC Riverina Breakfast.\n\n\"[I] got to hear from other people who worked in the hospital, and I fell in love with nursing.\"\n\nThe four-day program provides year 10 students with the opportunity to learn about life support, wound care and physiotherapy at Wagga Wagga Base Hospital.\n\nInspired by that experience, Ms Bacon is now doing a school-based traineeship in nursing, and hopes to pursue a career as a paediatric nurse.\n\n\"Wednesdays are my favourite days because I get to work at the hospital and it's so new and exciting and it's not the same and it's all just so fun,\" she said.\n\n\" You're constantly learning, constantly adapting … and everything's so different from day to day. \"\n\nYear 10 students are getting a feel for a career in health care at Wagga Wagga Base Hospital. (ABC Riverina: Michael Patterson)\n\nThe traineeship offers year 11 and 12 students the opportunity to work one day a week at Wagga Base Hospital while completing a Certificate III qualification in either health services assistance or allied health assistance.\n\nEighty-five students have participated in the MLHD traineeships since the program started in 2020.\n\nThe risk of 'being burnt out'\n\nNurses and Midwives Association Wagga Wagga branch secretary Roylene Stanley said she had mixed feelings about the programs.\n\n\"It's a great idea … it gives them a taste of what nursing is like,\" Ms Stanley said.\n\n\"[But] imagine coming into critical staff shortages and seeing how hard nurses are working.\n\n\" They're being burnt out. \"\n\nRoylene Stanley is concerned about the impact ongoing nurse shortages will have on students' first impressions. (Supplied)\n\nAccording to figures supplied by the union, nurses and midwives worked a total of 133,417 overtime hours in the 2023/2024 financial year, costing the health district more than $11 million.\n\nMs Stanley said members were expected to regularly work several hours of overtime and the industry was losing experienced nurses.\n\n\"The answer isn't going to be filling all these gaps with nurses who just don't have that experience,\" she said.\n\n\" We need to be looking at how do we keep those nurses with that experience that they're going to learn from within the system. \"\n\nMs Bacon noticed the long hours nurses were working during her traineeship, but said she was inspired by their devotion to the job.\n\nFelicity Bacon is completing a traineeship in nursing alongside her high school studies. (ABC Riverina: Andrew Mangelsdorf)\n\nHealthcare issues remain\n\nRural Doctors Association of NSW president Rachel Christmas agreed there were staffing issues to be addressed, but said the traineeships were \"fantastic\".\n\n\"[Students are] working towards their health qualification, while finishing off their schooling, and I think that's a really great idea,\" she said.\n\nRachel Christmas says the shortages are getting worse with nurses \"exhausted\" and overworked. (ABC News: Lauren Pezet)\n\nBut Dr Christmas, who works across the private and public health sectors, said there was a shortage of nursing staff at the Temora Hospital, which is also in the MLHD.\n\nShe said the situation was getting worse, with nurses \"exhausted\" and overworked.\n\n\"What we're seeing is a lot of the nurses are working really hard and our nurses on the ground locally are the ones who stay here working longer shifts and double shifts to make up the numbers,\" she said.\n\n\" Unfortunately, that means they get exhausted. \"\n\nDr Christmas said inquiries into healthcare provision in regional NSW had shown many areas needed addressing, including culture, staffing, pay, incentives, education, support and upskilling.\n\n\"There are so many things that need to be addressed and a lot of it takes money, time and good leadership,\" she said.\n\n\"So, it's a really complex area and there's a long way to go.\"\n\nThe ABC reached out to the MLHD for data about nurse vacancies, but it did not respond before publication.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-11/gardner-stoinis-star-on-mixed-day-for-aussies-in-the-hundred/105635572",
        "title": "Gardner, Stoinis star on mixed day for Aussies in the Hundred",
        "publish_date": "Sun, 10 Aug 2025 22:08:20 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's men and women have lit up the Hundred in England, but not all have managed to end up on winning sides.\n\nStar all-rounder Ash Gardner remains winless in her leadership of the Trent Rockets despite delivering her best knock yet, having to bow instead to the Australian-powered Northern Superchargers at Trent Bridge.\n\nMarcus Stoinis made swift amends after a tough opening match, keeping his cool to deliver with bat and ball and give the Rockets' men's side lift-off to their campaign.\n\nStoinis sent down just one five-ball \"over\" in the clash with Northern Superchargers at Trent Bridge on Sunday, but it was enough time for him to earn two wickets in successive balls, including the prize scalp of an on-song Harry Brook.\n\nHis 2–0 contribution proved crucial in keeping the Superchargers down to a sub-par total of 9–124 and was a far cry from Friday's opener when he had been hammered for a wicketless 34 runs off 20 balls as the Rockets misfired against the Birmingham Phoenix at Edgbaston.\n\nWith a few nerves jangling and nine runs still needed off the final 10 balls to get to the winning line, Stoinis (8 not out) and English batter Adam Hose (5 not out) then knocked off the runs between them to seal the Rockets' five-wicket win with four balls remaining.\n\nGardner, meanwhile, kept her Rockets' hopes alive with her thrilling knock of 61 off 32 balls.\n\nStudded with 10 fours, it represented nearly half their total of 8–128, but still proved nowhere near enough as the Superchargers, thriving off the back of excellent performances from Aussie internationals Georgia Wareham, Phoebe Litchfield and Annabel Sutherland, knocked off the runs for the loss of just two wickets.\n\nThe supremely talented Litchfield, with an inventive switch-hitting cameo of 22 off just 10 balls, and Sutherland, clattering an unbeaten 18 off 11, took the visitors swiftly past the target with 21 balls remaining.\n\nThey provided the main support acts to 18-year-old English find Davina Perrin, whose brilliant unbeaten 72 deservedly won her the player of the match honours and marked her as an opener Australia may have reason to be fearful of over the next few years.\n\nGardner had been hitting the ball beautifully while wickets tumbled around her, hitting her first half-century since captaining the Gujarat Giants in the Women's Premier League in February.\n\nIn the day's earlier match at Southampton, Ellyse Perry's Birmingham Phoenix were beaten by 15 runs by Southern Brave.\n\nThe great Australian all-rounder looked well set to guide the visitors to a second straight win in the competition as they chased a total of 7–139 but on 26 off 21 balls, Perry toe-ended a swipe off Sophie Devine and was bagged at deep mid wicket.\n\nFrom there, the Phoenix challenge, which had kicked off with Aussie opener Georgia Voll getting bowled for 10, eventually faded as they were bowled out for 124, with only Dutch batter Sterre Kalis showing much resistance with her 44 off 34 balls.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-11/meta-shuts-down-business-accounts-western-australia/105628412",
        "title": "Business owners 'horrified' by Meta's false child abuse allegations",
        "publish_date": "Sun, 10 Aug 2025 22:07:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Small businesses across regional Western Australia say their trade has taken a significant hit after tech giant Meta wrongfully accused them of spreading child abuse material via their social media pages.\n\nThe ABC has spoken to multiple business owners who were horrified after Meta, which runs Facebook and Instagram, suspended their pages after falsely alleging the pages contained child exploitation material.\n\nThe removals often led to the suspension of personal accounts linked to those businesses.\n\nSamantha Enticknap's makeup business and personal accounts across Meta's platforms were removed. (ABC South West WA: Pip Waller)\n\nSamantha Enticknap runs a make-up business in Margaret River, 271 kilometres south of Perth, and said all of her social media accounts were suspended on July 14.\n\n\"I opened my email and saw due to sexually explicit content and nudity with children I had been suspended,\" Ms Enticknap said.\n\n\"I have a make-up page with pictures of make-up on women. There's no nudity.\n\n\" It was horrifying to see this accusation and it really affected both my business and myself emotionally. \"\n\n'Breach of community standards'\n\nMs Enticknap was told by Meta her account had been suspended because it had breached the tech company's community standards.\n\nCindy Kempton runs a fitness company across the Kimberley and the Pilbara and has been without her social media pages for six weeks.\n\nMeta, again, cited child abuse material as the reason for the suspension.\n\n\"Which is completely untrue. We very rarely, if ever, put children up on our Instagram because of the regulations surrounding children,\" Ms Kempton said.\n\nThe social media pages of six of Cindy Kempton's fitness companies were removed after they were flagged by Meta. (ABC Kimberley: Ruby Littler)\n\n\"We've lost tens of thousands of followers and the enquiries for our business dropped dramatically because there was no way of people contacting us.\n\n\"It just caused so many issues, not only for us but also for our communities and our business.\"\n\nBoth businesses outlined significant difficulty with Meta's appeals process, due to the inability to make contact with anyone in the company.\n\nMeta told Samantha Enticknap that her accounts were suspended because of a breach in the platform's community standards. (Supplied)\n\nThe ABC understands Meta uses a combination of humans and AI technology to find and remove accounts that break its rules.\n\nHowever, according to the tech giant, there has been no increase in incorrect enforcement of its rules.\n\nIn a statement, a Meta spokesperson said the company took action on accounts that violated its policies.\n\n\"People can appeal if they think we've made a mistake,\" the spokesperson said.\n\n'Own the house, own the land'\n\nThe Small Business Development Corporation is a WA government agency that provides free advice to small businesses across the state.\n\nDirector Caragh Waller said a lot of businesses were under the misapprehension that their business page was their asset, but that was not the case when it was through a private company such as Meta.\n\n\"We would advise businesses to be careful about having all your eggs in the Meta basket,\" Ms Waller said.\n\n\"It's akin to building a house on someone else's land. Your house is your business, so make sure you own the land.\n\n\"It's a huge financial hit [for these businesses], but it's also reputational damage to be linked to something quite unsavoury on the internet.\"\n\nWhen questioned by the ABC, Meta restored Ms Enticknap's accounts, but Ms Kempton remains offline.\n\nCindy Kempton says the closure of her Meta accounts has caused a string of issues for her business. (ABC Kimberley: Ruby Littler)\n\nIn the space of three weeks, Ms Enticknap said she had an 80 per cent loss in revenue.\n\n\"It's just a minefield of knowing who to speak to, who to go to, how we get our businesses back,\" she said.\n\n\"We're just small businesses trying to make money.\n\n\"Just give us an explanation of what we've done and a better review process.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/music/get-20-percent-off-a-musical-awakening-with-the-australian-chamber-orchestra-20250811-p5mlye.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Get 20% off A Musical Awakening with the Australian Chamber Orchestra*",
        "publish_date": "Mon, 11 Aug 2025 12:19:56 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "As a subscriber, you can save 20% on tickets to A Musical Awakening with the Australian Chamber Orchestra. Directed by Principal Cello Timo-Veikko Valve and featuring beloved Australian recorder virtuoso Genevieve Lacey, we invite you to experience an unforgettable concert that promises to nourish your soul and awaken your spirit.\n\nA Musical Awakening Credit: Australian Chamber Orchestra\n\nThis is your moment to pause, disconnect with the outside world and immerse yourself in a sublime musical journey featuring music by Max Richter, Hildegard von Bingen, Beethoven, Vivaldi and more.\n\nOne of the most influential composers of his generation, Max is an international musical phenomenon, renowned for transporting listeners through his evocative solo works, collaborations and numerous scores for film and television. The ACO will perform his captivating work for strings, On the Nature of Daylight, alongside Beethoven’s deeply moving Holy Song of Thanksgiving and visionary hymns of 12th-century abbess Hildegard.\n\nHead to the ACO booking page and use the code SMH2025 on any A-C Reserve adult tickets at checkout up to 24 hours before your selected performance to claim 20% off your ticket.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/the-wellness-influencers-giving-up-sunscreen-and-what-it-could-mean-for-cancer-rates-20250811-p5mlw6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The wellness influencers giving up sunscreen – and what it could mean for cancer rates",
        "publish_date": "Mon, 11 Aug 2025 12:05:29 +1000",
        "category": "lifestyle",
        "authors": [
            "Sabrina Malhi"
        ],
        "text": "Some people are also looking for natural alternatives, and they say skin irritation they have experienced from certain products has caused them to shift from conventional products. As a result, alternatives like homemade creams and mineral-based sunscreens have become more popular. Some people are also choosing to stop using sunscreen entirely. “I am definitely a MAHA mom and voted for Trump so that RFK Jr could get into office,” says Summer Whiteside, 31, an ER nurse from Wildomar, California, in a text message. “After listening to his podcast on Joe Rogan, I knew he was the man for the job.” On Instagram, Whiteside – who doesn’t shy away from the label “crunchy” – posts about things like beef tallow for sunburns and her preference for mineral sunscreen. Whiteside, who says she has concerns about the chemicals in sunscreen, uses long-sleeved rash guards on her kids and sunblock only on their faces. Some wellness figures have claimed that diet changes or building sun exposure gradually can protect against burns, which dermatologists and the scientific community strongly recommend against. Some in the anti-sunscreen movement point to studies suggesting that certain chemicals cause cancer or are absorbed too heavily into the body. But public health experts say there are no human studies that conclusively prove ingredients like oxybenzone act as carcinogens.\n\n“Oxybenzone has been used since the 1970s in sunscreen, so we would have found out by now if it caused harm,” says Henry W Lim, senior vice president of academic affairs and former chair of dermatology at Henry Ford Health. Lim says that some groups will use testing methods and safety thresholds in studies that differ from those required for product approval in the United States. “A lot of the concerns come from animal studies using high doses, but those results don’t automatically translate to humans,” says Lim, who is also the president of the International League of Dermatological Societies and a past president of the American Academy of Dermatology. Dermatologists say sunscreen is important for protecting skin from melanoma, at any age. Credit: Getty Images What do health experts and science say?\n\nHealth professionals warn that anti-sunscreen messaging can be harmful for the public because skin cancer remains one of the most common types of cancer, according to the American Cancer Society. Experts say sunscreen is one of the most effective tools for prevention. Adam Friedman, a professor and chair of dermatology at George Washington University, says scepticism of sunscreen is nothing new. Concerns about chemical ingredients and mistrust in federal oversight resurface every few years, often fuelled by social media and wellness trends. But he says the science has remained consistent. “Ultraviolet radiation is a known carcinogen; there is no debate about that,” Friedman says. “We’ve had decades of data showing that sunscreen plays a critical role in reducing skin cancer risk.” Loading Studies have shown that regular sunscreen use significantly reduces the risk of skin cancer. A randomised controlled trial in Australia, known as the Nambour Skin Cancer Prevention Trial, followed more than 1,600 participants for about 10 years. Those who used sunscreen daily had a lower incidence of melanoma compared with those who used it occasionally.\n\nAnother prospective cohort study of more than 143,000 Norwegian women found that using an SPF 15 or higher sunscreen was associated with a 33 per cent lower risk of melanoma, compared with people using less than an SPF 15 or none at all. The American Academy of Dermatology recommends broad-spectrum sunscreen with an SPF of 30 or higher daily, even on cloudy days. Mineral sunscreens containing zinc oxide or titanium dioxide are considered safe by dermatologists. Veena Vanchinathan, a board-certified dermatologist in California and a member of the American Academy of Dermatology, says the hesitation regarding sunscreen use in wellness spaces is not supported by current scientific evidence. She explained that just because a sunscreen ingredient is absorbed into the body doesn’t mean it is harmful. “We see small amounts of absorption from many everyday products without any proven risk,” Vanchinathan says. “Our skin is designed to function as a barrier, not a sponge.” Her bigger concern is that people are skipping sunscreen altogether or using ineffective unproven alternatives like coconut oil or beef tallow. This could lead to more preventable sun damage, especially among younger people who are influenced by wellness content online.\n\nIn the US, the Food and Drug Administration regulates sunscreen, but standards have not kept up. The last major sunscreen monograph proposal came in 1999. This document serves as the FDA’s official guideline for which ingredients can be used in over-the-counter sunscreens. Although the agency has proposed updates in recent years, delays have left many newer active ingredients – which are already used in Europe and Asia – unavailable in the U.S. This regulatory delay has drawn criticism from dermatologists and public health experts who say the U.S. is falling behind global standards and giving consumers fewer safe options. Some people, frustrated by the lack of innovation, are turning to imported products or homemade solutions, which Friedman strongly discourages. “Would you make Tylenol or Advil in your bathtub?” Friedman said. “There’s no way to replicate the safety, testing and effectiveness of a professionally formulated sunscreen.” Other countries often approve sunscreen filters faster by following a different regulatory model that emphasises post-market surveillance and international data. The European Commission evaluates sunscreen ingredients under a cosmetics framework that allows newer filters to reach the market more quickly.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/first-home-buyers-outbid-investor-for-1-73-million-parkville-home-20250808-p5mljj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First home buyers outbid investor for $1.73 million Parkville home",
        "publish_date": "Mon, 11 Aug 2025 12:03:35 +1000",
        "category": "finance",
        "authors": [
            "Abbir Dib"
        ],
        "text": "A young first-home-buyer couple outbid an investor for the keys to a double-fronted Victorian home in Parkville, paying $1.73 million at Saturday’s auction.\n\nThe four-bedroom, one-bathroom property at 62 Morrah Street was listed with a price guide of between $1.6 million to $1.7 million. The reserve was set at $1.7 million.\n\nThe auction attracted a crowd of about 70 people, Nelson Alexander Carlton selling agent Robert Enes said, with bidding kicking off at $1.6 million.\n\n“The winners were young home buyers from Richmond,” Enes said. “It was a first home for [the couple], they were looking to do a renovation and make it their own.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/all-on-the-line-who-will-score-the-double-chance-and-who-will-miss-finals-20250811-p5mlwx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "All on the line: Who will score the double chance and who will miss finals?",
        "publish_date": "Mon, 11 Aug 2025 12:03:06 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Crow call: Skipper Jordan Dawson is central to Adelaide’s premiership hopes. Credit: AFL Photos Geelong What we say: As we have said for weeks, the Cats have the softest run home, and they are cashing in – even resting skipper Patrick Dangerfield. The Magpies’ woes have allowed them to jump into second spot (on percentage), and the double chance is surely now within keeping. The Swans loomed as their only challenge in the final month, so Sunday’s clash will be a good hitout for Chris Scott and his men. Best case: First. Worst case: Fourth. Refreshed: Patrick Dangerfield was afforded a rest against Essendon. Credit: Getty Images\n\nCollingwood What we say: This has been some fall from grace for a team that last month was 10 points clear on top of the ladder. The Magpies have since dropped four of their past five games, and appear a shell of the fluent, ball-moving side we had become accustomed to. The Magpies looked old and slow against the Hawks, and appeared too heavily reliant on Nick Daicos for creativity. The absence again of a concussed Jeremy Howe weakens a fragile defence. Now come the rampaging Crows. Surely, the Magpies will at least beat the Demons in round 24 … or so we think. Best case: First. Worst case: Sixth. Main man: The Magpies appear overly reliant on Nick Daicos for their ball movement. Credit: AFL Photos via Getty Images Fremantle\n\nWhat we say: While the Crows have won the plaudits, the Dockers are just as hot. They have won five on the bounce, and 11 of their past 12 games, their only loss by 11 points to Sydney. They are playing a more attacking game, and the results are showing. Now comes arguably the toughest fortnight of the prospective finalists. Win both and a top-two berth could be within reach. We’ll back them in against the Lions, but reserve our thoughts when it comes to the Western Bulldogs. Best case: First. Worst case: Sixth. On a tear: Andrew Brayshaw and the Dockers are in fine form. Credit: Getty Images Brisbane Lions\n\nWhat we say: The Lions aren’t the dominant force many thought they would be, and may have now let slip the double chance – and a true shot at their premiership defence. Wow. The loss of Lachie Neale for the remainder of the home-and-away season has hurt. The Swans troubled the Lions by going by hand as often as possible from defence on Saturday – a tactic others, surely, will follow. That’s two losses in three weeks, with the Dockers to come in Perth. Lose that, and the double chance could be all but a memory. Huge week ahead. Best case: Third. Worst case: Eighth. Hobbled: Lachie Neale won’t play again until the finals. Credit: via Getty Images Gold Coast What we say: It’s always felt a touch odd to believe the Suns could earn the double chance, because we know their finals history – or lack thereof – all too well. But with an extra game up their sleeve (the rescheduled clash against Essendon), the double chance is within reach. They should take care of the Giants this week, while the Power, at home, are still a major challenge. We’ll back the Suns in to win both, leaving the Bombers clash to ultimately determine their fate. Best case: Second. Worst case: Ninth.\n\nWithin reach: Ben King and the Gold Coast Suns are on the cusp of a maiden finals run. Credit: AFL Photos Hawthorn What we say: Hokball is back, and the Hawks deserve praise. We were worried about their finals hopes, even last month tipping they would miss the top eight. But a strong performance on the road against the Crows, and a crushing win over Collingwood (we changed our projection last week and tipped the Hawks), have them all but certain finalists. They should take care of business against the Demons, leaving the trip north on the final Sunday of the home-and-away season to determine their top-four hopes. Best case: Fourth. Worst case: Ninth. Reading the room: Jack Ginnivan knows how to play the pantomime villain in Adelaide. Credit: Fox Footy\n\nGWS What we say: This is a tough one. After their shocker against the Bulldogs, our top-eight projections had the Giants missing September on percentage. That was dependent on them losing to the Suns next weekend. However, if they can flip that script and win, and then take care of the Saints, they should be in. A top-four finish, though, appears a step too far. Best case: Fifth. Worst case: Ninth. Hanging on: The Giants are clinging to a finals berth. Credit: via Getty Images Western Bulldogs\n\nWhat we say: The Dogs got out of jail against the Demons to remain in the finals hunt. Had they lost, their season would have been all but over. However, Hawthorn’s win over the Magpies hasn’t helped the Dogs’ cause, because they are running out of teams they can replace in the top eight. They will knock over the Eagles next Sunday. Then comes a season-defining clash against the Dockers. Best case: Sixth. Worst case: Ninth. On the edge: Marcus Bontempelli and his Bulldogs may miss the finals. Credit: Getty Images How we think it will play out",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/magic-number-how-stretch-hopes-to-attract-people-to-his-unicorn-town-20250730-p5mj1o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Magic number’: How Stretch hopes to attract people to his ‘unicorn’ town",
        "publish_date": "Mon, 11 Aug 2025 11:59:22 +1000",
        "category": "finance",
        "authors": [
            "Millie Muroi"
        ],
        "text": "Geelong mayor Stretch Kontelj is eager for the region’s population to hit the “magic number” of 400,000.\n\nThe Victorian city is one of several places that the country’s oldest bank, Westpac, argues should be among 10 in regional Australia identified by the government as ripe for investment and growth.\n\nGeelong mayor Stretch Kontelj wants to welcome more residents to the city.\n\nRegional centres, including Cairns, Wagga Wagga and Bunbury-Busselton, are also on the list of places that could collectively absorb the target of an additional 1 million people by 2032.\n\n“We have an opportunity for regional Australia to reclaim its place as the driver of national prosperity and productivity,” the bank’s submission to this month’s economic roundtable reads. “The population of our capital cities is growing twice as fast as regional Australia, and they are struggling under the demands.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-s-war-on-the-world-is-starting-to-unleash-pain-20250811-p5mluk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s war on the world is starting to unleash pain",
        "publish_date": "Mon, 11 Aug 2025 11:55:00 +1000",
        "category": "finance",
        "authors": [
            "Ambrose Evans-Pritchard"
        ],
        "text": "Mary Daly, the San Francisco Fed chief, hinted strongly on Wednesday that there could be three cuts this northern autumn. “We know that once the labour market stumbles, it tends to fall quickly and hard,” she said. For now, it is a story of “low hiring”. It becomes dangerous if companies start firing as well. That can turn into a self-feeding downward spiral of mass layoffs that slips control, forcing the Fed to slash rates to the bone. US jobs growth ground to a screeching halt in May and June, just as labour economists had predicted. Credit: Bloomberg The US property market is already crying out for relief. Mortgage applications have collapsed to the levels of the mid-1990s. The Freddie Mac house price index has fallen for the past five months in a row. Property owners in south-west Florida are slashing prices at the fastest rate since the subprime bust in 2007-08. Wall Street has shrugged off the slowdown, but that is because traders are betting on the “Fed put” – Vickie Chang, from Goldman Sachs, says markets have priced in both a “negative US growth shock” and a “doveish policy shock” at the same time.\n\nThe two more or less offset each other. In other words, the Fed will ensure that the Schiller price-to-earnings ratio on Wall Street remains near the peak of the dotcom bubble at over 38, and junk bond spreads remain as compressed as they were at the peak of the Lehman credit bubble. Uncle Jerome will keep investors fat and happy. Loading The Fed will undoubtedly cut rates, but it is an invidious position. The next shocker may well be the core inflation figures out next week. The delayed effects of the tariffs are about to feed through with malicious and unstoppable force. Welcome to 1970s Nixonian stagflation. Donald Trump will doubtless declare that the index has been manipulated by Marxist fifth columnists. Good luck with that. The US is unable to substitute 90 per cent of its current imports with local production. Trump’s trade taxes will be paid by US consumers via higher prices, and by US companies with plants abroad or reliance on foreign inputs via lower profit margins. Caterpillar has already warned that the Trump levy will cost it up to $US1.5 billion ($2.3 billion) a year. Brewer Molson Coors expects earnings to fall by 7 to 10 per cent because Trump’s 50 per cent tariffs on aluminium have pushed metal can costs through the roof.\n\nWe know from early warning signals – both the ISM’s service price paid index and S&P Global’s composite PMI output prices – that price impulse is filtering through with the usual multi-month lag, and that headline inflation will approach an annualised rate near 5 per cent over the next three months. Durable goods prices are already rising at the fastest rate since the early 1990s. The Yale Budget Lab expects food and apparel prices to rise by almost 40 per cent. The Fed will undoubtedly cut rates, but it is an invidious position. Britain and Europe are in a different position. They are absorbing the brunt of China’s galactic overcapacity, and absorbing some of its deflation too as a wave of cheap Chinese exports are diverted from the US and into their markets. They are not committing further economic self-harm by raising inflationary trade taxes themselves. I can understand the reasons for the hawkish tone of the Bank of England’s rate cut on Thursday, but lingering worries of UK inflation may soon be washed away by larger global forces. “The Bank will be compelled to cut faster in 2026,” said Mathieu Savary, of BCA Research, who thinks that deflation is the greater danger stalking Europe.\n\nThe eurozone’s rebound has stalled. The growth spurt earlier this year was an illusion of “tariff front-running”. German industrial output fell 1.9 per cent in June. It is down 4 per cent from a year ago, and 10 per cent below its pre-pandemic level. “It’s a cold shower for our long-held view of a cyclical rebound in German industry,” said Carsten Brzeski, of ING. Brzeski said Germany’s Mittelstand family firms cannot blunt the impact of the tariffs by relocating production to the US. These firms have always formed the backbone of the Wirtschaftswunder (or economic miracle). They are being hammered on a second front by China, which has moved up the technology ladder and is now competing toe to toe in third markets, with the help of a suppressed exchange rate.\n\nKeynesian rearmament and a blitz of infrastructure spending will eventually lift Germany out of the doldrums. The Merz government is swinging from a primary budget surplus of 2 per cent of GDP to a primary deficit of 2 per cent by 2028. That is a big secular shift in macroeconomic policy, but it remains far away and, in the meantime, France and Italy face fiscal retrenchment. The eurozone has seen a long series of false dawns over recent years. It risks happening again if the European Central Bank continues to sit on its hands as the Wicksellian “natural” rate of interest plummets. Trump’s tariffs on Europe will now ratchet up to 15 per cent. The trade shock amounts to 25 per cent this year when you add in euro appreciation against the dollar, or a de facto 60 per cent shock on metal products. Trump has yet to drop his full pharma bomb. He is talking of 100 per cent tariffs on semiconductors. The market narrative that the worst is over and that stability will come will surely become a collectors’ item for historians and students of the capitalist psyche. Nothing is ever stable with Trump.\n\nLoading He has just inflicted the biggest trade shock in peacetime since the origins of the modern economy in the 17th Century. He has killed Pax Americana stone dead, destroyed NATO credibility, carpet-bombed the West and smashed the rules-based order to smithereens on every level. Yet asset markets remain insouciantly priced for perfection. What can possibly go wrong? Telegraph, London",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/11-on-11-did-we-just-glimpse-warren-ryan-s-rugby-league-future-20250810-p5mlq5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "11-on-11: Did we just glimpse rugby league’s future?",
        "publish_date": "Mon, 11 Aug 2025 11:50:55 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "“It was Warren Ryan’s 11 v 11, so we got to see 10 minutes of that and see how it went.”\n\nFor anyone without a season on the line on Saturday night, or a player sat in the Suncorp Stadium naughty corner, 11 Roosters against 11 Dolphins was a lot of fun.\n\nWith Spencer Leniu’s eyes rolling like Gold Coast pokies and Gerard Sutton just as enthusiastic about using the sin bin, Trent Robinson watched Ryan’s ideal game of rugby league in real time and made sure to mention it afterwards as well.\n\nRyan might just be the single most influential coach of the past 40 years. Not only because of his introduction of the umbrella defence in the 1980s, but in sowing the seeds of his rugby league philosophy among figures including Phil Gould, the Johns brothers and premiership-winning coaches Chris Anderson, Steve Folkes, Michael Hagan and Shane Flanagan.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/melbourne-star-observation-wheel-s-future-finally-revealed-20250811-p5mlwc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne Star to turn again after four-year closure – but keen riders will have to wait",
        "publish_date": "Mon, 11 Aug 2025 11:47:36 +1000",
        "category": "finance",
        "authors": [
            "Rachael Dexter"
        ],
        "text": "The long-dormant Melbourne Star Observation Wheel in Docklands will officially reopen within the next 16 months, following an $11 million investment deal with new Swiss and American backers.\n\nThe new ownership group has committed to having the wheel turning again by the end of 2026.\n\nJonathon Codman, director of precincts The District Docklands, stands with new Melbourne Star managers Jane and Jay Jones of Skyline Attractions and Lord Mayor of Melbourne Nick Reece on Monday morning. Credit: Simon Schluter\n\nLord Mayor Nick Reece hailed the announcement as a “wheelie, wheelie great day for Melbourne” at a press conference on Monday morning beneath the wheel. He described the attraction’s return as a major symbol of the waterfront suburb’s revival, saying that “Docklands is going from strength to strength at the moment”.\n\n“We recently saw Coles announce they’re moving their headquarters here with 5000 employees. Sonic Healthcare is opening their Melbourne centre next door, bringing close to 1000 employees into Docklands,” Reece said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/traveller/travel-news/cold-water-plunge-luxury-looks-different-at-this-tassie-hotel-20250724-p5mhix.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cold-water plunge? Luxury looks different at this Tassie hotel",
        "publish_date": "Mon, 11 Aug 2025 11:47:35 +1000",
        "category": "finance",
        "authors": [
            "Julietta Jameson"
        ],
        "text": "In the world of hospitality, the “signature experience” is on the rise, the name given to an activity that only one hotel can offer, such as a tour of its art collection. Or it could be VIP access to an attraction or event that the hotel has negotiated with local operators.\n\nRather than the one-off feat pulled off by a savvy concierge or front desk, these experiences are tailored to the interests of an establishment’s customers.\n\nThe Tasman hotel three excursions exclusive to hotel guests.\n\nThey come as even economy hotels offer accoutrements that used to only be found in the upscale as the luxury segment continues to grow faster than any other hotel class, creating fierce competition.\n\nAnd the meaning of luxury is also shifting, according to a report by consultancy firm McKinsey and Company.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/five-minute-auction-ends-family-s-three-year-search-for-perfect-property-20250808-p5mljl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Five-minute auction ends family’s three-year search for perfect property",
        "publish_date": "Mon, 11 Aug 2025 11:41:08 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A Gumdale estate with just six gum trees – a unicorn in a suburb where they’re fiercely protected – has sold for $4.025 million in a five-minute auction, ending a Camp Hill family’s three-year search for the perfect property.\n\nIn front of more than 150 onlookers, the family lobbed the opening bid of $3 million for the four-bedroom lowset house on an 18,922-square-metre parcel 15 minutes from the CBD.\n\nFrom there, the auction of 236 Grassdale Road was over almost as soon as it began, with $100,000 bids flying in rapid-fire bursts.\n\n“It was the second-fastest auction of my career,” said selling agent Shane Hicks of Place Estate Agents Camp Hill.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-wa-police-investigating-three-shootings-over-weekend-wa-prisoners-caught-eating-guinea-pigs-20250811-p5mlwd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: WA Police investigating three shootings over weekend; WA prisoners caught eating guinea pigs",
        "publish_date": "Mon, 11 Aug 2025 11:34:02 +1000",
        "category": "finance",
        "authors": [],
        "text": "Nearly 10,000 submissions have been received by a review looking into changing some of WA’s public holiday dates, and potentially added two more to the calendar.\n\nPreliminary analysis of the submissions, accrued during a four-week public consultation period, indicates strong support for changes to the public holiday schedule to place WA more in line with other states.\n\nThe proposed reforms include moving existing public holidays, such as Labour Day and the King’s Birthday, to match other states and territories. It also suggests moving WA Day from winter, to a warmer month like November, and introducing one to two new public holidays to give those in the west a similar number of public holidays as other states (currently we have 11).\n\nThe Chamber of Commerce and Industry WA calculated that two extra public holidays would result in a $115 million disaster for local businesses. The Tourism Council of WA has also pushed back on the idea over concerns additional costs would be put onto customers.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/nsw/why-a-sydney-council-banished-a-troll-bar-from-under-the-harbour-bridge-20250731-p5mjcq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why a Sydney council banished a ‘troll bar’ from under the Harbour Bridge",
        "publish_date": "Mon, 11 Aug 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "The Norwegian folklore of trolls inspired plans for a new live music bar under the archways of the Sydney Harbour Bridge – but the prospect of monsters lurking under the heritage structure has proven a bridge too far for historians, community groups and a local council.\n\nA year-long proposal to turn a vacant shopfront under the northern end of the coathanger has been delivered a not-so fairytale ending after a planning application for the venue was officially rejected by North Sydney Council.\n\nPeter Lanigan wanted to open a small live music bar in a shopfront under the Sydney Harbour Bridge at Milsons Point (in the background here), but the plan has been rejected by North Sydney Council. Credit: Max Mason-Hubers\n\nThe saga began when owner and publican Peter Lanigan lodged development plans with the council to turn the former Milsons Point newsagency in Kirribilli’s main shopping strip into a “sophisticated small bar” named The Troll, inspired by the 19th-century Scandinavian fairytale.\n\nTrolls, often depicted as monstrous beings living under bridges, have for more than 150 years acted as a cautionary tale for children to be careful around dangerous places.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/fewer-takeaways-dearer-eggs-how-inflation-hits-your-hip-pocket-20250807-p5ml9t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fewer takeaways, dearer eggs: How inflation hits your hip pocket",
        "publish_date": "Mon, 11 Aug 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Matt Wade"
        ],
        "text": "Inflation is the lowest in years and interest rates are coming down, but that hasn’t stopped us fretting about finances. Polls show the cost of living is still our No.1 worry.\n\nThe latest Resolve Political Monitor, conducted for this masthead, found 41 per cent of voters believe “keeping the cost of living low” should be the government’s top priority, with “housing and rental accessibility” a distant second on 10 per cent.\n\n“People have experienced climbing bills for several years, and there’s been a cumulative effect on financial comfort and spending from that,” says Resolve director Jim Reed, who conducts the survey.\n\n“Prices for day-to-day items haven’t become any cheaper, they’ve just stabilised, and many people are still feeling the pinch. Income needs to catch up for that to change.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/brisbane-eating-out/landing-brings-precision-baked-pastries-to-seaside-scarborough-20250806-p5mkux.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Landing brings precision-baked pastries to seaside Scarborough",
        "publish_date": "Mon, 11 Aug 2025 11:25:10 +1000",
        "category": "finance",
        "authors": [
            "Matt Shea"
        ],
        "text": "Advertisement\n\nEating outFood Landing brings precision-baked pastries to seaside Scarborough In a light-filled space from an in-demand design team, it’s serving almond croissants, pain au chocolat and gochujang scrolls, along with sourdough, focaccia and fresh-made sangers. Matt Shea August 11, 2025 Save Log in , register or subscribe to save articles for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nCommunity. Connection. Collaboration. When cafe owners start talking in these kinds of terms, it’s easy for your eyes to glaze over. You’ve heard it before, a hundred times. You’ve watched those operators come and go, a hundred times. And often not through any particular fault of their own. Breakfast and lunch venues – let’s call them, broadly speaking – are hard. Tom Cooney at Landing Bakery in Scarborough. Markus Ravik But Tom Cooney’s relative youth is deceptive.\n\nAdvertisement\n\nHe’s walked the talk longer than most, and has a calculated instinct for what works and what doesn’t. His connections and collaborations date all the way back to Cup Roastery in Woolloongabba, and then run through all sorts of other venues, from the local outpost for Coffee Supreme to Hai Hai Ramen in Paddington to Anytime Coffee in the CBD. More recently, he’s best known for Riser, the picture-perfect bakery and cafe in bucolic Toowong that slays every weekend. So, what’s he doing all the way out here, in Scarborough? It’s to open Landing Bakery with long-time business partner (since Anytime, recently sold) Jack Wakefield. Related Article Perspective Would SEQ beach clubs be such a bad thing? “Jack was born here and he knows this area really well, and he said to me, ‘We really need to do a bakery out here,’ and I said, ‘I don’t know about that,’” Cooney says, laughing.\n\nAdvertisement\n\n“And then he said it another 20 times over the next three months. We came out and I sat with him at this very spot, looking out at the water across the park, and I thought, ‘We have to do it.’” Cooney is still working through how he describes the difference between what comes from the oven at Riser and Landing. Because it is different. Maybe the former is more rustic while the latter cleaner and more classic, he says. The Five Mile Radius and Matthew Reynolds-designed space references the area’s famous red cliffs. Markus Ravik “When we make a croissant, say, at Riser, we’re trying to be more complex, deeply flavoured, and have some resistance and some chew to them. They’re an experience on their own. “Here, it’s more classic and cloudy and as crispy as possible. That was our aim.”\n\nAdvertisement\n\nIt makes sense. If you’re visiting Riser it’s often a grab-and-go situation, given its popularity; the croissants and the sandwiches and the sausage rolls and whatever else feel like a unique expression of that venue, almost so you can take a little bit of it with you. A selection of pastries at Landing Bakery. Markus Ravik Landing feels more intended to eat in, or at the most maybe take it over the road to the park and enjoy under its strip of towering Norfolk pines. That’s if you’re visiting, of course, but this is a venue designed very much for locals first. And as Wakefield suspected, it’s well timed to appeal to the growing number of city folk who are choosing to live out here, 40 minutes from the CBD. Landing’s initial selection of pastries includes almond croissants, pain au chocolat, morning buns and gochujang scrolls. Markus Ravik\n\nAdvertisement\n\nWhen this masthead visits Landing during a soft service the Thursday before the bakery opens proper, they’re already buzzing around, filling the light and bright space designed by Five Mile Radius and Matthew Reynolds, with its handsome pale timber communal tables, and pigmented sand-cast and concrete furnishings (intended to reflect the red cliffs of the area), going large on baker Dan Smyth’s almond croissants, pain au chocolat, morning buns and gochujang scrolls. Later in the day a clutch of sandwiches – a chicken salad, a Reuben (prepared with house-made pastrami), roasted vegetable and hummus, and a porchetta roll – come on-stream. Like Riser, there’s a range of bread (plain or seeded sourdough, a country loaf and a focaccia) and an abbreviated selection of pantry staples on a shelf at the front door – jarred pickles, beetroot ketchup, smoked ketchup, tomato relish and bags of Fox coffee, which has also produced Landing’s house coffee blend. “The idea is to bring something interesting here, when it’s building and wanting these kind of things,” Cooney says. “You fill a gap. It’s a simple concept, really.\n\nAdvertisement\n\n“It can be risky but we thought, ‘No, this is a good time.’” Open Wed-Sun 6.30am-2pm 71 Landsborough Avenue, Scarborough instagram.com/landingbakery\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-expert-says-the-trump-putin-summit-is-an-alarming-development/aag4uwric",
        "title": "INTERVIEW: Expert says the Trump-Putin summit is an 'alarming development'",
        "publish_date": "Sun, 10 Aug 2025 23:28:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/this-preventable-disease-has-killed-37-babies-since-2016-heres-what-you-need-to-know/htw6acxw1",
        "title": "This preventable disease has killed 37 babies since 2016. Here's what you need to know",
        "publish_date": "Sun, 10 Aug 2025 05:58:27 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Infant deaths linked to a sexually transmitted infection in Australia have prompted health authorities to sound the alarm.\n\n\n\n\n\nChief medical officer, Michael Kidd, declared syphilis a Communicable Disease Incident of National Significance (CDINS) on Thursday, adding the declaration \"will bring together national efforts to coordinate an enhanced national response\".\n\n\n\n\n\nCDNIS refers to a disease incident that necessitates the application of national policies, interventions, public communications, or the deployment of Commonwealth resources to support the affected areas.\n\n\n\n\n\n\"I am very concerned about the ongoing impact of syphilis on public health,\" Kidd said.\n\n\n\n\n\n\"Infectious syphilis cases have been on the rise across Australia, resulting in tragic cases of congenital syphilis and infant deaths, which might have been prevented.\"\n\n\n\nBetween 2016 and 2024, 99 cases of congenital syphilis were reported in Australia, leading to the deaths of 33 infants. More than half were Aboriginal and Torres Strait Islanders.\n\n\n\n\n\nSo far in 2025, Australia has recorded 3,546 cases of infectious syphilis and 11 cases of congenital syphilis, which have led to the deaths of four infants.\n\n\n\n\n\nHere is everything you need to know about syphilis.\n\n\n\nWhat is syphilis?\n\nSyphilis is a sexually transmitted infection that can lead to serious health problems if it is not treated.\n\n\n\n\n\nThe infection usually happens in four stages:\n\n\n\nPrimary syphilis\n\nSecondary syphilis\n\nLatent syphilis\n\nTertiary syphilis\n\nOver the past 10 years, syphilis case reports in Australia have risen significantly, according to Healthdirect, Australia's virtual public health information service.\n\n\n\n\n\nThe Department of Health has reported that since reporting started in 2004, infectious syphilis notifications reached the highest levels in 2023, \"affecting people in almost all parts of Australia\".\n\n\n\nREAD MORE Winter warning: Meningococcal cases rising as experts urge vigilance\n\nWhat are the symptoms?\n\nMany people with syphilis do not notice any symptoms, and the World Health Organisation (WHO) says it can also go unnoticed by healthcare providers.\n\n\n\n\n\n\"Similar to other sexually transmissible infections, syphilis often shows no symptoms, and can go undetected and untreated,\" Kidd said.\n\n\n\nDepending on which stage of the disease the patient is experiencing, symptoms vary.\n\n\n\n\n\nThose in the primary stage can notice a painless sore or sores in or on their mouth, anus, penis, vagina, or cervix.\n\n\n\n\n\nIn the second stage, symptoms include a red rash on the palms of the hands, soles of the feet, chest, or back, as well as fever, hair loss, headaches, and tiredness, according to Healthdirect.\n\n\n\n\n\nLatent syphilis may have no obvious symptoms, and it can stay hidden for life or develop into tertiary syphilis, when the bacteria can damage any part of the body, causing serious disease.\n\n\n\n\n\nWHO also says babies born with the infection can experience:\n\n\n\nRashes\n\nInflammation in the organs\n\nAnaemia\n\nBone and joint problems\n\nNeurological conditions\n\nDevelopmental delays\n\nSeizures\n\nIs it deadly?\n\nIf left untreated, syphilis can lead to serious health problems, especially for pregnant people and their babies, Kidd said.\n\n\n\n\n\nAccording to WHO, syphilis can increase the risk of HIV infection and cause severe diseases, while tertiary syphilis \"can cause death\".\n\n\n\nHow is syphilis transmitted?\n\nAs a sexually transmitted infection, syphilis can be transmitted during unprotected skin-to-skin contact during vaginal, anal or oral sex.\n\n\n\n\n\nSyphilis is highly contagious during the primary and secondary stages; however, even in the early latent phase, when no sores are present, infected individuals can still transmit the disease to others.\n\n\n\n\n\nThe disease can also spread to babies during pregnancy, leading to serious health problems.\n\n\n\n\n\nIt could also occasionally be transmitted by blood contamination.\n\n\n\nIs there any cure for syphilis?\n\nThe good news is that the disease is curable.\n\n\n\n\n\n\"Syphilis is preventable, and is easy to treat if found early. Testing and treatment are simple and accessible. Congenital syphilis can be completely prevented through early detection and treatment of syphilis in pregnant people and their partners,\" Kidd said.\n\n\n\n\n\nWhile there is no effective vaccine for syphilis, Healthdirect suggests syphilis can also be prevented by practising safe sex.\n\n\n\nWho is at more risk?\n\nAboriginal and Torres Strait Islander people remain disproportionately impacted, with infectious syphilis notification rates seven times higher than those of non-Indigenous Australians overall in 2024.\n\n\n\n\n\nAccording to Healthdirect, other population groups that are more at risk include males who have sex with males, females of childbearing age and people living in outback areas or regional and remote Australia.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-an-interest-rate-cut-could-impact-you/yw8yz2gn0",
        "title": "'Lifting the gloom' or 'double-edge sword': How an interest rate shift could impact you",
        "publish_date": "Sun, 10 Aug 2025 01:16:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Reserve Bank of Australia (RBA) is widely expected to cut the cash rate when it meets on 12 August.\n\n\n\n\n\nEconomists are predicting a drop of 0.25 percentage points from 3.85 to 3.6 per cent., following the RBA’s surprise decision in July to hold rates steady despite easing inflation.\n\n\n\n\n\nIf announced, a cut could help lift consumer sentiment amid global uncertainty, but some experts are warning that the benefits are a 'double-edged sword'.\n\n\n\nHow likely is a rate cut?\n\nEconomists say two factors are likely to influence the RBA's decision: easing inflation and growing unemployment.\n\n\n\nRising unemployment levels could be a sign that the RBA will cut interest rates on Tuesday Source: AAP / Joel Carrett The Australian Bureau of Statistic's (ABS) June quarter Consumer Price Index figures showed annual inflation easing from 2.4 to 2.1 per cent.\n\n\n\n\n\nJune labour figures from the ABS also show unemployment has risen to its highest level since November 2021 at 4.2 per cent.\n\n\n\n\n\n\"When you put rising unemployment, overlay that with disinflationary trends, and then you look at the GDP report which painted a really tepid picture of growth for the Australian economy , it really does warrant further interest rate cuts,\" IG market analyst Tony Sycamore said.\n\n\n\n\n\nHowever, Sally Tindall from financial comparison site Canstar says that while a cut is \"highly likely\", it’s important to remember that \"nothing is guaranteed until the RBA actually does make that decision at 2.30pm on Tuesday\".\n\n\n\nWho benefits from an interest rate cut?\n\nTindall said mortgage holders can expect to see the biggest benefits.\n\n\n\n\n\n\"The winners are mortgage customers, particularly those who use the market to their advantage by going and haggling with their bank or refinancing,\" she said.\n\n\n\n\n\nPeople thinking of buying a home may also have more borrowing power. Households that earn $150,000 before tax may be able to access more than $17,000 extra.\n\n\n\n\n\nTindall urged caution because rate cuts can sometimes be a \"double-edged sword\" as it can lead to an increase in house prices.\n\n\n\nWhy could an interest rate cut mean higher house prices?\n\nMore buyers on the market squeezes an already short supply of houses.\n\n\n\n\n\n\"It brings buyers to the market, buyers have deeper pockets and they can spend more on a home,\" Domain’s Nicola Powell says.\n\n\n\n\n\nA report from the Commonwealth Bank of Australia (CBA) found the RBA’s February reduction in the cash rate saw housing prices increase by 3.1 per cent.\n\n\n\n\n\nIt forecasts that RBA rate cuts in August and November would lead to house prices rising by 6 per cent in 2025 and 4 per cent in 2026.\n\n\n\nWhere will housing prices be affected?\n\nCapital cities tend to see bigger shifts, with Sydney and Melbourne more sensitive to interest rates changes.\n\n\n\n\n\nThe CBA also forecasts that an interest rate cut could lead to house price increases of 8 per cent in Brisbane, 7 per cent in Perth and 6 per cent in Adelaide.\n\n\n\nSource: SBS News\n\n\n\nBut Canstar’s Tindall says this is not a reason why the RBA shouldn’t reduce the cash rate.\n\n\n\n\n\n\"What will help cool the situation is increased stock, and I think that still needs further intervention from the government,\" she said.\n\n\n\nWhat about people who don't own a home?\n\nTindall says renters may also be hit with higher costs.\n\n\n\n\n\n\"Rents are rising at four-and-a-half per cent every year, which is a difficult hurdle for many households to clear, and unfortunately it's still going to be tough times ahead for renters.\"\n\n\n\nAn RBA interest rate cut could make renting less affordable Source: AAP / Lukas Coch Sycamore from IG Markets says a common knock-on effect of higher house prices is that landlords may be encouraged to put up rent.\n\n\n\n\n\n\"And that’s not really something we need at this point in time.\"\n\n\n\nSo is an interest rate cut a good or a bad thing?\n\nSycamore says an interest rate cut would be a symbol of growing optimism in the Australian market.\n\n\n\n\n\n\"There is real benefit in terms of just lifting the gloom which has really been lingering over the Australian economy since COVID, because that's when the cost of living crisis really came to the forefront,\" he said.\n\n\n\n\n\nTindall says it is a good time to re-examine your finances to make sure you’re getting the best deal for your circumstances, especially since interest rate cuts are not always passed on by banks.\n\n\n\n\n\n“What ultimately matters is the rate you’re currently on.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-jolly-duong-on-pursuing-the-dream-of-being-a-paralympian/vvqoshg17",
        "title": "INTERVIEW: Jolly Duong on pursuing the dream of being a Paralympian",
        "publish_date": "Sat, 9 Aug 2025 22:00:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nThe second-generation Vietnamese-Australian has been adjusting to a new set of challenges, 18 months after a bike accident left him with a spinal cord injury.\n\n\n\n\n\nParasports provided an outlet to make the transition - and now he is among 346 chosen to advance to the next stage of a national talent program to find and support the athletes who will represent Australia at the Brisbane Olympics and Paralympics in 2032.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australias-youngest-federal-politician-charlotte-walker-interview/8l32bum9s",
        "title": "Australia's youngest federal politician: Charlotte Walker Interview",
        "publish_date": "Sat, 9 Aug 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/music/get-20-percent-off-a-musical-awakening-with-the-australian-chamber-orchestra-20250811-p5mlym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Get 20% off A Musical Awakening with the Australian Chamber Orchestra*",
        "publish_date": "Mon, 11 Aug 2025 12:20:20 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "As a subscriber, you can save 20% on tickets to A Musical Awakening with the Australian Chamber Orchestra. Directed by Principal Cello Timo-Veikko Valve and featuring beloved Australian recorder virtuoso Genevieve Lacey, we invite you to experience an unforgettable concert that promises to nourish your soul and awaken your spirit.\n\nA Musical Awakening Credit: Australian Chamber Orchestra\n\nThis is your moment to pause, disconnect with the outside world and immerse yourself in a sublime musical journey featuring music by Max Richter, Hildegard von Bingen, Beethoven, Vivaldi and more.\n\nOne of the most influential composers of his generation, Max is an international musical phenomenon, renowned for transporting listeners through his evocative solo works, collaborations and numerous scores for film and television. The ACO will perform his captivating work for strings, On the Nature of Daylight, alongside Beethoven’s deeply moving Holy Song of Thanksgiving and visionary hymns of 12th-century abbess Hildegard.\n\nHead to the ACO booking page and use the code AGE2025 on any A-C Reserve adult tickets at checkout up to 24 hours before your selected performance to claim 20% off your ticket.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/the-wellness-influencers-giving-up-sunscreen-and-what-it-could-mean-for-cancer-rates-20250811-p5mlw6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The wellness influencers giving up sunscreen – and what it could mean for cancer rates",
        "publish_date": "Mon, 11 Aug 2025 12:05:29 +1000",
        "category": "lifestyle",
        "authors": [
            "Sabrina Malhi"
        ],
        "text": "Some people are also looking for natural alternatives, and they say skin irritation they have experienced from certain products has caused them to shift from conventional products. As a result, alternatives like homemade creams and mineral-based sunscreens have become more popular. Some people are also choosing to stop using sunscreen entirely. “I am definitely a MAHA mom and voted for Trump so that RFK Jr could get into office,” says Summer Whiteside, 31, an ER nurse from Wildomar, California, in a text message. “After listening to his podcast on Joe Rogan, I knew he was the man for the job.” On Instagram, Whiteside – who doesn’t shy away from the label “crunchy” – posts about things like beef tallow for sunburns and her preference for mineral sunscreen. Whiteside, who says she has concerns about the chemicals in sunscreen, uses long-sleeved rash guards on her kids and sunblock only on their faces. Some wellness figures have claimed that diet changes or building sun exposure gradually can protect against burns, which dermatologists and the scientific community strongly recommend against. Some in the anti-sunscreen movement point to studies suggesting that certain chemicals cause cancer or are absorbed too heavily into the body. But public health experts say there are no human studies that conclusively prove ingredients like oxybenzone act as carcinogens.\n\n“Oxybenzone has been used since the 1970s in sunscreen, so we would have found out by now if it caused harm,” says Henry W Lim, senior vice president of academic affairs and former chair of dermatology at Henry Ford Health. Lim says that some groups will use testing methods and safety thresholds in studies that differ from those required for product approval in the United States. “A lot of the concerns come from animal studies using high doses, but those results don’t automatically translate to humans,” says Lim, who is also the president of the International League of Dermatological Societies and a past president of the American Academy of Dermatology. Dermatologists say sunscreen is important for protecting skin from melanoma, at any age. Credit: Getty Images What do health experts and science say?\n\nHealth professionals warn that anti-sunscreen messaging can be harmful for the public because skin cancer remains one of the most common types of cancer, according to the American Cancer Society. Experts say sunscreen is one of the most effective tools for prevention. Adam Friedman, a professor and chair of dermatology at George Washington University, says scepticism of sunscreen is nothing new. Concerns about chemical ingredients and mistrust in federal oversight resurface every few years, often fuelled by social media and wellness trends. But he says the science has remained consistent. “Ultraviolet radiation is a known carcinogen; there is no debate about that,” Friedman says. “We’ve had decades of data showing that sunscreen plays a critical role in reducing skin cancer risk.” Loading Studies have shown that regular sunscreen use significantly reduces the risk of skin cancer. A randomised controlled trial in Australia, known as the Nambour Skin Cancer Prevention Trial, followed more than 1,600 participants for about 10 years. Those who used sunscreen daily had a lower incidence of melanoma compared with those who used it occasionally.\n\nAnother prospective cohort study of more than 143,000 Norwegian women found that using an SPF 15 or higher sunscreen was associated with a 33 per cent lower risk of melanoma, compared with people using less than an SPF 15 or none at all. The American Academy of Dermatology recommends broad-spectrum sunscreen with an SPF of 30 or higher daily, even on cloudy days. Mineral sunscreens containing zinc oxide or titanium dioxide are considered safe by dermatologists. Veena Vanchinathan, a board-certified dermatologist in California and a member of the American Academy of Dermatology, says the hesitation regarding sunscreen use in wellness spaces is not supported by current scientific evidence. She explained that just because a sunscreen ingredient is absorbed into the body doesn’t mean it is harmful. “We see small amounts of absorption from many everyday products without any proven risk,” Vanchinathan says. “Our skin is designed to function as a barrier, not a sponge.” Her bigger concern is that people are skipping sunscreen altogether or using ineffective unproven alternatives like coconut oil or beef tallow. This could lead to more preventable sun damage, especially among younger people who are influenced by wellness content online.\n\nIn the US, the Food and Drug Administration regulates sunscreen, but standards have not kept up. The last major sunscreen monograph proposal came in 1999. This document serves as the FDA’s official guideline for which ingredients can be used in over-the-counter sunscreens. Although the agency has proposed updates in recent years, delays have left many newer active ingredients – which are already used in Europe and Asia – unavailable in the U.S. This regulatory delay has drawn criticism from dermatologists and public health experts who say the U.S. is falling behind global standards and giving consumers fewer safe options. Some people, frustrated by the lack of innovation, are turning to imported products or homemade solutions, which Friedman strongly discourages. “Would you make Tylenol or Advil in your bathtub?” Friedman said. “There’s no way to replicate the safety, testing and effectiveness of a professionally formulated sunscreen.” Other countries often approve sunscreen filters faster by following a different regulatory model that emphasises post-market surveillance and international data. The European Commission evaluates sunscreen ingredients under a cosmetics framework that allows newer filters to reach the market more quickly.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/first-home-buyers-outbid-investor-for-1-73-million-parkville-home-20250808-p5mljj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First home buyers outbid investor for $1.73 million Parkville home",
        "publish_date": "Mon, 11 Aug 2025 12:03:35 +1000",
        "category": "finance",
        "authors": [
            "Abbir Dib"
        ],
        "text": "A young first-home-buyer couple outbid an investor for the keys to a double-fronted Victorian home in Parkville, paying $1.73 million at Saturday’s auction.\n\nThe four-bedroom, one-bathroom property at 62 Morrah Street was listed with a price guide of between $1.6 million to $1.7 million. The reserve was set at $1.7 million.\n\nThe auction attracted a crowd of about 70 people, Nelson Alexander Carlton selling agent Robert Enes said, with bidding kicking off at $1.6 million.\n\n“The winners were young home buyers from Richmond,” Enes said. “It was a first home for [the couple], they were looking to do a renovation and make it their own.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/all-on-the-line-who-will-score-the-double-chance-and-who-will-miss-finals-20250811-p5mlwx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "All on the line: Who will score the double chance and who will miss finals?",
        "publish_date": "Mon, 11 Aug 2025 12:03:06 +1000",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Crow call: Skipper Jordan Dawson is central to Adelaide’s premiership hopes. Credit: AFL Photos Geelong What we say: As we have said for weeks, the Cats have the softest run home, and they are cashing in – even resting skipper Patrick Dangerfield. The Magpies’ woes have allowed them to jump into second spot (on percentage), and the double chance is surely now within keeping. The Swans loomed as their only challenge in the final month, so Sunday’s clash will be a good hitout for Chris Scott and his men. Best case: First. Worst case: Fourth. Refreshed: Patrick Dangerfield was afforded a rest against Essendon. Credit: Getty Images\n\nCollingwood What we say: This has been some fall from grace for a team that last month was 10 points clear on top of the ladder. The Magpies have since dropped four of their past five games, and appear a shell of the fluent, ball-moving side we had become accustomed to. The Magpies looked old and slow against the Hawks, and appeared too heavily reliant on Nick Daicos for creativity. The absence again of a concussed Jeremy Howe weakens a fragile defence. Now come the rampaging Crows. Surely, the Magpies will at least beat the Demons in round 24 … or so we think. Best case: First. Worst case: Sixth. Main man: The Magpies appear overly reliant on Nick Daicos for their ball movement. Credit: AFL Photos via Getty Images Fremantle\n\nWhat we say: While the Crows have won the plaudits, the Dockers are just as hot. They have won five on the bounce, and 11 of their past 12 games, their only loss by 11 points to Sydney. They are playing a more attacking game, and the results are showing. Now comes arguably the toughest fortnight of the prospective finalists. Win both and a top-two berth could be within reach. We’ll back them in against the Lions, but reserve our thoughts when it comes to the Western Bulldogs. Best case: First. Worst case: Sixth. On a tear: Andrew Brayshaw and the Dockers are in fine form. Credit: Getty Images Brisbane Lions\n\nWhat we say: The Lions aren’t the dominant force many thought they would be, and may have now let slip the double chance – and a true shot at their premiership defence. Wow. The loss of Lachie Neale for the remainder of the home-and-away season has hurt. The Swans troubled the Lions by going by hand as often as possible from defence on Saturday – a tactic others, surely, will follow. That’s two losses in three weeks, with the Dockers to come in Perth. Lose that, and the double chance could be all but a memory. Huge week ahead. Best case: Third. Worst case: Eighth. Hobbled: Lachie Neale won’t play again until the finals. Credit: via Getty Images Gold Coast What we say: It’s always felt a touch odd to believe the Suns could earn the double chance, because we know their finals history – or lack thereof – all too well. But with an extra game up their sleeve (the rescheduled clash against Essendon), the double chance is within reach. They should take care of the Giants this week, while the Power, at home, are still a major challenge. We’ll back the Suns in to win both, leaving the Bombers clash to ultimately determine their fate. Best case: Second. Worst case: Ninth.\n\nWithin reach: Ben King and the Gold Coast Suns are on the cusp of a maiden finals run. Credit: AFL Photos Hawthorn What we say: Hokball is back, and the Hawks deserve praise. We were worried about their finals hopes, even last month tipping they would miss the top eight. But a strong performance on the road against the Crows, and a crushing win over Collingwood (we changed our projection last week and tipped the Hawks), have them all but certain finalists. They should take care of business against the Demons, leaving the trip north on the final Sunday of the home-and-away season to determine their top-four hopes. Best case: Fourth. Worst case: Ninth. Reading the room: Jack Ginnivan knows how to play the pantomime villain in Adelaide. Credit: Fox Footy\n\nGWS What we say: This is a tough one. After their shocker against the Bulldogs, our top-eight projections had the Giants missing September on percentage. That was dependent on them losing to the Suns next weekend. However, if they can flip that script and win, and then take care of the Saints, they should be in. A top-four finish, though, appears a step too far. Best case: Fifth. Worst case: Ninth. Hanging on: The Giants are clinging to a finals berth. Credit: via Getty Images Western Bulldogs\n\nWhat we say: The Dogs got out of jail against the Demons to remain in the finals hunt. Had they lost, their season would have been all but over. However, Hawthorn’s win over the Magpies hasn’t helped the Dogs’ cause, because they are running out of teams they can replace in the top eight. They will knock over the Eagles next Sunday. Then comes a season-defining clash against the Dockers. Best case: Sixth. Worst case: Ninth. On the edge: Marcus Bontempelli and his Bulldogs may miss the finals. Credit: Getty Images How we think it will play out",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/traveller/inspiration/spend-your-saturday-with-catriona-rowntree-20250807-p5ml6f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Catriona Rowntree spends her Saturdays",
        "publish_date": "Mon, 11 Aug 2025 12:01:20 +1000",
        "category": "finance",
        "authors": [
            "Catriona Rowntree"
        ],
        "text": "Advertisement\n\nSponsored InspirationThe Lott How Catriona Rowntree spends her Saturdays Sponsored by The Lott Catriona Rowntree August 11, 2025 — 12:01pm Save Log in , register or subscribe to save articles for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nMy travel schedule has always been fluid, which means I’ve long lost the concept of routine or working nine to five. I’ve spent more than three decades working in TV, so that clearly suits me just fine, but it also means my weekends are treasured. Catriona swears by fresh air and sunshine as a cure for jet lag. When I get home from a trip, I have a pretty simple routine. Priorities: Vegemite toast first, then I unpack as best I can, take a wander through the garden on our farm in regional Victoria, then pop a few fresh flowers around the house — vitamin D and walking is a great cure for jet lag. If all is going well, I’ll bake for my family. Joy for me is definitely found in the little things. Embrace life’s simple pleasures Like many parents, our lives are consumed by weekend sport. My husband James and I are human taxis, but we wouldn’t have it any other way.\n\nAdvertisement\n\nBefore all that begins, I love to start my Saturday with a cuppa (or two, so I can read the papers) in bed. I open up the blinds and enjoy the constantly changing view across the garden and out towards the trees. Once I’ve downed my second cup, I hit the local markets to load up on groceries for the weekend, then it’s time to get behind the wheel of my “taxi”. Food and movement inform everything we do at home, and they help lay the foundations for a fulfilling Saturday. We’re pretty active! I love to ride my bike around the farm and walk through the paddocks to check on the lambs now being born. When I first moved to the farm, I immediately asked my husband for a chook house, so weekends always involve a walk to gather those freshly laid eggs. Being with my loved ones is everything to me, so Saturdays are all about connection. I’ll make sure guests have their favourite treats, I go all out on a comfy guest room, make sure there are flowers by the bed and bake up a storm (triple-chocolate brownies are a crowd favourite). I’m not hugely social, but I treasure my small group of loved ones. Protect your peace I try to limit my time on the phone, especially on a Saturday. It affects your mood and I love to chat to people directly. My goal is to create a warm, beautiful home where people can relax. That means no phones at the table and, as a feng shui fan, we have no technology in the bedroom.\n\nAdvertisement\n\nFinding balance is my goal. My work can be bonkers and high octane, so for me to maximise that I have to be healthy. I try to rest, take my vitamins, head out into nature, deep dive into a good book and get my hands dirty in the garden. My weekends allow me to catch up and recalibrate. Go with the flow Feeding her loved ones also feeds her soul. A Saturday night for me is never straightforward. I could be hosting an event, cheering on my sporting team, at home in front of the fire (watching Getaway, of course) or cooking for loved ones. I’m a Cancerian, so I always love sharing my home and feeding the troops.\n\nAdvertisement\n\nI’m pretty easy-going, which seems to bode well for life as a traveller. I’ve learned first-hand to suck the marrow out of life. None of us know what each day has in store, so I try to remain open-minded and go with the flow. The perfect Saturday doesn’t need to be extravagant; my husband and I enjoy instant coffee, I love finding pretty flowers by the roadside (I keep secateurs in the glove box just in case), and packet cakes are always appreciated. It’s the little things and rituals that help centre me and allow for a calm start to the week. 5 Star Saturdays are made with Saturday Lotto. Wouldn’t it be nice? Discover more at thelott.com. What’s gambling really costing you? Gamble responsibly. Help is close at hand. Visit GambleAware, Gambling Help Online or call 1800 858 858.\n\nSign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now.\n\nTraveller Guides",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/magic-number-how-stretch-hopes-to-attract-people-to-his-unicorn-town-20250730-p5mj1o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Magic number’: How Stretch hopes to attract people to his ‘unicorn’ town",
        "publish_date": "Mon, 11 Aug 2025 11:59:22 +1000",
        "category": "finance",
        "authors": [
            "Millie Muroi"
        ],
        "text": "Geelong mayor Stretch Kontelj is eager for the region’s population to hit the “magic number” of 400,000.\n\nThe Victorian city is one of several places that the country’s oldest bank, Westpac, argues should be among 10 in regional Australia identified by the government as ripe for investment and growth.\n\nGeelong mayor Stretch Kontelj wants to welcome more residents to the city.\n\nRegional centres, including Cairns, Wagga Wagga and Bunbury-Busselton, are also on the list of places that could collectively absorb the target of an additional 1 million people by 2032.\n\n“We have an opportunity for regional Australia to reclaim its place as the driver of national prosperity and productivity,” the bank’s submission to this month’s economic roundtable reads. “The population of our capital cities is growing twice as fast as regional Australia, and they are struggling under the demands.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-s-war-on-the-world-is-starting-to-unleash-pain-20250811-p5mluk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s war on the world is starting to unleash pain",
        "publish_date": "Mon, 11 Aug 2025 11:55:00 +1000",
        "category": "finance",
        "authors": [
            "Ambrose Evans-Pritchard"
        ],
        "text": "Mary Daly, the San Francisco Fed chief, hinted strongly on Wednesday that there could be three cuts this northern autumn. “We know that once the labour market stumbles, it tends to fall quickly and hard,” she said. For now, it is a story of “low hiring”. It becomes dangerous if companies start firing as well. That can turn into a self-feeding downward spiral of mass layoffs that slips control, forcing the Fed to slash rates to the bone. US jobs growth ground to a screeching halt in May and June, just as labour economists had predicted. Credit: Bloomberg The US property market is already crying out for relief. Mortgage applications have collapsed to the levels of the mid-1990s. The Freddie Mac house price index has fallen for the past five months in a row. Property owners in south-west Florida are slashing prices at the fastest rate since the subprime bust in 2007-08. Wall Street has shrugged off the slowdown, but that is because traders are betting on the “Fed put” – Vickie Chang, from Goldman Sachs, says markets have priced in both a “negative US growth shock” and a “doveish policy shock” at the same time.\n\nThe two more or less offset each other. In other words, the Fed will ensure that the Schiller price-to-earnings ratio on Wall Street remains near the peak of the dotcom bubble at over 38, and junk bond spreads remain as compressed as they were at the peak of the Lehman credit bubble. Uncle Jerome will keep investors fat and happy. Loading The Fed will undoubtedly cut rates, but it is an invidious position. The next shocker may well be the core inflation figures out next week. The delayed effects of the tariffs are about to feed through with malicious and unstoppable force. Welcome to 1970s Nixonian stagflation. Donald Trump will doubtless declare that the index has been manipulated by Marxist fifth columnists. Good luck with that. The US is unable to substitute 90 per cent of its current imports with local production. Trump’s trade taxes will be paid by US consumers via higher prices, and by US companies with plants abroad or reliance on foreign inputs via lower profit margins. Caterpillar has already warned that the Trump levy will cost it up to $US1.5 billion ($2.3 billion) a year. Brewer Molson Coors expects earnings to fall by 7 to 10 per cent because Trump’s 50 per cent tariffs on aluminium have pushed metal can costs through the roof.\n\nWe know from early warning signals – both the ISM’s service price paid index and S&P Global’s composite PMI output prices – that price impulse is filtering through with the usual multi-month lag, and that headline inflation will approach an annualised rate near 5 per cent over the next three months. Durable goods prices are already rising at the fastest rate since the early 1990s. The Yale Budget Lab expects food and apparel prices to rise by almost 40 per cent. The Fed will undoubtedly cut rates, but it is an invidious position. Britain and Europe are in a different position. They are absorbing the brunt of China’s galactic overcapacity, and absorbing some of its deflation too as a wave of cheap Chinese exports are diverted from the US and into their markets. They are not committing further economic self-harm by raising inflationary trade taxes themselves. I can understand the reasons for the hawkish tone of the Bank of England’s rate cut on Thursday, but lingering worries of UK inflation may soon be washed away by larger global forces. “The Bank will be compelled to cut faster in 2026,” said Mathieu Savary, of BCA Research, who thinks that deflation is the greater danger stalking Europe.\n\nThe eurozone’s rebound has stalled. The growth spurt earlier this year was an illusion of “tariff front-running”. German industrial output fell 1.9 per cent in June. It is down 4 per cent from a year ago, and 10 per cent below its pre-pandemic level. “It’s a cold shower for our long-held view of a cyclical rebound in German industry,” said Carsten Brzeski, of ING. Brzeski said Germany’s Mittelstand family firms cannot blunt the impact of the tariffs by relocating production to the US. These firms have always formed the backbone of the Wirtschaftswunder (or economic miracle). They are being hammered on a second front by China, which has moved up the technology ladder and is now competing toe to toe in third markets, with the help of a suppressed exchange rate.\n\nKeynesian rearmament and a blitz of infrastructure spending will eventually lift Germany out of the doldrums. The Merz government is swinging from a primary budget surplus of 2 per cent of GDP to a primary deficit of 2 per cent by 2028. That is a big secular shift in macroeconomic policy, but it remains far away and, in the meantime, France and Italy face fiscal retrenchment. The eurozone has seen a long series of false dawns over recent years. It risks happening again if the European Central Bank continues to sit on its hands as the Wicksellian “natural” rate of interest plummets. Trump’s tariffs on Europe will now ratchet up to 15 per cent. The trade shock amounts to 25 per cent this year when you add in euro appreciation against the dollar, or a de facto 60 per cent shock on metal products. Trump has yet to drop his full pharma bomb. He is talking of 100 per cent tariffs on semiconductors. The market narrative that the worst is over and that stability will come will surely become a collectors’ item for historians and students of the capitalist psyche. Nothing is ever stable with Trump.\n\nLoading He has just inflicted the biggest trade shock in peacetime since the origins of the modern economy in the 17th Century. He has killed Pax Americana stone dead, destroyed NATO credibility, carpet-bombed the West and smashed the rules-based order to smithereens on every level. Yet asset markets remain insouciantly priced for perfection. What can possibly go wrong? Telegraph, London",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/11-on-11-did-we-just-glimpse-warren-ryan-s-rugby-league-future-20250810-p5mlq5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "11-on-11: Did we just glimpse rugby league’s future?",
        "publish_date": "Mon, 11 Aug 2025 11:50:55 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "“It was Warren Ryan’s 11 v 11, so we got to see 10 minutes of that and see how it went.”\n\nFor anyone without a season on the line on Saturday night, or a player sat in the Suncorp Stadium naughty corner, 11 Roosters against 11 Dolphins was a lot of fun.\n\nWith Spencer Leniu’s eyes rolling like Gold Coast pokies and Gerard Sutton just as enthusiastic about using the sin bin, Trent Robinson watched Ryan’s ideal game of rugby league in real time and made sure to mention it afterwards as well.\n\nRyan might just be the single most influential coach of the past 40 years. Not only because of his introduction of the umbrella defence in the 1980s, but in sowing the seeds of his rugby league philosophy among figures including Phil Gould, the Johns brothers and premiership-winning coaches Chris Anderson, Steve Folkes, Michael Hagan and Shane Flanagan.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/melbourne-star-observation-wheel-s-future-finally-revealed-20250811-p5mlwc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne Star to turn again after four-year closure – but keen riders will have to wait",
        "publish_date": "Mon, 11 Aug 2025 11:47:36 +1000",
        "category": "finance",
        "authors": [
            "Rachael Dexter"
        ],
        "text": "The long-dormant Melbourne Star Observation Wheel in Docklands will officially reopen within the next 16 months, following an $11 million investment deal with new Swiss and American backers.\n\nThe new ownership group has committed to having the wheel turning again by the end of 2026.\n\nJonathon Codman, director of precincts The District Docklands, stands with new Melbourne Star managers Jane and Jay Jones of Skyline Attractions and Lord Mayor of Melbourne Nick Reece on Monday morning. Credit: Simon Schluter\n\nLord Mayor Nick Reece hailed the announcement as a “wheelie, wheelie great day for Melbourne” at a press conference on Monday morning beneath the wheel. He described the attraction’s return as a major symbol of the waterfront suburb’s revival, saying that “Docklands is going from strength to strength at the moment”.\n\n“We recently saw Coles announce they’re moving their headquarters here with 5000 employees. Sonic Healthcare is opening their Melbourne centre next door, bringing close to 1000 employees into Docklands,” Reece said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/traveller/travel-news/cold-water-plunge-luxury-looks-different-at-this-tassie-hotel-20250724-p5mhix.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cold-water plunge? Luxury looks different at this Tassie hotel",
        "publish_date": "Mon, 11 Aug 2025 11:47:35 +1000",
        "category": "finance",
        "authors": [
            "Julietta Jameson"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nIn the world of hospitality, the “signature experience” is on the rise, the name given to an activity that only one hotel can offer, such as a tour of its art collection. Or it could be VIP access to an attraction or event that the hotel has negotiated with local operators.\n\nRather than the one-off feat pulled off by a savvy concierge or front desk, these experiences are tailored to the interests of an establishment’s customers.\n\nThe Tasman hotel three excursions exclusive to hotel guests.\n\nThey come as even economy hotels offer accoutrements that used to only be found in the upscale as the luxury segment continues to grow faster than any other hotel class, creating fierce competition.\n\nAnd the meaning of luxury is also shifting, according to a report by consultancy firm McKinsey and Company.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/five-minute-auction-ends-family-s-three-year-search-for-perfect-property-20250808-p5mljl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Five-minute auction ends family’s three-year search for perfect property",
        "publish_date": "Mon, 11 Aug 2025 11:41:08 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A Gumdale estate with just six gum trees – a unicorn in a suburb where they’re fiercely protected – has sold for $4.025 million in a five-minute auction, ending a Camp Hill family’s three-year search for the perfect property.\n\nIn front of more than 150 onlookers, the family lobbed the opening bid of $3 million for the four-bedroom lowset house on an 18,922-square-metre parcel 15 minutes from the CBD.\n\nFrom there, the auction of 236 Grassdale Road was over almost as soon as it began, with $100,000 bids flying in rapid-fire bursts.\n\n“It was the second-fastest auction of my career,” said selling agent Shane Hicks of Place Estate Agents Camp Hill.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-wa-police-investigating-three-shootings-over-weekend-wa-prisoners-caught-eating-guinea-pigs-20250811-p5mlwd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: WA Police investigating three shootings over weekend; WA prisoners caught eating guinea pigs",
        "publish_date": "Mon, 11 Aug 2025 11:34:02 +1000",
        "category": "finance",
        "authors": [],
        "text": "Nearly 10,000 submissions have been received by a review looking into changing some of WA’s public holiday dates, and potentially added two more to the calendar.\n\nPreliminary analysis of the submissions, accrued during a four-week public consultation period, indicates strong support for changes to the public holiday schedule to place WA more in line with other states.\n\nThe proposed reforms include moving existing public holidays, such as Labour Day and the King’s Birthday, to match other states and territories. It also suggests moving WA Day from winter, to a warmer month like November, and introducing one to two new public holidays to give those in the west a similar number of public holidays as other states (currently we have 11).\n\nThe Chamber of Commerce and Industry WA calculated that two extra public holidays would result in a $115 million disaster for local businesses. The Tourism Council of WA has also pushed back on the idea over concerns additional costs would be put onto customers.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/nsw/why-a-sydney-council-banished-a-troll-bar-from-under-the-harbour-bridge-20250731-p5mjcq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why a Sydney council banished a ‘troll bar’ from under the Harbour Bridge",
        "publish_date": "Mon, 11 Aug 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "The Norwegian folklore of trolls inspired plans for a new live music bar under the archways of the Sydney Harbour Bridge – but the prospect of monsters lurking under the heritage structure has proven a bridge too far for historians, community groups and a local council.\n\nA year-long proposal to turn a vacant shopfront under the northern end of the coathanger has been delivered a not-so fairytale ending after a planning application for the venue was officially rejected by North Sydney Council.\n\nPeter Lanigan wanted to open a small live music bar in a shopfront under the Sydney Harbour Bridge at Milsons Point (in the background here), but the plan has been rejected by North Sydney Council. Credit: Max Mason-Hubers\n\nThe saga began when owner and publican Peter Lanigan lodged development plans with the council to turn the former Milsons Point newsagency in Kirribilli’s main shopping strip into a “sophisticated small bar” named The Troll, inspired by the 19th-century Scandinavian fairytale.\n\nTrolls, often depicted as monstrous beings living under bridges, have for more than 150 years acted as a cautionary tale for children to be careful around dangerous places.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/fewer-takeaways-dearer-eggs-how-inflation-hits-your-hip-pocket-20250807-p5ml9t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fewer takeaways, dearer eggs: How inflation hits your hip pocket",
        "publish_date": "Mon, 11 Aug 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Matt Wade"
        ],
        "text": "Inflation is the lowest in years and interest rates are coming down, but that hasn’t stopped us fretting about finances. Polls show the cost of living is still our No.1 worry.\n\nThe latest Resolve Political Monitor, conducted for this masthead, found 41 per cent of voters believe “keeping the cost of living low” should be the government’s top priority, with “housing and rental accessibility” a distant second on 10 per cent.\n\n“People have experienced climbing bills for several years, and there’s been a cumulative effect on financial comfort and spending from that,” says Resolve director Jim Reed, who conducts the survey.\n\n“Prices for day-to-day items haven’t become any cheaper, they’ve just stabilised, and many people are still feeling the pinch. Income needs to catch up for that to change.”",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/lotto-winners-share-massive-jackpot-021640633.html",
        "title": "Lotto winners share massive jackpot",
        "publish_date": "2025-08-11T02:16:40Z",
        "category": "finance",
        "authors": [
            "Andrew Hedgman"
        ],
        "text": "Four winners each landed a life-changing $1.6 million in the Saturday Gold Lotto, but at least one has yet to claim their prize. Picture: NewsWire / Diego Fedele\n\nFour lucky players have each pocketed more than $1.6 million in the Saturday Gold Lotto draw, with two winning tickets sold in southeast Queensland.\n\nA Wavell Heights woman has described her $1.67 million win as a “ticket to freedom,” declaring her future transformed after securing one of the four division one prizes in Saturday Gold Lotto draw 4597.\n\n“I’m trying to just not be too excited … just in case,” she laughed when speaking about her life-changing win,” she said.\n\n“I checked the ticket at the newsagent and they looked at it like, ‘we think you’ve won a fair bit of money’.\n\n“So, I came home and checked the ticket online. I thought, ‘Oh! This is exciting!’”\n\nADVERTISEMENT\n\n“I always play Saturday Gold Lotto and I won $400 recently. I thought that was the best thing ever, but this is even better.\n\nA Warwick mum’s last-minute Lotto ticket wins $1.6 million, turning a near miss into a life-changing moment. Picture: NewsWire/ Gaye Gerard\n\nShe said she will be able to pay off her mortgage with the money.\n\n“When I see the home loan disappear completely, I will be partying. It will be like I’m working for myself after that,” she said.\n\nHer winning entry was purchased at Nextra Aspley Village, Robinson Rd Marketplace, Aspley.\n\nNextra Aspley Village owner Dan Beutel welcomed the news and said the win was great for the region.\n\n“As we’ve been here for 23 years, we know many of our customers personally and we know they’ll be very happy for us and the lucky winner,” he said.\n\n“This is our fourth division one win during our time. The last time we sold a division one winning entry was in November 2023, so it’s fantastic to see another one. It’s great news for Aspley and we’ll be letting everyone know.\n\nADVERTISEMENT\n\n“Congratulations to our winner and may the win bring joy to them and their family.”\n\nThree of the four winners are from Queensland. Picture: NewsWire / Nikki Short\n\nAt the same time, a Warwick mother has claimed her life-changing $1.6 million prize after nearly skipping the ticket purchase altogether.\n\nThe Warwick resident held one of the four division one winning entries on Saturday.\n\nWhen an official from The Lott confirmed the prize, the winning mum was still stunned, with her son by her side, recounting how they discovered her win.\n\n“Thank you. We feel a bit odd, but it’s bloody terrific!” the winning son laughed.\n\n“We’ve just been quite emotional. Even hearing you confirm the good news is crazy. We’re slowly realising it’s a reality.\n\n“It’ll set my mum up completely. She’s everything, and she’s so deserving of this. It’ll give her breathing room, and she can do some things she’s always dreamt of.\n\nADVERTISEMENT\n\n“She asked me to check the ticket through my app, and I couldn’t believe it. I just started screaming and crying for her! She wasn’t even going to buy a ticket this week, but changed her mind Saturday morning.\n\n“We’ve just been in limbo since then, and of course, we’ve put the ticket straight in a safe.”\n\nThe winning mum said they were still “pinching” themselves.\n\n“We’ve had to make a few changes in the last few years with different life challenges, so it’ll come in handy,” she said.\n\n“First thing I’ll do is pay the rates early.”\n\nA Wavell Heights woman has described her $1.67 million win as a “ticket to freedom”. NewsWire/ David Crosling\n\nHynes Newsagency owner Peter Hynes said he was thrilled to hear his outlet had sold a division one winning ticket to a local.\n\n“It’s always an honour to sell a division one winning ticket and to know we’ve played a small part in someone’s life-changing moment,” he said.\n\n“Customers always love to hear we’ve had a win, and it helps restore their faith that locals do win.\n\nADVERTISEMENT\n\n“It was just in October that we last sold a division one prize in Saturday Lotto. We are in our 50th year of owning the newsagency and have sold many winners during this time.\n\n“Congratulations to our winning customer. It’s a life-changing amount, and we couldn’t be happier for you.”\n\nAcross Australia, there were four division one winning entries in Saturday Gold Lotto draw 4597, three from Queensland and one from Victoria.\n\nMeanwhile, the deadline to claim a life-changing lottery prize ends tonight, but “sadly no one has come forward,” a Lott spokesman told NewsWire.\n\nThe Saturday Gold Lotto player won just over $670,000 nearly seven years ago with a ticket purchased at a Helensvale newsagent, and with the claim period expiring, the prize money will be returned to players through community donations and promotions.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/horror-moment-boy-9-attacked-005154229.html",
        "title": "Horror moment boy, 9, attacked by shark",
        "publish_date": "2025-08-11T01:41:43Z",
        "category": "sports",
        "authors": [
            "Blake Antrobus"
        ],
        "text": "A nine-year-old boy has recalled the horror moment his board was smashed to pieces after he was attacked by a shark on the NSW south coast.\n\nBowie Daly was surfing along Tathra Beach, a seaside area on the Sapphire Coast in southern NSW, on Thursday when he suddenly felt a “tug” at the back of his surfboard.\n\nSpeaking to the ABC, the nine-year-old said he “suddenly started drowning” but got back up onto the board.\n\n“When I came back up, I saw a giant back and I realised it was a shark and then I started screaming for help,” he said.\n\nBowie Daly was surfing at Tathra Beach on Thursday when a shark grabbed his surfboard. Picture: ABC\n\nThe board was smashed to pieces but amazingly, Bowie only escaped with a scratch and a puncture to his wetsuit. Picture: ABC\n\nWhile Bowie escaped virtually unscathed – suffering only a scratch and puncture to his wetsuit – the shark destroyed his beloved surfboard.\n\nADVERTISEMENT\n\nHis father Simon explained to the ABC his son could have “lost his whole leg” if he was on the board properly.\n\n“We got really lucky,” he said.\n\nMr Daly said it was his “worst nightmare” realising his son had been attacked, before paddling out with another group of surfers to help his son.\n\n“Those seconds and that 20m of paddling was definitely the most intense of my life,” he said.\n\nA NSW Ambulance spokesman confirmed paramedics had been called over the incident but reported no injuries.\n\nThe attack occurred at Tathra Beach on the NSW south coast. Picture: Supplied / Google Maps\n\nAccording to the Australian Shark-Incident Database (ASID), there has been an average of 20 incidents in which people have been injured by sharks.\n\nOn average, there were 2.8 fatalities each year and seven incidents in which the person was uninjured.\n\nThree fatal shark attacks have been recorded so far in 2025 – one each in Queensland, South Australia and Western Australia.\n\nADVERTISEMENT\n\nIn January, 28-year-old Lance Appleby disappeared while surfing off Granites Beach, south of Streaky Bay in SA, after being attacked by a shark.\n\nThe shark caused damage to Bowie’s wetsuit. Picture: ABC\n\nHis body has not been recovered and subsequent searches by authorities have been called off.\n\nA month later, Charlize Zmuda, 17, died after being bitten by a shark while swimming at Bribie Island’s Woorim Beach.\n\nIn March, 37-year-old Steven Payne was surfing at Wharton Beach, about 780km southeast of Perth, when he was attacked by a shark. His body also could not be recovered.\n\nRising ocean temperatures due to climate change, in addition to a greater number of people swimming in the ocean, have been attributed to the steadily-rising number of attacks over the last 10 years.\n\nBowie’s father Simon Daly said the pair ‘got really lucky’. Picture: ABC\n\nBond University Associate Professor and shark researcher Dr Daryl McPhee said rising water temperatures rise along the coast, specifically around the Greater Sydney region, meant bull sharks were expanding their search for food – moving further south of Sydney and down the coast.\n\nShe said an increase in prey in the area – such as humpback whales – had driven the increase of shark sightings and attacks.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/barnaby-shot-minister-over-tax-013453593.html",
        "title": "Barnaby’s shot at minister over ‘new’ tax",
        "publish_date": "2025-08-11T01:39:31Z",
        "category": "finance",
        "authors": [
            "Joseph Olbrycht-Palmer"
        ],
        "text": "The Albanese government is mulling a road user charge for electric vehicles. Picture: Martin Ollman / NewsWire\n\nCoalition maverick Barnaby Joyce has welcomed chatter of a road tax for electric vehicle owners, saying that EV drivers are freeloading off fuel levies paid by other road users.\n\nState and federal officials are meeting with motor industry leaders at a summit in Sydney on Monday, where they will discuss a tax as part of brainstorming to fund future roads.\n\nSenior minister Tanya Plibersek played down the talks when appearing on a morning show, saying it was “a discussion that the states and territories have been leading for some time”.\n\nThe Albanese government is mulling a road user charge for electric vehicles. Picture: Martin Ollman / NewsWire\n\n“It’s no secret that as the number of petrol vehicles and diesel vehicles goes down, the take from fuel excise decreases,” the former environment minister told Seven’s Sunrise.\n\nADVERTISEMENT\n\n“That means less money for building and maintaining roads.”\n\nShe added “the Treasurer will be interested in the discussion today” but also noted that Anthony Albanese “has made clear that our tax priorities are delivering on the tax cut for every Australian that we’ve promised and making sure that multinational companies pay their fair share”.\n\nMs Plibersek also said: “I don’t think anything’s happening tomorrow”.\n\nAppearing opposite her was Mr Joyce, who put a different spin on Ms Plibersek’s support for “sensible” canvassing of road-funding options.\n\nA hardcore opponent of the Albanese government’s green transition, he said it was about time.\n\nNationals heavyweight Barnaby Joyce has welcomed chatter of a road user charge for electric vehicles. Picture: Martin Ollman / NewsWire\n\n“I have a sense there’s a lot of EVs in Tanya’s electorate, so she doesn’t want to jump right in there,” Mr Joyce said.\n\n“But we out here are overwhelming combustion engines because, as you can see, it is different terrain.\n\nADVERTISEMENT\n\n“I feel we are paying the excise that a lot of people are getting away with.”\n\nHe also claimed there are no electric utes used in the country after Ms Plibersek said there were.\n\n“Not out here, there isn’t. I assure you, not out here. Haven’t seen one,” Mr Joyce shot back.\n\nThere is precedent for an EV charge.\n\nNew Zealand last week captured EVs in plans for a blanket road usage duty for light vehicles.\n\nThe duty would be based on distance travelled and vehicle weight rather than a tax at the bowser.",
        "source": "Yahoo"
    }
]