[
    {
        "url": "https://www.9news.com.au/national/industries-in-australia-with-most-workplace-fatalities-revealed/969e11ed-9a4f-476a-9a03-81f176d1d0a4",
        "title": "Australia's deadliest jobs revealed",
        "publish_date": "Fri, 17 Oct 2025 00:23:34 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Just six industries were home to 80 per cent of deaths﻿ in the workplace last year.\n\nSafe Work Australia has released its new Key Work Health and Safety Statistics Australia report, which revealed 188 people were fatally injured ﻿at work in 2024 - a decline on 200 in 2023.\n\nThe watchdog said 80 per cent of these deaths had taken place across just six industries - agriculture, forestry, and fishing; public administration and safety; transport, postal, and warehousing; manufacturing; health care and social assistance; and construction.\n\nWorkplace safety continued to improve across Australia last year. (Getty)\n\nThe report also showed vehicle incidents remained the leading cause of job deaths (42 per cent, or 79 fatalities), followed by falls from a height (13 per cent, or 24 fatalities).\n\nAnd while Australia's workplace safety generally compares well to the rest of the world, with an injury rate of 3.5 per cent compared to the global 12.1 per cent, Safe Work Australia says the impact is still deeply felt.\n\nIn 2023–24, there were 146,700 serious workers' compensation claims involving at least one week of working time lost, equivalent to more than 400 serious claims every day.\n\nREAD MORE: Woman randomly stabbed while walking to work in broad daylight\n\nClaims for mental health conditions continue to rise and now account for 12 per cent of all serious claims, an increase of 14.7 per cent from the previous year.\n\nThe median time lost from work in these claims is almost five times that recorded across all other injuries and diseases.\n\n\"Our data show there is still more to be done to ensure every worker, regardless of occupation or industry, returns home safely at the end of the day,\" Safe Work Australia chief executive Marie Boland said.\n\n\"Behind every statistic is a person, a family, workmates, a community and a story.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/nissans-recalled-over-fears-of-potential-fire/7bd52464-a801-41e2-bdfd-e3b8c51692b1",
        "title": "Over 13,000 Nissan cars recalled over fuel pipe issue",
        "publish_date": "Thu, 16 Oct 2025 23:53:16 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "A range of Nissan cars have been recalled over fears they could result in a 'loss of motive power' and potentially even start a vehicle fire.\n\nIn the official notice online, Vehicle Recalls﻿ said that due to a manufacturing defect in the affected cars, the fuel pipe might chafe against the support bracket and suffer damage.\n\n\"If this occurs fuel may leak, potentially resulting in loss of motive power whilst driving, and if in the presence of an external ignition source may result in a vehicle fire,\" the notice read.\n\nA range of Nissan cars have been pulled off the roads due to safety fears. (Supplied)\n\nIt could increase the risk﻿ of injury and even death to people within or outside the car.\n\n\"Owners of affected vehicles will be contacted in writing requesting they contact an authorised Nissan dealer to have their vehicle rectified, free of charge,\" the notice said.\n\n﻿The affected cars include ICE variants of the J12 Qashqai model, made in 2022 to 2024.\n\nREAD MORE: Woman randomly stabbed while walking to work in broad daylight\n\nAbout 13,000 cars are affected. (Supplied)\n\nThere are 13,031 cars affected.\n\nFor more information, contact Nissan Austrapo1800 035 035 or online .﻿\n\nFind more details, including a list of vehicle identification numbers, online here .﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/gym-membership-cancellation-rights-can-they-charge-you-four-weeks-explainer/f7127790-2960-4dc6-a6e2-4a3f637ff56c",
        "title": "Cancelling a gym membership? These are your consumer rights in Australia",
        "publish_date": "Thu, 16 Oct 2025 22:42:24 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "There's nothing worse than deciding to cancel a gym membership only to be slapped with hefty termination fees.﻿\n\nThe average Australian with a gym membership spends $756 per year on working out according to Canstar, which is equivalent to about $63 per month﻿.\n\nHere's ﻿what you need to know about your consumer rights when cancelling a gym membership.\n\nThe average Australian with a gym membership spends $63 per month﻿, which adds up in a cost of living crisis. (Getty)\n\nDo you have the right to cancel a gym membership?\n\nYes, you have the right to cancel gym memberships.\n\nHowever the terms of your cancellation may vary depending on the gym.\n\nSome gyms enforce specific rules around cancellation, such as charging a fee or requiring members to attend the gym in-person to cancel.\n\n\"Businesses should provide clear and accurate information to consumers up-front about the memberships or subscriptions they are offering,\" a spokesperson for the Australian Competition and Consumer Commission (ACCC) told 9news.com.au.\n\n\"Including any automatic renewal of the contract, consumers' ability to cancel the contract, and any cancellation fees that might apply and when﻿.\"\n\nWhat are the rules around cancelling a gym membership?﻿\n\nThis depends on the specific gym you're signed up with and what contract you're on.\n\n﻿The first step for anyone looking to cancel their gym membership is to check the cancellation terms on their contract.\n\nIf you only recently joined the gym, you may be able to quit without paying a fee if you're still in a cooling-off period﻿.\n\nThese are in place to ensure members who cancel within a set time (typically within seven days of joining) only pay for administration costs or services used, not the full contracted membership period.\n\nOther common terms include a mandatory notice period, or termination fees.\n\n\"Some states and territories also have additional protections for consumers in state-specific laws regarding gym memberships,\" the ACCC spokesperson said.\n\n\"For example, in Queensland, the Fitness Industry Code of Practice contains requirements that gyms must meet regarding disclosure of information in membership agreements, cooling off periods, the notice period a gym must give before renewing an agreement, and termination of membership agreements.\"\n\nREAD MORE: How to maximise public holidays and make the most of your annual leave in 2025\n\nThere are some things that can't be included in gym ﻿contracts under the Australian Consumer Law. (Getty)\n\nWhat can't a gym do ﻿when a member cancels?\n\nMost gym memberships are based on a standard form contract﻿ and there are certain things that can't be included in these under the Australian Consumer Law.\n\n\"Businesses can include requirements for, and conditions on, cancellations in their contracts,\" an ACCC spokesperson said.\n\n\"However, they need to take care to ensure such terms are not unfair contract terms.\"\n\nUnfair contract terms include:\n\nterms that would cause a significant imbalance in the parties' rights and obligations under the contract\n\nterms that are not reasonably necessary to protect the business\n\nterms that would cause detriment (financial or otherwise) to a consumer\n\nGyms caught proposing, using, or relying on unfair contract terms in standard form contracts can face fines up to $2.5 million for individuals and $50 million for businesses.\n\n\"If consumers have a dispute about a gym membership or subscription, they should contact their local state or territory consumer protection agency in the first instance,\" the ACCC spokesperson said.\n\n\"They can also report the issue to the ACCC.\n\nHow to cancel a gym membership﻿\n\nOnce you're across the terms of your contract, you can request to cancel your gym membership – this can usually be done in-person, over the phone or online.\n\nRegardless of how you cancel, always get confirmation of your cancellation in writing with proof of the date you cancelled.\n\nThis is because many gyms require members to give notice of cancellation in advance to stop payments.\n\nHow much notice do you have to give to cancel a gym membership?\n\nAussies must give gyms up to 30 days ﻿notice when cancelling a membership, during which time they will still be charged for the service.\n\nNotice periods vary from gym to gym, but cannot be more than 30 days.\n\nThis is sometimes known as ﻿a four-week cancellation policy.\n\nCan gyms charge you to cancel membership?\n\nYes, gyms can charge termination fees when you cancel a membership.\n\n﻿These must be laid out clearly in your contract under the Australian Consumer Law.\n\nCancelling gym memberships online\n\nSome gyms require members to attend the gym in-person to cancel a membership.\n\nCheck your contract to see if this applies at your gym.﻿\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/technology/are-we-in-an-ai-tech-bubble-what-happens-if-it-bursts-explainer/c11d1f63-a085-419d-bc62-030911459304",
        "title": "Are we in an AI tech bubble and what happens if it bursts?",
        "publish_date": "Fri, 17 Oct 2025 00:15:44 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "According to the valuations, the company behind ChatGPT is now worth more than what the entire state of Victoria produces in a year, and it's not far off NSW.\n\nArtificial intelligence, its builders say, has almost unlimited potential to radically transform – or maybe even destroy – the world.\n\nBut more and more finance, business and tech experts watching the staggering firehose of money pouring into the sector are starting to question whether the multitrillion-dollar industry is one big bubble. And what happens if it bursts?\n\nIf you believe the valuations, the company behind ChatGPT is now worth more than what the entire state of Victoria produces in a year, and it's not far off NSW. (AP)\n\nThe Bank of England warned of an increasing risk of \"a sharp market correction\", Goldman Sachs CEO David Solomon said \"a lot of capital\" wouldn't deliver returns and the International Monetary Fund's chief economist, Pierre-Olivier Gourinchas, said after surging valuations and booming investments, \"markets could reprice sharply\".\n\nUsing simpler words, Amazon founder Jeff Bezos called it \"kind of an industrial bubble\".\n\nEven Sam Altman, the head of ChatGPT maker OpenAI, asked directly if investors were \"overexcited about AI\", flat out said \"yes\".\n\n\"When bubbles happen, smart people get overexcited about a kernel of truth,\" he told reporters at The Verge and some other tech publications in August.\n\n\"If you look at most of the bubbles in history, like the tech bubble, there was a real thing. Tech was really important. The internet was a really big deal. People got overexcited.\"\n\nEven Sam Altman, the head of ChatGPT maker OpenAI, asked directly if investors were \"overexcited about AI\", flat out said \"yes\". (AP)\n\nWhat even is a bubble?\n\nSo, are they right? And what happens if the AI bubble bursts?\n\nStanford Graduate School of Business Professor Anat Admati says the concept of a bubble is not well defined, and it's almost impossible to identify one in real time.\n\n\"Stock valuation and timing stocks is very difficult because the stock reflects the entire future and all lots and lots of factors,\" she tells 9news.com.au.\n\n\"So the notion that you're diagnosing a bubble as it's happening is often folly.\n\n\"People form beliefs and decide to trade, and it's a very dangerous game to play for investors, for pundits, journalists like yourself.\"\n\nThe OpenAI logo is seen on a mobile phone in front of a computer screen displaying output from ChatGPT. (AP)\n\nOxford Economics lead economist Adam Slater sees \"some symptoms of a bubble\", including rapid growth in tech stock prices and the fact tech stocks now comprise about 40 per cent of the S&P 500 stock market tracking the 500 leading US companies.\n\nHe also points to market valuations that appear \"stretched\" beyond their worth and \"a general sense of extreme optimism in terms of the underlying technology, despite the enormous uncertainties around what this technology might ultimately yield\".\n\nSome analysts suggest AI could lead to productivity gains not seen since Europe after World War II, while Massachusetts Institute of Technology economist Daron Acemoglu has predicted a 0.7 per cent gain in US productivity over a decade.\n\n\"You've got this incredibly wide range of possibilities,\" Slater says.\n\n\"Nobody really knows where it's going to land.\"\n\nOpenAI isn't the only player in the AI game. (Getty)\n\nIs this the dotcom boom 2.0?\n\nThe easy comparison, which even Altman and his Open AI chairman, Bret Taylor, have made, is with the dotcom boom, when the tech-heavy NASDAQ surged almost 600 per cent in the mid-to-late '90s before wiping off almost all of those games in about a year and a half.\n\nA swathe of start-ups were wiped out and even big hitters still around today such as Microsoft, Oracle and Intel took a battering on the markets.\n\nAdmati says it's too hard to predict whether a potential AI bubble bursting would do anything more than correcting the price of some companies, much less when it might happen.\n\nA swathe of start-ups were wiped out and even big hitters still around today such as Microsoft, Oracle and Intel took a battering on the markets. (AP)\n\n\"The internet bubble burst didn't change the entire world economy,\" she says.\n\n\"It was a price correction in a relatively narrow sector.\"\n\nTaylor puts a positive on the comparison, saying you could argue people pouring money into internet stocks in 1999 were broadly right.\n\n\"If you look at the internet bubble, a lot of people think about the flops, like Pets.com and Webvan,\" he tells The Verge.\n\n\"Through the lens of the past 30 years, though, we've now gotten most of the largest companies in the world, including Amazon and Google, two of the largest companies in the world.\"\n\nTaylor argues people pouring money into internet stocks in 1999 were broadly right. (AP Photo/Richard Drew FILE)\n\n'It's the fear of missing out'\n\nOpenAI is the most striking example of AI investment because it's come from nothing to be one of the world's most hyped companies in a few years based solely on the promise of its tech.\n\nIt is now valued at roughly $US500 billion ($771.9 billion), not too far below the GDP of Austria ($804.1 billion) or the 2023-24 GSP (gross state product) of NSW ($821 billion).\n\nBut the big boys are also shovelling money into their large language models and other AI research.\n\nGoogle is all-in on AI across its phones and even search and just this week announced another $US15 billion investment in an AI data hub, Amazon looks set to spend $US100 billion ($154.5 billion) on the technology this year, Apple boss Tim Cook told employees the AI revolution was \"as big or bigger\" as the internet, smartphones, cloud computing and apps.\n\nGoogle's Gemini AI assistant. (Google)\n\nChipmaker NVIDIA's surge to become the biggest company in the world by market capitalisation – overtaking even Apple – was so dramatic that it spurred a wave of articles about how the name is pronounced (en-VID-eeyah, by the way).\n\nIt was driven by a ravenous demand for the company's high-end GPUs, prized above all else in battle for the massive amounts of computing power it takes to sustain these huge companies' AI computing demands.\n\nSo when it invested $US100 billion in OpenAI, which, as well as being one of its main customers, has a 10 per cent stake in chip rival AMD, eyebrows were raised at this \"circular\" financing.\n\nAMD and OpenAI have agreed to a multibillion-dollar deal. (AP)\n\n\"A small group of companies is securing most of the major deals. News about multibillion-dollar investments from familiar companies such as OpenAI, Nvidia, CoreWeave, Microsoft, Google, and a few others is reported almost daily,\" Yale School of Management leadership expert Professor Jeffrey A Sonnenfeld and senior research fellow Stephen Henriques wrote in an opinion piece called This is how the AI bubble bursts.\n\n\"Should the bold promises of AI fall short, the dependence among these major AI players could trigger a devastating chain reaction, causing a widespread collapse similar to the 2008 Great Financial Crisis.\"\n\nHenriques tells 9news.com.au the risks are likely closer to those of the dotcom boom, where there is promise that \"will take a lot longer to materialise than people expect\".\n\n\"It's the fear of missing out,\" Sonnenfeld says.\n\n\"Everybody you know thinks that the costs of missing it are too high, enterprise wise and career wise, to look like you're an anachronism.\"\n\nMicrosoft is a major investor in OpenAI. (AP)\n\nIn their article, the researchers point out that in less than three years, OpenAI has \"gone from a parlour game to a pillar of the global economy\".\n\n\"After pillar, you wonder if you're going to wind up with a pile of rubble, and how to then rebuild out of the shakeout, where you see a lot of damage and carnage done,\" Sonnenfeld tells 9news.com.au.\n\nThe upside\n\nBezos argues the AI boom will be good for the world even if the bubble bursts, describing it as industrial, rather than financial or banking.\n\n\"The ones that are industrial are not nearly as bad. It could even be good because when the dust settles and you see who are the winners, society benefits from those inventions,\" Bezos said at a recent tech conference in Italy.\n\nHe compared it to a previous biotech bubble in the 1990s that resulted in new life-saving drugs.\n\n\"Every company gets funded, the good ideas and the bad ideas. And investors have a hard time in the middle of this excitement distinguishing between the good and bad ideas and so that's also probably happening today,\" he said.\n\nAltman last month predicted people would \"make some dumb capital allocations\", resulting in short-term ups and downs.\n\nBut he was confident it would drive \"a new wave of unprecedented economic growth\", scientific breakthroughs, improvements to quality of life and \"new ways to express creativity\".\n\nThe information provided on this website is general in nature only and does not constitute personal financial advice. The information has been prepared without taking into account your personal objectives, financial situation or needs. Before acting on any information on this website you should consider the appropriateness of the information having regard to your objectives, financial situation and needs.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/entertainment/original-kiss-lead-guitarist-ace-frehley-dead-at-74/f8c6652b-80f3-4c42-a3d5-0900bb91bd74",
        "title": "Rock legend dies aged 74",
        "publish_date": "Thu, 16 Oct 2025 22:49:32 +0000",
        "category": "entertainment",
        "authors": [
            "Oct"
        ],
        "text": "Ace Frehley, the original lead guitarist and founding member of the glam rock band KISS who captivated audiences with his elaborate makeup and smoke-filled guitar, has died. He was 74.\n\nThe American rock star died peacefully on Thursday (Friday AEDT )surrounded by family in the north-eastern state of New Jersey following a recent fall, according to his agent.\n\nFamily members said in a statement that they are \"completely devastated and heartbroken\", but will cherish his laughter and celebrate the kindness he bestowed upon others.\n\nAce Frehley, left, of the rock band KISS has died aged 74. (AP Photo/Chris Pizzello) (AP)\n\nIn this 2009 photo, former KISS lead guitarist Ace Frehley plays the national anthem before an NFL football game between the Kansas City Chiefs and the New York Giants in Kansas City, Mo. (AP Photo/L.G. Patterson, File) (AP)\n\nKiss, whose hits include Rock and Roll All Nite and Detroit Rock City , was known for its intense stage shows, which included fireworks, smoke and eruptions of fake blood performed by band members in black-and-white painted faces, platform boots and black wigs.\n\nFrehley and his band mates were inducted into the Rock and Roll Hall of Fame in 2014.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/woolworths-ai-job-interviews-jamie-rejected-exclusive/f3fc936d-4190-4f9b-b832-9648a8c8c9e7",
        "title": "Jamie wanted a job at Woolies. He claims he was rejected after two AI interviews",
        "publish_date": "Thu, 16 Oct 2025 21:46:01 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Exclusive: A young Australian claims he was rejected from an entry-level job at Woolworths despite never speaking to a single human being in the hiring process.\n\n﻿Jamie, 24, said he applied to work part-time at his local Woolworths in NSW and was subjected to two \"odd\" AI interviews, only to be rejected six weeks later.\n\nHe called the whole experience \"dystopian\", especially coming from \"one of the most profitable companies in Australia﻿\".\n\nREAD MORE: Hero tradie foils alleged attempted armed robbery\n\nJamie, 24, from NSW applied for a job at Woolies and said he was rejected after two AI interviews. (TikTok/@jammy_dunk/Getty)\n\nWoolworths' profits in 2024-25 hit nearly $1.4 billion.﻿\n\n\"I find it really hard to believe the company that makes that much money every year couldn't afford to have a human interview me,\" Jamie told 9news.com.au.\n\nBut experts say this is what the future of job hunting looks like.\n\nJamie applied for a role at his local Woolworths in September and said the online application mentioned \"AI may be involved\" in the hiring process.\n\nHe didn't know what that meant at first.﻿\n\n\"Almost immediately, I got the invite to do the first AI interview,\" Jamie said.\n\nHe had to provide written answers to questions from a text-based AI chatbot within a time limit.\n\n\"It kind of made me wonder, who is actually looking over this after you've completed it?\" he said, calling the interview \"strange\".\n\nAustralia named the most 'AI-addicted' country. See how others ranked View Gallery\n\nA few days later, he got an email inviting him to another AI interview with a text-based chatbot.\n\nThis time he had to provide voice and video responses, which he wasn't entirely comfortable with.\n\n\"I'm not sure how I feel about this really massive company having access to my voice and video,\" he said.\n\nWoolworths declined to comment, however 9news.com.au understands Woolworths uses AI as part of its hiring process for store roles.\n\nJamie said he didn't hear back from Woolworths until about six weeks later, when he received a generic rejection email with no human feedback.\n\n\"That was really like a little kick in the guts,\" he said.\n\nHe's just grateful he was able to support himself financially while waiting to hear back.﻿\n\n\"If you're nearly destitute, or you're really struggling, living paycheck to paycheck or on Centrelink, that six-week wait could kill you,\" he said.\n\nHe shared his frustrations in a TikTok video which has since been viewed about 100,000 times.\n\nJamie applied for a role at his local Woolworths in September and was invited to two AI interviews. (Getty)\n\nMany Aussies like Jamie are resistant to the idea of AI job interviews but ﻿Associate Professor of workplace and business law at the University of Technology, Sydney Giuseppe Carabetta said we should probably get used to it.\n\n\"Larger organisations are using things like CV scanners, video interview analysis, and personality assessments or tests,\" he told 9news.\n\n\"This is generally about faster screening and processes – but there are problems, including the risk of biases where you have AI replicating historical discrimination by humans (algorithmic discrimination).\"\n\n﻿There is currently no legislation that directly regulates the use of AI in recruitment but anti-discrimination laws require employers to ensure that recruitment practices do not discriminate based on attributes like race, sex, and ability.\n\nThose laws technically apply to AI systems, but they often \"fall between the legal cracks\" in recruitment.\n\nFor example, an employer could land in hot water if an ﻿AI recruitment system automatically rejects applicants with feminine-sounding names (gender discrimination).\n\nBut even that could be hard for an employee to prove or pursue legally, as anti-discrimination law normally applies to the actions of a physical person.\n\nAnti-discrimination laws technically apply to AI systems but can be hard to enforce. (Getty Images/iStockphoto)\n\nCarabetta said that AI use in recruitment is an area ripe for reform but ﻿\"unfortunately the law is slow to adapt and legislative reform is not easy or quick\".\n\nAnd in the meantime, there's not much Aussies can do to avoid AI interviews.﻿\n\n\"There is no direct legal right for jobseekers to request a human interview instead of an AI one,\" he said.\n\nAussies with a disability can ﻿request \"reasonable adjustments\" under the Disability Discrimination laws, which could include asking for a human interviewer.\n\n\"But for other candidates – for example, those uncomfortable with AI – there is no formal right to opt out of AI interviews.\"\n\nJobseekers can try to take steps to secure ﻿a human interview, like asking early on if interviews will be conducted using AI and voicing a preference for human interaction.\n\nREAD MORE: Cause of crash under investigation as soldier remembered as leader and mentor\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\nThey can also seek out ﻿employers that still emphasise 'traditional' recruitment methods, like handing in a physical resume, or reach out to hiring managers directly.\n\nBut there's no guarantee any of that will prevent jobseekers from having to deal with AI at some point in the hiring process.\n\nCarabetta encouraged Aussie jobseekers to learn how AI is used in modern hiring and try to adapt to it – because it's \"absolutely\" not going away.﻿\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-post-missed-delivery-viral-post-reddit/e5eced7c-d49e-443a-aff5-ac2ff0a0cd8f",
        "title": "'Kidding me': Aussie's hopeful attempt to dodge post office visit backfires",
        "publish_date": "Thu, 16 Oct 2025 22:38:07 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "An Australia Post customer has been left scratching their head after missing an important parcel delivery - despite not only being home all day, but even putting up a sign to let the postie know.\n\nThe customer posted a photo earlier this week to Reddit showing them giving a thumbs-up after posting the sign on the mailbox.\n\n\"Auspost, I am home!\" it read.\n\nA Reddit poster was optimistic about getting their parcel delivered after putting up this helpful sign. (Reddit)\n\n\"I can help with my package if need be as it is heavy. Please feel free to knock and ask!\"\n\nThe customer said similar missed drop-offs had happened before.\n\n\"Very expensive and large package coming today … ain't no way in hell I'm driving to the airport to pick it up because of my area's driver!\" they wrote.\n\n\"He loves to just put in the 'we missed you' note and speed off, and that's if he even finds the motivation to leave a note at all!\"\n\nNo such luck. (Reddit)\n\nDespite their precautions, a predictable - if amusing - update soon followed.\n\n\"Are you f------ kidding me,\" they wrote, holding up a familiar red-and-white collection slip.\n\nOddly, despite the cu﻿stomer offering to help due to the package's weight, the \"heavy\" box was not checked on the card.\n\nThe customer's post sparked a long thread of replies, many of them featuring similar tales of woe.\n\nThe customer confirmed they were not following the matter up with Australia Post. (Getty)\n\nIn follow-up replies, the customer clarified their package had weighed about 9 to 10 kilograms, well within delivery limits.\n\nThey also said ﻿they had since taken possession of their package.\n\n\"Hell, I barely even lodged a minor complaint at the office and haven't even called up auspost (sic) to back it,\" they said.\n\n\"I don't plan on pursuing it because there's no point, it'd only create more negativity and I already have my package.\"\n\nAn Australia Post spokesperson said delivery drivers were subject to \"strict protocols\", which required them to knock three times and wait 30 seconds.﻿\n\n\"Drivers are also required to take a photo of the front door or intercom, and photos can be viewed through the Aus Post app,\" the spokesperson said.\n\n\"Customers with any concerns about their delivery are encouraged to contact Australia Post via our website ( auspost.com.au ) or calling 13 POST (13 76 78).\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/bluey-christmas-coin-2025-fans-wait-up-to-18-hours-for-collectible/d871ae74-abde-4902-9ea6-72cb2bfa5070",
        "title": "'Are you at work?': Bluey fans wait up to 18 hours for a coin",
        "publish_date": "Thu, 16 Oct 2025 11:11:31 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Hundreds of Bluey fans have lined up overnight, some for 18 hours, to get their paws on new Christmas collectable coins.\n\nThe coveted silver coin sold out in minutes when the Perth Mint opened its doors to a stampede this morning.\n\n\"People want them - demand is significantly outstripping supply,\" chief executive Paul Graham said.\n\nREAD MORE: Horror in broad daylight as woman walks to work in Melbourne\n\nGeorgie waited 18 hours at the front of the line, dressed in Bluey gear from her dog-ears headband right down to her themed crocs, to make sure she didn't miss out. (9News)\n\nThe coin was released by the Royal Australian Mint but Perth Mint is one of the﻿ authorised distributors.\n\nGeorgie waited 18 hours at the front of the line, dressed in Bluey gear from her dog-ears headband right down to her themed Crocs, to make sure she didn't miss out.\n\nThe Heeler family superfan Georgie said she was \"excited, tired, and relieved, yeah, that I got one\".\n\nThe 2025 release features a gold and a silver coin stamped with Bluey and Bingo in festive hats.\n\nThe excitement in the queue was palpable.\n\n\"[I'm] just excited to get that coin in my hand,\" one fan said.\n\nThe 2025 release features a gold and a silver coin stamped with Bluey and Bingo in festive hats. (9News)\n\n\"It's just like getting candy really.\"\n\nOne man was even juggling work whilst waiting, breaking away from a video call briefly to say hi to 9News.\n\n\"Are you at work right now?\"\n\n\"Yes I am,\" he replied with a laugh.\n\nThe gold Bluey coin will set you back $20, while the silver one cost $100 but sold out in just 20 minutes.\n\nThe gold Bluey coin will set you back $20, while the silver one cost $100 but sold out in just 20 minutes. (9News)\n\n\"I bought the last one, that's fantastic,\" one man said.\n\n\"I'm so happy, I was waiting so long and it's just fabulous.\"\n\nFor collectors it's money well spent but for parents, it's another pricey addition to the Christmas list.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-17/albanese-trump-chalmers-critical-minerals-deal/105903392",
        "title": "'No doubt' Albanese and Trump will discuss critical minerals: Chalmers",
        "publish_date": "Fri, 17 Oct 2025 01:44:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "A critical minerals deal will \"no doubt\" be part of discussions between Anthony Albanese and Donald Trump next week, the treasurer has confirmed.\n\nSpeaking from Washington, where he is meeting American counterparts ahead of the prime minister's official visit next week, Jim Chalmers said Australia could be a \"reliable partner\" of the valuable commodities as the US seeks alternative buyers in a market dominated by China.\n\n\"We know that American companies desperately need critical minerals, and Australia is very well placed to service that need,\" he said.\n\n\"This will be an important part of the discussions that I have … and no doubt it will be part of the discussions that Prime Minister Albanese has with President Trump next week.\"\n\nJim Chalmers travelled to the United States for talks ahead of the prime minister's arrival. (ABC News: Callum Flinn)\n\nThe cluster of prized metals, which Australia has in abundance but does not yet sell at scale, have long been speculated as an enticing offering for a president who takes an unapologetically transactional approach to diplomacy.\n\nLast week, trade minister Don Farrell said his US counterpart had raised the issue with him and that a deal would be struck \"one of these days\", suggesting it would involve some sort of US investment to help make Australian mining operations viable, in exchange for some form of guaranteed US access to what was extracted.\n\nThe issue has gained further prominence in recent weeks after Chinese threats to use its dominance to control the supply of the minerals, which are important for renewable technology and artificial intelligence.\n\nThe US also requires the minerals for most of its weapons.\n\nEarlier this week, US Treasury Secretary Scott Bessent called China's move \"an exercise in economic coercion on every country in the world\" and a step towards \"decoupling\" between China and the west.\n\nAs China flexes dominance on rare earths, Australia sees an opening Trump may have expressed \"shock\", but his administration is clearly not surprised at China's willingness to flex its dominance on rare earths.\n\nMr Bessent vowed to speak with allies, including Australia, on \"a fulsome group response\".\n\n\"China cannot manage the supply chain or the manufacturing process for the rest of the world,\" he told US network CNBC.\n\nMr Chalmers said Australia's interests were \"best served by more trade, not by more trade barriers\".\n\n\"We will engage with our partners to make sure that we can be a very reliable supplier to meet the critical minerals needs of this country, here in the US and other markets around the world,\" he said.\n\nHe said Australia was concerned that the market for critical minerals was not as reliable and robust as it could be when it came to the supply chains.\n\n\"Australia's got a lot to offer to the world,\" he said.\n\nSubsidising a new mining boom\n\nTo grow the domestic industry, the Australian government has been considering subsidising the production and sale of critical minerals operations to give would-be mining investors the confidence they would otherwise lack.\n\nOn the production side, it already offers a variety of tax credits and cash injections under the banner of its industry support regime Future Made in Australia, which has a particular emphasis on \"green\" applications for the metals.\n\nOn the sale side, it has pledged $1.2 billion for a \"strategic reserve\" of the minerals, slated for next year but still in its design phase.\n\nUS wants Australia's rare earths As rare earths re-emerge as a central battleground in the US-China trade war, Australian companies are already striking deals to supply America.\n\nThough this may include a physical stockpile, it is more likely to be an assurance that miners will receive a minimum price for what they can produce.\n\nMiners could then strike future purchase agreements with buyers, backed by the comfort that the government would make good on the minimum price if market conditions were unfavourable.\n\nThe government's involvement may take the form of a financial derivative, a \"paper promise\" to make up any price shortfall, but where the government would itself profit if the price was higher than expected.\n\nWhile the idea of price security was that it would create the space for Australian miners to enter into voluntary and profitable deals with foreign buyers, the government intended to partner with its allies to guide that process along.\n\nThis is where the US could come in, perhaps agreeing to invest in mining operations in exchange for some sort of preferential access to what those operations produce. Similar discussions are already underway with Japan, South Korea, and Europe.\n\nChina's threats to exert greater control over not just the export and refinement of minerals, but also their applications, has catapulted the issue to front of mind for the US government, which has begun stockpiling minerals with defence applications.\n\nWhile it has a variety of options for a variety of minerals, including Canada and South America, Australia's reserves have been raised through official channels and have been linked to securing Australian exemptions from the Trump administration's tariffs.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-17/virtual-emergency-department-option-for-patients-remote-areas/105371852",
        "title": "Virtual service gives patients easy access to emergency department",
        "publish_date": "Thu, 16 Oct 2025 23:54:50 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When seven-year-old Jaxx Atkinson woke one August night struggling to breathe, his mother Brooke knew he needed help fast.\n\nShe called triple-0 and paramedics arrived and quickly stabilised her son.\n\nBut for a moment, it was every parent's worst nightmare.\n\n\"He was really freaking himself out because he couldn't get a breath in,\" Ms Atkinson said.\n\nThe paramedics determined Jaxx did not need to go to hospital, but should see a doctor.\n\n\n\nThat meant a 20-minute drive from the family's Newborough home to the local hospital in Traralgon, Gippsland.\n\nWith another young child asleep in the next room, a long emergency department wait was not appealing.\n\nSo when the Ambulance Victoria paramedic showed Ms Atkinson the Victorian Virtual Emergency Department service she could access from home, it was a relief.\n\n\"I didn't think [Jaxx] would go in an ambulance by himself, and I've got [other son] Zavier here too,\" she said.\n\n\"We opted for the virtual ED … it was so much easier than sitting in a waiting room.\"\n\nOnline assistance\n\nThe Virtual Emergency Department is an online service run by the state government and Ambulance Victoria in conjunction with Melbourne's Northern Health.\n\nIt connects patients in remote areas with doctors, and is designed to triage patients with non-life threatening conditions.\n\nThe free service is available at all hours, and can be used by paramedics and the public.\n\nBrooke, Jaxx and Zavier Atkinson reunite with paramedic Jamik Chauchan. (ABC Gippsland: Madeleine Stuchbery)\n\nJamik Chauchan was one of the paramedics who treated Jaxx.\n\nHe showed Ms Atkinson the virtual emergency department before being called to another job.\n\nAmanda Burnside was the doctor who treated Jaxx remotely.\n\nShe said the virtual emergency resource worked as a lifeline for patients late at night or early in the morning, especially for parents with other children at home.\n\n\"I know in the Gippsland region, access to GPs is quite tricky, there are often long wait times,\" Dr Burnside said.\n\n\"We're kind of covering that gap and helping out those local resources to take the pressure off a little bit.\"\n\nAmbulance Victoria director regional and clinical operations for Gippsland, Ross Salathiel, said the virtual ED helped provide timely care to patients.\n\n\"By using [the service], it helps keep our ambulances ready and available for the sickest patients, particularly those with life-threatening conditions,\" Mr Salathiel said.\n\nThe tyranny of distance\n\nNational Rural Health Alliance chief executive Susi Tegen said about 30 per cent of Australians lived in rural, remote and regional areas and experienced inequity in health funding.\n\n\"For communities and areas like Bairnsdale [three hours east of Melbourne], the underspend on health, medical, disability and aging care access is up to $4,000 per person per annum less,\" she said.\n\nSusi Tegen says digital technology can help bridge rural healthcare gaps, but greater investment in the regions is needed. (Supplied: National Rural Health Alliance)\n\nData from 2023-24 shows people living regionally are 36.3 per cent more likely to face long wait times to access a GP appointment, while 46 per cent of patients nationwide waited more than 24 hours for urgent medical care.\n\nMs Tegen said state and federal funding did not account for the tyranny of distance in rural healthcare\n\nShe said while digital technology \"has its place\" in diagnosis and treatment, it was not a complete solution.\n\n\"Digital healthcare solutions are a welcome efficiency and access tool, indeed enabler,\" Ms Tegen said.\n\n\"However, [they are] not the only and best solution for the development and sustainability of our health and medical workforce, nor will it ensure equitable quality healthcare access for our rural populations.\"\n\nParamedic Jamik Chauchan is reunited with patient, Jaxx Atkinson. (ABC Gippsland: Madeleine Stuchbery)\n\nDr Burnside said there was \"room to grow\" when it came to patient uptake of virtual clinics.\n\n\"We're more than happy to see more people,\" she said.\n\n\"We're still growing by the day, and I think it was a pretty tough flu season this winter and we saw lots of people with influenza coming through.\n\n\"We're able to help to, assess them, and provide some treatment and keep them at home and hopefully out of the emergency department.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-17/sa-education-department-fined-playground-swing-fall/105900366",
        "title": "Teen's playground fall costs department $225K fine for failed inspections",
        "publish_date": "Thu, 16 Oct 2025 23:44:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "South Australia's Education Department has been fined more than $200,000 after a student suffered serious facial injuries when a \"severely worn\" bolt broke on a swing in a school playground, throwing him to the ground.\n\nA ruling handed down by SA's Employment Tribunal found the swing, at a Port Augusta Special School, had not been \"comprehensively\" inspected in the eight years prior to the August 2021 incident.\n\nThe tribunal's deputy president Stephen Lieschke said 95 per cent of the bolt — one of two which supported the swings chains — had gradually \"worn away without anyone ever inspecting it\".\n\n\"The worn bolt was observable on a visual inspection of the swing's moving parts,\" he said.\n\nHe said Australian standards required quarterly inspections, but \"the defendant did not have a system for ensuring\" all of its playgrounds in South Australia were included in its centrally controlled inspection and maintenance programs.\n\n\"None of the school's playground equipment was ever given a comprehensive annual inspection in the eight years prior to the offence,\" Mr Lieschke said.\n\n\"Nor did any of the quarterly inspections include the load bearing moving parts of the swings.\"\n\nThe bolt on the swing gradually wore away in the years before the student was injured. (Supplied: SafeWork SA)\n\nInstead, he said after the playground was installed in 2012 \"daily and quarterly visual inspections were recorded on only five occasions between April 2018 and January 2021\".\n\n\"There is no evidence the critical load bearing moving parts of the swing were ever inspected on these occasions.\"\n\nHe said testing later revealed there was no manufacturing defect in the worn bolt.\n\nThe ruling notes the teenager was \"thrown\" from the swing when the bolt failed and landed on his head, suffering injuries to his face, forehead eyes and nose.\n\nThe 16-year-old was initially treated at the Port Augusta Hospital before being flown to the Royal Adelaide Hospital for surgery.\n\nMr Lieschke said the boy's father provided a victim impact statement to the tribunal and described his son's injuries as \"horrific\", with his scars \"a constant reminder of the incident\".\n\nHe said a department representative told the tribunal the playground was immediately fenced off and later decommissioned, before a new one costing about $290,000 was installed.\n\n\"The seriousness is aggravated by the defendant placing a particularly vulnerable group of disabled children at risk of serious injury over a long period,\" the deputy president said.\n\nThe tribunal found the Department for Education did not have a system for ensuring all of its playgrounds were inspected as required. (Supplied: SA Government website)\n\nAccording to the ruling, at the time of the incident \"only 360\" of the department's playgrounds \"were then being inspected as required\".\n\nMr Lieschke said the responsibility for playground equipment inspections was delegated to school principals \"without conveying this expectation\" or ensuring they occurred.\n\n\"The defendant had no system of reviewing, checking or auditing to ensure that all playgrounds were included in its centrally controlled inspection and maintenance program,\" he said.\n\n\" The department's existing safety policy for ensuring the inspection and maintenance of potentially dangerous playground equipment was little more than aspirational. \"\n\nHe said the department's \"considered refusal\" to pay the student compensation was \"a poor response to its criminal conduct\".\n\nHe noted an agreement for compensation was later reached, but said the department had \"demonstrated very little regard for its victim's welfare, and thereby, a lack of contrition\".\n\nThe department, who had pleaded guilty to breaching its safety, was convicted and fined $225,000.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-17/swimming-ariarne-titmus-retirement-press-conference/105902788",
        "title": "Titmus admits she lost the 'fire in the belly' before shock retirement",
        "publish_date": "Thu, 16 Oct 2025 23:19:12 +0000",
        "category": "sports",
        "authors": [],
        "text": "Four-time Olympic gold medallist Ariarne Titmus has revealed she realised she \"did not have the fire in the belly in anymore\" before deciding to retire from swimming.\n\nTitmus fought back tears as she spoke at Brisbane's New Farm Park on Friday morning, 24 hours after making what she described as \"probably the toughest decision of my life\".\n\nFollowing her triumphant Olympic campaign in Paris last year, Titmus took some time away from the pool and said she did not want to \"half-arse\" a return to competitive swimming.\n\nLive Moment Ariarne Titmus speaks publicly for the first time since announcing her retirement from professional swimming at 25. Au revoir, Arnie! And just like that we're done! Best of luck to Ariarne Titmus on her next chapter. After hearing her speak, there is no question in my mind that she's made the right call. Good on her. Thank you all for following along! Some tears to end the press conference Titmus is asked about whether it is \"lovely\" to be entering the next chapter of her life, and starts saying she is \"very happy\" in her personal live and begins to fight back tears. Surprised by interest in retirement news Titmus is so incredibly humble. She says she was taken aback by the reaction and interest in her retirement. \"I couldn't believe how quickly it became news and I don't know, [I was] so overwhelmed with how many messages I have had,\" she says. Show more\n\nTitmus said she was not \"nervous or scared\" to tell her coach Dean Boxall about her plans to retire.\n\n\"I was half expecting him [Boxall] to try and twist my leg to bring me back, and that probably would have been selfish for his part because obviously he did not want me to stop, our partnership has been so fun but he was the opposite,\" she said.\n\n\"He was so happy for me and proud of me and could see that I had so much to look forward to in my life and was happy to support me.\"\n\nTitmus described her retirement as \"a big weight off my shoulders\" and remained defiant about her decision, saying people \"should not question whether I made the right decision or not\".\n\nTitmus said long-time American rival Katie Ledecky (left) was one of the first people to congratulate her on her retirement. (Getty Images: Quinn Rooney)\n\n\"At the end of the day, it is a decision about my life and I have to do what makes me happy,\" she said.\n\n\"People can have their own thoughts on those things but I know I am content with this.\n\n\" I don't think you realise how difficult it is until you remove yourself from the environment and it is hard going into Olympic Games as favourite and rising to the challenge and defending your title. \"\n\nShe described US rival Katie Ledecky as her \"Goliath\", revealing the American had been one of the first people to congratulate her on her career.\n\n\"I feel really proud of that relationship we have because it goes to show you can leave everything in the pool and still be a good person when you are not racing, so I hope I have left that legacy as well,\" she said.\n\nTitmus said she plans to pursue a career in broadcasting in swimming and other sports, embracing the chance to \"do things that I have never done before\". She hopes to be a part of the broadcast at the Los Angeles Olympics in 2028.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-17/king-charles-commemorates-40th-anniversary-of-uluru-handback/105902056",
        "title": "King Charles marks land rights milestone in first visit to London's Australia House",
        "publish_date": "Thu, 16 Oct 2025 23:18:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "King Charles has marked a major Aboriginal land rights milestone alongside Uluru-Kata Tjuta's traditional owners.\n\nHe attended a commemoration for the 40th anniversary of the Uluru handback in his first visit to London's Australia House since he became king.\n\nOn October 26, 1985, the Commonwealth government handed the title deeds for Uluru-Kata Tjuta back to its traditional owners, known as Anangu.\n\nTraditional owners say they want to keep their culture alive and strong for future generations. (Reuters: Jack Taylor)\n\n\"It sort of brings us into tears and sadness, but happiness as well,\" Sammy Wilson said via interpreter and fellow traditional owner Harry Wilson.\n\nThey were among a group of nine Anangu who swapped the red dirt of the outback for the marble floors of Australia House for the commemoration.\n\nNine Anangu commemorated the anniversary alongside the king. (Reuters: Jack Taylor)\n\nAustralia's High Commissioner to the UK, Stephen Smith, said the monarch's attendance was a symbol of profound respect for Anangu.\n\n\"When the king engages in anniversary events, normally the palace looks at 50 or 100 year anniversaries,\" Mr Smith said.\n\n\" So the fact that we're doing this on the 40th anniversary tells you this was something special. \"\n\nStephen Smith said the monarch's attendance was a symbol of profound respect for Anangu. (Reuters: Jack Taylor)\n\nThe long road to the handback\n\nThe first step towards the handback was taken in 1976, when the Australian government passed the Aboriginal Land Rights (Northern Territory) Act.\n\nFor the first time Indigenous Australians had a legal pathway to claim land where traditional ownership could be proven.\n\nThe first step towards the handback was taken in 1976. (Reuters: Stefica Bikes)\n\nNine years later the Hawke government handed back the title deeds for the Uluru-Kata Tjuta National Park.\n\nHundreds gathered to watch the ceremony in front of Uluru.\n\n\"For all Aboriginal people right around Australia, a very important day,\" the event's emcee told the cheering crowd.\n\nBut not everyone was so enthusiastic.\n\nKing Charles met with Uluru-Kata Tjuta's traditional owners, who hope there might be another royal visit to Australia on the cards. (Supplied: Mark Hilton)\n\nThe NT's then-leader Ian Tuxworth campaigned against the handback and unsuccessfully demanded that the Commonwealth hand Uluru to the Territory government.\n\nThen-federal opposition leader John Howard suggested there could be a need to buy it back in the future.\n\nNeither proposal was successful.\n\nThe dissenters have long fallen silent and traditional ownership has flourished.\n\nKing Charles joined guests to watch a traditional performance at the Australian High Commission in London. (Reuters: Jack Taylor)\n\n\"Our vision for the national park is that it is a place where Tjukurpa – Aṉangu law and culture – can be kept strong for future generations,\" said Tapaya Edwards, chair of the Uluṟu-Kata Tjuṯa National Park's board of management.\n\n\"There is still much work to be done and, over the next 40 years, we look forward to seeing our young people carry this flame forward as they learn Aṉangu traditional knowledge and Western knowledge to care for country and keep Tjukurpa strong.\"\n\nRumours of a royal return\n\nThe traditional owners, who are preparing to make the long trip back to Australia, say they hope there will be a royal return to Uluru.\n\nKing Charles visited the National Park in 1983, before the handover, followed by Prince William and Princess Catherine in 2014.\n\nNine Anangu met with King Charles at Australia House. (Supplied: Mark Hilton)\n\nThe Anangu delegation in London remembered the latter trip fondly.\n\n\"Sammy actually took Kate and William on a tour in the previous years when they visited last time at Uluru,\" Mr Wilson said.\n\n\"Sammy spoke to him [Prince William] and said, 'Would you like to come back in the future?' And he said, 'I will come back.' And now he's coming back, I reckon.\"\n\nPrincess Catherine and Prince William visited Uluru in 2014. (Reuters: Phil Noble)\n\nThe comments come amid growing rumours of a royal tour of Australia.\n\n\"That would be a matter for the palace and a matter for the Department of Prime Minister and Cabinet,\" Mr Smith said with a smile.\n\nIn the meantime, the Anangu will return home for the anniversary, where the prime minister will join them for celebrations on country.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-17/transgrid-broken-hill-outage-one-year-on/105893212",
        "title": "Outback communities reflect on actions taken one year on from power outages",
        "publish_date": "Thu, 16 Oct 2025 23:09:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "A year ago a freak weather event flattened seven power transmission towers and plunged thousands of homes and businesses throughout far west New South Wales into darkness for several weeks.\n\nAbigail Hughes's cafe was one of more than 10,000 homes and businesses in Broken Hill and outlying towns hit hard by the outage.\n\n\"We lost over $30,000 as a whole, so that was pretty full on,\" Ms Hughes said.\n\n\"I would say we've tried to recoup that, but that's only been through a lot of hard work and sacrifice.\"\n\nLocal cafe owner Abigail Hughes says it's been a long road to recovery. (ABC Broken Hill: Oliver Brown)\n\n\"We were affected pretty heavily, we lost quite a few days' trade, as did everybody.\"\n\nFellow business owner David Trinder had similar losses of about $20,000 through lost trade, expired stock and the resulting clean-up.\n\nHe said that while he attempted to claim some of this money back through insurance, the administrative task was too exhausting to finalise.\n\n\"Coming off the back of previous insurance claims with all the hailstorms in 2016, all the premiums had gone up,\" Mr Trinder said.\n\nLoading...\n\n\"So when we all came in for this claim, trying to legitimise everything was like pulling teeth [because] they wanted every detail, pictures, to quantify profit and losses.\n\n\"You can imagine trying to get that information to them and run your business, rather than coming to some negotiated settlement of reasonableness. It wasn't working.\n\n\"So we've actually moved on, and we didn't get any claim from [the blackouts].\"\n\nThe blackouts also forced the city's largest employer, the mines, to stand down hundreds of its workers until the main supply was restored.\n\nDavid and Maryanne Trinder felt the process of reclaiming their losses was exhausting. (ABC Broken Hill: Youssef Saudie)\n\nFlawed backup system\n\nWithin days of the outage, the NSW government declared it a natural disaster.\n\nThe situation was worsened by one of the city's two diesel-powered emergency back-up generators being offline for maintenance, leaving the other unable to cope with demand.\n\nWhile smaller generators were transported to affected communities over time, it meant some areas experienced further rolling blackouts, some of them lasting days.\n\nBroken Hill resident Rita Bruggy, 77, said this, coupled with poor community consultation, was a failure on the part of privately-owned network operator Transgrid.\n\n\"Being the organisation that they are, I feel that Transgrid could have done more, and they should do more with the upkeep of their generators,\" she said.\n\nRita Bruggy and her husband Michael [left] believe Transgrid has a lot to answer for. (ABC Broken Hill: Oliver Brown)\n\n\"It might cost you a dollar [but] we're paying for it, and we want a service.\"\n\nTransgrid, aided by Essential Energy, installed temporary transmission towers to restore the main supply in the weeks following, before erecting permanent replacements earlier this year.\n\nLessons learned?\n\nTransgrid general manager of operations and maintenance Sam Pickering said the organisation was in a much better position than it was 12 months ago.\n\n\"That gas turbine that was unavailable is now fully refurbished and available after extensive works,\" he said.\n\n\"We've also brought in portable generation to further provide that back-up supply and strengthen our network resilience.\"\n\nTransgird’s general manager of operations and maintenance Sam Pickering. (ABC Broken Hill: Coquohalla Connor)\n\nA NSW government spokesperson said it had rolled out more than $2.5 million in financial and in-kind support through individual and small business grants, food and fuel vouchers and food hampers.\n\nThe NSW Reconstruction Authority also established a Recovery Assistance Point in Broken Hill and conducted outreach to surrounding communities also affected, including Wilcannia, Menindee and White Cliffs.\n\nInvestigations ongoing\n\nWhile the days and weeks following the blackouts were dedicated to retaining a consistent power supply and community recovery, the months to come were just as busy.\n\nThe NSW Parliament, the NSW Independent Pricing and Regulatory Tribunal (IPART) and the Australian Energy Regulator (AER) each launched independent inquiries with different focuses.\n\nOnly one, headed up by the Legislative Assembly Committee on Environment and Planning, has publicly handed down its findings based on a range of online and in person submissions.\n\nIPART's Jonathon Coppel says its inquiry into the outage is progressing well. (Supplied: IPART)\n\nOne of the key recommendations was that electricity companies that breached their licences should be forced to compensate affected customers.\n\nIPART is yet to determine if the actions of Transgrid warranted a breach.\n\nMember Jonathon Coppel said their investigation had been \"complex and quite technical\", but at the same time it was \"well-progressed\".\n\nMeanwhile, a spokesperson for the AER said its own investigation into whether Transgrid breached the National Electricity Rules would be concluded in the coming months.\n\nCommunities need more than nice words\n\nAccording to the Bureau of Meteorology (BOM), the outage was caused by two supercell thunderstorms, and possibly a tornado.\n\nBut without direct evidence from radar or damage reports, it was hard to know for sure, as well as the likelihood of a similar damaging weather event happening again in the future.\n\nBroken Hill Mayor Tom Kennedy said he was comfortable things were moving in the right direction to ensure a similar aftermath was avoided, but there was a lot to do.\n\n\"Some of the findings and some of the things that will come out of the inquiries will easily transfer to everywhere in the country and make it a lot better for the whole of NSW and the country,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-17/coronado-curragh-fined-for-death-of-worker-clark-peadon/105893210",
        "title": "Union criticises fine for mining company over worker's death",
        "publish_date": "Thu, 16 Oct 2025 22:45:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "A Queensland mining union says an $80,000 fine handed to an international mining company this week is not enough of a deterrent for companies to avoid putting workers in unsafe situations.\n\nInternational mining giant Coronado Global Resources, through its subsidiary Coronado Curragh, was fined $80,000, plus court costs of $28,572.78, in Rockhampton Magistrates Court on Wednesday over the death of a worker in November 2021.\n\nNo conviction was recorded.\n\nThe fine was for breaching health and safety obligations under the Coal Mining and Safety Act 1999 after experienced worker Clark Peadon, 54, died on site at the Curragh North open-cut mine, north of Blackwater.\n\nThe company was charged three years after the incident, with the maximum penalty under the Act $689,250.\n\nMitch Hughes described the fine as appalling for the loss of someone's life. (ABC Tropical North: Abbey Halter)\n\nMining and Energy Union Queensland district president Mitch Hughes said while he understood the courts were limited by the penalties they could issue, the fine was not enough.\n\n\"To sit here and see that they've only been given an $80,000 fine for someone's life is pretty inadequate in our view,\" he said.\n\nAccording to Queensland government data, in the past five years seven Queensland coal mine workers have died.\n\n\"If the government and the minister and the regulator want to do something about deterring companies from putting workers in unsafe situations, then that's probably a good place to start, is looking at increasing the penalties that are available,\" Mr Hughes said.\n\nNew safety technology introduced\n\nCurragh mine in central Queensland. (ABC News: Jemima Burt)\n\nAt the time of the accident, Mr Peadon was conducting cable relocation work when he was crushed by a dragline shoe.\n\nCourt documents show the company has spent $5 million over the past three years on developing an industry-first engineering system to prevent precisely the type of incident from occurring again.\n\nThe Proximity Awareness System (PAS) uses three different sensing technologies — optical, light detection and ranging and radar — to create three bands of detection and vision around the dragline to automatically stop it from operating if it senses a person's presence in that area.\n\nThe documents show this system has been installed on three of the four draglines at the mine site, with the fourth to be installed next year.\n\nPeer mining companies and RSHQ have also visited the mine to view the PAS in operation.\n\nAs part of its defence, the company said it had also reviewed and added new safety procedures following the accident.\n\nMore improvements needed\n\nMore than 2,000 workers are employed at the Curragh mine in the Bowen Basin.\n\nCoronado Curragh took ownership of the Curragh North mine seven years ago and employs 400 workers and 2,000 contractors.\n\nEighteen months prior to Mr Peadon's death, another worker also died at the Curragh mine site.\n\nDonald Rabbit, 33, died in January 2020 when he was trapped by a heavy falling tyre and rim.\n\nCoronado Curragh and mining contractor Thiess were initially charged with breaching the Coal Mining Safety and Health Act 1999, but all charges were later dropped.\n\nMr Hughes said while there had been some safety improvements for miners since Mr Peadon's death, more needed to be done.\n\n\"We have sadly still seen fatalities occur,\" he said.\n\n\"The work to improve health and safety for all coal mine work has never stopped.\n\n\"We've obviously got to look at these investigations and determine some outcomes to prevent them happening again.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-17/mclaren-papaya-rules-oscar-piastri-lando-norris-f1/105855110",
        "title": "Team orders are out of the window, Oscar can now play by 'Piastri rules'",
        "publish_date": "Thu, 16 Oct 2025 21:44:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "If Formula 1 — like many of the world's pre-eminent dictionaries — had a word or phrase of the year, 2025's winner would be \"Papaya rules\".\n\nIt is the mythical code that McLaren has adhered to like a sacred text for the past two seasons, as the former backmarker rose to the top of F1.\n\nPapaya rules has ensured drivers Oscar Piastri and Lando Norris achieved maximum points for the team every weekend, en route to back-to-back F1 constructors' championships.\n\nPapaya rules is built on three cornerstones:\n\nDo what is best for the team\n\nDo not crash into each other\n\nEnsure both drivers have a fair playing field\n\nUntil now, papaya rules has worked on the same principle that governs antiques: it only has value if others place value on it.\n\n'That's not fair': Piastri's F1 lead cut after Norris makes lap one contact Oscar Piastri has been left furious at his teammate, and his team, after his two drivers' championship rivals gained ground on him in the Formula 1 Singapore Grand Prix.\n\nPiastri and Norris, until now, have placed value on papaya rules.\n\nIt is why Norris let Piastri overtake him for the lead in Hungary 2024, when McLaren's pit strategy allowed the Brit to emerge in front after being behind the Australian by several seconds.\n\nIt is why Piastri allowed Norris to retake second place in Monza this year, after a slow pit stop for the Brit had allowed the Australian to overtake him late in the race.\n\nBut after the Singapore Grand Prix, Piastri may have lessened the value he places on papaya rules.\n\nThe Australian was left ropeable in the cockpit after his teammate overshot the third corner of the grand prix, clipped the back of Max Verstappen in front, then clattered into the side of Piastri.\n\nThe hit to the side of Piastri's McLaren could have sent the Australian into the barrier, but it certainly helped Norris move into third place.\n\nPiastri bemoaned over team radio that they should tell Norris to give the place back.\n\n\"That's not fair, I'm sorry. That's not fair,\" Piastri said over his radio.\n\n\"If he has to avoid another car by crashing into his teammate, then that's a pretty s*** job at avoiding.\"\n\nIn any other team, Norris's move on Piastri would be fair game. It was an aggressive move for position by a driver who wants to win the world championship.\n\nLoading Instagram content\n\nNorris's move, while not the cleanest, is no different from many that the likes of Verstappen, Ayrton Senna and Michael Schumacher have been praised for.\n\nBut in the world of papaya rules, Norris breached two of its cornerstones.\n\nNorris made contact with a teammate, and, in Piastri's mind, the Australian was unfairly penalised.\n\nFor Piastri, this was the time for papaya rules to ensure he was not disadvantaged — but it never came.\n\nThe Australian was furious in the car, cut a frustrated figure in the media pen, and watched his lead in the drivers' championship narrow to 22 points.\n\nThis is not the first time in 2025 that Piastri's call for papaya rules fell on deaf ears.\n\nHe was denied victory in the British Grand Prix due to a penalty that McLaren argued against. Despite believing Piastri's penalty was unjust, they did not tell Norris to give the lead of the race back to the Australian — something Piastri himself requested.\n\nPiastri finished second to Norris in Hungary this year after McLaren — unbeknownst to him at the time — put the Brit on a better pit strategy than the Australian. Then at Imola, another advantageous pit strategy for Norris, who was behind Piastri, allowed the Brit again to finish ahead of him.\n\nPiastri has had his share of fortune this year, but none that necessitated the McLaren team needing to make a decision.\n\nFuelled by the disappointment of Singapore, the Australian may now be able to free himself from the papaya rules burden and play by \"Piastri rules\".\n\nPiastri rules are built on one basic principle — excellence on track.\n\nF1 title battle explained Formula 1 returns to the United States, officially marking the final quarter of an epic 2025 championship. Here is what is to come.\n\nDespite finishing behind Norris, and other title rival Verstappen, in the previous three grands prix, Piastri still holds a solid advantage of 22 and 63 points over his rivals.\n\nHe has won seven grands prix this season, more than any other driver.\n\nIn qualifying, he has been faster than Norris in 10 of the 18 grand prix shootouts. The Australian has been faster than Norris in all three qualifying sessions for sprint races as well.\n\nSprint weekends have been a strength for Piastri in 2025. He has finished second in all three sprint races this season, and then gone on to win the grand prix the following day.\n\nOf the six weekends left this season, three involve a sprint race, including this weekend's action in Austin, Texas.\n\nPiastri's excellence is not only measured in wins and podiums.\n\nTwice he has been awarded F1's Overtake of the Month.\n\nHis overtake in March of Lewis Hamilton on the final lap in Melbourne, after spinning out of second place earlier in the race, showed character and grit.\n\nIn April, Piastri showed supreme confidence through the narrow streets of Jeddah to again pass Hamilton, in a section of track not associated with overtaking.\n\nIt is these triumphs that have the Australian in a position to win a maiden world championship.\n\nNo papaya rules. No team orders. Just raw pace and excellence on track — Piastri rules.\n\nShould Piastri be able to part ways with the disappointment of Singapore and maintain the driving that has earned him a championship lead this late in the season, he will be in the prime position to achieve the ultimate prize.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-17/nicheliving-customers-continue-to-find-defects/105899574",
        "title": "Leaking pipes, fallen ceilings and black mould plague housing development",
        "publish_date": "Thu, 16 Oct 2025 21:27:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "After spending three years living in a caravan with her two children, Nicheliving customer Kathy Ellis thought her nightmare was finally over in July, only to discover water pouring from the ceiling shortly after she moved into her new home.\n\nOne bathroom in the house is now unusable, sections of the house have black mould, and some walls and ceilings have collapsed due to water damage.\n\nMs Ellis was among the hundreds caught in the Nicheliving building crisis after the company took years longer than promised to complete their homes.\n\nIt ended late last year when the state government reached an agreement with Nicheliving directors Ronnie Michel-Elhaj and Paul Bitdorf to surrender their building licence.\n\nIn return, customers with incomplete homes would be allowed to access building indemnity insurance payments of $200,000 to complete their homes.\n\nSome of the mould growing in Kathy Ellis's house. (Supplied: Kathy Ellis)\n\nInspections have since revealed that the appropriate plumbing pipe was not installed in Ms Ellis's house.\n\n\"They've actually used communications PVC pipe and none of the joins are glued together,\" Ms Ellis told Nadia Mitsopoulos on ABC Radio Perth.\n\nA full inspection by the regulator, Building and Energy, has revealed 10 breaches by the plumber Nicheliving appointed to do the work.\n\nThe report reveals that some pipes are flowing in the wrong direction, the size of the connections is wrong, pipes are at incorrect angles, and pipe joints are not watertight.\n\n\"It's on the severe side of serious. The inspectors that came out spent many hours at my house looking over it, and they said that even they were surprised at how many breaches they found just in one house,\" she said.\n\n\"I currently have no ceilings in the living area of my house. One bathroom, we can't use at all.\n\n\"The other bathroom we can use, but we have to have very quick showers.\n\n\" Luckily, when the ceilings fell down … all the mould got taken outside in that area. \"\n\nPlumber ordered to fix work\n\nBuilding and Energy have now issued a rectification order to the plumber who did the work.\n\n\"He has the option not to do as ordered, but then I'm presuming the plumber's licensing board will have a lot to say about that if he doesn't,\" Ms Ellis said.\n\nIf he does come back and repair the plumbing, Ms Ellis will still have to cover the cost of the damage caused to other parts of the house herself.\n\nShe said the indemnity payment would cover some of the estimated $60,000 cost, but she will have to pay out around $20,000 herself.\n\nBlack mould is blooming in a cornice at Kathy Ellis's new house. (Supplied: Kathy Ellis)\n\n'A terrible period of life'\n\nPeter Bentley went through a similar experience with Nicheliving and eventually had his house completed by another builder.\n\n\"Our second builder went through our Niche build and managed to find all the problems and rectify them before we finished the build, which was great, but very expensive,\" he said.\n\n\"There was multiple, problems, embarrassing building problems, including having to replace the roof.\n\n\"The plumbing and brickwork were terrible.\"\n\nNicheliving loses legal authority to complete home builds A Perth home builder with scores of unfinished projects on the books is no longer able to legally undertake construction works.\n\nThe house was finished three years past the original completion date.\n\nMr Bentley said his family eventually moved into the finished house for a short period before selling it.\n\n\"We were just so disturbed by the entire process. So we've sold it and moved on.\n\n\"We're not suffering as a result of any of this, compared to others\n\n\"Nonetheless, it was a terrible period of life for us and for a whole lot of other people.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/ozharvest-and-woolies-reach-incredible-food-rescue-milestone-20251017-p5n3b3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "OzHarvest and Woolies reach incredible food rescue milestone",
        "publish_date": "Fri, 17 Oct 2025 12:40:43 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "OzHarvest and Woolies reach incredible food rescue milestone\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/titmus-opens-up-on-shock-retirement-and-what-s-next-for-the-swimming-superstar-20251017-p5n38z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Titmus opens up on shock retirement and what’s next for the swimming superstar",
        "publish_date": "Fri, 17 Oct 2025 12:34:36 +1100",
        "category": "sports",
        "authors": [
            "William Davis"
        ],
        "text": "Ariarne Titmus says there was nothing left for her to achieve after the 25-year-old Olympic superstar shocked the sporting world by calling time on one of the most successful swimming careers in history.\n\nThe four-time gold-medal champion said she was walking away from the sport with no regrets a day after she announced she would be retiring.\n\n“I gave up a lot,” Titmus said in Brisbane alongside her parents and partner on Friday morning.\n\nFour-time Olympic gold medallist Ariarne Titmus with family members. Credit: AAPIMAGE\n\n“Growing up, as a teenager I lived a different life, and then through my early 20s I made a lot of decisions to put my social life and my personal life on the backburner to put my sport first.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/racing/peter-v-landys-and-the-turf-war-splitting-sydney-racing-on-everest-day-20251016-p5n2xj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Peter V’landys and the turf war splitting Sydney racing on Everest day",
        "publish_date": "Fri, 17 Oct 2025 12:29:41 +1100",
        "category": "finance",
        "authors": [
            "Chris Barrett"
        ],
        "text": "Racing NSW and the ATC were at odds ahead of The Everest carnival over the terms of a deal to establish Base Camp, a new $7 million trackside corporate enclosure driven by V’landys, which has been set up in such a rush that building work is expected to continue through Friday night. The sacking of ATC chief executive Matt Galanos then set off a chain of events that led to a sensational public admonishment of the club by Racing NSW chair Saranne Cooke, technically V’landys’ boss, who warned there were “significant doubts about its ability to survive without ongoing bailouts”. Australian Turf Club chairman Tim Hale argues the member-owned organisation is financially secure. Credit: Steven Siewert Two club directors quit, with one going public with claims of dysfunction on the board, leaving only four remaining – Hale, media personality Caroline Searcy, technology executive and horse owner David McGrath, and Annette English, a commercial lawyer with close ties to the breeding industry. Three of them were opposed to the controversial proposed $5 billion sale of Rosehill for housing, which triggered a parliamentary inquiry last year before ultimately being defeated by members in May.\n\nThe Racing NSW intervention has brought the sport’s complex, much-debated flow of hundreds of millions of dollars a year in wagering revenue into back into focus. Most of it lands in the coffers of Racing NSW, which straddles the roles of both regulator and commercial juggernaut, distributing money onwards but also accumulating a war chest that includes $150 million in property. V’landys told last year’s Rosehill inquiry an extra $3 billion had been injected into the industry thanks to Racing NSW’s 2012 High Court win that made the bookies pay up and as a result of its negotiations with the state government on betting-related taxes. Last year’s Everest day was attended by a record crowd of 49,117. Credit: Getty “This is all new money. Racing NSW’s initiatives have made the money and now some want the keys to the castle,” he said in a written presentation to inquiry committee members. Hale says these are “industry funds” and much of what is channelled to the club from Racing NSW is earmarked for prizemoney and bonuses paid directly to owners rather than for the club’s operating costs.\n\nV’landys told this masthead the club’s costs had soared and it was not generating enough of its own revenue. “Whatever way you look at it, we’re giving them a lot more money than we’ve ever given them,” he said. With the blowtorch on ATC’s governance, including unspecified alleged code of conduct breaches by directors, eyebrows have also been raised about how Racing NSW has conducted itself. Just this week, the NSW parliament’s privileges committee delivered it a slapdown for its behaviour during the Rosehill inquiry, while this masthead earlier this year reported how Cooke transferred a block of land near Bathurst racecourse to Racing NSW for $1 after buying it in her own name. It also emerged at the inquiry that Racing NSW did not have a human resources department, but a “HR function” carried out by general managers. Cooke said at the time there was nothing inappropriate about the land deal, on which stamp duty was paid by Racing NSW. V’landys maintained the organisation was just defending itself with letters sent to the Rosehill inquiry that included allegations of impropriety against former staff it believed were behind confidential evidence about Racing NSW.\n\nMark Latham, a perennial thorn in V’landys’ side, has been Racing NSW’s loudest detractor but in the strangest of twists has become an ally of sorts in the ATC affair – if only of the enemy-of-your-enemy-is-your-friend kind. Furious at being banned from the club’s tracks over a run-in with club executive Steve McMahon and thrown out of Randwick a fortnight ago, the Independent MP has branded Hale as “Jellyfish Tim”, saying he hopes the board is sacked. As for V’landys himself, there have been fresh questions from industry critics about dual roles as racing’s boss and a hands-on chairman of the Australian Rugby League Commission, specifically about how much attention he can devote to his full-time job when he is in charge of two major sports. After more than two decades atop racing, his future has been the subject of much speculation. The latest rumour spreading like wildfire is that he will run the Brisbane Olympic Games in 2032. V’landys doesn’t know how it got started – “no one has contacted me” – and there is nothing to indicate there is any basis to it.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/meet-the-next-generation-of-coaches-hoping-to-launch-into-the-nrl-20251014-p5n2ei.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meet the next generation of coaches hoping to launch into the NRL",
        "publish_date": "Fri, 17 Oct 2025 12:22:27 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "When it was determined the Brisbane Broncos needed someone to inject a tough, physical edge, one of their former enforcers was identified as the perfect candidate.\n\nBen Te’o made a triumphant return to Red Hill after spearheading the Redcliffe Dolphins to the Queensland Cup final in 2024, tasked with turning the underperforming NRL outfit into a defensive juggernaut.\n\nWhile head coach Michael Maguire – who led Te’o to a premiership as a player with South Sydney – put his troops through a gruelling fitness regimen, it was Te’o who instilled the value of first contact at the tackle.\n\nBen Te’o made an immediate impression at the Brisbane Broncos. Credit: Getty\n\nIt took time for the squad to implement what he was putting in place.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/a-private-island-and-tax-free-wages-this-is-the-nrl-s-master-plan-for-the-png-chiefs-20251016-p5n352.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A private island and tax-free wages: This is the NRL’s master plan for the PNG Chiefs",
        "publish_date": "Fri, 17 Oct 2025 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "Airways Hotel is the current preferred option of the NRL. Credit: NRL Photos\n\nThe NRL and PNG franchise are considering several options. The Herald visited two of the main accommodation options for the Chiefs Village.\n\nHowever, before they can do that, one of the greatest obstacles confronting the Chiefs will be convincing players and their families they will be safe within the country.\n\nThere are bold ambitions to begin talking to players in the coming weeks, plans to pursue Ivan and Nathan Cleary, and predictions of what could be the most valuable jersey in the NRL.\n\nThe Chiefs name was unveiled in Port Moresby last weekend, with the Herald invited to sit in on key meetings, tour potential accommodation and interview key stakeholders.\n\nThe NRL and the PNG Chiefs have begun selling the tax-free dream, revealing their plans to lure players and their families to Papua New Guinea from the end of 2027.\n\nAdd articles to your saved list and come back to them any time.\n\n“I’ve spoken to a lot of people in PNG and the reputation is bad, but the reality is not like that,” Chiefs board member and former ARL Commission director Catherine Harris said.\n\nThere is an undertaking from the resort owners to build 80 villas that would house the NRL players and their families before they arrive for pre-season training at the end of 2027, ahead of their entry into the competition in 2028.\n\nThe facility has a tennis court, basketball court, playground, swimming pools, beauty salon, squash courts, restaurants, gym and its own medical centre.\n\nThe appeal of the 11-hectare facility is the available green space and facilities that would be more appealing to families than high-rise apartment and hotel complexes.\n\nThe resort is next to the international airport and fenced off from the outside world.\n\nComplete with its own private island and overwater bungalows just 15 minutes off the coast of Port Moresby, the Airways Resort is the preferred player village of the Australian Rugby League Commission.\n\nThe other option the NRL is considering is the harbour front Marriott apartments. There is vacant land on the water for a purpose-built accommodation facility.\n\n“One is for families to come out here during the week. The mothers can take the kids and come out for the day. It’s also a great overnight island, so they can come here with their partners or when family members come over to visit during the season. It’s a great place to break the monotony of staying in the players’ and staff village.”\n\nLoloata Island is privately owned by the Airways Resort and will be available to players and families. Credit: NRL Photos\n\n“I think this island can work two ways,” Chiefs chairman Ray Dib said.\n\nAs part of the deal, players and their families will have access to the Loloata Island resort.\n\n“Everybody is so conscious about security, it’s almost safer because everyone is so conscious of it. It’s like working in a workforce where safety is really important. You feel safe. It’s the same here in PNG.”\n\nThe other major appeal of the Marriott Apartments is the indoor-outdoor mezzanine level, which is being dubbed “NRL House” and is being offered as a private facility for players and their families.\n\nThe pool overlooking the harbour in the existing Marriott building being offered to the NRL. Credit: NRL Photos\n\n“Since I’ve been going there, I’ve never witnessed or experienced any concerns. But there’s obviously places where you don’t go after dark, or you [don’t] drive down certain streets.”\n\n“Look, safety is a priority,” Dib said. “Some years ago, I took my wife and my daughter there when we built a school with the Bulldogs there. They never had a concern.\n\nThis is a concern for the NRL despite the appeal of a waterfront location and new facilities adjacent to a fast-developing CBD.\n\nWhile the harbour front precinct has a heavy security presence, it’s not separated from the outside world.\n\nThe harbourside site owned by the Marriott which is being considered as the site for the Chiefs’ accommodation village. Credit: NRL Photos\n\n“There’s no question about that. Otherwise, we wouldn’t be doing this. But it’s long term, and it requires investment now. And the long-term gains are that as this country develops and as the ecosystem develops, there are a number of revenue drivers or spin-offs from it.\n\n“It is going to diversify, strengthen, and grow the game’s whole of game revenues,” he said.\n\nBut NRL chief executive Andrew Abdo hit back at suggestions the league was out of its depth with this project.\n\nIt is viewed in some quarters as a $600 million gift from the government to the NRL, leaving some pundits sceptical of the PNG team’s place in the competition.\n\nMost see this venture as a geopolitical power play.\n\nThe third option is the Hilton Hotel; however, a lack of green space and its location are expected to be deterrents.\n\nPapua New Guinea fans at PM XIII game in Port Moresby. Credit: NRL Photos\n\n“One thing we do know about sporting clubs is that they are becoming increasingly more valuable. So, we are creating a franchise that will one day in the future, in the near future, have a value of somewhere between 50 and $100 million.”\n\nDib echoed that sentiment, predicting high sponsorship revenue.\n\n“We have been inundated with sponsorship over in PNG and in Australia,” Dib said.\n\n“You’ll be surprised by the number of international brands that will be on our jersey. Money won’t be an issue for us. I’m confident we’ll be at the top.”\n\nHow will the Chiefs attract big-name players?\n\nDib held the role of chairman at the Canterbury Bulldogs during a successful period when they reached grand finals in 2012 and 2014.\n\nHe knows players are unlikely to sign long-term contracts to join the Chiefs, but believes the financial perks could represent the opportunity of a lifetime.\n\n“We have to be realistic. I’m confident once we get them there, and they see the facilities and what we have in mind, the vision that Peter [V’landys, ARL Commission chairman] and Andrew have got for the franchise ... that they’ll be able to enjoy the period and also gain financially and academically,” Dib said.\n\nRay Dib and Andrew Abdo on their way out to visit Loloata Island. Credit: Michael Chammas\n\n“Not just the players but also their families. They will come back in a better financial position and ready with their next career move in mind. Let’s be honest, the players have got a limited lifespan in rugby league.\n\n“If you’re a young bloke starting out, you want an opportunity to play in the NRL and maximise your minimum [early career] salary, that’s got to be an attraction. If you’re a player coming towards retirement, if you haven’t really established a great asset base, it’s a place that might help you in the last couple of years of your career.”\n\nHas the tax-free incentive been signed off?\n\nThe Australian government is yet to sign off on the promised income tax exemption, but Abdo says the players have nothing to worry about.\n\n“It’s completely tax-free in PNG,” Abdo said. “And we’re in the process of confirming the exemption for ensuring that non-resident Australians aren’t taxed in Australia.\n\nNRL CEO Andrew Abdo addressed the PNG Chiefs board last week. Credit: NRL Photos\n\n“The legislation exists already, and it’s really just around formalising that through the actual package that will be offered to these individuals.”\n\nResidents of other countries will not be entitled to the exemption as the deal is between the Australian and PNG governments.\n\nAs a result, New Zealand and England residents will not be financially advantaged by joining the Chiefs, reducing the potential player pool.\n\nWhich players are the Chiefs chasing?\n\nThe Chiefs are set to approach the NRL to request that they be allowed to sign players from November 1 this year.\n\nThe club doesn’t want to wait until this time next year to begin building its roster and is keen to try and convince players to join the Chiefs two years before they enter the competition.\n\nThat would require a player to agree to a contract for 2028 and sign a one-year deal for 2027 with another club.\n\nPayne Haas is a free agent as of November 1. Credit: Getty Images\n\n“We would be crazy not to engage [with players], but I just need to speak to the NRL about it and whether we’re allowed to sign future contracts if they are free agents,” Dib said.\n\n“That’s something we’re going to have a discussion very soon about. That would be an ideal position [to talk to players from November 1 this year]. If we can do that then yeah, absolutely we should be doing that.\n\n“If the NRL say we can do that and the player is willing to play with someone else in the interim, we’d be crazy not to see what’s available.”\n\nThat would put Tino Fa’asuamaleaui, Payne Haas, Luke Metcalf, Jayden Campbell, Harry Grant and Liam Henry firmly on the Chiefs’ radar.\n\nV’landys has also made no secret of his desire to lure Wayne Bennett to Papua New Guinea.\n\nNathan Cleary celebrates with his father and coach Ivan Cleary. Credit: Getty Images\n\nHe may get his way because, under its constitution, the ARLC has the final say on whom the coach and chief executive will be.\n\nOther potential targets could include Panthers coach Ivan Cleary, who is off contract at the end of 2027.\n\nIt’s also Nathan Cleary’s final year on contract at Penrith. His partner, Mary Fowler, has Papua New Guinean heritage.\n\nThe stadium and centre of excellence\n\nSantos National Stadium will be the Chiefs’ home base, with plans in place to upgrade the venue’s capacity from 15,000 to 20,000.\n\nThe site for the PNG first grade training field and centre of excellence is right next to the existing stadium that will be used as the team’s home ground. Construction is expected to commence in the new year.\n\nOutside the $600 million Australian government investment that goes to the NRL, the PNG government has pledged to invest in the upgrade of the stadium and a nearby centre of excellence.\n\nThe Chiefs are building a temporary office inside the stadium grandstand, but will move to the centre of excellence which is expected to rival the facilities used by the Parramatta Eels and North Queensland Cowboys.\n\nWhat are some of the other challenges?\n\nGiven the year-round high temperatures and humidity, night matches would provide more suitable conditions when the Chiefs play at home.\n\nFans at the match between the PM’s XIII and PNG in Port Moresby. Credit: NRL Photos\n\nThe lack of public transport in Port Moresby after 6pm is another hurdle.\n\nBy the second half of last week’s PM’s XIII game in Port Moresby, thousands had left the ground.\n\nIt wasn’t due to a lack of interest or disappointment with the scoreline, merely because public transport was the only way many could make it home that night.\n\nParticipation and development programs\n\nThe NRL has invested in development programs to try and establish a pathway for aspiring players.\n\nMost children don’t have access to a grass field, so they play on roads and roundabouts to get their fix of rugby league in a country of 22 provinces and 89 districts.\n\nPNG pathways and development guru Joey Grima presents to NRL CEO Andrew Abdo and the PNG Chiefs board. Credit: NRL Photos\n\nIn 2023, under the watch of Joey Grima – affectionately nicknamed “Boss Man” by the locals and Bigpela Dog (Big Dog) by Prime Minister James Marape – Tony Archer and Scott Barker, the NRL embarked on a pilot program in Port Moresby with 60 of the best young players.\n\nGiven 80 per cent of the estimated 12 million people in PNG live outside Port Moresby, the following year the program expanded to six regions, only accessible to each other by plane.\n\nInvites had to be hand-delivered to the most remote parts of the country.\n\n“We want to be the Brisbane Broncos here,” Grima said in his presentation to Abdo and the board.\n\nLocal fans swarm over Jason Saab after the PM’s XIII game in Port Moresby last weekend. Credit: NRL Photos\n\nIt is estimated that by 2026, when they expand into eight locations, the PNG academy will have a total of 960 participants – three times the size of the Parramatta Eels academy. The program will run over 22 weeks.\n\nThere are no structured competitions available for children between the ages of six and 12, and they rely on schools to provide the opportunity for gameplay.\n\nNRL players are mobbed during a trip to PNG for a PM’s XIII match a few years ago. Credit: NRL Photos\n\nIt is estimated that an Australian child would be exposed to close to 1000 extra hours of rugby league development than the average PNG child before they reach adulthood.\n\nThe shortfall is the focus of the PNG pathways leaders, who are seeking to bridge this divide by expanding access, enhancing training structure, and delivering consistent, high-quality coaching and competitions.\n\nThat’s why the government has invested close to $60 million into the initiative over the next five years, hopeful that the Chiefs will one day be predominantly made up of locals and not rely heavily on Australian players seeking tax-free contracts.\n\n“We’ll be bigger than the Penrith Junior Rugby League,” Dib said. “We will be the biggest nursery of rugby league in the world.”\n\nThe Herald travelled to Papua New Guinea courtesy of the NRL.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/salesforce-defends-security-practices-after-qantas-hack-20251017-p5n38d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Salesforce defends security practices after Qantas hack",
        "publish_date": "Fri, 17 Oct 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "Cloud software giant Salesforce has defended its security practices days after hackers published data from about 5.7 million Qantas customers to the dark web.\n\nAt the company’s Dreamforce conference in San Francisco – the world’s largest AI summit – Salesforce executives stressed that security is the company’s top priority, in their first public comments since the leak.\n\nThe security keynote came just days after hackers published data from about 5.7 million Qantas customers after a breach disclosed in July.\n\nThe Qantas breach, which occurred on June 30, exposed customer names, addresses, phone numbers, email addresses and frequent flyer information. Credit: Oscar Colman\n\nThe incident was part of a broader series of attacks that affected multiple Salesforce customers, with hackers claiming to have stolen nearly one billion records from about 40 companies, including Disney, Toyota and Ikea. Consumers are being advised to brace for a deluge of scams tied to the data dump.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/theatre/shiralee-adaptation-needs-grittier-fabric-to-weave-tale-true-to-mythology-20251011-p5n1qn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Even surrounded by an orchestra, Lime Cordiale’s charisma shines through",
        "publish_date": "Fri, 17 Oct 2025 11:59:27 +1100",
        "category": "lifestyle",
        "authors": [
            "John Shand"
        ],
        "text": "Hearing a new take on this Aussie band was illuminating and this kind of show is something that more artists should aspire to try should the opportunity come their way. THEATRE\n\nMEOW MEOW’S THE RED SHOES\n\nBelvoir St Theatre, October 15, until November 9\n\nReviewed by JOHN SHAND\n\n★★★ A fright wig and false eyelashes can only take you so far. From the time she clawed her way into our hearts nearly 25 years ago, Meow Meow backed up the ditsy exterior trappings in her cabaret shows with a striking singing voice and a zany, gloriously unpredictable stage persona. Meow Meow’s The Red Shoes is a cat of a different colour. She has presented shows derived from Hans Christian Andersen before, reimagining The Little Mermaid and The Little Match Girl. If her Red Shoes, here having its premiere season, happily has no girl’s dancing feet being chopped off, it does feel like it was shooed into the rehearsal room with director Kate Champion while only a kitten’s fetus. Kanen Breen and Meow Meow in Meow Meow’s The Red Shoes. Credit: Brett Boardman\n\nNot a play, it’s a cabaret show with themes of red shoes and greed, lovingly wrapped in improbably juxtaposed songs, ranging from what I presume was her own Why Must There Be an Opening Number? to Radiohead’s No Surprises and Patrick Watson’s Here Comes a River. These are expertly performed with singer Kanen Breen, pianist Mark Jones, bassist Dan Witton and guitarist/percussionist Jethro Woodward, who also become props and characters. Meow, of course, is the main event. To begin, she’s dragged on stage comatose: the eternal show girl, now loath to perform. Then she sings, dances, talks, improvises, climbs things, dies, eats a sandwich, dresses, undresses, pumps the bellows of a harmonium with her foot and even pinches audience members’ handbags and clothing. Yet after a while – and it only last 75 minutes – I was thinking that there was something richer and darker to be mined from The Red Shoes than this; that there’s too much surface and not enough substance. The show unfolds as a series of songs interlinked by the “red shoes” theme. Credit: Brett Boardman Don’t get me wrong: her singing can still be glorious and her sheer zaniness intoxicating. In the latter regard, she’s something of a throwback to the Dada movement of a century ago, with meaning less important than surprising images and songs. But the Meow Meow who can be achingly funny was missing too often, with not much to replace it. She laments the failure of communism in its “all for one and one for all” sense, delightfully reimagines Hamlet as a Eurovision song and quizzes Andersen (Breen) about his layered meanings in The Red Shoes. Little illumination results (although the meaning of Andersen’s tale is very much in the reader’s mind). Nothing is explicit – and that’s, no doubt, the point of the show. But here her theatrical version of chaos theory needs another layer, whether of humour or narrative, or there’s a slight feeling of the empress having insufficient clothes (despite multiple costume changes). Perhaps Champion needed to be a more rigorous director to help distil something beyond random flights of fancy. Meow is so innately gifted, captivating and, above all, audacious, but here it’s just not quite enough.\n\nMUSIC\n\nTEDDY SWIMS\n\nQudos Bank Arena, October 14\n\nReviewed by KATE PRENDERGAST\n\n★★★★★ Finding galaxies of love under tattooed eyelids, and a kingly swagger in white socks riding free on stocky legs, the cuddly American gangster of self-acceptance and soul took Sydney right up to the heavenly high he’s on in his healing journey, with big-budget pyrotechnics to match those big-belted feels. Since the breakout success of I’ve Tried Everything But Therapy (Part 1) in 2023, with its heavyweight hits about toxic co-dependency, addiction and heartbreak, Teddy Swims has come a long way. He’s been to therapy, for one. He’s also found love again, the wholesome kind. Plus, with global tours and billions of streams, the former YouTube cover artist sure is making bank. Teddy Swims with band Freaky Feely at Qudos Bank Arena. Credit: Glenn Pokorny/Qudos Bank Arena “I’m so grateful towards my shitty ex-girlfriend,” he joked good-heartedly to a packed arena. Though Teddy still pays tribute to (Part 1), tucking a few of the best into the encore, this tour is a celebration in the spirit of 2025’s (Part 2), where he’s come out of all that pain to a place he couldn’t have imagined a few years back: enormous gratitude.\n\nSydney is his first Australian tour stop, but his second October show, having won hearts in a kilt at the NRL Grand Finals. Still with Freaky Feely backing – the high school band he’s brought with him on the up and up – it’s a two-hour-long theatre of the full second album tracklist, and then some. A natural performer, we see Teddy crooning Bad Dreams into a mic stand shaped like a voluptuous woman, going back to the raw place with Some Things I’ll Never Know, getting tender with Small Hands devoted to his new baby boy, crowd-pleasing at the close with Lose Control. It’s a powerful, oaky, aching voice: soaked in decades of smoke and liquor; trained on YouTube clips, high school musicals and Atlanta area bands; and set on its god-gifted course to slow-burning stardom by a sweetheart dad who introduced him to the likes of Al Green. The production gives him the panache he deserves, while showing his sense of humour. At one point, following rolling fog and shooting flames, we see Teddy reappear on the summit of a golden ramp on a dunny throne from a hidden trapdoor. Wardrobe whirls him through a white cowboy suit, a tarot-patterned silk robe, a black T and shorts, and a creamy trench coat. Shoes? When you’re that grounded, who needs ’em. It’s no wonder audiences adore him: an everyman shot to pop firmaments on true talent, ribbing and relishing the trappings of class. A role model for a generation leaning into the strength of vulnerability, it’s big love all round. THEATRE\n\nTHE SHIRALEE\n\nDrama Theatre, October 10\n\nUntil November 29\n\nReviewed by JOHN SHAND\n\n★★★\n\nA deep sense of mythology surrounds the reader in D’Arcy Niland’s 1955 novel, The Shiralee. It’s as if the very landscape of mid-20th-century Australia is misanthropic, while those inhabiting it can be as deadly as brown snakes. In adapting the novel, playwright Kate Mulvany and director Jessica Arthur (for Sydney Theatre Company) have been aware of this quality, but they’ve only partially succeeded in transmitting it through their production. Too often this feels like a musical minus the songs: as gooey as a box of chocolates in the sun when attempting warmth of heart, and a little lame and stagy when shooting for menace. Kate Mulvany, Ziggy Resnick and Josh McConville in The Shiralee for the Sydney Theatre Company. Credit: Prudence Upton Niland’s novel tells of Mac, an itinerant jack-of-all-trades, who arrives back in Sydney to find his wife in bed with another bloke. Mac sorts out the bloke with his fists, and his wife by taking their daughter, Buster, and hitting the road. It’s a tale of a little girl adoring her remote, belligerent father, and gradually wearing away his armoured outer layer, almost as slowly as water acts on stone. Given the limitations of child actors, Buster is now nine rather than four, which shifts the dynamic considerably, as a four-year-old is obviously more helpless and dependent. Mulvany uses this shift to craft a more knowing, perceptive and wily Buster, and then Arthur has cast the notable Ziggy Resnick in the role. Although over a dozen years older than Buster, Resnick locates the truth of the bashfulness, eagerness, playfulness, bewilderment, humour, earnestness and staunch morality.\n\nZiggy Resnick and Josh McComville with Paul Capsis (centre) as Desmond the bush poet. Credit: Prudence Upton Mulvany also makes Buster more influential and more evenly matched in size of role with Mac, played by Josh McConville. McConville is convincing as the bluff, taciturn man who solves money problems with his sweat, and people problems with his fists. Tempered like steel in a forge, he is loath to let this slip of a girl, this shiralee (or burden) change his pugnacious, self-absorbed life. Niland peoples his novel with vivid incidental characters, and a further six actors assume multiple roles, including Mulvany herself playing Marge, Buster’s mother, whom she makes more rounded and sympathetic now she’s not just being seen through Mac’s eyes. Aaron Pedersen and Josh McConville in The Shiralee. Credit: Prudence Upton Paul Capsis is ideal as the superbly eccentric Desmond, a cycling swaggie and published bush poet. He (as do most of the minor characters) offers flickers of illumination to the protagonists, especially Buster, who is photographic paper in this regard compared with Mac’s carbon paper. Stephen Anderson, Lucia Mastrantone, Aaron Pedersen and Catherine Van-Davies complete the cast.\n\nUnlike the book, the story is told chronologically, which perhaps partly undermines that mythic quality: time is now linear rather than looped. But Jeremy Allen’s set bolsters the mythology, expertly using the Drama Theatre’s widescreen stage, while Jessica Dunn’s music amplifies the sense of space, foreboding and starry-skied wonderment. Alas, they can’t help the fact that when the play swerves back towards naturalism, it should be woven from grittier fabric. MUSIC\n\nHARRY BENNETTS PERFORMS BEETHOVEN’S VIOLIN CONCERTO\n\nSydney Symphony Orchestra, City Recital Hall, October 9\n\nReviewed by PETER MCCALLUM\n\n★★★½ Harry Bennetts played Beethoven’s Violin Concerto with a sweet sound, fine line and nuanced care, allowing the work’s beauties to unfold lyrically without false drama or undue storminess. Conductor Umberto Clerici began the opening orchestral tutti with unhurried gentleness. There was no hint of spikiness when the string parts took up the quiet opening drum beats, and the phrases breathed in long lines, moving with the breadth and inevitability of a noble river. Harry Bennetts, conductor Umberto Clerici and the Sydney Symphony Orchestra. Credit: Sydney Symphony Orchestra\n\nWhen Bennetts took up the solo entry, it was not with the swagger of a virtuoso driven by posturing heroics, but rather with a focus on allowing the work’s intricacies to blossom with precision and clarity. In the codetta section, as the orchestra starts to surge, Bennett twice responded to the challenge with aptly projected vigour, but on the third, took on the Orphean task of taming them with quiet calm. In the development section, when the soloist brings back the opening theme in B minor, high in the violin’s range, Bennetts created a memorable moment of transparent expressiveness without excess. The cadenza of the first movement (by Joachim) held attention with its even, unpressed resonance, contrapuntal clarity, glowing tone and true intonation without a hint of roughness or unwanted bow noise. All of this, of course, requires some freedom with the tempo which, for me, was slightly overdone in the Coda. The slow movement captured a sense of fresh stillness, Bennett ornamenting the underlying orchestral theme with balanced ornamentation of silvery brightness. I occasionally found the sense of pulse in the orchestral playing floated so freely it almost dissolved. The finale had beguiling buoyancy from both soloist and conductor. After another finely polished cadenza and exuberant Coda, Bennett started the last arpeggio with hushed insouciance as though beginning a new episode before the orchestra emphatically stopped any further discussion. In the second half Clerici and the Sydney Symphony again emphasised gentle lyricism in Schubert’s Symphony No. 4 in C minor, D. 417 Tragic. The first movement was fretful and agitated (‘Tragic’ as a subtitle has always seemed a little overblown) and the second gracious. In the third movement, Clerici and the SSO played Schubert’s cross-accents to create a sense of poised ambiguity. The finale was neat and discursive, as the young Schubert (he was only 19) was prone to be.\n\nDANCE\n\nTHE BOGONG’S SONG: A CALL TO COUNTRY\n\nBangarra Studio Theatre, October 9, until October 19\n\nReviewed by CHANTAL NGUYEN (with James and Teddy Gribble, and Charlie Price)\n\n★★★½\n\nMy co-reviewers Jamie (aged eight), his brother Teddy and their cousin Charlie (both aged six) didn’t even make it to their seats before being captivated by the moody blue uplighting at Bangarra Studio Theatre. It was a foretaste of the atmospheric vibe of Bangarra Dance Theatre’s school holiday show The Bogong’s Song by Yolande Brown and Chenoa Deemal, for ages five plus. It tells the story of siblings Beau and Myee (played by Benjin Maza and Tjilala Brown-Roberts, both fabulous triple threats). They are dream-transported to ancestral Country in the Snowy Mountains, where they must find a missing Bogong moth, healing the land and their own hearts along the way. “They were in sync like all the time when they danced!” Jamie observed. Benjin Maza and Tjilala Brown-Roberts in The Bogong’s Song. Credit: Edwina Pickles The Bogong’s Song features pretty much everything you could think of for a children’s production. There’s acting, singing, rapping, animated backgrounds, talking trees, hand-held puppets, shadow puppets, sing-alongs, and dancing. While the pacing can be patchy and the narrative occasionally lags, enough happens to keep things rolling. And the animal characters are a hit. “I liked the possum and the baby possum!” enthused Teddy. “I liked the lizard,” responds Charlie. “He was funny because he said he would eat the moth but then he didn’t!”\n\nJamie agreed. “He was hilarious! He used a chip packet as a solar panel!” There are also heartfelt lessons. “It was about helping the endangered moths,” explained Jamie. “[The siblings] needed to connect with Country, which meant listening to Country and the land. It made me feel good, but a little bit sad for how the world was treated.” Teddy nodded thoughtfully: “They were trying to not let the worlds separate.” The Bogong’s Song also grapples with Australia’s shockingly young age of criminal responsibility, as Beau and Myee grieve the imprisonment of their deaf little brother Joey. That part, recounted Jamie, is “very, very sad”. “He stole lollies. He went to jail. And he was 10. He was confused and scared. Couldn’t he just get a fine?”\n\nThe high point is the finale, featuring an all-too-short traditional dance featuring ochre paint and didgeridoo music. This part has no wisecracking animals or cartoons, but its power is immediately palpable. The children in the audience become transfixed, completely still and silent, as if responding to some deep, ancient summons that cuts through all the screens, lights, and noise. MUSIC\n\nTHE TALLIS SCHOLARS\n\nSydney Opera House, October 12\n\nReviewed by PETER MCCALLUM\n\n★★★★★ The Tallis Scholars began their eleventh Australian tour with a glowing, subtly invigorated sound of rich density and iridescent edge in the splendid eight-part motet Deus in adiutorium by the 17th century Spanish/Mexican composer Juan Gutierrez de Padilla. In an interview earlier in the day, director and founder of the Tallis Scholars, Peter Phillips, gave some insight into what gives this doyen of Renaissance vocal ensembles its distinctive tonal quality which is so elusive to describe yet instantly loved by audiences worldwide. He spoke of the micro-refinements of tuning that singers undertake when singing without instruments. Equally important, of course, is the talent, dedication and professionalism of the singers and, in Phillips’ case, 53 years of experience in refining and perfecting the Tallis Scholars to lay bare the glories of the Renaissance with transparent clarity.\n\nListening closely to the vibrant chords of Padilla’s work, one can hear, beyond the purity of tone and pitch, small harmonics of the sort one hears in singing from Bulgaria to Tibet that add shafts of colour and engender delight. The program was built around the theme of chant which appeared in beguiling simplicity in the next work, in principio by 12th century abbess, Hildegard of Bingen, sung by a sub-group of female singers with disarming naturalness of line and rhythm. A more recent adaptation of chant-based melodic and polyphonic structures was then presented in Arvo Part’s Triodion, written for the 150th anniversary of Lancing College in Sussex, England. A different range of harmonics emerged in the halos of Part’s delicately soft blends of humming, solo and widely spaced voices, leading to a still central point that even a fretful baby in the audience could not disturb. After another chant by Hildegard the first half concluded with the substantial motet by Jacob Obrecht, Salve Regina, in which varying groupings of the 10 voices coalesced and mutated to create a sense of timeless calm. To start the second half, the singers split into widely separated groups for Allegri’s Miserere mei, Deus. Phillips directed the first chorus from the stage, a solo singer sang chant section from the eastern gallery, while, high in the south-western part of the hall the second chorus was heard magically from behind as soprano Emma Walsh embellished the choral sound by repeatedly ascending with apparently effortless grace to an ethereal high C. Part’s Magnificat and Da Pacem Domine again led listeners to utterances that were at once almost inaudibly quiet yet palpable and definite. After Hildegard’s O ecclesia, Josquin des Prez’ Praeter rerum began with darker low-pitched textures, ending with the richly rewarding choral sound that had been heard at the start and to which it is so easy to become addicted. MUSIC\n\nTRIO ISIMSIZ\n\nCity Recital Hall, October 13\n\nReviewed by PETER MCCALLUM\n\n★★★½\n\nIn the Renaissance, a missa sine nomine was literally “a Mass without a name”, which meant that, unlike most Masses of the time, it didn’t build on pre-existing material. Violinist Pablo Hernan Benedi, cellist Edvard Pogossian and pianist Erdem Misirlioglu have adopted the same paradoxical nomenclature by christening themselves Trio Isimsiz, which is Turkish for “trio without name”. Their program of music by Brahms, Coll and Schubert also consisted of works without names in that all of them were simply called “Piano Trio”, though the trio by Francisco Coll did make references to pre-existing music and styles, which flitted into the background like music half-remembered in a dream. Musica Viva’s Trio Isimsiz – violinist Pablo Hernan Benedi, cellist Edvard Pogossian and pianist Erdem Misirlioglu – at the City Recital Hall. Credit: Dylan Alcock One allusion was to Strauss’ comic opera Die Schweigsame Frau (The Silent Woman) about an old man whose intolerance of noise becomes a vehicle for his torment by the young. It was, in one sense, a metaphor for the way chaotic textures in Coll’s trio fragmented and subverted coherent musical ideas just as they began to emerge. The trio began with a short spiky restless movement in which pizzicato string notes and scattered staccato chords from the piano were thrown frenetically across the range of all three instruments, like someone tearing up a first draft. The second movement, the longest and weightiest, began with a bell-like chord on the piano and explored expressive melody and quiet, lonely spaces, sustaining ideas and building up tension in a more familiar way. The third movement returned to fragmented thinking, lurching in two-note figures from violin and cello accompanied by shattered sprays of notes from the piano.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/why-being-able-to-trade-two-years-into-the-future-skyrocketed-afl-stars-value-20251017-p5n38g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why being able to trade two years into the future skyrocketed AFL stars’ value",
        "publish_date": "Fri, 17 Oct 2025 11:57:10 +1100",
        "category": "finance",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "A question from this masthead to Hawthorn list boss Mark Mackenzie on the opening day of trade period ended up being quite prescient.\n\nReporter: “Mark, what impact do you think having that extra year of future picks will have on the trade period? Are you expecting players to be worth more now?”\n\nPicks at the 2027 draft were packaged up in the trade that sent Charlie Curnow from Carlton to Sydney. Credit: Getty Images\n\nMcKenzie: “It’ll be interesting because I think clubs could ask ... for more. But really, when you think about it, it should be the same values of what it has been previously – you just have a bit more scope to actually trade certain picks and look at those drafts, from two years [away].”\n\nThe AFL gave clubs the green light from this year’s trade period to trade draft picks two years into the future, after being able to go just one year ahead until now.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/imagine-i-hadn-t-gone-to-the-doctor-nic-maddinson-s-private-battle-with-cancer-20251016-p5n36w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Imagine I hadn’t gone to the doctor’: Nic Maddinson’s private battle with cancer",
        "publish_date": "Fri, 17 Oct 2025 11:52:37 +1100",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Even when Dad does manage to take August to the park, which is a five-minute walk, he needs to rest.\n\nInstead, he is slumped on the lounge in their Bondi home. He’s been there on and off for weeks, except between 11am and 4pm. He’s been sleeping for about 12 hours a day.\n\nA few good matches to start the 2024-25 season for NSW in the Sheffield Shield, and Dad might have been opening the batting for Australia last summer against India.\n\nHe’s too young to realise his father, Nic, is a very good cricketer. Not just any good cricketer, but the proud owner of a baggy green – and one of the most exciting batsmen in Australia over the past 15 years.\n\nAugust, a cheerful and energetic two-year-old boy, is confused. Cars. Lego. Passing a footy. Anything. Why isn’t Dad being fun any more?\n\nAugust Maddinson just wants to play with Dad. Just like he’s always done.\n\nAdd articles to your saved list and come back to them any time.\n\nHe doesn’t want sympathy or for this to be a sob story. That’s not in his nature, says his best mate Adam Zampa.\n\nNic Maddinson is glad it’s all over. After this interview, his private battle with testicular cancer will no longer be a secret.\n\n“We just told him that I was sick, and I was taking some medicine that made my hair fall out. We told him I was going to be OK.”\n\n“He understood quite a lot of what was going on. He’s a pretty intelligent kid. He was always rubbing my hair and asking what happened to it.\n\n“The hardest part was having to tell August I couldn’t play with him,” Maddinson says. “I was just so physically exhausted that I couldn’t get off the couch.\n\nAugust has been telling people his dad no longer has hair because the wind blew it away. His mother, Bianca, is six months pregnant with his soon-to-be brother.\n\nA video pops up. Zampa, another star hailing from the NSW south coast, was one of the few who knew about Maddinson’s cancer battle.\n\nHe sips a long black and scrolls on his phone, looking at photos from when chemotherapy kept him in bed most of the day.\n\nFollowing months of appointments, needles, chemotherapy sessions and sleepless nights, Maddinson is finally ready to tell his story – one only a small circle of cricketers have known about.\n\nNic Maddinson ahead of his Test debut against South Africa at the Adelaide Oval in 2016. Credit: Ryan Pierse\n\nAfter three Test matches, six T20 internationals, 129 first-class fixtures, 105 List A games and 144 T20s around the globe, cricket has been an afterthought for the 33-year-old who, half a lifetime ago, was one of the country’s brightest young batting talents.\n\nIn the distance, a curator is preparing a pitch for Saturday’s match between Maddinson’s club, Eastern Suburbs, and Penrith – not that he’ll be playing.\n\nIt’s a gorgeous Wednesday morning in Sydney’s eastern suburbs, and August is walking towards a cafe near Waverley Oval with his dad, mum, and two-week-old brother, Wilder, who is in a pram.\n\n“I thought it would mean a lot. I think I would have regretted it if I didn’t send it.”\n\n“I thought I’ll just do the video and no one will work it out,” Maddinson says of his diagnosis. “I can’t believe I thought I was going OK. Looking at that video, he looks so shit, and sick, and pale. I feel 100 times better than I did then.\n\nZampa’s wife, Harriet, rang Bianca to say there was no pressure to send a video if he wasn’t feeling up to it. Maddinson did anyway.\n\nNic Maddinson (left) and Adam Zampa in 2009 after being picked for the NSW under-19 cricket team. Credit: Greg Totman\n\nOf course, he did. It was his best mate. He knew “Zamps” would love it. The only problem was that Maddinson hadn’t told anyone he was undergoing chemotherapy.\n\nAhead of Zampa’s 100th T20 international against the West Indies in July, Maddinson was asked if he’d like to send a video message that would be played on the team bus ahead of the match in St Kitts.\n\nWhile packing a suitcase at home, Maddinson’s phone rang. It was Orchard.\n\nAt his end-of-season review, Maddinson mentioned the lump to Cricket Australia’s chief medical officer Dr John Orchard. A Friday afternoon appointment was booked in minutes.\n\nThen he felt a lump. His GP thought it was probably a virus, but still recommended a scan. There were no available appointments, so it would have to wait until after the trip.\n\nHe felt sick and run-down but was looking forward to a holiday in Byron Bay.\n\nThis time last year, Maddinson was in the frame for a recall to the Australian Test team. Five months later, after a disappointing season yielding 267 runs at an average of 17.8, he was dropped for NSW’s final Sheffield Shield match against Tasmania.\n\n“To have that pop up for me on an important day for me was really cool.”\n\n“It got me a bit,” Zampa says. “I think people in the team who didn’t know what was going on saw my reaction and thought, ‘jeez, I had no idea’.\n\n“I don’t think you should get on the plane tomorrow,” Orchard said.\n\nThe scans confirmed a tumour. Maddinson rang Bianca at work to break the news.\n\nShe flew up the following day, while Maddinson stayed in Sydney for more tests. He still arrived in Byron Bay on the Sunday for a quick trip “to let it all sink in”.\n\nThree days later, Maddinson underwent surgery.\n\nNSW cricketer Nic Maddinson has overcome testicular cancer. Credit: Louie Douvis\n\n“I was with John waiting for some scans, and that’s when it hit me the most,” he says. “I had the surgery and I didn’t think too much about it.”\n\nThen, after about seven weeks, came the words he didn’t want to hear: “The cancer has spread.”\n\n“Once I found out I had to have chemo, that was pretty hard to deal with,” he says. “It had spread to parts of my abdominal lymph nodes and lung. That was a bit where it was pretty daunting. Bianca was the one asking all the questions. It was a bit of a blur. I’m glad she was there.\n\n“I’m in awe of how strong and supportive she was through everything. She even quit her job as a dentist the day we found out I needed chemo.\n\n“She took on literally everything at home, so I could rest when I needed, all while pregnant and struggling with her own sleep and looking after two dogs and a toddler.\n\n“There were definitely days when it broke me mentally having to get up and go to hospital, and she helped me push through.\n\n“She wanted to sit with me, all day every day, but I felt guilty for wasting her days, so she only came in a handful of times.\n\n“Imagine if I hadn’t gone to the doctor.”\n\nNic Maddinson celebrates notching a ton for Victoria against NSW in 2020. Credit: AAP\n\nMaddinson thought he’d miss a few weeks in the off-season. But he was told his vision, hearing and fitness might never be the same. Reality hit home.\n\n“Cricket was the last thing I wanted to think about,” he says.\n\nZampa was worried.\n\n“In my head, I’m unfortunately thinking about the worst-case scenario,” the leg-spinner says. “What’s going to happen to my best mate? He had a really positive outlook on it. He just got on with it and didn’t make a fuss about it.”\n\nOn May 19, Maddinson embarked on his greatest challenge yet. Facing the fastest bowlers in the world was light work compared to five hours of chemotherapy every day at St Vincent’s Hospital – a five-minute drive from the SCG.\n\nNine weeks. Three cycles. Three weeks each. Endless sleep.\n\n“At the start, I actually felt OK,” Maddinson says. “It takes a while to get into your system. By day three, I felt like I’d been hit by a truck. I didn’t really improve much after that.”\n\nNic Maddinson prepares to begin chemotherapy.\n\nOn day four, things took a turn. NSW teammate Moises Henriques came to visit. He sat silently, watching his mate have his body pumped full of drugs.\n\n“I remember saying to Moey, ‘I just need to sleep today, mate. There’s no point hanging around too long’.”\n\nZampa offered to fly to Sydney whenever he could.\n\n“I’ve never had someone close to me go through it,” Zampa says. “It was drop everything to try and help. He was lucky he had good support around.\n\n“He’s always been really stubborn, so receiving help and asking for it when it’s needed certainly isn’t his strength. I couldn’t have imagined going through it.\n\n“I’m speaking to my wife about it, then getting off the phone to Maddo, and I don’t really have the answers myself or know how to help.”\n\nMaddinson felt bloated and put on weight.\n\n“By the second or third week, I lost all my hair. I was feeling pretty average,” he says. “I was taking types of steroids to manage side effects, but they would keep me up at night. I’d be at the hospital from about 11am to 4pm. Then a sleep. Then I’d force myself to have dinner. I’d sleep until about 1am, but sometimes I’d then be awake until 6am. I found that difficult. I was super drained and felt like I had to sleep 24/7.\n\n“I felt guilty. I couldn’t do anything around the house.”\n\nOnly a handful knew – family, Zampa, Sean Abbott, Henriques, Josh Philippe, Cricket NSW high-performance boss Greg Mail, and a handful of other friends outside of cricket. Word spread quietly, but Maddinson wanted to keep it tight.\n\nDuring the winter, Mail told Blues players.\n\nMaddinson, with no hair, moustache or beard, turned up one morning at Centennial Park to have a coffee with teammates before a fitness session. Hair was always Maddinson’s thing. He once bleached it peroxide blond before a Big Bash game and joked that “Gwen Stefani” was the inspiration.\n\nNic Maddinson’s blond era. Credit: Getty Images\n\n“None of the boys asked, but it was pretty obvious something was going on,” Maddinson says. “I looked completely different.\n\n“I wanted to feel like myself and go for a walk or a run. I didn’t really want to train for cricket. Batting didn’t interest me. I wasn’t envious of them playing. That was the first time in my life. It’s only recently that I’ve really wanted to play.”\n\nHe suspected some players on Australia’s Test tour of the West Indies knew. Some nights, when he couldn’t sleep, he’d watch the first session of action in the Caribbean on television as Bianca and August slept.\n\nSam Konstas, his NSW opening partner, was struggling with the bat for Australia – and so was Maddinson, in a different way.\n\nIn the morning, August would often find his dad asleep on the couch. He just wanted to go to the park again.\n\n“You try and put yourself in those shoes, and it’s almost impossible to explain to your kid why you can’t play with them,” Zampa says. “His little guy Augie is an absolute champion. He’s all over the place and a ball of energy.”\n\nMaddinson adds: “At home, he’d want to chase me down the hallway and tackle me.\n\n“Bianca ended up saying to me, ‘I think you’re trying to do too much’. I tried to ride my bike one day and feel stupid for doing it now. I knew I felt terrible, but I just wanted to do something that I was used to doing.\n\n“It was the slowest and longest nine weeks.”\n\nMaddinson felt foggy and spaced out. He watched a lot of Netflix and cycling races. He deferred an online undergraduate psychology course at Curtin University because he was so exhausted.\n\n“I was in hospital every Monday for about 12 weeks in a row. The first Monday we didn’t have to go into hospital was such a relief.\n\n“The hardest part mentally was having to get a needle every day. I had bruised hands and forearms from the number of needles. I don’t think I could have physically taken myself back in there for one more day.\n\n“I felt I was mentally pretty strong but I think I would have thrown it in.”\n\nJuly 14 was a good day. Chemo was finally done.\n\nMaddinson felt terrible but summoned the energy for a photo with August, who’d made a sign for his dad.\n\nIt said “LAST CHEMO” and was covered with stickers of dinosaurs.\n\nNic Maddinson with son August after his last chemotherapy session.\n\nTen days later, he texted Blues batting coach Nick Larkin.\n\n“Can I come and hit some balls?”\n\nOn July 28, still feeling terrible, he drove to Sydney Olympic Park, padded up and put a helmet on. No one else was there.\n\nLarkin threw down some cross-seamers. The dashing left-hander belted them. He batted for half an hour, hit about 100 balls, and walked out. It was what he needed.\n\n“I didn’t touch a bat for a month after that,” Maddinson says. “It was a weird feeling. Every time I mishit one, I got angry at myself in the nets. It was the first time I could bat without a care in the world.\n\n“I stopped batting for a little bit because I didn’t want to just not care.\n\n“Eight weeks after my last chemo round, I got good news. The treatment had worked.”\n\nThe road back to cricket wasn’t straightforward. The batting and strength returned. His fitness is still a work in progress.\n\n“My recent tests were all good, and I can go about getting back into cricket, which I love,” he says.\n\nVictorian openers Nic Maddinson (left) and Will Pucovski in 2020. Credit: Getty Images\n\nOn Thursday, Maddinson had a centre wicket net session with a few Blues squad members.\n\nOnce he faces some faster bowlers and ticks a few fielding boxes, Maddinson will be eligible for selection – perhaps for Easts, NSW Second XI, or the Blues’ Shield match at the SCG from November 10 to 13.\n\nHave his goals changed?\n\n“It’s tough question to answer right now. Yes and no,” he says. “I would still love to play Test cricket again, but I’m more realistic. The older you get, the less likely it is to happen.\n\n“I had a really good opportunity last year and I just didn’t really grab it. I’m just really excited to try and play cricket again. I was dropped at the end of last year, so I’m not expecting to be straight back in the side.\n\n“The most important thing would be to say I am available. That would be a nice day.”\n\nHe hopes something good comes of telling his story.\n\nNic Maddinson holding new son Wilder, alongside August and wife Bianca.\n\n“I feel very lucky I live in a country where we have good medical care,” he says. “I am in a pretty privileged position to have access to John Orchard. He helped sort out all my appointments and was with me the whole time.\n\n“When I found out I needed chemo, it hit me hard because I almost didn’t go. I thought it would go away. To know that I caught it probably as early as I could have, and it still spread into other parts of my body, that was scary.\n\nLoading\n\n“I just think it’s so important if you have anything you’re worried about, get it checked out.\n\n“It feels silly to not tell my story. If one person reads it and gets checked, I’ll be happy. I grew up in the country and a lot of people fob it off. It’s a ‘she’ll be right’ attitude. Get the stuff checked out, it can make all the difference.”\n\nAugust is back at the cafe with a grin on his face.\n\nIt’s time for the park, a kick of the footy, and a slow, steady return to normal life for the Maddinson family.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/camper-found-alive-after-he-went-missing-for-nine-days-20251017-p5n3ar.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Camper found alive after he went missing for nine days",
        "publish_date": "Fri, 17 Oct 2025 11:52:03 +1100",
        "category": "finance",
        "authors": [],
        "text": "Camper found alive after he went missing for nine days\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/prince-andrew-caught-up-in-spy-case-rocking-britain-20251017-p5n37e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince Andrew caught up in spy case rocking Britain",
        "publish_date": "Fri, 17 Oct 2025 11:48:10 +1100",
        "category": "finance",
        "authors": [
            "Allegra Mendelson",
            "Poppy Wood"
        ],
        "text": "Prince Andrew met a senior Chinese official at the centre of a Beijing spy scandal rocking the United Kingdom at least three times.\n\nThe Duke of York held meetings in 2018 and 2019 with Cai Qi, one of the most senior members of the Chinese Communist Party and a close ally of Chinese President Xi Jinping.\n\nPrince Andrew, right, with Cai Qi in London in May 2018. . Credit: Alamy Stock Photo\n\nCai is understood to be the final recipient of sensitive information allegedly passed to China by two British nationals accused of spying for Beijing, Christopher Berry and former parliamentary researcher Christopher Cash. They maintain their innocence.\n\nThe CCP politburo member involved has not been named in official documents, but biographical details released in court files match Cai alone. Sources also told The Telegraph he was the Chinese official at the heart of a trial against Berry and Cash that was set for this month but fell apart at the last minute after the British government refused to label China an “enemy”. Both Cash and Berry deny the charges.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/tips-and-advice/are-wines-with-leaked-corks-still-drinkable-20251013-p5n22n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Are wines with leaked corks still drinkable?",
        "publish_date": "Fri, 17 Oct 2025 11:37:16 +1100",
        "category": "finance",
        "authors": [
            "Huon Hooke"
        ],
        "text": "My great aunt recently moved into care and, while I was cleaning out her garage, I found dozens of bottles of wine that had leaked or pushed their corks out. Some look OK, though; are they worth selling?\n\n—A.H., Longueville, NSW\n\nUnfortunately, even the bottles that look all right are probably past being pleasant to drink. That’s assuming they’ve all been in the garage for a similar length of time. Younger vintages are likely to have spent less time there in that place and are, therefore, likely to be in better condition. Like most garages, this one is evidently too hot at certain times of the year to store wine safely.\n\nPhoto: Simon Letch\n\nI’ve seen too many “cellars” like the one you describe: wine that’s been kept too long in a hot place is one of the most depressing sights for a wine-lover. You typically see corks pushed out, or filthy bottles with fungus encrusting the capsule where wine has leaked out. Some bottles will be completely empty due to evaporation; others contain a cloudy, murky brown substance that once was wine. It’s enough to bring a tear to the eye, especially when the labels carry the names of famous wineries.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/the-australian-does-a-u-turn-on-controversial-pentagon-press-rules-20251017-p5n38t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Australian does a U-turn on controversial Pentagon press rules",
        "publish_date": "Fri, 17 Oct 2025 11:30:47 +1100",
        "category": "finance",
        "authors": [
            "Calum Jaspan"
        ],
        "text": "News Corp’s The Australian has done a dramatic U-turn on its decision to sign up the Pentagon’s new controversial press rules, which led every major news outlet, including Murdoch-owned Fox News, handing over their passes.\n\nJust hours after The Australian was revealed to be one of just 11 global news outlets to have agreed to the new rules, a spokesperson told this masthead that it had “revoked our assent”, citing press freedom concerns.\n\nMajor news organisations packed up and left The Pentagon this week. The Australian had opted to retain its access, then ‘revoked’ the call. Credit: AP\n\n“The Australian has reviewed the Pentagon’s new press rules and requirements. They raise serious concerns and place undue limits on press freedoms,” a spokesperson for The Australian said.\n\n“Because of The Australian’s long-held position on independent journalism and press freedom, we have advised the Pentagon that we have revoked our assent.”",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/worker-compensation-australia-claims-report-2025/wwqkll5l9",
        "title": "Hundreds of claims a day: Are these Australia's most dangerous jobs?",
        "publish_date": "Fri, 17 Oct 2025 01:28:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "A third of jobs accounted for more than half of Australia's serious work injury claims in 2024, while only three in 10 injured workers across the entire workforce reported receiving workers' compensation.\n\n\n\n\n\nSafe Work Australia's Key Work Health and Safety Statistics Australia report for 2025, released on Friday, revealed 188 workers died from traumatic injuries while working in Australia in 2024, with a rate of 1.3 deaths per 100,000 workers.\n\n\n\n\n\nOver the past decade, that figure has decreased by 24 per cent, from a rate of 1.7 fatalities per 100,000 workers in 2014.\n\n\n\n\n\nWorkers aged 45 and over accounted for more than half of worker fatalities recorded.\n\n\n\n\n\nAustralia's peak body representing workers, the Australian Council of Trade Unions (ACTU), said while a fall in the fatality rate is welcome, 188 families still lost a loved one last year.\n\n\n\nVehicle incidents accounted for 42 per cent of worker fatalities in 2024. Source: SBS News ACTU assistant secretary Liam O'Brien said in a statement: \"Health and care workers, tradies, factory workers and the people who keep our communities safe are at the greatest risk.\"\n\n\n\n\n\n\"One death at work is one too many, and our job is far from done.\"\n\n\n\n\n\nThere were 146,700 serious workers' compensation claims involving at least one week or working time lost in 2023-2024 — more than 400 serious claims a day.\n\n\n\nWhat did the report find?\n\nSafe Work Australia's report found four sectors collectively made up more than half of the 146,700 serious workers' compensation claims in 2024.\n\n\n\n\n\nThose industry divisions were health care and social assistance (19.9 per cent), construction (12 per cent), manufacturing (10.1 per cent) and public administration and safety (9.2 per cent).\n\n\n\n\n\nHowever, those sectors only represented 36.3 per cent of filled jobs covered by a workers' compensation scheme.\n\n\n\n\n\nOverall, across all industries, three in 10 injured workers reported receiving workers' compensation, while the rest either did not lodge a claim or did not receive compensation.\n\n\n\n\n\nThe ACTU expressed alarm that seven in 10 injured workers were not receiving compensation, citing barriers in reporting and under-reporting that obscured the actual cost of workplace injuries across Australia.\n\n\n\n\n\nWhen it came to fatalities, machinery operators and drivers represented 61 worker deaths in 2024, with a rate of 6.7 fatalities per 100,000 workers. This was followed by labourers (50 fatalities), managers, technicians and trades workers (28 fatalities).\n\n\n\nIn 2024, machinery operators and drivers accounted for the highest proportion of worker fatalities (32 per cent) and also recorded the highest fatality rate at 6.7 fatalities per 100,000 workers, according to the report. Source: SBS News The agriculture, forestry and fishing industry had a rate of 13.7 fatalities per 100,000 workers in 2024, followed by transport, postal and warehousing (7.4 fatalities per 100,000 workers) and mining (3.4 fatalities per 100,000 workers).\n\n\n\n\n\nVehicle incidents were by far the most common cause of death at 42 per cent, and at least one vehicle was directly involved in the incident in 66 per cent of worker fatalities in 2024.\n\n\n\n\n\nOther causes of death included falls from a height (13 per cent), being hit by moving objects (9 per cent), being hit by falling objects (7 per cent), and being trapped by moving machinery or equipment or between stationary and moving objects (both 5 per cent).\n\n\n\n\n\nWorkers aged 45 and over accounted for more than half of worker fatalities recorded.\n\n\n\nMental health claims on the rise\n\nThe report also found that over the past decades, serious claims for mental health conditions have experienced the largest change across any major injury group, with a 161 per cent increase.\n\n\n\n\n\nMental stress is now the fourth most common cause of serious claims, at 11.5 per cent.\n\n\n\nREAD MORE The $3.8 billion reason Australian workers would leave their jobs\n\nThe median time lost from serious claims related to mental stress is about five times the median time lost across all serious claims and leads to significantly more time off work.\n\n\n\n\n\nMental health claims also represented the costliest form of workplace injury — leading to more than four times the median compensation paid across all serious claims.\n\n\n\n\n\nWhile men accounted for the vast majority of deaths (180) in 2024 and accounted for 58 per cent of all serious claims, the report found women's serious claims were more than twice as likely to involve mental health conditions as men's.\n\n\n\n\n\nOn average, women's claims also involved more time away from work. Median compensation paid for serious claims remains 20.4 per cent higher for men — $17,600 to $14,600.\n\n\n\n\n\nThe ACTU said unions were calling for greater legislative protection for workers who were exposed to psychosocial hazards on the job, such as violence and aggression, sexual harassment and discrimination.\n\n\n\n\n\nO'Brien said: \"Employers must treat work stress and intensification with the same seriousness as any other health and safety consideration.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-this-weeks-surprise-unemployment-data-could-mean-for-your-mortgage-repayments/1qcd4db63",
        "title": "What this week's surprise unemployment data could mean for your mortgage repayments",
        "publish_date": "Thu, 16 Oct 2025 23:41:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "A surprise uptick in unemployment could be a silver lining for Australian borrowers, with the chances of another interest rate cut possibly back on the cards for 2025.\n\n\n\n\n\nThe jobless rate jumped from 4.2 per cent to 4.5 per cent in September, according to data from the Australian Bureau of Statistics (ABS).\n\n\n\n\n\nIt's a nearly four-year high, blowing away economists' forecasts of a steady 4.3 per cent and prompting fresh questions about the tightness of the labour market.\n\n\n\n\n\nThe labour force figures will be a crucial indicator for the Reserve Bank of Australia (RBA) on whether to further cut interest rates from 3.6 per cent when it next meets on 4 November, which is Melbourne Cup day.\n\n\n\nHow much has unemployment grown?\n\nThe RBA had expected some cooling in September's jobs data but neither the central bank, nor scores of analysts and economists, had tipped anything near the 4.5 per cent jobless figure.\n\n\n\nLISTEN TO 'How are people surviving?': long term unemployment increasing SBS News 04:55 English\n\nThe September figure is the highest since November 2021.\n\n\n\n\n\nUnemployment rose by 34,000 during the month, with the number employed rising by 15,000.\n\n\n\n\n\nSean Crick, ABS head of labour statistics, said: \"As a result of these increases, the participation rate rose by 0.1 percentage points to 67 per cent, although this is below the record high of 67.2 per cent we saw at the beginning of the year.\"\n\n\n\n\n\nTotal full-time employment has risen by 9,000 for the month, which came from a rise of 23,000 men in full-time roles.\n\n\n\nThe number of women in full-time roles dropped by 15,000, while hours worked rose by 0.5 per cent in September.\n\n\n\nWhat does it mean?\n\nAlex Joiner, chief economist at IFM Investors, spoke to SBS' On The Money podcast. He said while the labour market is a \"lagging\" indicator, it does give us some insight into how the economy is tracking.\n\n\n\n\n\n\"We've seen some green shoots in the broader economy in the activity indicators and consumer sentiment has picked up a little bit ... so it gave us a little bit of hope that the consumer and household sector more broadly would start to open their wallets and spend a little more,\" he said.\n\n\n\n\n\n\"That's good for the economy and good for employment growth.\n\n\n\n\n\n\"But the rate of recovery is fairly measured. We're not seeing unambiguous signs of recovery, we're seeing tentative signs of recovery, and that's probably what's being reflected in the labour market.\"\n\n\n\nLISTEN TO ASX hits record as jobless rate rises to 4.5% SBS News 09:25 English\n\nBefore the release of the unemployment numbers, Reserve Bank governor Michele Bullock said employment was a little bit \"tight\", which broadly meant there were more jobs than available workers.\n\n\n\n\n\n\"We look at a lot of different indicators of the labour market, so those two things [inflation and employment] suggest to us that maybe it's a little tight, but it's close to balance,\" she said.\n\n\n\n\n\nBut Joiner said the unemployment rate has \"ticked up above where the RBA thought it might be\".\n\n\n\n\n\n\"The RBA has characterised the labour market as still somewhat tight,\" he said.\n\n\n\n\n\n\"They may need to reassess that somewhat in light of these numbers.\n\n\n\n\n\n\"This increase in the unemployment rate has taken the RBA a little bit by surprise and that will have to feed into the board's thinking on where policy settings should be.\"\n\n\n\nIs another interest rate cut on its way?\n\nSome economists have noted the shock jobless figures could pave the way for another interest rate cut in 2025, though they also expect the Reserve Bank to be \"conservative\".\n\n\n\n\n\nThe higher jobless rate meant homeowners could get a mortgage reprieve soon, NAB senior markets economist Taylor Nugent said.\n\n\n\n\n\n\"Today's outcome clearly makes a November cut a higher probability than would have been the case had today's number been near our and consensus expectations,\" he told AAP.\n\n\n\n\n\n\"We continue to expect a hold as the RBA awaits more clarity on the outlook given the inherent month-to-month volatility.\"\n\n\n\nCommonwealth Bank economists continue to predict one more rate cut in this cycle, with February 2026 the base case. While they note that there's now a \"higher chance\" of a cut in November, they say sticky inflation may delay action.\n\n\n\n\n\nCommonwealth Bank's head of Australian economics, Belinda Allen, said: \"This is a classic case of conflicting signals.\"\n\n\n\n\n\n\"Inflation has been a little stronger, consumer spending is rising, but employment growth has slowed more than expected. Until the tension between inflation and labour market is resolved, we expect the RBA to remain cautious and watchful of the data flow,\" she told AAP.\n\n\n\nFor Joiner, the figures are a sign the RBA will be in a \"bind\" and doesn't think it would cut rates at the next meeting.\n\n\n\n\n\n\"The unemployment rate is uncomfortably high for where the RBA expected it to be … The unemployment rate is rising, but inflation is also starting to potentially accelerate.\n\n\n\n\n\n\"It can't go into its November meeting saying the unemployment rate has risen, so let's cut rates immediately — it has to be concerned about the inflation outlook too.\"\n\n\n\n\n\n— With additional reporting by Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/government-considering-offshore-recognition-of-migrant-skills/oyoypsu23",
        "title": "Government considering offshore recognition of migrant skills",
        "publish_date": "Thu, 16 Oct 2025 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nHome Affairs Minister Tony Burke has revealed the government is considering offshore recognition of skills to avoid lengthy wait times for migrants once they arrive in Australia.\n\n\n\n\n\nAt least 620,000 permanent migrants are working below their skill level in Australia, according to government figures.\n\n\n\n\n\nMr Burke made the comments during his first National Press Club address as home affairs minister.\n\n\n\n\n\nDespite the need for changes to the skilled migration program, Mr Burke says Australia is recognising an increasing number of skilled migrants.\n\n\n\n\n\n\"Last year, 21,000 visas for healthcare workers, 4300 visas for teachers, 15524 for construction, we have tripled the number of visas we're giving for construction.\"\n\n\n\n\n\nAnd he says it's necessary to give out that many visas to meet the need for skilled migrants in Australia.\n\n\n\n\n\n\"If these are the areas where people want to cut, then they need to explain, which hospitals they're going to say don't have to fill every shift. Which education providers won't be - teaching the full range of subjects any more? Which construction projects are willing to wait longer for, including housing projects, if we're not going to have the labour we need to get them built.\"\n\n\n\n\n\nMr Burke also acknowledges there are challenges for the skilled migration system for migrants who have not acquired their visa through the employer sponsorship scheme.\n\n\n\n\n\nHe says his team is also working on the possibility of addressing the skills mismatch among migrants, that often leads many to work in other jobs, such as food delivery or Uber driving, rather than with their professional skills.\n\n\n\n\n\nHe says recognising skills offshore, before migrants arrive in the country is one strategy.\n\n\n\n\n\n\"We haven't landed on it. This has been a wicked problem that no government has been able to solve in the lifetime of any of us. But it's something that if we can unlock this, then everybody wins. The economy wins, and the immigrant who is being given of a promise of what it will be like to work in Australia wins as well.\"\n\n\n\n\n\nMr Burke also announced he will close down a loophole in the migration system that's been fueling money laundering and crypto scams.\n\n\n\n\n\nWhen international students leave Australia after graduation, their empty bank accounts can become what are called money mules, where criminals launder their money.\n\n\n\n\n\nMr Burke says he's approached universities for help to share the message with international students.\n\n\n\n\n\n\"Our banks had to close 22,000 mule accounts being used in this way. Overseas students need to be told the fact that if you are offered to hand over your bank details, not only is it a crime - not only are you breaking the law in doing that, but you're also creating a situation where you are probably providing a means for child exploitation, for drug trafficking, for some of the worst elements of organised crime.\"\n\n\n\n\n\nIn a submission to the August Economic roundtable, advocacy group Activate Australia's Skills touched on the problems that industry and skilled migrants face in Australia.\n\n\n\n\n\nThe group estimates that Australia's economy could grow by $9 billion every year or $25 million a day, if the skills of migrants were put to better use.\n\n\n\n\n\nMr Burke's proposal for offshore skill recognition has also been welcomed by some in-demand industry groups, such as Master Builders Australia CEO Denita Wawn.\n\n\n\n\n\nShe says the government needs to attract roughly 100,000 extra workers for the country's construction needs.\n\n\n\n\n\nBut the Opposition leader Sussan Ley says there's still one issue around migration that Mr Burke hasn't addressed, and that's what she says is the high migration rate.\n\n\n\n\n\n\"And that is not the fault of any migrant or migrant community. I was a migrant to Australia, and I meet amazing migrants wherever I go. And I value contribution that they made. And the fact that they chose to come to Australia, we celebrate that every day. But let's not forget that this government allow a million migrants in a two-year period, much much higher than any two-year period in our history.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australia-rental-affordability-myth-that-doesnt-match-reality/8pc3nse4m",
        "title": "Australia’s rental affordability 'myth' that doesn’t match reality",
        "publish_date": "Thu, 16 Oct 2025 18:37:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "If you can't find an affordable place to rent in a major city, should you move to a regional area?\n\n\n\n\n\nAs the country continues to grapple with a housing affordability crisis and record-high rental prices, it's a question that many Australians face.\n\n\n\n\n\nHowever, moving away from a capital city can come with a range of potential sacrifices — from having to find new employment to being physically disconnected from one's family and community.\n\n\n\n\n\nWhat's more, finding an affordable rental in a regional area can also be gruelling, even for those working in some of the country's most essential industries — or so new research suggests.\n\n\n\n\n\nOn Thursday, social advocacy group Anglicare Australia released its third annual snapshot of rental affordability for those it classified as essential workers, saying its results showed finding an affordable place to live was \"incredibly challenging\" for Australians in those fields.\n\n\n\n\n\nA companion to its long-running rental affordability snapshot, the report assessed more than 51,000 rental listings across the country, testing them for affordability across 16 essential worker categories.\n\n\n\nAmong those categories were workers in the hospitality, aged care, childcare and construction sectors, as well as cleaners, firefighters, meat packers, nurses and school teachers.\n\n\n\n\n\nAffordability was measured for a single person earning an adult full-time award wage for the relevant occupation.\n\n\n\nWhat did Anglicare's report find?\n\nAnglicare's report found negligible change across all essential worker categories over the last year, with very little change in affordability across the board.\n\n\n\n\n\nIn particular, there were sharp declines in affordability for teachers and social and community service workers.\n\n\n\n\n\nAmong the 51,238 total listings surveyed, there were 417 affordable rentals for an early childhood educator, hospitality worker or nurse — 0.8 per cent.\n\n\n\n\n\nSchool teachers had the highest number of affordable rentals available to them — 1,672, or 3.3 per cent — followed by firefighters at 1,651, or 3.2 per cent.\n\n\n\n\n\nThe report emphasised that \"no part of Australia offers relief from the crisis\".\n\n\n\n\n\nFor hospitality workers, there were no affordable rentals among the listings in the ACT, five in the NT, and 80 across Victoria.\n\n\n\n\n\nAnglicare's report found a cleaner would be able to afford less than 1 per cent of rental properties in the Southern Highlands or Hunter Valley in NSW, or in Central Queensland.\n\n\n\nAnglicare's report found a cleaner would be able to afford less than 1 per cent of rental properties in some regional parts of NSW and Queensland. Source: Getty / shironosov They would be able to afford less than 3 per cent in the regional Victorian city of Geelong, Cairns in Queensland, or in the outback regions of the NT.\n\n\n\n\n\nThe results, it said, disproved the \"myth\" that Australians struggling to find an affordable home in a capital city should simply move to a regional area where rent is cheaper.\n\n\n\n\n\nThe report said while many areas had experienced increases in affordability from last year, there were large swings in the opposite direction in others, with steep drops in outback Queensland and far-west NSW.\n\n\n\n\n\nAnglicare chief executive Kasy Chambers said the private rental market was \"failing\" many ordinary Australians, who she described as the country's \"backbone\" — those who performed the essential services required to keep it going.\n\n\n\n\n\nAnd the issue, she said, was widespread.\n\n\n\n\n\n\"Right across the country, there's nowhere basically where you have any good levels of affordability,\" she told SBS News.\n\n\n\nLISTEN TO Wanted: Essential workers in regional Australia SBS News 06:22 English\n\nChambers said that, while most people would assume the private rental market should serve \"middle Australia\", the report's findings showed it wasn't doing that.\n\n\n\n\n\nA lack of affordable rentals can also compound other cost-of-living pressures and scarce job opportunities, issues felt more intensely the further away one is from a major city, she said.\n\n\n\n\n\n\"We're finding that more and more we're having to actually provide housing to get workers, particularly to regional areas in aged care and things like that,\" she said.\n\n\n\nAre rents still cheaper in regional areas?\n\nWhether they fall into the category of 'affordable' or not, median rents are still lower in regional parts of the country compared to the capital cities.\n\n\n\n\n\nProperty group Domain's rental report for September showed typical weekly rent across the combined capital cities was $650, dropping down to $585 a week across the combined regional areas.\n\n\n\n\n\nYear-on-year, Australia's regional areas collectively experienced a 6.4 per cent increase in median rents, rising from $550 in September 2024.\n\n\n\n\n\nDomain senior economist Joel Bowman said the \"growth momentum\" of rental prices was slowing in both capital cities and regional areas, but was doing so from a slightly higher level in the regions.\n\n\n\n\n\n\"If we're looking at the most recent quarters, there are clear signs that rent growth is still slowing in the regional pockets by and large,\" he told SBS News.\n\n\n\n\"For example, in regional New South Wales, regional South Australia and regional Western Australia, the median rents for houses did not grow in the September quarter compared to the June quarter.\n\n\n\n\n\n\"But the annual growth is still coming off that higher rate, given that we did see notable increases last year. But they're starting to wash through. I think, by and large, affordability constraints are really capping the extent to which rents can increase in both the capital cities and the regions.\"\n\n\n\n\n\nBowman said the slowdown was not due to supply, as vacancy rates remained very low across the board, including in regional pockets.\n\n\n\n\n\nBut he said landlords were struggling to increase rents, as renters were simply unable to pay for them.\n\n\n\n\n\n\"So it's really those affordability elements that I think are capping those rent increases.\"\n\n\n\n\n\nIn the meantime, though, unaffordable rentals will still be out of reach for the many in \"ordinary\" industries who are unable to pay for them — regardless of whether they're cheaper than their equivalents in capital cities.\n\n\n\nWhat can be done about unaffordable rentals?\n\nChambers pointed to several issues she said were contributing to a lack of affordability, including the precarious nature of housing for those in the private rental sector, meaning many renters moved house far more often than would be desirable.\n\n\n\n\n\nAnglicare's report called for stronger protections for renters and, in particular, a consistent national approach rather than the \"patchwork of different rental laws\" between states and territories.\n\n\n\n\n\nChambers said uncoupling wages from the private rental market was also necessary, as wage growth had failed to keep up with the cost of housing.\n\n\n\nHowever, while Anglicare's report suggested several possible solutions for addressing Australia's rental affordability issue, it said those would do little without taxation reform.\n\n\n\n\n\nIt called for an overhaul of Australia's tax system, including a phasing out of the Capital Gains Tax discount over the next 10 years, and a phasing out of negative gearing deductions for new investors in the private market.\n\n\n\n\n\n\"Without reforming these incentives, other solutions will be piecemeal efforts,\" it said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/survey-finds-australians-sense-of-belonging-has-been-declining-over-time/4yqlu4q17",
        "title": "Survey finds Australians' sense of belonging has been declining over time",
        "publish_date": "Thu, 16 Oct 2025 09:34:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Survey finds Australians' sense of belonging has been declining over time\n\nPublished 16 October 2025, 7:36 am\n\nA new study has revealed younger generations in Australia feel more disconnected than ever. While researchers say communities are showing resilience in the face of cost-of-living pressures and global uncertainty, levels of social cohesion remain historically low.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/chris-bowen-extols-australia-india-clean-energy-partnership/k862o43pp",
        "title": "Chris Bowen extols Australia India clean energy partnership",
        "publish_date": "Thu, 16 Oct 2025 09:10:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/special-episode-inside-the-gaza-ceasefire-hostages-prisoners-a-negotiator/p3ustu2tm",
        "title": "SPECIAL EPISODE: Inside the Gaza ceasefire: hostages, prisoners & a negotiator",
        "publish_date": "Thu, 16 Oct 2025 07:25:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/asx-hits-record-as-jobless-rate-rises-to-4-5/yfl4iry0i",
        "title": "ASX hits record as jobless rate rises to 4.5%",
        "publish_date": "Thu, 16 Oct 2025 06:12:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/government-considering-offshore-recognition-of-skills-to-solve-wicked-shortage/4b3nhd2pl",
        "title": "Government could make offshore skills change to solve 'wicked' problem",
        "publish_date": "Thu, 16 Oct 2025 04:54:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Home Affairs Minister Tony Burke has revealed the government is considering offshore recognition of skills to avoid lengthy wait times for migrants once they arrive in Australia.\n\n\n\n\n\nAt least 620,000 permanent migrants are working below their skill level in Australia, according to government figures.\n\n\n\n\n\nMany who travel to Australia with in-demand skill sets report finding the process of having their qualifications recognised lengthy, expensive and confusing.\n\n\n\n\n\nThis often leads them to work in other jobs, such as food delivery or Uber driving, far from home support during the process.\n\n\n\n\n\nDuring his first National Press Club address as home affairs minister on Thursday, Burke said the government is \"working through\" the possibility of offshore recognition or further training.\n\n\n\n\"There's conversations about exactly that. I've had partner countries raise that with me as well,\" Burke said.\n\n\n\n\n\n\"The challenge is to find which of the careers and skill sets you could train for that don't require a practical.\"\n\n\n\n\n\nHe explained that the government would have to either be confident that the qualification doesn't require an onshore practical assessment or provide offshore training that meets the necessary standard.\n\n\n\n\n\nHe said it was all part of the discussions the government is \"working our way through\", stopping short of making any announcement.\n\n\n\nHowever, Burke noted that those who arrive in Australia on sponsored visas, with employment already lined up, do not face these barriers.\n\n\n\n\n\n\"This has been a wicked problem that no government has been able to solve in the lifetime of any of us,\" he said.\n\n\n\n\n\n\"If we can unlock this, then everybody wins. The economy wins, and the immigrant who is being given a promise of what it will be like to work in Australia wins as well.\"\n\n\n\n\n\nIn its submission to the August economic roundtable, Activate Australia's Skills estimated the nation's economy could grow by $9 billion every year or $25 million a day, if the skills of migrants were put to better use.\n\n\n\n\n\nActivate Australia's Skills is an alliance campaign of businesses, unions, social services and community groups pushing a skills and qualifications recognition policy.\n\n\n\nWhat industries could the government target first?\n\nFelix Pirie, CEO of the Independent Tertiary Education Council Australia, noted several sectors could benefit from offshore recognition to expedite the process.\n\n\n\n\n\n\"There is the capacity for some qualifications to be delivered offshore and recognised in Australia, where the additional elements required for Australia are delivered by Australian providers in an offshore context,\" he told SBS News.\n\n\n\n\n\n\"There are already independent skills training providers delivering qualifications in hospitality, aged care, early learning and so on, in places like the Philippines, in Indonesia, and they're delivering Australian qualifications in those places, and those graduates from those qualifications are ready and able to come to Australia and work.\"\n\n\n\n\n\nPirie described the suggestion as a \"really positive thing\", but stressed the government \"can't lose sight of the need to have students in Australia supporting our international education sector\".\n\n\n\nIn their 2024 report, Master Builders Australia estimated migrants in construction faced an average 18 months' wait and $10,000 bill to have their skills recognised.\n\n\n\n\n\nMaster Builders Australia CEO Denita Wawn told SBS News she welcomed proposed changes to skilled migration, estimating the government needs to attract roughly 100,000 extra workers for construction needs, including building the National Housing Accord target of 1.2 million homes.\n\n\n\n\n\n\"The building and construction industry is facing skills shortages that can't be filled domestically alone.\n\n\n\n\n\n\"We welcome any discussions with government about how we reduce the costs and long wait times skilled migrants face to have their experience and qualifications recognised without comprising on standards.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/goodfood/brisbane-eating-out/top-french-chef-launches-footloose-birria-pop-up-in-heritage-space-20251016-p5n320.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Top French chef launches footloose Birria pop-up in heritage space",
        "publish_date": "Fri, 17 Oct 2025 12:56:54 +1100",
        "category": "finance",
        "authors": [
            "Matt Shea"
        ],
        "text": "Advertisement\n\nEating outFood Top French chef launches footloose Birria pop-up in heritage space An empty Gabba restaurant and an old pizza oven equals fun, fancy-free Mexican you need to pay attention to. Here’s what to expect. Matt Shea October 17, 2025 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nBirria tacos aren’t easy. You need to get your braise right. You need the correct corn for your tortillas, find the right amount – and type – of chillies, get your crisp right. You don’t want to make your consomme too watery or too oily. Birria Boy’s Andy Ashby. Morgan Roberts For something so casual and one-handed to eat, a lot goes into the preparation and cooking. You suspect it’s why some of the birria you encounter around town is so often bland and under-seasoned.\n\nAdvertisement\n\nAndy Ashby describes the process as a labour of love. Related Article Brisbane’s best sandwiches? Here are our top picks of the past year “It comes down to understanding the culture and getting the correct ingredients,” Ashby says. “We’re not just picking chilli off the shelf. We’re getting them imported from Mexico and going correctly down those channels and getting the right varieties, because they all have different properties. “If you don’t respect what birria is and give it that time that it needs to just breathe and do its thing, you’re bastardising the culture of it.\n\nAdvertisement\n\n“I’m not Mexican, so I wouldn’t want to make any claims to authenticity, but that just means I need to do more R&D, not less.” Crispy birria tacos are the main draw at Birria Boy. Morgan Roberts Know what else is hard? Running a restaurant at the Mater Hill end of Stanley Street in Woolloongabba. It’s a beautiful heritage set of buildings, but also in a weird no man’s land when it comes to nearby residential areas that can act as regular patronage. But Ashby has made it work with C’est Bon, which, since he took the reins in 2020, has slowly built a reputation as one of the city’s best French restaurants.\n\nAdvertisement\n\nIt’s that skill with French food, one of the so-called “mother” cuisines, that Ashby has applied to Birria Boy, his new Mexican pop-up that will open in the former Clarence space, next door to C’est Bon. The Birria Boy menu is short and sharp and includes an $18 margarita. Morgan Roberts “I think so,” Ashby says. “French cuisine has so many layers. When we go to make a nice consomme, say, there are essential foundations to that process. “You apply that same methodology, but obviously with different ingredients. Right now, I’ve a mole negro and a mole rojo on the stove right now. These bad boys will maybe be going off for up to 10 hours. “But it’s that fundamental building aspect that I’ve learned throughout my career and I’m taking across to Birria Boy.”\n\nAdvertisement\n\nThere have been some cosmetic touch-ups to the old Clarence space on Stanley Street. Morgan Roberts Birria Boy’s menu is, as you’d expect for a pop-up, pretty straightforward and makes use of the venue’s wood-fired oven – a relic from its Vespa Pizza days that remained dormant during the Clarence years. The taco menu includes three birria tacos – a signature wagyu beef, a goat (the traditional meat for birria) and a mushroom – all served on housemade masa flour tortillas. There are also two regular tacos – a duck carnitas and a tempura king prawn. There’s also a clutch of larger plates cooked on wood fire, including pork neck, chicken asado and cod cooked in banana leaf, with all served with tortillas and sauces. Ashby is making use of the wood-fired oven not used since the premises’ Vespa Pizza days. Morgan Roberts\n\nAdvertisement\n\nBeyond that, it’s a bunch of snacks – corn ribs, chicharrones, a torched avocado guacamole, that kind of thing – and a few sides. For drinks, there are cocktails – including an $18 house margarita – built on high-quality mezcals such as Bozal and Lost Explorer, Mexican beers, and a selection of other spirits. There’s also BYO wine for $20 corkage per bottle. The fit-out remains much the same as the Clarence days, split across two of the heritage brick-walled tenancies in the old Shop Row building on Stanley Street, but Ashby has given it a liberal splash of red paint in places, and installed black tiling behind the open kitchen out front, finishing it with a neon sign that reads “Mexican”, just in case you were in any doubt about what this place is all about. Birria Boy will open Thursday to Monday each week. Morgan Roberts Ashby says it’s meant to be fun and fancy-free – the kind of thing you can dip into before or after a game at the Gabba or a show at the Princess Theatre around the corner.\n\nAdvertisement\n\n“We want to make sure we look after that crowd that goes to the game or a show at the Princess,” he says. “It’s just a little love on the plate. “Mexican has come such a long way in this city and it’s also about paying respect to guys who have really pushed it along, like Mama Taco [in West End] or Dan [Quinn] from Baja – he’s been so diligent just in terms of giving me some direction, which has been awesome. “That’s what hospitality is all about.” Open Thu 4pm-late; Fri-Sun 11.30am-2pm, 4pm-late; Mon 4pm-late. 617 Stanley Street, Woolloongabba. birriaboy.com.au\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Food\n\nFor subscribers Matt Shea is Food and Culture Editor at Brisbane Times. He is a former editor and editor-at-large at Broadsheet Brisbane, and has written for Escape, Qantas Magazine, the Guardian, Jetstar Magazine and SilverKris, among many others.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/ozharvest-and-woolies-reach-incredible-food-rescue-milestone-20251017-p5n3b3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "OzHarvest and Woolies reach incredible food rescue milestone",
        "publish_date": "Fri, 17 Oct 2025 12:40:43 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "OzHarvest and Woolies reach incredible food rescue milestone\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/titmus-opens-up-on-shock-retirement-and-what-s-next-for-the-swimming-superstar-20251017-p5n38z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Titmus opens up on shock retirement and what’s next for the swimming superstar",
        "publish_date": "Fri, 17 Oct 2025 12:34:36 +1100",
        "category": "sports",
        "authors": [
            "William Davis"
        ],
        "text": "Ariarne Titmus says there was nothing left for her to achieve after the 25-year-old Olympic superstar shocked the sporting world by calling time on one of the most successful swimming careers in history.\n\nThe four-time gold-medal champion said she was walking away from the sport with no regrets a day after she announced she would be retiring.\n\n“I gave up a lot,” Titmus said in Brisbane alongside her parents and partner on Friday morning.\n\nFour-time Olympic gold medallist Ariarne Titmus with family members. Credit: AAPIMAGE\n\n“Growing up, as a teenager I lived a different life, and then through my early 20s I made a lot of decisions to put my social life and my personal life on the backburner to put my sport first.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/racing/peter-v-landys-and-the-turf-war-splitting-sydney-racing-on-everest-day-20251016-p5n2xj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Peter V’landys and the turf war splitting Sydney racing on Everest day",
        "publish_date": "Fri, 17 Oct 2025 12:29:41 +1100",
        "category": "finance",
        "authors": [
            "Chris Barrett"
        ],
        "text": "Racing NSW and the ATC were at odds ahead of The Everest carnival over the terms of a deal to establish Base Camp, a new $7 million trackside corporate enclosure driven by V’landys, which has been set up in such a rush that building work is expected to continue through Friday night. The sacking of ATC chief executive Matt Galanos then set off a chain of events that led to a sensational public admonishment of the club by Racing NSW chair Saranne Cooke, technically V’landys’ boss, who warned there were “significant doubts about its ability to survive without ongoing bailouts”. Australian Turf Club chairman Tim Hale argues the member-owned organisation is financially secure. Credit: Steven Siewert Two club directors quit, with one going public with claims of dysfunction on the board, leaving only four remaining – Hale, media personality Caroline Searcy, technology executive and horse owner David McGrath, and Annette English, a commercial lawyer with close ties to the breeding industry. Three of them were opposed to the controversial proposed $5 billion sale of Rosehill for housing, which triggered a parliamentary inquiry last year before ultimately being defeated by members in May.\n\nThe Racing NSW intervention has brought the sport’s complex, much-debated flow of hundreds of millions of dollars a year in wagering revenue into back into focus. Most of it lands in the coffers of Racing NSW, which straddles the roles of both regulator and commercial juggernaut, distributing money onwards but also accumulating a war chest that includes $150 million in property. V’landys told last year’s Rosehill inquiry an extra $3 billion had been injected into the industry thanks to Racing NSW’s 2012 High Court win that made the bookies pay up and as a result of its negotiations with the state government on betting-related taxes. Last year’s Everest day was attended by a record crowd of 49,117. Credit: Getty “This is all new money. Racing NSW’s initiatives have made the money and now some want the keys to the castle,” he said in a written presentation to inquiry committee members. Hale says these are “industry funds” and much of what is channelled to the club from Racing NSW is earmarked for prizemoney and bonuses paid directly to owners rather than for the club’s operating costs.\n\nV’landys told this masthead the club’s costs had soared and it was not generating enough of its own revenue. “Whatever way you look at it, we’re giving them a lot more money than we’ve ever given them,” he said. With the blowtorch on ATC’s governance, including unspecified alleged code of conduct breaches by directors, eyebrows have also been raised about how Racing NSW has conducted itself. Just this week, the NSW parliament’s privileges committee delivered it a slapdown for its behaviour during the Rosehill inquiry, while this masthead earlier this year reported how Cooke transferred a block of land near Bathurst racecourse to Racing NSW for $1 after buying it in her own name. It also emerged at the inquiry that Racing NSW did not have a human resources department, but a “HR function” carried out by general managers. Cooke said at the time there was nothing inappropriate about the land deal, on which stamp duty was paid by Racing NSW. V’landys maintained the organisation was just defending itself with letters sent to the Rosehill inquiry that included allegations of impropriety against former staff it believed were behind confidential evidence about Racing NSW.\n\nMark Latham, a perennial thorn in V’landys’ side, has been Racing NSW’s loudest detractor but in the strangest of twists has become an ally of sorts in the ATC affair – if only of the enemy-of-your-enemy-is-your-friend kind. Furious at being banned from the club’s tracks over a run-in with club executive Steve McMahon and thrown out of Randwick a fortnight ago, the Independent MP has branded Hale as “Jellyfish Tim”, saying he hopes the board is sacked. As for V’landys himself, there have been fresh questions from industry critics about dual roles as racing’s boss and a hands-on chairman of the Australian Rugby League Commission, specifically about how much attention he can devote to his full-time job when he is in charge of two major sports. After more than two decades atop racing, his future has been the subject of much speculation. The latest rumour spreading like wildfire is that he will run the Brisbane Olympic Games in 2032. V’landys doesn’t know how it got started – “no one has contacted me” – and there is nothing to indicate there is any basis to it.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/meet-the-next-generation-of-coaches-hoping-to-launch-into-the-nrl-20251014-p5n2ei.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meet the next generation of coaches hoping to launch into the NRL",
        "publish_date": "Fri, 17 Oct 2025 12:22:27 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "When it was determined the Brisbane Broncos needed someone to inject a tough, physical edge, one of their former enforcers was identified as the perfect candidate.\n\nBen Te’o made a triumphant return to Red Hill after spearheading the Redcliffe Dolphins to the Queensland Cup final in 2024, tasked with turning the underperforming NRL outfit into a defensive juggernaut.\n\nWhile head coach Michael Maguire – who led Te’o to a premiership as a player with South Sydney – put his troops through a gruelling fitness regimen, it was Te’o who instilled the value of first contact at the tackle.\n\nBen Te’o made an immediate impression at the Brisbane Broncos. Credit: Getty\n\nIt took time for the squad to implement what he was putting in place.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/a-private-island-and-tax-free-wages-this-is-the-nrl-s-master-plan-for-the-png-chiefs-20251016-p5n352.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A private island and tax-free wages: This is the NRL’s master plan for the PNG Chiefs",
        "publish_date": "Fri, 17 Oct 2025 12:00:00 +1100",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "Airways Hotel is the current preferred option of the NRL. Credit: NRL Photos\n\nThe NRL and PNG franchise are considering several options. The Herald visited two of the main accommodation options for the Chiefs Village.\n\nHowever, before they can do that, one of the greatest obstacles confronting the Chiefs will be convincing players and their families they will be safe within the country.\n\nThere are bold ambitions to begin talking to players in the coming weeks, plans to pursue Ivan and Nathan Cleary, and predictions of what could be the most valuable jersey in the NRL.\n\nThe Chiefs name was unveiled in Port Moresby last weekend, with the Herald invited to sit in on key meetings, tour potential accommodation and interview key stakeholders.\n\nThe NRL and the PNG Chiefs have begun selling the tax-free dream, revealing their plans to lure players and their families to Papua New Guinea from the end of 2027.\n\nAdd articles to your saved list and come back to them any time.\n\n“I’ve spoken to a lot of people in PNG and the reputation is bad, but the reality is not like that,” Chiefs board member and former ARL Commission director Catherine Harris said.\n\nThere is an undertaking from the resort owners to build 80 villas that would house the NRL players and their families before they arrive for pre-season training at the end of 2027, ahead of their entry into the competition in 2028.\n\nThe facility has a tennis court, basketball court, playground, swimming pools, beauty salon, squash courts, restaurants, gym and its own medical centre.\n\nThe appeal of the 11-hectare facility is the available green space and facilities that would be more appealing to families than high-rise apartment and hotel complexes.\n\nThe resort is next to the international airport and fenced off from the outside world.\n\nComplete with its own private island and overwater bungalows just 15 minutes off the coast of Port Moresby, the Airways Resort is the preferred player village of the Australian Rugby League Commission.\n\nThe other option the NRL is considering is the harbour front Marriott apartments. There is vacant land on the water for a purpose-built accommodation facility.\n\n“One is for families to come out here during the week. The mothers can take the kids and come out for the day. It’s also a great overnight island, so they can come here with their partners or when family members come over to visit during the season. It’s a great place to break the monotony of staying in the players’ and staff village.”\n\nLoloata Island is privately owned by the Airways Resort and will be available to players and families. Credit: NRL Photos\n\n“I think this island can work two ways,” Chiefs chairman Ray Dib said.\n\nAs part of the deal, players and their families will have access to the Loloata Island resort.\n\n“Everybody is so conscious about security, it’s almost safer because everyone is so conscious of it. It’s like working in a workforce where safety is really important. You feel safe. It’s the same here in PNG.”\n\nThe other major appeal of the Marriott Apartments is the indoor-outdoor mezzanine level, which is being dubbed “NRL House” and is being offered as a private facility for players and their families.\n\nThe pool overlooking the harbour in the existing Marriott building being offered to the NRL. Credit: NRL Photos\n\n“Since I’ve been going there, I’ve never witnessed or experienced any concerns. But there’s obviously places where you don’t go after dark, or you [don’t] drive down certain streets.”\n\n“Look, safety is a priority,” Dib said. “Some years ago, I took my wife and my daughter there when we built a school with the Bulldogs there. They never had a concern.\n\nThis is a concern for the NRL despite the appeal of a waterfront location and new facilities adjacent to a fast-developing CBD.\n\nWhile the harbour front precinct has a heavy security presence, it’s not separated from the outside world.\n\nThe harbourside site owned by the Marriott which is being considered as the site for the Chiefs’ accommodation village. Credit: NRL Photos\n\n“There’s no question about that. Otherwise, we wouldn’t be doing this. But it’s long term, and it requires investment now. And the long-term gains are that as this country develops and as the ecosystem develops, there are a number of revenue drivers or spin-offs from it.\n\n“It is going to diversify, strengthen, and grow the game’s whole of game revenues,” he said.\n\nBut NRL chief executive Andrew Abdo hit back at suggestions the league was out of its depth with this project.\n\nIt is viewed in some quarters as a $600 million gift from the government to the NRL, leaving some pundits sceptical of the PNG team’s place in the competition.\n\nMost see this venture as a geopolitical power play.\n\nThe third option is the Hilton Hotel; however, a lack of green space and its location are expected to be deterrents.\n\nPapua New Guinea fans at PM XIII game in Port Moresby. Credit: NRL Photos\n\n“One thing we do know about sporting clubs is that they are becoming increasingly more valuable. So, we are creating a franchise that will one day in the future, in the near future, have a value of somewhere between 50 and $100 million.”\n\nDib echoed that sentiment, predicting high sponsorship revenue.\n\n“We have been inundated with sponsorship over in PNG and in Australia,” Dib said.\n\n“You’ll be surprised by the number of international brands that will be on our jersey. Money won’t be an issue for us. I’m confident we’ll be at the top.”\n\nHow will the Chiefs attract big-name players?\n\nDib held the role of chairman at the Canterbury Bulldogs during a successful period when they reached grand finals in 2012 and 2014.\n\nHe knows players are unlikely to sign long-term contracts to join the Chiefs, but believes the financial perks could represent the opportunity of a lifetime.\n\n“We have to be realistic. I’m confident once we get them there, and they see the facilities and what we have in mind, the vision that Peter [V’landys, ARL Commission chairman] and Andrew have got for the franchise ... that they’ll be able to enjoy the period and also gain financially and academically,” Dib said.\n\nRay Dib and Andrew Abdo on their way out to visit Loloata Island. Credit: Michael Chammas\n\n“Not just the players but also their families. They will come back in a better financial position and ready with their next career move in mind. Let’s be honest, the players have got a limited lifespan in rugby league.\n\n“If you’re a young bloke starting out, you want an opportunity to play in the NRL and maximise your minimum [early career] salary, that’s got to be an attraction. If you’re a player coming towards retirement, if you haven’t really established a great asset base, it’s a place that might help you in the last couple of years of your career.”\n\nHas the tax-free incentive been signed off?\n\nThe Australian government is yet to sign off on the promised income tax exemption, but Abdo says the players have nothing to worry about.\n\n“It’s completely tax-free in PNG,” Abdo said. “And we’re in the process of confirming the exemption for ensuring that non-resident Australians aren’t taxed in Australia.\n\nNRL CEO Andrew Abdo addressed the PNG Chiefs board last week. Credit: NRL Photos\n\n“The legislation exists already, and it’s really just around formalising that through the actual package that will be offered to these individuals.”\n\nResidents of other countries will not be entitled to the exemption as the deal is between the Australian and PNG governments.\n\nAs a result, New Zealand and England residents will not be financially advantaged by joining the Chiefs, reducing the potential player pool.\n\nWhich players are the Chiefs chasing?\n\nThe Chiefs are set to approach the NRL to request that they be allowed to sign players from November 1 this year.\n\nThe club doesn’t want to wait until this time next year to begin building its roster and is keen to try and convince players to join the Chiefs two years before they enter the competition.\n\nThat would require a player to agree to a contract for 2028 and sign a one-year deal for 2027 with another club.\n\nPayne Haas is a free agent as of November 1. Credit: Getty Images\n\n“We would be crazy not to engage [with players], but I just need to speak to the NRL about it and whether we’re allowed to sign future contracts if they are free agents,” Dib said.\n\n“That’s something we’re going to have a discussion very soon about. That would be an ideal position [to talk to players from November 1 this year]. If we can do that then yeah, absolutely we should be doing that.\n\n“If the NRL say we can do that and the player is willing to play with someone else in the interim, we’d be crazy not to see what’s available.”\n\nThat would put Tino Fa’asuamaleaui, Payne Haas, Luke Metcalf, Jayden Campbell, Harry Grant and Liam Henry firmly on the Chiefs’ radar.\n\nV’landys has also made no secret of his desire to lure Wayne Bennett to Papua New Guinea.\n\nNathan Cleary celebrates with his father and coach Ivan Cleary. Credit: Getty Images\n\nHe may get his way because, under its constitution, the ARLC has the final say on whom the coach and chief executive will be.\n\nOther potential targets could include Panthers coach Ivan Cleary, who is off contract at the end of 2027.\n\nIt’s also Nathan Cleary’s final year on contract at Penrith. His partner, Mary Fowler, has Papua New Guinean heritage.\n\nThe stadium and centre of excellence\n\nSantos National Stadium will be the Chiefs’ home base, with plans in place to upgrade the venue’s capacity from 15,000 to 20,000.\n\nThe site for the PNG first grade training field and centre of excellence is right next to the existing stadium that will be used as the team’s home ground. Construction is expected to commence in the new year.\n\nOutside the $600 million Australian government investment that goes to the NRL, the PNG government has pledged to invest in the upgrade of the stadium and a nearby centre of excellence.\n\nThe Chiefs are building a temporary office inside the stadium grandstand, but will move to the centre of excellence which is expected to rival the facilities used by the Parramatta Eels and North Queensland Cowboys.\n\nWhat are some of the other challenges?\n\nGiven the year-round high temperatures and humidity, night matches would provide more suitable conditions when the Chiefs play at home.\n\nFans at the match between the PM’s XIII and PNG in Port Moresby. Credit: NRL Photos\n\nThe lack of public transport in Port Moresby after 6pm is another hurdle.\n\nBy the second half of last week’s PM’s XIII game in Port Moresby, thousands had left the ground.\n\nIt wasn’t due to a lack of interest or disappointment with the scoreline, merely because public transport was the only way many could make it home that night.\n\nParticipation and development programs\n\nThe NRL has invested in development programs to try and establish a pathway for aspiring players.\n\nMost children don’t have access to a grass field, so they play on roads and roundabouts to get their fix of rugby league in a country of 22 provinces and 89 districts.\n\nPNG pathways and development guru Joey Grima presents to NRL CEO Andrew Abdo and the PNG Chiefs board. Credit: NRL Photos\n\nIn 2023, under the watch of Joey Grima – affectionately nicknamed “Boss Man” by the locals and Bigpela Dog (Big Dog) by Prime Minister James Marape – Tony Archer and Scott Barker, the NRL embarked on a pilot program in Port Moresby with 60 of the best young players.\n\nGiven 80 per cent of the estimated 12 million people in PNG live outside Port Moresby, the following year the program expanded to six regions, only accessible to each other by plane.\n\nInvites had to be hand-delivered to the most remote parts of the country.\n\n“We want to be the Brisbane Broncos here,” Grima said in his presentation to Abdo and the board.\n\nLocal fans swarm over Jason Saab after the PM’s XIII game in Port Moresby last weekend. Credit: NRL Photos\n\nIt is estimated that by 2026, when they expand into eight locations, the PNG academy will have a total of 960 participants – three times the size of the Parramatta Eels academy. The program will run over 22 weeks.\n\nThere are no structured competitions available for children between the ages of six and 12, and they rely on schools to provide the opportunity for gameplay.\n\nNRL players are mobbed during a trip to PNG for a PM’s XIII match a few years ago. Credit: NRL Photos\n\nIt is estimated that an Australian child would be exposed to close to 1000 extra hours of rugby league development than the average PNG child before they reach adulthood.\n\nThe shortfall is the focus of the PNG pathways leaders, who are seeking to bridge this divide by expanding access, enhancing training structure, and delivering consistent, high-quality coaching and competitions.\n\nThat’s why the government has invested close to $60 million into the initiative over the next five years, hopeful that the Chiefs will one day be predominantly made up of locals and not rely heavily on Australian players seeking tax-free contracts.\n\n“We’ll be bigger than the Penrith Junior Rugby League,” Dib said. “We will be the biggest nursery of rugby league in the world.”\n\nThe Herald travelled to Papua New Guinea courtesy of the NRL.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/technology/salesforce-defends-security-practices-after-qantas-hack-20251017-p5n38d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Salesforce defends security practices after Qantas hack",
        "publish_date": "Fri, 17 Oct 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "Cloud software giant Salesforce has defended its security practices days after hackers published data from about 5.7 million Qantas customers to the dark web.\n\nAt the company’s Dreamforce conference in San Francisco – the world’s largest AI summit – Salesforce executives stressed that security is the company’s top priority, in their first public comments since the leak.\n\nThe security keynote came just days after hackers published data from about 5.7 million Qantas customers after a breach disclosed in July.\n\nThe Qantas breach, which occurred on June 30, exposed customer names, addresses, phone numbers, email addresses and frequent flyer information. Credit: Oscar Colman\n\nThe incident was part of a broader series of attacks that affected multiple Salesforce customers, with hackers claiming to have stolen nearly one billion records from about 40 companies, including Disney, Toyota and Ikea. Consumers are being advised to brace for a deluge of scams tied to the data dump.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/theatre/shiralee-adaptation-needs-grittier-fabric-to-weave-tale-true-to-mythology-20251011-p5n1qn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Even surrounded by an orchestra, Lime Cordiale’s charisma shines through",
        "publish_date": "Fri, 17 Oct 2025 11:59:27 +1100",
        "category": "lifestyle",
        "authors": [
            "John Shand"
        ],
        "text": "Hearing a new take on this Aussie band was illuminating and this kind of show is something that more artists should aspire to try should the opportunity come their way. THEATRE\n\nMEOW MEOW’S THE RED SHOES\n\nBelvoir St Theatre, October 15, until November 9\n\nReviewed by JOHN SHAND\n\n★★★ A fright wig and false eyelashes can only take you so far. From the time she clawed her way into our hearts nearly 25 years ago, Meow Meow backed up the ditsy exterior trappings in her cabaret shows with a striking singing voice and a zany, gloriously unpredictable stage persona. Meow Meow’s The Red Shoes is a cat of a different colour. She has presented shows derived from Hans Christian Andersen before, reimagining The Little Mermaid and The Little Match Girl. If her Red Shoes, here having its premiere season, happily has no girl’s dancing feet being chopped off, it does feel like it was shooed into the rehearsal room with director Kate Champion while only a kitten’s fetus. Kanen Breen and Meow Meow in Meow Meow’s The Red Shoes. Credit: Brett Boardman\n\nNot a play, it’s a cabaret show with themes of red shoes and greed, lovingly wrapped in improbably juxtaposed songs, ranging from what I presume was her own Why Must There Be an Opening Number? to Radiohead’s No Surprises and Patrick Watson’s Here Comes a River. These are expertly performed with singer Kanen Breen, pianist Mark Jones, bassist Dan Witton and guitarist/percussionist Jethro Woodward, who also become props and characters. Meow, of course, is the main event. To begin, she’s dragged on stage comatose: the eternal show girl, now loath to perform. Then she sings, dances, talks, improvises, climbs things, dies, eats a sandwich, dresses, undresses, pumps the bellows of a harmonium with her foot and even pinches audience members’ handbags and clothing. Yet after a while – and it only last 75 minutes – I was thinking that there was something richer and darker to be mined from The Red Shoes than this; that there’s too much surface and not enough substance. The show unfolds as a series of songs interlinked by the “red shoes” theme. Credit: Brett Boardman Don’t get me wrong: her singing can still be glorious and her sheer zaniness intoxicating. In the latter regard, she’s something of a throwback to the Dada movement of a century ago, with meaning less important than surprising images and songs. But the Meow Meow who can be achingly funny was missing too often, with not much to replace it. She laments the failure of communism in its “all for one and one for all” sense, delightfully reimagines Hamlet as a Eurovision song and quizzes Andersen (Breen) about his layered meanings in The Red Shoes. Little illumination results (although the meaning of Andersen’s tale is very much in the reader’s mind). Nothing is explicit – and that’s, no doubt, the point of the show. But here her theatrical version of chaos theory needs another layer, whether of humour or narrative, or there’s a slight feeling of the empress having insufficient clothes (despite multiple costume changes). Perhaps Champion needed to be a more rigorous director to help distil something beyond random flights of fancy. Meow is so innately gifted, captivating and, above all, audacious, but here it’s just not quite enough.\n\nMUSIC\n\nTEDDY SWIMS\n\nQudos Bank Arena, October 14\n\nReviewed by KATE PRENDERGAST\n\n★★★★★ Finding galaxies of love under tattooed eyelids, and a kingly swagger in white socks riding free on stocky legs, the cuddly American gangster of self-acceptance and soul took Sydney right up to the heavenly high he’s on in his healing journey, with big-budget pyrotechnics to match those big-belted feels. Since the breakout success of I’ve Tried Everything But Therapy (Part 1) in 2023, with its heavyweight hits about toxic co-dependency, addiction and heartbreak, Teddy Swims has come a long way. He’s been to therapy, for one. He’s also found love again, the wholesome kind. Plus, with global tours and billions of streams, the former YouTube cover artist sure is making bank. Teddy Swims with band Freaky Feely at Qudos Bank Arena. Credit: Glenn Pokorny/Qudos Bank Arena “I’m so grateful towards my shitty ex-girlfriend,” he joked good-heartedly to a packed arena. Though Teddy still pays tribute to (Part 1), tucking a few of the best into the encore, this tour is a celebration in the spirit of 2025’s (Part 2), where he’s come out of all that pain to a place he couldn’t have imagined a few years back: enormous gratitude.\n\nSydney is his first Australian tour stop, but his second October show, having won hearts in a kilt at the NRL Grand Finals. Still with Freaky Feely backing – the high school band he’s brought with him on the up and up – it’s a two-hour-long theatre of the full second album tracklist, and then some. A natural performer, we see Teddy crooning Bad Dreams into a mic stand shaped like a voluptuous woman, going back to the raw place with Some Things I’ll Never Know, getting tender with Small Hands devoted to his new baby boy, crowd-pleasing at the close with Lose Control. It’s a powerful, oaky, aching voice: soaked in decades of smoke and liquor; trained on YouTube clips, high school musicals and Atlanta area bands; and set on its god-gifted course to slow-burning stardom by a sweetheart dad who introduced him to the likes of Al Green. The production gives him the panache he deserves, while showing his sense of humour. At one point, following rolling fog and shooting flames, we see Teddy reappear on the summit of a golden ramp on a dunny throne from a hidden trapdoor. Wardrobe whirls him through a white cowboy suit, a tarot-patterned silk robe, a black T and shorts, and a creamy trench coat. Shoes? When you’re that grounded, who needs ’em. It’s no wonder audiences adore him: an everyman shot to pop firmaments on true talent, ribbing and relishing the trappings of class. A role model for a generation leaning into the strength of vulnerability, it’s big love all round. THEATRE\n\nTHE SHIRALEE\n\nDrama Theatre, October 10\n\nUntil November 29\n\nReviewed by JOHN SHAND\n\n★★★\n\nA deep sense of mythology surrounds the reader in D’Arcy Niland’s 1955 novel, The Shiralee. It’s as if the very landscape of mid-20th-century Australia is misanthropic, while those inhabiting it can be as deadly as brown snakes. In adapting the novel, playwright Kate Mulvany and director Jessica Arthur (for Sydney Theatre Company) have been aware of this quality, but they’ve only partially succeeded in transmitting it through their production. Too often this feels like a musical minus the songs: as gooey as a box of chocolates in the sun when attempting warmth of heart, and a little lame and stagy when shooting for menace. Kate Mulvany, Ziggy Resnick and Josh McConville in The Shiralee for the Sydney Theatre Company. Credit: Prudence Upton Niland’s novel tells of Mac, an itinerant jack-of-all-trades, who arrives back in Sydney to find his wife in bed with another bloke. Mac sorts out the bloke with his fists, and his wife by taking their daughter, Buster, and hitting the road. It’s a tale of a little girl adoring her remote, belligerent father, and gradually wearing away his armoured outer layer, almost as slowly as water acts on stone. Given the limitations of child actors, Buster is now nine rather than four, which shifts the dynamic considerably, as a four-year-old is obviously more helpless and dependent. Mulvany uses this shift to craft a more knowing, perceptive and wily Buster, and then Arthur has cast the notable Ziggy Resnick in the role. Although over a dozen years older than Buster, Resnick locates the truth of the bashfulness, eagerness, playfulness, bewilderment, humour, earnestness and staunch morality.\n\nZiggy Resnick and Josh McComville with Paul Capsis (centre) as Desmond the bush poet. Credit: Prudence Upton Mulvany also makes Buster more influential and more evenly matched in size of role with Mac, played by Josh McConville. McConville is convincing as the bluff, taciturn man who solves money problems with his sweat, and people problems with his fists. Tempered like steel in a forge, he is loath to let this slip of a girl, this shiralee (or burden) change his pugnacious, self-absorbed life. Niland peoples his novel with vivid incidental characters, and a further six actors assume multiple roles, including Mulvany herself playing Marge, Buster’s mother, whom she makes more rounded and sympathetic now she’s not just being seen through Mac’s eyes. Aaron Pedersen and Josh McConville in The Shiralee. Credit: Prudence Upton Paul Capsis is ideal as the superbly eccentric Desmond, a cycling swaggie and published bush poet. He (as do most of the minor characters) offers flickers of illumination to the protagonists, especially Buster, who is photographic paper in this regard compared with Mac’s carbon paper. Stephen Anderson, Lucia Mastrantone, Aaron Pedersen and Catherine Van-Davies complete the cast.\n\nUnlike the book, the story is told chronologically, which perhaps partly undermines that mythic quality: time is now linear rather than looped. But Jeremy Allen’s set bolsters the mythology, expertly using the Drama Theatre’s widescreen stage, while Jessica Dunn’s music amplifies the sense of space, foreboding and starry-skied wonderment. Alas, they can’t help the fact that when the play swerves back towards naturalism, it should be woven from grittier fabric. MUSIC\n\nHARRY BENNETTS PERFORMS BEETHOVEN’S VIOLIN CONCERTO\n\nSydney Symphony Orchestra, City Recital Hall, October 9\n\nReviewed by PETER MCCALLUM\n\n★★★½ Harry Bennetts played Beethoven’s Violin Concerto with a sweet sound, fine line and nuanced care, allowing the work’s beauties to unfold lyrically without false drama or undue storminess. Conductor Umberto Clerici began the opening orchestral tutti with unhurried gentleness. There was no hint of spikiness when the string parts took up the quiet opening drum beats, and the phrases breathed in long lines, moving with the breadth and inevitability of a noble river. Harry Bennetts, conductor Umberto Clerici and the Sydney Symphony Orchestra. Credit: Sydney Symphony Orchestra\n\nWhen Bennetts took up the solo entry, it was not with the swagger of a virtuoso driven by posturing heroics, but rather with a focus on allowing the work’s intricacies to blossom with precision and clarity. In the codetta section, as the orchestra starts to surge, Bennett twice responded to the challenge with aptly projected vigour, but on the third, took on the Orphean task of taming them with quiet calm. In the development section, when the soloist brings back the opening theme in B minor, high in the violin’s range, Bennetts created a memorable moment of transparent expressiveness without excess. The cadenza of the first movement (by Joachim) held attention with its even, unpressed resonance, contrapuntal clarity, glowing tone and true intonation without a hint of roughness or unwanted bow noise. All of this, of course, requires some freedom with the tempo which, for me, was slightly overdone in the Coda. The slow movement captured a sense of fresh stillness, Bennett ornamenting the underlying orchestral theme with balanced ornamentation of silvery brightness. I occasionally found the sense of pulse in the orchestral playing floated so freely it almost dissolved. The finale had beguiling buoyancy from both soloist and conductor. After another finely polished cadenza and exuberant Coda, Bennett started the last arpeggio with hushed insouciance as though beginning a new episode before the orchestra emphatically stopped any further discussion. In the second half Clerici and the Sydney Symphony again emphasised gentle lyricism in Schubert’s Symphony No. 4 in C minor, D. 417 Tragic. The first movement was fretful and agitated (‘Tragic’ as a subtitle has always seemed a little overblown) and the second gracious. In the third movement, Clerici and the SSO played Schubert’s cross-accents to create a sense of poised ambiguity. The finale was neat and discursive, as the young Schubert (he was only 19) was prone to be.\n\nDANCE\n\nTHE BOGONG’S SONG: A CALL TO COUNTRY\n\nBangarra Studio Theatre, October 9, until October 19\n\nReviewed by CHANTAL NGUYEN (with James and Teddy Gribble, and Charlie Price)\n\n★★★½\n\nMy co-reviewers Jamie (aged eight), his brother Teddy and their cousin Charlie (both aged six) didn’t even make it to their seats before being captivated by the moody blue uplighting at Bangarra Studio Theatre. It was a foretaste of the atmospheric vibe of Bangarra Dance Theatre’s school holiday show The Bogong’s Song by Yolande Brown and Chenoa Deemal, for ages five plus. It tells the story of siblings Beau and Myee (played by Benjin Maza and Tjilala Brown-Roberts, both fabulous triple threats). They are dream-transported to ancestral Country in the Snowy Mountains, where they must find a missing Bogong moth, healing the land and their own hearts along the way. “They were in sync like all the time when they danced!” Jamie observed. Benjin Maza and Tjilala Brown-Roberts in The Bogong’s Song. Credit: Edwina Pickles The Bogong’s Song features pretty much everything you could think of for a children’s production. There’s acting, singing, rapping, animated backgrounds, talking trees, hand-held puppets, shadow puppets, sing-alongs, and dancing. While the pacing can be patchy and the narrative occasionally lags, enough happens to keep things rolling. And the animal characters are a hit. “I liked the possum and the baby possum!” enthused Teddy. “I liked the lizard,” responds Charlie. “He was funny because he said he would eat the moth but then he didn’t!”\n\nJamie agreed. “He was hilarious! He used a chip packet as a solar panel!” There are also heartfelt lessons. “It was about helping the endangered moths,” explained Jamie. “[The siblings] needed to connect with Country, which meant listening to Country and the land. It made me feel good, but a little bit sad for how the world was treated.” Teddy nodded thoughtfully: “They were trying to not let the worlds separate.” The Bogong’s Song also grapples with Australia’s shockingly young age of criminal responsibility, as Beau and Myee grieve the imprisonment of their deaf little brother Joey. That part, recounted Jamie, is “very, very sad”. “He stole lollies. He went to jail. And he was 10. He was confused and scared. Couldn’t he just get a fine?”\n\nThe high point is the finale, featuring an all-too-short traditional dance featuring ochre paint and didgeridoo music. This part has no wisecracking animals or cartoons, but its power is immediately palpable. The children in the audience become transfixed, completely still and silent, as if responding to some deep, ancient summons that cuts through all the screens, lights, and noise. MUSIC\n\nTHE TALLIS SCHOLARS\n\nSydney Opera House, October 12\n\nReviewed by PETER MCCALLUM\n\n★★★★★ The Tallis Scholars began their eleventh Australian tour with a glowing, subtly invigorated sound of rich density and iridescent edge in the splendid eight-part motet Deus in adiutorium by the 17th century Spanish/Mexican composer Juan Gutierrez de Padilla. In an interview earlier in the day, director and founder of the Tallis Scholars, Peter Phillips, gave some insight into what gives this doyen of Renaissance vocal ensembles its distinctive tonal quality which is so elusive to describe yet instantly loved by audiences worldwide. He spoke of the micro-refinements of tuning that singers undertake when singing without instruments. Equally important, of course, is the talent, dedication and professionalism of the singers and, in Phillips’ case, 53 years of experience in refining and perfecting the Tallis Scholars to lay bare the glories of the Renaissance with transparent clarity.\n\nListening closely to the vibrant chords of Padilla’s work, one can hear, beyond the purity of tone and pitch, small harmonics of the sort one hears in singing from Bulgaria to Tibet that add shafts of colour and engender delight. The program was built around the theme of chant which appeared in beguiling simplicity in the next work, in principio by 12th century abbess, Hildegard of Bingen, sung by a sub-group of female singers with disarming naturalness of line and rhythm. A more recent adaptation of chant-based melodic and polyphonic structures was then presented in Arvo Part’s Triodion, written for the 150th anniversary of Lancing College in Sussex, England. A different range of harmonics emerged in the halos of Part’s delicately soft blends of humming, solo and widely spaced voices, leading to a still central point that even a fretful baby in the audience could not disturb. After another chant by Hildegard the first half concluded with the substantial motet by Jacob Obrecht, Salve Regina, in which varying groupings of the 10 voices coalesced and mutated to create a sense of timeless calm. To start the second half, the singers split into widely separated groups for Allegri’s Miserere mei, Deus. Phillips directed the first chorus from the stage, a solo singer sang chant section from the eastern gallery, while, high in the south-western part of the hall the second chorus was heard magically from behind as soprano Emma Walsh embellished the choral sound by repeatedly ascending with apparently effortless grace to an ethereal high C. Part’s Magnificat and Da Pacem Domine again led listeners to utterances that were at once almost inaudibly quiet yet palpable and definite. After Hildegard’s O ecclesia, Josquin des Prez’ Praeter rerum began with darker low-pitched textures, ending with the richly rewarding choral sound that had been heard at the start and to which it is so easy to become addicted. MUSIC\n\nTRIO ISIMSIZ\n\nCity Recital Hall, October 13\n\nReviewed by PETER MCCALLUM\n\n★★★½\n\nIn the Renaissance, a missa sine nomine was literally “a Mass without a name”, which meant that, unlike most Masses of the time, it didn’t build on pre-existing material. Violinist Pablo Hernan Benedi, cellist Edvard Pogossian and pianist Erdem Misirlioglu have adopted the same paradoxical nomenclature by christening themselves Trio Isimsiz, which is Turkish for “trio without name”. Their program of music by Brahms, Coll and Schubert also consisted of works without names in that all of them were simply called “Piano Trio”, though the trio by Francisco Coll did make references to pre-existing music and styles, which flitted into the background like music half-remembered in a dream. Musica Viva’s Trio Isimsiz – violinist Pablo Hernan Benedi, cellist Edvard Pogossian and pianist Erdem Misirlioglu – at the City Recital Hall. Credit: Dylan Alcock One allusion was to Strauss’ comic opera Die Schweigsame Frau (The Silent Woman) about an old man whose intolerance of noise becomes a vehicle for his torment by the young. It was, in one sense, a metaphor for the way chaotic textures in Coll’s trio fragmented and subverted coherent musical ideas just as they began to emerge. The trio began with a short spiky restless movement in which pizzicato string notes and scattered staccato chords from the piano were thrown frenetically across the range of all three instruments, like someone tearing up a first draft. The second movement, the longest and weightiest, began with a bell-like chord on the piano and explored expressive melody and quiet, lonely spaces, sustaining ideas and building up tension in a more familiar way. The third movement returned to fragmented thinking, lurching in two-note figures from violin and cello accompanied by shattered sprays of notes from the piano.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/why-being-able-to-trade-two-years-into-the-future-skyrocketed-afl-stars-value-20251017-p5n38g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why being able to trade two years into the future skyrocketed AFL stars’ value",
        "publish_date": "Fri, 17 Oct 2025 11:57:10 +1100",
        "category": "finance",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "A question from this masthead to Hawthorn list boss Mark Mackenzie on the opening day of trade period ended up being quite prescient.\n\nReporter: “Mark, what impact do you think having that extra year of future picks will have on the trade period? Are you expecting players to be worth more now?”\n\nPicks at the 2027 draft were packaged up in the trade that sent Charlie Curnow from Carlton to Sydney. Credit: Getty Images\n\nMcKenzie: “It’ll be interesting because I think clubs could ask ... for more. But really, when you think about it, it should be the same values of what it has been previously – you just have a bit more scope to actually trade certain picks and look at those drafts, from two years [away].”\n\nThe AFL gave clubs the green light from this year’s trade period to trade draft picks two years into the future, after being able to go just one year ahead until now.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/imagine-i-hadn-t-gone-to-the-doctor-nic-maddinson-s-private-battle-with-cancer-20251016-p5n36w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Imagine I hadn’t gone to the doctor’: Nic Maddinson’s private battle with cancer",
        "publish_date": "Fri, 17 Oct 2025 11:52:37 +1100",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Even when Dad does manage to take August to the park, which is a five-minute walk, he needs to rest.\n\nInstead, he is slumped on the lounge in their Bondi home. He’s been there on and off for weeks, except between 11am and 4pm. He’s been sleeping for about 12 hours a day.\n\nA few good matches to start the 2024-25 season for NSW in the Sheffield Shield, and Dad might have been opening the batting for Australia last summer against India.\n\nHe’s too young to realise his father, Nic, is a very good cricketer. Not just any good cricketer, but the proud owner of a baggy green – and one of the most exciting batsmen in Australia over the past 15 years.\n\nAugust, a cheerful and energetic two-year-old boy, is confused. Cars. Lego. Passing a footy. Anything. Why isn’t Dad being fun any more?\n\nAugust Maddinson just wants to play with Dad. Just like he’s always done.\n\nAdd articles to your saved list and come back to them any time.\n\nHe doesn’t want sympathy or for this to be a sob story. That’s not in his nature, says his best mate Adam Zampa.\n\nNic Maddinson is glad it’s all over. After this interview, his private battle with testicular cancer will no longer be a secret.\n\n“We just told him that I was sick, and I was taking some medicine that made my hair fall out. We told him I was going to be OK.”\n\n“He understood quite a lot of what was going on. He’s a pretty intelligent kid. He was always rubbing my hair and asking what happened to it.\n\n“The hardest part was having to tell August I couldn’t play with him,” Maddinson says. “I was just so physically exhausted that I couldn’t get off the couch.\n\nAugust has been telling people his dad no longer has hair because the wind blew it away. His mother, Bianca, is six months pregnant with his soon-to-be brother.\n\nA video pops up. Zampa, another star hailing from the NSW south coast, was one of the few who knew about Maddinson’s cancer battle.\n\nHe sips a long black and scrolls on his phone, looking at photos from when chemotherapy kept him in bed most of the day.\n\nFollowing months of appointments, needles, chemotherapy sessions and sleepless nights, Maddinson is finally ready to tell his story – one only a small circle of cricketers have known about.\n\nNic Maddinson ahead of his Test debut against South Africa at the Adelaide Oval in 2016. Credit: Ryan Pierse\n\nAfter three Test matches, six T20 internationals, 129 first-class fixtures, 105 List A games and 144 T20s around the globe, cricket has been an afterthought for the 33-year-old who, half a lifetime ago, was one of the country’s brightest young batting talents.\n\nIn the distance, a curator is preparing a pitch for Saturday’s match between Maddinson’s club, Eastern Suburbs, and Penrith – not that he’ll be playing.\n\nIt’s a gorgeous Wednesday morning in Sydney’s eastern suburbs, and August is walking towards a cafe near Waverley Oval with his dad, mum, and two-week-old brother, Wilder, who is in a pram.\n\n“I thought it would mean a lot. I think I would have regretted it if I didn’t send it.”\n\n“I thought I’ll just do the video and no one will work it out,” Maddinson says of his diagnosis. “I can’t believe I thought I was going OK. Looking at that video, he looks so shit, and sick, and pale. I feel 100 times better than I did then.\n\nZampa’s wife, Harriet, rang Bianca to say there was no pressure to send a video if he wasn’t feeling up to it. Maddinson did anyway.\n\nNic Maddinson (left) and Adam Zampa in 2009 after being picked for the NSW under-19 cricket team. Credit: Greg Totman\n\nOf course, he did. It was his best mate. He knew “Zamps” would love it. The only problem was that Maddinson hadn’t told anyone he was undergoing chemotherapy.\n\nAhead of Zampa’s 100th T20 international against the West Indies in July, Maddinson was asked if he’d like to send a video message that would be played on the team bus ahead of the match in St Kitts.\n\nWhile packing a suitcase at home, Maddinson’s phone rang. It was Orchard.\n\nAt his end-of-season review, Maddinson mentioned the lump to Cricket Australia’s chief medical officer Dr John Orchard. A Friday afternoon appointment was booked in minutes.\n\nThen he felt a lump. His GP thought it was probably a virus, but still recommended a scan. There were no available appointments, so it would have to wait until after the trip.\n\nHe felt sick and run-down but was looking forward to a holiday in Byron Bay.\n\nThis time last year, Maddinson was in the frame for a recall to the Australian Test team. Five months later, after a disappointing season yielding 267 runs at an average of 17.8, he was dropped for NSW’s final Sheffield Shield match against Tasmania.\n\n“To have that pop up for me on an important day for me was really cool.”\n\n“It got me a bit,” Zampa says. “I think people in the team who didn’t know what was going on saw my reaction and thought, ‘jeez, I had no idea’.\n\n“I don’t think you should get on the plane tomorrow,” Orchard said.\n\nThe scans confirmed a tumour. Maddinson rang Bianca at work to break the news.\n\nShe flew up the following day, while Maddinson stayed in Sydney for more tests. He still arrived in Byron Bay on the Sunday for a quick trip “to let it all sink in”.\n\nThree days later, Maddinson underwent surgery.\n\nNSW cricketer Nic Maddinson has overcome testicular cancer. Credit: Louie Douvis\n\n“I was with John waiting for some scans, and that’s when it hit me the most,” he says. “I had the surgery and I didn’t think too much about it.”\n\nThen, after about seven weeks, came the words he didn’t want to hear: “The cancer has spread.”\n\n“Once I found out I had to have chemo, that was pretty hard to deal with,” he says. “It had spread to parts of my abdominal lymph nodes and lung. That was a bit where it was pretty daunting. Bianca was the one asking all the questions. It was a bit of a blur. I’m glad she was there.\n\n“I’m in awe of how strong and supportive she was through everything. She even quit her job as a dentist the day we found out I needed chemo.\n\n“She took on literally everything at home, so I could rest when I needed, all while pregnant and struggling with her own sleep and looking after two dogs and a toddler.\n\n“There were definitely days when it broke me mentally having to get up and go to hospital, and she helped me push through.\n\n“She wanted to sit with me, all day every day, but I felt guilty for wasting her days, so she only came in a handful of times.\n\n“Imagine if I hadn’t gone to the doctor.”\n\nNic Maddinson celebrates notching a ton for Victoria against NSW in 2020. Credit: AAP\n\nMaddinson thought he’d miss a few weeks in the off-season. But he was told his vision, hearing and fitness might never be the same. Reality hit home.\n\n“Cricket was the last thing I wanted to think about,” he says.\n\nZampa was worried.\n\n“In my head, I’m unfortunately thinking about the worst-case scenario,” the leg-spinner says. “What’s going to happen to my best mate? He had a really positive outlook on it. He just got on with it and didn’t make a fuss about it.”\n\nOn May 19, Maddinson embarked on his greatest challenge yet. Facing the fastest bowlers in the world was light work compared to five hours of chemotherapy every day at St Vincent’s Hospital – a five-minute drive from the SCG.\n\nNine weeks. Three cycles. Three weeks each. Endless sleep.\n\n“At the start, I actually felt OK,” Maddinson says. “It takes a while to get into your system. By day three, I felt like I’d been hit by a truck. I didn’t really improve much after that.”\n\nNic Maddinson prepares to begin chemotherapy.\n\nOn day four, things took a turn. NSW teammate Moises Henriques came to visit. He sat silently, watching his mate have his body pumped full of drugs.\n\n“I remember saying to Moey, ‘I just need to sleep today, mate. There’s no point hanging around too long’.”\n\nZampa offered to fly to Sydney whenever he could.\n\n“I’ve never had someone close to me go through it,” Zampa says. “It was drop everything to try and help. He was lucky he had good support around.\n\n“He’s always been really stubborn, so receiving help and asking for it when it’s needed certainly isn’t his strength. I couldn’t have imagined going through it.\n\n“I’m speaking to my wife about it, then getting off the phone to Maddo, and I don’t really have the answers myself or know how to help.”\n\nMaddinson felt bloated and put on weight.\n\n“By the second or third week, I lost all my hair. I was feeling pretty average,” he says. “I was taking types of steroids to manage side effects, but they would keep me up at night. I’d be at the hospital from about 11am to 4pm. Then a sleep. Then I’d force myself to have dinner. I’d sleep until about 1am, but sometimes I’d then be awake until 6am. I found that difficult. I was super drained and felt like I had to sleep 24/7.\n\n“I felt guilty. I couldn’t do anything around the house.”\n\nOnly a handful knew – family, Zampa, Sean Abbott, Henriques, Josh Philippe, Cricket NSW high-performance boss Greg Mail, and a handful of other friends outside of cricket. Word spread quietly, but Maddinson wanted to keep it tight.\n\nDuring the winter, Mail told Blues players.\n\nMaddinson, with no hair, moustache or beard, turned up one morning at Centennial Park to have a coffee with teammates before a fitness session. Hair was always Maddinson’s thing. He once bleached it peroxide blond before a Big Bash game and joked that “Gwen Stefani” was the inspiration.\n\nNic Maddinson’s blond era. Credit: Getty Images\n\n“None of the boys asked, but it was pretty obvious something was going on,” Maddinson says. “I looked completely different.\n\n“I wanted to feel like myself and go for a walk or a run. I didn’t really want to train for cricket. Batting didn’t interest me. I wasn’t envious of them playing. That was the first time in my life. It’s only recently that I’ve really wanted to play.”\n\nHe suspected some players on Australia’s Test tour of the West Indies knew. Some nights, when he couldn’t sleep, he’d watch the first session of action in the Caribbean on television as Bianca and August slept.\n\nSam Konstas, his NSW opening partner, was struggling with the bat for Australia – and so was Maddinson, in a different way.\n\nIn the morning, August would often find his dad asleep on the couch. He just wanted to go to the park again.\n\n“You try and put yourself in those shoes, and it’s almost impossible to explain to your kid why you can’t play with them,” Zampa says. “His little guy Augie is an absolute champion. He’s all over the place and a ball of energy.”\n\nMaddinson adds: “At home, he’d want to chase me down the hallway and tackle me.\n\n“Bianca ended up saying to me, ‘I think you’re trying to do too much’. I tried to ride my bike one day and feel stupid for doing it now. I knew I felt terrible, but I just wanted to do something that I was used to doing.\n\n“It was the slowest and longest nine weeks.”\n\nMaddinson felt foggy and spaced out. He watched a lot of Netflix and cycling races. He deferred an online undergraduate psychology course at Curtin University because he was so exhausted.\n\n“I was in hospital every Monday for about 12 weeks in a row. The first Monday we didn’t have to go into hospital was such a relief.\n\n“The hardest part mentally was having to get a needle every day. I had bruised hands and forearms from the number of needles. I don’t think I could have physically taken myself back in there for one more day.\n\n“I felt I was mentally pretty strong but I think I would have thrown it in.”\n\nJuly 14 was a good day. Chemo was finally done.\n\nMaddinson felt terrible but summoned the energy for a photo with August, who’d made a sign for his dad.\n\nIt said “LAST CHEMO” and was covered with stickers of dinosaurs.\n\nNic Maddinson with son August after his last chemotherapy session.\n\nTen days later, he texted Blues batting coach Nick Larkin.\n\n“Can I come and hit some balls?”\n\nOn July 28, still feeling terrible, he drove to Sydney Olympic Park, padded up and put a helmet on. No one else was there.\n\nLarkin threw down some cross-seamers. The dashing left-hander belted them. He batted for half an hour, hit about 100 balls, and walked out. It was what he needed.\n\n“I didn’t touch a bat for a month after that,” Maddinson says. “It was a weird feeling. Every time I mishit one, I got angry at myself in the nets. It was the first time I could bat without a care in the world.\n\n“I stopped batting for a little bit because I didn’t want to just not care.\n\n“Eight weeks after my last chemo round, I got good news. The treatment had worked.”\n\nThe road back to cricket wasn’t straightforward. The batting and strength returned. His fitness is still a work in progress.\n\n“My recent tests were all good, and I can go about getting back into cricket, which I love,” he says.\n\nVictorian openers Nic Maddinson (left) and Will Pucovski in 2020. Credit: Getty Images\n\nOn Thursday, Maddinson had a centre wicket net session with a few Blues squad members.\n\nOnce he faces some faster bowlers and ticks a few fielding boxes, Maddinson will be eligible for selection – perhaps for Easts, NSW Second XI, or the Blues’ Shield match at the SCG from November 10 to 13.\n\nHave his goals changed?\n\n“It’s tough question to answer right now. Yes and no,” he says. “I would still love to play Test cricket again, but I’m more realistic. The older you get, the less likely it is to happen.\n\n“I had a really good opportunity last year and I just didn’t really grab it. I’m just really excited to try and play cricket again. I was dropped at the end of last year, so I’m not expecting to be straight back in the side.\n\n“The most important thing would be to say I am available. That would be a nice day.”\n\nHe hopes something good comes of telling his story.\n\nNic Maddinson holding new son Wilder, alongside August and wife Bianca.\n\n“I feel very lucky I live in a country where we have good medical care,” he says. “I am in a pretty privileged position to have access to John Orchard. He helped sort out all my appointments and was with me the whole time.\n\n“When I found out I needed chemo, it hit me hard because I almost didn’t go. I thought it would go away. To know that I caught it probably as early as I could have, and it still spread into other parts of my body, that was scary.\n\nLoading\n\n“I just think it’s so important if you have anything you’re worried about, get it checked out.\n\n“It feels silly to not tell my story. If one person reads it and gets checked, I’ll be happy. I grew up in the country and a lot of people fob it off. It’s a ‘she’ll be right’ attitude. Get the stuff checked out, it can make all the difference.”\n\nAugust is back at the cafe with a grin on his face.\n\nIt’s time for the park, a kick of the footy, and a slow, steady return to normal life for the Maddinson family.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/camper-found-alive-after-he-went-missing-for-nine-days-20251017-p5n3ar.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Camper found alive after he went missing for nine days",
        "publish_date": "Fri, 17 Oct 2025 11:52:03 +1100",
        "category": "finance",
        "authors": [],
        "text": "Camper found alive after he went missing for nine days\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/prince-andrew-caught-up-in-spy-case-rocking-britain-20251017-p5n37e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince Andrew caught up in spy case rocking Britain",
        "publish_date": "Fri, 17 Oct 2025 11:48:10 +1100",
        "category": "finance",
        "authors": [
            "Allegra Mendelson",
            "Poppy Wood"
        ],
        "text": "Prince Andrew met a senior Chinese official at the centre of a Beijing spy scandal rocking the United Kingdom at least three times.\n\nThe Duke of York held meetings in 2018 and 2019 with Cai Qi, one of the most senior members of the Chinese Communist Party and a close ally of Chinese President Xi Jinping.\n\nPrince Andrew, right, with Cai Qi in London in May 2018. . Credit: Alamy Stock Photo\n\nCai is understood to be the final recipient of sensitive information allegedly passed to China by two British nationals accused of spying for Beijing, Christopher Berry and former parliamentary researcher Christopher Cash. They maintain their innocence.\n\nThe CCP politburo member involved has not been named in official documents, but biographical details released in court files match Cai alone. Sources also told The Telegraph he was the Chinese official at the heart of a trial against Berry and Cash that was set for this month but fell apart at the last minute after the British government refused to label China an “enemy”. Both Cash and Berry deny the charges.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/tips-and-advice/are-wines-with-leaked-corks-still-drinkable-20251013-p5n22n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Are wines with leaked corks still drinkable?",
        "publish_date": "Fri, 17 Oct 2025 11:37:16 +1100",
        "category": "finance",
        "authors": [
            "Huon Hooke"
        ],
        "text": "My great aunt recently moved into care and, while I was cleaning out her garage, I found dozens of bottles of wine that had leaked or pushed their corks out. Some look OK, though; are they worth selling?\n\n—A.H., Longueville, NSW\n\nUnfortunately, even the bottles that look all right are probably past being pleasant to drink. That’s assuming they’ve all been in the garage for a similar length of time. Younger vintages are likely to have spent less time there in that place and are, therefore, likely to be in better condition. Like most garages, this one is evidently too hot at certain times of the year to store wine safely.\n\nPhoto: Simon Letch\n\nI’ve seen too many “cellars” like the one you describe: wine that’s been kept too long in a hot place is one of the most depressing sights for a wine-lover. You typically see corks pushed out, or filthy bottles with fungus encrusting the capsule where wine has leaked out. Some bottles will be completely empty due to evaporation; others contain a cloudy, murky brown substance that once was wine. It’s enough to bring a tear to the eye, especially when the labels carry the names of famous wineries.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/the-australian-does-a-u-turn-on-controversial-pentagon-press-rules-20251017-p5n38t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Australian does a U-turn on controversial Pentagon press rules",
        "publish_date": "Fri, 17 Oct 2025 11:30:47 +1100",
        "category": "finance",
        "authors": [
            "Calum Jaspan"
        ],
        "text": "News Corp’s The Australian has done a dramatic U-turn on its decision to sign up the Pentagon’s new controversial press rules, which led every major news outlet, including Murdoch-owned Fox News, handing over their passes.\n\nJust hours after The Australian was revealed to be one of just 11 global news outlets to have agreed to the new rules, a spokesperson told this masthead that it had “revoked our assent”, citing press freedom concerns.\n\nMajor news organisations packed up and left The Pentagon this week. The Australian had opted to retain its access, then ‘revoked’ the call. Credit: AP\n\n“The Australian has reviewed the Pentagon’s new press rules and requirements. They raise serious concerns and place undue limits on press freedoms,” a spokesperson for The Australian said.\n\n“Because of The Australian’s long-held position on independent journalism and press freedom, we have advised the Pentagon that we have revoked our assent.”",
        "source": "TheAge"
    }
]