[
    {
        "url": "https://www.9news.com.au/national/nicolette-boele-apologises-over-remark-made-to-hairdresser/2d8c528a-87cd-4ef6-9ed5-2563d63b3b22",
        "title": "Teal candidate apologises for sexual joke made to hairdresser",
        "publish_date": "Tue, 01 Apr 2025 00:57:40 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Independent candidate for Bradfield Nicolette Boele was at her local salon Envy Room in Gordon, on\n\nSydney's\n\nNorth Shore, when she allegedly made the joke to a 19-year-old female staff member.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/uk-birmingham-rubbish-major-incident/9bf3c574-b031-4828-83a8-77f27f6960ce",
        "title": "Seventeen thousand tons of uncollected garbage left on streets",
        "publish_date": "Tue, 01 Apr 2025 00:30:04 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Britain's second-largest city has declared a \"major incident\" after a sanitation worker strike resulted in more than 17,000 tons of garbage collecting on the streets.\n\n\"It's regrettable that we have had to take this step, but we cannot tolerate a situation that is causing harm and distress to communities across Birmingham,\" John Cotton, leader of Birmingham City Council, said in a statement.\n\nPhotos taken by Reuters in Birmingham this month show mounds of uncollected rubbish overflowing from collection bins and dumpsters.\n\nA large pile of garbage in Birmingham, England. (Phil Noble/Reuters via CNN Newsource)\n\nThe dispute between the city and its garbage collectors stretches back to December 2024, when the trade group Unite the Union announced that collectors would strike in 2025 against overpay cuts, a ban on overtime, and the council's elimination of a waste collection role.\n\nThe city said in a statement on March 28 that \"all workers have been offered alternative employment at the same pay, driver training or voluntary redundancy,\" and claimed that the eliminated role posed a liability for city budgets.\n\nA drone view shows rows of trucks parked in a council depot as strike action by Birmingham bin workers enters its third week in Birmingham, England. (Phil Noble/Reuters via CNN Newsource)\n\n\"Birmingham council could easily resolve this dispute but instead it seems hellbent on imposing its plan of demotions and pay cuts at all costs,\" said Sharon Graham, secretary of Unite the Union, in a statement on Monday.\n\n\"If that involves spending far more than it would cost to resolve the strike fairly, they don't seem to care.\"\n\nSince the dispute began, union members have voted numerous times to escalate their strike as the city began using temporary workers to pick up the growing piles of trash throughout Birmingham.\n\nThose contractor pickups have been blocked by picketing workers.\n\nMillions of Muslims around the world mark Eid View Gallery\n\nIn their statement on Monday, the city council claimed that the \"daily blocking of our depots by pickets has meant that we cannot get our vehicles out to collect waste from residents.\"\n\nDeclaring a major incident would allow the city to bypass the picket lines and clean the streets, the city council statement said.\n\nThe sanitation workers, meanwhile, claim that the city's declaration amounts to \"strike breaking\".\n\nThe British government is aware of the strike, Minister of Communities Jim McMahon said in a speech to Parliament on Monday.\n\n\"Well-established arrangements are in place for local areas to escalate issues where they do need support and the government is monitoring the situation closely,\" McMahon said, according to British newswire service PA Media.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/hooters-files-for-bankruptcy-in-us/89bd6c4c-27e9-4d46-ab77-bf03629fe3ad",
        "title": "Restaurant chain Hooters files for bankruptcy in US",
        "publish_date": "Tue, 01 Apr 2025 01:15:45 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "The company's workforce has also come under fire, with lawsuits ranging from racial discrimination to\n\ngender discrimination\n\n. Hooters closed dozens of restaurants last year, blaming rising food and labour costs.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/home-values-reach-new-record-highs-march/9e21a874-18a1-4dec-a3f1-5ea87fbc96fa",
        "title": "Property values reach new record high after interest rate cut",
        "publish_date": "Mon, 31 Mar 2025 22:43:37 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Australian property values reached new record highs in March, reversing a recent downward trend, according to market analysts at CoreLogic.\n\nThe company's national Home Value Index showed an overall increase of 0.4 per cent for the month.\n\nIt makes March the second consecutive month of property value growth, after a three-month decline which saw values drop 0.5 per cent.\n\nProperty values have risen around the country. (Getty)\n\nIncreases were seen around the country, with every capital city except Hobart recording a value rise.\n\nDarwin had the biggest jump at 1 per cent, while Hobart's property prices fell 0.4 per cent.\n\n\"Improved sentiment following the February rate cut is likely the biggest driver of the turnaround in values, along with the cut's direct influence of a slight improvement in borrowing capacity and mortgage serviceability,\" CoreLogic research director Tim Lawless said.\n\n\"With the rate-cutting cycle expected to be drawn out, it will be interesting to see if this positive inflection in values can last in the face of affordability constraints.\"\n\nSydney and Melbourne property prices are still below their peaks.\n\nSydney values fell 2.2 per cent between September 2024 and January 2025, and are still 1.4 per cent below their record high.\n\nAustralia's fastest-selling homes: top suburbs revealed View Gallery\n\nMelbourne prices are also 5.6 per cent below their peak, despite a 0.9 increase in the past two months.\n\nGains have also slowed in the smaller capitals, including in market leader Perth, where values are 0.05 per cent below their peak in October 2024.\n\nOverall, prices have massively risen in recent years in the Western Australian capital, up 75.4 per cent since March 2020.﻿\n\nRental values are at record highs, with the national index up 0.6 per cent in March.\n\nIn this market, Hobart led the charge, with rents up 1.2 per cent last month, compared to the lowest increase of 0.3 per cent in Melbourne.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/food-waste-australia-katy-barfield-yume-how-it-works/07053623-1296-4910-8831-2e6079c3b017",
        "title": "Katy is exposing Australia's shameful food waste epidemic",
        "publish_date": "Mon, 31 Mar 2025 23:03:01 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Katy Barfield has a secret window into Australia's shameful food waste .\n\nShe's witnessed millions of tonnes of surplus edible food carelessly thrown into landfill despite being more than good enough to eat.\n\nAs a former bar owner, Barfield also knows how delicious food – fruit, vegetables, beef, seafood, chicken or chocolate – can end up in the bin at any stage of the supply chain.\n\nAustralia wastes millions of tonnes of edible food. (Getty)\n\nTo help try and slow this epidemic, she started a lucrative Australian-first business Yume out of intercepting and selling this fresh food.\n\nBarfield, the founder of surplus food platform Yume, told 9news.com.au her lightbulb moment came while running a cosy bar in Melbourne's inner-city.\n\n\"I started my 'aha' moment in the industry when I owned a little bar in Melbourne going back 22 years called the Bug Bar in Little Bourke Street,\" she explained.\n\n\"I watched my chef literally put food from the fridge that was untouched into the bin.\n\nYume founder Katy Barfield. (Supplied)\n\n\"I remember thinking, if you times that by 45,000 – or 80,000 now – that's a phenomenal amount of food.\"\n\nYume takes perfectly good food at the supplier level before it goes to waste, whether it be because of a cancelled order, imperfect shape or wrong packaging.\n\nIt then sells these pallets of food to restaurants, catering companies, cafes or other venues for a fraction of the cost.\n\nFor example, chicken breasts which are $13/kg at wholesale price are just $5/kg with Yume.\n\nBarfield – who is also the founding chief executive of food rescue group Second Bite – said a staggering 42 per cent of Australia's annual food waste actually happens before it even reaches supermarket shelves.\n\n\"If you stuck the pallets of food that go to waste on top of each other every day, it would 2.8 times the height of Mount Everest,\" she explained.\n\n\"It's absolutely enormous. It's more than anyone could ever imagine.\"\n\nWhen Barfield tells friends, family or clients this sobering statistic, she calls it the \"jaw drop moment\".﻿\n\n\"That's every day,\" she added. \"And that's just in Australia.\"\n\nSo far, Yume has saved 10 million kilograms of surplus food from supermarkets and manufacturers and Barfield is now looking to target hospitality venues.\n\nBarfield intercepts surplus food before it goes to landfill. (Getty Images/iStockphoto)\n\nDavid Youl, the co-founder of popular Mexican restaurant Fonda, has worked with Comida Providore to purchase rice and tortilla wraps from Yume.\n\nYoul focuses on reducing food waste at the point of plating up in restaurants too.\n\nThis includes mindful menu curation and not over-ordering.\n\n\"There [could be] a shift to a mindset where when things are sold out, they're sold out,\" Youl said.\n\n\"Like an airline seat or a hotel room – that would minimise waste there.\"\n\nYoul's restaurants have previously bought beef mince from Yume, which was repurposed into bolognese sauce.\n\n\"It was a high-quality product, it just had a shorter shelf-life and needed to be used,\" he said.\n\nFonda Mexican founder David Youl also works with Yume. (Instagram/@fondamexican)\n\nHeading into Easter, Youl said a staggering amount of chocolate goes to waste﻿ simply because they're shaped like bunnies.\n\n\"Chocolate price worldwide is going through the roof and there'll be a surplus of dairy milk chocolate in April,\" he said.\n\n\"I've seen Easter eggs and things like that on Yume that go somewhere.\"\n\nBarfield wants to work with more and more people like Youl to bring food rescue to the masses and reduce Australia's food waste footprint.\n\n\"We are working through a logistics solution to bring it to all of those 80,000 restaurants and cafes across Australia, starting in Melbourne and then rolling it out,\" she said.\n\n\"And this hasn't been done before, it really is an Australian first, which is exciting.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/federal-election-2025-strangest-moments-47th-parliament-australia-in-pictures/b87e4d6e-d1e2-4fd4-9cf5-bc5aafbc32ac",
        "title": "Dead fish, cash-snorting pigs: The strangest moments from the last parliament",
        "publish_date": "Mon, 31 Mar 2025 18:41:17 +0000",
        "category": "finance",
        "authors": [
            "March"
        ],
        "text": "14 of 20 Attribution: Alex Ellinghausen\n\nFirst-term Labor senator Fatima Payman had caused a stir when she quit the party in 2024 to sit on the crossbench.\n\nShe then set about showing the government what it was missing out on: lots of Gen Z slang.\n\nIn a short, two-minute speech that may well have set the record for the most words added to Hansard in one go, Payman threw around a multitude of new-age insults to her former party and the opposition.\n\n\"Today I rise to address an oft-forgotten segment of our society,\" the youngest member of the 47th parliament said.\n\n\"I speak of generation Z, who will be playing a substantial role in the next election, and generation alpha, who will start to come of age during the election after. It is for this reason that I will now render the remainder of my statement using language they're familiar with.\n\n\"To the sigmas of Australia, I say that this goofy ahh government have been capping, not just now but for a long time. A few of you may remember when they said, 'There will be no fanum tax under the government I lead.' They're capaholics. They're also yapaholics. They yap non-stop about how their cost-of-living measures are changing lives for all Australians. Just put the fries in the bag, lil bro.\n\n\"They tell us that they're locked in on improving the housing situation in this country. They must have brainrot from watching too much Kai Cenat and forgot about their plans to ban social media for kids under 14. If that becomes law, you can 'forgor skull emoji' all about watching Duke Dennis or catching a dub with the bros on Fort. Chat, is this prime minister serious? Even though he's the prime minister of Australia, sometimes it feels like he's the CEO of Ohio. I would be taking an L if I did not mention the opps who want to cut WA's gyatts and services tax.\n\n\"The decision voters will be making in a few months' time will be between a mid government, a dogwater opposition or a crossbench that will mog both of them. Though some of you cannot yet vote, I hope that, when you do, it will be in a more goated Australia for a government with more aura. Skibidi!\"\n\nMake of that what you will.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/top-10-most-expensive-travel-insurance-claims-made-by-australians-2024/24f1d3d5-0ea7-447f-9aa2-c452780f0a9f",
        "title": "Aussie travellers' biggest travel insurance claims of 2024",
        "publish_date": "Mon, 31 Mar 2025 19:03:58 +0000",
        "category": "finance",
        "authors": [
            "March"
        ],
        "text": "1 of 11 Attribution: Getty/iStock\n\nS﻿oaring healthcare costs overseas meant Australian travellers took out huge travel insurance claims in 2024, according to one leading insurer.\n\nSouthern Cross Travel Insurance has revealed its top 10 most expensive claims for 2024, and the top one is 259 per cent more expensive than its equivalent from 2023, according to SCTI chief customer officer Jess Strange.\n\n﻿\"Ongoing global medical cost inflation means we're seeing claim costs increase, with our top five claims from 2024 costing more than the leading claim from 2023,\" Strange said.\n\n\"It just goes to show why it is so important to make sure you're covered for the unexpected, otherwise you could be left with a hefty medical bill.\"\n\nHere are the insurer's top 10 most expensive claims for last year.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/menthol-cigarette-ban-anti-smoking-laws-australia-april-1/105120928",
        "title": "Phased ban on menthol cigarettes kicks in today",
        "publish_date": "Tue, 01 Apr 2025 02:04:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "New smoking laws requiring tobacco companies to print health warnings on every single cigarette they produce for sale in Australia have come into effect.\n\nToday's changes also mean there will be updated health warnings printed on cigarette packets, which will also have inserts with information about how to quit smoking.\n\nAnd a phased ban on menthol cigarettes will also kick in today.\n\nIt comes after a year-long period for the tobacco industry to prepare for the new rules.\n\nAustralia has a relatively low smoking rate compared to other countries, the Cancer Council says, but 66 Australians are still dying from smoking-related illness every day.\n\nHere's a rundown of the changes.\n\nWhen do the changes take effect?\n\nTechnically, from today.\n\nBut tobacco retailers have been given a three-month grace period that ends on June 30.\n\n\"During this period, tobacco product retailers can sell or return old stock that was supplied to them prior to 1 April,\" the transitional guidelines say.\n\n\"This period is intended to allow retailers time to sell or return stock and adjust stock ordering ahead of the date of full compliance.\"\n\nThat's because there's a phase-out period, which allows retailers to sell through stock that complies with the old legislation until July.\n\nIt's hoped graphic warnings like these will help to convince people to quit smoking. (Department of Health and Aged Care)\n\nBan on menthol cigarettes\n\nToday marks be beginning of a phased ban on menthol cigarettes.\n\nThis means that menthol and menthol derivatives are on the list of prohibited ingredients in cigarettes.\n\nHowever, menthol cigarettes may still be available during the transitional period until June 30.\n\nWhy ban menthol cigarettes?\n\n\"Menthol masks the harshness of smoke,\" Becky Freeman, a professor in public health at the University of Sydney wrote in a piece for The Conversation.\n\n\"Just like cold lollies that contain menthol to soothe sore throats and tame coughs, menthol in cigarettes prevents inexperienced smokers from reacting to the rough effects of tobacco smoke in the throat.\n\n\"This helps to make smoking a more pleasant experience that young users will return to.\"\n\nIndividual cigarette warnings\n\nNew warnings, referred to by the government as \"on-product health messages\", will be printed on the paper covering the filter of each cigarette.\n\nThe filter is the orange part of the cigarette, which remains intact as it is being smoked.\n\nThe placement of the message on the filter means the message will remain visible even after a cigarette has been used.\n\nHere's an example of how the warnings will look:\n\nThe health warnings will be printed on cigarette filters, which don't burn down as they are smoked. (ABC News: Jordan Hayne)\n\nWhat are the messages on cigarettes?\n\nThe new laws have standardised the health warnings to be printed on the filters.\n\n\"They provide information to help people understand the consequences of smoking and encourage people to stop smoking, or to not start at all,\" the federal Department of Health and Aged Care website says.\n\nThere are eight short phrases listed in the legislation.\n\nHere's the wording of those warnings:\n\nToxic addiction\n\nPoisons in every puff\n\nCauses 16 cancers\n\nDamages your lungs\n\nDamages your DNA\n\nWho is this harming?\n\nWhat is this costing you?\n\nShortens your life\n\nWhat are the new packaging laws?\n\nLaws banning branding and requiring health warnings to be printed on cigarette packs have been in place for years now.\n\nBut they've been updated slightly.\n\nThe warning images will now have to cover:\n\n75 per cent of the front surface of the pack or carton\n\n90 per cent of the back surface of the pack or carton\n\nHere's an example of what the packaging will look like:\n\nCigarette packages will be updated under the new legislation. (Department of Health and Aged Care)\n\nWhy change the packaging now?\n\nGraph warnings have been effective so far, Sarah Durkin, director of Cancer Council Victoria's Centre for Behavioural Research, says.\n\n\"But evidence has shown that the effectiveness of the current warnings has decreased over time, as people have become accustomed to seeing the images,\" Professor Durkin says.\n\n\"We also have new scientific information that extends our knowledge of the health effects of tobacco use.\"\n\nShe also points out that the new warnings feature some dangers associated with smoking that people might not be aware of, which include:\n\ndiabetes\n\nerectile dysfunction\n\ncervical cancer\n\nDNA damage\n\nthe impact of second-hand smoke on children's lung capacity\n\nInserts inside cigarette packs\n\nThe new laws will compel tobacco companies to put small leaflets inside the packaging of cigarettes encouraging people to quit smoking.\n\n\"Health promotion inserts are small information cards placed inside the retail packaging for cigarette and loose processed tobacco products being sold and supplied in Australia,\" the Department of Health website says.\n\n\"They highlight the benefits of quitting smoking and provide information on resources, strategies and support services to help people to quit.\"\n\nThey'll look like this:\n\nThe inserts will include information to encourage people to quit smoking. (Department of Health and Aged Care)\n\nWhen were these changes announced?\n\nThis has been a few years in the making.\n\nHealth Minister Mark Butler was talking up these changes back in November, 2022, but they didn't become law until December, 2023.\n\n\"Industry will be given a year to comply to new requirements, with retailers given a further three months,\" Mr Butler said at the time.\n\nThe legislation also:",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/election-2025-home-lending-rules-house-prices-interest-rates/105120892",
        "title": "Relaxed lending rules could lead to bigger home loans … and higher house prices",
        "publish_date": "Tue, 01 Apr 2025 01:57:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "On its face, it's a simple solution to a simple problem — many people are struggling to get home loans big enough to afford a property, so why not relax the rules around how much people can borrow?\n\nThat's what the Coalition is proposing to do, should it win the federal election on May 3.\n\nBut, first things first. What exactly is the \"mortgage serviceability buffer\" the Coalition plans to lower?\n\nHow the mortgage buffer works\n\nWhen you apply for a mortgage, the lender is under a legal obligation to make sure that any home loan it approves is \"not unsuitable\", given your financial circumstances.\n\nIn plain English, that means they need to check that you should be able to afford the repayments now and over the life of the loan without suffering financial hardship.\n\nThat's why lenders will ask you for details and proof about your income, expenses, existing debts, investments and more when you apply for a loan.\n\nFirst home buyers could soon get lower interest rates Photo shows A lady outside a melbourne suburban home A federal inquiry is considering whether there's a need to ease restrictions on banks about how much they can lend out to first home buyers.\n\nIn addition to this, banks and credit unions also have to follow rules from their regulator, APRA — the Australian Prudential Regulation Authority.\n\nAPRA's primary job is to ensure that the financial system is secure and that the money depositors put into their savings accounts are safe — in other words, that banks, building societies and credit unions are not at risk of collapse.\n\nOne of the rules it has in place is an interest rate buffer when these lenders assess your mortgage application.\n\nAt the moment, that buffer is 3 percentage points. That means if the loan you are applying for has a current interest rate of 6 per cent, the bank must test if you could still afford the repayments if the rate rose to 9 per cent.\n\nThe idea behind this is that most mortgages run for 25-30 years and, as we have recently rediscovered, interest rates can change quite dramatically over time.\n\nWhat is the Coalition planning to do if elected?\n\nThe Coalition says that this buffer is too high, given that interest rates look likely to have peaked and are on the way down.\n\n\"I think most Australians could understand a high serviceability buffer when the cash rate was 0.1 per cent during COVID,\" Shadow Housing Minister Michael Sukkar told Radio National Breakfast.\n\n\" But now that we have elevated interest rates, a serviceability buffer that has not remained flexible with those changes is just blocking first home buyers from entering the market. \"\n\nCoalition promises to relax home lending rules Photo shows Aerial shot of dozens of houses in neat rows in a new outer-suburban housing estate. The financial regulator says household debt is already high and its \"serviceability buffer\" is appropriate. The Coalition says the high buffer is out of date and relaxing it would help more first home buyers into their own place.\n\nHe argued that first home buyers were particularly affected, given that they had no existing home equity and lower savings than older, more established households.\n\n\"Estimates from the industry are that nearly 40 per cent of potential first home buyers are not able to get finance for a loan, and therefore unable to buy a house, because primarily that serviceability buffer is now at 3 per cent,\" Mr Sukkar said.\n\nHe wouldn't be drawn further on the details of any change but, when pressed, suggested that the reduction might be modest.\n\n\"Two-and-a-half per cent is where it was at previously,\" he responded.\n\n\"So we're going to work with APRA in relation to that, as we did, to be frank, in the former Coalition government.\"\n\nHas the buffer always been this high?\n\nThe short answer is no, but it's more complicated than that.\n\nThe buffer was 2.5 per cent between mid-2019 and late-2021, at which point APRA raised it to 3 per cent because it was growing increasingly concerned by the home lending and house price boom sparked by the Reserve Bank's emergency COVID-level cash rate of just 0.1 per cent.\n\nAs I outlined in this December 2022 analysis, APRA's move to raise the buffer was arguably shutting the door after the horse had bolted.\n\nAPRA rate floor slip-up Photo shows A real estate sign in the front yard of a house in Sydney's south, with a sold sticker on it. A little-publicised decision by the obscure bank regulator may have done more to put Australians under mortgage stress than anything the Reserve Bank of Australia has done, writes Michael Janda.\n\nThe door that APRA belatedly shut was opened in the first place by the Morrison Coalition government, as Mr Sukkar referred to above, which oversaw APRA removing a floor on the mortgage serviceability test.\n\nWhat was this floor?\n\nIt was set at a minimum of 7 per cent at a time when the buffer was only 2 percentage points but it meant that, no matter how low interest rates fell, borrowers would have to at least be tested on whether they could afford their mortgage at a 7 per cent interest rate.\n\nAs explained in that 2022 analysis, its removal meant that when interest rates plunged during COVID-19 and many people could get a loan at interest rates below 2 per cent, those borrowers were only being tested against a rise in mortgage rates to 4.5 or 5 per cent.\n\nAfter the Reserve Bank finished hiking rates in November 2023, the average variable mortgage rate on outstanding owner-occupier loans was 6.3 per cent — a lot higher than many borrowers from 2020 and 2021 had been tested against.\n\nSo are there options to cut the buffer but still protect borrowers?\n\nWhile no-one expects mortgage interest rates to fall back to 2 or even 3 per cent again, no-one expected them to fall that low in the first place until COVID-19 hit.\n\nThe lack of an interest rate floor on the serviceability test after mid-2019 meant that a bunch of borrowers ended up with loans they couldn't afford, triggering a steep rise in mortgage hardship and property sales when interest rates rose sharply.\n\nThe mortgage cliff warnings are there if you look Photo shows A smiling brown-haired woman puts a 'sold' sticker on a 'for auction' sign outside a house. A surge in home loan hardship requests and a record number of quick resales are two signs that Australia is still perilously close to the edge of the mortgage cliff.\n\nSo, with the Coalition saying that final details of any change to the mortgage serviceability test would be negotiated with APRA, this would offer an opportunity to lower the buffer but reintroduce a floor.\n\nThe average discounted \"indicator\" owner-occupier variable lending rate over the roughly two decades the Reserve Bank data goes back is 5.74 per cent, so quite close to current levels.\n\nThere have been 60 out of 250 months, or close to a quarter of the time, when the average discounted variable rate has been above 7 per cent.\n\nSo that makes a 7 per cent floor actually look quite risky.\n\nIn that 20-year period, there were just nine months — in the lead-up to the global financial crisis in 2008 — when variable home loan rates were typically above 8 per cent.\n\nSo, perhaps it wouldn't be a bad idea to bring the mortgage serviceability buffer back to 2.5 or even 2 percentage points, but with a 7.5 or 8 per cent floor on the test.\n\nThis would give prospective home buyers extra borrowing capacity in the short term, but safeguard against risky credit booms if rates dropped back to low levels in the future.\n\nWhile reducing the buffer might spark a temporary uplift in home prices, the reintroduction and maintenance of a higher floor would prevent the kind of cheap credit-induced house price booms we saw during COVID-19, when interest rates fall to unusually low levels.\n\nLoading\n\nWill the Coalition's policy make housing more affordable?\n\nQuite simply, no. In fact, the opposite.\n\nWhile lowering the mortgage serviceability buffer will allow first home buyer X to borrow more, it will also allow potential buyers Y and Z to borrow more too.\n\nUnless the reduced floor is only for first home buyers, then Y and Z might be upgraders or investors.\n\nIf all three turn up at the same auction, they will be able to bid more for the property than before the serviceability buffer was lowered.\n\nThe most likely result is that the home will sell at a higher price.\n\nHow Australia's housing market spun out of control Photo shows Woman with blonde hair and a white jacked in front of a black and white photograph of a wooden pier Property investment is ingrained in the Australian psyche, but is it too easy to cast landlords as the villain in our housing crisis?\n\nReplicated across the whole housing market, the almost inevitable result is that home prices will rise.\n\nHousing will become less, not more, affordable and most of the people who were locked out of the market before will remain locked out of the market.\n\nIn the end, it is not solely the size of loan you can get that determines whether you can buy, but whether that loan is big enough to pay the current market price for the home you want.\n\nA policy that increases the capacity to pay, what economists call a \"demand side\" policy, will, other things being equal, simply result in higher prices.\n\nIf the supply side was more responsive, that might limit the price increase by seeing that extra demand channelled into more home building.\n\nBut, let's face it, even with fewer planning restrictions, it's not exactly quick to build a lot more housing, as governments around Australia should have learned over the past few years. So prices would jump in the short term before construction could catch up.\n\nLoading...\n\nAnd we don't need hypothetical economic models to tell us this.\n\nAfter APRA introduced stricter lending rules, the Australian property market slipped into a downturn between 2017 and 2019.\n\nWhen those rules were eased and rates fell further, prices started rising, then took off as rates plunged, even as the borders were closed and population growth (physical demand for housing) stalled.\n\nThe more people can borrow, the more they will pay for homes. The immediate winners from any relaxation in mortgage lending rules will be existing property owners, especially investors, as well as banks and real estate agents.\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/story-of-redemption-paul-roos-remembers-andrew-krakouer/105121294",
        "title": "'A story of redemption': Paul Roos remembers the late Andrew Krakouer",
        "publish_date": "Tue, 01 Apr 2025 01:33:48 +0000",
        "category": "sports",
        "authors": [],
        "text": "Andrew Krakouer's life was a story of redemption, according to premiership coach Paul Roos.\n\nThis story features the names and images of deceased Aboriginal people, which have been used with the permission of their families.\n\nRoos spoke on ABC's AFL Daily podcast about Krakouer, who died in Perth of a suspected heart attack on Sunday at the age of 42.\n\nThe dynamic Western Australian small forward played 137 AFL games for Collingwood and Richmond between 2001 and 2013.\n\nFormer Collingwood coach Nathan Buckley (L) has been among the many to pay tribute to the late Andrew Krakouer. (Getty Images: Michael Dodge)\n\nBut Roos said the work Krakouer did outside football following a prison term he served in the late 2000s was an important element of his story.\n\n\"I had some emails from Andrew about three or four years ago, we were looking to do a program in a prison together, and then COVID hit,\" Roos said.\n\nLoading...\n\n\"I think [it's a story] of redemption, it's really sad. I didn't know him well, but Matty Richardson, Nathan Buckley, they all speak highly of him, and my interactions with him were always fantastic.\"\n\nKrakouer was delisted from Richmond at the end of 2007, returning to Perth to play for Swan Districts in the WAFL.\n\nThe following year, he was convicted of assault with intent to cause bodily harm and was sentenced to four years in jail. He was released on parole in August 2009 and returned to football.\n\nFormer Magpies and Tigers AFL player Andrew Krakouer dies aged 42 Photo shows red sherrin football to sitting on green grass with football goal posts and football club in the background Andrew Krakouer, who played 137 AFL games for Richmond and Collingwood, has died age 42.\n\nBut Krakouer's rehabilitation came on and off the football field — he won a WAFL premiership for Swan Districts before being picked up by Collingwood and getting to a grand final.\n\nAfter a leg injury, he returned to WA to play for West Perth before retirement.\n\nFollowing his football career he went into the media on TV program Yokayi Footy, the AFL's Colour of Your Jumper series and special comments for Fox Footy on the AFLW.\n\nIn 2024, he co-wrote a children's book, My Dad's Gone Away, which focused on the challenges for kids of having a parent in prison.\n\nOn the field, Krakouer had an eye for big games, with three goals in a losing cause for Collingwood in the 2011 grand final against Geelong.\n\nHe won the AFL's mark of the year award in 2011 for a spectacular effort against the Adelaide Crows at Docklands.\n\nLoading YouTube content\n\nRoos also referred to Krakouer's dominating performance in the 2010 WAFL grand final for Swan Districts.\n\n\"I just read in the [WAFL] grand final, he had 42 [disposals] and kicked four or something! If it was Champion Data or Supercoach points it would have been 290 points,\" he said.\n\n\"That's a phenomenal performance, super talented [as a player].\n\n\"[It's] super sad, 42 — it's really sad when you read it, there's not much you can say to the family and friends other than we're thinking of everyone and the whole footy community is very good at wrapping their arms around people when it happens.\n\n\"[He was] a really good player and a story of redemption — that's what I remember most.\"\n\n\"Just a great contributor to his community and a great contributor to football in general.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/election-2025-albanese-tariff-trump-biosecurity-exemption/105121156",
        "title": "Albanese won't budge on key US grievances, as Trump's 'liberation day' looms",
        "publish_date": "Tue, 01 Apr 2025 00:42:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "An updated list of grievances published by the United States trade office has set its sights on Australia's pharmaceutical sector, biosecurity protections and laws requiring the social media giants to pay for news.\n\nBut the prime minister has vowed none will be touched \"on my watch\", as the federal government toughens its language against the Trump administration.\n\nThe annual US Foreign Trade Barriers report offers an itemised list of issues America believes are affecting its exports, from Algeria to Vietnam and almost everyone in-between.\n\nBut with US President Donald Trump due to announce a fresh round of tariffs on April 2, dubbed \"liberation day\", the report highlights where the administration might seek to retaliate.\n\nUS critical of Australian biosecurity laws\n\nThe report names biosecurity \"barriers\" to US beef, pork, poultry, apples and pears, saying the US \"continues to seek full market access\" for fresh produce to be exported.\n\nAustralia has particularly strict biosecurity laws to protect native wildlife that is vulnerable to foreign diseases that have largely been kept from Australian shores.\n\nFor example, Australia prohibits US apples and pears based on concerns of several pests, such as the bacterial disease fire blight — which the report acknowledges, and contests.\n\nThe trade report again raises concerns over Australia's pharmaceutical laws, which the US pharma industry has long opposed.\n\nAnd it raises the News Media Bargaining Code, legislated under the former Morrison government, which requires social media giants to support news organisations in recognition of the benefits they receive from news content hosted on their platforms.\n\nIn a toughening of Australia's stance on the coming tariffs, Mr Albanese repeated on Tuesday morning that Australia would not weaken its laws to appease the US.\n\n\"The report has three things that are of concern, at least, to Australia: one is the news bargaining code, the second is pharmaceuticals and the third is biosecurity,\" Mr Albanese said.\n\n\"Those issues are not up for negotiation.\n\n\"Not on my watch. We will negotiate sensibly but we won't undermine the biosecurity system.\"\n\nOpposition Leader Peter Dutton also ruled out negotiating on those issues.\n\n\"No, and I agree with the prime minister’s position, and I'd say this: I will stand up for our country's interests every day if I am given the great honour of being prime minister,\" Mr Dutton said.\n\n\"I'll stand up for our interest and negotiate the best possible outcome for Australia and I will not compromise on any of that for our country.\"\n\nGovernment prepared to fail to win exemption\n\nAustralia is continuing to negotiate with the United States in an attempt to secure exemptions from any incoming tariffs, arguing that because Australia imports more than it exports to the US, it should not be penalised.\n\nHowever, that trade surplus argument was not enough to win exemptions from tariffs on steel and aluminium imposed by Mr Trump last month, and the government is aware this argument might fail again.\n\nLabor reluctant to buy Trump tariff exemption Photo shows three men in a composite image two wearing glasses and one with a orange-tinged skin Australian officials continue to talk to their American counterparts, but Labor is reluctant to pay a substantial price to win an exemption from fresh US tariffs.\n\nBut Australian negotiators are unwilling to offer any major concessions in order to strike a \"deal\" with Mr Trump, who has openly called for foreign nations to make offerings that would benefit the US in order to secure exemptions.\n\nMr Albanese said today that weakening Australian laws to escape tariffs estimated to have a minor direct impact to the economy would be like \"cutting off our own nose\".\n\nShadow Trade Minister Kevin Hogan said the Coalition expected the government to secure exemptions.\n\n\"With the way some of the officials are talking in the US, that's what we're hoping for … [But] it does appear the PM is hiding behind officials,\" he said.\n\nThe Coalition maintains that Mr Albanese should have sought to meet with Mr Trump in person to put Australia's case.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/trump-signs-ticket-scalpers-executive-order-with-kid-rock/105120594",
        "title": "Trump joined by Kid Rock as he signs ticket scalping executive order",
        "publish_date": "Mon, 31 Mar 2025 23:45:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "US President Donald Trump on Monday local time signed an executive order aimed at protecting fans from \"exploitative ticket scalping\" and reforming the US live entertainment ticketing industry.\n\nMr Trump signed the directive in the Oval Office, with singer Kid Rock standing next to him in an American flag-themed outfit.\n\nKid Rock said ticket scalpers' use of bots to buy large numbers of tickets at face value to then sell for a profit was a big problem in the industry.\n\n\"I want the fans to have fair ticket prices,\" Kid Rock said, adding that legislation was eventually needed to cap ticket purchases.\n\nThe order directs Treasury Secretary Scott Bessent and US Attorney General Pam Bondi to ensure that ticket scalpers are in full compliance with the tax-collecting Internal Revenue Service and other applicable law, a White House fact sheet said.\n\nIt also orders the Federal Trade Commission to work with the US attorney to ensure that competition laws are appropriately enforced in the concert and entertainment industry, according to the fact sheet.\n\nThe Justice Department and dozens of state attorneys-general sued Live Nation Entertainment and its ticket-selling unit, Ticketmaster, last year for allegedly monopolising markets across the live concert industry in ways that hurt artists and fans.\n\nTicketmaster owner Live Nation sued by US government Photo shows Taylor Swift performs at the Paris Le Defense Arena as a part of her Eras Tour concert in Paris, May 9, 2024 Entertainment giant Ticketmaster is being sued by the US government over claims it is running an illegal live event 'monopoly' which is hurting both artists and fans.\n\nIn January, US senators assailed Live Nation Entertainment's lack of transparency and inability to block bot purchases of tickets, in a hearing called after a major fiasco involving ticket sales for a Taylor Swift concert tour.\n\nTicketmaster, which has been unpopular with fans for years, drew fresh heat from US members of Congress over how it handled ticket sales last fall for Swift's \"Eras\" tour, her first in five years.\n\nExperts say Ticketmaster commands more than a 70 per cent market share of primary ticket services for major US concert venues.\n\nThe fact sheet singled out bot sales in particular.\n\n\"Ticket scalpers use bots and other unfair means to acquire large quantities of face-value tickets, then re-sell them at an enormous mark-up on the secondary market, price-gouging consumers and depriving fans of the opportunity to see their favorite artists without incurring extraordinary expenses,\" it said.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/injury-rules-gorry-out-of-matildas-squad-for-south-korea-series/105120880",
        "title": "Injury rules Gorry out of Matildas squad for South Korea series",
        "publish_date": "Mon, 31 Mar 2025 23:24:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Matildas have named a 23-player squad for their two-match international series against South Korea, with midfielder Katrina Gorry missing through injury.\n\nGorry withdrew from the Matildas' international camp after picking up an ankle injury in West Ham's 2-2 draw with Chelsea in the Women's Super League on the weekend.\n\nHer absence opens up a spot in the squad for Melbourne City FC midfielder Leah Davidson.\n\nKerr to rejoin Matildas teammates Photo shows Sam Kerr watches on from the sidelines during a Chelsea UEFA Women's Champions League. Almost two months after her UK court case concluded, Sam Kerr remains a chance to regain the Matildas' captaincy following a meeting with the Football Australia board.\n\nDavidson made her debut for Australia late last year and is in line for possible third and fourth caps for the Matildas in the series against the World number 19-ranked Taegeuk Ladies.\n\nGame one of the series will be played on Friday night at the Sydney Football Stadium, while game two will be in Newcastle on Monday, April 7.\n\nSam Kerr has not been named in the squad, but she will link up with teammates in a non-playing capacity in Sydney this week after addressing her recent UK court case, where she was found not guilty on one charge of racially aggravated harassment of a police officer.\n\nKerr has not played since tearing her ACL during a Chelsea training camp in January last year.\n\nSteph Catley will continue as skipper for the series.\n\nMatildas squad:\n\nMackenzie Arnold, Ellie Carpenter (VC), Steph Catley (C), Kyra Cooney-Cross, Leah Davidson, Caitlin Foord, Mary Fowler, Charlotte Grant, Winonah Heatley, Michelle Heyman, Clare Hunt. Alanna Kennedy, Chloe Lincoln, Holly McNamara, Teagan Micah, Courtney Nevin, Natasha Prior, Jamilla Rankin, Hayley Raso, Kaitlyn Torpey, Emily van Egmond (VC), Clare Wheeler, Tameka Yallop.\n\nBoth games will be broadcast on ABC's Listen App.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/families-disconnected-electricity-remote-northern-wa/105092516",
        "title": "'Sometimes we just run out of money': Pre-paid electricity leaving families without power",
        "publish_date": "Mon, 31 Mar 2025 23:01:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "On any given week in Mowanjum, a remote community more than 2,300 kilometres north of Perth, most households experience electricity cuts at least two to three times.\n\nLeah Umbugai, chair of the Mowanjum community, said almost every house relied on pre-paid electricity and families often ran out, enduring 24-hour outages.\n\n\"It became a norm for us because every wet season we'll have no power,\" she said.\n\n\"We sometimes have two or three days without power.\n\n\" We make a fire outside the house. We still have to do that in order to have hot water, food. It shouldn't be that way. \"\n\nEven a couple of hours without power means food in the fridge can go bad.\n\nLeah Umbugai checking her pre-paid power meter at home. (ABC Kimberley: Rosanne Maloney)\n\nThe unreliability of energy has led to overcrowding in homes, with families packing into houses with air conditioning still running.\n\nHorizon Power reports about 1,700 households in the Kimberley are on pre-paid electricity, primarily in remote communities.\n\nLast year, electricity was disconnected nearly 40,000 times across those households.\n\nIn Mowanjum, electricity was cut 2,503 times across 60 households, averaging 41 disconnections per year per home.\n\nHorizon Power's executive general manager Evette Smeathers said 80 per cent of disconnections across the region \"lasted less than two hours\".\n\n\"These customers often use a disconnection either as a reminder for them to make a payment or for managing their budget when they're away from home,\" she said.\n\nMs Umbagai works as an artist but says other jobs in her community are hard to find. (ABC Kimberley: Rosanne Maloney)\n\nAustralians living in remote communities face astronomical cost-of-living pressures as opposed to their city counterparts.\n\nThey pay up to double the amount shoppers in cities pay for groceries, something the federal government has aimed to address by subsidising some food items from July.\n\nMs Umbugai said many people in her community often struggled to find jobs or access services to curb financial pressures which led to an inability to afford power.\n\nCommunity helping each other\n\nWhen the power is off Ms Umbugai said people supported each other by covering energy bills or staying in houses with the power still on.\n\nMs Umbugai keeps everyone's meter numbers — grandparents, aunties and uncles — to \"send a few dollars\" when needed.\n\n\"I don't like them to have no power in the house, especially the elders,\" she said.\n\nMs Umbagai often has to help sister Sirita (left) with her power bill. (ABC Kimberley: Rosanne Maloney)\n\nHer sister Sirita Lightning often came to her for help to ensure her outages would not last more than two hours.\n\n\"I've got seven kids and I have to have my air conditioning all the time,\" Ms Lightning said.\n\n\"There's times when we will run out of money.\"\n\nAfter paying $1,000 on rent and food each week, the extra $200 for power was hard to meet.\n\nMs Lightning says she faces huge energy bills with seven kids at home. (ABC Kimberley: Rosanne Maloney)\n\nMs Lightning said bills cost more because her government-owned house was badly insulated, despite requests to have it upgraded.\n\nOld, poorly insulated government-owned homes or inefficient, cheap air conditioning only adds to individual costs.\n\nSolar energy to keep bills down\n\nUniversity of Notre Dame Broome campus researcher Kathryn Thorburn said transitioning communities to renewable energy could reduce the region's electricity bills.\n\nThe federal government released its First Nations Clean Energy Strategy last year to transition 80 per cent of remote communities to renewable by 2030.\n\nAs part of a new research project, Dr Thorburn recently surveyed over 90 remote households in the regions to understand their experiences of pre-paid electricity.\n\nDr Kathryn Thorburn says solar energy in remote communities could lower energy bills. (ABC Kimberley: Rosanne Maloney)\n\nWhile the study is yet to be finished, she found widespread challenges with managing pre-paid power, particularly for inland communities.\n\n\"The energy costs on a fortnightly basis are very high,\" she said.\n\n\"The Kimberley is a hot place. The difference for these families is that they tend to be on very low incomes.\"\n\nMs Thorburn works alongside Lloyd Pigram who says he was also unaware of pre-paid power challenges. (ABC Kimberley: Rosanne Maloney)\n\nDr Thorburn said remote communities did not have equal access to alternatives such as solar power installations.\n\n\"In some cases people told us they spent more on electricity every fortnight than they did on rent,\" she said.\n\nAs part of a new study, Dr Thorburn hoped to identify how household bills could be reduced.\n\n\"We just want to explore how some of those benefits of that energy transition might be delivered to these families, many of whom are doing it really tough,\" he said.\n\nMs Umbagai said she hoped solar energy would provide cheaper and more sustainable electricity for communities in the state's north.\n\n\"It's really hard at the moment and people struggle,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/does-swearing-in-front-of-our-kids-cause-them-harm/105032882",
        "title": "Is it OK to swear in front of our kids?",
        "publish_date": "Mon, 31 Mar 2025 22:21:53 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "I wasn't expecting to hear the f-word from my three-year-old in the back seat on a regular Tuesday.\n\nWhile caught off-guard, I was probably more shocked we had made it that long without him parroting unfavourable language (despite us trying to temper it around him).\n\nI was also curious as to whether parents swearing in front of their kids can actually cause harm.\n\nSwearing at kids, versus around them\n\nBenjamin Bergen, a linguist and cognitive scientist at the University of California San Diego, says it's all about context.\n\nThe author of What the F: What Swearing Reveals About our Language, Our Brains, and Ourselves, says there is an important distinction between swearing at children — which can be considered verbal abuse and can cause harm — and around them, which \"doesn't seem to\".\n\n\"The only profane words that demonstrably cause trouble are slurs,\" such as derogatory, racist, homophobic and sexist insults, Professor Bergen wrote in the Los Angeles Times.\n\n\"But there's no similar proof that exposure to ordinary profanity — four-letter words — causes any sort of direct harm: no increased aggression, stunted vocabulary, numbed emotions or anything else.\"\n\nThe importance of 'repair' with our kids Photo shows woman hugs child in living room Ruptures like a raised voice or moment of disconnect can become a \"teachable moment\" if we focus on the vital repair work that should come afterwards, experts say.\n\nEva R. Kimonis is a clinical psychologist and director of the Parent-Child Research Clinic at the University of New South Wales.\n\nShe says swearing at children can be a \"form of emotional abuse\" and linked to harmful outcomes for some children.\n\nWhile our experts aren't aware of any research that indicates swearing around children is directly harmful, Professor Kimonis says it may be damaging in ways we don't expect.\n\n\"Even if a parent is OK with swearing at home, the problem is that children haven't necessarily learnt the who, what, when of swearing, and when it's appropriate.\n\n\"If parents are not teaching them when and how it's OK to swear, then they might be swearing at school as well,\" she says, adding that could cause them problems in the classroom.\n\nABC Lifestyle Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nParenting expert and family counsellor Rachel Schofield says kids' swearing might also be harmful if they are using it \"to be nasty\".\n\n\"They might be using it in a way that is hurtful to others around them.\"\n\nHowever, it is less likely kids will use curse words in that way, research shows.\n\nProfessor Bergen told ABC Radio National a long-term observational study that looked at children swearing in the \"real world\" found they were \"overwhelmingly\" using swearing in pro-social ways, such as making friends or to smooth social interactions.\n\nWhy children start swearing\n\nResearch has found that children's vocabulary of swear words expands rapidly from ages one to two, to ages three to four, in parallel to the general explosion in language in the toddler and preschooler years.\n\nIt found that by the time children began school at age five, they already knew 42 taboo words.\n\nShould we lie about Santa? Photo shows Two small children stare out the window wearing Christmas outfits What if some of my son's peers don't get as many presents as him? Is using Santa as a bribe for good behaviour healthy?\n\nProfessor Kimonis says children learn through imitation — watching what the adults around them do.\n\n\"When those adults model a behaviour like swearing, then the child is more likely to swear.\"\n\nAnd our reaction to that will determine if they keep swearing or not, she says.\n\n\"If the reaction is positive, like where a parent laughs and doesn't give a consequence, then they're probably going to continue swearing.\"\n\nWhat works for one family might not another\n\nProfessor Kimonis says whether it's OK for our kids to swear is not \"a black [and] white issue\".\n\n\" It's family and child specific. \"\n\nFor parents who don't want their children to use profanity, she suggests \"planned ignoring\".\n\n\"That's where we help a parent to ignore the behaviour by not giving it any attention.\n\n\"This only works if you pair it with giving attention when the child is doing an appropriate thing like talking respectfully.\"\n\nThere are experts who argue planned ignoring can be harmful, so parents should talk to a professional and decide what is most appropriate for their child.\n\nMs Schofield says for some families, it may come down to context.\n\n\"Is it just used as a way to express some frustration? Or is it used in anger?\n\n\"It's about the culture within the family; what's OK and what's not — every family gets to decide what is OK in their family.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/anisa-nandaula-taskmaster-thank-god-you-re-here-comedy/105116570",
        "title": "Meet the comedian who traded a six-figure salary for stand-up",
        "publish_date": "Mon, 31 Mar 2025 22:07:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Plenty of people dream of quitting their office jobs to pursue their passion, to shake off the shackles of a nine-to-five job and fully commit to the thing that makes their eyes sparkle.\n\nLoading TikTok content\n\nBut only a tiny fraction of people will actually be allowed to experience this.\n\nUgandan-born, Brisbane-based comedian Anisa Nandaula is one of them.\n\nAfter years of nightly gigs in the often-unpaid Brisbane stand-up scene, Anisa turned to TikTok, quickly amassing more than 300,000 followers and scoring appearances on Channel 10's Thank God You're Here and the upcoming season five of Taskmaster.\n\nAt the start of 2025, Anisa felt she had enough of a foothold in her comedy career to — joyously — ditch her day job.\n\n\"The best way to describe it is, you know when your partner comes home and they said there was cake at work, and they brought some for you because it was left over,\" Anisa says.\n\n\"It's like that feeling.\"\n\nComing to Australia\n\nAnisa was born in Uganda and migrated with her mother and siblings to Rockhampton in North Queensland when she was seven years old.\n\nShe quickly realised she and her siblings were the only African kids in their primary school. After a year, the family migrated to Brisbane, where she started to feel more at ease.\n\n\"The children weren't as shocked to see me, they wouldn't stare as much,\" Anisa says.\n\nLoading Instagram content\n\nBut the pressure to look like a majority of her classmates remained, with Anisa straightening her hair, using skin-bleaching products and even putting honey in her eyes in an attempt to lighten their colour.\n\nNowadays, she realises her teenage self was \"beyond perfect\".\n\nIf she could, she'd go back and tell teenage Anisa: \"Every single thing that you pray for God to change are all the things that are going to make you successful.\n\n\"Hold on to them as tight as you can.\"\n\nFrom poetry to comedy\n\nAfter graduating high school and embarking on a political science degree, Anisa took her first steps towards the stage through slam poetry. Like many things she turned her hand to, she rocketed to the top.\n\nIn 2016, she was crowned Queensland Poetry Slam Champion.\n\nLoading YouTube content\n\nPoetry taught her how to be comfortable on stage with an audience looking right at her, but she wanted something more.\n\n\"I got tired of making people sad or making people ponder, I just want to make them laugh,\" she says.\n\nSo she stepped into Brisbane's stand-up comedy scene which, while not as robust as the Melbourne or Sydney scenes, accepted Anisa with open arms.\n\n\"After every gig, I would talk to the headliner for an hour and do that as often as I could,\" she says.\n\n\"The community taught me everything. I would not have achieved anything I have without my peers and comedy mentors.\"\n\nLoading YouTube content\n\nShe started doing seven, eight, nine spots a week — jetting from one side of Brisbane to the other, down to the Gold Coast and up to the Sunshine Coast — anything that would give her more stage time.\n\n\"Stand-up is trial and error. It's the only way to get good. I would hear comedians be like, 'You shouldn't gig so much. You should live life.' But there's no other way. The more you do it, the better you are. And there's no way around that,\" Anisa says.\n\nThe love of the craft, encouragement from her peers and a determination to give comedy her all, pushed Anisa to keep doing the gigs nearly every night.\n\n\" I had a pretty good life before stand-up. Like, I was a slam poet, I was making six figures. So I was like, 'I have to make something of myself. Otherwise, why am I leaving my good life?' \"\n\nTikTok shock\n\nDespite her nose-to-the-grindstone attitude, there was a point a couple years ago when movement in Anisa's comedy career stalled. She wasn't making any breakthrough with the channels that traditionally put new Australian comics on the path to the mainstream.\n\nLoading TikTok content\n\n\"I was doing like two to three gigs a night, every single night, like working as hard as I could, and I was just getting nowhere,\" she says.\n\n\"All the conventional points that you're meant to take as a stand-up — do RAW, and then you do Comedy Zone — these are all the things that you're meant to do to get success. And I just wasn't getting any.\"\n\nSo Anisa pivoted to the unconventional.\n\nShe took clips of her stand-up and uploaded them onto TikTok. They started doing numbers so she began uploading bits straight to camera.\n\n\"I started getting recognised by people in real life for my TikTok. I think I only had like 5,000 followers at the time. But just the fact that my comedy was resonating with people I was like, 'I could make something of this.'\"\n\nThose 5,000 followers have now turned into an audience of more than 340,000 on TikTok. Add on Instagram and in Anisa's videos, she reaches a combined audience of more than half a million people.\n\nSoon after the online world sat up to take notice of Anisa's talent, the mainstream world caught up.\n\nIn October last year, the comedian performed on an episode of Channel 10's Thank God You're Here and, later in the year, she'll star as one of the season-long contestants on the channel's comedy show, Taskmaster.\n\nEven as her star rises, Brisbane locals still have a good chance of catching one of Anisa's sets at an open mic around the city. She's not doing as many five-minute spots anymore, but she remains an active member of the scene.\n\nWhile it's tradition for comedians to venture to Melbourne or Sydney to further their career, Anisa says she's a Brisbane \"loyalist\". (Supplied: Emma Holland)\n\nAs she embarks on a national tour of her debut stand-up hour, You Can't Say That, Anisa says comedy has not only given her a new career path but a better understanding of her adopted home country.\n\n\"I have a friend and she's a migration agent, and she said that when migrants are assimilating, the last thing that they learn is the local humour. It takes the average immigrant about 15 years to understand the humour of the country,\" Anisa explains.\n\n\"I think once you understand what makes people laugh, you understand everything about them. So stand-up comedy definitely helped me feel Australian.\"\n\nAnisa Nanduala: You Can't Say That is at Melbourne, Brisbane and Sydney comedy festivals.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/stock-losses-more-than-100000-in-outback-queensland-floods/105117606",
        "title": "At least 100,000 head of livestock feared lost in Queensland floods",
        "publish_date": "Mon, 31 Mar 2025 21:45:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than 100,000 cattle and sheep are estimated to be dead or missing in the devastating flooding continuing in outback Queensland.\n\nWARNING: This story contains images that may be distressing.\n\nEarly numbers confirmed by the Queensland Department of Primary Industries (DPI) estimate 105,348 livestock are missing or deceased.\n\nLivestock are gathering on higher ground to escape floodwater in Western Queensland. (Supplied: Henry Murray)\n\nThere are an estimated 13.3 million head of cattle, about 2.7m sheep and some 713,000 goats in Queensland.\n\nThe DPI also confirmed 3,183 kilometres of fencing had been impacted, along with 4,076km of private roads.\n\nThose number are expected to increase in the coming days.\n\nState Primary Industries Minister Tony Perrett said the impact would be devastating for producers and the industry.\n\n\"When you get those sorts of losses and those numbers are expected to grow, that's their livelihoods that, in some cases, have been washed away in front of them,\" he said.\n\n\" It's a devastating impact just on their business, but also on their mental health. \"\n\nA herd of sheep survive by finding a shrinking patch of high ground near Windorah. (Suppled: Joe Tully)\n\n'They just won't live it out'\n\nEromanga producer Brendan Murray was running 9,000 sheep before the flood and estimated he had lost up to 6,000 head.\n\nHe is not confident he will find the remaining 3,000.\n\n\"I don't think there's any hope for the rest,\" Mr Murray said.\n\n\" I think they're gone. \"\n\nSo far more than 100,000 livestock animals have been confirmed missing or deceased. (ABC News)\n\nMr Murray and his family have been dropped from helicopters in recent days to find livestock on foot and move them out of water.\n\nHe said some cattle were found \"bogged to the brisket\" and had to be put down because they could not be extracted from the thick mud.\n\nThe full scale of the losses will not be known until the floodwater has subsided. (Supplied: Henry Murray)\n\n\"We've managed to get a lot out, but we've stopped looking for some,\" Mr Murray said.\n\n\"That's a dead loss. We're concentrating mainly saving the ones we can save.\n\n\"We spent four hours walking 120 sheep to get them to an area where they weren't standing in water.\"\n\nMr Murray said the number of dead livestock was likely to grow given the forecast for more rainfall over the coming days in already drenched parts of the west.\n\nMore rain is forecast during the middle of the week, which may result in small renewed river and creek level rises.\n\nMore than 100,000 animals are thought to have perished or be missing amid the devastating floods. (Supplied: Brendan Murray)\n\n\"If it rains, we'll lose them,\" Mr Murray said.\n\n\"There's nowhere we can go with them.\n\n\"Even 20mm of rain will finish off what is left — they just won't live it out.\"\n\nRecovery could take years\n\nAgForce Queensland general president Shane McCarthy said he had seen stock losses of up to 80 per cent in some areas.\n\nLivestock losses in the west are expected to heavily impact some producers. (Supplied: Shane Wendleborne)\n\nBut the impact across graziers will vary depending on their herds, he said.\n\n\"Any stock loss is not good and we need as many as possible alive,\" Mr McCarthy said.\n\n\" If you've gone and lost 100 per cent of your stock, that's catastrophic. \"\n\nHe the true numbers would not be revealed until the floods subsided.\n\nGraziers are taking to the sky to asses livestock deaths on their properties. (Supplied: Henry Murray)\n\n\"[Livestock] could be still alive but washed away, and we've got to find them and get them back … [but] they could be dead and washed away,\" Mr McCarthy said.\n\n\"At the moment they're just trying to move stock around, get them to high and dry ground, drop fodder to those animals that are still hanging around so that we can keep those stock alive and healthy.\n\n\"It takes years to build back numbers, and not to mention the time and effort of genetics that you've put into your livestock.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/golf-houston-open-min-woo-lle-minjee/105120572",
        "title": "Min Woo Lee admits he's not the best golfer in his family",
        "publish_date": "Mon, 31 Mar 2025 21:32:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "Min Woo Lee plans on celebrating his watershed Houston Open win with the best golfer in the family.\n\nLee holds nerve to claim Houston Open Photo shows Min Woo Lee holds the Houston Open trophy. After leading by a stroke heading into the final hole, Australia's Min Woo Lee breaks through for his first PGA Tour victory following a tense finish at the Houston Open.\n\nAs well as rising above Adam Scott to become Australia's new number one on the men's rankings, the 26-year-old completed another rare double with his epic victory over Scottie Scheffler on Monday AEDT.\n\nMin Woo and sister Minjee are only the third siblings to notch wins on the PGA and LPGA Tours respectively.\n\nThe Lees were already the only brother-sister act to have both won the US Junior Amateur title and last year represented Australia at the Paris Olympics.\n\nFor all his talent, Min Woo has often conceded he is not even the best player in the family, having long lived in the shadows of dual major champion Minjee.\n\nBut he is edging closer, on rankings at least.\n\nWhile Min Woo has surged up to number 22 in the world in the men's rankings, Minjee has fallen from second to 18th on the women's standings, having gone winless since 2023.\n\nLittle wonder Minjee was the first family member to congratulate him on a FaceTime call after he secured his first PGA Tour title.\n\n\"I called my family, and my mum was crying as usual. Dad was very happy,\" MIn Woo said.\n\n\"My sister was the first one to pick up. I talked to her yesterday about having dinner tomorrow.\n\n\"She's in Vegas and I live there and she's playing an LPGA tournament there.\n\n\"So it will be very cool to see her. I haven't seen her in a little bit, so it's very cool to have a sister that's really good at golf, and she's going to win soon, too.\"\n\nMin Woo Lee held on for a one-stroke victory at the Houston Open. (Getty Images: Kenneth Richmond)\n\nLooming as a serious Masters contender when the season's first major gets underway on April 10, Min Woo still reckons Minjee might have the wood on him if they played against each other.\n\n\"If we play from the same tees, I'll smoke her because I hit it very far,\" he said.\n\n\"But if she played from her tees and I played from mine, it would be pretty close.\n\n\"She's got the long putter in now so she can putt and she's doing really good over the last couple months putting.\n\n\"Over the long run, I think she might beat me. She's a robot. She probably would have hit 19 fairways out of 18 fairways today because she's a robot.\n\n\"She's very straightforward and she controls the ball so well. Over time she'll probably win, but if there was a little short sprint I might win.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/wa-government-departments-restructure-explainer/105119042",
        "title": "The WA government is restructuring its departments, but what actually changes?",
        "publish_date": "Mon, 31 Mar 2025 21:25:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's the post-Mark McGowan, post-COVID overhaul of the machinery of government that puts the focus on Premier Roger Cook's priorities of building hospitals and more homes.\n\nBilled as \"targeted reforms\" to the public sector and government departments, there is a central focus on bringing together and retaining people with expertise in delivering multi-billion-dollar public infrastructure projects.\n\nWith thousands of public sector workers impacted, their union has demanded it is consulted every step of the way.\n\nWhat will actually change?\n\nThe number of government departments is increasing from 25 to 26, with nine departments impacted.\n\nThe changes will start on July 1 and are due to be finished by December 31.\n\nThe old McGowan-era departments of Jobs, Tourism, Science and Innovation (JTSI) and Communities are gone, with their responsibilities dispersed.\n\nJTSI is being replaced by the Department of Energy and Economic Diversification (DEED), reflecting the government's policy of transitioning to lower-carbon energy.\n\nDEED will look at moving away from fossil fuels for energy. (ABC News: Andrew O'Connor)\n\nThe Department of Premier and Cabinet will now include a new Office of Defence Industries, with a big focus on AUKUS, and a new Office of Early Childhood.\n\nThe DPC will also take leadership on Aboriginal affairs policy, an area the premier has previously worked in, to help oversee better social outcomes and project development.\n\nThe major shake-up is the creation of a Department of Transport and Major Infrastructure, with a new Office of Major Infrastructure Delivery to build Westport and hospitals like the Women's and Babies Hospital and upgrades to Royal Perth and Midland hospitals.\n\nWA Treasurer Rita Saffioti says experience will be key in the new departments. (ABC News: Keane Bourke)\n\nThe government said this would be a \"centre of excellence\" for the construction and management of major projects, bringing together the best engineers and minds.\n\n\"Managing billion-dollar contracts is difficult and what you want are people that have gone through it a few times, know what to look out for and know how to improve,\" Treasurer Rita Saffioti said.\n\n\"That's what we're doing.\"\n\nThat new department will be paired with a new Department of Housing and Works, taking over responsibility for building, maintaining, and managing the state's social housing stock from the Department of Communities.\n\nIt will also oversee building and maintaining smaller projects, like schools and police stations, instead of the Department of Finance.\n\n\"In a sense a big builder and a little builder,' Ms Saffioti said.\n\nThe Department of Housing and Works will try to tackle the state's building woes. (ABC News: David Weber)\n\n\"It's about retaining talent. It's about making sure we can capitalise on the excellent delivery across a range of projects, making sure we can keep that knowledge learned.\"\n\nThere will also be a Department of Creative Industries, Tourism and Sport, a Department of Mines, Petroleum and Exploration, driving development of the resources industry, and a Department of Local Government, Commerce, Industry Regulation and Safety.\n\nWhat will it cost and will there be job cuts?\n\nNo extra cost and no job cuts, according to the premier.\n\nThat doesn't mean it will be easy, though.\n\nHere's what Australia's richest state government did with four years of dominance Photo shows Two men smiling on a red backdrop of a city skyline Never before in Australia has a state government had so much political power with so much wealth at its disposal. What does Labor have to show for its total control?\n\n\"We understand that these changes will be inconvenient to some people, and we also understand and acknowledge that it's a lot to take in,\" Mr Cook said.\n\nThe changes are not part of any austerity measures or designed to save the budget money.\n\n\"We're progressing this on the basis of cost neutrality,\" Mr Cook said.\n\n\"It's not a savings exercise. We expect the departments to absorb the costs associated with this in the normal manner in which they would expect to integrate this as part of overall management.\n\n\" We're not expecting to see any losses of staff … This is about reforms that are focused on the delivery, particularly in relation to our key priorities. \"\n\nThe Community and Public Sector Union/Civil Service Association of WA (CPSU/CSA) said the changes had likely made thousands of public sector workers uneasy.\n\n\"Restructures to government departments are difficult for workers, and the union will be ensuring public sector workers are front and centre of discussions over the next twelve months,\" union state secretary Melanie Bray said.\n\nWhat is the government trying to achieve?\n\nThe government thinks this is the best way to deliver services and infrastructure, especially hospitals and houses, quickly and efficiently, with minimum problems.\n\nIt knows the public expects a high standard in health and housing and it also knows how much political pain there will be if there are blunders, delays and blow outs.\n\n\"This is about making sure we have the best people to deliver these projects,\" Ms Saffioti said.\n\nThe Department of Transport will become the Department of Transport and Major Infrastructure. ( ABC News: Rick Rifici )\n\n\"Without this consolidation of infrastructure expertise what we're seeing is agencies trying to build up their own expertise and what we're getting is a diluted amount of expertise across the public sector.\n\n\"Having it under the one umbrella [the Office of Major Infrastructure Delivery] is very much about retaining skilled staff and it's also about making sure we have a centre of experienced people who have delivered major projects where we can continue to learn from each other.\"\n\nWhat are the risks?\n\nWe don't know for sure that there actually will be no new costs or that no-one will be sidelined or lose work.\n\n\"The devil is in the detail,\" Unions WA secretary Rikki Hendon said.\n\n\"We are yet to see how the government will roll out these changes.\"\n\nUnions WA secretary Rikki Hendon will be looking closely at how the restructures unfold. ( ABC News: James Carmody )\n\nMr Cook was asked during the media conference for the announcement if putting hospital construction under the same roof as the construction of ports and other big projects could undermine the best delivery of healthcare.\n\nHe rejected that, saying the client, in this case the Department of Health, would be consulted all the way through.\n\n\"The clinical consultation at the design stage of the hospital is fundamental to making sure you build a hospital which is going to meet the requirements of not only the staff but also the patients in that hospital,\" he said.\n\n\"The delivery of the building, though, is obviously the subject of people who have got expertise in delivering major infrastructure.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/election-2025-coalition-promises-relax-home-lending-rules/105120432",
        "title": "Coalition promises to relax home lending rules, against regulator's urging",
        "publish_date": "Mon, 31 Mar 2025 21:08:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Coalition is promising to relax rules around approving home loans that it says will let more young people buy their first home.\n\nThe financial regulator requires banks to add a safety buffer when considering whether someone applying for a home loan will be able to make their loan repayments.\n\nCurrently that is set at a rate of 3 per cent above the loan interest rate.\n\nThe serviceability buffer was raised to 3 per cent during the COVID pandemic when the official cash rate was at an all-time low of 0.1 per cent.\n\nShadow Housing Minister Michael Sukkar says it is out of date, and the Coalition will ensure it is lowered if it wins at the May 3 poll.\n\n\"Nearly 40 per cent of potential first home buyers are not able to get finance for a loan … primarily because of that serviceability buffer,\" Mr Sukkar told ABC Radio National.\n\n\"Now that we have elevated interest rates, a serviceability buffer that has not been flexible with those changes is just blocking Australians.\"\n\nShadow Housing Minister Michael Sukkar says the regulator's lending rules are overly restrictive. (ABC News: Matt Roberts)\n\nThe Coalition says a \"one-size-fits-all\" rule to assessing serviceability is stopping tens of thousands of Australians from getting a home loan \"even when they can meet repayments with a prudent margin against unexpected future rate rises\".\n\nCurrently, the financial regulator's priority is ensuring banks are not taking on too many risky loans, which dampens borrowing power.\n\nEasing lending rules would make it easier for first home buyers, but would it create financial instability? Photo shows A lady outside a melbourne suburban home A federal inquiry is considering whether there's a need to ease restrictions on banks about how much they can lend out to first home buyers.\n\nThe Coalition would change the Australian Prudential Regulatory Authority's mandate to allow it to take borrowers into greater consideration.\n\nHowever, APRA's chair has urged that the serviceability buffer remains at 3 per cent, saying late last year household debt was already high relative to incomes, and higher than in other nations.\n\n\"This high household debt is a key vulnerability if adverse economic scenarios came to pass,\" APRA chair John Lonsdale said in November.\n\nMr Sukkar said it was understandable to have a high buffer during COVID, but it should be responsive and react to the market.\n\nThe shadow housing minister noted it was lifted from 2.5 per cent to 3 per cent in 2021 during the pandemic.\n\nThe Coalition says it will also require APRA to adjust how loans backed by Lenders Mortgage Insurance are treated, so that people without access to \"the bank of mum and dad\" are punished by higher borrowing costs.\n\nIn essence, the Coalition would seek to no longer require banks to hold more capital against LMI-backed loans, which sets a premium on those loans that leads to banks charging higher interest rates on them.\n\nThe major banks and property groups have backed more relaxed lending rules.\n\nTreasurer Jim Chalmers recently ordered APRA to disregard HELP repayments when assessing an applicant's ability to service their mortgage, if those debts are close to being paid off.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-01/musical-pranksters-hoax-history-motives/105099432",
        "title": "Behind classical music's most infamous forgeries",
        "publish_date": "Mon, 31 Mar 2025 21:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Every so often, the music world is delighted by the discovery of musical works by long-dead classical greats, only to feel immense disappointment when some turn out to be fake.\n\nThe music world, just like other arts communities, is no stranger to deceptions.\n\nOver the last 150 years, many musical forgers have published their music as Bach, Mozart, Haydn or lesser-known composers from history.\n\nPlagiarism cases also showed musicians claiming other people's works as their own.\n\nWhat motivated them to make these false claims?\n\nRiding on famous composers' names\n\nAt the turn of the 20th century, French brothers Henri and Marius Casadesus regularly unearthed musical masterworks by Mozart, Handel, Carl Phillip Emanuel Bach and Johann Christoph Bach. The Casadesus brothers both performed and published those musical scores.\n\nMusicologists eventually found out the brothers composed most of the music they claimed they unearthed. But by the time the ruse was uncovered, the music had been frequently recorded with the false attributions.\n\nABC Classic Mornings presenter Russell Torrance believes money was the motivation behind the Casadesus forgeries.\n\n\"People are more interested in music by Mozart than music by some random publisher-guy,\" he says.\n\nSelling sheet music was quite lucrative in the past. But it wasn't until the 19th century when music publishing took off that composers became more assertive about the authorship of their music.\n\nTorrance says the Casadesus brothers tried to meet the demand from people's curiosity and enthusiasm for music from the past. He admits he found their prank ingenious.\n\n\"To pass off their music as someone else's, they must've been very skilled composers,\" he says.\n\nMusic lost for hundreds of years unearthed and brought back to life Photo shows Lang Lang seated at a grand piano facing toward the camera with one elbow propped on the lid and his head resting in his hand. In 2024, music lovers got to hear new music by long-dead composers Mozart and Chopin.\n\nMoney isn't the only reason people commit musical forgeries.\n\n\"There are women who've used the idea of a musical hoax to get around the fact that women aren't always taken seriously,\" says Alice Keath, presenter of What's On and Weekend Baroque at ABC Classic.\n\nShe highlights the case of 19th-century German composer Fanny Mendelssohn who published some of her music under her brother Felix's name.\n\nAfter marrying a supportive husband and meeting fellow composer Clara Schumann, Fanny published music under her own name.\n\nStealing someone else's music\n\nOne of the more serious musical hoaxes happened in the 2000s.\n\nBritish pianist Joyce Hatto is what researcher Lisa Giombini calls \"a prodigy of old age\".\n\nWith the help of her producer husband, William Barrington-Coupe, Hatto released no less than 1,103 CDs despite being seriously ill with cancer.\n\nAfter Hatto's death, it was discovered that \"She hadn't played one single note of all this impressive number of recordings,\" Dr Giombini says.\n\nMany of Hatto's recordings were performances by lesser-known artists, re-released under her name after being digitally-treated by Barrington-Coupe. It was a classic case of plagiarism.\n\nThe deception came to light when Hatto's CDs were put through recording databases which identified the original performers.\n\nDr Giombini, who has researched many musical forgeries and plagiarism cases, explains why many people feel betrayed by Hatto's deception:\n\n\" Experts and amateurs were thrilled by the idea of this old lady playing the piano like a young virtuoso. \"\n\nEven though the discovery was made a few years before his death in 2014, Barrington-Coupe was never prosecuted for his part in the musical theft.\n\nDifferent attitudes towards authorship\n\nMost musical hoaxes involve composers who are long dead.\n\nMany of them were from the eras known as the baroque and classical music periods which span 1600-1800.\n\nMost music scores from this time were scattered in private collections and archives which were not catalogued, making it easier for forgers to slip something in.\n\nKeath cites Albinoni's Adagio, a piece of music which was supposed to exemplify a baroque composer's style but was instead written by his 20th-century biographer Remo Giazotto.\n\nAnother example is the much-recorded Ave Maria by 20th-century composer Vladimir Vavilov. After Vavilov's death, his music was misattributed to a 16th-century Italian composer Giulio Caccini.\n\nIt's believed one of the performers involved in recording Vavilov's music was behind this misattribution, assuming a long dead composer had more cachet than a recently dead one.\n\nLoading YouTube content\n\nKeath says our attitude towards composers has changed over time, with people having a different idea of musical authorship in the past.\n\nIn the baroque era, \"there were a lot of musical themes which composers passed around, so you don't really know who initially wrote it,\" Keath says.\n\nComposers like Vivaldi, Bach and Handel borrowed tunes from their contemporaries as well as their own previously-written music.\n\nThis kind of borrowing was considered as a mark of respect and admiration.\n\nWhy we fall for hoaxes and deceptions\n\nNowadays, it's much harder to commit musical forgeries.\n\nA recent discovery of a Chopin Waltz in the New York's Morgan Library and Museum archives underwent extensive tests to prove its authenticity.\n\nBut it doesn't mean we're immune from hoaxers and pranksters.\n\nThe arts world, for instance, was rocked by the revelation last year that some Picasso paintings at Tasmania's Museum of Old and New Art were fakes, painted by local artist Kirsha Kaechele.\n\nIn recent times large learning machine databases which power AI music generators have dwarfed the kind of plagiarism pulled off by Hatto and Barrington-Coupe.\n\nWhat we know about the artists behind the music can influence how we appreciate their works, Dr Giombini says.\n\nBut Torrance doesn't think it means we should stop enjoying some of these hoax pieces, with one caveat:\n\n\" You've got to be honest and tell the audience the whole story. \"\n\nSign up to the ABC Classic Newsletter",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-wall-street-slides-lower-20250401-p5lo2d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX jumps after Wall Street rises in wild session; RBA set to stay on hold",
        "publish_date": "Tue, 01 Apr 2025 13:01:05 +1100",
        "category": "finance",
        "authors": [],
        "text": "Such neck-twisting turns have become routine for the US stock market recently because of uncertainty about what Trump will do with tariffs — and by how much they will worsen inflation and grind down growth for economies. Wall Street’s swings followed a sell-off that spanned the world earlier on Monday as worries built about the effects of the tariffs that Trump says will bring manufacturing jobs back to the United States. “The best way to summarize this trading environment is frustration and fatigue,” said Joe Gilbert, a portfolio manager at Integrity Asset Management. “We don’t really have a clear playbook on how to proceed.” In Japan, the Nikkei 225 index dropped 4 per cent. South Korea’s Kospi sank 3 per cent, and France’s CAC 40 fell 1.6 per cent. Instead of stocks, prices strengthened for things considered safer bets when the economy is looking shaky. Gold rose again to briefly crest $3160 per ounce. Prices for US Treasury bonds also climbed, which in turn sent their yields down. The yield on the 10-year Treasury fell to 4.21 per cent from 4.27 per cent late Friday and from roughly 4.80 per cent in January.\n\nOn Wednesday, the United States is set to begin what Trump calls “reciprocal” tariffs, which will be tailored to match what he sees is the burden each country places on his, including things like value-added taxes. Much is still unknown, including exactly what the US government will do on “Liberation Day”. At Goldman Sachs, economists expect Trump to announce an average 15 per cent reciprocal tariff. They also raised their forecast for inflation and lowered it for US economic growth for the end of the year. Loading They now see a 35 per cent chance of recession in the next year, up from an earlier forecast of 20 per cent, “reflecting our lower growth forecast, falling confidence, and statements from White House officials indicating willingness to tolerate economic pain,” according to Goldman Sachs economist David Mericle. If the April 2 tariffs end up being less onerous than investors fear — maybe Trump includes no additional tariff increases on China, for example — stocks could rally. But if they end up being a worst-case scenario, which gets businesses so fearful that they start cutting their workforces, stocks could sink much further.\n\nOf course, there’s also the chance that April 2 does little to clear the uncertainty. It could end up being a “stepping stone for further negotiations” instead of a “clearing event” for the market, according to Michael Wilson and other strategists at Morgan Stanley. “This means policy uncertainty and growth risks are likely to persist — it’s a question of to what degree,” Wilson wrote in a report. One worry is that even if Trump’s tariffs end up being less harsh than feared, all the uncertainty created by them alone could cause US households and businesses to freeze their spending, which would hurt an economy that had been running at a solid pace to close last year. Either way, some familiar names were among Wall Street’s hardest hit on Monday. Tesla fell 1.7 per cent to bring its loss for the year so far to 35.8 per cent. It’s been one of the year’s worst performers in the S&P 500 in large part because of fears that the electric-vehicle maker’s brand has become too intertwined with its CEO, Elon Musk.\n\nMusk has been leading US government efforts to cut spending, making him a target of growing political anger, and protests have swarmed Tesla showrooms as a result. Other Big Tech stocks also struggled. They’ve been at the sell-off’s centre in large part because of criticism that their stock prices had become too expensive. Critics pointed to how their prices rose faster than their already quick-growing profits in recent years. Nvidia, which has ridden the frenzy around artificial-intelligence technology to become one of Wall Street’s most influential stocks, fell 1.2 per cent to bring its loss for the year so far to 19.3 per cent. On the winning side of Wall Street, Warren Buffett’s Berkshire Hathaway rose 1.2 per cent and was one of the strongest forces lifting the S&P 500. The parent of GEICO and other companies said earlier this year it’s sitting on $334.2 billion in unused cash. Such a large amount could indicate Buffett, who’s famous for buying when prices are low, may see little worth purchasing in a stock market that critics had called too expensive. with AP/Bloomberg",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-baby-crocodile-found-in-gold-coast-suburbs-20250331-p5lnx5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Ex-tropical cyclone Dianne brings more rain to flood-hit areas | Baby crocodile found in Gold Coast suburbs",
        "publish_date": "Tue, 01 Apr 2025 13:00:33 +1100",
        "category": "finance",
        "authors": [],
        "text": "Labor frontbencher and former treasurer Cameron Dick has asked Premier David Crisafulli when a review of health infrastructure projects will be released.\n\nWhile Dick suggested the review would lead to cuts and delays, Crisafulli told parliament his LNP government was cleaning up Labor’s mess.\n\nLoading\n\nCrisafulli would not say when the review would be released, but told Dick he had “failed to fund health infrastructure when he had a chance”.\n\nAlluding to possible internal documents uncovered by the review, Crisafulli challenged Dick to declare every project was fully funded by his government.\n\n“You had 10 years, and you failed badly, you failed very, very badly,” he said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/contract-for-konstas-selectors-reward-teenager-with-central-deal-20250401-p5lo3r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Contract for Konstas: Selectors reward teenager with central deal",
        "publish_date": "Tue, 01 Apr 2025 13:00:14 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Sam Konstas and Beau Webster have earned firm places in Australia’s plans, while Matt Kuhnemann is now undisputed as Nathan Lyon’s number two in the national team’s spin bowling ranks, after all were handed central contracts on Tuesday.\n\nTeenaged batter Konstas and seasoned all-rounder Webster were at the opposite ends of the experience scale, but both made important contributions to the Test series victory over India last summer.\n\nSam Konstas and Pat Cummins celebrate Australia’s victory in the fourth Test of last summer at the MCG. Credit: Getty Images\n\nKonstas, 19, was chosen as a circuit-breaker for Australia at the top of the order on Boxing Day, when his daring innings of 60 helped set up a victory that broke a 1-1 tie in the Border-Gavaskar series.\n\nWebster was then called up for the final Test in Sydney in place of a struggling Mitch Marsh, and showed great maturity with the bat, the ball and in the field to make himself very useful for the Australian cause in a low-scoring match.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/federal-election-2025-live-updates-albanese-says-dutton-unprepared-for-government-voters-worry-over-trump-effect-20250331-p5lny6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Dutton reveals pledge to cut $2.2b from Melbourne’s Suburban Rail Loop project; RBA to decide on interest rates this afternoon",
        "publish_date": "Tue, 01 Apr 2025 12:53:04 +1100",
        "category": "finance",
        "authors": [
            "Anthony Segaert",
            "Lachlan Abbott"
        ],
        "text": "Just before Peter Dutton wrapped up his press conference in Melbourne earlier this hour, the Liberal leader pledged there would be no changes to superannuation if he won government.\n\n“I believe very strongly in superannuation and I do also believe that you can do a lot of good with the current superannuation policy,” he said.\n\nThough he has not proposed changes to the fundamentals of superannuation, the Coalition has pledged to let first home buyers take up to $50,000 from their accounts for a home deposit in a move they say would help make houses more affordable for young people.\n\nHowever, the superannuation industry’s peak body, the Super Members Council, has derided that plan as “one of the worst public policy decisions” of the century, claiming it would push up demand and home prices.\n\nWith Lachlan Abbott",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/putin-stole-their-businesses-but-now-they-want-them-back-20250401-p5lo2c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Putin stole their businesses, but now they want them back",
        "publish_date": "Tue, 01 Apr 2025 12:41:27 +1100",
        "category": "finance",
        "authors": [
            "Melissa Lawford"
        ],
        "text": "Now, however, the chances of a return to Russia – if not the extraction of proper payment for stolen assets – has risen with Donald Trump in the White House and new messaging from US officials about reopening economic ties with Russia. Kirill Dmitriev, the head of the Russian Direct Investment Fund, said last month he expected “a number of American companies will return to the Russian market as early as in the second quarter of the year”. Some Western businesses have already laid the groundwork to return. French carmaker Renault sold all of its shares in Renault Russia and its 67.69 per cent interest in Russia’s AvtoVAZ in May 2022, but this agreement includes an option for Renault to buy back its interest in AvtoVAZ that is exercisable for six years. Luca de Meo, the Renault chief, last month refused to rule out a return to Russia. However, officials have since said the carmaker would need to pay $US1.3 billion to do so.\n\nExecutives should also be wary: analysts warn that Putin is using Western businesses as a pawn in his games with Europe and the US. Lost Western assets and cash have become a bargaining chip in negotiations over a potential peace deal on Ukraine – and a way of dividing Europe. Renault chief Luca de Meo has refused to rule out a return to Russia. Credit: Bloomberg “As sanctions have proliferated, the Kremlin has increasingly come to the view that Russian assets of multinational firms are useful collateral for frozen assets abroad,” says Ian Massey, at S-RM consultants. Europe and the US have frozen some $US300 billion in Russia’s overseas assets, something that has irked the Kremlin. Austria’s Raiffeisen Bank International (RBI) is battling a €2 billion ($3.4 billion) fine imposed by a Russian court in January, which officials said was compensation for frozen assets in Austria. “We had only 10 minutes to make our case in court,” says RBI spokesperson Christof Danz. The defendant was flanked by armed people wearing balaclavas. RBI is appealing the ruling and has its next court hearing on April 24.\n\n“The presence of Western businesses in Russia and the kind of leverage that gives [Putin] over certain European countries has been one of the most useful tools in the Kremlin’s toolbox for years,” says Patrick Sewell, of Control Risks, a consultancy. Loading With the Ariston decision, Putin may also be trying to divide Europe by signalling that countries that take a softer line to Moscow may get their assets back, he says. “I think it’s quite plausible that Putin would be happy to allow certain Western companies to take back their assets in a way that drives a wedge between different members of the EU. “Italy has sometimes been a kind of soft target for Russia. They’ve typically been among the more Russian friendly-countries of the EU, the Italian business community has always been very active in Moscow.”\n\nPutin’s response to the tidal wave of Western sanctions that hit Russia after the war began was a vicious attack on foreign businesses operating in the state. Of the $US167 billion lost since 2022, $US57 billion has been lost by 30 companies who have had their assets forcibly seized, according to the KSE Institute. These included French yoghurt maker Danone and Danish brewer Carlsberg, both of which have since sold their Russian assets and cut their losses. Putin also imposed blocks on companies trying to escape. Until last autumn, businesses selling assets in Russia had to take a 50 per cent hit on the sale price and pay an exit tax on the proceeds of 15 per cent. In October, Russia raised the discount to 60 per cent and the exit fee to 35 per cent. Transactions are also subject to a protracted approval process involving the finance ministry. It can take 12 months and is often unsuccessful. In other words, many businesses are effectively held to ransom. Western firms are fighting back. Ariston’s case was backed by major lobbying from the Italian Foreign Ministry. More companies are trying to attack through the legal system.\n\nGerman oil and gas producer Wintershall Dea has begun two arbitration proceedings against the Russian Federation after Putin signed decrees booting the company out of all of its five Russian joint ventures, including in the Nord Stream pipeline. Finnish energy company Fortum similarly initiated arbitration proceedings against Russia in February 2024 for compensation for unlawful seizure after it had its assets seized by presidential decree in 2023. “Fortum has since lost all oversight and control over the assets, and we are unaware of who runs these assets nor do we have any other information regarding the assets,” says Esa Hyvärinen, at Fortum. These tactics can be legally successful. In June 2024, German energy company Uniper won a $14 billion arbitration ruling against Russia’s state-owned energy giant Gazprom. But there is a big difference between winning a court ruling and enforcing it.\n\n“It looks good, it sounds good, but in practice awards of that nature in the current environment are likely to be more symbolic in nature,” says Massey. “Enforcement and recovery are very challenging exercises in hostile circumstances.” If Western businesses cannot get paid for businesses they have lost, would returning to Russia be a viable option? ‘The presence of Western businesses in Russia and the kind of leverage that gives [Putin] over certain European countries has been one of the most useful tools in the Kremlin’s toolbox for years.’ Patrick Sewell of consultancy Control Risks There are still $US194 billion worth of foreign assets in Russia, and Trump has suggested he will give businesses the green light to resume operations there. Marco Rubio, the US secretary of state, said in February there could be “incredible opportunities” for US business in Russia.\n\n“All the way up to the election of Donald Trump, companies were lining up to get approvals [to exit Russia],” says Alan Kartashkin, who formerly ran the Moscow office of law firm Debevoise & Plimpton and now oversees its Eastern European business. Loading “So much has changed. Now, you have a US president saying we should develop economic ties with Russia and investors take notice. No leader in the Western world has said that since [Putin’s invasion of Ukraine in] February 2022.” Hedge funds are exploring how they can make investments in the Russian stock market, he adds. “They want to place a bet on a potential peace deal.” Sewell says other companies are looking at the feasibility of selling non-sanctioned goods, such as food, in Russia again.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/arcade-champion-wins-lawsuit-against-queensland-youtube-creator-20250401-p5lo8a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Arcade champion wins lawsuit against Queensland YouTube creator",
        "publish_date": "Tue, 01 Apr 2025 12:36:48 +1100",
        "category": "finance",
        "authors": [
            "Rex Martinich"
        ],
        "text": "American arcade game champion Billy Mitchell has been awarded $350,000 in damages after winning a defamation lawsuit against a Queensland-based YouTuber.\n\nKarl Jobst posted a YouTube video online for a total of 15 days that claimed Mitchell’s lawsuit against another online creator had left the young man “deeply in debt”.\n\nThe American claimed Jobst’s video had implied Mitchell’s actions had contributed to YouTuber Benjamin Smith, who went by the screen name “Apollo Legend”, taking his own life.\n\nAmerican computer video game champion Billy Mitchell is seen outside the Brisbane District Court. Credit: AAPIMAGE\n\nJudge Ken Barlow handed down his judgment on Tuesday following a trial in September and October.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/why-this-much-talked-about-restaurant-is-being-overhauled-in-its-first-year-20250331-p5lnx3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why this much-talked-about restaurant is being overhauled in its first year",
        "publish_date": "Tue, 01 Apr 2025 12:25:12 +1100",
        "category": "finance",
        "authors": [
            "Dani Valent"
        ],
        "text": "Advertisement\n\nEating outComing soon Why this much-talked-about restaurant is being overhauled in its first year The owners admit the original menu “missed the mark” with locals – now they’ve gone back to the drawing board, revealing a new all-women leadership team with impressive international credentials. Dani Valent April 1, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nHospitality entrepreneur Nathan Toleman has opened 24 venues over the past 20 years, but with his most recent restaurant, the Mulberry Group creative director (and partner in Lune Croissanterie) has experienced a rare failure. Molli, the restaurant the group opened in Abbotsford last June, will close on April 2 before reopening mid-April with a new concept and chef. Molli bistro-bar (left) and Little Molli cafe-deli will make way for new concepts. Tim Harris (left) and Kristoffer Paulsen “We missed the mark for creating an all-day neighbourhood venue,” says Toleman. “It was a special-occasion place, not somewhere people raced back to. I had people who’ve supported my venues for years say, ‘I have to tell you this … I didn’t love it.’ In our own hearts, it just wasn’t right.” “It’s hard to make a business profitable from day one,” he adds. “We’re okay with that if it’s on the right track, but we weren’t achieving the growth we wanted.” One of Molli’s open-faced sandwiches, topped with egg, greens and skordalia. Supplied\n\nAdvertisement\n\nIncoming head chef Caitlin Koether, who’s worked at San Francisco’s Bar Tartine and Relae in Copenhagen, will serve wholesome dishes threaded with ferments, big flavours and striking colour palettes. All-day breakfast includes house-made yoghurt with sour cherry granola, while lunch will be built around open-faced sandwiches such as smoked chicken, chickpea miso mayonnaise and pickled celery. At night, bread and dips get a refresh: potato-based fry bread with whipped schmaltz, lemon thyme and chicken skin sounds like dinner unto itself. The menu continues with a chopped salad; roasted carrots with pickled persimmon; and steak aged with koji, the tenderising and flavour-giving Japanese ingredient. Carrots with pickled persimmons reflect new chef Caitlin Koether’s wholesome style. Supplied “I want people to feel nourished, and to be able to come in and have an entire meal without breaking the bank,” she says.\n\nAdvertisement\n\nKoether came on board in October as head of fermentation, a job title she borrowed from a position she almost snared at Noma in Copenhagen in 2023. She’s part of Molli’s new all-women leadership team, which includes bar manager Kayla Saito (ex-Aru) and general manager Bonnie Maguire (ex-Falco). Head chef Caitlin Koether and venue manager Bonnie Maguire. Supplied Outgoing chef Aleksis Kalnins, who joined Mulberry Group in 2023 to helm Hazel, has departed the group and is considering offers. He puts Molli’s troubles down to a mismatch between his cooking and the neighbourhood, which is known for pubs and bordered by Victoria Street’s more casual dining. “If we opened on Flinders Lane, I think we would have done well.” Toleman is still a Kalnins fan. “There’s a football analogy: you have a great player, but you’re playing him in the wrong position,” he says.\n\nAdvertisement\n\nAdmitting the misfire on Molli 1.0 has been tough, but Toleman says he’s open to learning. “The most successful people in business – Phil Knight from Nike, Richard Branson – have as many failures as successes. We don’t talk about failure enough. Let’s own it.” The interior of Molli is being tweaked to suit the new all-day brief. Tim Harris The restaurant will aim for a softer look when reopens, with the stately antique credenzas replaced with more contemporary furnishings. Adjacent cafe Little Molli will stop operating on April 8 and reopen later in the month as a pantry selling Mulberry Made ferments. Cooking classes and workshops are planned, too. Molli reopens April 11. Breakfast and lunch daily; dinner Tue-Sat. 20 Mollison Street, Abbotsford, molliabbotsford.com.au\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/not-on-my-watch-pms-message-for-trump-20250401-p5lo82.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Not on my watch': PM's message for Trump",
        "publish_date": "Tue, 01 Apr 2025 12:15:13 +1100",
        "category": "finance",
        "authors": [],
        "text": "'Not on my watch': PM's message for Trump\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/was-li-ka-shing-pushed-to-sell-panama-ports-or-did-he-jump-20250401-p5lo3s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Was Li Ka-shing pushed to sell Panama ports, or did he jump?",
        "publish_date": "Tue, 01 Apr 2025 12:12:14 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Trump, of course, has touted the deal as a personal victory, while China’s response characterises it as its loss. That raises question marks for both countries. Loading BlackRock and its co-investors, Global Infrastructure Partners (recently acquired by BlackRock) and Terminal Investment, a Swiss-based company owned by the Aponte shipping billionaire family, are Western, privately owned companies. Hutchison, a conglomerate with interests in ports, infrastructure (including gas pipeline networks in Australia), telecommunications (including a 25 per cent stake in TPG Telecom) and property around the world, is also, ostensibly, a privately owned, commercially driven group. It’s regarded as the most successful company Hong Kong has produced.\n\nIf the deal is a win for Trump and the US, is the US president implying – as Beijing might believe –that the consortium will prioritise the management of the ports in the economic and national security interests of the US over those of its investors? If the deal is contrary to China’s national economic and security interests, as its response implies, does that mean it sees Hutchison’s ownership or control of the ports as supportive of its strategic ambitions? For the US – and the other 22 countries that will need to consider the implications of the deal from their own perspectives – the BlackRock consortium can be expected to be driven by its own commercial considerations. Is Donald Trump suggesting that the buyers of the Panama Canal will manage its ports in the economic and national security interests of the US? Credit: AP Trump might want to attack China’s dominance of global commercial shipping with massive increases in port fees and the rebuilding of a nearly non-existent US shipbuilding industry, but the consortium will be more interested in maximising the returns on a massive investment than in geopolitics. Even in Trump’s America, businesses (other than, perhaps, Elon Musk’s) prioritise profits above all else.\n\nFor China, blocking – or trying to block – the deal could suggest that it does see ownership of ports around the world as an important component of its geopolitical strategy and that even its private sector operators (Chinese state-owned companies are also major port operators) have been co-opted, or at least can be coerced to co-operate, with Beijing’s ambitions. It would confirm Western suspicions. Ownership of ports and infrastructure around the world – particularly within the “Global South” countries, with which China has been steadily building relations and dependence via its “Belt and Road” initiative – is clearly an important part of China’s strategy of gaining influence or control over critical points within global supply chains and its longer-term ambition of undermining America’s global dominance. Opposing the Hutchison sale does, moreover, present some domestic risks for Beijing and China’s economy. As China’s economic growth has slowed and deflationary threats have emerged, Xi Jinping has shifted its stance on the private sector, which had previously been subjected to waves of crackdowns, regulation and intimidation. In February, Xi met China’s leading entrepreneurs as a sign that they were back in favour and that he needed them to help re-energise China’s faltering economic growth rate.\n\nFrustrating the Hutchison sale would signal to those entrepreneurs that the state support and the freedoms he was dangling before them to be entrepreneurial and profit-driven come with a caveat. They, and their fortunes, would still be subject to the whims of the state. More particularly, even after the handover of Hong Kong by the UK to China in 1997, China has tried to maintain a level of commercial independence for Hong Kong and its status as one of the world’s key centres for finance and trade – although its response to the 2019 pro-democracy demonstrations, the controversial national security laws, placed a question mark over the extent of its tolerance. Loading Ordering or coercing Li and his family into abandoning the sale would send a chilling message to other Hong Kong entrepreneurs, privately held companies, and prospective investors in Hong Kong – and that at a time when foreign investors have, despite a concerted effort by the authorities, been fleeing mainland China. If Hong Kong is to remain a key global finance and trade hub, it can’t send a signal that it will intervene in the affairs of multinationals, even those built by Hong Kong entrepreneurs.\n\nThere is some doubt whether China has much ability to intervene, other than through coercion. Hutchison has diplomatically retained ownership of its ports on the mainland and in Hong Kong, and while its property arm does have investments on the mainland, it has steadily reduced its exposure to Greater China over the decades. Only about 12 per cent of its revenue is generated within China and Hong Kong, with most of the rest flowing from Europe, North America and Australia. The $US19 billion of net cash it would get from the sale would be useful, given that it has announced a £7 billion ($14.5 billion) bid for the UK’s Thames Water and has also indicated it will return significant amounts to shareholders. It would also be timely. With Trump about to ramp up his trade war with the rest of the world with a new round of tariffs and having made it clear that China will face punitive port and shipping rates for its exports to America, global growth and global seaborne trade are likely to be adversely impacted.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tszyus-admission-ahead-of-return-20250319-p5lkvi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tszyu's admission ahead of return",
        "publish_date": "Tue, 01 Apr 2025 12:06:56 +1100",
        "category": "finance",
        "authors": [],
        "text": "Tszyu's admission ahead of return\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/art-and-design/lunch-with-karen-quinlan-arts-centre-melbourne-20250326-p5lmrq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Oh, yeah I think everyone’s always interested in the hot pants’",
        "publish_date": "Tue, 01 Apr 2025 12:02:17 +1100",
        "category": "entertainment",
        "authors": [
            "Elizabeth Flux"
        ],
        "text": "Over the next few years, the Melbourne Arts Precinct plan will be rolled out, aimed at connecting the major creative institutes more. Among the changes, there will be a new gallery and a large garden. Loading The most significant change for the Arts Centre over the past two years is that the “short-term pain” Quinlan described when I first spoke to her is here – the renovation of the State Theatre. Its closure last year has left a significant gap in the Melbourne performing arts landscape, with The Australian Ballet and Opera Australia essentially relocating to the Regent Theatre in the interim, creating knock-on effects as companies vie for space to stage productions. Quinlan says the refurbishment – due to finish in 2026 – is on schedule. As we tentatively start picking at our shared plates, each conscious to make sure that we both get to try the different kinds of sashimi, I bring up the last time we met – a few months ago, when we were taken on a tour of the works in progress. After navigating a maze of doors and beams and clutter we were told that we were standing on the stage. It had been difficult to believe. “I know – you go in there and you don’t even recognise it,” says Quinlan with a small smile. “You can’t even work out where you are because of all the scaffolding.”\n\nOnce it’s done, “you won’t notice a visible difference – but you’ll feel it,” she says. The changes are quiet but necessary. “Air conditioning, audio, seating, more aisles, more accessibility, new carpet, new chairs, seating … [and] a more efficient back of house”, she lists. Karen Quinlan CEO Arts Centre Melbourne, Minister for Creative Industries Colin Brooks and local MP Nina Taylor in the construction site of the State Theatre in September 2024. Credit: Justin McManus In the meantime, she adds, the smaller Fairfax and Playhouse theatres are open, and “We have another little space called the showroom, which does new and emerging art, performing arts. So we’re still active down there.” One thing she has been pushing against in her now two years at the helm is how the Arts Centre is perceived. While she highlights the resident companies and programming with pride, she also underscores that “in many ways, we’re more than a hall for hire”. The Arts Centre, she says, known for its live performances across the theatres buildings and the Sidney Myer Music Bowl, but hidden in its depths is a collection of artwork and of performing arts artefacts from across Victorian and Australian history – ranging from paintings by Arthur Boyd to Kylie Minogue’s famed gold hot pants. “Oh, yeah, I think everyone’s always interested in the hot pants,” she says with an edge of amusement.\n\nOne of the newest pieces added to this collection is a photograph of David Hallberg, artistic director of The Australian Ballet, by Bill Henson. The image depicts a statuesque Hallberg looking out over the construction of the State Theatre. “That commission is a slightly new direction for us in terms of building upon what we already have as a collecting institution – which a lot of people don’t know about,” Quinlan reflects. “There are more than 850,000 items.” Artistic Director of The Australian Ballet David Hallberg (left) with photographer Bill Henson with the work that Henson was commissioned to produce of Hallberg by Arts Centre Melbourne that will hang in the State Theatre foyer when it reopens. Credit: Justin McManus The shift from visual arts to performing arts is not the biggest one in her career. Quinlan started out teaching at an all-girls Catholic school, working with textiles. “A lot of garment construction and fabric screen printing,” she explains. “The course I did was very practical. It also had a very strong art history component.” Over her few years there, her role changed and expanded into teaching art and media studies. “It was a good experience, and I loved education,” she says. From there, however, she had a gear shift and a range of jobs – administration at the State Library and a position in the gallery shop at the NGV. As she became more interested in textiles and fashion at the gallery, she approached the curator to ask if she could do some voluntary work in the department. After a few years of volunteering, she began work as a curatorial assistant. “I came into museums and galleries, in a non-traditional way, I suppose.” She notices that I have stopped eating while listening, and ushers me to continue, serving us each a bit more.\n\nChef’s special: Spanner crab on shokupan toast Credit: Luis Enrique Ascui There wasn’t a set plan or strategy in her career pathway, though “I was always fairly ambitious,” she says. While at the NGV she applied for a course in conservation in London. “But then I had a change of heart and I decided I wouldn’t go. You know how you have those moments in your career?” she asks, looking off into the distance. “I don’t know if you have – where you contemplate a number of things? You finally work out what you want to do.” It was during this period that a curator role came up in Bendigo, and that shaped the next 20 years of her life. In 2000, she took over as director and in her almost two decades at the helm, the gallery’s ambition and reputation grew. They worked with the Victoria and Albert Museum and the National Portrait Gallery in London. “When I was at Bendigo, I loved doing exhibitions that were about people and the stories, and, you know, Grace Kelly and Marilyn Monroe and I had a lot of grand plans. I brought fashion in. You know, you name it we did it,” she reflects. “If you take a few risks and you have the community with you in a small place like Bendigo, that works, and it has worked, and it’s still doing it,” she says. “It’s just got a great reputation now. So it is, yeah, I’m very proud of the work I did up there.” For her current role, she says, “I don’t think I was necessarily concerned about the fact that I was moving from visual arts to performing arts.” But, would she have taken up the Arts Centre post if it weren’t for the collection? She pauses, “I always knew about the collection, and I always knew that it was not getting the attention that it should have. So probably not.”\n\nKylie Minogue’s shoes are one of over 850,000 items that make up the Arts Centre’s performing arts collection. Credit: Justin McManus Only a few snippets of the personal weave their way into the conversation – Quinlan’s laser-sharp focus is on her work and her plans as chief executive, but she does have one long-term side project that she lights up when she speaks about. Research into Australian artist Agnes Goodsir. It’s an interest that has seen her digging through archives for several years. “I like the process, and I love the discovery, and I’m addicted to it.” She doesn’t know what final form this research will take, acknowledging that it is difficult to dedicate time to the project while working a demanding job.\n\nQuinlan is halfway through her five-year contract and has a lot of plans for the next few years. But she also has her eye on the future, both for herself and those following in her footsteps. She’s not someone who never plans to retire. The bill at Saké Credit: “It’s actually good thing to let younger people come in and take on – you can’t hold on to these roles forever. I think with CEOs and director roles, it’s good to see the movement,” she says. “When I think about collecting institutions, curators stay with the collection, and they keep working. They’ve got that lifelong contribution, and they’ve got great knowledge. But I think when you’re a CEO or a director, you can move a bit more, and I think you should.” She pauses. “I’m fairly ambitious for every institution I’ve ever worked for ...I won’t be here forever, but I want to make sure what I do in the time that I am here is really as significant and maintains what this place is.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/busy-this-weekend-the-unexpected-benefits-of-making-plans-20250331-p5lnwv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Busy this weekend? The unexpected benefits of making plans",
        "publish_date": "Tue, 01 Apr 2025 11:48:28 +1100",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "It may sound obvious, but Greenaway says one of the most important things to do if you’re feeling disconnected is to speak up. Yet, many of us feel like we can’t. In a report from not-for-profit Friends for Good, more than half of respondents said they would be embarrassed to tell someone they were feeling lonely, while only 29 per cent said they had opened up to someone about their loneliness. “There’s this tendency to assume that social relationships are an inevitable part of life – they either work or they don’t,” says Greenaway. “But actually confronting that myth and saying, ‘I know this isn’t inevitable ... maybe I need to start verbalising some of these feelings and trying to do something about it.’” And as Greenaway points out, research shows people tend to react more positively than we think when we disclose hidden truths about ourselves and how we feel.\n\nMaking plans is a strategy often used by psychologists during Cognitive Behavioural Therapy. Just as it sounds, it’s about carving out time for things that bring us joy, align with our values or help get us closer to our short or long-term goals. As Greenaway points out, enriching our personal lives isn’t just about having fun but is actually a must for our wellbeing. “Looking after our social health isn’t just a nice bonus. Ultimately, it ends up being a matter of life and death. It sounds quite extreme, but there’s evidence to suggest being more socially connected actually has as strong or an even stronger effect on mortality than things like giving up smoking or drinking less.” Quality over quantity The good news is there’s no prescriptive model for what a healthy personal life should look like.\n\n“What research shows is that quality matters more than quantity,” says Greenaway. Some people may be completely fine with just seeing a few friends once a fortnight, while others will need more. Regardless, having some idea of what a meaningful social life looks like to you and a framework to help foster it is important. ‘The brief chat with the barista is actually a pretty good antidote to isolation.’ Professor Lisa Williams, UNSW “If you have some structure, it can make it easier to unthinkingly connect with others. You can set up your life and environment in a way where you’re getting your social needs met. But if you have to think about going out when you need to, it might already be too late,” she says. This could look like a regular fortnightly call with a friend or joining a local sport club.\n\nProfessor Lisa Williams, a social psychologist at UNSW, suggests a two-pronged approach to nurturing meaningful connections. The first, she says, is about engaging with deep relationships we already have and thinking about what we want from them. “Is it sitting down and having a chat? Is it doing something you enjoy together that’s meaningful to both of you?” The second is about connecting with acquaintances or “leaning into casual social connections”. “The brief chat with the barista is actually a pretty good antidote to isolation,” Williams says.\n\nSticking to a plan Scheduling activities is one thing, but actually following through on them can be tricky, particularly if you are feeling down. Loading But the act of making plans itself can be a powerful motivator. Williams says research on goal-setting shows that “implementation intentions” increase the likelihood of us sticking to a plan.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/i-won-t-make-the-same-mistake-again-banned-ex-demon-wants-shot-at-afl-redemption-20250401-p5lo5c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I won’t make the same mistake again’: Banned ex-Demon wants shot at AFL redemption",
        "publish_date": "Tue, 01 Apr 2025 11:45:40 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Loading\n\n“If I can come and potentially give a team something that are chasing a flag, like that’d be great. Four years, I feel like I’d get a lot out of that. But it’s just about staying healthy and keeping the body ticking over. Because if it does, you never say never, really. Like if it does happen, it’d be great, but there’s always local footy as well,” Smith, now working in construction, said.\n\nSmith, the father of two young children, had played 42 games before his ban. He knew as soon as he was randomly tested that he was in trouble.\n\n“They are random tests. Obviously, when you get the tap on the shoulder … it was a deflating feeling because I am like: ‘Ah f---, I think I am in trouble here’. Then you get the call from the club saying: ‘You need to come in, something has come up’. I went in and they handed me with the game-day testing – it was a shocking feeling,” Smith said.\n\n“Then you get involved with lawyers. You don’t really understand how much lawyers cost until you are dealing with them. The first three months were horrible. I thought I was going to be back playing in three months, which is the thing that sucks. If you don’t do it the day of the game, it is three months. But, for some reason, they thought – I did it close to the game, but definitely didn’t do it the day of the game. That’s the thing that sucks, that they didn’t see through that.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/matildas-star-says-sam-kerr-should-resume-as-captain-upon-return-from-injury-20250401-p5lo3o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Matildas star says Sam Kerr should resume as captain upon return from injury",
        "publish_date": "Tue, 01 Apr 2025 11:45:24 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Matildas vice-captain Emily van Egmond says returning skipper Sam Kerr has the support of the playing group and that she “definitely should not” hand back the armband once she’s ready to play.\n\nKerr is back with the Matildas for the first time in more than a year ahead of Friday night’s friendly against South Korea - but only in a training capacity as she completes her recovery from an ACL injury.\n\nOnce she returns to the pitch, the 31-year-old has been cleared to resume as captain after a decision by Football Australia not to impose any further punishment following her trial for racially aggravated abuse of a London police officer, in which she was found not guilty. Her club, Chelsea, also opted not to sanction her while Kerr’s sponsors have all stood by her throughout the controversy.\n\nVan Egmond said Matildas players were thrilled to have Kerr back, albeit still unavailable to help them in matches.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-1-april-2025/7is08y7yx",
        "title": "Coalition makes housing promises for young people | Midday News Bulletin 1 April 2025",
        "publish_date": "Tue, 1 Apr 2025 01:09:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Coalition is promising to make it easier for young people to break into the property market by requiring the financial regulator to relax rules for approving home loans.\n\n\n\n\n\nOpposition Housing spokesperson Michael Sukkar says this is designed to fix the problem of nearly 40 per cent of first home buyers are not being able to get a loan due to a restrictive requirement for a serviceability buffer.\n\n\n\n\n\nPrime Minister Anthony Albanese has been moved to defend his government's actions on housing affordability, saying the tax cuts announced in the federal budget will help.\n\n\n\n\n\n\"We'll give every young person a tax cut. If you look at the changes our Stage 3 [[tax cuts]] made, 90 per cent of young people were better off because we intervened to change the tax cuts to make sure they got looked after.\"\n\n\n\n\n\n+++\n\n\n\n\n\nAustralia's property market has returned to record highs with a 0.4 per cent increase in home prices nationally in March.\n\n\n\n\n\nThe latest Home Value Index from CoreLogic shows rises in every capital city except Hobart.\n\n\n\n\n\nRegional areas in all states also increased.\n\n\n\n\n\nIt follows a small rise in national house prices in February off the back of a fall in January.\n\n\n\n\n\nThe median home value in Sydney was the highest of all capitals in March, sitting at $1,104,000.\n\n\n\n\n\nThe Reserve Bank is expected to keep interest rates steady when delivers it's March cash rate decision later today.\n\n\n\n\n\n+++\n\n\n\n\n\nThe federal government is intensifying its focus on healthcare in the opening week of the election campaign, with Prime Minster Anthony Albanese announcing a new 150 million dollar commitment for a health care centre at Flinders University in Adelaide.\n\n\n\n\n\nFunding for the new health centre will be matched by the university, to build a clinic capable of seeing 10,000 patients a year, and training 1,300 health professionals.\n\n\n\n\n\nHealth Minister Mark Butler says the clinic is one of several investments by the government in training healthcare professionals.\n\n\n\n\n\n\"Yesterday we announced a new medical school in Queensland to be delivered by QUT. We're delivering first medical school in the Northern Territory at Charles Darwin University, complimenting some terrific work that Flinders University has done for years training medical graduates in the territory. We've allocated funding for 150 additional Commonwealth supported places in medical schools to be rolled out over the next couple of years.\"\n\n\n\n\n\n+++\n\n\n\n\n\nThe Bureau of Meteorology is warning of more heavy rainfall in western Queensland that could exacerbate already-devastating flooding in the region.\n\n\n\n\n\nFloodwaters twice the size of Victoria have inundated the region after record rainfall, forcing many residents, including an entire town, to evacuate.\n\n\n\n\n\nThe flooding is considered the worst in more than 50 years and could last weeks - the Bureau of Meteorology is warning water levels could rise further, sparking fears of mass livestock losses.\n\n\n\n\n\nThe Bureau's senior meteorologist Angus Hines says the flooding could last for weeks and spread over state borders.\n\n\n\n\n\n\"Flooding continues to be extremely significant for central and western Queensland and it will be for days and weeks to come. Major flooding continues to occur along rivers throughout the central west and southwest forecast districts as well as parts of the north west and parts of Maranoa and Warrego in southern Queensland. Some of the flooding is even moving across state borders now into the eastern Northern Territory and northern parts of New South Wales.\"\n\n\n\n\n\n+++\n\n\n\n\n\nFrench far-right leader Marine Le Pen says she will appeal a court decision that found her guilty of embezzling European Union funds, and banned her from running for office for five years.\n\n\n\n\n\nThe court gave Ms Le Pen a four-year prison sentence – including two years as a suspended sentence – and a 100,000 euro fine.\n\n\n\n\n\nThe ruling means the National Front party leader cannot take part in 2027 presidential elections.\n\n\n\n\n\nShe and 24 other officials from her National Rally were found guilty of having used money intended for European Union parliamentary aides to pay staff who worked for the party.\n\n\n\n\n\nMs Le Pen says the court's ruling was a political decision.\n\n\n\n\n\nFrench then English VO: “From the first hours of this trial I understood that we were going to be judged in an extremely biased manner. I did not think that the judges would go so far against our democratic processes and would interfere in this way in the choice of the French people because let’s be clear - I am eliminated, but in reality, it’s millions of French people whose votes have been eliminated this evening.”\n\n\n\n\n\n+++\n\n\n\n\n\nUnited States President Donald Trump says he expects Russian President Vladimir Putin to fulfill his part of a deal to end the war in Ukraine\n\n\n\n\n\nYesterday, Mr Trump threatened to place further sanctions on Russian oil if Mr Putin didn't co-operate.\n\n\n\n\n\nIt comes after Mr Putin rejected a U-S proposal for an unconditional ceasefire that was backed by Ukraine, and intensified rhetoric about installing a new leadership in Ukraine.\n\n\n\n\n\nBut Mr Trump says he is still confident he won't have to follow through with measures against Russian oil sales to punish Mr Putin.\n\n\n\n\n\n\"I think he's going to live up to what he told me, and I think he's going to fulfill his part of the deal. I want to make sure he follows through and I think he will. I don't want to go secondary tariffs on his oil, but it's something I would do if I thought he wasn't doing the job.\"\n\n\n\n\n\n+++\n\n\n\n\n\nChina, Japan, and South Korea have reportedly agreed to jointly respond to U-S President Donald Trump's tariffs.\n\n\n\n\n\nA social media account affiliated with the Chinese state broadcaster, Yuyuan Tantian, has reported the news, in the wake of the three East Asian countries holding their first economic dialogue in five years last weekend.\n\n\n\n\n\nAll export powers and major U-S trading partners, they're seeking to facilitate regional trade as a buffer against Mr Trump's tariffs.\n\n\n\n\n\nYuyuan Tantian is reporting Japan and South Korea are seeking to import semi-conductor raw materials from China, and China is interested in purchasing chip products from Japan and South Korea.\n\n\n\n\n\nIt says all three countries have agreed to strengthen supply chain co-operation, and engage in more dialogue on export controls.\n\n\n\n\n\n+++\n\n\n\n\n\nIn football, Katrina Gorry will miss the Matildas' upcoming matches against South Korea with an injury.\n\n\n\n\n\nHer English club side, West Ham, has withdrawn her.\n\n\n\n\n\nShe's been replaced in the squad by Melbourne City midfielder Leah Davidson, who's played for the Matildas twice, scoring one goal.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/marine-le-pen-banned-from-presidential-run-morning-news-bulletin-1-april-2025/7ijnsxpms",
        "title": "Marine Le Pen banned from presidential run | Morning News Bulletin 1 April 2025",
        "publish_date": "Mon, 31 Mar 2025 19:40:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/step-length-a-devastating-finish-and-springs-in-his-spikes-the-science-behind-gout-gouts-speed/kmnvqhqr5",
        "title": "Step length, a devastating finish and ‘springs in his spikes’: The science behind Gout Gout’s speed",
        "publish_date": "Mon, 31 Mar 2025 18:42:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "Every now and then an athlete comes along who makes people wonder, \"How are they so fast?\"\n\n\n\n\n\nLet me introduce you to Gout Gout.\n\n\n\n\n\nGout is a 17-year-old sprint sensation from Australia, whose blistering 100m and 200m times have drawn comparison to none other than Jamaican sprint legend Usain Bolt.\n\n\n\nWhile he was edged out over 200 metres in Melbourne last weekend by 21-year-old Lachlan Kennedy — recent 60-metre world indoor silver medallist who is a rising sprinter poised to break the ten-second barrier for 100 metres — Gout’s performances continue to signal a bright future on the track.\n\n\n\n\n\nIn a seven-month period since last August, Gout has:\n\n\n\nWon silver in the 200m at the World Junior Championships (20.60 seconds, -0.7 metres/second wind)\n\nBroken Peter Norman’s long-standing Australian 200m record (20.04 seconds, +1.5m/s)\n\nTwo weeks ago in Brisbane, smashed through the magical 20-second barrier for the 200m, recording a world-leading 19.98 seconds (+3.6m/s), albeit wind-aided (anything greater than 2.0 metres/second is considered wind-aided).\n\nBut what makes Gout so fast?\n\n\n\n\n\nIs it his explosive start, long stride, top speed or smooth technique?\n\n\n\n\n\nThe answer, as with all athletic outliers, is likely a combination of several unique attributes.\n\n\n\n\n\nLet’s dive into the science.\n\n\n\nThe science of sprinting\n\nSprinting is an ongoing battle of force and mass.\n\n\n\n\n\nGravity is pulling the athlete’s body mass down. Meanwhile, the athlete must apply muscular force into the track to keep the body upright.\n\n\n\n\n\nResearch suggests the world's fastest sprinters generate the highest ground reaction force relative to their body mass and apply it in the shortest period, in the right direction (more horizontally in acceleration and more vertically at top speed).\n\n\n\n\n\nAt 5'11\" (180cm) and 66kg, Gout does not display the muscular physiques of past champion sprinters including Asafa Powell (Jamaica), Justin Gatlin (the USA), or Australia’s own Matt Shirvington.\n\n\n\n\n\nYet, his performances suggest he is redefining the archetype of elite sprinting.\n\n\n\nGout Gout of Australia celebrates winning the U18s, 100m final during the Australian All Schools Athletics Championships at Queensland Sport and Athletics Centre in Brisbane, 6 December, 2024. Source: AAP / Jono Searle For anyone who has run at school, you know the difficulty of holding your top speed for the duration of a 200-metre race.\n\n\n\n\n\nBut Gout defies logic. His speed endurance (maintaining speed) sets him apart from nearly all athletes.\n\n\n\n\n\nAnd not just compared to his age group, although he currently sits second on the all-time under-18 200-metre list behind US runner Erriyon Knighton.\n\n\n\n\n\nGout’s speed endurance is up there with the best in 200-metre history: Bolt, Michael Johnson or Noah Lyles. Each of them has won multiple Olympic medals.\n\n\n\n\n\nThe fastest official 100-200 metre segment (the final 100 metres of the race) ever run in a 200-metre event is 9.16 seconds by American Lyles, on his way to winning the 2022 world athletics championships in Oregon (19.31 seconds overall).\n\n\n\n\n\nIn Gout’s recent performance in Brisbane, he completed this segment of the race in 9.31 seconds. Bolt and Johnson’s best 100-200 metre segment is 9.27 and 9.20 seconds, respectively.\n\n\n\n\n\nThis statistic puts Gout in elite company.\n\n\n\nThe magic of Gout\n\nCloser analysis of Gout’s performance highlights some sprinting anomalies.\n\n\n\n\n\nHe covers the first 100m of the race in 10.67 seconds, which is quite slow relative to his finishing time of 19.98.\n\n\n\n\n\nFor comparison, when Bolt broke the 200-metre world record in 2009 (19.19 seconds), he ran 9.92 seconds on the curve (and 9.27 seconds on the straight).\n\n\n\n\n\nBut once Gout enters the straight, his magic is on full display.\n\n\n\n\n\nGout has an average step length of 2.60 metres. Bolt’s average step length in his 100-metre world record performance was 2.45m, with Lyles displaying a similar result, 2.35m, in his 100-metre win in Paris.\n\n\n\n\n\nThis allows Gout to take between 3.75-4 steps for each ten-metre segment, which he covers at an average speed of 10.8m/s (or 38.8km/h). Like Bolt, his step length is a huge advantage over his competitors.\n\n\n\n\n\nHowever, there is a trade-off with step length and step frequency.\n\n\n\nGout’s longer-than-average step length reduces his average step frequency to 4.15Hz (steps per second), much lower than Bolt who averaged 4.47Hz when at his best.\n\n\n\n\n\nHowever, research highlights elite sprinters are reliant on either step length or frequency, and athletes should train to their strengths, rather than fixing their weaknesses.\n\n\n\n\n\nSo this may not be an area of concern for the teenager.\n\n\n\n\n\nGout also displays a unique coordination pattern in how he interacts with the ground: the way he strikes the track with his feet almost makes it look like he has springs in his spikes.\n\n\n\n\n\nWell, we all do in a sense.\n\n\n\n\n\nElastic energy is stored and released in our Achilles tendon which acts as a muscle power amplifier during running.\n\n\n\n\n\nLonger Achilles tendon length and stiffness play a huge role in sprint efficiency. This allows athletes to move at faster speeds for longer periods at a reduced energy cost, and may be another one’s of Gout advantages over his contemporaries.\n\n\n\nA bright future\n\nAt 17, Gout’s performances are out of this world.\n\n\n\n\n\nThe way he generates and maintains speed challenges some conventional paradigms in sprinting — namely that raw power and muscle mass are the primary determinants of speed.\n\n\n\n\n\nWith most elite sprinters peaking in their mid-20s, Gout’s performances at this stage of his career are even more noteworthy.\n\n\n\n\n\nHis success likely highlights the role of his unique coordination patterns, biomechanics, technical efficiency, hard work and great coaching all bundled together.\n\n\n\n\n\nGout has already rewritten Australian sprinting history. Next up, he's taking on the world.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/who-will-drive-down-your-power-bills/ikzfak8j7",
        "title": "Who will drive down power bills? What Labor, the Coalition and Greens are promising this election",
        "publish_date": "Mon, 31 Mar 2025 18:38:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "Power bill relief is topping the election agenda, with both major parties claiming they will lower prices as they sell their vision for Australia's energy transition to voters.\n\n\n\n\n\nHowever, neither leader appears willing to put a figure on how much power bills will drop — nor how long it will take for their policies to achieve this effect.\n\n\n\n\n\nThe Coalition has repeatedly labelled Labor's 2022 commitment to bring down power bills by $275 as a broken promise, given the rise in prices across the country.\n\n\n\n\n\nFinance Minister Katy Gallagher defended Labor's performance on Monday, telling ABC's RN Breakfast that the policy announcement came before Russia's full-scale invasion of Ukraine , which \"has impacted energy prices right around the world\".\n\n\n\nHover over the image to see what various politicians have said about Australia’s energy transition. Source: SBS News This election, Labor is offering to continue rebates aimed at lowering power bills, while the Coalition claims nuclear and more gas is the pathway forward.\n\n\n\nWhat is the Coalition promising on power bills?\n\nOpposition leader Peter Dutton has promised to introduce an east coast domestic gas reserve, which would force exporters to set gas aside for use in Australia.\n\n\n\n\n\nHe said the plan would \"drive down\" wholesale domestic gas prices by decoupling them from the higher international prices that exported gas attracts.\n\n\n\n\n\nThe Coalition's plan also includes fast-tracking new gas projects and halving approval times, including a pledge to approve the North West Shelf gas expansion in Western Australia within 30 days of being elected.\n\n\n\nSource: SBS News \"There's no disputing the fact that if you put more supply into the market, that prices will come down,\" Dutton told reporters on Sunday.\n\n\n\n\n\nHowever, the Coalition has declined to provide an estimate for how much these policies would lower people's power bills.\n\n\n\n\n\nThe Coalition has also pledged to build nuclear power plants at an estimated cost of $331 billion — converting seven end-of-life coal-fired power plants into nuclear reactors .\n\n\n\n\n\nIt says the first reactor would be ready by 2035, five years sooner than the Commonwealth's science agency, CSIRO, says a plant could be built.\n\n\n\nLike Labor, the Coalition has pledged to achieve net-zero by 2050 but is yet to provide interim targets.\n\n\n\nWhat is Labor pledging on energy bills?\n\nCore to Labor's strategy is an 82 per cent renewable electricity target by 2030, achieving net zero by 2050.\n\n\n\n\n\nThe government has committed to building more than 4,000km of high-voltage transmission lines to carry renewable energy and connect the country's grid.\n\n\n\n\n\n\"We have a 2030 target, we're confident we'll meet it, and our policy is very clear ... our policy is for renewables, backed with firming capacity of gas, batteries and hydro,\" Albanese said on Monday.\n\n\n\n\n\nThe prime minister is also expected to announce subsidies for buying home batteries in the coming days, as reported by Nine newspapers.\n\n\n\n\n\nThe policy will help households store surplus solar power generated during the day and combat the cost of peak-hour energy costs in the evening.\n\n\n\nThe grant amount remains unclear but home batteries are expected to save households roughly $1,000 on their annual power bill.\n\n\n\n\n\nIn the short term, Labor has pledged that all Australian households and businesses will receive an extra $150 in energy bill relief if the government is re-elected.\n\n\n\n\n\nThe plan will see the rebates, paid in two $75 instalments over six months, extended until the end of 2025. It follows last year's $3.5 billion power bill sweetener, which offered $300 per household.\n\n\n\nWhat are the Greens proposing to combat energy prices?\n\nThe Greens oppose the expansion of gas projects and a nuclear industry in Australia.\n\n\n\n\n\nThe minor party supports the electrification of households and businesses, arguing it's the best way to reduce emissions and power bills.\n\n\n\nIn March, they proposed grants of up to $10,000 and low-interest loans of up to $20,000 to install technologies such as induction cooktops.\n\n\n\n\n\nThe pitch included similar grants for installing solar batteries in households, which cost between $7,000 to $18,000, according to comparison site Solar Market.\n\n\n\n\n\n\"Getting homes off gas reduces pollution and helps bring down energy bills. It's good for your health and it's good for the environment,\" Greens leader Adam Bandt said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/asic-denounces-super-funds-poor-handling-of-death-benefit-claims/06b8d8r2n",
        "title": "ASIC denounces super funds' poor handling of death benefit claims",
        "publish_date": "Mon, 31 Mar 2025 10:09:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "ASIC denounces super funds' poor handling of death benefit claims\n\nPublished 31 March 2025, 9:10 am\n\nA scathing review into the handling of death benefit claims by super funds has exposed a litany of failures. The Australian Securities and Investments Commission has put Australia's $4.1 trillion superannuation sector on notice, handing down 34 recommendations to improve death claims processing. The investigation also revealed the disproportionate impact on First nations families, prompting calls for mandatory, legislated customer service standards.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/new-mosque-for-young-cherry-capital-of-australia/a4bjs3t4h",
        "title": "New mosque for Young, cherry capital of Australia",
        "publish_date": "Mon, 31 Mar 2025 10:01:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "New mosque for Young, cherry capital of Australia\n\nPublished 31 March 2025, 9:09 am\n\nAs millions of Muslims around the world mark the end of the holy month of Ramadan with festive Eid celebrations, one rural Australian town has welcomed a thriving Muslim community dating back four decades. Young, in outback NSW, known as the Cherry Capital of Australia, is opening its doors to even more people with a major mosque to be built there, the biggest to exist outside any Australian capital.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/mixed-emotions-as-muslims-around-the-world-celebrate-eid-al-fitr/3co38cz24",
        "title": "Mixed emotions as Muslims around the world celebrate Eid al-Fitr",
        "publish_date": "Mon, 31 Mar 2025 09:18:13 +0000",
        "category": "sports",
        "authors": [],
        "text": "Eid al-Fitr celebrations are beginning around the world, but the holiday brings mixed feelings for some Muslims.\n\n\n\n\n\nEid-al-Fitr, or Eid , is one of the most significant celebrations on the Islamic calendar, marking the end of the month-long, dawn-to-dusk fasting month of Ramadan.\n\n\n\n\n\nFestivities involve prayer, charity, feasting and spending time with family, friends and the wider community.\n\n\n\n\n\nBut for many, Eid is also a sombre reminder of suffering in other parts of the world.\n\n\n\n'May God have mercy on their situation'\n\nIn Afghanistan's capital Kabul, Muhammad Samer said he is praying for an end to the suffering of the Palestinians.\n\n\n\n\n\n\"My best wishes for the people of Palestine. I pray that this Eid brings them good fortune and happiness. Muslims in Gaza are facing a lot of injustice. May God have mercy on their situation,\" he said.\n\n\n\nIn Qatar, thousands of worshippers gathered at a football stadium to attend Eid al-Fitr prayers.\n\n\n\n\n\nQatari resident Ibrahim Khalil Khan said he hopes Muslims around the world are blessed with peace.\n\n\n\n\n\n\"The festival of Eid is very beautiful. We always pray that such a beautiful experience and such a livelihood and brotherhood should prevail all across the world,\" he said.\n\n\n\n\n\n\"Especially for the brothers and sisters of Palestine, Syria, Sudan, India and wherever people are in trouble. We all pray to God that they all be blessed with faith, peace and blessing all across the world.\"\n\n\n\nThis Eid and Ramadan have brough both joy and sadness for many Muslims. Source: AAP / Yousef Masoud / SOPA Images / Sipa USA\n\n'Whatever hurts them, hurts us too'\n\nAt Jerusalem's Al-Aqsa mosque compound, nearly 120,000 worshipers attended prayers on Sunday, according to site officials.\n\n\n\n\n\nIn Gaza, Israel's continuing bombardment and blockade of humanitarian supplies mean many have little to celebrate.\n\n\n\nOver 100,000 Muslims attended prayers at Al-Aqsa Mosque for Eid al-Fitr. Source: AAP / Mahmoud Illean/AP In Jabalia, Inshirah Hanouneh is spending the first day of Eid al-Fitr visiting her brother's grave.\n\n\n\n\n\n\"I came to visit my brother on the first day of the happy Eid al-Fitr. It is happy for people, but not for me. It is not happy, it is not Eid,\" she said.\n\n\n\n\n\n\"God imposed it on us, what can we do? The memory of my brother is in my heart every day, he did not leave my memory for a second since 17 December.\"\n\n\n\nMany Palestinians in Gaza visited the graves of their relatives on the first day of Eid al-Fitr. Source: AAP / Haitham Imad / EPA Back in Australia, the Muslim community in Sydney also gathered for prayers and celebrations at the Omar Mosque in Auburn.\n\n\n\n\n\nSheikh Ahmed Kasem, Imam of Omar Mosque in Western Sydney, said Eid al-Fitr is about the community coming together.\n\n\n\n\n\n\"So where Muslim community, members of the Muslim community come together to share meals, exchange gifts, strengthen bonds with the loved ones. Today is a spiritual renewal and community unity.\"\n\n\n\n\n\nWhile there is a lot of joy in the community, it is impossible not to feel the suffering of those in Gaza, he said.\n\n\n\n\n\n\"The current situation in Gaza is still going on, and the children of Gaza are still suffering and will feel for them. Whatever hurts them, hurts us too,\" he said.\n\n\n\nEid in Africa\n\nIn Nigeria, 19-year-old Aisha Sanni said she has mixed feelings following the end of the holy month of Ramadan.\n\n\n\n\n\n\"I feel so much happy, but at the same time, I feel so much sad because there are so many goodness in Ramadan, so many blessings,\" she said.\n\n\n\n\n\n\"You can't even count the blessings Allah has sent in this holy month of Ramadan, I feel so sad this is going because no matter what you beg for in this holy month of Ramadan, Allah is always there to answer your prayers for you.\"\n\n\n\n\n\nBecause of intensifying violence in parts of the Democratic Republic of Congo, many Muslims have modified their religious customs — such as shifting to earlier prayer times.\n\n\n\nEid al-Fitr is the first of two Eid celebrations each year. Source: AP / Sunday Alamba/AP Meanwhile, in Sudan, worshipers rejoiced, celebrating the festival just days after the army started to regain control of the capital Khartoum from the rival Rapid Support Forces paramilitary group.\n\n\n\n\n\nThe war in Sudan has killed at least 28,000 people, displaced millions and destroyed cities throughout the country.\n\n\n\n\n\n— Additional reporting by the Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/damning-report-into-death-claims-in-the-superannuation-sector/ectx9np8c",
        "title": "Damning report into death claims in the superannuation sector",
        "publish_date": "Mon, 31 Mar 2025 07:44:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralia's financial regulator has taken aim at a 4.1 trillion dollar superannuation industry.\n\n\n\n\n\nThe chair of ASIC, Joe Longo, accusing providers of what he called widespread neglect of their customers.\n\n\n\n\n\n\"This is one of the most significant reports we have produced in my time at ASIC and it identifies a range of failings, including excessive delays and poor service when dealing with claims. Now, consider for a moment what this may mean for a person making a claim. When a beneficiary suffers delays in the processing of a death benefit, not only do they suffer the stress of having to engage with a complicated process while grieving, but they may be denied access to money they are entitled to, and which they may need to pay bills, ongoing living expenses, or even funeral costs.\"\n\n\n\n\n\nNew findings by ASIC show an overwhelming number of complaints by grieving Australians, related to poor customer service and excessive delays to death benefits.\n\n\n\n\n\nASIC Commissioner Simone Constant says super funds have failed to match the needs of their customers.\n\n\n\n\n\n\"Our review identified a range of problems including gaps in trustee data, reporting and metrics; none of the reviewed trustees monitored or reported on their end-to-end claims handling processes or performance; unclear and inconsistent processes and procedures; we found 78% of the claim files that we reviewed were delayed by processing issues within the trustees' control.\"\n\n\n\n\n\nThe ten superannuation funds under review represent 38 percent of all member benefits in Australia... excluding two industry giants already facing legal proceedings over their handling of death and disability claims.\n\n\n\n\n\nASIC also found First Nations communities waited significantly longer for claims to be closed.. and that communication was often not culturally sensitive.\n\n\n\n\n\nIts report highlighted one case where a trustee took more than 500 days to pay a death benefit of around $100,000 to a First Nations woman grieving the loss of her husband.\n\n\n\n\n\nBettina Cooper is a senior financial counsellor with Mob Strong Debt Help.\n\n\n\n\n\n\"I can think of examples where people just give up. You can only try so hard to access something that is yours and you hit so many barriers before you stop trying. We know when we go out in community we actually have lines of people wanting to talk to us to help them access their money through super. For some First Nations people it is the only intergenerational wealth they'll ever have. First Nations people still have a gap, and that gap is about building generational wealth. Superannuation should be filling that gap.\"\n\n\n\n\n\nRemoving barriers for First Nations claimants was among ASIC's 34 recommendations in its report.\n\n\n\n\n\nAdvocates like Bettina Cooper say it's past time for change.\n\n\n\n\n\n\"We've been working with banks for years on making money accessible for First Nations people and making the process accessible. Superannuation funds are still back at the starting line. It is time for us to have mandatory legislated minimum standards of service, and those services need to include First Nations people and need to include fair and reasonable access, timely claims, and the ability for people to be able to do this with dignity and respect.\"\n\n\n\n\n\nMary Delahunty is the Chief Executive of the peak industry body, the Association of Superannuation Funds of Australia.\n\n\n\n\n\nShe says the report is sobering reading.\n\n\n\n\n\n\"We note the really deep and good work the regulator has done to help us improve, really over the last year, the service standards, particularly in death benefits claims' handling time, but it's not an easy read and we are really sorry for all the stress that has been caused.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/meet-the-thriving-rural-muslim-community-of-young/z8902op3h",
        "title": "Meet the thriving rural Muslim community of Young",
        "publish_date": "Mon, 31 Mar 2025 07:37:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIt's a packed house in this quaint mosque.\n\n\n\n\n\nHundreds of Muslims squeeze in for a spot to pray celebrating Eid al-Fitr.\n\n\n\n\n\nHere, on the south-western slopes of New South Wales, a thriving Muslim community has found comfort in calling the town of Young home.\n\n\n\n\n\nSporting a population of around 10,000, Young is 372 kilometres west-south-west of Sydney, and known for its rich cherry-growing heritage.\n\n\n\n\n\nLeading the prayers at the mosque is Imam Emad Hamdy.\n\n\n\n\n\n\"The beauty of Eid is you are seeing a big number of people who are coming from different backgrounds and they are all Muslims.\"\n\n\n\n\n\nFor Omar Kowaider and Joanna Bryla, Eid is still rooted in special traditions, as they hand gifts to their two young children.\n\n\n\n\n\nBut Ms Bryla says it's a little slower paced since they moved here from Sydney three years ago.\n\n\n\n\n\n\"There was no sense of camaraderie or community. There was no warmth anymore. Young was a way to escape that, to feel a bit of freedom.\"\n\n\n\n\n\nMr Kowaider says, together, they found peace in open space and a stronger connection to faith.\n\n\n\n\n\n\"I believe Young, not just Young, but I guess any kind of rural community brings out the best in you. And I think it definitely lets the soul search and gives it that yearning of coming back to where we belong and being closer to God.\"\n\n\n\n\n\nThey’re one of hundreds, mainly hailing from Lebanon, who've ditched the major capitals for this rural life, mostly in the last five years.\n\n\n\n\n\nBut the first Muslim families who arrived here date back to the late 1980s.\n\n\n\n\n\nBassem Ali's parents and uncle are described as the so-called Muslim forefathers of this town.\n\n\n\n\n\nInstead of settling in Sydney, Mr Ali says they opted for a lifestyle that resembled their roots in the villages of northern Lebanon.\n\n\n\n\n\n\"My parents came from a farming family anyway, and my uncle, they had orange orchards in Lebanon and they were vegetable growers in Lebanon.\"\n\n\n\n\n\nNow, their descendants roam their acreage.\n\n\n\n\n\nFour decades later, Arabic has become the second most spoken language here after English, and it's thought one in every ten people are Muslim.\n\n\n\n\n\nThe mayor of Young is Brian Ingram.\n\n\n\n\n\nHe says the contributions of these people to the town have been invaluable.\n\n\n\n\n\n\"They just jump in every time with donations and time and thousands and thousands worth dollars worth of contribution. They don't put it out there to highlight it. They don't do it for that. They do it because they care. And that's part of becoming a big part of our community.\"\n\n\n\n\n\nRight across the Ali family farm, is believed to be just one of the drawcards for moving here- the small, local mosque.\n\n\n\n\n\nIt opened in 1994.\n\n\n\n\n\nAbdullah Sultan is the head of committee at Young Mosque, which is managed by the Lebanese Muslim Association.\n\n\n\n\n\n\"It's far away. It's away from the public, it's away from the city is there's a mosque, there's a small community there. Just by me saying that to you, you want to move here, you know what I mean?\"\n\n\n\n\n\nBut as the community got bigger, a desire arose to build a new space with enough room for everyone to pray in.\n\n\n\n\n\nSo, last year, construction began for a new mosque that’s nearly five times bigger than where they currently pray, and can fit more than 1,000 people.\n\n\n\n\n\nMr Sultan says it is a symbol of the community’s growth for generations to come.\n\n\n\n\n\n\"A magnificent place of worship like this is going to attract more people to our town, increase that pool of potential and create opportunity for our children.\"\n\n\n\n\n\nAnd, nearly forty years after his relatives moved here, Mr Ali heartily agrees.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/on-the-money-operational-risks-at-the-asx-and-growing-global-trade-tension/glb3jgk72",
        "title": "On The Money: Operational risks at the ASX, and growing global trade tension",
        "publish_date": "Mon, 31 Mar 2025 06:26:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/are-supermarkets-being-unfairly-targeted-for-price-gouging/7ovnlnxnl",
        "title": "Are supermarkets being unfairly targeted for price gouging?",
        "publish_date": "Mon, 31 Mar 2025 05:25:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "As Prime Minister Anthony Albanese and Opposition leader Peter Dutton ramp up their election campaigns, the cost of living has emerged as a key election issue.\n\n\n\n\n\nThe cost of groceries has been a particular focus of attention and was the subject of a year-long inquiry carried out by the Australian Competition and Consumer Commission (ACCC).\n\n\n\n\n\nThe inquiry examined pricing practices, profit margins, and Coles' and Woolworths' power in the industry.\n\n\n\n\n\nIn its report, the ACCC did not find any evidence of price gouging.\n\n\n\nREAD MORE What Labor's proposed price gouging ban could mean for your grocery bill\n\nDespite this, Albanese announced on Sunday that if re-elected, Labor will introduce legislation to make price gouging illegal.\n\n\n\n\n\nIn contrast, Dutton has suggested the Coalition would enforce supermarket divestiture powers to address anti-competitive behaviour.\n\n\n\nSupermarkets respond to price gouging accusations\n\nColes and Woolworths have repeatedly rejected claims of price gouging, despite prices rising 24 per cent in the last five years.\n\n\n\n\n\nIn a statement released on Sunday, a Coles spokesperson said these prices largely reflected the increased cost of doing business.\n\n\n\n\n\n\"What's needed are measures that tackle the real factors driving higher grocery prices, which are rising costs such as energy, fuel, labour, insurance, production, freight and distribution,\" they said.\n\n\n\nWoolworths has rejected claims of price gouging. Source: AAP / Darren England A Woolworths Group spokesperson said the organisation had provided thousands of documents and millions of data points to the supermarket inquiry to explain how economy-wide inflation is impacting suppliers.\n\n\n\n\n\n\"We recognise our customers have experienced several years of significant inflation, with an escalation in the cost of mortgages, rent, transport, insurance, energy, food and many other household essentials.\"\n\n\n\n\n\nAccording to the spokesperson, Woolworths Group has already taken action on many of the ACCC report’s recommendations to improve the experience and transparency for customers and suppliers.\n\n\n\nLabor's plan to ban price gouging\n\nWhile the ACCC found Australian supermarkets are among the most profitable globally, the supermarket giants have argued their profit margins are comparable to their peers in countries including Canada, the UK and the US.\n\n\n\n\n\nLaws to protect customers from companies engaging in price gouging already exist in the UK, European Union and dozens of states in the US.\n\n\n\nAlbanese said that if Labor wins the 3 May federal election, Labor would introduce similar laws in Australia.\n\n\n\n\n\n\"We will introduce legislation making price gouging illegal by the end of this year,\" he said on ABC's Insiders program.\n\n\n\n\n\n\"What we want to make sure is that they (supermarkets) know that they're being watched. They know that the government is prepared to take strong action and crack down.\"\n\n\n\n\n\nFinance Minister Katy Gallagher said price gouging laws are a \"missing part\" of Australia's competition laws.\n\n\n\n\n\n\"We think that this is something that’s worked overseas, it’s in place overseas, and this is another tool in the toolkit for the ACCC to cover off concerns around excessive prices in supermarkets,\" she told ABC Radio National Breakfast on Monday.\n\n\n\nWhile Gallagher acknowledged the supermarket inquiry did not find any evidence of price gouging, she said it had found examples of prices increasing considerably, and it also highlighted the increasing market share of major supermarkets.\n\n\n\n\n\n\"I wouldn’t say that the ACCC report gave the supermarkets a clean bill of health, I don’t think it did that at all,\" she said.\n\n\n\n\n\nSpecific details of the government policy — including how it would determine price gouging — have not yet been released.\n\n\n\nREAD MORE Coles and Woolworths sued by ACCC over allegedly misleading discount claims\n\nA task force would be set up to advise on introducing an excessive-pricing regime for supermarkets to be policed by the consumer watchdog.\n\n\n\n\n\nThe group would include Treasury, the consumer watchdog and other experts who would consult and report to the federal government within six months.\n\n\n\nAre supermarkets being unfairly targeted?\n\nThe ACCC report is not the only investigation into supermarket price gouging.\n\n\n\n\n\nThe Australian Council of Trade Unions, a Senate select committee, an independent review for Treasury and state parliamentary inquiries in Queensland and South Australia have all examined the practice of price gouging.\n\n\n\n\n\nWhile some claim it does exist in the supermarket sector, others have found no evidence.\n\n\n\nProfessor Gary Mortimer, professor of marketing and consumer behaviour at the Queensland University of Technology Business School, said he believes supermarkets are being unfairly targeted.\n\n\n\n\n\n\"It's disappointing that both political parties — and I would include the Greens here — have decided to focus on supermarkets rather than the more significant and complex social and economic issues facing the Australian public,\" he said.\n\n\n\n\n\n\"When you're a minister and you are facing issues such as youth crime, housing crisis, rental crisis, hospital ramping, a teacher shortage — those issues are significantly [more] challenging to fix — so it's easier to apply [a] distraction strategy and focus on the price of a chocolate bar. It gets better cut through.\"\n\n\n\nMortimer said he believes rising costs of supermarket goods are largely due to the supermarkets' 'input costs' (costs incurred to make a product) and paying more for fuel and freight, wholesale goods, wages, and licences.\n\n\n\n\n\nLaws against price gouging would be unlikely to impact grocery prices or help shoppers unless these costs are addressed, he said.\n\n\n\n\n\n\"They can certainly put legislation in place to outlaw price gouging, but if price gouging is not happening, no penalties will be awarded and it won't actually bring prices down,\" he said.\n\n\n\n\n\n\"What will bring prices down is a lower corporate tax rate, field subsidies, less red tape, less bureaucracy, less input costs.\"\n\n\n\n\n\n— with additional reporting from the Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/albanese-heads-to-western-australia-as-the-first-full-week-of-the-election-campaign-begins/zoc14kdvg",
        "title": "Albanese heads to Western Australia, as the first full week of the election campaign begins",
        "publish_date": "Mon, 31 Mar 2025 05:23:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Prime Minister hitting a milestone in the West.\n\n\n\n\n\n\"It's fantastic to be back in Western Australia for my 30th visit as Prime Minister. I committed in 2022 to come here 10 times a year. I've met that KPI.\"\n\n\n\n\n\nAs the first full week of campaigning begins.\n\n\n\n\n\nPM: \"And who's this?\"\n\n\n\n\n\nMum: \"It's Amber.\"\n\n\n\n\n\nPM: \"Amber. How old's Amber?\"\n\n\n\n\n\nMum: \"27 hours.\"\n\n\n\n\n\nPM: \"27 hours! Congratulations.\"\n\n\n\n\n\nMum: \"Thank you so much.\"\n\n\n\n\n\nTrying his hand at swaddling a baby girl.\n\n\n\n\n\nPledging a 250 million dollars to upgrade the intensive care unit and neonatal ward in one of Perth's busiest public hospitals, Midland Hospital.\n\n\n\n\n\nIt's a sign of how important Western Australia is to the Labor Party's election campaign - hoping to retain the four seats it won from the Coalition in 2022, and gain the new seat of Bullwinkel.\n\n\n\n\n\nBack on the east coast, Opposition Leader Peter Dutton visited flood-affected communities in outback Queensland, after dropping by a mining equipment manufacturer in the Hunter Valley.\n\n\n\n\n\n\"Lets uhh, wipe the sweat. And then we go to the next one? I feel I'm on a roll now.\"\n\n\n\n\n\nHe’s targeting the Labor-held seat of Paterson, with hopes of also turning the neighbouring Labor-held seat of Hunter, both based in the mining heartland of New South Wales.\n\n\n\n\n\nHe's focusing on power prices to try and do it.\n\n\n\n\n\n\"It's about who can better manage the economy, who can better manage the energy system.\"\n\n\n\n\n\nHe's selling his plan to establish an East Coast gas reserve to ensure a certain amount of gas produced in Australia is set aside for the domestic market, and his longer term vision of building the country's first nuclear reactors.\n\n\n\n\n\nAlthough he couldn't confirm how much prices would drop by.\n\n\n\n\n\n\"We will, we will have, in terms of our offering at the next election, to the Australian people, a definite plan about how we can reduce prices, not just to keep downward pressure, but I want to reduce power prices.\"\n\n\n\n\n\nLabor doubling down on renewables - but also with no promises on prices.\n\n\n\n\n\n\"Our policy is for renewables, backed with firming capacity of gas, batteries, and hydro.\"\n\n\n\n\n\nAs the holy month of Ramadan comes to an end, around 800,000 Muslims across Australia are celebrating Ramadan Eid al-Fitr.\n\n\n\n\n\nPeter Dutton welcomed into a Al-Madinah Mosque, which attracts a largely Pakistani and Indian community, in the south-western Sydney suburb of Liverpool yesterday, promising $25,000 in funding for extra security.\n\n\n\n\n\nThe mosque's Imam says he welcomed the Opposition leader to visit his prayer room, even though many in the Australian Muslim community disagree with his ideas.\n\n\n\n\n\nSeveral Muslim community leaders in Sydney have told SBS News the Opposition leader would have had a more hostile reception if he had tried to attend a mosque that had closer links to the Middle East.\n\n\n\n\n\nThe Lebanese Muslim Association says no Australian politicians were invited to Eid celebrations at Lakemba Mosque in protest of the major parties' actions and comments regarding the war in Gaza.\n\n\n\n\n\nIt is the second year in a row that politicians have not been invited to participate by the Lebanese Muslim Association.\n\n\n\n\n\nMr Dutton today confirming he would reconsider the need for an Islamophobia envoy if the Coalition wins the election.\n\n\n\n\n\n\"In terms of the envoy, if it is making a difference, if it is helping, then happy to continue it. But I think there is a lot of frustration at the moment about what is being listened to from, what is being advised, by the envoy, so I would have to take advice.\"\n\n\n\n\n\nLabor created antisemitism and Islamophobia envoy roles to improve social cohesion in the wake of the October 7 attack on Israel and Israel's subsequent assault on Gaza.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/super-funds-death-benefit-delays-cause-genuine-suffering-asic/tvqs00ygi",
        "title": "Super funds contributing to 'genuine suffering' by delaying death benefits, ASIC finds",
        "publish_date": "Mon, 31 Mar 2025 04:58:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "The financial watchdog says the superannuation industry needs to do better after a review they undertook found that, in more than three-quarters of death benefit claims, super funds were responsible for delays caused by processing issues within their control.\n\n\n\n\n\nDeath benefits refer to the remaining superannuation balance in a member's account after they pass away, which a beneficiary — usually a family member — is entitled to be paid as soon as practicable.\n\n\n\nWhat did ASIC's report find?\n\nThe Australian Securities and Investments Commission (ASIC) said poor customer service was rife among the 10 trustees they reviewed, which cover about 38 per cent of benefits held by funds regulated by the Australian Prudential Regulation Authority.\n\n\n\n\n\nThe trustees included a mix of retail, public sector and industry super funds, including Australian Retirement Trust and UniSuper. It did not include Cbus or AustralianSuper in its review because it has already initiated legal proceedings against them.\n\n\n\nExcessive delays and poor service\n\nASIC found many examples of excessive delays and poor service. While timelines to respond to claims varied greatly between funds, none of them closed more than half of the claims within 90 days.\n\n\n\n\n\n— Of the claim files ASIC reviewed, 78 per cent involved delays caused by processing issues within the trustee's control.\n\n\n\n\n\n— Timeliness varied from Colonial First State trustee Avanteos, which closed approximately 48 per cent of death benefit claims in 90 days, to the slowest trustee, Rest, which closed only 8 per cent of claims in the same period of time.\n\n\n\n\n\n— Instances of poor customer service were present in 27 per cent of claim files, including not returning claimants' phone calls, dismissing their queries and asking for unreasonable information.\n\n\n\n\n\n— In one case, a trustee took over 500 days to pay a death benefit of around $100,000 to a First Nations woman grieving the loss of her husband.\n\n\n\nWhat has ASIC said about the findings?\n\n\"Many of the complaints we read were distressing. We saw deep grief, vulnerability, frustration and genuine suffering.\" — Simone Constant, ASIC commissioner.\n\n\n\n\n\n\"The money from a death benefit can make a huge difference and each day a trustee delays that payment causes real harm to families.\"\n\n\n\nWhat did ASIC recommend?\n\nThe report made 34 recommendations for funds to adopt. They focused on improving customer service and speeding up response times, better monitoring and reporting, streamlined claims processes, better staff training and removing barriers for First Nations claimants.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-wall-street-slides-lower-20250401-p5lo2d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX jumps after Wall Street rises in wild session; RBA set to stay on hold",
        "publish_date": "Tue, 01 Apr 2025 13:01:05 +1100",
        "category": "finance",
        "authors": [],
        "text": "Such neck-twisting turns have become routine for the US stock market recently because of uncertainty about what Trump will do with tariffs — and by how much they will worsen inflation and grind down growth for economies. Wall Street’s swings followed a sell-off that spanned the world earlier on Monday as worries built about the effects of the tariffs that Trump says will bring manufacturing jobs back to the United States. “The best way to summarize this trading environment is frustration and fatigue,” said Joe Gilbert, a portfolio manager at Integrity Asset Management. “We don’t really have a clear playbook on how to proceed.” In Japan, the Nikkei 225 index dropped 4 per cent. South Korea’s Kospi sank 3 per cent, and France’s CAC 40 fell 1.6 per cent. Instead of stocks, prices strengthened for things considered safer bets when the economy is looking shaky. Gold rose again to briefly crest $3160 per ounce. Prices for US Treasury bonds also climbed, which in turn sent their yields down. The yield on the 10-year Treasury fell to 4.21 per cent from 4.27 per cent late Friday and from roughly 4.80 per cent in January.\n\nOn Wednesday, the United States is set to begin what Trump calls “reciprocal” tariffs, which will be tailored to match what he sees is the burden each country places on his, including things like value-added taxes. Much is still unknown, including exactly what the US government will do on “Liberation Day”. At Goldman Sachs, economists expect Trump to announce an average 15 per cent reciprocal tariff. They also raised their forecast for inflation and lowered it for US economic growth for the end of the year. Loading They now see a 35 per cent chance of recession in the next year, up from an earlier forecast of 20 per cent, “reflecting our lower growth forecast, falling confidence, and statements from White House officials indicating willingness to tolerate economic pain,” according to Goldman Sachs economist David Mericle. If the April 2 tariffs end up being less onerous than investors fear — maybe Trump includes no additional tariff increases on China, for example — stocks could rally. But if they end up being a worst-case scenario, which gets businesses so fearful that they start cutting their workforces, stocks could sink much further.\n\nOf course, there’s also the chance that April 2 does little to clear the uncertainty. It could end up being a “stepping stone for further negotiations” instead of a “clearing event” for the market, according to Michael Wilson and other strategists at Morgan Stanley. “This means policy uncertainty and growth risks are likely to persist — it’s a question of to what degree,” Wilson wrote in a report. One worry is that even if Trump’s tariffs end up being less harsh than feared, all the uncertainty created by them alone could cause US households and businesses to freeze their spending, which would hurt an economy that had been running at a solid pace to close last year. Either way, some familiar names were among Wall Street’s hardest hit on Monday. Tesla fell 1.7 per cent to bring its loss for the year so far to 35.8 per cent. It’s been one of the year’s worst performers in the S&P 500 in large part because of fears that the electric-vehicle maker’s brand has become too intertwined with its CEO, Elon Musk.\n\nMusk has been leading US government efforts to cut spending, making him a target of growing political anger, and protests have swarmed Tesla showrooms as a result. Other Big Tech stocks also struggled. They’ve been at the sell-off’s centre in large part because of criticism that their stock prices had become too expensive. Critics pointed to how their prices rose faster than their already quick-growing profits in recent years. Nvidia, which has ridden the frenzy around artificial-intelligence technology to become one of Wall Street’s most influential stocks, fell 1.2 per cent to bring its loss for the year so far to 19.3 per cent. On the winning side of Wall Street, Warren Buffett’s Berkshire Hathaway rose 1.2 per cent and was one of the strongest forces lifting the S&P 500. The parent of GEICO and other companies said earlier this year it’s sitting on $334.2 billion in unused cash. Such a large amount could indicate Buffett, who’s famous for buying when prices are low, may see little worth purchasing in a stock market that critics had called too expensive. with AP/Bloomberg",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-baby-crocodile-found-in-gold-coast-suburbs-20250331-p5lnx5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Ex-tropical cyclone Dianne brings more rain to flood-hit areas | Baby crocodile found in Gold Coast suburbs",
        "publish_date": "Tue, 01 Apr 2025 13:00:33 +1100",
        "category": "finance",
        "authors": [],
        "text": "Labor frontbencher and former treasurer Cameron Dick has asked Premier David Crisafulli when a review of health infrastructure projects will be released.\n\nWhile Dick suggested the review would lead to cuts and delays, Crisafulli told parliament his LNP government was cleaning up Labor’s mess.\n\nLoading\n\nCrisafulli would not say when the review would be released, but told Dick he had “failed to fund health infrastructure when he had a chance”.\n\nAlluding to possible internal documents uncovered by the review, Crisafulli challenged Dick to declare every project was fully funded by his government.\n\n“You had 10 years, and you failed badly, you failed very, very badly,” he said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/contract-for-konstas-selectors-reward-teenager-with-central-deal-20250401-p5lo3r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Contract for Konstas: Selectors reward teenager with central deal",
        "publish_date": "Tue, 01 Apr 2025 13:00:14 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Sam Konstas and Beau Webster have earned firm places in Australia’s plans, while Matt Kuhnemann is now undisputed as Nathan Lyon’s number two in the national team’s spin bowling ranks, after all were handed central contracts on Tuesday.\n\nTeenaged batter Konstas and seasoned all-rounder Webster were at the opposite ends of the experience scale, but both made important contributions to the Test series victory over India last summer.\n\nSam Konstas and Pat Cummins celebrate Australia’s victory in the fourth Test of last summer at the MCG. Credit: Getty Images\n\nKonstas, 19, was chosen as a circuit-breaker for Australia at the top of the order on Boxing Day, when his daring innings of 60 helped set up a victory that broke a 1-1 tie in the Border-Gavaskar series.\n\nWebster was then called up for the final Test in Sydney in place of a struggling Mitch Marsh, and showed great maturity with the bat, the ball and in the field to make himself very useful for the Australian cause in a low-scoring match.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/federal-election-2025-live-updates-albanese-says-dutton-unprepared-for-government-voters-worry-over-trump-effect-20250331-p5lny6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Dutton reveals pledge to cut $2.2b from Melbourne’s Suburban Rail Loop project; RBA to decide on interest rates this afternoon",
        "publish_date": "Tue, 01 Apr 2025 12:53:04 +1100",
        "category": "finance",
        "authors": [
            "Anthony Segaert",
            "Lachlan Abbott"
        ],
        "text": "Just before Peter Dutton wrapped up his press conference in Melbourne earlier this hour, the Liberal leader pledged there would be no changes to superannuation if he won government.\n\n“I believe very strongly in superannuation and I do also believe that you can do a lot of good with the current superannuation policy,” he said.\n\nThough he has not proposed changes to the fundamentals of superannuation, the Coalition has pledged to let first home buyers take up to $50,000 from their accounts for a home deposit in a move they say would help make houses more affordable for young people.\n\nHowever, the superannuation industry’s peak body, the Super Members Council, has derided that plan as “one of the worst public policy decisions” of the century, claiming it would push up demand and home prices.\n\nWith Lachlan Abbott",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/putin-stole-their-businesses-but-now-they-want-them-back-20250401-p5lo2c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Putin stole their businesses, but now they want them back",
        "publish_date": "Tue, 01 Apr 2025 12:41:27 +1100",
        "category": "finance",
        "authors": [
            "Melissa Lawford"
        ],
        "text": "Now, however, the chances of a return to Russia – if not the extraction of proper payment for stolen assets – has risen with Donald Trump in the White House and new messaging from US officials about reopening economic ties with Russia. Kirill Dmitriev, the head of the Russian Direct Investment Fund, said last month he expected “a number of American companies will return to the Russian market as early as in the second quarter of the year”. Some Western businesses have already laid the groundwork to return. French carmaker Renault sold all of its shares in Renault Russia and its 67.69 per cent interest in Russia’s AvtoVAZ in May 2022, but this agreement includes an option for Renault to buy back its interest in AvtoVAZ that is exercisable for six years. Luca de Meo, the Renault chief, last month refused to rule out a return to Russia. However, officials have since said the carmaker would need to pay $US1.3 billion to do so.\n\nExecutives should also be wary: analysts warn that Putin is using Western businesses as a pawn in his games with Europe and the US. Lost Western assets and cash have become a bargaining chip in negotiations over a potential peace deal on Ukraine – and a way of dividing Europe. Renault chief Luca de Meo has refused to rule out a return to Russia. Credit: Bloomberg “As sanctions have proliferated, the Kremlin has increasingly come to the view that Russian assets of multinational firms are useful collateral for frozen assets abroad,” says Ian Massey, at S-RM consultants. Europe and the US have frozen some $US300 billion in Russia’s overseas assets, something that has irked the Kremlin. Austria’s Raiffeisen Bank International (RBI) is battling a €2 billion ($3.4 billion) fine imposed by a Russian court in January, which officials said was compensation for frozen assets in Austria. “We had only 10 minutes to make our case in court,” says RBI spokesperson Christof Danz. The defendant was flanked by armed people wearing balaclavas. RBI is appealing the ruling and has its next court hearing on April 24.\n\n“The presence of Western businesses in Russia and the kind of leverage that gives [Putin] over certain European countries has been one of the most useful tools in the Kremlin’s toolbox for years,” says Patrick Sewell, of Control Risks, a consultancy. Loading With the Ariston decision, Putin may also be trying to divide Europe by signalling that countries that take a softer line to Moscow may get their assets back, he says. “I think it’s quite plausible that Putin would be happy to allow certain Western companies to take back their assets in a way that drives a wedge between different members of the EU. “Italy has sometimes been a kind of soft target for Russia. They’ve typically been among the more Russian friendly-countries of the EU, the Italian business community has always been very active in Moscow.”\n\nPutin’s response to the tidal wave of Western sanctions that hit Russia after the war began was a vicious attack on foreign businesses operating in the state. Of the $US167 billion lost since 2022, $US57 billion has been lost by 30 companies who have had their assets forcibly seized, according to the KSE Institute. These included French yoghurt maker Danone and Danish brewer Carlsberg, both of which have since sold their Russian assets and cut their losses. Putin also imposed blocks on companies trying to escape. Until last autumn, businesses selling assets in Russia had to take a 50 per cent hit on the sale price and pay an exit tax on the proceeds of 15 per cent. In October, Russia raised the discount to 60 per cent and the exit fee to 35 per cent. Transactions are also subject to a protracted approval process involving the finance ministry. It can take 12 months and is often unsuccessful. In other words, many businesses are effectively held to ransom. Western firms are fighting back. Ariston’s case was backed by major lobbying from the Italian Foreign Ministry. More companies are trying to attack through the legal system.\n\nGerman oil and gas producer Wintershall Dea has begun two arbitration proceedings against the Russian Federation after Putin signed decrees booting the company out of all of its five Russian joint ventures, including in the Nord Stream pipeline. Finnish energy company Fortum similarly initiated arbitration proceedings against Russia in February 2024 for compensation for unlawful seizure after it had its assets seized by presidential decree in 2023. “Fortum has since lost all oversight and control over the assets, and we are unaware of who runs these assets nor do we have any other information regarding the assets,” says Esa Hyvärinen, at Fortum. These tactics can be legally successful. In June 2024, German energy company Uniper won a $14 billion arbitration ruling against Russia’s state-owned energy giant Gazprom. But there is a big difference between winning a court ruling and enforcing it.\n\n“It looks good, it sounds good, but in practice awards of that nature in the current environment are likely to be more symbolic in nature,” says Massey. “Enforcement and recovery are very challenging exercises in hostile circumstances.” If Western businesses cannot get paid for businesses they have lost, would returning to Russia be a viable option? ‘The presence of Western businesses in Russia and the kind of leverage that gives [Putin] over certain European countries has been one of the most useful tools in the Kremlin’s toolbox for years.’ Patrick Sewell of consultancy Control Risks There are still $US194 billion worth of foreign assets in Russia, and Trump has suggested he will give businesses the green light to resume operations there. Marco Rubio, the US secretary of state, said in February there could be “incredible opportunities” for US business in Russia.\n\n“All the way up to the election of Donald Trump, companies were lining up to get approvals [to exit Russia],” says Alan Kartashkin, who formerly ran the Moscow office of law firm Debevoise & Plimpton and now oversees its Eastern European business. Loading “So much has changed. Now, you have a US president saying we should develop economic ties with Russia and investors take notice. No leader in the Western world has said that since [Putin’s invasion of Ukraine in] February 2022.” Hedge funds are exploring how they can make investments in the Russian stock market, he adds. “They want to place a bet on a potential peace deal.” Sewell says other companies are looking at the feasibility of selling non-sanctioned goods, such as food, in Russia again.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/arcade-champion-wins-lawsuit-against-queensland-youtube-creator-20250401-p5lo8a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Arcade champion wins lawsuit against Queensland YouTube creator",
        "publish_date": "Tue, 01 Apr 2025 12:36:48 +1100",
        "category": "finance",
        "authors": [
            "Rex Martinich"
        ],
        "text": "American arcade game champion Billy Mitchell has been awarded $350,000 in damages after winning a defamation lawsuit against a Queensland-based YouTuber.\n\nKarl Jobst posted a YouTube video online for a total of 15 days that claimed Mitchell’s lawsuit against another online creator had left the young man “deeply in debt”.\n\nThe American claimed Jobst’s video had implied Mitchell’s actions had contributed to YouTuber Benjamin Smith, who went by the screen name “Apollo Legend”, taking his own life.\n\nAmerican computer video game champion Billy Mitchell is seen outside the Brisbane District Court. Credit: AAPIMAGE\n\nJudge Ken Barlow handed down his judgment on Tuesday following a trial in September and October.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/why-this-much-talked-about-restaurant-is-being-overhauled-in-its-first-year-20250331-p5lnx3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why this much-talked-about restaurant is being overhauled in its first year",
        "publish_date": "Tue, 01 Apr 2025 12:25:12 +1100",
        "category": "finance",
        "authors": [
            "Dani Valent"
        ],
        "text": "Advertisement\n\nEating outComing soon Why this much-talked-about restaurant is being overhauled in its first year The owners admit the original menu “missed the mark” with locals – now they’ve gone back to the drawing board, revealing a new all-women leadership team with impressive international credentials. Dani Valent April 1, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nHospitality entrepreneur Nathan Toleman has opened 24 venues over the past 20 years, but with his most recent restaurant, the Mulberry Group creative director (and partner in Lune Croissanterie) has experienced a rare failure. Molli, the restaurant the group opened in Abbotsford last June, will close on April 2 before reopening mid-April with a new concept and chef. Molli bistro-bar (left) and Little Molli cafe-deli will make way for new concepts. Tim Harris (left) and Kristoffer Paulsen “We missed the mark for creating an all-day neighbourhood venue,” says Toleman. “It was a special-occasion place, not somewhere people raced back to. I had people who’ve supported my venues for years say, ‘I have to tell you this … I didn’t love it.’ In our own hearts, it just wasn’t right.” “It’s hard to make a business profitable from day one,” he adds. “We’re okay with that if it’s on the right track, but we weren’t achieving the growth we wanted.” One of Molli’s open-faced sandwiches, topped with egg, greens and skordalia. Supplied\n\nAdvertisement\n\nIncoming head chef Caitlin Koether, who’s worked at San Francisco’s Bar Tartine and Relae in Copenhagen, will serve wholesome dishes threaded with ferments, big flavours and striking colour palettes. All-day breakfast includes house-made yoghurt with sour cherry granola, while lunch will be built around open-faced sandwiches such as smoked chicken, chickpea miso mayonnaise and pickled celery. At night, bread and dips get a refresh: potato-based fry bread with whipped schmaltz, lemon thyme and chicken skin sounds like dinner unto itself. The menu continues with a chopped salad; roasted carrots with pickled persimmon; and steak aged with koji, the tenderising and flavour-giving Japanese ingredient. Carrots with pickled persimmons reflect new chef Caitlin Koether’s wholesome style. Supplied “I want people to feel nourished, and to be able to come in and have an entire meal without breaking the bank,” she says.\n\nAdvertisement\n\nKoether came on board in October as head of fermentation, a job title she borrowed from a position she almost snared at Noma in Copenhagen in 2023. She’s part of Molli’s new all-women leadership team, which includes bar manager Kayla Saito (ex-Aru) and general manager Bonnie Maguire (ex-Falco). Head chef Caitlin Koether and venue manager Bonnie Maguire. Supplied Outgoing chef Aleksis Kalnins, who joined Mulberry Group in 2023 to helm Hazel, has departed the group and is considering offers. He puts Molli’s troubles down to a mismatch between his cooking and the neighbourhood, which is known for pubs and bordered by Victoria Street’s more casual dining. “If we opened on Flinders Lane, I think we would have done well.” Toleman is still a Kalnins fan. “There’s a football analogy: you have a great player, but you’re playing him in the wrong position,” he says.\n\nAdvertisement\n\nAdmitting the misfire on Molli 1.0 has been tough, but Toleman says he’s open to learning. “The most successful people in business – Phil Knight from Nike, Richard Branson – have as many failures as successes. We don’t talk about failure enough. Let’s own it.” The interior of Molli is being tweaked to suit the new all-day brief. Tim Harris The restaurant will aim for a softer look when reopens, with the stately antique credenzas replaced with more contemporary furnishings. Adjacent cafe Little Molli will stop operating on April 8 and reopen later in the month as a pantry selling Mulberry Made ferments. Cooking classes and workshops are planned, too. Molli reopens April 11. Breakfast and lunch daily; dinner Tue-Sat. 20 Mollison Street, Abbotsford, molliabbotsford.com.au\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/not-on-my-watch-pms-message-for-trump-20250401-p5lo82.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Not on my watch': PM's message for Trump",
        "publish_date": "Tue, 01 Apr 2025 12:15:13 +1100",
        "category": "finance",
        "authors": [],
        "text": "'Not on my watch': PM's message for Trump\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/was-li-ka-shing-pushed-to-sell-panama-ports-or-did-he-jump-20250401-p5lo3s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Was Li Ka-shing pushed to sell Panama ports, or did he jump?",
        "publish_date": "Tue, 01 Apr 2025 12:12:14 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Trump, of course, has touted the deal as a personal victory, while China’s response characterises it as its loss. That raises question marks for both countries. Loading BlackRock and its co-investors, Global Infrastructure Partners (recently acquired by BlackRock) and Terminal Investment, a Swiss-based company owned by the Aponte shipping billionaire family, are Western, privately owned companies. Hutchison, a conglomerate with interests in ports, infrastructure (including gas pipeline networks in Australia), telecommunications (including a 25 per cent stake in TPG Telecom) and property around the world, is also, ostensibly, a privately owned, commercially driven group. It’s regarded as the most successful company Hong Kong has produced.\n\nIf the deal is a win for Trump and the US, is the US president implying – as Beijing might believe –that the consortium will prioritise the management of the ports in the economic and national security interests of the US over those of its investors? If the deal is contrary to China’s national economic and security interests, as its response implies, does that mean it sees Hutchison’s ownership or control of the ports as supportive of its strategic ambitions? For the US – and the other 22 countries that will need to consider the implications of the deal from their own perspectives – the BlackRock consortium can be expected to be driven by its own commercial considerations. Is Donald Trump suggesting that the buyers of the Panama Canal will manage its ports in the economic and national security interests of the US? Credit: AP Trump might want to attack China’s dominance of global commercial shipping with massive increases in port fees and the rebuilding of a nearly non-existent US shipbuilding industry, but the consortium will be more interested in maximising the returns on a massive investment than in geopolitics. Even in Trump’s America, businesses (other than, perhaps, Elon Musk’s) prioritise profits above all else.\n\nFor China, blocking – or trying to block – the deal could suggest that it does see ownership of ports around the world as an important component of its geopolitical strategy and that even its private sector operators (Chinese state-owned companies are also major port operators) have been co-opted, or at least can be coerced to co-operate, with Beijing’s ambitions. It would confirm Western suspicions. Ownership of ports and infrastructure around the world – particularly within the “Global South” countries, with which China has been steadily building relations and dependence via its “Belt and Road” initiative – is clearly an important part of China’s strategy of gaining influence or control over critical points within global supply chains and its longer-term ambition of undermining America’s global dominance. Opposing the Hutchison sale does, moreover, present some domestic risks for Beijing and China’s economy. As China’s economic growth has slowed and deflationary threats have emerged, Xi Jinping has shifted its stance on the private sector, which had previously been subjected to waves of crackdowns, regulation and intimidation. In February, Xi met China’s leading entrepreneurs as a sign that they were back in favour and that he needed them to help re-energise China’s faltering economic growth rate.\n\nFrustrating the Hutchison sale would signal to those entrepreneurs that the state support and the freedoms he was dangling before them to be entrepreneurial and profit-driven come with a caveat. They, and their fortunes, would still be subject to the whims of the state. More particularly, even after the handover of Hong Kong by the UK to China in 1997, China has tried to maintain a level of commercial independence for Hong Kong and its status as one of the world’s key centres for finance and trade – although its response to the 2019 pro-democracy demonstrations, the controversial national security laws, placed a question mark over the extent of its tolerance. Loading Ordering or coercing Li and his family into abandoning the sale would send a chilling message to other Hong Kong entrepreneurs, privately held companies, and prospective investors in Hong Kong – and that at a time when foreign investors have, despite a concerted effort by the authorities, been fleeing mainland China. If Hong Kong is to remain a key global finance and trade hub, it can’t send a signal that it will intervene in the affairs of multinationals, even those built by Hong Kong entrepreneurs.\n\nThere is some doubt whether China has much ability to intervene, other than through coercion. Hutchison has diplomatically retained ownership of its ports on the mainland and in Hong Kong, and while its property arm does have investments on the mainland, it has steadily reduced its exposure to Greater China over the decades. Only about 12 per cent of its revenue is generated within China and Hong Kong, with most of the rest flowing from Europe, North America and Australia. The $US19 billion of net cash it would get from the sale would be useful, given that it has announced a £7 billion ($14.5 billion) bid for the UK’s Thames Water and has also indicated it will return significant amounts to shareholders. It would also be timely. With Trump about to ramp up his trade war with the rest of the world with a new round of tariffs and having made it clear that China will face punitive port and shipping rates for its exports to America, global growth and global seaborne trade are likely to be adversely impacted.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tszyus-admission-ahead-of-return-20250319-p5lkvi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tszyu's admission ahead of return",
        "publish_date": "Tue, 01 Apr 2025 12:06:56 +1100",
        "category": "finance",
        "authors": [],
        "text": "Tszyu's admission ahead of return\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/art-and-design/lunch-with-karen-quinlan-arts-centre-melbourne-20250326-p5lmrq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Oh, yeah I think everyone’s always interested in the hot pants’",
        "publish_date": "Tue, 01 Apr 2025 12:02:17 +1100",
        "category": "entertainment",
        "authors": [
            "Elizabeth Flux"
        ],
        "text": "Over the next few years, the Melbourne Arts Precinct plan will be rolled out, aimed at connecting the major creative institutes more. Among the changes, there will be a new gallery and a large garden. Loading The most significant change for the Arts Centre over the past two years is that the “short-term pain” Quinlan described when I first spoke to her is here – the renovation of the State Theatre. Its closure last year has left a significant gap in the Melbourne performing arts landscape, with The Australian Ballet and Opera Australia essentially relocating to the Regent Theatre in the interim, creating knock-on effects as companies vie for space to stage productions. Quinlan says the refurbishment – due to finish in 2026 – is on schedule. As we tentatively start picking at our shared plates, each conscious to make sure that we both get to try the different kinds of sashimi, I bring up the last time we met – a few months ago, when we were taken on a tour of the works in progress. After navigating a maze of doors and beams and clutter we were told that we were standing on the stage. It had been difficult to believe. “I know – you go in there and you don’t even recognise it,” says Quinlan with a small smile. “You can’t even work out where you are because of all the scaffolding.”\n\nOnce it’s done, “you won’t notice a visible difference – but you’ll feel it,” she says. The changes are quiet but necessary. “Air conditioning, audio, seating, more aisles, more accessibility, new carpet, new chairs, seating … [and] a more efficient back of house”, she lists. Karen Quinlan CEO Arts Centre Melbourne, Minister for Creative Industries Colin Brooks and local MP Nina Taylor in the construction site of the State Theatre in September 2024. Credit: Justin McManus In the meantime, she adds, the smaller Fairfax and Playhouse theatres are open, and “We have another little space called the showroom, which does new and emerging art, performing arts. So we’re still active down there.” One thing she has been pushing against in her now two years at the helm is how the Arts Centre is perceived. While she highlights the resident companies and programming with pride, she also underscores that “in many ways, we’re more than a hall for hire”. The Arts Centre, she says, known for its live performances across the theatres buildings and the Sidney Myer Music Bowl, but hidden in its depths is a collection of artwork and of performing arts artefacts from across Victorian and Australian history – ranging from paintings by Arthur Boyd to Kylie Minogue’s famed gold hot pants. “Oh, yeah, I think everyone’s always interested in the hot pants,” she says with an edge of amusement.\n\nOne of the newest pieces added to this collection is a photograph of David Hallberg, artistic director of The Australian Ballet, by Bill Henson. The image depicts a statuesque Hallberg looking out over the construction of the State Theatre. “That commission is a slightly new direction for us in terms of building upon what we already have as a collecting institution – which a lot of people don’t know about,” Quinlan reflects. “There are more than 850,000 items.” Artistic Director of The Australian Ballet David Hallberg (left) with photographer Bill Henson with the work that Henson was commissioned to produce of Hallberg by Arts Centre Melbourne that will hang in the State Theatre foyer when it reopens. Credit: Justin McManus The shift from visual arts to performing arts is not the biggest one in her career. Quinlan started out teaching at an all-girls Catholic school, working with textiles. “A lot of garment construction and fabric screen printing,” she explains. “The course I did was very practical. It also had a very strong art history component.” Over her few years there, her role changed and expanded into teaching art and media studies. “It was a good experience, and I loved education,” she says. From there, however, she had a gear shift and a range of jobs – administration at the State Library and a position in the gallery shop at the NGV. As she became more interested in textiles and fashion at the gallery, she approached the curator to ask if she could do some voluntary work in the department. After a few years of volunteering, she began work as a curatorial assistant. “I came into museums and galleries, in a non-traditional way, I suppose.” She notices that I have stopped eating while listening, and ushers me to continue, serving us each a bit more.\n\nChef’s special: Spanner crab on shokupan toast Credit: Luis Enrique Ascui There wasn’t a set plan or strategy in her career pathway, though “I was always fairly ambitious,” she says. While at the NGV she applied for a course in conservation in London. “But then I had a change of heart and I decided I wouldn’t go. You know how you have those moments in your career?” she asks, looking off into the distance. “I don’t know if you have – where you contemplate a number of things? You finally work out what you want to do.” It was during this period that a curator role came up in Bendigo, and that shaped the next 20 years of her life. In 2000, she took over as director and in her almost two decades at the helm, the gallery’s ambition and reputation grew. They worked with the Victoria and Albert Museum and the National Portrait Gallery in London. “When I was at Bendigo, I loved doing exhibitions that were about people and the stories, and, you know, Grace Kelly and Marilyn Monroe and I had a lot of grand plans. I brought fashion in. You know, you name it we did it,” she reflects. “If you take a few risks and you have the community with you in a small place like Bendigo, that works, and it has worked, and it’s still doing it,” she says. “It’s just got a great reputation now. So it is, yeah, I’m very proud of the work I did up there.” For her current role, she says, “I don’t think I was necessarily concerned about the fact that I was moving from visual arts to performing arts.” But, would she have taken up the Arts Centre post if it weren’t for the collection? She pauses, “I always knew about the collection, and I always knew that it was not getting the attention that it should have. So probably not.”\n\nKylie Minogue’s shoes are one of over 850,000 items that make up the Arts Centre’s performing arts collection. Credit: Justin McManus Only a few snippets of the personal weave their way into the conversation – Quinlan’s laser-sharp focus is on her work and her plans as chief executive, but she does have one long-term side project that she lights up when she speaks about. Research into Australian artist Agnes Goodsir. It’s an interest that has seen her digging through archives for several years. “I like the process, and I love the discovery, and I’m addicted to it.” She doesn’t know what final form this research will take, acknowledging that it is difficult to dedicate time to the project while working a demanding job.\n\nQuinlan is halfway through her five-year contract and has a lot of plans for the next few years. But she also has her eye on the future, both for herself and those following in her footsteps. She’s not someone who never plans to retire. The bill at Saké Credit: “It’s actually good thing to let younger people come in and take on – you can’t hold on to these roles forever. I think with CEOs and director roles, it’s good to see the movement,” she says. “When I think about collecting institutions, curators stay with the collection, and they keep working. They’ve got that lifelong contribution, and they’ve got great knowledge. But I think when you’re a CEO or a director, you can move a bit more, and I think you should.” She pauses. “I’m fairly ambitious for every institution I’ve ever worked for ...I won’t be here forever, but I want to make sure what I do in the time that I am here is really as significant and maintains what this place is.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/busy-this-weekend-the-unexpected-benefits-of-making-plans-20250331-p5lnwv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Busy this weekend? The unexpected benefits of making plans",
        "publish_date": "Tue, 01 Apr 2025 11:48:28 +1100",
        "category": "lifestyle",
        "authors": [
            "Lauren Ironmonger"
        ],
        "text": "It may sound obvious, but Greenaway says one of the most important things to do if you’re feeling disconnected is to speak up. Yet, many of us feel like we can’t. In a report from not-for-profit Friends for Good, more than half of respondents said they would be embarrassed to tell someone they were feeling lonely, while only 29 per cent said they had opened up to someone about their loneliness. “There’s this tendency to assume that social relationships are an inevitable part of life – they either work or they don’t,” says Greenaway. “But actually confronting that myth and saying, ‘I know this isn’t inevitable ... maybe I need to start verbalising some of these feelings and trying to do something about it.’” And as Greenaway points out, research shows people tend to react more positively than we think when we disclose hidden truths about ourselves and how we feel.\n\nMaking plans is a strategy often used by psychologists during Cognitive Behavioural Therapy. Just as it sounds, it’s about carving out time for things that bring us joy, align with our values or help get us closer to our short or long-term goals. As Greenaway points out, enriching our personal lives isn’t just about having fun but is actually a must for our wellbeing. “Looking after our social health isn’t just a nice bonus. Ultimately, it ends up being a matter of life and death. It sounds quite extreme, but there’s evidence to suggest being more socially connected actually has as strong or an even stronger effect on mortality than things like giving up smoking or drinking less.” Quality over quantity The good news is there’s no prescriptive model for what a healthy personal life should look like.\n\n“What research shows is that quality matters more than quantity,” says Greenaway. Some people may be completely fine with just seeing a few friends once a fortnight, while others will need more. Regardless, having some idea of what a meaningful social life looks like to you and a framework to help foster it is important. ‘The brief chat with the barista is actually a pretty good antidote to isolation.’ Professor Lisa Williams, UNSW “If you have some structure, it can make it easier to unthinkingly connect with others. You can set up your life and environment in a way where you’re getting your social needs met. But if you have to think about going out when you need to, it might already be too late,” she says. This could look like a regular fortnightly call with a friend or joining a local sport club.\n\nProfessor Lisa Williams, a social psychologist at UNSW, suggests a two-pronged approach to nurturing meaningful connections. The first, she says, is about engaging with deep relationships we already have and thinking about what we want from them. “Is it sitting down and having a chat? Is it doing something you enjoy together that’s meaningful to both of you?” The second is about connecting with acquaintances or “leaning into casual social connections”. “The brief chat with the barista is actually a pretty good antidote to isolation,” Williams says.\n\nSticking to a plan Scheduling activities is one thing, but actually following through on them can be tricky, particularly if you are feeling down. Loading But the act of making plans itself can be a powerful motivator. Williams says research on goal-setting shows that “implementation intentions” increase the likelihood of us sticking to a plan.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/i-won-t-make-the-same-mistake-again-banned-ex-demon-wants-shot-at-afl-redemption-20250401-p5lo5c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I won’t make the same mistake again’: Banned ex-Demon wants shot at AFL redemption",
        "publish_date": "Tue, 01 Apr 2025 11:45:40 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik"
        ],
        "text": "Loading\n\n“If I can come and potentially give a team something that are chasing a flag, like that’d be great. Four years, I feel like I’d get a lot out of that. But it’s just about staying healthy and keeping the body ticking over. Because if it does, you never say never, really. Like if it does happen, it’d be great, but there’s always local footy as well,” Smith, now working in construction, said.\n\nSmith, the father of two young children, had played 42 games before his ban. He knew as soon as he was randomly tested that he was in trouble.\n\n“They are random tests. Obviously, when you get the tap on the shoulder … it was a deflating feeling because I am like: ‘Ah f---, I think I am in trouble here’. Then you get the call from the club saying: ‘You need to come in, something has come up’. I went in and they handed me with the game-day testing – it was a shocking feeling,” Smith said.\n\n“Then you get involved with lawyers. You don’t really understand how much lawyers cost until you are dealing with them. The first three months were horrible. I thought I was going to be back playing in three months, which is the thing that sucks. If you don’t do it the day of the game, it is three months. But, for some reason, they thought – I did it close to the game, but definitely didn’t do it the day of the game. That’s the thing that sucks, that they didn’t see through that.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/matildas-star-says-sam-kerr-should-resume-as-captain-upon-return-from-injury-20250401-p5lo3o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Matildas star says Sam Kerr should resume as captain upon return from injury",
        "publish_date": "Tue, 01 Apr 2025 11:45:24 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Matildas vice-captain Emily van Egmond says returning skipper Sam Kerr has the support of the playing group and that she “definitely should not” hand back the armband once she’s ready to play.\n\nKerr is back with the Matildas for the first time in more than a year ahead of Friday night’s friendly against South Korea - but only in a training capacity as she completes her recovery from an ACL injury.\n\nOnce she returns to the pitch, the 31-year-old has been cleared to resume as captain after a decision by Football Australia not to impose any further punishment following her trial for racially aggravated abuse of a London police officer, in which she was found not guilty. Her club, Chelsea, also opted not to sanction her while Kerr’s sponsors have all stood by her throughout the controversy.\n\nVan Egmond said Matildas players were thrilled to have Kerr back, albeit still unavailable to help them in matches.",
        "source": "TheAge"
    }
]