[
    {
        "url": "https://www.9news.com.au/national/multi-level-marketing-network-marketing-nucerity-sabrina-exclusive/03112f11-4270-46e7-ab25-97e1cdf5fdf7",
        "title": "Sabrina joined a common 'side hustle' to make extra cash. It 'destroyed' her",
        "publish_date": "Thu, 10 Jul 2025 23:21:00 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Exclusive: Sabrina wanted to make some extra cash. Chloe* followed other local mums. Ellen* was looking for love.\n\nAll three took part in in multi-level marketing (MLM) businesses﻿ that they say left them in financial or emotional ruin.\n\nAnd they're not alone.\n\nREAD MORE: The faces of the Texas flood tragedy\n\nSabrina wanted to make some extra cash but ended up broke. (Supplied)\n\nThere are about 300,000 MLM consultants in Australia, according to Direct Selling Australia (DSA) – about 80 per cent of them women. MLMs are legal in Australia but research shows most consultants will only lose money.\n\n﻿The industry has also been plagued with allegations of \"toxic\" culture and unethical business practices for years.\n\nYet more than 90,000 Aussies joined MLMs in 2023 alone, many just trying to make ends meet.\n\n\"They prey on vulnerable people, they offer hope in this financial crisis﻿,\" Ellen told 9news.com.au.\n\n\"It's all a lie.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nWhat is multi-level marketing﻿?\n\nMLM businesses, also known as direct selling or network marketing, work by recruiting individual salespeople or \"consultants\".\n\nBut they don't receive a salary or wages.\n\nInstead, they make money by selling MLM products, which they must purchase themselves from the business then sell at a markup or through recruitment.\n\nConsultants can make hefty bonuses ﻿by recruiting other consultants under them (known as their \"downline\") to earn a percentage on all those recruits' sales.\n\nThis model, popularised by brands like Avon and Tupperware, has been compared to those of illegal pyramid schemes but MLMs are ﻿legal under Australian Consumer Law because they offer tangible products.\n\nBut fewer than one per cent of MLM consultants make a profit, according to US research , and a slew of MLMs have been accused of unethical sales and recruitment ﻿tactics.\n\nConsultants predominantly ﻿sell and recruit through their personal networks, targeting friends, family and social media connections to buy or join.\n\nAnd most MLMs require ﻿consultants to make regular purchases and meet sales ﻿targets just to stay in the business.\n\nSo why would someone ever join?﻿\n\nLured in\n\nSabrina was working as a travel agent in Queensland when an old friend suggested she join ﻿skincare MLM NuCerity.\n\nShe promised it would help Sabrina achieve financial freedom and be her own boss.﻿\n\n\"I was doing a lot of overtime and she started telling me how it would be a great way to eventually get some time freedom,\" Sabrina told 9news.com.au.\n\n\"I signed up straight away.\"﻿\n\nShe believed her friend had her best interests in mind and ignored some red flags, ﻿like when other consultants allegedly told her not to Google the business.\n\n﻿\"I trusted her, so I didn't really question anything,\" Sabrina said.\n\nSabrina \"didn't question anything\" when an old friend recruited her into an MLM business. (Supplied)\n\nHad she Googled NuCerity, Sabrina might have found warnings not to join the MLM that left her broke and emotionally \"shattered\".\n\n﻿Sabrina was with NuCerity for four years but never made more than a few hundred dollars a month, even after quitting her job to focus on the MLM.\n\nAny money she did make was spent on NuCerity products to stay in the business, so she had to rely on her then-partner to cover rent, bills and groceries.\n\nNuCerity has since gone out of business. It was acquired by ARIIX , which has also gone out of business and in turn was acquired by NewAge. All three companies have not responded to a request for comment.\n\nSingle mum Ellen was convinced to join a health product MLM by a man she met on a dating app who swore it would be the \"perfect side hustle\" on top of her nursing job.\n\nShe hoped to make extra cash and was involved with a string of MLMs over the next few years but lost thousands.\n\n\"This has really f----- me over emotionally and financially,﻿\" she said tearfully.\n\nOther former consultants told 9news.com.au they were recruited into MLMs by friends and relatives who promised they could earn easy money and work from home.\n\nMost said they ﻿only believed the claims because of their relationship with the recruiter.﻿\n\n'Is this a cult?'﻿\n\nChloe, from Perth, was sceptical when local mums started joining a beauty MLM but was eventually recruited by a relative.\n\nThough she made $6000 in less than a year, she said the toxic and \"cult-like\" behaviour she witnessed ﻿in the MLM shocked her.\n\n﻿\"Not only did I witness most mums losing money but the emotional and spiritual abuse was like nothing I'd seen before,\" Chloe said.\n\nShe alleged other consultants bullied and harassed new recruits, manipulated them into paying for their own training courses and \"shut down\" anyone who challenged them.\n\nWhen 9news.com.au reached out to the health MLM it said it took \"allegations of bullying and harassment extremely seriously but strongly rejects any allegations that misrepresent our business model, culture, or the safety of our products.\"\n\nSabrina alleged she was encouraged by NuCerity consultants to spend beyond her means to maintain the image of success even when she was scraping by.\n\nShe claimed that when she questioned these tactics, she was \"gaslit\" into believing she was the problem.\n\n\"It's incredible how these groups can just brainwash you,\" she said.\n\n\"My auntie even asked me, 'Is this a cult?'\"\n\nIt certainly felt like one to Ellen, who only stayed in the MLM industry for so long because she craved a sense of community.﻿\n\nMost MLMs encourage consultants to connect and form groups, offering a sense of connection to vulnerable and isolated individuals.\n\n\"I'm very isolated socially and I felt like I belonged﻿,\" Ellen said, but it soured quickly.\n\n\"They pretend to be your friend [but] they just close ranks and shut you out if you don't do exactly what they say.\"\n\n'The women who join are not dumb or naïve'\n\nFormer consultants alleged they were encouraged to target vulnerable people ﻿to boost sales and recruitment.\n\n\"We were encouraged to find a niche – burnt-out nurses, or menopausal women, or single mums – and infiltrate,\" Ellen claimed.\n\n\"To join all these Facebook groups, then start offering [MLM products] on the sly.\"\n\nSabrina and two other NuCerity consultants went a step further, starting their own Facebook group to lure other women into the MLM.\n\nAdvertised as a group for women to make friends, they used it to identify and connect with potential targets.\n\n\"We started organising weekend coffees under the pretence of wanting to connect and make friends ... we were really sneaky, to be honest,\" Sabrina said.\n\nThen they tried to sell to or recruit the women, many of whom had limited social or support networks.﻿\n\nChloe said that mothers in her local area were prime targets, as many were socially isolated and craved connection with other women.\n\n\"The women who join are not dumb or naïve,\" she said.\n\n\"They are being recruited by their best friends, sisters, mums, aunties, work colleagues, people they know, like and trust ... and it's not simple to leave.\"\n\nLeaving isn't easy﻿\n\nWhen Sabrina finally left NuCerity it was because she couldn't afford the $200 minimum monthly spend to stay in the business.\n\nAs soon as that happened, the consultants she'd called friends cut her off.\n\n﻿\"Everything just started crumbling. I completely lost my self-esteem, I was very depressed,\" she said.\n\nIt took months to recover financially and emotionally, and years to come clean to members of the Facebook group﻿ she had started (after the other consultants left).\n\nShe now runs it solely to foster friendships and protect other women.\n\nSabrina now educates other Australians about the financial and personal risks of MLMs. (Supplied)\n\nEllen struggled for years before finally escaping the MLM industry after saying she said she realised it was \"all smoke and mirrors\".\n\n\"It's a lot of manipulation, you're most likely not going to succeed, you're most likely going to lose a hell of a lot of friends and family,\" she said.\n\nShe's suffered mental health issues as a result and is still thousands of dollars out of pocket.﻿\n\nSabrina, Chloe and Ellen now spend their free time educating other Australians about the financial and personal risks of MLMs in the hopes that other women don't fall into the same trap.\n\n\"They are not providing an opportunity for mums and vulnerable people,\" Chloe said.\n\n\"It's a model where only one per cent earn a decent income and the rest lose money.\"\n\nSabrina added that Australians who leave MLMs shouldn't feel ashamed ﻿to share their stories, as they can help others find the motivation to get out of a bad situation.\n\nShe, Chloe and Ellen called for better financial education for vulnerable groups and greater government protections and support for people who lose money in MLMs.\n\n*Names changed for privacy.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/jane-birkin-original-hermes-bag-sells-at-auction-for-whopping-86-million-euros/c2ae1a37-feee-47ac-9247-5731ea5f8b39",
        "title": "'Most famous handbag of all time' sells for $15 million",
        "publish_date": "Thu, 10 Jul 2025 17:46:34 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Sketched out on an air sickness bag, the first Birkin handbag — the prototype for fashion's must-have accessory — sold for a staggering €8.6 million ($15.29 million), including fees, on Thursday in Paris to become the second most valuable fashion item ever sold at auction.\n\nThe winning bid of €7 million drew gasps and applause from the audience. The price crushed the previous auction record for a handbag — $513,040 paid in 2021 for a Hermès White Himalaya Niloticus Crocodile Diamond Retourne Kelly 28.\n\nNow, the original Birkin bag, named after the actor, singer and fashion icon that Hermès created it for — the late Jane Birkin — is in a new league of its own. Only one fashion item has sold at auction for more: a pair of ruby red slippers from The Wizard of Oz , which sold for $US32.5 million ($49.43 million) in 2024, Sotheby's said.\n\nREAD MORE: Driver yet to speak to police after car hits pedestrian trio in fatal crash\n\nThe winning bid of €7 million drew gasps and applause from the audience. (AP)\n\nThe bag became so famous that Jane Birkin once mused before her death in 2023 at age 76 that her obituaries would likely \"say, 'Like the bag' or something\". (AP)\n\nWhistles in the auction room\n\nThe Paris auction room buzzed with anticipation as the sale got under way, with the auctioneer reminding the crowd that the bag was \"totally unique\" and \"the most famous bag of all time\".\n\nThe bidding started at €1 million but quickly increased, with telephone bidders fighting it out at the end. With Sotheby's fees included, the total price for the winning bidder from Japan was a cool €8.6 million, the auction house said.\n\nFrom the starting price, bids rocketed past €2 million, then €3 million, €4 million and €5 million, to astonished gasps. When the price jumped from €5.5 million to €6 million in one swoop, there were whistles and applause.\n\nThe final bids were €6.2 million, then €6.5 million, then €6.8 million before the Japanese buyer's last winning bid: €7 million.\n\nThe price crushed the previous auction record for a handbag — $513,040 paid in 2021 for a Hermès White Himalaya Niloticus Crocodile Diamond Retourne Kelly 28. (AP)\n\nSotheby's didn't identify the buyer. Nine collectors bidding by telephone, online, and in the room competed in the 10-minute auction battle, with the private collector from Japan beating a last remaining other bidder at the end.\n\n'One of a kind'\n\nParis fashion house Hermès exclusively commissioned the bag for the London-born Birkin in 1984 — branding it with her initials JB on the front flap, below the lock — and delivered the finished one-of-a-kind bag to her the following year, Sotheby's said. The subsequent commercialized version of Birkin's bag went on to become one of the world's most exclusive luxury items, extravagantly priced and with a yearslong waiting list.\n\nThe bag was born of a fortuitous encounter on a London-bound flight in the 1980s with the then-head of Hermès, Jean-Louis Dumas. Birkin recounted in subsequent interviews that the pair got talking after she spilled some of her things on the cabin floor.\n\nBirkin asked Dumas why Hermès didn't make a bigger handbag and sketched out on an airplane vomit bag the sort of hold-all that she would like. He then had an example made for her and, flattered, she agreed when Hermès asked whether it could commercialise the bag in her name.\n\nParis fashion house Hermès exclusively commissioned the bag for the London-born Birkin in 1984 — branding it with her initials JB on the front flap, below the lock. (AP)\n\n\"There is no doubt that the Original Birkin bag is a true one-of-a-kind — a singular piece of fashion history that has grown into a pop culture phenomenon that signals luxury in the most refined way possible. It is incredible to think that a bag initially designed by Hermès as a practical accessory for Jane Birkin has become the most desirable bag in history,\" said Morgane Halimi, Sotheby's head of handbags and fashion.\n\nThe bag became so famous that Birkin once mused before her death in 2023 at age 76 that her obituaries would likely \"say, 'Like the bag' or something\".\n\n\"Well, it could be worse,\" she added.\n\nHeight of French chic\n\nSotheby's said that seven design elements on the handcrafted all-black leather prototype set it apart from Birkins that followed.\n\nIt's the only Birkin with a nonremovable shoulder strap — fitting for the busy life and practicality of the singer, actor, social activist and mother who was also known for her romantic relationship with French singer Serge Gainsbourg and their duets that included the steamy 1969 song Je t'aime moi non plus ( I Love You, Me Neither ).\n\nHer bag also had a nail clipper attached, because Birkin \"was never one for long painted nails,\" Sotheby's said.\n\nAuction officer Aurélie Vandevoorde gestures to the Birkin. (AP)\n\nThe bag that Hermès handmade for her, developed off its existing Haut A Courroies model, also has gilded brass hardware, bottom studs and other features that differ from commercial Birkins.\n\nBirkin's casual, breezy style in the 1960s and early 1970s — long hair with bangs, jeans paired with white tops, knit minidresses and basket bags — still epitomizes the height of French chic for many women around the world.\n\n'More than just a bag'\n\nWhen Birkin chatted to Hermès' Dumas on the Paris-to-London flight about what her ideal handbag would be, she'd been in the habit of carrying her things around in a wicker basket, because she felt handbags in the 1980s were too small, Sotheby's said. She was traveling with her young daughter, Charlotte, and complained that she couldn't find a bag suitable for her needs as a mother, Hermès says.\n\nHermès later gifted her four other Birkin bags. She kept the prototype for nearly a decade, before auctioning it for an AIDS charity in 1994. It was auctioned again in 2000 and had since been in private hands.\n\nAn electronic board shows the bid after the original Birkin bag created by Hermès for Jane Birkin was sold. (AP)\n\nThe previous owner, who identified herself only as Catherine B, told journalists at the auction that the bag \"has all the attributes of a star.\"\n\n\"The price is the price of the Hermès story,\" she said.\n\nSotheby's called it \"more than just a bag\".\n\n\"The Birkin has evolved from a practical accessory to become a timeless cultural icon,\" it said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/adelaide-grandmother-hospital-ramping-ordeal/a2be98d3-72cd-4fc7-bf74-3a1a3811045d",
        "title": "Great-grandmother forced to endure horror hospital ordeal",
        "publish_date": "Thu, 10 Jul 2025 08:56:16 +0000",
        "category": "lifestyle",
        "authors": [
            "Jul"
        ],
        "text": "South Australia's health system is under fire after a great-grandmother went through a horror ordeal, being stuck on the hospital ramp at two different hospitals and forced to wait more than 24 hours for a bed.\n\nPat, who's 91 years old and weighs just 39 kilograms, had a fall at home on Monday afternoon, and the situation rapidly deteriorated.\n\n\"I had to make three more phone calls to escalate it because she started bleeding from the nose and then she was in pain, lower back pain,\" daughter Libby Turner said.\n\nREAD MORE: Search for missing backpacker in outback intensifies after van found empty\n\nGreat grandmother Pat, who had to wait more than 24 hours for a hospital bed after a fall. (Nine)\n\n﻿ An ambulance arrived about 90 minutes later, transporting Pat to the Queen Elizabeth Hospital (QEH), where she remained in the back of an ambulance on a hospital ramp for hours.\n\n\"I sat with her in the ambulance ramped at the QEH until 10pm,\" Turner said.\n\n\"They were having to take her out of the ambulance and into that freezing cold storm to get her more comfortable,\" said Libby Turner.\n\nAt 6am on Tuesday, she was moved to the Royal Adelaide Hospital, where she was ramped again.\n\nIt wasn't until that 9am she was finally taken in and assessed, but Libby says she waited more than 24 hours in emergency for a bed.\n\n\"I've just seen her now and she's not good,\" Turner said.\n\nThe Turner family say they're speaking out about the state's health system because they felt like they had no other option, and don't want anyone else to have to go through what they did\n\n\"Well it's not fixed, it's f------,\" Turner said.\n\n\"Sorry, but no other word for it.\"\n\nThe opposition says the incident shows the health system needs to change.\n\n\"It's shocking, it's shameful,\" opposition health spokeswoman Ashton Hurn said.\n\n\"I'm really sorry in terms of what happened and the government is doing everything we possibly can to improve the situation for other patients,\" Health Minister Chris Picton said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/former-aleague-soccer-stars-admit-to-roles-in-betting-corruption-scandal/b7155ee3-6c69-4e65-841f-1f1ba3291a27",
        "title": "Former A-League players admit to roles in betting corruption scandal",
        "publish_date": "Thu, 10 Jul 2025 06:06:27 +0000",
        "category": "sports",
        "authors": [
            "Jul"
        ],
        "text": "Two former A-League players have admitted engaging in a betting corruption scandal after they were paid to earn yellow cards during games.\n\nEx-Macarthur Bulls team captain Ulises Davila, and midfielders Kearyn Baccus and Clayton Lewis, have been charged with manipulating yellow cards during games in 2023 and 2024.\n\nDavila, 33, allegedly acted as the conduit between the south-west Sydney team's players and an unnamed criminal group in Colombia, organising for the cards to occur during particular games.\n\nUlises Davila was captain of the Macarthur Bulls. (Getty)\n\nBaccus, 33, and Lewis, 27, were allegedly paid up to $10,000 by the former captain to deliberately receive the referee-issued cautions for foul play.\n\nThe midfielders pleaded guilty today to engaging in conduct that corrupts the betting outcome of an event.\n\nA second charge of participating in a criminal group was withdrawn.\n\nLewis had previously pleaded not guilty to both charges, but reversed his plea to one of the charges after negotiating with prosecutors.\n\nBoth former A-League players maintained blank faces as their pleas were entered.\n\nThe pair will face sentencing in September.\n\nREAD MORE: ﻿ Sussan Ley says she once pulled a gun on a man while camping\n\nKearyn Baccus. (SMH)\n\nClayton Lewis. (Edwina Pickles)\n\nDavila, the alleged local ringleader of the criminal group behind the betting corruption, has not yet entered pleas to the nine charges he faces.\n\nHe will return to court in August.\n\nGaming-machine records and bookmaker statements from BetPlay Colombia, Bet365 New Jersey and Bet365 Bulgaria comprise part of a lengthy brief of evidence being prepared by prosecutors.\n\nPolice say the betting scheme led to hundreds of thousands of dollars being paid out in winnings.\n\nDavila's contract with Macarthur FC was terminated shortly after his initial arrest, which the team described in a statement as mutual.\n\nBaccus was released by the Bulls during a 2024 off-season clean-out and Lewis remains suspended.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/melbourne-street-local-opposition-mcdonalds-restaurant/b633a2bc-57cc-41fc-ae18-98f83a901065",
        "title": "Locals up in arms over proposed 24-hour Maccas on 'coolest' street",
        "publish_date": "Thu, 10 Jul 2025 04:12:20 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "The Melbourne street voted the world's coolest is about to become the scene of a David and Goliath battle as Northcote residents and business owners fight plans for a new McDonald's on High Street, saying it will ruin the character, and the vibe.\n\nThe proposed 24-hour fast-food outlet has sparked concerns about its potential effects on existing businesses and the overall atmosphere of the popular street.\n\n\"We wouldn't call McDonald's a cool shop,\" local trader Nina Bondarenko said.\n\nMcDonald's wants a 24-hour restaurant on High Street in Melbourne. (Nine)\n\n﻿ David Norton, another resident, echoed these sentiments.\n\n\"I think being a bigger, fast food, corporate in my opinion doesn't fit in with the vibe of the area,\" he said.\n\nMcDonald's says the new restaurant would create more than 100 jobs. However, critics argue that the fast-food chain could drive out smaller, independent businesses.\n\n\"It would actually, probably divert a lot of customers to the quick fix food option instead of going to the usual kebab shops, the Japanese shops,\" Ms Bondarenko said.\n\nThe proposed 24-hour opening time for the McDonald's is also a point of contention.\n\n\"Running a pub, you know, nothing good happens after about 1am. So you really don't want lots of activity late at night,\" local pub manager Ben said.\n\nThe local council is expected to make a decision on the application in the coming months.\n\nSimilar community opposition has proven successful in preventing McDonald's restaurants from opening elsewhere in Victoria.\n\nLast year, the Mt Evelyn community successfully opposed a similar proposal, and in 2013, residents of Tecoma also campaigned against a McDonald's development.\n\n\"There'll be a lot of fighting,\" Ms Bondarenko said.\n\n\"We want to help small business, keep their diversity, their beautiful individual interests going.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/hundreds-of-amazon-packages-mistakenly-shipped-to-womans-home-for-over-a-year/2b4f79e7-4d4e-4682-9346-1ce3d469c640",
        "title": "'It's been hell': Hundreds of packages mistakenly shipped to woman's home",
        "publish_date": "Thu, 10 Jul 2025 01:25:19 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "It's an Amazon nightmare. Imagine hundreds of oversized packages appearing on your doorstep, and you have no clue why. You never ordered them.\n\nYet, the shipping spree to your street continues for more than a year. That's what happened to a woman in San Jose, California.\n\nHer frustrating scenario is linked to an overseas online seller who appears to be violating Amazon's return policy.\n\nIt's an Amazon nightmare. Imagine hundreds of oversized packages appear on your doorstep -- and you have no clue why. You never ordered them. (CNN)\n\n\"Kay\" (not her real name) is utterly confused as to why scores of these large boxes filled with car seat covers keep appearing at her doorstep. She says it's non-stop.\n\nThe mystery \"shipping spree\" is now haunting half of her car port.\n\n\"What you see now is a fraction, because I have refused delivery on more packages than you see here,\" Kay said.\n\nInside each package is a set of faux-leather car seat covers from a Chinese online seller called \"Liusandedian.\"\n\nThe online seller's Amazon listing advertises the brand Etkin, selling seat covers supposedly made to fit various makes and models of sedans and SUVs.\n\nBut as you can see from Kay's house, the covers didn't fit and consumers said they were forced to pay out of pocket to return them to the company's \"return centre\".\n\nOne person commented online: \"Why haven't I received my refund? Was sent thru UPS 3 weeks ago.\"\n\nYet, little do they know - they're just piling up in Kay's garage.\n\nREAD MORE: Donald Trump blindsides seven more nations with tariff letters\n\nKay says she's contacted Amazon countless times to try and resolve this over the past year, including filing six complaint tickets. (AP)\n\nIn part because the online seller put Kay's address on their return labels, leaving her stuck in this mess.\n\nMeanwhile, reviews indicate consumers are stuck without their refunds. In one case, a viewer wrote: \"It's going to cost me $US124 ($189) to return this item!!!\" - an item that she already paid at least $US129 for.\n\n\"Oftentimes, what it costs to return it is about more than 50 per cent of what they paid for it,\" Kay said. \"Plus, these consumers aren't getting their money back!\"\n\nKay says she's contacted Amazon countless times to try and resolve this over the past year, including filing six complaint tickets.\n\n\"And every time I was absolutely assured this will stop... you won't get any more of these packages, you'll hear from us in 24, 48 hours...\" Kay said she was even offered a $US100 Amazon gift balance.\n\nNope. Each month, she says, they just kept coming.\n\n(FILE IMAGE) They blocked her driveway, mail carrier and doorway, making it hard for her 88-year-old mother, who is disabled. (Getty)\n\nThey blocked her driveway, mail carrier and doorway, making it hard for her 88-year-old mother, who is disabled.\n\n\"When we come home, it was like this,\" Kay said pointing to the packages crowding her doorstep. \"I couldn't even get my mother in the house...it's just been another form of hell.\"\n\nAnd to make matters worse, she says Amazon put the onus on her to fix the issue -- suggesting she give the packages away, donate them, or take them back to USPS and FedEx.\n\nHowever, Amazon denies encouraging Kay to return boxes to USPS or FedEx.\n\n\"Why is it my responsibility to get rid of this, when your seller is not following your rules Amazon?\" she asked.\n\nAccording to Amazon's policy, international sellers must either provide a US address to which to send the return, issue a \"returnless refund\" where the buyer does not have to ship the product back, or provide a pre-paid international shipping label within two days of the return request.\n\nIf sellers don't respond within that timeframe, Amazon may refund the customer on the seller's behalf and charge the amount to the seller.\n\nREAD MORE: Mum and daughter evicted from Bondi apartment after 40 years\n\nAmazon also requires that third-party sellers on its marketplace platform display a physical mailing address on their profile, but does not specify that it needs to be within the US. (Getty)\n\nThat means \"Liusandedian\" would have to lose all proceeds from the sale or pay return shipping to China. Pretty pricey!\n\nAmazon also requires that third-party sellers on its marketplace platform display a physical mailing address on their profile, but does not specify that it needs to be within the US.\n\nSo instead - consumers get stuck with the bill.\n\n\"This is thousands of dollars they've paid to send these boxes back to my house!\" Kay said as she pointed to the pile as tall as her BBQ.\n\nMore than 40 per cent of Liusandedian's Amazon reviews have a one-star rating.\n\nAnd unlike other companies, this one has no way for consumers to contact them if an issue like this comes up.\n\nNot to mention, there's no trace of a website online showing this seller exists.\n\nWe asked Amazon what they're doing to resolve this, and if there's any vetting process to determine if companies selling on their platform actually are who they say they are.\n\nWhile we didn't get a direct answer, the tech giant told us: \"We'd like to thank (CNN affiliate) ABC 7 On Your Side for bringing this to our attention.\n\n\"We've apologised to the customer and are working directly with her to pick-up any packages while taking steps to permanently resolve this issue.\"\n\nAnd finally, after a year of waiting, some good news for Kay.\n\nThe company removed all the packages on her property this morning, vowing to crack down on these practices.\n\n\"I am so eternally grateful that you guys are here for us... because reaching out to you, I was in tears that somebody actually got back to me... after a year of trying to get somebody to just listen to me,\" Kay told 7 On Your Side's Stephanie Sierra.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/woolworths-expands-rollout-of-digital-supermarket-trolleys-after-successful-trial/12c4afca-f0a9-44cb-b035-6d8e6e873bfc",
        "title": "Huge change coming to your supermarket aisle",
        "publish_date": "Thu, 10 Jul 2025 04:03:58 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Woolworths is expanding its digital supermarket trolley rollout, allowing thousands of customers to track their spending in real-time.\n\nScan&Go trolleys will be introduced to select stores in New South Wales , Victoria and Queensland from today.\n\nThe trolleys were first introduced across 10 stores in NSW in August last year as a part of trial.\n\nREAD MORE: Massive new outlet shopping centre just months away from opening in Sydney ﻿\n\nWoolworths is expanding the roll-out of its digital supermarket trolley, allowing thousands of customers to track their spending in real-time. (Woolworths)\n\nShoppers with an Everyday Rewards card can unlock ﻿a tablet-style device from a charging wall at the front of the store and attach it to their trolley to start shopping.\n\nThe device will allow shoppers to track their spending in real-time and pack their groceries as they go.\n\nWhen shoppers are ready to check out with the trolleys, they will be able to head to the self-service checkout to pay for their shop.\n\nShoppers with an Everyday Rewards card can unlock ﻿a tablet-style device from a charging wall at the front of the store and attach it to their trolley. (Woolworths)\n\nThe digital trolleys were first rolled out at 10 NSW stores including Kellyville, Kellyville Grove, Kellyville North, Lane Cove, North Parramatta, Oran Park, Schofields Town Centre, The Ponds, Warringah Mall and Windsor.\n\nThis month, the trolleys will launch at Woolworths supermarkets in Neutral Bay Village, Richmond, Menai, Mortdale, Revesby, Hornsby, Rutherford, Kotara, Green Hills and Erina.\n\nIn Victoria, the digital supermarket trolleys will be available this month at Chirnside Park, Malvern, Mornington East, Rye, St Helena and Thrift Park.\n\nThe Moonee Ponds store will receive the trolleys in September.﻿\n\nEight Queensland stores will receive the trolleys this month, including Burleigh Heads, Caloundra, Capalaba Park, Currimundi, Nambour, Noosa, Northlakes and Warner.\n\nFollowing the success of Scan&Go, Coles announced a trial of digital Smart Trolleys to \"help shoppers save time, manage their budgets and checkout faster\" in partnership with Instacart in November last year.\n\n\"Our customers have responded positively to the Smart Trolley shopping experience, praising its real-time spend tracking to manage their budget, the convenience of packing as they shop, and the ability to streamline the checkout process so they can pay on the trolley and go,\" a spokesperson said.\n\nThe smart trolleys are currently being trialled at Coles Richmond Traders in Melbourne. ﻿﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/trumps-tariff-war-with-brazil-opens-gate-for-australian-beef/105517762",
        "title": "Trump's tariff war with Brazil opens gate for Aussie beef",
        "publish_date": "Fri, 11 Jul 2025 01:56:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "United States President Donald Trump has announced plans to impose a 50 per cent tariff on all imports from Brazil — a nation that is currently its number one supplier of beef.\n\nIn a letter to Brazil's president, Mr Trump said the tariffs were \"due in part to Brazil's insidious attacks on free elections\" and claimed the treatment of former president Jair Bolsonaro was a \"witch-hunt\" and \"international disgrace\".\n\n\"[However], there will be no tariff if Brazil, or companies within your Country, decide to build or manufacture product within the United States,\" Mr Trump wrote.\n\nThe tariffs are due to take effect on August 1.\n\nBrazil, led by Luiz Inacio Lula da Silva, is a significant trading partner of the US. (Reuters: Adriano Machado)\n\nUS-based Global AgriTrends meat analyst Brett Stuart said for Brazil's beef industry, the proposed 50 per cent tariff would become an import tax of 76.4 per cent, as it already incurs a 26.4 per cent duty once it exports more than 65,000 tonnes — a quota that was triggered in late January.\n\n\"In May this year, Brazil exported a record amount of beef into the US despite the 26.4 per cent tariff, plus Trump's 10 per cent [Liberation day tariff],\" he said.\n\n\"But at 76 per cent that is just untenable, that's unworkable.\n\n\"If Brazil doesn't find a way out of this by August 1, Brazilian beef exports to the US will halt.\"\n\nMr Stuart said Australia would be an obvious winner if Brazil bowed out of the US market.\n\n\"I think overnight, Australian and New Zealand beef prices will see sharp demand … the phones are going to be ringing if this happens,\" he said.\n\nLoading...\n\nThe US cattle herd is at its lowest level since the 1950s because of drought and US beef prices are at record highs, which has seen its reliance on imports climb.\n\n\"Right now, if you look at the price of lean beef in America versus the imported product from Australia, there's a discount,\" Mr Stuart said.\n\n\"But if Brazilian beef is no longer flowing into the US that discount would vanish quickly because American importers would be turning aggressively to Australia and others.\n\n\"I don't think we'll see a big shift in bids for Australian beef next week, but if that August 1 deadline passes and Trump says it's on, that could change quickly.\"\n\nLean beef prices are at record highs in the US. (ABC Landline)\n\nRecord Australian beef exports\n\nAustralia is already processing a record amount of cattle and producing a record amount of beef this year.\n\nAccording to Meat and Livestock Australia (MLA), a record 134,593 tonnes of beef was exported last month and year-to-date Australia has exported 702,218 tonnes, which is up 17 per cent on this time last year.\n\nThe biggest customers this year have been the US (203,072 tonnes up 31 per cent), followed by China (147,391 tonnes up 39 per cent).\n\nChina has still not renewed export licences to about 300 abattoirs in the US and has been buying plenty of Australian beef instead.\n\nAnd it might soon find itself ramping up orders of Brazilian beef.\n\n\"If Brazil loses the US market, Chinese importers are going to be getting a deal on Brazilian beef,\" Mr Stuart said.\n\nChina has ramped up its imports of Australian grain-fed beef. (ABC Landline)\n\nUS consumers paying more\n\nThe US imported $US42.3 billion ($A64.2 billion) worth of Brazilian goods in 2024.\n\nAccording to Reuters, the tariffs on Brazil could have a significant impact on US food prices — and coffee.\n\n\"Around a third of the coffee consumed in the US, the world's largest drinker of the beverage, comes from Brazil\" it said.\n\n\"A tariff of that size would all but shut down that flow. Brazil will sell its coffee elsewhere.\"\n\nMore than half of the orange juice sold in the US also comes from Brazil.\n\nUS beef prices are already at record highs and Mr Stuart said a tax on imported Brazilian beef would not help.\n\n\"The irony here is that one of the major meat packers in America is Brazilian-owned (JBS) and it could make the argument [to Trump] that it's already invested heavily in America,\" he said.\n\n\"So let's see — Brazil has three weeks to cut a deal.\"\n\nWatch ABC TV's Landline at 12:30pm on Sunday or on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/mother-daughter-to-compete-on-world-stage-in-dragon-boating/105495102",
        "title": "Mother and daughter dragon boaters to compete on world stage",
        "publish_date": "Fri, 11 Jul 2025 01:05:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "A New South Wales Central Coast mother and daughter, who share a love for dragon boat racing, will take part in the sport's world championships later this month.\n\nPortia Roberts, 18, has been competing in the sport for the past six years, inspired by her mother Justine.\n\nAs a young girl, Portia would watch her mother and grandmother enjoy the sport, but was too young to join in herself.\n\n\"I'd sit … with a little stick and a drum, which was a bucket, and I'd hit the bucket and I'd have a blast,\" she recalled.\n\n\"Then I turned 12 and I got in the boat and I'd sit either next to Mum or Nan and I'd play with my hair, do everything but paddle … at some point I started to lock in.\"\n\nFast forward eight years and the year 12 student will join her mum competing in dragon boat racing at an international level.\n\nPortia Roberts trains on the water in Sydney five times a week. (Supplied: Justine Roberts)\n\nAcross the generations\n\nJustine's involvement in dragon boating began in 2017, after she landed a local job in Gosford, cutting out her daily commute to Sydney.\n\n\"That freed up a whole lot of time … so I was looking for a sport,\" she said.\n\nA colleague mentioned the local dragon boat club was having a \"come and try day\" and it wasn't long before Justine was hooked.\n\n\"I had found my home, and it was great,\" she said.\n\nPortia Roberts is the captain of the under-18s team for Australia. (Supplied: Melanie Lloyd)\n\nIt didn't take long for her family to follow suit.\n\n\"[My husband] got involved because he saw I was having a good time, and he was curious,\" Justine said.\n\n\"Then my mum, at 73, and her partner came down and they enjoyed it.\n\n\" At one stage we had three generations in the crew. \"\n\nJuggling sport and school\n\nJust like her other family members, Portia picked up dragon boating and her potential in the sport was obvious early on.\n\nAt 15, she was selected for a NSW representative team, where she was spotted by a national coach.\n\n\"That's when I realised I could be competitive in this,\" she said.\n\nThis year will be Portia's second time competing in the Dragon Boat Racing World Championships, made more special this time as she will captain the under 18s team.\n\nThe year 12 student is juggling the demands of the sport with school, as she studies for her Higher School Certificate.\n\nLoading...\n\nAt 4:30am, when most teenagers are tucked away in bed, Portia rises to complete her strength and conditioning training and commutes to Sydney five afternoons a week, after school, to train on the water with her team.\n\n\"There's a lot of overhead lifting, a lot of core workouts,\" she said.\n\n\"Heavy weights … [your] upper body strength has got to be insane.\"\n\nPortia still finds time to study in between her training sessions.\n\n\"It's definitely a balancing act … studying in the car on the way to training,\" she said.\n\n\"It's a lot but I'm juggling [it], it's good.\"\n\nJustine said she couldn't be more proud of her daughter.\n\n\" Her dedication, perseverance, it hasn't come easily but nothing worthwhile ever does … she certainly inspires me. \"\n\nPortia Roberts represented Australia at the world championships in Thailand in 2023. (Supplied: Justine Roberts)\n\nMum's first time\n\nJustine said it was her first time competing at the world championships.\n\nShe will compete in the Australian Paradragons crew, as one of the unimpaired athletes in a team that's split 50–50 with impaired competitors.\n\n\"To be able to paddle with people that transform adversity with every stroke is inspiring … they're just incredible athletes,\" she said.\n\nLike her daughter, Justine is also juggling the sport with her job as a nurse.\n\n\"I'm a shift worker so I never know what day it is … going to the gym after night shift, I'm a little bit fatigued,\" she said.\n\nJustine will be flying the Australian flag with pride, as they take on the world's best.\n\n\" Never did I ever think I would be good enough to represent my country, it's just so overwhelming. \"\n\nThe 17th World Dragon Boat Racing Championships will take place in Brandenburg an der Havel, Germany from July 14 to 20.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/first-guardian-investors-lose-super-should-you-be-worried/105517220",
        "title": "First Guardian investors may lose their super. Should you be worried about yours?",
        "publish_date": "Fri, 11 Jul 2025 00:50:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Investors in the collapsed First Guardian fund may struggle to recover their superannuation savings.\n\nIn the wake of this, many Australians may be concerned about their own retirement savings and whether they could be at risk.\n\nHere's what happened at First Guardian and how super savings are generally protected in Australia.\n\nWhat happened at First Guardian?\n\nUp to $446 million of people's superannuation may have been lost by a managed investment scheme, First Guardian Master Trust.\n\nAccording to the Australian Securities and Investments Commission (ASIC), investments were made into First Guardian by about 6,000 investors through superannuation platforms:\n\nDiversa\n\nNetwealth\n\nEquity Trustees\n\nASIC understands that many of those investors were called by lead generators who used high-pressure sales tactics to allegedly lure them to transfer their super into a choice fund, and then invest in First Guardian.\n\nFirst Guardian investors to lose super Photo shows A Lamborghini the company purchased in January 2023 for $548,000. Six thousand First Guardian investors have been told by the fund's liquidator there may be insufficient funds to pay back the superannuation funds they invested.\n\nFalcon Capital is the responsible entity for First Guardian and is now in liquidation.\n\nLiquidators from FTI Consulting say the case will take at least a year to resolve and that they may never recover a dollar of their superannuation savings.\n\nHowever, the liquidator has flagged that they would give people who invested \"priority\" treatment in trying to recover their funds if they paid them a fee.\n\nFTI Consulting suggested that Falcon funnelled investors' money into \"property developments and equity positions in related companies that may have shared a common director with the company\".\n\nSuper Consumers CEO Xavier O'Halloran says it is important for Australians to understand that what has collapsed is not a super fund but rather a managed investment scheme.\n\nThis means it's not regulated by the Australian Prudential Regulation Authority (APRA), which oversees the stability and transparency of super funds.\n\n\"These are investment options that have failed, rather than the super funds that put these investment options on their shelves,\" Mr O'Halloran said.\n\n\"Think of an investment option like a brand of cereal in a supermarket or in this case the super fund's shelf.\"\n\nLoading...\n\nIs any compensation available?\n\nThere is a compensation scheme that provides a small amount of protection when people suffer financial loss, like those from First Guardian.\n\nHowever, it's capped at $150,000 to consumers who have an unpaid determination from AFCA.\n\n\"Typically a retiree can expect to retire with closer to $250,000, so that could create a massive hole in people's retirement plans,\" Mr O'Halloran said.\n\nThe Compensation Scheme of Last Resort (CSLR) is an independent body, established under legislation by the government to support the victims of financial misconduct.\n\nHow to assess investment options and super performance\n\nWhen investing your super, Mr O'Halloran said there were far more protections on investments labelled as \"MySuper\".\n\n\"These investments have to be designed to meet the needs of most members of a super fund and are performance tested annually by the regulator.\n\n\"If they fail the performance test once, they have to let you know, which is a big red flag and you should consider whether to stay.\n\n\"If they fail a second time they aren't allowed to take on new members until they can solve the problem, usually by merging with a better fund.\"\n\nIf you have a MySuper account, you'll likely either have a:\n\nSingle diversified investment option: Fund puts your money in a standard mix of investments, and this approach stays the same for your whole life\n\nFund puts your money in a standard mix of investments, and this approach stays the same for your whole life Lifecycle investment strategy: Fund typically moves your money from growth investments when you're young to more conservative when you're older\n\nThe YourSuper comparison tool helps you compare super funds based on their performance.\n\nHow much super should I have? Photo shows A pink piggy bank sits on a pile of Australian money Having an idea about the average super balance in Australia for your age can help you take the necessary steps to boost any shortfall.\n\nBut the First Guardian case highlights there are also big gaps in protection, Mr O'Halloran said.\n\n\"Some other investment options are independently tested by the regulator, but First Guardian and any other products not designed by the super fund offering them typically aren't tested,\" Mr O'Halloran said.\n\n\"Investment options designed for retirees are also not tested.\n\n\"This is a massive gap the federal government needs to plug if they are serious about protecting the retirement savings of Australians.\"\n\nThe warning signs\n\nASIC deputy chair Sarah Court says there are a number of red flags to look out for when it comes to sales calls about switching super.\n\n\"The initial salespeople can be very persuasive. Often the underlying schemes are complex or not made clear to the consumer, and it may be very difficult for even experienced investors to spot problems,\" Ms Court said.\n\n\"The caller will seemingly have your best interests at heart and may also involve referrals to financial advisers during the call to create a sense of comfort and legitimacy.\n\n\"Consumers should always ask questions about salespeople's connections to funds, particularly in circumstances where a particular fund appears in the pitch, as there may be a commission arrangement.\"\n\nHere are the common warning signs:\n\nHigh-pressure sales tactics\n\nCold calls\n\nThe touting of free superannuation \"health checks\" and prizes (often via social media advertisements or websites)\n\nOffers to find and consolidate \"lost super\" for free\n\nThe involvement of unlicensed people in the advice process\n\nPredominant engagement over the phone with limited client contact with a financial adviser\n\nPoor or no product disclosure\n\nPromises of high or unrealistic returns\n\nASIC alleges First Guardian used high pressure sales tactics to convince investors to transfer their super. (Supplied)\n\nSpeaking with ABC Radio Melbourne, stock market specialist Remo Greco from Sanlam Private Wealth says if you're being hassled to invest, \"get good at saying no\".\n\n\"If it seems too good to be true, it probably is.\"\n\nAre collapses like this common?\n\nOver the last year or so, there have been two other big collapses of these investment options.\n\nThey are:\n\nShield Master Fund: $480 million in assets and 5,800 investors\n\n$480 million in assets and 5,800 investors Australian Fiduciaries: $160 million in assets and 600 investors\n\nThe combined total losses, including First Guardian, could total $1.2 billion from over 12,000 Australians.\n\nWhere can I check my superannuation balance?\n\nYou can check your super balance, combine accounts, and search for lost super by logging into your myGov account and then clicking on Australian Taxation Office (ATO) under linked services.\n\nHow your super is invested Photo shows Two hands hold a light-pink ceramic piggy bank full of coins. Small improvements in your superannuation's performance or fees can make a significant difference in retirement.\n\nTo manage super in your ATO online account, you can follow these steps:",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/man-arrested-over-racial-abuse-of-basketballer-montrezl-harrell/105520520",
        "title": "Man arrested over alleged racial abuse of NBL star Montrezl Harrell",
        "publish_date": "Fri, 11 Jul 2025 00:40:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "A man who allegedly racially abused NBL star Montrezl Harrell via social media has been charged following what authorities have described as the \"first-ever successful arrest\" for such an offence in Australian basketball.\n\nIn a statement, Basketball Australia (BA) said the accused, a 37-year-old man from the Melbourne suburb of Huntingdale, was arrested by Victoria Police Wednesday last week.\n\nPolice allege the messages were sent directly to the Adelaide 36er's personal social media account following a match against Melbourne United at John Cain Arena on Sunday, November 17.\n\n\"These messages were sent from an anonymous account, with officers working to identify the sender since the matter was referred to Victoria Police,\" police said.\n\nSeveral fans were ejected during that match following an altercation with 36ers players, but police said the man was \"not connected to any\" of those fans.\n\nHarrell joined the Adelaide 36ers in 2024. (Supplied: ESPN)\n\nPolice said the accused had been \"charged with using a carriage service to menace, harass and/or offend\" and had been bailed to appear at Moorabbin Magistrates' Court on August 15.\n\nIn a statement released on Friday, BA said the arrest had been made after its integrity unit reported the incident to police.\n\nBA said it was the \"first-ever successful arrest of a person in Australian basketball on charges of racially abusing an athlete via social media\".\n\n\"This is a landmark moment in strengthening the measures available to BA and the NBL, alongside legal authorities, to safeguard and protect athletes in all areas of public access,\" BA said in a statement.\n\nThe 36ers confirmed the arrest involved alleged abuse against one of its players.\n\n\"The Adelaide 36ers commend Victoria Police and Basketball Australia's Integrity Unit for their strong stance in pursuing this matter,\" it said in a statement.\n\nPrior to joining the Adelaide 36ers, Harrell had played for several sides in the NBA. (Supplied: ESPN)\n\nThe club said Harrell, a former NBA player, had been made \"aware of the arrest and is comfortable with the way the matter has been handled\".\n\n\"The club will continue to call out racism and remains committed to ensuring it provides and is part of an inclusive, welcoming and safe environment for players, staff and fans,\" it said.\n\nIn October, Harrell posted on social media about separate racial abuse he had allegedly been subjected to — also from an anonymous account.\n\nThe abuse was sent directly to his social media account and BA's integrity unit was also notified of that incident.\n\nA spokesperson for BA said the arrest highlighted the fact that \"there are laws in place to govern appropriate behaviour towards athletes\".\n\n\"The individuals targeted by hateful messages are human, and Basketball Australia commends the courage it takes to call out this behaviour,\" the spokesperson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/england-vs-india-third-test-day-one-gets-underway/105520564",
        "title": "Root fires for England as third Test against India gets underway at Lord's",
        "publish_date": "Fri, 11 Jul 2025 00:39:59 +0000",
        "category": "sports",
        "authors": [],
        "text": "Joe Root's patient unbeaten 99 has led England to 4-251 on a compelling first day of the third Test against India at Lord's.\n\nWith the series level at 1-1 after two high-scoring matches, England won the toss in ideal batting conditions but lost openers Ben Duckett (23) and Zak Crawley (18) cheaply.\n\nRoot and Ollie Pope (44), however, adopted a risk-free approach to rebuild the innings.\n\nEngland captain Ben Stokes made 39 not out to leave the match finely poised.\n\n\"We want to be a team that is positive and entertaining, but we want to play to the situation,\" Pope said.\n\n\"Our [batting] order is pretty fast scoring on our good days. We all know we can score hundreds off 120 balls, but we need to dig in off this sort of surface.\"\n\nEarlier, Stokes won the toss under clear skies and would have expected his top order to take full advantage.\n\nIndia won the second Test by 336 runs to level the series without pace spearhead Jasprit Bumrah.\n\nBumrah bowled a probing opening spell at Lord's as the touring side rode the momentum of their excellent performance at Edgbaston.\n\nCrawley drove Akash Deep sweetly to the cover boundary before greeting Mohammed Siraj to the attack with another crisp hit through the off side.\n\nBut neither Crawley nor Duckett looked comfortable on a slow pitch.\n\nImmediately after the drinks interval, Nitish Kumar Reddy struck in his first over when Duckett was dismissed, playing a loose stroke to a ball down the leg side and feathering a catch to wicketkeeper Rishabh Pant.\n\nPope was dropped off his first ball, a very hard chance to Shubman Gill at gully, before Reddy squared up Crawley with a fine delivery and he edged it to Pant.\n\nA packed Lord's crowd was stunned into near silence as India celebrated wildly and Reddy continued to extract movement off the pitch as England laboured to 2-83 at lunch.\n\nRoot reached his 67th Test half-century to go with 36 hundreds for England's leading all-time run scorer, the milestone coming off 102 balls and including seven fours.\n\nIndia was dealt a blow when the free-scoring Pant was forced off the field with a finger injury but Pope was out to the first ball after tea, driving loosely at spinner Ravindra Jadeja and nicking the ball to stand-in keeper Dhruv Jurel.\n\nWhen Bumrah speared in a rapid ball that clipped the top of Harry Brook's off stump to send the in-form batter back to the pavilion for 11 with England on 4-172, India sensed it was back in the ascendancy.\n\nBut Root continued to bat smoothly and found a reliable partner in Stokes, the experienced pair defying the tiring Indian bowlers and keeping the scoreboard ticking over in the evening sunshine.\n\nRoot tried to complete his 37th Test century before the close but was unable to do so.\n\nHe will return on Friday when England will aim to put pressure on India by posting a commanding first-innings total.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/kimberley-indigenous-remote-hospitality-workforce/105509460",
        "title": "Remote resort jobs changing lives of Indigenous workers",
        "publish_date": "Fri, 11 Jul 2025 00:31:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Cameron Victor is \"shaking a little\" as he strums his guitar for customers dining at a resort in far northern Western Australia.\n\nToday he's on stage, but on any other day you can find him in the kitchen, prepping food and washing dishes.\n\n\"The show must go on,\" he says.\n\nCameron was also \"pretty nervous\" when he re-entered the workforce as a kitchen hand at Lily Lagoon, but his \"suck it up and smash it\" attitude helped him through.\n\nGetting a job as a kitchen hand gave Cameron Victor and his family new opportunities. (ABC Kimberley: Giulia Bertoglio)\n\nThe Kununurra resort offers employment and training to local Indigenous people.\n\n\"Life has been pretty hard for me — growing up and hanging with the wrong crews, I've been down some sad roads before,\" Cameron says.\n\n\" This is a life-changing opportunity for me and my family. It gave me a brand-new start. \"\n\nSeventy per cent of employees at Lily Lagoon are Indigenous. (ABC Kimberley: Giulia Bertoglio)\n\nFor Cameron, the job represents a second chance after a prison term.\n\nFor others, including Miriwoong woman Shartne Duncan, the resort offers a first taste of employment.\n\nHer experience as a barista helped her find employment elsewhere, but now she's back as a housekeeper and wants to train as a receptionist.\n\n\"You wouldn't know what to do at first, but once you get the hang of it it just goes as a routine,\" Sharnte says.\n\n\" It's the best feeling you'll ever have, even if you never worked before. \"\n\nSharnte says she has never felt afraid to ask for help from her colleagues. (ABC Kimberley: Giulia Bertoglio)\n\nFor the money and for the soul\n\nThe men in the maintenance crew share laughs and a love for motors.\n\nOne of them, Trason Simon, 17, bought an electric scooter with his first pay.\n\nTrason got a job with the maintenance crew at Lily Lagoon after he decided to leave school. (ABC Kimberley: Giulia Bertoglio)\n\nHe got a job at the resort after he dropped out of school, which has inspired some of his friends who aren't working or studying.\n\n\"Some of the boys saw me getting a job and they got jobs — they just need a bit of a push from the homies, from the brothers,\" Trason says.\n\n\"Life's just boring staying home, not getting up to much, humbugging family.\"\n\nGetting a job also \"dramatically changed\" the life of one of Trason's colleagues, Tremayne Reid Ryder.\n\nTremayne working on the resort's grounds. (ABC Kimberley: Giulia Bertoglio)\n\n\"I wasn't in a good place when I wasn't working. Then I started working and things started coming good,\" Tremayne says.\n\nBut he says employment is not the most obvious path for those stuck in a cycle of disadvantage and trauma.\n\n\"Our Indigenous people aren't exposed to this sort of stuff,\" Tremayne says.\n\n\" They want to point the finger, but for non-Indigenous people it's a bit easier when you've grown up around that sort of life. \"\n\nJobs for locals\n\nLinking local workers with the regions's hospitality and tourism businesses, which perennially struggle for staff, is a long-running goal for many Kimberley community groups.\n\nPrue Jenkins, the chief executive of Lily Lagoon operator Wunan, says helping local Indigenous people join the workforce boosts the wider community.\n\n\"The hospitality industry has been staffed largely by backpackers or visa-holders coming through, which accommodates the seasonal nature of the employment,\" she says.\n\n\" However, we want local people coming into these jobs. \"\n\nPrue says Lily Lagoon is not just an employer but \"a pipeline for local talent to come through to other jobs\".\n\nPrue Jenkins hopes more Indigenous people can gain the skills and confidence to get tourism and hospitality jobs. (ABC Kimberley: Giulia Bertoglio)\n\nIndigenous workers account for 70 per cent of the resort's staff and many of them are assisted by Job Pathways, which connects jobseekers and employers.\n\n\"What we see is a skills gap. Closing that skills gap sits at the heart of this program,\" Job Pathways interim chief executive Henrik Loos says.\n\nLily Lagoon has been federally funded for three years for 17 positions under the Remote Jobs and Economic Development Program (RJED).\n\nThe program, which creates 3,000 remote jobs across Australia, replaces the old Community Development Program, which failed to reduce high unemployment.\n\nSenator Malarndirri McCarthy visiting Lily Lagoon, one of the government's remote jobs trial sites. (ABC Kimberley: Giulia Bertoglio)\n\nHenrik thinks better mentoring can help keep people in jobs.\n\n\"The new program is much more tailored towards the industry-specific needs,\" he says.\n\n\"Therefore, we believe it will be much more successful.\"\n\nHenrik says employment services should meet the needs of jobseekers and employers. (ABC Kimberley: Giulia Bertoglio)\n\nBut there are also some barriers that make workers drop out.\n\n\"Providing a lot of the wraparound supports is absolutely critical,\" Prue says.\n\n\"So the first thing we look at is 'does that staff member have safe accommodation locally?'\"\n\nAfter ensuring secure accommodation for staff, Wunan also looks at transport options.\n\nSome employees use the bus, but others are given a bike, assistance to gain a drivers licence and financial counselling to save up for a car.\n\nA workplace of belonging\n\nGrowing confidence is as important as building skills and the resort aims to provide a work environment Sharnte describes as \"comfortable, like family\".\n\nSharnte says getting a job and help securing accommodation has made her feel proud and hopeful. (ABC Kimberley: Giulia Bertoglio)\n\nShe is proud of having a customer-facing job and hopes it inspires others in her community to work in hospitality.\n\n\"When other people see a local working in a big place like this, it makes them feel excited and happy,\" Sharnte says.\n\n\" Future-wise, I hope I see young people like me working here, to make them feel good on country. \"\n\nEmploying locals has helped to boost the community as a whole. (ABC Kimberley: Giulia Bertoglio)\n\nCameron found his happy place in the kitchen.\n\n\"Sometimes our fears just hold us back,\" he says.\n\n\"I say to those people, 'Just give it a go. You never know until you give it a go.'\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/william-cooper-remembered-by-next-generation/105454538",
        "title": "William Cooper, 'father of NAIDOC', remembered by the next generation",
        "publish_date": "Fri, 11 Jul 2025 00:12:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Alf Turner, known to the Yorta Yorta community as Uncle Boydie, has seen with his own eyes what the past century has brought for his country and its people.\n\nAboriginal and Torres Strait Islander readers are advised that the following story contains images of people who have died.\n\nThe 96-year-old remembers hiding from a black car driven by authorities, fearing he would be taken away like so many other children.\n\nHe remembers the leeches the community would collect on the banks of the Murray River in what is now the Barmah National Park, which were later sold to the local hospital for bloodletting.\n\nUncle Boydie has spent most of his life in Barmah, Victoria, close to where his grandfather was born. (ABC Shepparton: Alice Walker)\n\nHe remembers river red gums sent on barges to become railway sleepers, and Murray cod as long as your arm packed and sent to the Melbourne fish markets.\n\nAnd he remembers the hive of activity that was his grandfather William Cooper's house in 1930s Footscray, where Mr Cooper was holding some of the first meetings of Aboriginal people discussing First Nations rights at a national level.\n\n\"He was always on the go, busy man,\" Uncle Boydie said.\n\n\"He was my grandfather, and I'm just so lucky that I was able to live with him for part of my life and meet all the people that came to the meetings, and help him fight in those days for what they needed to have.\"\n\nWilliam Cooper (shaking hands, right) founded the Australian Aborigines' League. (Supplied: David Jago)\n\n'Father of NAIDOC'\n\nWilliam Cooper was a renowned Yorta Yorta activist and founder of the lobby group the Australian Aborigines' League, which called for \"a fair deal for the dark race\".\n\nHe is perhaps most famous for drawing up a petition in the 1930s to the then king of England calling for an Aboriginal representative in the federal parliament, and for protesting to the German consulate about the treatment of Jewish people following Kristallnacht.\n\nThe 1938 Day of Mourning was proposed by Wliliam Cooper. (Supplied: Monash University)\n\nHe is also the only individual credited in the official history of NAIDOC Week on the organisation's website.\n\nMr Cooper and fellow activists were responsible for the Day of Mourning on January 26, 1938, which evolved into a string of events that would eventually become NAIDOC Week.\n\n\"They call Grandfather [Cooper] the 'father of NAIDOC,'\" said his great-great-grandson David Jago.\n\n\" It's another way that his leadership still hangs around in the things that are going on today. \"\n\nMr Cooper stood down from the league as his health failed and returned to Yorta Yorta country, where he died in 1941.\n\nWilliam Cooper with three of his children: Sally, Lynch and Gillison. (Supplied: David Jago)\n\nCarrying on his legacy\n\nFor NAIDOC's 50th anniversary, this year's theme The Next Generation: Strength, Vision and Legacy is close to home for Mr Cooper's descendants.\n\nMr Jago has spent a lot of time researching his ancestor's life, and said it was a big responsibility.\n\n\"Aboriginal culture, it's all about your ancestors and your elders, and telling Grandfather's story … [it's] something that's an honour but it's also an obligation,\" he said.\n\nDavid Jago wants to see a bigger place in society for First Nations values of caring for country and respecting elders. (ABC Shepparton: Alice Walker)\n\nUncle Boydie has carried his grandfather's legacy by completing some of the tasks he set out to do — finally delivering the petition's message to the British monarch, and travelling to Germany to communicate Cooper's solidarity with the Jewish people.\n\n\"It meant a lot not only to the people that we were there for, but for me to carry on … what Grandfather did — [it's] pleasing to me for the rest of my days,\" he said.\n\nThe next generation\n\nMelbourne's William Cooper Justice Centre and the federal electorate of Cooper bear witness to the late Yorta Yorta leader's legacy.\n\nMr Jago and Uncle Boydie also carry their ancestor's torch in a relationship with another centre that bears his name: the William Cooper Institute at Monash University.\n\nWilliam Cooper is honoured with a statue in Shepparton, on Yorta Yorta country. (ABC Goulburn Murray: Callum Marshall)\n\nMr Cooper was passionate about literacy and education, and taught himself to read word by word.\n\nNow there is a scholarship in his name, and the centre focuses on recruiting Indigenous students and supporting them through their degree.\n\nDirector of the William Cooper Institute and Torres Strait Islander woman Erin Pennett said First Nations student enrolments had doubled at Monash since 2018, the year before the institute's inception.\n\n\"This is really so the next generation can lead and walk proudly in both worlds,\" she said.\n\nErin Pennett says the centre's role is to amplify the voices of First Nations students at Monash University. (Supplied: Monash University)\n\nStrength to succeed\n\nYorta Yorta and Gunditjmara man Joshua Vickery-Stewart, 23, is one of the recipients of the William Cooper Indigenous Scholarship.\n\nThe final-year Bachelor of Arts student met with Uncle Boydie on Yorta Yorta country and said the ideas of this year's NAIDOC theme resonated with him.\n\n\"The next generation is something you always need to think about,\" Mr Vickery-Stewart said.\n\n\"Coming off the 'No' vote of the referendum, I feel like having the strength and vision to what we need to go on to next is really important.\"\n\nJoshua Vickery-Stewart hopes to work in public policy. (Supplied: Joshua Vickery-Stewart)\n\nMr Vickery-Stewart said the academic support provided by the institute had made all the difference to his studies.\n\n\"I feel like if I didn't have that … I would probably be dropping out already,\" he said.\n\nNarungga student Toni Brotherton was supported with a loaned laptop, uniforms, textbooks and nominations for scholarships.\n\n\"The William Cooper Institute is the reason why I've gotten through my degree if I'm completely honest,\" she said.\n\nToni Brotherton (left) says this year's NAIDOC theme resonates as she reaches the end of her degree. (Supplied: Monash University)\n\nVision for the future\n\nMs Brotherton was inspired to begin her studies after working in administration at the Red Cross, supporting doctors and nurses deployed overseas.\n\nShe is now in her final year of a nursing and midwifery double degree, and has her own vision for the future.\n\n\"I'm really passionate about birthing on country, and potentially starting up a not-for-profit organisation in the future to help close the gap within that space of maternity healthcare,\" Ms Brotherton said.\n\nCobbie's Tree is named after William Cooper, who used to sit and fish in its shade on the banks of the Murray. (ABC Shepparton: Alice Walker)\n\nShe said she hoped to see Indigenous life expectancy rise, and more First Nations enrolments in tertiary studies.\n\n\" I believe education is power — no-one can take that away from you. \"\n\nAs Mr Jago pointed out, Mr Cooper was fighting a similar fight.\n\nDavid Jago and Uncle Boydie regularly come to this spot on Yorta Yorta country. (ABC Shepparton: Alice Walker)\n\n\"He was fighting for better education,\" he said.\n\n\"He was fighting not to have kids removed from their parents forcibly, and he was fighting for January 26 to be a day of reflection rather than celebration.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/racing-cancelled-again-the-q-unsuitable-track/105519924",
        "title": "Racing suspended at Queensland greyhound facility as track deemed unsafe again",
        "publish_date": "Fri, 11 Jul 2025 00:04:43 +0000",
        "category": "sports",
        "authors": [],
        "text": "A high-profile Queensland greyhound racing event has been cancelled, after a track at the new $85 million greyhound racing facility The Q was deemed \"unsuitable for trialling or racing\" for the second time in a week.\n\nThe Brisbane Cup was postponed for a week last Saturday after a \"watering issue\" at The Q in Ipswich caused the track to become unsafe for racing.\n\nThe Q has been grappling with a string of greyhound deaths since trials began in March.\n\nRacing Queensland paused racing at the facility on Monday to allow an independent assessment of the track and remediation works to be completed.\n\nIt comes as The Q grapples with a string of dog deaths since trials began at the track in March.\n\nIn a statement on Thursday, Racing Queensland announced that following assessments, the rescheduled event had been cancelled and racing on the Q2 track suspended indefinitely.\n\n\"With Queensland Racing Integrity Commission stewards inspecting the Q2 Parklands track last night and deeming it unsuitable for trialling or racing, all upcoming meetings and trials have been cancelled until further notice so further remediation works can take place,\" the statement read.\n\nRacing Queensland says it'll focus on \"delivering a consistent and suitable racing surface\" before races resume.\n\nRQ said rescheduling meetings at Albion Park was considered but \"operational capacity\" made it unfeasible.\n\n\"As a matter of priority, RQ and the QGRC are focused on delivering a consistent and suitable racing surface before meetings are rescheduled on the Q2 Parkland,\" RQ said.\n\nRacing will continue on the facility's other two tracks.\n\n'The dogs deserve better'\n\nThe former Queensland government put $44.15 million from the racing infrastructure fund towards the $85 million facility, which has been running trials since March and officially opened in June.\n\nLast month, the ABC revealed at least seven dogs had died due to injuries sustained at the racing track before its official opening.\n\nThe $85 million facility is a collaboration between state government-owned Racing Queensland and local clubs.\n\nActing Minister for Racing, Steven Minnikin said he was \"disappointed for participants and supporters\" that the Brisbane Cup had been cancelled.\n\nHe said the facility was commissioned and built by the former Labor government, but that the new government would \"make sure all steps are taken\" to uphold animal welfare standards.\n\n\"Independent investigations into the track and operations at The Q are now underway,\" he said.\n\nGreyhounds die after injuries during trials at new track Photo shows the photo of a greyhound track with a board showing the names of the dogs The new track was spruiked as having animal welfare at its core, but several dogs have died as a result of injuries at the venue during pre-opening trials.\n\nLabor's Member for Ipswich, Jennifer Howard, said in a statement the safety incidents at the track were \"not acceptable\".\n\n\"The Minister for Racing, Tim Mander, along with Racing Queensland must act now,\" she said.\n\n\"The… Q… was launched with the bold claim it would be the safest track in the country saying it 'uses the best practice standards for greyhound racing safety'.\n\n\"This claim is nauseatingly repeated in advertising all over Ipswich and online.\"\n\nJennifer Howard says the government must act to address safety incidents at The Q. (AAP: David Moir)\n\nMs Howard said any official material making those claims, which were first spruiked by the former Labor government when the track was announced, needed to be removed.\n\nShe said she wanted to see \"real steps\" taken to \"ensure the welfare of every animal involved in the industry\".\n\n\"The public deserves transparency. The dogs deserve better,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/evian-championship-gabi-ruffels-grace-kim-minjee-lee/105520300",
        "title": "Aussies enjoy share of Evian Championship lead as Lee feels 'happy vibes'",
        "publish_date": "Thu, 10 Jul 2025 23:54:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "Gabi Ruffels and Grace Kim are among a group sharing the first-round lead at the Evian Championship in France, with fellow Australian Minjee Lee only a stroke off the pace.\n\nRuffels and Kim both produced bogey-free rounds of 6-under-par 65 at the fourth major on the women's golf calendar to join Ireland's Leona Maguire and American duo Jennifer Kupcho and Andrea Lee atop the leaderboard.\n\nTwo weeks after claiming the Women's PGA Championship in Texas, Lee opened with a 5-under 66 to be sitting just one stroke behind the quintet of first-round leaders in outright sixth.\n\nIt is only early days but the leaders at the Evian Resort Golf Club in Évian-les-Bains could be forgiven for already looking over their shoulders anxiously at the resurgent Lee.\n\nAfter enduring a 20-month title drought, Lee has burst back to life since switching to a broomstick putter this season.\n\nThe family message that stood out as Minjee Lee created golf history Photo shows GettyImages-2220804928 As Minjee Lee won her historic third major, a mention of her golfing brother highlighted the tyranny of distance between the two Australian stars.\n\nReturning to the scene of the first of her three major championship triumphs, the 29-year-old rolled in another six birdies at the beautiful French course nestled between Lake Geneva and the Alps.\n\nAfter finishing with a flurry, picking up four shots in her last seven holes after teeing off from the 10th, Lee is one stroke ahead of American world number one Nelly Korda, who is tied for seventh.\n\nWorld number six Lee said she was feeling mentally recharged following a well-earned fortnight's break since claiming the third leg of women's golf's fabled career grand slam.\n\n\"It's been really good to have the last two weeks off,\" she said.\n\n\"The first week was a little more hectic doing a few media commitments and going out and celebrating.\n\n\"Just good laughs, good food, good company, couple drinks here and there, as you do.\n\n\"So I've had the past week to just be relaxed and do some practice and get ready for Evian.\"\n\nMinjee Lee is only a stroke off the pace ahead of the second round. (Getty Images: Stuart Franklin)\n\nLee famously rallied from seven shots back to win the event in 2021.\n\nIt should come as no surprise that she is riding the \"happy vibes\" from such a memorable comeback win.\n\n\"Obviously playing each hole, I can kind of reflect and think back at what happened that round,\" Lee said.\n\n\"Just gives me good energy and just happy vibes, I guess.\"\n\nA one-time former Australian national junior tennis champion, the super-talented Ruffels credited her flawless round to a refreshing day out at Wimbledon.\n\nThe 23-year-old snapped up tickets to the All-England Club from Australian doubles legend Todd Woodbridge, who was coached by Ruffels's father Ray.\n\n'It was definitely a bucket-list thing to do and I'm glad we were able to tick that off,\" Ruffels said.\n\n\"Last time I went, I was six so I didn't really remember it. I wanted to go when I remembered and appreciated it.\n\n\"It was such a cool experience. It's just kind of like a perspective switch as well from golf to kind of get in the tennis world.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/julian-mcmahons-cause-of-death-revealed-lung-mestastasis/105520208",
        "title": "Australian actor Julian McMahon's cause of death has been revealed",
        "publish_date": "Thu, 10 Jul 2025 23:33:20 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Australian actor Julian McMahon's cause of death has been revealed after he died aged 56 this week.\n\nAccording to a cremation approval summary report obtained by US media outlets, the Australian actor died from lung metastasis as a result of head and neck metastatic cancer.\n\nThe report from Pinellas County Medical Examiner's Office in Florida said the cause of death was natural and he has since been cremated.\n\nIf cancer begins in another part of the body and spreads to the lungs, it is known as lung metastasis or metastatic cancer in the lung, the Australian Cancer Council writes on its website.\n\nJulian McMahon dies aged 56 Photo shows Julian McMahon in 2025 Julian McMahon got his start on Home and Away and went on to star in Charmed, Nip/Tuck and Fantastic Four, among other TV shows and films.\n\nIn a statement this week, McMahon's wife Kelly confirmed he had died after a \"private battle with cancer\" and did not reveal further detail.\n\n\"With an open heart, I wish to share with the world that my beloved husband, Julian McMahon, died peacefully this week after a valiant effort to overcome cancer,\" Kelly said in the statement.\n\n\"Julian loved life. He loved his family. He loved his friends. He loved his work, and he loved his fans. His deepest wish was to bring joy into as many lives as possible.\n\n\"We ask for support during this time to allow our family to grieve in privacy. And we wish for all of those to whom Julian brought joy, to continue to find joy in life. We are grateful for the memories.\"\n\nThe actor starred in shows such as Nip/Tuck, Charmed, FBI: Most Wanted, Hunters and The Residence — a Netflix miniseries released this year.\n\nMcMahon was also one of three children of former prime minister Sir William \"Billy\" McMahon and Lady Sonia McMahon.\n\nTributes from his former co-stars flowed on social media.\n\nActor Nicholas Cage said he was a \"kind and intelligent man\".\n\nRose McGowan, his co-star from Charmed, paid tribute to McMahon on social media.\n\n\"Oh Julian you force of brilliance, wild talent and humour, \" she wrote in an Instagram story.\n\n\"For you, your family and loving fans all over the world, I pray [for] comfort.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/lifesaving-rescue-inspire-rfds-fundraiser-wa-wheatbelt/105506526",
        "title": "Flying doctor 'heroes' inspire mums' bush dash fundraiser",
        "publish_date": "Thu, 10 Jul 2025 23:30:19 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When Ash King came home sick from school complaining of a headache, the last thing her family expected was for the teen to be diagnosed with a bleed on the brain.\n\nWithout the fast response from the Royal Flying Doctor Service (RFDS), who flew her the 170 kilometres from Moora to the Perth Children's Hospital, her mum Kym Reilly believes she may have died.\n\nAsh King with her care team at Perth Children's Hospital. (Supplied: Kym Reilly)\n\n\"As we got off the plane and into the hospital, Ash had her first seizure, and if we had still been in Moora, I don't know what would have happened,\" Ms Reilly said.\n\nScans revealed Ash, who was 15 at the time, had an arteriovenous malformation that had haemorrhaged and needed to be removed from her brain, leading to multiple surgeries, including one lasting 26 hours.\n\nDuring 11 months in hospital and another six undertaking rehabilitation, Ash, with the support of her family and medical team, re-learned how to walk and talk.\n\nRescue mission\n\nFor Moora teacher Erin McPherson, an afternoon of motorbike riding in December turned into a rescue mission when her son Gus failed to return to the group.\n\nThe 10-year-old had ridden into a gate and broken multiple bones.\n\n\"When we found Gus, we didn't know the extent of his injuries; all we knew was it was serious,\" Ms McPherson said.\n\nThe Royal Flying Doctor Service transferred Gus McPherson to Perth. (Supplied: Erin McPherson)\n\n\"When the ambulance arrived, we were met by four local volunteers who were our guardian angels that night, who kept that hope alive that Gus was going to be okay.\n\n\"Not only were they keeping Gus safe, but they were doing it for us as well; they're heroes.\"\n\nFuelled by community\n\nOriginally united by their passion for local netball, Ms Reilly and Ms McPherson have now used their shared RFDS experience to create their own fundraiser for the service.\n\nThe Heroes to Hub event will see more than 160 participants run, walk, ride a motorbike or even a horse 26 kilometres from Newhome Farm to the Mogumber Hub in Western Australia's Wheatbelt this weekend.\n\nErin McPherson, Ash King and Kym Reilly say they want to give back to community. (Supplied: Erin McPherson)\n\n\"Ash and Erin were having a bit of in-house banter about if Ash could endure 26 hours of surgery, Erin should be able to run 26 kilometres,\" Ms Reilly said.\n\n\"We call ourselves lucky because we had the best medical support in a time that no-one would call lucky or want to be in.\"\n\nAsh and Gus (middle) inspired their mums to run a fundraiser. (ABC Midwest & Wheatbelt: Eliza Bidstrup)\n\nInspired by children\n\nMs McPherson said the 26-kilometre run put Ash and Gus's experiences into perspective.\n\n\"I never really linked Gus and Ash's stories together before, but we're inspired by these two beautiful, strong children who showed resilience through the challenges they faced,\" she said.\n\n\"Not only are we raising funds for the RFDS, but it is a way for us to give back to our community who rallied around us and our kids during some of the hardest times of our lives.\n\n\"It was the phone calls, hospital visits and meals from people back home that made all the difference during those times – they are also heroes to us.\"\n\nThe 26 kilometre event represents the 26 hour brain surgery Ash King went through in 2023. (Supplied: Erin McPherson)\n\nInternational support\n\nGus will be riding his motorbike along the event course, while Ash will join a group of her friends from school for the last 3-kilometre leg to the Mogumber Hub.\n\nIt is not just locals getting involved, with a nurse who looked after Ash during her time in hospital taking part from Africa.\n\n\"Pip was my very favourite nurse in the whole world,\" Ash said.\n\n\"She now volunteers in Magacascar on the Mercy Ship and will run 26 kilometres there because she had the honour of caring for me.\"\n\nAsh is now completing Year 12 and dreams of working as a nursing assistant, idolising the team who cared for her during her time of need.\n\nGus is completing his final year of primary school and is back on the bike and kicking goals for his local football team.\n\nWith an original fundraising goal of $26,000, the event has surpassed organisers' expectations with donations exceeding $65,000 just days out from the run.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/murdoch-university-student-fights-accusation-of-ai-use/105518732",
        "title": "Uni student accused of using AI in assignment fights to clear his name",
        "publish_date": "Thu, 10 Jul 2025 22:44:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Mark McLauchlin is close to completing his nursing degree at Perth's Murdoch University, but an incident involving one assignment has \"challenged his integrity in every way\" and landed him in a protracted fight with the university's administration.\n\nIn April, he was told a workbook he handed in had raised concerns.\n\nExcerpt from an email sent to Mr McLauchlin on April 3, 2025: \"Data collected from sources such as Turnitin, in conjunction with academic insights from our experienced marking team, have led to the submission being deemed high risk for academic misconduct. These concerns relate to the potential use of artificial intelligence in the generation of your work, plagiarism, and/or collusion.\"\n\nA few days later, he was told an analysis of his work showed low editing time, evidence of chunks of text being cut and pasted into the document, and unusual formatting.\n\nMr McLauchlin insists he has not cheated and the reason his assignment metadata shows evidence of \"chunks of text being cut and paste\" is because he used a grammar checking software, Grammarly, approved by the university.\n\n\"I've been open and honest, right from the very first accusation, however the AI component of Grammarly was turned off,\" he said.\n\n\"The tool is widely advertised and encouraged by the university for students to use to help them with their studies.\"\n\nPassing despite marks cut\n\nThe university conducted its own investigation and concluded that, on the balance of probabilities, Mr McLauchlin had used AI for part of his assignment.\n\nIt also noted he had successfully completed nine units of his course and had no record of previous misconduct.\n\nIt decided Mr McLauchlin would receive only 70 per cent of the marks allocated to his workbook.\n\nMurdoch University says it does not comment on individual cases for privacy reasons. (Supplied: Murdoch University)\n\nHe said while he had enough marks from other assignments to pass the unit — even with the reduced mark from the workbook — and was on track to complete the degree this year, he was not willing to let the matter go.\n\n\"I guess my overall issue is that, still to date, Murdoch can't give me a word, sentence, paragraph, phrase or a pattern of AI [in my assignment],\" Mr McLauchlin said.\n\n\"I haven't used AI in the way that they believe that I've used AI.\n\n\" Being accused of being a cheat when you've put in so many years, hours, effort, money, time off work, time away from family to sit there and study … it's a big pill to swallow and it's quite hard. \"\n\nIn a written statement, Murdoch University said it could not comment on Mr McLauchlin's case for privacy reasons, but all students were \"required to complete an academic integrity module that includes instruction on the appropriate and inappropriate use of AI\".\n\nMark McLauchlin says he used university-endorsed grammar checking software, which may explain the accusation. (ABC News: Luke Stephenson)\n\n\"Where the use of generative AI in assessments is indicated, the university takes a considered and educative approach under established academic integrity processes,\" the statement read.\n\n\"Our first priority is to support students in understanding appropriate academic practices.\n\n\"Where concerns arise, our processes are designed to be fair, transparent and proportionate, with education and engagement prioritised before any punitive measures are considered.\"\n\nDetection of AI a fraught issue\n\nThe issue of AI detection is playing out on campuses around Australia, as universities and students grapple with the widespread availability of generative AI programs like ChatGPT.\n\nStudents are also increasingly worried about accusations, with some students choosing to run their assignments through checkers before handing them in, to make sure programs that check for plagiarism, like Turnitin, do not falsely accuse them of not doing original work.\n\nOne student told ABC Radio Perth she and her peers were now taking pre-emptive action against accusations of cheating.\n\n\"Quite a lot of students have started doing their assignments on a Google document so that there are time stamps for whenever anything has been written, deleted or changed to have proof you've written everything yourself,\" she said.\n\nDale, a recently retired TAFE teacher, said the practice of using AI to complete assignments was widespread.\n\nInternational students say AI detectors inaccurate Photo shows Logo Open AI is in white on black phone screen in front of a white computer screen with words. International students voice concerns AI detectors are inaccurate, as US researchers suggest the tools unfairly flag essays by people writing in English as a second language.\n\n\"I found students used AI to write assignments, but actually had little knowledge of the subject,\" he said.\n\n\"The machine has done the work, [the] student has no inherent knowledge.\"\n\nMr McLauchlin said his latest appeal of the university's decision had failed, and he was now seeking legal advice on where he could go from here.\n\nHe said it was not just about clearing his name, but about making a point to the university about its processes, which he said were impersonal and had not allowed him to fully make his case.\n\n\"That's the other reason why I'm kind of really going for this … I really believe that they're not 100 per cent informed of the impact of what they do, and how that can have [an affect] on people,\" he said.\n\nMurdoch University said it welcomed \"appeals and constructive feedback on our administrative processes\" and was \"committed to continuous improvement\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/macquarie-point-stadium-planning-commission-hearings-wrap/105515312",
        "title": "What we learnt from the Macquarie Point stadium hearings",
        "publish_date": "Thu, 10 Jul 2025 22:35:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "They've been staged in the shadow of a state election, but the Tasmanian Planning Commission hearings into the Macquarie Point stadium have provided perhaps the sharpest level of detail about the proposed project.\n\nHeld over the past two weeks, the hearings have formed part of the Project of State Significance process and provided almost 30 stakeholders with the opportunity to present evidence to the planning commission panel assessing the stadium.\n\nTasmanian Planning Commission's panel has been conducting hearings over the past fortnight as part of the Project of State Significance process. (ABC News: Luke Bowden)\n\nThe project proponent, the Macquarie Point Development Corporation (MPDC), has also had the opportunity to respond to the panel's draft integrated assessment report released earlier this year.\n\nStakeholders were grilled by the panel and lawyers representing both the proponent, and a group opposing the stadium.\n\nSo, what went on inside the hearings?\n\nClick on the bullet points to jump to each section.\n\nLand use and development\n\nLawyers representing the state, Chris Townshend KC and Anthony Spence, based most of their arguments on what constituted an appropriate use of the Macquarie Point site, and the legislation under which the MPDC was operating under.\n\nWhy not York Park for AFL in Tasmania? Photo shows Carlton and Hawthorn players contest the ball The existing York Park stadium in Tasmania's north is often pointed to as a better, cheaper option for the state's AFL future than building a new arena in Hobart. Here is why that is considered a mistake.\n\nThe state posited the planning commission had over relied on a 1991 planning review of the Sullivans Cove area in its draft report, and not enough weight had been given to more current and relevant legislation such as the Macquarie Point Development Corporation Act.\n\nThe basis for large parts of its argument was that Macquarie Point had been earmarked for development under specific legislation, and that the Project of State Significance process effectively \"turned off\" other planning schemes.\n\nIn its opening submission, it told the panel that it would refer to a number of expert witnesses over the course of the hearings.\n\nLoading...\n\nUrban design and planning\n\nThe panel heard from local architects Leigh Woolley and Jerry De Gryse, who shared concerns about the stadium's size, scale and bulk.\n\nHealth issues top the list for these Tasmanian voters Photo shows Table scattered with medical items including a stethoscope. Two people's arms with one taking the other's blood pressure While a proposed AFL stadium has been a hot topic for discussion this election, many Tasmanians say their health needs are the main issue when considering how they'll vote on July 19.\n\nMr De Gryse questioned whether the stadium precinct would be adequately publicly accessible, while Mr Woolley argued that the Domain headland would be \"diminished and overwhelmed\" by the stadium.\n\nArchitect and heritage expert Jim Gard'ner presented revised impact assessments of the stadium on various locations around Hobart, based on fresh photo montages submitted by the proponent.\n\nHe rated the stadium as having a \"major\" impact on the Hobart Cenotaph, but downgraded its indirect impact on four other sites.\n\nA graphic of the \"key design features\" of the proposed Macquarie Point stadium, as shown in the Enabling Legislation Report Consultation Draft. (Tasmanian government)\n\nFor example, Mr Gard'ner had previously rated the stadium's indirect impact on the UTAS Arts building on Hunter Street as 'very high' but downgraded that to 'medium' based on the new images.\n\nHe recommended several conditions be applied to a planning permit, mostly relating to design tweaks which he believed would lessen the stadium's impact on the surrounding heritage area.\n\nStadium designers, Cox Architecture, presented a new \"fly through\" of the stadium, as well as an explanation of the stadium design to date.\n\nCox principal director Alastair Richardson was questioned on a wide range of elements, including stadium materials, roof beams, vehicle access, the proposed use of the Goods Shed and the stadium roof.\n\nBack to top\n\nThe roof\n\nThe roof, and its potential impacts, were widely discussed.\n\nPlanning expert Neil Shepherd, presenting on behalf of the MPDC, said, \"the roof represents the element that will provide the greatest visual impact, in my opinion\".\n\nBut he argued \"perceptions about the visual prominence of the building must be balanced against the desired role and functionality of the proposal in the chosen location\".\n\nYour Say: Tell us what matters to you this Tasmanian election Photo shows Have your say for the Tasmanian election. We want to know what issues matter most to you and what you want us to find out as Tasmania goes to another election.\n\nRespected town planner and urban designer Tim Biles, on behalf of the opponents group Our Place, launched a passionate critique of the stadium roof, decrying its potential impacts on the Hobart Cenotaph\n\nMr Shepherd, in response to questions from planning commission panellist Shelley Penn, said he took the view \"the significance of the cenotaph would remain, and that the roof would be another element in the view field\".\n\nThe level of roof transparency, and its potential reflectivity was also raised.\n\nRoland Browne, on behalf of Our Place, contended the Mount Nelson vista may not be able to be seen from the Cenotaph through the roof, due to the thickness of the ETFE (ethylene tetrafluoroethylene) material.\n\nMore information was submitted relating to Cricket Australia and Cricket Tasmania's concern with the roof, and the effect of shadowing it may cause on the cricket pitch.\n\nBack to top\n\nVisual impact\n\nA render of the new stadium as presented to the Tasmanian Planning Commission by architect Chris Goss of Melbourne based firm Orbit Solutions. (Supplied)\n\nA major theme of the hearings was the stadium's visual impact, and how its physical presence may affect the city of Hobart.\n\nMPDC presented \"visual amenity evidence\", including new photo montages of the stadium from various viewpoints around the city, produced by architect Chris Goss of Melbourne-based firm Orbit Solutions.\n\nIn response, anti-stadium group Our Place submitted an analysis of Mr Goss's images, compiled by landscape architect Barry Murphy.\n\nOur Place contested that the Orbit images presented the stadium with a \"transparent\" roof rather than a \"translucent\" roof, and questioned why Mr Goss's photo montages were compiled from viewpoints that were obscured by, in one example, a street sign, and, in a shot from the cenotaph, by a visiting cruise ship.\n\nA diorama model of Hobart's proposed Macquarie Point stadium. (ABC News: Kate Nickels)\n\nOur Place had previously submitted its own photo montages, compiled by local architect Hamish Saul.\n\nIn a separate submission though, Mr Murphy, Mr Saul and Mr Goss co-signed a \"statement of agreed facts\" that concluded that Orbit's 3D model of the stadium building was more accurate in relation to the stadium's materiality, its form and mass, and its geometry, compared with Mr Saul's.\n\nHowever, the statement acknowledged a difference in opinion about the roof rendition and focal length used to take the photos, which Mr Murphy argued in his submission should have been 50mm instead of 20mm.\n\nBack to top\n\nEconomic, social and cultural impact\n\nThe panel heard from KPMG economists who prepared economic, financial impact and social benefits reports for the proponent last year.\n\nMichael Malakellis and David Harradine argued while their economic analysis found the benefit-cost ratio for the stadium would be less than one, they stressed the project should not be assessed in strict economic terms, given its unquantifiable social and brand value benefits.\n\nThe stadium has been a source of debate within the Tasmanian community. (ABC News)\n\nDid Rockliff break his 'not a red cent more' promise? Photo shows Jeremy Rockliff with a football. The definition of a \"red cent\" and a qualification of the $375 million in taxpayer money for the planned Hobart stadium matter when determining if Jeremy Rockliff has broken his word.\n\nStadiums Tasmania chief executive James Avery also made a lengthy presentation to the panel, in which he revealed an updated operating model for the stadium had been developed.\n\nHe said it estimated the stadium would make $2.2 million per year before taxes, depreciation and amortisation — a way of managing the cost of intangible assets or loans — as opposed to a loss of more than $3 million per year under a previous model.\n\nIt was based on the new capital cost of the stadium, which was $945 million, but, unlike before, it now includes state ownership of food and beverage facilities, advertising boards, and premium hospitality.\n\nThe stadium is now forecast to host 37 major events, 40 2-day conferences and 260 \"minor events\" such as business functions and corporate dinners per year, accounting for 334 events across 377 days.\n\nRepresentatives from Tourism Industry Council Tasmania and Business Events Tasmania also fronted the hearings highlighting the significance of the proposed 1,500-person conference centre, as did independent local economist Graeme Wells, who disputed some of KPMG's findings.\n\nThe panel also heard from the Tasmanian Symphony Orchestra, which had expressed concern about noise and vibration from the stadium during both the construction and operational phases.\n\nIn its submission, it proposed a number of conditions that should be applied, should planning approval for the stadium be granted.\n\nBack to top\n\nTransport, movement and access\n\nThe panel heard a planned underground car park has been reduced from three levels to two, and from 532 spaces to 374, reduced to keep the car park above the groundwater table.\n\nThe car park is expected to service the entire Macquarie Point precinct and is estimated to cost $97 million.\n\nHowever, according to the MPDC, that cost will not be worn by the state, as the car park \"is intended to be delivered as a commercial development opportunity and run by a private operator\".\n\nWhy not Bellerive Oval? The answer is more complicated than you think Photo shows A sports stadium as seen from the sky. Bellerive Oval has hosted AFL games for years, so why does Hobart need a multi-million-dollar stadium for its newly minted footy team?\n\nThe MPDC also states the car park is not required for the stadium's operations.\n\nGraeme Steverson of consultants WSP presented to the panel on transport matters, on behalf of the MPDC. He modelled a range of traffic and transport scenarios for large-scale sporting and concert events.\n\nCox Architecture submitted diagrams that showed egress from the stadium in the event of an emergency, and fielded questions about the safety of the venue.\n\nBack to top\n\nConsultation\n\nSeveral stakeholders raised what they said was a lack of consultation by the MPDC and the state Government to the panel as a major concern.\n\nStadium issue a vote changer Photo shows Man looking away from camera wears green beanie with 'Devils' written on it Whether or not to spend many millions of dollars on a stadium in Hobart is a question being weighed by voters, with some saying they'll change who they usually vote for.\n\nDaniel Hanna, representing Federal Group, which owns several properties on the Hobart waterfront, said the stadium would be detrimental to his company's business and that Federal had not been adequately consulted.\n\nLawyers representing the MPDC referenced seven meetings between 2023 and 2024 between the proponent and Federal regarding the stadium, but Mr Hanna did not consider those meetings as adequate consultation.\n\nHistorian and Aboriginal heritage experts Greg Lehman and Daphne Habibis echoed those sentiments, as did Nala Mansell from the Tasmanian Aboriginal Centre.\n\nMs Mansell said Aboriginal land at Macquarie Point should be transferred to the Tasmanian Aboriginal people.\n\nBack to top\n\nRemediation and environment\n\nThe panel heard from the Environment Protection Authority (EPA), which had previously expressed concern about groundwater and contaminated fill at Macquarie Point.\n\nThe MPDC submitted that only about 10 per cent of fill material earmarked to be excavated will be \"level three\" material — material that requires an additional level of disposal and storage management.\n\nThe EPA submission outlined conditions it believed should be imposed, should the stadium development proceed, including that the director of the EPA be able to approve a stadium Construction Environmental Management Plan, and have a role in approving stadium design plans.\n\nIt also wants to be the body responsible for enforcing those, and other conditions.\n\nBack to top\n\nTasmania Football Club\n\nThe AFL has said a 23,000-seat, roofed stadium at Macquarie Point is a contractual requirement for a team to be granted access to the national competition. (Supplied: Tasmania Football Club/Solstice Digital)\n\nThe Tasmania Football Club, the Devils, was represented by chief executive officer Brendon Gale, who told the panel via a presentation that the stadium was crucial to the club's business case and viability.\n\nHe said that \"net stadium revenues\" accounted for 47 per cent of a typical AFL club's revenue and called them \"the most significant driver of financial competitive and financial strength\" of a club.\n\nHe added that stadium revenues accounted for just 43 per cent of club revenue 10 years ago.\n\nMr Gale said there existed a strong correlation between a club's off-field financial strength and their on-field success.\n\nBack to top\n\nTo read more submissions about the proposed Macquarie Point stadium, go to the Planning Commission website.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/mining-rates-win-bolsters-local-government-mount-magnet/105516340",
        "title": "Small town hails Supreme Court win in rates battle with miner",
        "publish_date": "Thu, 10 Jul 2025 22:30:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "As residents across Western Australia grapple with their annual council rates, the Supreme Court has opened the door for local governments to tap mining companies for more revenue.\n\nThe Shire of Mount Magnet, about 570 kilometres north-east of Perth, this week won a Supreme Court appeal, allowing it to levy rates on land covered by vanadium miner Atlantic's \"miscellaneous licences\".\n\nLicences are generally held over land with infrastructure associated with mines, including pipelines, access roads, and staff accommodation.\n\nWith the WA government recently warning struggling councils not to use the mining industry and other ratepayers as \"cash cows\", the decision is expected to be closely examined by local governments across the state.\n\nMount Magnet has a small population, but has significant pressure on its infrastructure. (ABC Mid West Wheatbelt: Chris Lewis)\n\nWith a population of just 583, Mount Magnet council collects about $2 million in rates each year.\n\nBut the shire's chief executive, Tralee Cable, said the additional revenue stream would allow the council to improve under-pressure local infrastructure.\n\n\"It will enable the shire to put in place some of the infrastructure that we're so desperately in need of that we haven't been able to do without grant or federal government funding,\" she said.\n\n\"For a lot of local governments in the centre of WA, this will be lifesaving.\n\n\"It does go a long way to balancing the scales of equitable funding for local government.\"\n\nTralee Cable says the additional rates will fund vital infrastructure. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nMs Cable said the status and rateability of the land had been \"misread and misunderstood\" for years, with 13 other regional councils helping fund the legal challenge.\n\nShe said the shire issued rates notices to Atlantic in 2023 after examining the act more closely.\n\n\"It's not consistent to think that you can build infrastructure on land for mining purposes and be exempt from paying rates,\" Ms Cable said.\n\n\"This infrastructure is essential and critical to the generation of profit for the mining company. It's a business expense for the mining company.\"\n\nIndustry slams 'legal loophole'\n\nMining industry representatives slammed the decision, urging the government to take legislative action to prevent companies from being targeted.\n\nAssociation of Mining and Exploration Companies (AMEC) chief executive Warren Pearce said miscellaneous licences had always been considered exempt from rates under the Local Government Act.\n\nBut he said the wording of the exemption was changed slightly in the 1995 amendments to the act.\n\nWarren Pearce is urging the state government to change the legislation. (ABC News)\n\n\"We now have a situation where some clever lawyering, on behalf of the local government sector, has been able to exploit a loophole created by some poor drafting,\" Mr Pearce said.\n\n\"The judge has read the letter of the law and essentially ignored the intentions of the parliament in making those laws.\n\n\"There was clearly no desire to change the intent of that legislation. If there had been, it would have been discussed in the parliamentary debate.\"\n\nMr Pearce said the decision could cost the sector $55 million per year.\n\n\"The other reason this is particularly awful is that miscellaneous licences often sit on top of mining or exploration licences, which means local governments can rate the same land twice,\" Mr Pearce said.\n\n\"It's not reasonable to expect the mining industry to continue to be treated as a cash cow for unfinancial or unsustainable local governments.\"\n\nA state government spokesperson said in a statement it was aware of the Supreme Court ruling involving the shire's appeal.\n\n\"The Minister for Local Government has sought urgent advice from the Department of Local Government, Industry Regulation and Safety on this matter,\" the statement read.\n\n\"Once that advice has been received, the minister will review all options and take action to pursue any avenues available to the government.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-11/tour-de-france-michael-storer-third-stage-six/105520162",
        "title": "Aussie Storer third in Tour de France stage as Pogačar gives up yellow jersey",
        "publish_date": "Thu, 10 Jul 2025 22:27:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "Michael Storer has achieved the best Australian result so far at this year's Tour de France, finishing third in stage six.\n\nIreland's Ben Healy (EF Education-EasyPost) won the 201.5-kilometre trek from Bayeux to Vire Normandie after a long solo breakaway.\n\nDutchman Mathieu van der Poel (Alpecin-Deceuninck) wrestled back the overall leader's yellow jersey from reigning champion Tadej Pogačar (UAE Team Emirates).\n\nHealy attacked from an eight-man breakaway, which included van der Poel, with 42km remaining and pulled away to reach the finish line well ahead of second-placed American Quinn Simmons (Lidl-Trek) and Storer (Tudor Pro Cycling Team).\n\n\"I spent a bit too much time trying to get into the break, but I think that's just the way I do it,\" Healy said.\n\n\"Once I was in there we really had to work for that gap and it was just on the pedals all day and I knew I needed to get away from the group and picked my moment.\"\n\nVan der Poel, who lost the overall lead to Pogačar after the individual time trial in stage five, was unable to keep pace with the breakaway.\n\nBut he moved back to the top of the general classification with a gap of one second over Slovenia's Pogačar.\n\nVan der Poel, who first took the yellow jersey after winning stage two, began the day 1:28 behind Pogačar.\n\nThe breakaway group had managed to put more than four minutes between themselves and the peloton, with Pogačar's teammates appearing unconcerned about losing the yellow jersey at this early stage of the race.\n\nAfter Healy broke free and the others gave chase, van der Poel lost his momentum and — on a day with six categorised climbs and an uphill finish — he looked a tired figure as he dragged himself to the line in eighth place.\n\nPogačar ended up crossing the finish next and the three-time champion will be more than happy to sit just one second behind van der Poel.\n\nJack Haig (Team Bahrain Victorious) and Ben O'Connor (Team Jayco AlUla) are the best-placed Australians in the general classifications in 20th and 21st respectively.\n\nHaig is 5:09 off the pace, with O'Connor (5:30) further back.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/manhunt-conducted-for-cummins-stolen-baggy-green-20250711-p5me8f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Manhunt' conducted for Cummins' stolen baggy green",
        "publish_date": "Fri, 11 Jul 2025 12:10:18 +1000",
        "category": "finance",
        "authors": [],
        "text": "'Manhunt' conducted for Cummins' stolen baggy green\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/sydney-eating-out/rovollo-s-roving-pasta-cart-delivers-pici-carbonara-tableside-20250710-p5me2z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rovollo’s roving pasta cart delivers pici carbonara tableside",
        "publish_date": "Fri, 11 Jul 2025 12:04:10 +1000",
        "category": "finance",
        "authors": [
            "Erina Starkey"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\n1 / 9 Pici carbonara with guanciale. Nshot Creative 2 / 9 Mixed seafood tower. Nshot Creative 3 / 9 There’s seating inside and out. Christian Michael 4 / 9 Yellowfin tuna crudo with pickled tomato. Nshot Creative 5 / 9 Salted cucumber. Nshot Creative 6 / 9 Saffron risotto with prawns and Avruga caviar. Nshot Creative 7 / 9 Napoli cocktail made with charred focaccia vermouth. Nshot Creative 8 / 9 The venue is located at 25 Martin Place. Christian Michael 9 / 9 Spaghetti vongole. Nshot Creative Previous Slide Next Slide\n\nItalian$$$$\n\nThere’s always plenty of movement at 25 Martin Place, even so, it’s hard to miss the flaming cheese wheel at Italian restaurant and wine bar Rovollo.\n\nThe formaggio in question is a $2000 round of Parmigiano Reggiano that tours the room on a custom-made walnut and brass trolley. Tableside, the centre of the cheese is doused in rum and set alight, creating a warm basin in which pici pasta is twirled, coating the strands in melted parmesan.\n\nPasta is made in-house daily by executive chef Cami Feliciano (formerly of Seta and Woodcut), while steaks – like wagyu rump cap and Riverine tri-tip – are seared by head chef Zane Buchanan, previously of Clam Bar.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/hunt-for-rider-after-nine-year-old-girl-run-over-by-dirt-bike-20250711-p5me8c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hunt for rider after nine-year-old girl run over by dirt bike",
        "publish_date": "Fri, 11 Jul 2025 12:00:22 +1000",
        "category": "sports",
        "authors": [],
        "text": "Hunt for rider after nine-year-old girl run over by dirt bike\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/it-s-time-society-stops-underestimating-women-over-50-here-s-why-20250701-p5mbmd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It’s time society stops underestimating women over 50. Here’s why",
        "publish_date": "Fri, 11 Jul 2025 12:00:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Jo Stanley"
        ],
        "text": "The light in my bathroom is too dim. I keep discovering chin whiskers while in traffic – because that’s what red lights are for – that should never have made it past a plucking. One silver whisker was a full centimetre long! The horror! How long had it been there, glistening in the sun, and why didn’t someone tell me?\n\nWe have lived and loved, learned and led, and kept on laughing no matter what. Credit: Getty images\n\nI’m not vain or by contrast, insecure. I have a healthy acceptance of the realities of my 53 years in this skin. Even though I’m obsessed with Ricki Lake’s facelift – and maybe if I were a gazillionaire I’d consider a cheeky nip-tuck to rediscover my jawline – mostly I’m deeply grateful for a body that is healthy and strong.\n\nBut still, I wonder: if I looked younger, if no one knew my age, would I feel less like the world is trying to file me away, before I’ve even finished becoming who I’m meant to be?\n\nBecause there is no doubt that something is happening. Friends and I talk about it often – this quiet, creeping sense that we are being moved to the sidelines. A socially sanctioned diminishing of our worth and contribution. The slow fading of opportunities.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/the-goldin-age-stunning-80s-exhibition-that-anticipated-the-selfie-opens-in-perth-20250711-p5me7i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Goldin age: Stunning ’80s exhibition that anticipated the selfie opens in Perth",
        "publish_date": "Fri, 11 Jul 2025 11:57:12 +1000",
        "category": "entertainment",
        "authors": [
            "Mark Naglazas"
        ],
        "text": "One of the most remarkable photographic exhibitions ever to travel to Perth has just opened at the John Curtin Gallery.\n\nNan Goldin’s The Ballad of Sexual Dependency, a selection of images distilled from the slideshow that caused a sensation when they were first shown in the underground clubs and bars in New York in the mid-1980s.\n\nNan and Brian in bed, NYC 1983, by Nan Goldin Credit: Nan Goldin / National Gallery of Australia\n\nWhen Goldin moved from Boston to the Bowery in 1978, photography tended to either dispassionately record the life of the streets (a tradition of photo-journalism that stretched from Henri Cartier-Bresson to Robert Frank) or were more in painterly tradition of studio-based portraitists such as Irving Penn, Richard Avedon and soon-to-flourish Annie Leibovitz.\n\nGoldin, in striking contrast, used her camera like a diarist, capturing her family or “her tribe” — the post-punk, queer subculture that gathered in the cheap, rundown neighbourhood of the Lower East Side that would soon be decimated by HIV/AIDS.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-centre-bounce-has-become-a-relic-it-s-time-for-the-afl-to-bring-back-the-chaos-or-scrap-it-20250710-p5mdwu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The centre bounce has become a relic. It’s time for the AFL to bring back the chaos or scrap it",
        "publish_date": "Fri, 11 Jul 2025 11:55:00 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan"
        ],
        "text": "“What can you tell me about the centre bounce of the ball? It goes anywhere, so it’s really, really hard for the players ... if the ball bounces sideways, they’re going to move,” Suns coach Damien Hardwick said. Geelong skipper Patrick Dangerfield described it as not a “valuable enough part of the game to protect”, while Brisbane Lions coach Chris Fagan said, “I’m not a fan of the bounce ... it contributes to umpire contact. It bounces, goes all over the place.” Removing the bounce is a decision the AFL Commission can make as it was not enshrined in the 2014 Laws of the Game Charter. Under the fundamental element category of the game, it says : “At the start of each quarter and after each goal, play is resumed by a ruck contest at a centre bounce or ball-up.” Patrick Dangerfield doesn’t think the bounce is a valuable enough part of the game to protect. Credit: AFL Photos via Getty Images Removing the bounce to help reduce umpire-player contact (a counter-argument is that the certainty a ball-up provides crowds players around the umpire, making them more vulnerable) is not the only reason it has been in the gun.\n\nThose arguing for its elimination want to keep good decision makers in the game, even if they were ordinary bouncers. Let’s face it, in what other sport – apart from perhaps skating in ice hockey – are umpires required to execute a physical skill? The ball is now thrown up at all centre bounces in the AFLW. In the AFL, it has been thrown up around the ground since 2013 and umpires can be exempted from bouncing the ball due to the risk of injury. The bounce must go up within a circle 10 metres in diameter and only the rucks can contest it. If the ball goes too far from the mark, it is called back, as the game attempts to balance unpredictability with fairness. It means umpires have to execute the skill even more perfectly than in the past when no recalls were required, ruckmen weren’t nominated and any player could contest the ball where it landed.\n\nJust look below at some of the bounces from the past, from the 1975 and 1986 grand finals. Tradition? What tradition? Apart from all the rule changes, it’s also worth noting that the tradition so fiercely protected to start a grand final has not occurred in two of the past 38 deciders.\n\nIn 1987, a free kick was paid to Carlton’s Wayne Johnston before umpire Ian Robinson even had a chance to bounce the ball as five Hawthorn players stood in the square. It’s not clear why Johnston, rather than the Carlton ruckman, was awarded the kick, but no one blinked an eye. In 2023, an errant bounce was recalled, taking two seconds off the clock in the Collingwood v Brisbane Lions decider before umpire Simon Meredith threw it up for Mason Cox and Oscar McInerney. When a bounce is recalled, the clock does not reset, losing the time taken.\n\nThat famous grand final that Collingwood won by four points was defined by a centre clearance goal in which Magpies star Jordan De Goey kicked to regain the lead with less than six minutes remaining. The ball was thrown up because of a 6-6-6 position warning. That moment of uncertainty was removed in a climactic end to a great grand final and could be again if a bounce was recalled. Yet, the sky didn’t fall in.es remaining. The ball was thrown up because of a 6-6-6 position warning. Three of the final four centre bounce situations were ball-ups in the final six minutes, two due to 6-6-6 warnings and one due to a recall (which took two seconds off in the final five minutes). The AFL changed the rule at the start of this season so that umpires bounce the ball after issuing a 6-6-6 warning (as happened just before three-quarter-time time on Thursday night). It’s time for a decision on the bounce\n\nThe rule changes around the centre bounces make you wonder what is being protected. In 2025, it has degenerated into a wrestling match between ruckmen, since the AFL last year enabled straight-arm blocks providing the ruck involved was contesting the ball. It is no longer exciting to watch. Lawmakers were trying to avoid such wrestling when they introduced the centre circle across the line in 1980, following the ugly rucking spectacle that marred the 1979 preliminary final when Collingwood’s Peter Moore and North Melbourne’s Gary Dempsey wrestled like two pythons throughout the match. For half a century the game achieved that objective until a 2024 rule change was introduced for reasons unknown. “It’s gone back to Dempsey-Moore,” Madden said, adding he would remove the line across the centre, and debate the size of the circle, to reconfigure the contest. “Everyone would have to move to the ball.” He doesn’t think anyone would notice if the bounce was scrapped.\n\nAlthough the reason for the next major change was sound, the rot set in when the AFL limited the ruckman’s run-up to 10m in 2005 to protect them against posterior cruciate ligament injuries which occurred when knee hit knee. Four years later, the chaotic element was minimised again when umpires were empowered to recall an errant bounce at a stoppage and replace it with a throw-up. It followed controversy when North Melbourne midfielder Adam Simpson was gifted a centre clearance in 2008 that led to a vital goal against Collingwood in round seven that season. That decision started the decline of the centre bounce into the relic it is now. A senior club official argued that the game should be wary of yielding to coaches’ need for certainty in an era when fans crave the uncertainty sport provides. The bounce, he argued, should be retained on that basis.\n\nLoading But what we have is a facade of the centre bounce. Another real debate is needed. Scrap it forever in the interests of fairness, protecting umpires’ backs and Hardwick and his ilk, or return it to the wonderful random tradition it once was by removing the recall. Incoming football operations boss Greg Swann needs to convince the AFL Commission to back the bounce or sack it. If they sacked what we have now, in less than a season, no one would miss it.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/sydney-eating-out/12-bustling-french-bistros-and-brasseries-for-bastille-day-and-beyond-20250711-p5me70.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "12 bustling French bistros and brasseries for Bastille Day and beyond",
        "publish_date": "Fri, 11 Jul 2025 11:54:51 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Collection\n\n12 bustling French bistros and brasseries for Bastille Day and beyond\n\nThe next best thing to actually dining in Paris this summer? Soaking up the atmosphere – and the steak frites and Chablis – at these charming Sydney venues, instead.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/a-bag-for-the-ages-original-birkin-auctioned-for-15-3-million-20250711-p5me5p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A bag for the ages: original Birkin auctioned for $15.3 million",
        "publish_date": "Fri, 11 Jul 2025 11:47:59 +1000",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "A handbag created for the English singer and actress Jane Birkin by the French luxury label Hermès has become the ultimate status symbol after selling for €8.6m ($15.3 million) at auction in Paris.\n\nA 10-minute bidding war at Sotheby’s, reportedly involving newlywed Lauren Sanchez Bezos, started at €1 million and ended with a private collector from Japan placing the winning bid by phone.\n\nThe original Birkin at Sotheby’s, Paris was made for Birkin in 1984. Credit: AP\n\nEven with the notoriously long waiting lists for Hermès’ Birkin handbags, carried by various Kardashians, Victoria Beckham and Australian publicist Roxy Jacenko, $15.3 million is a big price to pay for jumping the queue.\n\nReports on entry-level prices for Birkin bags vary from $15,000 to $30,000, depending on availability, size and the leather used.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/i-gave-up-booze-five-years-ago-these-are-the-10-questions-i-always-get-asked-20250709-p5mdrk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I gave up booze five years ago: these are the 10 questions I always get asked",
        "publish_date": "Fri, 11 Jul 2025 11:45:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Genevieve Quigley"
        ],
        "text": "Five years ago, I did Dry July. A well-intentioned month off grog. And here I am, still going. Still not drinking.\n\nIt wasn’t the plan to put down my wine glass for good, but life had other ideas. My mother passed away, I hit a few health bumps, and somewhere in the quiet of it all I realised that booze was taking more than it was giving. So I stopped.\n\nSince then, I’ve written about life on the other side of the bottle, and if there’s one thing I’ve learnt, it’s that when you respond to a friendly “wine?” with a polite “no thanks, I don’t drink”, people have questions. Lots of them. So here are the ones I get asked the most, and how I answer them.\n\nWhen you tell people that you don’t drink, they have questions. Credit: Getty\n\nWhy? (Usually asked with either a look of horror or concern – or both)",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/the-17-club-by-club-nrl-seasons-explained-in-one-graphic-20250709-p5mdr2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The 17 club-by-club NRL seasons explained in one graphic",
        "publish_date": "Fri, 11 Jul 2025 11:44:58 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "Critical to that balance is Canterbury’s kicking game, where Toby Sexton has taken significantly more responsibility this season. His 11 forced drop-outs rank him equal-fourth in the NRL alongside Nathan Cleary.\n\nCanberra ‘Faders’? Not any more. They haven’t been for a couple of seasons actually but, per Fox Sports, only the Dolphins (252) have scored more second-half points than the Raiders’ 224 this year. Ricky Stuart’s men – once infamous for blowing match-winning leads – have secured four wins already in 2025 after trailing at half-time, along with another three victories when the scores were level at the break.\n\nCronulla’s four losses from their past five starts have hit coach Craig Fitzgibbon where it hurts most – with the Sharks’ defensive application falling off a cliff. For all the focus on Nicho Hynes and their playmaking spine, Cronulla have been easy pickings in the middle of late, dropping off tackles and conceding offloads – and then tries – at an alarming rate.\n\nThe Dolphins attack is flying despite a slew of sidelined forwards, but Isaiya Katoa is the story of their season. His 17 try-assists lead all comers and, across pretty much every playmaking statistic, his year-on-year improvements reflect a breakout campaign for the 21-year-old. Des Hasler was signed by the Titans with a remit of lifting the club out of its institutionalised mire, while defensive frailties were cited as a key factor in Justin Holbrook’s surprise dismissal 18 months ago. Somehow the Gold Coast have become even worse without the ball under Hasler – whose defensive systems have held up across the rest of his career – and the drums are beating loudly that another coach will be in charge by summer.\n\nDaly Cherry-Evans’ form has rightly been under the microscope throughout Manly’s hit-and-miss campaign, but there’s no doubting the Sea Eagles will miss his right-edge combination with Haumole Olakau’atu once the skipper is gone. Manly’s 35 tries down their right edge (where Tom Trbojevic has now slotted in at centre) are easily the most scored down that channel in the NRL – and they’re twice as likely to strike than on the left, where Luke Brooks runs the show.\n\n\n\nThe Storm haven’t been their uber-consistent selves this year – and no one knows this better than Craig Bellamy – but if they extend their opening quarters across a full game … good night. Melbourne rank first for points scored and conceded in the first 20 minutes and are also racking up tries for fun. Their 32.33 points a game is on track to join the best attacking sides in history – only the all-conquering Dave Brown-led Roosters of 1935 (35.2 points per game), and the 2021 Storm (33.1), have been more devastating with ball in hand. The Knights attack – averaging 14.81 points a game – is on par with some of the worst offensive seasons in the club’s history. Aside from the 2016 wooden spoon (12.7 points a game), we’re trawling back to their formative years for such trying times. Newcastle’s defence (19 points conceded a game) is ranked third in the NRL and keeping them alive, but nine scoreless first halves says it all.\n\nRight next to Newcastle on the ladder, yet dealing with the exact opposite issue, North Queensland’s best defensive effort of the season was the 16 points they kept Souths to in round six. Since the start of May, opposition sides have managed at least four tries a game against Todd Payten’s team. Penrith’s rise up the ladder with four straight wins has been built on the return of their prize-winning defence, with the 48 total points conceded against Parramatta, Wests Tigers, the Warriors and Canterbury in line with the efforts of their premiership-winning seasons.\n\nThe first three months of 2025, they were leaking more than double those figures. Jason Ryles’ rebuild at the Eels is showing signs of life, just often not until after the half-time oranges. Parramatta’s – 144 first-half differential is the worst in the NRL. It’s cold comfort, but between the 40 and 60-minute marks this season their record is promising: eight wins, five losses and two draws.\n\nShane Flanagan is still hunting quality middle forwards and with St George Illawarra’s 1470 run metres a game ranking 15th in the NRL, it’s no surprise. The Dragons have eight backs who have averaged more than 100 metres a game this season. But excluding Michael Molo’s one game against Canberra for 115 metres, only back-rower Jaydn Su’A is churning out triple figures each week among their forwards. For the second straight season, the Rabbitohs have been rocked by a horrific injury toll that has outstripped all 16 rivals.\n\nStatistics diligently tallied each week (until the start of round 18) by the NRL Physio and Rowan Waight calculate the combined absences of Souths stars – led by Cameron Murray, Cody Walker, Jack Wighton, Latrell Mitchell, Jye Gray, Campbell Graham and Jayden Sullivan – as all but tripling that of top-four contenders Brisbane, Canterbury, Canberra and the Warriors. Last year, Souths’ 173 weeks of combined weeks missed through injuries was again significantly higher than the Warriors (122 weeks out) as the next heaviest-hit club. Fox Sports has spelled out a bizarre phenomenon for the Tricolours this year, where they spend the least amount of time attacking the opposition’s line from short-range, but are the best at doing it when they get their limited opportunities. With an average of just nine tackles inside the 20-metre zone each time they score a try, the Roosters convert that treasured field position better than anyone.\n\nTheir 75.7 per cent completion rate (16th in the NRL, but on par with Trent Robinson’s 13 years in charge) goes a long way towards explaining why they get so few chances, yet also spend more time than any side in their own 20.\n\n\n\nThe freewheeling Warriors stereotype of years past is nowhere to be found in Andrew Webster’s game plans – the Kiwi franchise is instead the NRL’s most disciplined side with ball in hand. Conceding only 5.1 penalties a game (fourth in the competition) on top of the fewest errors has served the Warriors well after their 2024 fall from finals contention.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/starc-turned-down-millions-of-dollars-in-the-ipl-he-has-no-regrets-ahead-of-his-100th-test-20250711-p5me4x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Starc turned down millions of dollars in the IPL. He has no regrets ahead of his 100th Test",
        "publish_date": "Fri, 11 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Kingston: “I don’t know why we’re talking about it so much.”\n\nIt is seven minutes and 40 seconds into a Mitchell Starc press conference, on the outfield of Sabina Park in Jamaica, two days out from the left-armer’s 100th Test for Australia starting on Saturday (Sunday 4.30am AEST).\n\nThe 35-year-old has done everything possible to deflect attention from his milestone match this week in the third and final Test of a one-sided series against the West Indies.\n\nHe answers questions politely and sincerely but there is an underlying unease at being asked to talk about himself so much.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl-turned-a-lame-attempt-at-humour-into-a-death-threat-20250711-p5me5e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL turned a lame attempt at humour into a death threat",
        "publish_date": "Fri, 11 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "You’ve got to love a dumb criminal. There was the bank robber who phoned ahead to let them know he was coming, so they could have the money ready. There was the car thief who tried to steal a manual vehicle but couldn’t get it into first gear. When I was at school, a guy got hot and sweaty while burgling a house and took his jumper off. He left it at the scene, not realising that his mum had sewn his name tag into the collar.\n\nThis week’s addition to ‘Wanted: Dumb or Alive’ is the football supporter who apparently made a “death threat” against Carlton coach Michael Voss, but sent it to the Melbourne Cricket Ground’s own anti-social hotline. The person was identified as quickly as the geniuses who post footage of themselves stealing cars on TikTok, and has been given a five-year ban from attending AFL games or any sport at the MCG.\n\nVoss, a much-admired man who has been under heavy criticism for Carlton’s performance, said he was “dismissive [of the message] at first”, but felt he should draw attention to “the dark side of football, where we blame, we become victims and it’s this environment where things are quite toxic. We think by showing passion is about anger – and it’s not about that at all.” As for the miscreant, he said, “I’m sorry, you don’t belong here.”\n\nThe AFL’s head of security and integrity, Tony Keane, made a statement: “We understand there is passion in the game, however the text message in question sent to the MCG hotline on Friday crossed the line. Regardless of the intent, no coach, player, official, staff member or fan deserves to be threatened in such a way, and now that patron has lost the privilege of attending the footy.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/umpire-clash-adam-cerra-at-risk-of-unwanted-first-after-costly-blue-20250711-p5me7j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Umpire clash: Adam Cerra at risk of unwanted first after costly blue",
        "publish_date": "Fri, 11 Jul 2025 11:38:25 +1000",
        "category": "sports",
        "authors": [
            "Andrew Wu"
        ],
        "text": "Loading\n\nCarlton midfielder Adam Cerra is in danger of becoming the first player to be referred to the tribunal for making umpire contact since the AFL’s crackdown on such incidents.\n\nCerra is waiting to see if he will be cited by the match review officer on Friday for a collision with an umpire just before half-time in the Blues’ heavy loss to the Brisbane Lions.\n\nAs it would be the fourth time Cerra has made careless contact with an umpire in the past two years, if cited, the AFL can send him to the tribunal, where he would run the gauntlet of a suspension or an increase on the standard $5000 fine for a third offence.\n\nThe Blues could also be fined $5000, exempt from the soft cap, under new guidelines which came into effect at the start of the month as part of a push by the AFL to reduce umpire contact from players.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/listen-is-the-rba-misleading-us-or-are-they-confused-themselves-20250711-p5me6o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Listen: Is the RBA misleading us, or are they confused themselves?",
        "publish_date": "Fri, 11 Jul 2025 11:34:50 +1000",
        "category": "finance",
        "authors": [
            "Jacqueline Maley",
            "Paul Sakkal"
        ],
        "text": "In a move that was disappointing to mortgagees, the Reserve Bank of Australia held interest rates on Tuesday.\n\nIt was the complete opposite of what major banks and economists predicted. So, what is going on with the RBA? Speaking with host Jacqueline Maley and chief political correspondent Paul Sakkal in a new Inside Politics podcast episode, our senior economics correspondent Shane Wright answers the question everyone is asking: Is the RBA misleading the public, or are the leaders within our central bank confused themselves?\n\nClick the player below to listen to the full episode, or read on for an edited extract of the conversation.\n\nJacqueline Maley: On Tuesday, RBA head Michele Bullock and her colleagues dashed all our hopes, and she kept rates on hold at 3.85 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/albanese-talks-up-the-importance-of-engagement-with-china-midday-news-bulletin-11-july-2025/vzrgx98sr",
        "title": "Albanese talks up the importance of engagement with China | Midday News Bulletin 11 July 2025",
        "publish_date": "Fri, 11 Jul 2025 02:09:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPrime Minister Anthony Albanese is emphasising the importance of engaging with China.\n\n\n\n\n\nHe will embark on a six-day visit to the country, starting tomorrow [[Saturday]], and will meet with the country's leadership, including President Xi Jinping.\n\n\n\n\n\nMr Albanese says the face-to-face meetings are important on multiple fronts\n\n\n\n\n\n\"Engaging in our national interest is important for our security, to be able to raise issues one-on-one with the Chinese leadership. But of course it is important for our economic interests as well.\"\n\n\n\n\n\nMr Albanese will be accompanied by business leaders, as he tries to further enhance trade ties between Australia and China.\n\n\n\n\n\n25 per cent of Australian exports go to China, making it by far Australia's most significant trading partner.\n\n\n\n\n\n+++\n\n\n\n\n\nConcerns are being raised that the new national plan to combat antisemitism in Australia could stifle free speech.\n\n\n\n\n\nOne recommendation made to the federal government by antisemitism envoy Jillian Segal is to strip funding from organisations that fail to address hatred against Jews.\n\n\n\n\n\nSome, including the National Union of Students and the Australian Jewish Council, are worried that hurt those making legitimate criticism of Israel, particularly admidst the current conflict in the Middle East.\n\n\n\n\n\nSpeaking with SBS Arabic, a Board Director of Palestine Australia Relief and Action, Reem Borrows, is concerned advocacy for Palestinians will be deemed antisemitic.\n\n\n\n\n\n“Let’s be very clear; we unequivocally condemn any form of racism. For context, antisemitism is not a Palestinian construct. The Palestinian struggle has always been about freedom, dignity, and equal rights, not just for ourselves but for all people. So it is deeply troubling to see legitimate criticism of the Israeli government, especially regarding Gaza, being conflated with antisemitism.”\n\n\n\n\n\nMs Segal says these concerns are misplaced, and only those calling for the elimination of the state of Israel will be deemed to be antisemitic.\n\n\n\n\n\n+++\n\n\n\n\n\nThe Prime Minister says he will not be providing the reasoning behind a 62 year-old Palestinian woman being detained as a national security risk.\n\n\n\n\n\nA document seen by SBS News revealed national security agency ASIO [[ay-zee-oh; Australian Security Intelligence Organisation]] assessed Maha Almassri to be \"directly or indirectly a risk to security\".\n\n\n\n\n\nHer family has told SBS Arabic Ms Almassri lost family members, before fleeing Gaza.\n\n\n\n\n\nHer brother Solomon has condemned the government for detaining Ms Almassri, who he describes as a harmless old woman.\n\n\n\n\n\n\"They just came a bunch of police officers and some federal police and they just stormed the house and they had a search warrant. And they terrorised everyone inside the house.\"\n\n\n\n\n\nHe was not present when she was arrested at another family member's home yesterday [[10 July]].\n\n\n\n\n\nAustralia's Migration Act grants the Home Affairs Minister — or a chosen delegate — the right to cancel a person's visa on character grounds if it is deemed to be \"in the national interest\".\n\n\n\n\n\n+++\n\n\n\n\n\nMembers of the Bosnian community in Australia have gathered to mark the Srebrenica [[shreb-ra-nitz-uh]] Massacre, on the anniversary of the tragedy.\n\n\n\n\n\nIn 1995, more than 8000 Bosniak Muslim men and boys were killed near the town of Srebrenica in Bosnia and Herzegovina.\n\n\n\n\n\nThe international court of justice has since recognised the event as an act of genocide - the worst since the second world war.\n\n\n\n\n\nSelma Music [[mew-sitch]] is a clinical psychologist who lost a parent in the Bosnian War.\n\n\n\n\n\nDr Music has told SBS Bosnian coming together to remember the event helps survivors and loved ones of those who died cope.\n\n\n\n\n\n\"For various reasons, including that we share together the experiences of what has happened, but also that we alleviate a little bit of the pain and suffering that we carry with us every day.\"\n\n\n\n\n\nMany families still don't know what happened to their loved ones in Srebrenica, with around 1000 people missing since the atrocity.\n\n\n\n\n\n+++\n\n\n\n\n\nPolice are treating a fire at a Sydney childcare centre in the early hours of this morning [[11 July]] as suspicious.\n\n\n\n\n\nPlay to Learn in Turramurra on Sydney's upper-north shore was set alight, with the directors alerted around four thirty in the morning.\n\n\n\n\n\nThe centre's operations manager, Gemma Quinlan, has told Channel Nine she has no idea why the centre was targeted.\n\n\n\n\n\n\"We're here to serve the community, we're here for our families and our children. We've been operating for 19 years on the Central Coast and have an amazing reputation up there. We have generations of families who have been through Play to Learn and this has never happened to Play to Learn before. We are absolutely dumbfounded and it just hurts.\"\n\n\n\n\n\n+++\n\n\n\n\n\nOn World Population Day, which is today [[jul 11]], experts are urging state and federal governments to use the challenge of an ageing population as an opportunity to develop transport infrastructure.\n\n\n\n\n\nDr Sohani Liyanage is a Research Fellow in Sustainable Transport at Swinburne University of Technology who spoke with SBS Sinhala.\n\n\n\n\n\nShe says the nation needs to move beyond building more roads and concentrate on developing public transport networks, especially those living in less-connected areas.\n\n\n\n\n\n\"Many people in outer suburban areas face longer travel times, fewer options and higher transportation costs. So, the government needs to invest not just in services, but the things like lower fairs, paid passes and safe bike lanes. And more accessible stops and stations. \"\n\n\n\n\n\n+++\n\n\n\n\n\nU-S President Donald Trump says he'll impose a 35 per cent tariff on goods from neighbouring Canada- and is threatening to make the rate even higher if Canada retaliates.\n\n\n\n\n\nThe tariff will go into place on the 1st of August, much like Mr Trump's proposed tariffs against Brazil, and other countries.\n\n\n\n\n\nBut Brazilian President Lula da Silva has not been cowed by Mr Trump's threats against retaliation, saying he will impose reciprocal tariffs on U-S goods if a diplomatic solution cannot be found.\n\n\n\n\n\nMr Trump has threatened 50 per cent tariffs on Brazilian goods, and has linked his decision on tariffs against the country to the treatment of former Brazilian President Jair Bolsonaro, who is on trial on charges of plotting a coup against Mr da Silva in 2023.\n\n\n\n\n\n+++\n\n\n\n\n\nIrishman Ben Healy has won the sixth stage of the Tour de France, becoming the first Irishman in five years to win a stage at the world's most-famous cycling event.\n\n\n\n\n\nHealy says winning the 201.5 kilometre stage from Bayeux to Virie Mormandie is a dream come true.\n\n\n\n\n\n\"To grow up watching the Tour and one day wishing that I could maybe even be there so to even be here is an achievement, and now to win a stage, is just yeah, so, so, so amazing.\"\n\n\n\n\n\nMichael Storer finished third- the best finish by an Aussie in the race so far this year.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-irelands-ben-healy-pulls-off-solo-win/48edbopyf",
        "title": "Tour de France stage six: Ireland's Ben Healy pulls off solo win",
        "publish_date": "Thu, 10 Jul 2025 20:48:13 +0000",
        "category": "sports",
        "authors": [],
        "text": "Ireland's Ben Healy won stage six of the Tour de France in Normandy overnight with a long solo break, as Mathieu van der Poel reclaimed the overall leader's yellow jersey by one second.\n\n\n\n\n\nSixth at the start of the day, Van der Poel climbed above overnight leader Tadej Pogacar.\n\n\n\n\n\nVan der Poel was billed at the start of the tour as a potential winner of stage seven to Mur de Bretagne, where he first took the yellow in 2021.\n\n\n\n\n\n\"It would be a great finale to a great week,\" said an exhausted Van der Poel.\n\n\n\n\n\n\"If I get the win or not, it'll be great anyway, just to wear the yellow jersey again.\"\n\n\n\n\n\nBelgium's Remco Evenepoel is third at 49 seconds with France's Kevin Vauquelin fourth at one minute. Jonas Vingegaard is fifth at one minute 14 seconds.\n\n\n\nHealy, 24, became the first Irish stage winner since sprinter Sam Bennett won on the Champs Elysees in 2020.\n\n\n\n\n\n\"That was so enjoyable, and once we had all got away, I discussed it with the team car and we chose that unlikely place to attack,\" Healy said.\n\n\n\n\n\n\"I'm very proud to be presenting Ireland, I'm from an Irish family and though I wasn't born there it was an option I chose as a youngster.\"\n\n\n\nStage six was intense from the off over a series of hills between Bayeux and Vire as temperatures rose above 26.5C with the peloton putting the hammer down at 47km/h average over the first three hours.\n\n\n\n\n\nHealy and Van der Poel were part of a nine-person mid-race escape who set a relentless pace.\n\n\n\n\n\nHealy broke solo, knowing if he waited for the hilly finale, he had little chance of beating the proven experts in the breakaway.\n\n\n\n\n\nHe made his move suddenly on a flat section, 32km out. As he pulled to the left and accelerated, the eight others dithered as the distance widened.\n\n\n\n\n\nFor Pogacar, allowing the Dutch powerhouse to sneak into the escape meant he lost the overall lead.\n\n\n\nOnce Healy had broken away, even Van der Poel sat up, saving energy, possibly for the run up the Mur de Bretagne — scene of his 2020 triumph to seize the tour lead he kept for eight days.\n\n\n\n\n\nBehind him, Pogacar and arch-rival Vingegaard battled up the final 10 per cent slope, but van der Poel regained the lead by the narrowest margin.\n\n\n\n'Vauquelin-mania'\n\nAfter an all-day effort, American champion Quinn Simmons came second, and Michael Storer put team Tudor on the tour podium for the first time in third.\n\n\n\n\n\nThe day started in Bayeux, renowned for its tapestry of the 1066 Norman conquest of England, and also the birthplace of the burgeoning French star Kevin Vauquelin.\n\n\n\n\n\nThe Arkea rider, 24, was the toast of the town as he left in third position on the tour, just 59 seconds adrift of Pogacar and ended in fourth overall at one minute.\n\n\n\nREAD MORE Think you could race the Tour de France? Explore the 2025 map and key stats\n\nAhead of the stage, Vauquelin hailed \"the roads where I grew up and learned to love the hills\".\n\n\n\n\n\nAt the finish line, he spoke of \"goose bumps\" as the fans cheered him along, with local media speaking of \"Vauquelin-mania\".\n\n\n\n\n\nAfter six days of racing in northern France, the Tour heads west with a 197km run from Saint-Malo over rolling hills in Brittany, finishing atop the steep climb called the Mur-de-Bretagne.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/red-flags-amid-australias-medicinal-cannabis-rise/meluoiud6",
        "title": "A script every five minutes: 'Red flags' amid Australia's medicinal cannabis rise",
        "publish_date": "Thu, 10 Jul 2025 19:42:06 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "One script every five minutes on average — that's how fast a single doctor was prescribing medicinal cannabis, raising concerns from Australia’s health regulator.\n\n\n\n\n\nAccording to the Australian Health Practitioner Regulation Agency (AHPRA), over a six-month period, some practitioners have written over 10,000 prescriptions for medicinal cannabis, with one issuing more than 17,000.\n\n\n\n\n\nAHPRA said that as of 31 December last year, 57 practitioners (medical practitioners, pharmacists and nurses) had action taken against them by a medical board over prescribing medicinal cannabis.\n\n\n\n\n\n\"Current prescribing data raises red flags that some practitioners are not meeting their professional obligations,\" AHPRA stated.\n\n\n\n\n\nAPHRA has issued new guidelines to help practitioners who prescribe medicinal cannabis, addressing concerns that \"poor practice\" may cause \"significant patient harm\".\n\n\n\n\n\nSome experts have welcomed these guidelines.\n\n\n\n\"I think it's timely for the regulator for medical practice to be putting out some clear statements on the inappropriateness of some of the prescribing,\" emeritus professor Wayne Hall, from the National Centre for Youth Substance Use Research at the University of Queensland, told SBS News.\n\n\n\n\n\nOn the other hand, some advocates say that patients still face difficulties in obtaining them through their GPs, pointing out a \"lack of education\" among the doctors, which may account for high prescribing rates among some practitioners.\n\n\n\n\n\nAPHRA noted \"in relation to the vast majority of notifications received by APHRA in this area, practitioners often respond to our involvement by modifying their practices without the need for further regulatory action\".\n\n\n\nA 'stigma' amongst GPs\n\nIn Australia, medicinal cannabis was legalised in 2016 .\n\n\n\n\n\nSince then, prescriptions increased from about 17,000 in 2020 to over 800,000 in 2024, according to the Department of Health. As patients may receive multiple prescriptions, this data doesn't show how many individuals access medicinal cannabis.\n\n\n\n\n\nOn Wednesday, APHRA warned: \"poor medicinal cannabis prescribing practices and surging patient demand are leading to significant patient harm\".\n\n\n\n\n\nIt also raised its concerns by \"patients presenting to emergency departments with medicinal cannabis induced psychosis\".\n\n\n\n\n\nHall said the \"major driver\" for the rise in prescriptions is \"profit\".\n\n\n\n\n\n\"A lot of these medical cannabis clinics that have been set up, they only prescribe cannabis, and they do it from their point of view, at a high volume of prescriptions is the way to generate a good profit margin,\" he said.\n\n\n\n\n\n\"That's what they seem to be doing without a great deal of care taken in assessing the appropriateness of prescriptions for patients.\"\n\n\n\nBut some supporters of the Australian medicinal cannabis industry argue that those seeking a prescription mostly approach doctors remotely, as there is a \"stigma\" among doctors.\n\n\n\n\n\n\"The problem is that mainstream general practice practitioners are generally reluctant to prescribe medicinal cannabis,\" Teresa Nicolleti, chair of the Australian Medicinal Cannabis Association, told SBS News.\n\n\n\n\n\n\"They don't know enough about medicinal cannabis. There's a historical concern around the prohibition before it was legalised, and whether they should be prescribing it.\n\n\n\n\n\n\"There are now hundreds of thousands of scripts being issued, but they're being issued by telehealth clinics rather than GPs. There's only a very, very small proportion of GPS who will prescribe medicinal cannabis.\"\n\n\n\n\n\nVirtual care, or Telehealth clinics, are a type of service that provides healthcare services remotely, typically through video or phone consultations\n\n\n\nLack of 'education', or lack of 'evidence'?\n\nNicolleti said one of the reasons behind this stigma is that there is \"not enough education\" among doctors about the benefits of medicinal cannabis.\n\n\n\n\n\n\"The problem is if the colleges, the peak bodies, aren't supporting it, then it's very difficult for GPs to become comfortable with it. And so until that position changes, I don't think we're going to address this,\" she said.\n\n\n\n\n\nMost medicinal cannabis products are considered unregistered medicines by Australia's Therapeutic Goods Administration (TGA), which means they haven't undergone the same rigorous assessment for safety and efficacy as registered medicines.\n\n\n\n\n\nAs a result, practitioners need the TGA's approval to prescribe medicinal cannabis products.\n\n\n\n\n\nHall said: \"The problem is that we have these drugs being prescribed for unapproved purposes, that is to treat conditions for which these drugs are not approved by the regulatory body [TGA].\"\n\n\n\nDoctors need the medicines watchdog's approval to prescribe medicinal cannabis products. Source: Getty / FG Trade He said that, alongside education, \"lack of evidence\" about some medicinal use of cannabis is also one of the reasons GPs are reluctant to prescribe.\n\n\n\n\n\n\"The great majority of prescriptions under the medical cannabis program are for things like chronic pain, sleep disorders, anxiety, and distress.\n\n\n\n\n\n\"The problem is that when the use becomes regular and people are using regularly over long periods ... They put themselves at risk of developing dependence, and the evidence for long-term effectiveness and safety is, is really not there.\n\n\n\n\n\n\"In those cases, the evidence for efficacy and safety is, is much more marginal or very lacking in the case of [conditions like] anxiety and depression.\n\n\n\n\n\n\"I think part of the reason for scepticism about medical use is that the evidence isn't there for a lot of the reasons, the medical conditions for which people seek prescriptions.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/thai-hippo-moo-deng-celebrates-her-first-birthday/x8218loow",
        "title": "Thailand's viral hippo Moo Deng celebrates her first birthday",
        "publish_date": "Thu, 10 Jul 2025 08:48:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Thailand's pygmy hippo Moo Deng marked her first birthday on Thursday, drawing crowds of diehard fans even as she left behind the cute animal infancy that earned her worldwide internet fame.\n\n\n\n\n\nBig crowds are expected at a four-day festival at Khao Kheow Open Zoo where Moo Deng — which means \"Bouncy Pork\" in Thai — frolicked to stardom and amassed five million social media followers.\n\n\n\n\n\nThe first day of the extravaganza fell on a Thai public holiday with an agenda including a lecture on \"Moo Deng's cheekiness\", while a skincare beautician paid to sponsor her fruit-festooned birthday cake.\n\n\n\n\n\nAround 100 fans gathered outside her enclosure on Thursday morning, fewer than the hordes she commanded at the height of her fame, but still animated with adoration.\n\n\n\n\n\nJennifer Tang took a week off from her work in Malaysia to make the pilgrimage, telling AFP she was \"a little bit obsessed\" with the calf she described as a \"chaos rage potato\".\n\n\n\n\"She's really special to me, she makes me happy,\" she said. Tang insisted Moo Deng is \"still really sassy and funny\" despite approaching maturity.\n\n\n\n\n\n\"Take a look at the crowd today — she's still a legend,\" she added.\n\n\n\n\n\nMoo Deng has swollen from 5kg at birth to 93kg today.\n\n\n\n\n\nShe spent her birthday plodding in her enclosure, munching fruit and vegetables, a stark contrast to the energetic yet clumsy antics that earned her fame as a pint-sized pachyderm.\n\n\n\n\n\n\"Moo Deng used to be very naughty and jumped around all the time,\" said Attaphol Nundee, one of her six handlers. \"Now she only eats and sleeps.\"\n\n\n\n\n\n\"Her popularity has slowed,\" admitted the 32-year-old. \"But some old fans have returned, and there are new ones too.\" Despite her waning fame, \"her eyes light up when people take photos of her\", he added.\n\n\n\n\n\nHer handlers are set to auction her belongings later, but it is unclear what possessions she has accumulated in her short life at the Chonburi province zoo, a two-hour drive from Bangkok.\n\n\n\n'Cute doesn't last long'\n\nMoo Deng's blubbery rose-blushed face launched a thousand memes and a plethora of merchandise, including piggy banks, party shirts and popsicles, prompting her owners to trademark her likeness.\n\n\n\n\n\nShe once quadrupled ticket sales for the zoo where she resides in a sparse, stone, five square metre public enclosure, once livestreamed 24/7 to sate the internet's appetite for her.\n\n\n\nREAD MORE Harris or Trump? Moo Deng the baby hippo has made her pick for US president\n\nThere were hopes her stardom would spotlight the plight of the endangered pygmy hippo, native to West Africa, with only around 2,500 left alive according to the International Union for Conservation of Nature. But social media and search engine metrics suggest Moo Deng's popularity peaked around late September last year before dramatically declining.\n\n\n\n\n\n\"Moo Deng went viral very quickly when she was born,\" said Joshua Paul Dale, an academic who teaches courses on the phenomenon of \"cuteness\" at Japan's Chuo University.\n\n\n\n\n\n\"Maybe part of our appreciation of cuteness is knowing that it's something that doesn't last very long,\" he told AFP.\n\n\n\n\n\nMoo Deng is part of a pantheon of captive animals who have enjoyed flash-in-the-pan popularity for their cuteness online, including Australia's Pesto the penguin and China's Hua Hua the panda.\n\n\n\n\n\nPygmy hippos have a lifespan of between 30 and 50 years.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/city-of-literature-hundreds-help-to-relocate-melbournes-oldest-bookshop/6dtfwjgqk",
        "title": "'City of literature': Hundreds help to relocate Melbourne's oldest bookshop",
        "publish_date": "Thu, 10 Jul 2025 08:09:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Book by book, hand to hand — hundreds formed a human chain to help Melbourne's oldest bookshop move to a new home, on a rainy day in the city.\n\n\n\n\n\nThe chain was formed on Thursday morning, in front of the Hill of Content bookshop, which is relocating from the Bourke Street address it has maintained since 1922.\n\n\n\n\n\nLast year, the building was sold for $5.3 million, forcing the owners of Hill of Content to vacate after 103 years.\n\n\n\n\n\n\"[The] building feels quite iconic, and we've loved our time there ... but a new chapter is starting, and we're really embracing that,\" Jaclyn Crupi, bookseller, author, and staff member at the store, told SBS News.\n\n\n\n\n\n\"It's bittersweet.\"\n\n\n\nJaclyn Crupi walked into the bookstore in 2008 and asked for a job. She said it changed her life. The bookstore is relocating 120m down the road, from 86 to 32 Bourke Street.\n\n\n\n'Get something positive out of it'\n\nRobyn Annear, the person who came up with the idea of shaping a human chain, told SBS News that she read about something similar happening in the US.\n\n\n\n\n\nShe said that she suggested the bookstore members \"get something positive out of [the relocation] and get your customers involved.\"\n\n\n\n\n\n\"It is amazing when people come in on a day when small hail is predicted, it's just fantastic.\n\n\n\n\n\n\"People love these books.\"\n\n\n\n\n\nAbout 18,000 books were packed by members, and in the human chain, hundreds helped move a few thousand of the books.\n\n\n\nVeronica Sullivan, festival director of the Melbourne Writers Festival, was among those passing books from hand to hand in the rainy weather.\n\n\n\n\n\n\"It's kind of raining a little bit, but it is an opportunity to show how much we love the store,\" she told SBS News.\n\n\n\n\n\n\"It says something about the community here in Melbourne ... It tells you how much Melbourne loves books and writing.\n\n\n\n\n\n\"We are a city of literature, and that's embedded in our cultural fabric, and the turnout is testament to that.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/rental-growth-stalls-nvidias-record-run/tlwnnc8yz",
        "title": "Rental growth stalls & Nvidia's record run",
        "publish_date": "Thu, 10 Jul 2025 07:22:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/study-says-the-burning-of-fossil-fuels-responsible-for-1-500-deaths/jbii7x1jg",
        "title": "Study says the burning of fossil fuels responsible for 1,500 deaths",
        "publish_date": "Thu, 10 Jul 2025 04:15:26 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nOne thousand five hundred.\n\n\n\n\n\nThat’s how many people according to a new report are estimated to have died just last week in Europe, specifically due to climate change.\n\n\n\n\n\nIn a new study, researchers from Imperial College London, analysed temperatures and mortality data from 12 major cities, including London, Paris, Rome, and Athens.\n\n\n\n\n\nThey found that two-thirds of the 2,300 people who died during the recent European heatwave wouldn’t have, had it not been for the additional degrees added by human-caused global warming.\n\n\n\n\n\nDr Friederike Otto, who co-authored the study, explains.\n\n\n\n\n\n\"So we looked at 12 European cities that are sort of a rough geographical spread of the continent and our major cities where lots of people live, we find that overall there are estimated to be 2,300 people who have died during that heatwave. Of these 2,300, 1,500 have only died because of climate change, they would not have died if not for our burning of oil, coal, and gas in the last century.\"\n\n\n\n\n\nThis is the first rapid attribution study to go beyond linking climate change to weather events, and instead ties it directly to human deaths.\n\n\n\n\n\nElderly populations were especially vulnerable, with more than 1,100 of the deceased aged over 75.\n\n\n\n\n\nBiostatistician at Imperial College London - Gary Konstantinoudis says it’s not just the heat itself, but the body's ability, or inability, to cope.\n\n\n\n\n\n\"Older people are reported to have impaired thermoregulatory systems. That is when the temperatures are very high, the generic population have good mechanisms to regulate heat whereas older populations, these mechanisms do not work properly, putting strain on their cardiovascular systems and thus putting them at higher risk for hospitalisation or mortality.\"\n\n\n\n\n\nThe study comes as southern Europe swelters through its second major heatwave of the season, with temperatures in Greece, Spain and southern France soaring above 42 degrees Celsius.\n\n\n\n\n\nIn Athens, a pharmacy sign displayed 44 degrees on Tuesday.\n\n\n\n\n\nTourists at the Acropolis were turned away at the gates for the second afternoon in a row, as Greek authorities closed the historic site to prevent heatstroke and other medical emergencies.\n\n\n\n\n\nRed Cross volunteer Sophia Markelos explains what they are doing to help.\n\n\n\n\n\n\"We are here today because of the heatwave that has struck Athens, to provide waters, cold waters, as the Hellenic Red Cross to all the visitors that come up to the Acropolis and papers (leaflets) that have instructions on how to deal with the heatwaves - about the (heat) stroke and also suntan (sunscreen).\"\n\n\n\n\n\nSome tourists took the closure in their stride, but others were clearly disappointed.\n\n\n\n\n\nBrandon Smith is a tourist from Australia.\n\n\n\n\n\n\"It's not ideal because when you're travelling away, you're not able to see it, so it's not good. And we're leaving.\n\n\n\nAnd yes, we're leaving tonight, so we won't get to see it.\n\n\n\nJournalist: Are you disappointed?\n\n\n\nSmith: Very disappointed.\"\n\n\n\n\n\nFurther west, France’s second-largest city Marseille has been left scorched after a wildfire tore through 750 hectares of land on the city’s outskirts.\n\n\n\n\n\nAt least ten homes were destroyed, dozens more damaged, and though no deaths were reported, the blaze forced residents into temporary lockdown.\n\n\n\n\n\nOfficials say the fire started when a car caught alight on a nearby highway.\n\n\n\n\n\nHigh winds and weeks of dry weather did the rest.\n\n\n\n\n\nIn Strasbourg, E-U Commissioner for Preparedness and Crisis Management, Hadja Lahbib, tells the European Parliament the situation is already becoming unmanageable in parts of Europe.\n\n\n\n\n\n\"In just the past ten days, thousands of hectares have burned in France, in Greece, Germany, Spain, Albania, Serbia and Turkey. We are witnessing the destruction of ecosystems that will take years, even decades to recover. And our citizens are feeling the impact of this extreme weather ... These are not distant warnings, they are the direct consequence of climate change, and they are sending us a very clear message.\"\n\n\n\n\n\n\n\nThe E-U has pre-positioned 22 firefighting planes, four helicopters, and 650 firefighters across vulnerable countries like Greece, Portugal and Spain.\n\n\n\n\n\nMs Lahbib says Europe must use every tool - technology, science, and political will - to respond before disaster strikes.\n\n\n\n\n\n\"Our teams are on standby 24/7. While national authorities led on wildfire response, we are working side-by-side with them every step of the way. And the EU can step in even before wildfires start. We are using science and technology to monitor droughts and detect fires at a very early stage. This includes the use of drones and AI to detect and respond to fires.\"\n\n\n\n\n\nAt the Vatican, Pope Leo celebrated a special Mass on Wednesday.\n\n\n\n\n\nHis homily focused on the moral imperative of climate action.\n\n\n\n\n\n\"On this beautiful day, first of all, I would like to invite everyone, starting with myself, to experience a bit of what we are celebrating, the beauty of the natural cathedral, you could say. ... At the beginning of the Mass, we prayed for conversion, our conversion, and I would like to add that we must pray for the conversion of many people inside and outside the Church who still do not see the urgency of caring for our common home.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/donald-trump-sets-new-tariffs-on-copper-imports-and-goods-from-brazil/20dmpgpfv",
        "title": "Donald Trump sets 50 per cent tariffs on copper imports, goods from Brazil",
        "publish_date": "Thu, 10 Jul 2025 03:27:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "United States President Donald Trump has launched his global tariff blitz into overdrive, announcing a new 50 per cent tariff on US copper imports and a 50 per cent duty on goods from Brazil, both to take effect on 1 August.\n\n\n\n\n\n\"I am announcing a 50% tariff on Copper, effective August 1, 2025, after receiving a robust national security assessment,\" Trump said in a post on Truth Social, an apparent reference to a national security trade investigation into the red metal that has been underway.\n\n\n\n\n\nThe announcement came hours after he also informed Brazil that its \"reciprocal\" tariff would be raised from its previous level of 10 percent.\n\n\n\n\n\nTrump first broached the copper tariff during a cabinet meeting early on Wednesday morning AEST , setting off a scramble by companies to import as much copper as soon as possible from Chile and other major suppliers.\n\n\n\nHe blamed the decline of the US copper industry on past administrations, saying copper was needed for semiconductors, aircraft, electric vehicle batteries, and military hardware.\n\n\n\n\n\n\"America will, once again, build a dominant copper industry,\" Trump wrote.\n\n\n\nTrump's Brazil tariff order\n\nTrump's Brazil tariff order came in a letter to Brazilian President Luiz Inacio Lula da Silva that vented anger over what he called the \"witch hunt\" trial of Lula's right-wing predecessor, Jair Bolsonaro.\n\n\n\n\n\nTrump's comments add to an increasingly bitter public feud that has been ongoing between him and Lula.\n\n\n\n\n\nTrump also criticised what he said were Brazil's attacks on free elections, Americans' free speech, and \"secret and unlawful censorship orders to US social media platforms\". He ordered the US Trade Representative's office to launch a new \"Section 301\" unfair trade practices investigation that could add even more tariffs, citing \"Brazil's continued attacks on the digital trade activities of American companies\".\n\n\n\nLula responded to Trump's letter by issuing a statement saying that any unilateral measure to increase tariffs would be met with a response under Brazilian law.\n\n\n\n\n\nBrazil is the 15th largest US trading partner. Top US exports to Brazil are commercial aircraft, petroleum products, crude oil, coal, and semiconductors, while Brazil's top exports to the US are crude oil, coffee, semi-finished steel, and pig iron.\n\n\n\n\n\nThe South American country has held off on implementing a digital services tax but has sought to advance legislation with stronger competition regulations on digital platforms.\n\n\n\nTrump issues tariff notices to seven minor trading partners\n\nTrump earlier on Truth Social media issued 1 August tariff notices to seven minor trading partners that exported approximately US$15 billion ($23 billion) in goods to the US last year: a 20 per cent tariff on goods from the Philippines, 30 per cent on goods from Sri Lanka, Algeria, Iraq, and Libya, and 25 per cent on Brunei and Moldova.\n\n\n\n\n\nThe latest letters add to 14 others issued earlier in the week, including 25 per cent tariffs for big US suppliers South Korea and Japan , which are also to take effect on 1 August, barring any trade deals reached before then.\n\n\n\nThey were issued a day after Trump said he was broadening his trade war by imposing a 50 per cent tariff on imported copper and would soon introduce long-threatened levies on semiconductors and pharmaceuticals.\n\n\n\n\n\nTrump's rapid-fire tariff moves have cast a shadow over the global economic outlook, paralysing business decision-making.\n\n\n\nNegotiations with the European Union\n\nTrump said trade talks have been going well with China and the European Union, which is the US's biggest bilateral trading partner.\n\n\n\n\n\nTrump said he would \"probably\" tell the EU within two days what rate it could expect for its exports to the US, adding that the 27-nation bloc had become much more cooperative.\n\n\n\n\n\n\"They treated us very badly until recently, and now they're treating us very nicely. It's like a different world, actually,\" he said.\n\n\n\n\n\nEU trade chief Maros Sefcovic said good progress had been made on a framework trade agreement, and a deal may even be possible within days.\n\n\n\n\n\nHowever, Italian economy minister Giancarlo Giorgetti had earlier warned that talks between the two sides were \"very complicated\" and could continue right up to the deadline.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/manhunt-conducted-for-cummins-stolen-baggy-green-20250711-p5me8f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Manhunt' conducted for Cummins' stolen baggy green",
        "publish_date": "Fri, 11 Jul 2025 12:10:18 +1000",
        "category": "finance",
        "authors": [],
        "text": "'Manhunt' conducted for Cummins' stolen baggy green\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/sydney-eating-out/rovollo-s-roving-pasta-cart-delivers-pici-carbonara-tableside-20250710-p5me2z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rovollo’s roving pasta cart delivers pici carbonara tableside",
        "publish_date": "Fri, 11 Jul 2025 12:04:10 +1000",
        "category": "finance",
        "authors": [
            "Erina Starkey"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\n1 / 9 Pici carbonara with guanciale. Nshot Creative 2 / 9 Mixed seafood tower. Nshot Creative 3 / 9 There’s seating inside and out. Christian Michael 4 / 9 Yellowfin tuna crudo with pickled tomato. Nshot Creative 5 / 9 Salted cucumber. Nshot Creative 6 / 9 Saffron risotto with prawns and Avruga caviar. Nshot Creative 7 / 9 Napoli cocktail made with charred focaccia vermouth. Nshot Creative 8 / 9 The venue is located at 25 Martin Place. Christian Michael 9 / 9 Spaghetti vongole. Nshot Creative Previous Slide Next Slide\n\nItalian$$$$\n\nThere’s always plenty of movement at 25 Martin Place, even so, it’s hard to miss the flaming cheese wheel at Italian restaurant and wine bar Rovollo.\n\nThe formaggio in question is a $2000 round of Parmigiano Reggiano that tours the room on a custom-made walnut and brass trolley. Tableside, the centre of the cheese is doused in rum and set alight, creating a warm basin in which pici pasta is twirled, coating the strands in melted parmesan.\n\nPasta is made in-house daily by executive chef Cami Feliciano (formerly of Seta and Woodcut), while steaks – like wagyu rump cap and Riverine tri-tip – are seared by head chef Zane Buchanan, previously of Clam Bar.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/hunt-for-rider-after-nine-year-old-girl-run-over-by-dirt-bike-20250711-p5me8c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hunt for rider after nine-year-old girl run over by dirt bike",
        "publish_date": "Fri, 11 Jul 2025 12:00:22 +1000",
        "category": "sports",
        "authors": [],
        "text": "Hunt for rider after nine-year-old girl run over by dirt bike\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/it-s-time-society-stops-underestimating-women-over-50-here-s-why-20250701-p5mbmd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It’s time society stops underestimating women over 50. Here’s why",
        "publish_date": "Fri, 11 Jul 2025 12:00:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Jo Stanley"
        ],
        "text": "The light in my bathroom is too dim. I keep discovering chin whiskers while in traffic – because that’s what red lights are for – that should never have made it past a plucking. One silver whisker was a full centimetre long! The horror! How long had it been there, glistening in the sun, and why didn’t someone tell me?\n\nWe have lived and loved, learned and led, and kept on laughing no matter what. Credit: Getty images\n\nI’m not vain or by contrast, insecure. I have a healthy acceptance of the realities of my 53 years in this skin. Even though I’m obsessed with Ricki Lake’s facelift – and maybe if I were a gazillionaire I’d consider a cheeky nip-tuck to rediscover my jawline – mostly I’m deeply grateful for a body that is healthy and strong.\n\nBut still, I wonder: if I looked younger, if no one knew my age, would I feel less like the world is trying to file me away, before I’ve even finished becoming who I’m meant to be?\n\nBecause there is no doubt that something is happening. Friends and I talk about it often – this quiet, creeping sense that we are being moved to the sidelines. A socially sanctioned diminishing of our worth and contribution. The slow fading of opportunities.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/the-goldin-age-stunning-80s-exhibition-that-anticipated-the-selfie-opens-in-perth-20250711-p5me7i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Goldin age: Stunning ’80s exhibition that anticipated the selfie opens in Perth",
        "publish_date": "Fri, 11 Jul 2025 11:57:12 +1000",
        "category": "entertainment",
        "authors": [
            "Mark Naglazas"
        ],
        "text": "One of the most remarkable photographic exhibitions ever to travel to Perth has just opened at the John Curtin Gallery.\n\nNan Goldin’s The Ballad of Sexual Dependency, a selection of images distilled from the slideshow that caused a sensation when they were first shown in the underground clubs and bars in New York in the mid-1980s.\n\nNan and Brian in bed, NYC 1983, by Nan Goldin Credit: Nan Goldin / National Gallery of Australia\n\nWhen Goldin moved from Boston to the Bowery in 1978, photography tended to either dispassionately record the life of the streets (a tradition of photo-journalism that stretched from Henri Cartier-Bresson to Robert Frank) or were more in painterly tradition of studio-based portraitists such as Irving Penn, Richard Avedon and soon-to-flourish Annie Leibovitz.\n\nGoldin, in striking contrast, used her camera like a diarist, capturing her family or “her tribe” — the post-punk, queer subculture that gathered in the cheap, rundown neighbourhood of the Lower East Side that would soon be decimated by HIV/AIDS.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-centre-bounce-has-become-a-relic-it-s-time-for-the-afl-to-bring-back-the-chaos-or-scrap-it-20250710-p5mdwu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The centre bounce has become a relic. It’s time for the AFL to bring back the chaos or scrap it",
        "publish_date": "Fri, 11 Jul 2025 11:55:00 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan"
        ],
        "text": "“What can you tell me about the centre bounce of the ball? It goes anywhere, so it’s really, really hard for the players ... if the ball bounces sideways, they’re going to move,” Suns coach Damien Hardwick said. Geelong skipper Patrick Dangerfield described it as not a “valuable enough part of the game to protect”, while Brisbane Lions coach Chris Fagan said, “I’m not a fan of the bounce ... it contributes to umpire contact. It bounces, goes all over the place.” Removing the bounce is a decision the AFL Commission can make as it was not enshrined in the 2014 Laws of the Game Charter. Under the fundamental element category of the game, it says : “At the start of each quarter and after each goal, play is resumed by a ruck contest at a centre bounce or ball-up.” Patrick Dangerfield doesn’t think the bounce is a valuable enough part of the game to protect. Credit: AFL Photos via Getty Images Removing the bounce to help reduce umpire-player contact (a counter-argument is that the certainty a ball-up provides crowds players around the umpire, making them more vulnerable) is not the only reason it has been in the gun.\n\nThose arguing for its elimination want to keep good decision makers in the game, even if they were ordinary bouncers. Let’s face it, in what other sport – apart from perhaps skating in ice hockey – are umpires required to execute a physical skill? The ball is now thrown up at all centre bounces in the AFLW. In the AFL, it has been thrown up around the ground since 2013 and umpires can be exempted from bouncing the ball due to the risk of injury. The bounce must go up within a circle 10 metres in diameter and only the rucks can contest it. If the ball goes too far from the mark, it is called back, as the game attempts to balance unpredictability with fairness. It means umpires have to execute the skill even more perfectly than in the past when no recalls were required, ruckmen weren’t nominated and any player could contest the ball where it landed.\n\nJust look below at some of the bounces from the past, from the 1975 and 1986 grand finals. Tradition? What tradition? Apart from all the rule changes, it’s also worth noting that the tradition so fiercely protected to start a grand final has not occurred in two of the past 38 deciders.\n\nIn 1987, a free kick was paid to Carlton’s Wayne Johnston before umpire Ian Robinson even had a chance to bounce the ball as five Hawthorn players stood in the square. It’s not clear why Johnston, rather than the Carlton ruckman, was awarded the kick, but no one blinked an eye. In 2023, an errant bounce was recalled, taking two seconds off the clock in the Collingwood v Brisbane Lions decider before umpire Simon Meredith threw it up for Mason Cox and Oscar McInerney. When a bounce is recalled, the clock does not reset, losing the time taken.\n\nThat famous grand final that Collingwood won by four points was defined by a centre clearance goal in which Magpies star Jordan De Goey kicked to regain the lead with less than six minutes remaining. The ball was thrown up because of a 6-6-6 position warning. That moment of uncertainty was removed in a climactic end to a great grand final and could be again if a bounce was recalled. Yet, the sky didn’t fall in.es remaining. The ball was thrown up because of a 6-6-6 position warning. Three of the final four centre bounce situations were ball-ups in the final six minutes, two due to 6-6-6 warnings and one due to a recall (which took two seconds off in the final five minutes). The AFL changed the rule at the start of this season so that umpires bounce the ball after issuing a 6-6-6 warning (as happened just before three-quarter-time time on Thursday night). It’s time for a decision on the bounce\n\nThe rule changes around the centre bounces make you wonder what is being protected. In 2025, it has degenerated into a wrestling match between ruckmen, since the AFL last year enabled straight-arm blocks providing the ruck involved was contesting the ball. It is no longer exciting to watch. Lawmakers were trying to avoid such wrestling when they introduced the centre circle across the line in 1980, following the ugly rucking spectacle that marred the 1979 preliminary final when Collingwood’s Peter Moore and North Melbourne’s Gary Dempsey wrestled like two pythons throughout the match. For half a century the game achieved that objective until a 2024 rule change was introduced for reasons unknown. “It’s gone back to Dempsey-Moore,” Madden said, adding he would remove the line across the centre, and debate the size of the circle, to reconfigure the contest. “Everyone would have to move to the ball.” He doesn’t think anyone would notice if the bounce was scrapped.\n\nAlthough the reason for the next major change was sound, the rot set in when the AFL limited the ruckman’s run-up to 10m in 2005 to protect them against posterior cruciate ligament injuries which occurred when knee hit knee. Four years later, the chaotic element was minimised again when umpires were empowered to recall an errant bounce at a stoppage and replace it with a throw-up. It followed controversy when North Melbourne midfielder Adam Simpson was gifted a centre clearance in 2008 that led to a vital goal against Collingwood in round seven that season. That decision started the decline of the centre bounce into the relic it is now. A senior club official argued that the game should be wary of yielding to coaches’ need for certainty in an era when fans crave the uncertainty sport provides. The bounce, he argued, should be retained on that basis.\n\nLoading But what we have is a facade of the centre bounce. Another real debate is needed. Scrap it forever in the interests of fairness, protecting umpires’ backs and Hardwick and his ilk, or return it to the wonderful random tradition it once was by removing the recall. Incoming football operations boss Greg Swann needs to convince the AFL Commission to back the bounce or sack it. If they sacked what we have now, in less than a season, no one would miss it.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/sydney-eating-out/12-bustling-french-bistros-and-brasseries-for-bastille-day-and-beyond-20250711-p5me70.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "12 bustling French bistros and brasseries for Bastille Day and beyond",
        "publish_date": "Fri, 11 Jul 2025 11:54:51 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Collection\n\n12 bustling French bistros and brasseries for Bastille Day and beyond\n\nThe next best thing to actually dining in Paris this summer? Soaking up the atmosphere – and the steak frites and Chablis – at these charming Sydney venues, instead.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/a-bag-for-the-ages-original-birkin-auctioned-for-15-3-million-20250711-p5me5p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A bag for the ages: original Birkin auctioned for $15.3 million",
        "publish_date": "Fri, 11 Jul 2025 11:47:59 +1000",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "A handbag created for the English singer and actress Jane Birkin by the French luxury label Hermès has become the ultimate status symbol after selling for €8.6m ($15.3 million) at auction in Paris.\n\nA 10-minute bidding war at Sotheby’s, reportedly involving newlywed Lauren Sanchez Bezos, started at €1 million and ended with a private collector from Japan placing the winning bid by phone.\n\nThe original Birkin at Sotheby’s, Paris was made for Birkin in 1984. Credit: AP\n\nEven with the notoriously long waiting lists for Hermès’ Birkin handbags, carried by various Kardashians, Victoria Beckham and Australian publicist Roxy Jacenko, $15.3 million is a big price to pay for jumping the queue.\n\nReports on entry-level prices for Birkin bags vary from $15,000 to $30,000, depending on availability, size and the leather used.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/i-gave-up-booze-five-years-ago-these-are-the-10-questions-i-always-get-asked-20250709-p5mdrk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I gave up booze five years ago: these are the 10 questions I always get asked",
        "publish_date": "Fri, 11 Jul 2025 11:45:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Genevieve Quigley"
        ],
        "text": "Five years ago, I did Dry July. A well-intentioned month off grog. And here I am, still going. Still not drinking.\n\nIt wasn’t the plan to put down my wine glass for good, but life had other ideas. My mother passed away, I hit a few health bumps, and somewhere in the quiet of it all I realised that booze was taking more than it was giving. So I stopped.\n\nSince then, I’ve written about life on the other side of the bottle, and if there’s one thing I’ve learnt, it’s that when you respond to a friendly “wine?” with a polite “no thanks, I don’t drink”, people have questions. Lots of them. So here are the ones I get asked the most, and how I answer them.\n\nWhen you tell people that you don’t drink, they have questions. Credit: Getty\n\nWhy? (Usually asked with either a look of horror or concern – or both)",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/the-17-club-by-club-nrl-seasons-explained-in-one-graphic-20250709-p5mdr2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The 17 club-by-club NRL seasons explained in one graphic",
        "publish_date": "Fri, 11 Jul 2025 11:44:58 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "Critical to that balance is Canterbury’s kicking game, where Toby Sexton has taken significantly more responsibility this season. His 11 forced drop-outs rank him equal-fourth in the NRL alongside Nathan Cleary.\n\nCanberra ‘Faders’? Not any more. They haven’t been for a couple of seasons actually but, per Fox Sports, only the Dolphins (252) have scored more second-half points than the Raiders’ 224 this year. Ricky Stuart’s men – once infamous for blowing match-winning leads – have secured four wins already in 2025 after trailing at half-time, along with another three victories when the scores were level at the break.\n\nCronulla’s four losses from their past five starts have hit coach Craig Fitzgibbon where it hurts most – with the Sharks’ defensive application falling off a cliff. For all the focus on Nicho Hynes and their playmaking spine, Cronulla have been easy pickings in the middle of late, dropping off tackles and conceding offloads – and then tries – at an alarming rate.\n\nThe Dolphins attack is flying despite a slew of sidelined forwards, but Isaiya Katoa is the story of their season. His 17 try-assists lead all comers and, across pretty much every playmaking statistic, his year-on-year improvements reflect a breakout campaign for the 21-year-old. Des Hasler was signed by the Titans with a remit of lifting the club out of its institutionalised mire, while defensive frailties were cited as a key factor in Justin Holbrook’s surprise dismissal 18 months ago. Somehow the Gold Coast have become even worse without the ball under Hasler – whose defensive systems have held up across the rest of his career – and the drums are beating loudly that another coach will be in charge by summer.\n\nDaly Cherry-Evans’ form has rightly been under the microscope throughout Manly’s hit-and-miss campaign, but there’s no doubting the Sea Eagles will miss his right-edge combination with Haumole Olakau’atu once the skipper is gone. Manly’s 35 tries down their right edge (where Tom Trbojevic has now slotted in at centre) are easily the most scored down that channel in the NRL – and they’re twice as likely to strike than on the left, where Luke Brooks runs the show.\n\n\n\nThe Storm haven’t been their uber-consistent selves this year – and no one knows this better than Craig Bellamy – but if they extend their opening quarters across a full game … good night. Melbourne rank first for points scored and conceded in the first 20 minutes and are also racking up tries for fun. Their 32.33 points a game is on track to join the best attacking sides in history – only the all-conquering Dave Brown-led Roosters of 1935 (35.2 points per game), and the 2021 Storm (33.1), have been more devastating with ball in hand. The Knights attack – averaging 14.81 points a game – is on par with some of the worst offensive seasons in the club’s history. Aside from the 2016 wooden spoon (12.7 points a game), we’re trawling back to their formative years for such trying times. Newcastle’s defence (19 points conceded a game) is ranked third in the NRL and keeping them alive, but nine scoreless first halves says it all.\n\nRight next to Newcastle on the ladder, yet dealing with the exact opposite issue, North Queensland’s best defensive effort of the season was the 16 points they kept Souths to in round six. Since the start of May, opposition sides have managed at least four tries a game against Todd Payten’s team. Penrith’s rise up the ladder with four straight wins has been built on the return of their prize-winning defence, with the 48 total points conceded against Parramatta, Wests Tigers, the Warriors and Canterbury in line with the efforts of their premiership-winning seasons.\n\nThe first three months of 2025, they were leaking more than double those figures. Jason Ryles’ rebuild at the Eels is showing signs of life, just often not until after the half-time oranges. Parramatta’s – 144 first-half differential is the worst in the NRL. It’s cold comfort, but between the 40 and 60-minute marks this season their record is promising: eight wins, five losses and two draws.\n\nShane Flanagan is still hunting quality middle forwards and with St George Illawarra’s 1470 run metres a game ranking 15th in the NRL, it’s no surprise. The Dragons have eight backs who have averaged more than 100 metres a game this season. But excluding Michael Molo’s one game against Canberra for 115 metres, only back-rower Jaydn Su’A is churning out triple figures each week among their forwards. For the second straight season, the Rabbitohs have been rocked by a horrific injury toll that has outstripped all 16 rivals.\n\nStatistics diligently tallied each week (until the start of round 18) by the NRL Physio and Rowan Waight calculate the combined absences of Souths stars – led by Cameron Murray, Cody Walker, Jack Wighton, Latrell Mitchell, Jye Gray, Campbell Graham and Jayden Sullivan – as all but tripling that of top-four contenders Brisbane, Canterbury, Canberra and the Warriors. Last year, Souths’ 173 weeks of combined weeks missed through injuries was again significantly higher than the Warriors (122 weeks out) as the next heaviest-hit club. Fox Sports has spelled out a bizarre phenomenon for the Tricolours this year, where they spend the least amount of time attacking the opposition’s line from short-range, but are the best at doing it when they get their limited opportunities. With an average of just nine tackles inside the 20-metre zone each time they score a try, the Roosters convert that treasured field position better than anyone.\n\nTheir 75.7 per cent completion rate (16th in the NRL, but on par with Trent Robinson’s 13 years in charge) goes a long way towards explaining why they get so few chances, yet also spend more time than any side in their own 20.\n\n\n\nThe freewheeling Warriors stereotype of years past is nowhere to be found in Andrew Webster’s game plans – the Kiwi franchise is instead the NRL’s most disciplined side with ball in hand. Conceding only 5.1 penalties a game (fourth in the competition) on top of the fewest errors has served the Warriors well after their 2024 fall from finals contention.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/starc-turned-down-millions-of-dollars-in-the-ipl-he-has-no-regrets-ahead-of-his-100th-test-20250711-p5me4x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Starc turned down millions of dollars in the IPL. He has no regrets ahead of his 100th Test",
        "publish_date": "Fri, 11 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Kingston: “I don’t know why we’re talking about it so much.”\n\nIt is seven minutes and 40 seconds into a Mitchell Starc press conference, on the outfield of Sabina Park in Jamaica, two days out from the left-armer’s 100th Test for Australia starting on Saturday (Sunday 4.30am AEST).\n\nThe 35-year-old has done everything possible to deflect attention from his milestone match this week in the third and final Test of a one-sided series against the West Indies.\n\nHe answers questions politely and sincerely but there is an underlying unease at being asked to talk about himself so much.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl-turned-a-lame-attempt-at-humour-into-a-death-threat-20250711-p5me5e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL turned a lame attempt at humour into a death threat",
        "publish_date": "Fri, 11 Jul 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Malcolm Knox"
        ],
        "text": "You’ve got to love a dumb criminal. There was the bank robber who phoned ahead to let them know he was coming, so they could have the money ready. There was the car thief who tried to steal a manual vehicle but couldn’t get it into first gear. When I was at school, a guy got hot and sweaty while burgling a house and took his jumper off. He left it at the scene, not realising that his mum had sewn his name tag into the collar.\n\nThis week’s addition to ‘Wanted: Dumb or Alive’ is the football supporter who apparently made a “death threat” against Carlton coach Michael Voss, but sent it to the Melbourne Cricket Ground’s own anti-social hotline. The person was identified as quickly as the geniuses who post footage of themselves stealing cars on TikTok, and has been given a five-year ban from attending AFL games or any sport at the MCG.\n\nVoss, a much-admired man who has been under heavy criticism for Carlton’s performance, said he was “dismissive [of the message] at first”, but felt he should draw attention to “the dark side of football, where we blame, we become victims and it’s this environment where things are quite toxic. We think by showing passion is about anger – and it’s not about that at all.” As for the miscreant, he said, “I’m sorry, you don’t belong here.”\n\nThe AFL’s head of security and integrity, Tony Keane, made a statement: “We understand there is passion in the game, however the text message in question sent to the MCG hotline on Friday crossed the line. Regardless of the intent, no coach, player, official, staff member or fan deserves to be threatened in such a way, and now that patron has lost the privilege of attending the footy.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/umpire-clash-adam-cerra-at-risk-of-unwanted-first-after-costly-blue-20250711-p5me7j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Umpire clash: Adam Cerra at risk of unwanted first after costly blue",
        "publish_date": "Fri, 11 Jul 2025 11:38:25 +1000",
        "category": "sports",
        "authors": [
            "Andrew Wu"
        ],
        "text": "Loading\n\nCarlton midfielder Adam Cerra is in danger of becoming the first player to be referred to the tribunal for making umpire contact since the AFL’s crackdown on such incidents.\n\nCerra is waiting to see if he will be cited by the match review officer on Friday for a collision with an umpire just before half-time in the Blues’ heavy loss to the Brisbane Lions.\n\nAs it would be the fourth time Cerra has made careless contact with an umpire in the past two years, if cited, the AFL can send him to the tribunal, where he would run the gauntlet of a suspension or an increase on the standard $5000 fine for a third offence.\n\nThe Blues could also be fined $5000, exempt from the soft cap, under new guidelines which came into effect at the start of the month as part of a push by the AFL to reduce umpire contact from players.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/listen-is-the-rba-misleading-us-or-are-they-confused-themselves-20250711-p5me6o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Listen: Is the RBA misleading us, or are they confused themselves?",
        "publish_date": "Fri, 11 Jul 2025 11:34:50 +1000",
        "category": "finance",
        "authors": [
            "Jacqueline Maley",
            "Paul Sakkal"
        ],
        "text": "In a move that was disappointing to mortgagees, the Reserve Bank of Australia held interest rates on Tuesday.\n\nIt was the complete opposite of what major banks and economists predicted. So, what is going on with the RBA? Speaking with host Jacqueline Maley and chief political correspondent Paul Sakkal in a new Inside Politics podcast episode, our senior economics correspondent Shane Wright answers the question everyone is asking: Is the RBA misleading the public, or are the leaders within our central bank confused themselves?\n\nClick the player below to listen to the full episode, or read on for an edited extract of the conversation.\n\nJacqueline Maley: On Tuesday, RBA head Michele Bullock and her colleagues dashed all our hopes, and she kept rates on hold at 3.85 per cent.",
        "source": "TheAge"
    }
]