[
    {
        "url": "https://www.9news.com.au/national/student-loan-debt-cut-hecs-help-reduction-when-it-begins/def7c171-3ad3-4145-bb8e-2259d4ac250b",
        "title": "Texts about to go out giving millions of Aussies cash boost",
        "publish_date": "Sun, 05 Oct 2025 00:04:01 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Millions of Australians are still facing a weeks-long wait ﻿to see promised student debt relief kick in after the new legislation took effect in late September.\n\nThe laws fulfil a key election pledge to cut student debt by 20 per cent for all Australians.\n\nToday, it's been revealed when people can expect to start seeing that tangible relief.\n\nNRL GRAND FINAL LIVE: Slater backs Mam's bench role to work wonders ﻿\n\nMillions of Australians are expecting a debt reduction. (iStock)\n\nThe tax office will begin applying the cut from mid-November, and anticipates that 50 per cent of people with a student debt will see the cut kick in by the end of that month.\n\nAlmost everybody else will see the cut applied to their balance by mid-December.\n\n\"Soon millions of Australians with student debt will get a text message from the ATO when the 20 per cent cut to their debt has been processed, a cut we promised during the election and have delivered,\" Assistant Treasurer Daniel Mulino said.\n\nREAD MORE: Aussies around the country are welcoming hundreds of snakes into their homes ﻿\n\nThe average ex-student will see more than $5000 wiped from their debt. (Getty Images/iStockphoto)\n\n\"This is helping millions of students and graduates across the country who have invested in their education with the next step in their lives.\"\n\nRegardless of when it kicks in, the reduction will be backdated to what a person's debt balance was on June 1, before indexation.\n\nPeople will be notified by text message or email when the cut happens and will be able to check their accounts to see their new lower balance.\n\nFor someone with the average debt of $27,600, this will see $5520 wiped.\n\nNo action from debtors is required to ensure the cut is applied - it will happen automatically.﻿\n\n\"We promised we would cut your student debt by 20 per cent and we are delivering,\" Education Minister Jason Clare said.\n\n\"This is a big deal for 3 million Australians.\n\n\"This cut is already locked in to people's balances at 1 June but soon they will be able to see it and feel it.\n\n\"Just out of uni, just getting started, this is taking a weight off their back.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/anz-third-big-bank-to-rule-out-another-rate-cut-this-year/61f6d0cb-480b-4c31-9c60-1cf19196a22d",
        "title": "Major bank gives update no one wants to hear",
        "publish_date": "Sun, 05 Oct 2025 01:27:51 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "ANZ has become the third of the big four banks to strike down predictions of another cut to interest rates in 2025.\n\nThe bank now expects the next cut to come in February 2026, in a blow for mortgage-holders.\n\nIn the past eight days, three of the major banks have changed their economic forecasts on the cash rate, shifting the next anticipated RBA cut from November to next year.\n\nANZ is now not predicting another rate cut before 2026. (NilsBV/iStock)\n\nANZ and Commonwealth both expect the cut to come in February, while the NAB anticipates a wait until May.\n\nAll three banks expect just one more cut in the cycle.\n\nWestpac is still forecasting cuts in November, February, and May, but its economics team said a November cut was \"far from assured\".﻿\n\nREAD MORE: Texts about to go out giving millions of Aussies cash boost ﻿\n\nThe growing uncertainty around a further cut this year has prompted a warning to borrowers to be on the lookout for a competitive r﻿ate.\n\n\"Households waiting for the RBA to swoop in with a cut could be waiting a while. If you want to get ahead on your mortgage, take matters into your own hands by shopping around for a sharper rate,\" Canstar data insights director Sally Tindall said.\n\n\"Owner-occupiers paying down their debt might be able to pick up a deal under 5.25 per cent, while investors can aim for under 5.5 per cent, particularly if they're willing to pay both principal and interest. If you're paying significantly more, it's time to take action.\"\n\nShe said cashback deals, while not as \"abundant\" as they were at their 2023 peak, were still available from multiple lenders.\n\nAnd frequent flyer points were also being offered with loans from multiple banks.\n\n\"However, with any upfront sweetener, borrowers should remember, free flights and cold hard cash might sound appealing, but the real savings typically come from securing a low interest rate, particularly on larger loans and especially if you're unlikely to refinance regularly,\" Tindall said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/japan-likely-new-prime-minister-sanae-takaichi/e53e8977-e3e1-4fd3-a13c-0a6d72752a20",
        "title": "The woman who is set to be Japan's next leader",
        "publish_date": "Sat, 04 Oct 2025 22:57:48 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "In a country that ranks poorly internationally for gender equality, the new president of Japan's long-governing Liberal Democrats, and likely next prime minister, is an ultra-conservative star of a male-dominated party that critics call an obstacle to women's advancement.\n\nSanae Takaichi, 64, admires former British Prime Minister Margaret Thatcher and is a proponent of former Prime Minister Shinzo Abe's conservative vision for Japan.\n\nTakaichi is the first female president of Japan's predominantly male ruling party that has dominated Japan's postwar politics almost without interruption.\n\nSanae Takaichi, the newly-elected leader of Japan's ruling party, the Liberal Democratic Party (LDP). (AP)\n\nShe hardly touched on gender issues during the campaign, but on Saturday, as she tried out the party president's chair and posed for a photo as is customary for the newly elected leader, Takaichi said: \"Now that the LDP has its first female president, its scenery will change a little.\"\n\nFirst elected to parliament from her hometown of Nara in 1993, she has served in key party and government posts, including minister of economic security, internal affairs and gender equality.\n\nFemale lawmakers in the conservative Liberal Democratic Party who were given limited ministerial posts have often been shunned as soon as they spoke up about diversity and gender equality. Takaichi has stuck with old-fashioned views favoured by male party heavyweights.\n\nTakaichi celebrates with Prime Minister Shigeru Ishiba after winning the LDP leadership election. (Getty)\n\nTakaichi also admits she is a workaholic who would rather study at home instead of socialising. After unsuccessfully running for party presidency twice in the past, she made efforts to be more sociable to build connections as advised, she said.\n\nBut on Saturday, as she called for an all-out effort to rebuild the party and regain public support, she asked all party lawmakers to \"work like a horse.\" Then she added, \"I will abandon the word 'work-life balance.' I will work, work, work and work.\"\n\nThe \"work-life balance\" quickly trended on social media, triggering mixed reactions – support for her enthusiasm and concern about her work ethic.\n\nJapan's politics are largely male-dominated. (AP)\n\nWomen comprise only about 15 per cent of Japan's lower house, the more powerful of the two parliamentary chambers. Only two of Japan's 47 prefectural governors are women.\n\nA drummer in a heavy-metal band and a motorbike rider as a student, Takaichi has called for a stronger military, more fiscal spending for growth, promotion of nuclear fusion, cybersecurity and tougher policies on immigration.\n\nShe vowed to drastically increase female ministers in her government. But experts say she might actually set back women's advancement because as leader she would have to show loyalty to influential male heavyweights. If not, she risks a short-lived leadership.\n\nTakaichi has backed financial support for women's health and fertility treatment as part of the LDP policy of having women serve in their traditional roles of being good mothers and wives. But she also recently acknowledged her struggles with menopausal symptoms and stressed the need to educate men about female health to help women at school and work.\n\nTakaichi supports the imperial family's male-only succession, opposes same-sex marriage and a revision to the 19th-century civil law that would allow separate surnames for married couples so that women don't get pressured into abandoning theirs.\n\nShe is a wartime history revisionist and China hawk. She regularly visits Yasukuni Shrine, which Japan's neighbours consider a symbol of militarism, though she has declined to say what she would do as prime minister.\n\nPolitical watchers say her revisionist views of Japan's wartime history may complicate ties with Beijing and Seoul.\n\nHer hawkish stance is also a worry for the LDP's longtime partnership with Komeito, a Buddhist-backed moderate party. While she has said the current coalition is crucial for her party, she says she is open to working with far-right groups.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/october-long-weekend-2025-trading-hours-whats-open-closed-state-by-state-explainer/74ddecf0-2629-4ccf-b4bb-bc56b07dafbb",
        "title": "What will and won't be open on the public holiday",
        "publish_date": "Sat, 04 Oct 2025 22:45:53 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Millions of Australians will have some time off this weekend as they celebrate one of two public holidays.\n\nFor Aussies in South Australia, New South Wales and the Australian Capital Territory, it will be their Labour Day.\n\nQueensland residents will have a public holiday on the same day to commemorate the King's Birthday.\n\nSo what will be the trading hours for Australia's biggest retailers this long weekend?\n\nHere's a quick state-by-state guide. ﻿\n\nColes\n\nStores across NSW, ACT and QLD will be open as normal.\n\n﻿In SA, all stores will be closed except for﻿ Port Lincoln, Port Pirie, Berri, Port Augusta, Mount Barker, Adelaide Rundle Place, Whyalla, Murray Bridge Green, Mount Gambier and Victor Harbor.\n\nFull trading hours can be found on their website .\n\nAldi\n\nStore hours will vary for different stores and states.\n\nFull trading hours for each store can be found on their website﻿\n\nREAD MORE: When October long weekend double demerits apply for motorists\n\nAldi recommends that customers check their local stores trading hours on their website (Nine)\n\nWoolworths\n\nAll stores except for some in South Australia and the Northern Territory will be open.\n\n﻿Full trading hours can be found on their website .\n\nLiquorland\n\nStores in states celebrating the public holidays will trade with reduced trading hours.﻿\n\nIn Queensland,﻿ some stores will be closed for the public holiday.\n\nFull trading hours can be found on their website .\n\nREAD MORE: How to maximise public holidays and make the most of your annual leave in 2025\n\nSome stores in Queensland will be closed for the public holiday. (Jon W / Event Photos Australia)\n\nDan Murphy's and BWS\n\n﻿Dan Murphy's stores nationwide will mostly open from 10am to 7pm.\n\nBWS stores will mostly open from 9am and close between 7pm and 8pm.\n\nFull trading hours can be found on their website﻿ .\n\nBunnings﻿\n\nAll Bunnings stores will be open on the October long weekend.\n\nMost stores in states where there is a public holiday will be open from 7am to 7pm.﻿\n\n﻿Shoppers are advised to use the Bunnings website or app to check their local store's trading hours, as opening times will vary.\n\nBunnings stores statewide will remain open on the public holidays. (Supplied)",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/esperance-tropical-green-turtle-visitor-north-west-wa/105839222",
        "title": "Tiny endangered tropical sea turtle found far from home in WA",
        "publish_date": "Sat, 04 Oct 2025 23:58:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "How did a tropical reptile, only slightly bigger than a dinner plate, end up on Western Australia's south coast hundreds of kilometres from home?\n\nThat's what wildlife carers have asked after a juvenile green turtle, in poor condition, washed up on a beach in Esperance, 800 kilometres south-east of Perth, last week.\n\nThe juvenile sea turtle was found in poor condition at Wylie Bay, a popular beach just east of Esperance. (Supplied: Lori-Ann Shibish)\n\nThe unlikely traveller, usually found in the warm waters along the north-west of WA, had a large gash above its front flipper, was sluggish and had what appeared to be an eye infection.\n\nRush to help\n\nThe injured animal was quickly transferred to the nearby Esperance Wildlife Hospital by a young family who found it washed ashore at Wylie Bay, about 10km east of town.\n\nHospital co-founder Lori-Ann Shibish said the initial treatment over several days was done alongside Dr Alex Hockton under the advice of Perth Zoo veterinary staff.\n\nLori-Ann Shibish says she was surprised a tropical sea turtle was found this far south. (ABC Esperance: Andrew Williams)\n\n\"It had a huge gash on the top of its right flipper. It was cut right open and you could see the muscle,\" she said.\n\n\"And the last issue it had was when we put it in the water, it was floating, so it could not dive, which indicated it somehow had air trapped in its shell.\"\n\nMs Shibish said a plan was then hatched to transport the turtle to Perth for more specialist care, with a call put out on social media for any potential volunteers to make the drive.\n\nJade Sing agreed to help and was dubbed the \"turtle taxi\".\n\nJade Sing volunteered to transport the injured turtle 800km to Perth. (Supplied: Lori-Ann Shibish)\n\nIt takes a village\n\nWA Wildlife Hospital chief executive Dean Huxley said the turtle was in poor condition on arrival.\n\n\"When it came to us, it was very lethargic and quite weak,\" he said.\n\nIn addition to the large wound on its front flipper, it appeared to have had a run-in with a predator in the past.\n\nThe green turtle had a large gash across one of its front flippers. (Supplied: WA Wildlife Hospital)\n\n\"Its back flippers had sustained an old injury … so at some point it's been attacked, potentially by a shark,\" Mr Huxley said.\n\n\"Both of its back flippers were pretty much bitten in half, so it really only has the use of its two front flippers.\"\n\nFortunately, the turtle is on the road to recovery, and Mr Huxley said it could not have been done without help from the community.\n\nDean Huxley says saving the turtle would not have been possible without the community coming together. (Supplied: WA Wildlife Hospital)\n\n\"This is a really good example of the whole community working together. There were a lot of different groups involved in this turtle's rescue,\" he said.\n\n\"It just goes to show that no one group can do all this, and it really does take a village.\"\n\nMr Huxley said the turtle would remain under the hospital's care until it fully recovered and would then be transported back to its natural habitat.\n\nThe WA Wildlife Hospital has cared for the young turtle since it arrived in Perth. (Supplied: WA Wildlife Hospital)\n\n\"It's going to have to be flown back up north so that it can be released back into its normal area,\" he said.\n\n\"Probably somewhere near Broome or Port Hedland.\"\n\nNot the first vagrant\n\nThe green turtle is not the first \"vagrant\" to have been found in the waters near Esperance in the last few years.\n\nIn January 2023, a westland petrel was found at Wylie Bay, the first time the species had ever been recorded in WA.\n\nThe green turtle was found by a young family at Wylie Bay, just east of Esperance. (ABC Esperance: Andrew Williams)\n\nThen, just months later, three Fiordland crested penguins, one of the world's rarest species of penguin, were found along the Esperance coastline.\n\nThe penguins are normally found along the south-western tip of New Zealand's South Island, almost 4,000km away.\n\nIn 2023, Lori-Ann Shibish helped nurse three Fiordland crested penguins back to health. (ABC Esperance: Emily Smith)\n\n\"A lot of these animals show up and they're very malnourished and in poor physical condition,\" Ms Shibish said.\n\n\"There is something happening in the lives of these animals which is causing them to move further away from their normal habitats.\n\n\" We're just not sure what that is. \"\n\nUncommon but not unheard of\n\nMurdoch University researcher Jenna Hounslow is a movement ecologist who studies where animals move and why.\n\nShe said while the juvenile green turtles' appearance in the state's south coast waters was not the norm, it was not unheard of.\n\nJenna Hounslow says green turtles rarely travel further south than Shark Bay. (Supplied: Jenna Hounslow)\n\n\"This is definitely outside of their southerly range limit [Shark Bay],\" Dr Hounslow said.\n\n\"Any further south and the water would be getting a bit cold for them.\"\n\nShe said there could be many reasons as to why the reptile ranged so far south.\n\n\"It may have been caught on the warm water Leeuwin current, which runs north to south down the west coast,\" she said.\n\n\"And it could also be related to the marine heatwave that WA has been experiencing since this time last year.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/easy-make-ahead-meal-prep-dinners-for-busy-weeknights/105668174",
        "title": "Minimise weeknight cooking with these easy, big-batch recipes",
        "publish_date": "Sat, 04 Oct 2025 23:58:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's always reassuring to have a few meals stashed in the fridge or freezer.\n\nCut down on weeknight cooking with these options that feed between six and eight people.\n\nAlternating between pasta sheets and thinly sliced zucchini increases the veggie content of this comforting dish. (ABC Everyday: Tim Grey)\n\nDon't have all afternoon to make a lasagne? Same. This version uses layers of fresh zucchini and frozen peas. The only cooking you'll need to do is making a quick crème fraîche sauce with leeks.\n\nCooking tips: Save time by using pre-shredded cheese.\n\nThis one-tray chicken tandoori bake delivers on flavour and saves on time and dishes. (ABC TV: Wesley Mitton)\n\nThis recipe is popular for a reason. Six chicken thighs bake on top of biryani-inspired rice that's spiced and soaks up the flavour of both the chicken thighs and stock as they cook.\n\nCooking tips: The prep time is a fast 15 minutes but be sure to factor in an hour for the chicken to marinate.\n\nThis pea and ham soup is a fresh and bright take on a classic winter meal in time for spring. (ABC News: Eve Wilson)\n\nFrozen peas replace split peas in this vibrant take on a classic winter dish. While this dish has a long cook time, you'll be rewarded with a meal that feeds between 6-8.\n\nCooking tips: This soup freezes well, but the ham will become saltier when frozen then defrosted, so season with this in mind if freezing.\n\nThe ingredients I've used here are purposefully basic and pantry-friendly. (ABC News: Hetty Lui McKinnon)\n\nBolognese is a favourite in many homes and this vegetarian version uses pantry staples, hopefully saving you a trip to the shops and some money, too.\n\nCooking tips: Option to add cream to the bolognese before serving. Swap the tomato paste for a spice paste like harissa or gochujang if you enjoy a bit of heat.\n\nLittle effort, huge reward. This simple recipe leaves you with two creamy mushroom tarts to share, or keep. (ABC Everyday: Tim Grey)\n\nMake two mushroom and cheese tarts in 35 minutes using store-bought puff pastry. Savoury tarts can be served at room temperature or hot alongside a salad.\n\nCooking tips: There's only 15 minutes prep in this recipe. The ingredients are sliced and assembled before it's time to bake.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/greens-leader-larissa-waters-unsure-about-tasmanian-wind-farm/105853456",
        "title": "Greens leader 'doesn't know very much' about wind farm opposed by colleagues",
        "publish_date": "Sat, 04 Oct 2025 23:25:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Greens leader Larissa Waters has avoided stating a position on the Robbins Island wind farm, a renewables project opposed by two of her parliamentary colleagues.\n\nThe Tasmanian project, a 100-turbine facility that would be Tasmania's largest, is fervently opposed by the minor party's two Tasmanian senators, Nick McKim and Peter Whish-Wilson, on the grounds it threatens several endangered species.\n\nSenator Waters told the ABC's Insiders she was not familiar enough with the high-profile project to state a position but that renewables projects should not unduly threaten biodiversity.\n\nRobbins Island wind farm approved after years of delays Photo shows Robbins Island, Tasmania A 100-turbine wind farm, the largest in Tasmania, will be built on Robbins Island in north-west Tasmania following seven delays to the decision, and multiple court appeals.\n\n\"I don't know very much about that … we will be looking at that closely,\" she said.\n\n\"I accept it has to be in the right place and if this one isn't, let's look at somewhere else to put it…\n\n\"We are going to need to balance the need for large-scale and small-scale renewable energy against the needs of biodiversity and I don't think it's beyond our ability.\"\n\nEnvironment Minister Murray Watt granted conditional approval to the Robbins Island wind farm in August, imposing 88 requirements on the operator to safeguard species including the critically endangered orange-bellied parrot and the endangered Tasmanian devil and Tasmanian wedge-tailed eagle.\n\nSenators McKim and Whish-Wilson released a joint statement condemning that decision, saying it was \"the worst possible place anyone could build a wind farm\".\n\n\"The approval of this obviously inappropriate project will only serve to undermine community confidence in our already flailing rollout of renewable energy,\" Senator Whish-Wilson said.\n\n\"Of course we need more renewable energy projects, but this is the wrong project in the wrong place,\" Senator McKim said.\n\nVeteran former Greens leader Bob Brown, a Tasmanian, has also campaigned against the farm through his foundation.\n\nOrange-bellied parrots are critically endangered. (Supplied: Orange-bellied Parrot Program)\n\n'No-go zones' should be in environmental reforms\n\nSenator Waters said the renewables rollout should be accelerated with long-awaited reforms to environmental laws.\n\nLabor tried to pass those reforms in the last term, balancing the concerns of environmental groups and businesses who say major projects take too long to obtain a \"yes\" or \"no\".\n\nEfforts have been renewed under Murray Watt and appear closer to success, but the government has not detailed any changes to the proposal that failed to pass in the last parliament.\n\nThe Greens want the environment minister to be required by law to consider the impacts of major infrastructure projects on climate change, viewing renewables projects more favourably and effectively preventing new fossil fuel projects.\n\n\"That will continue to be a core demand of ours. You can't have environmental laws that don't protect the environment or think about the climate impacts of what we do,\" she said.\n\nSenator Waters said the government should end native forest logging and should ensure its environmental laws designate \"no-go zones\" where applications are not considered, citing the Bowen Basin.\n\nThe Greens leader did not endorse the Climate Change Authority's advice that wind power should quadruple by 2035 in alignment with its recommended emissions reduction goal of 62 to 70 per cent on 2005 levels.\n\n\"I support quadrupling renewable energy. I have an open mind as to what particular technology will be the most efficient,\" she said, adding Labor's climate target was \"pathetic\" and \"will imperil us all\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/robertson-celebrates-30-years-since-babe-was-shot-in-the-town/105847244",
        "title": "Town behind Babe's 'storybook world' celebrates film's 30th anniversary",
        "publish_date": "Sat, 04 Oct 2025 23:05:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "Three decades ago, Australian filmmaker George Miller made an unlikely career move when he set out to produce a film about a talking piglet trained by a border collie to become a sheep-herding star.\n\nWith a growing filmography, including the original Mad Max movies, he set out to find the perfect location to create the now cherished children's classic, Babe.\n\n\"We were looking for a place that was close enough to infrastructure, like a town where we could stay, not too far from Sydney,\" Miller said.\n\nHe chose the tiny town of Robertson, known as the \"green heart\" of the NSW Southern Highlands, south-west of Wollongong.\n\n\"We wanted to create a storybook world,\" Miller said.\n\nBabe, filmed in the Southern Highlands, has a \"storybook world\" look and feel. (Supplied: Universal Pictures)\n\n\"There were no gum trees, so it didn't look specifically Australian … and the earth was quite sculptured.\"\n\nBut according to the town's business chamber, an agreement with production company Universal Studios meant Robertson could not promote itself as the location where the film was shot.\n\n\"The population was a lot smaller back then, and I think [the film crew] used every resource that they could,\" Robertson Business Chamber president Jennifer Macquarie said.\n\nMiller's production company lifted the restriction earlier this year, allowing the town to celebrate and claim its status as the home of Babe.\n\nBig potato turned pig\n\nSimilar to the town featured in the film, Robertson has been transformed into a country fair this weekend, with a petting zoo and cake stall, to mark 30 years since Babe was released.\n\nThe biggest attraction at Sunday's event will be the town's famous Big Potato, which was given a pig-pink makeover by Wollongong street artist Samuel Hall in March.\n\nLoading...\n\n\"It was a bit of a strange commission because we weren't sure how the town would react,\" Mr Hall said.\n\n\"But it's been overwhelmingly positive … with some suggesting the potato should stay a pig.\"\n\nMr Hall said he used the Big Potato's odd shape to depict a pig lying in the grass alongside some of his favourite characters like Ferdinand the duck.\n\n\"It was a challenge and more of a gift to the town,\" he said.\n\nSamuel Hall is the artist behind the Big Potato's transformation into Babe the pig. (ABC Illawarra: Mikayla McGuirk-Scolaro)\n\nLocal farm recruited for film\n\nRobertson potato farmer Roden Mauger was a teenager when Miller wandered into the local real estate agency looking for the most suitable property to film Babe.\n\n\"Dad came home and said the guy who made the 'Crazy Max' (aka Mad Max) films wants to use our property,\" he said.\n\nThe family home became Arthur Hoggett's farm in the movie.\n\nThe Mauger family's farm was an idyllic location for the film's producers. (Supplied: John Cox)\n\n\"[The crew] were there for 18 months, so we got to know a lot of the people,\" Mr Mauger said.\n\n\"I fertilised some of the paddocks, we slashed and we even coloured some of the paddocks so they looked like Fallow Fields.\n\n\"The film set didn't affect us … it was actually a bonus.\"\n\nRoden Mauger (left) at the official unveiling of the artistic dedication earlier this year. (ABC Illawarra: Mikayla McGuirk-Scolaro)\n\nNew technology makes animals talk\n\nBabe stole the hearts and minds of its audience with not just its cute characters, but also its use of cutting-edge visual effects.\n\nJohn Cox, who won an Academy Award for Best Visual Effects for Babe in 1996, was one of the masterminds behind the animation.\n\nAlthough SGI digital dispensation had only recently been developed, Mr Cox said it was critical in replacing the front of an animal's face to make them talk.\n\nBabe was made using a mix of props, real animals and digital animation. (Supplied: John Cox)\n\n\"The attention to the detail was very important,\" he said\n\n\"There was a different department for each animal … and a breeding program so we can use pigs of a specific size.\n\n\"Sheep were given a six-to-seven-month regrowth period so the fleece we had on the robot sheep was the same.\"\n\nThe film went on to rake in over $351 million at the box office.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/nt-hepatitis-b-diagnoses-rising-as-mortality-rates-decrease/105840336",
        "title": "Hepatitis B cases are rising in the NT, but experts say it's a positive sign",
        "publish_date": "Sat, 04 Oct 2025 22:55:38 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Yolŋu elder and Aboriginal health worker George Gurruwiwi remembers the devastating impact of hepatitis B in his community of Galiwin'ku 20 years ago.\n\nHe recalls many deaths from chronic hepatitis B in the Elcho Island community, and constantly going to sorry business, or funerals.\n\n\"Especially here, Elcho, and other parts of the community, it's avoidable death, a lot of death out here,\" he said.\n\n\"We [were] doing ceremony after ceremony.\"\n\nGeorge Gurruwiwi is part of a program working to reduce hepatitis B across the NT. (Supplied)\n\nAt first glance, the latest hepatitis B data for the Northern Territory appears to paint a grim picture.\n\nThe figures provided by NT Health, which only cover the first six months of each year, show diagnoses almost tripled between 2022 and 2024.\n\nBut rather than being a cause for concern, healthcare workers say it's actually a sign the Northern Territory is leading the nation in terms of care for the viral infection.\n\nGeorge Gurruwiwi says prevention efforts are working in his home community of Galiwin'ku. (Supplied)\n\nMr Gurruwiwi says he has seen the change firsthand, having noticed fewer hepatitis B deaths in his community in recent years.\n\nSince 2019, he has been a key partner with NT hepatitis B prevention program HEP B PAST, working to improve access to testing and treatment in Arnhem Land as both a community liaison and researcher.\n\n\"I mentor through a cultural perspective, through kinship,\" he said.\n\n\"The difference is people understand.\"\n\nFalling morality rates\n\nSeventy per cent of people who have hepatitis B in the Northern Territory are Indigenous, according to data from the World Health Organization (WHO) Collaborating Centre for Viral Hepatitis.\n\nLandmark hepatitis study tracks ancient human movements Photo shows footprints in the desert In what they believe is an Australian first, researchers have used a unique strain of hepatitis B virus to deduce ancient human population movements into Australia.\n\nThe territory is also home to an aggressive strain of hepatitis B called C4, which has only ever been diagnosed in Aboriginal people, and particularly Aboriginal people in the NT.\n\nHepatitis B can lead to severe liver degradation, and liver cancer in some cases if left untreated.\n\nWhile non-chronic infections can be cured, most NT cases are chronic, and can be treated — though not cured — through regular check-ups to monitor liver function.\n\nAnngie Everitt, a nurse who runs a hepatitis clinic in Darwin, said the main way hepatitis B was transmitted in the NT was from mother to child, during birth.\n\n\"It's babies, it's people that either contract from birth, or at a really young age, that are most likely to develop chronic hepatitis B, which requires lifelong treatment,\" she said.\n\nAnngie Everitt runs a Darwin clinic for all types of hepatitis. (ABC News: Tilda Colling)\n\nMr Gurruwiwi said often people did not even realise they had the infection until they developed serious liver problems.\n\n\"Young people, especially, they don't notice it in their bodies,\" he said.\n\n\"A lot of them … I've seen it, they passed [away].\"\n\nThe HEP B PAST program includes an app that distributes information about hepatitis B in multiple Indigenous languages. (Supplied)\n\nBut health workers say the tide is turning.\n\nAccording to WHO research, since 2011, the Northern Territory has recorded the biggest decrease in hepatitis B mortality rates of any Australian state or territory.\n\nMenzies School of Health Research Professor Jane Davies runs the HEP B PAST program in the Northern Territory, which has been nationally recognised as leading the nation in hepatitis B reduction.\n\nThe success of the HEP B PAST program, pioneered by Jane Davies, has been acknowledged by Australia's national hepatitis B strategy. (ABC News: Pete Garnish)\n\nHaving started in 2018, the program visits remote Aboriginal communities to deliver a \"one stop liver shop\", providing all the care needed for hepatitis B diagnosis and surveillance — like bloods and ultrasounds — in one day.\n\nIt also offers an app that translates healthcare information into 11 different Indigenous languages.\n\n\"You can imagine being told you have this chronic condition, that you could get liver cancer, that you need care every six months — that can be really scary, [and] that can be even scarier if it's not in your first language,\" Professor Davies said.\n\nThe program provides key hepatitis care, including blood tests, in a single day. (ABC News)\n\nThe HEP B PAST program has been recognised at a national level for its groundbreaking work, and has been recommended in national strategies as a successful model that could be rolled out in other jurisdictions to help eradicate hepatitis B in Australia.\n\nProfessor Davies said the improvement in the data indicated the Northern Territory had actually closed the gap in hepatitis care.\n\nThe HEP B PAST program has partnered with Aboriginal health organisations and traditional owners across the Northern Territory. (Supplied)\n\n\"Ten years ago we definitely were not meeting national strategy targets for people being diagnosed, for them being engaged in care and for them being on treatment … [but] very recently we're able to say we're achieving the national strategy targets,\" she said.\n\n\"That means that we have 99 per cent of people diagnosed … and the national target is 80 per cent.\n\n\"We have 86 per cent of people engaged in care and the national target is 50 per cent, and we have 24 per cent of people on treatment and the national target is 20 per cent. So we're now, for all of those targets, meeting them.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/line-dancing-popularity-helps-queensland-community-connect-move/105815880",
        "title": "Line dancing emerges from 'shadows' as bootscooting becomes popular",
        "publish_date": "Sat, 04 Oct 2025 22:32:31 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Under the bright lights of a Brisbane country music bar, Chelsea Gillum is guiding a crowd through a night of line dancing.\n\nHer shiny cowgirl boots are leading each step on the stage, a stark contrast to four years ago, when she didn't really know what line dancing was.\n\nIt was through a chance encounter that this community became something that would help her during a period of intense loss.\n\n\"I lost my mum in 2021, and her best friend took me to Gympie Muster the next year,\" Ms Gillum said.\n\n\" I accidentally bumped into the line-dancing sessions, and I just fell in love with it. \"\n\nLoading...\n\nMs Gillum is one of many turning to line dancing for connection and movement, and social media is helping to drive the popularity of the dance beyond country towns.\n\n\"It's always been popular, but been in the shadows,\" she said.\n\n\" But now, all the generations that have been doing it for decades are connecting with the younger people who have seen it on social media. \"\n\nThe Great Western pub is a popular venue for line dancers. (ABC Capricornia: Freya Jetson)\n\nThe Great Western pub in Rockhampton, central Queensland, is usually home to bull riding but, every fortnight, more than 300 people come along to kick up dust with their newly learnt moves.\n\nOrganisers say what started as a small gathering two years ago has almost tripled in size.\n\nThis large group meets every fortnight in Rockhampton. (ABC Capricornia: Freya Jetson)\n\nSocial and mental health benefits\n\nMs Gillum said the line-dancing community was one where everyone was made to feel welcome.\n\n\"It's brought friendships into my life I didn't know I needed, all from different ages and demographics,\" she said.\n\n\" You don't need a partner, everyone's doing the same thing so, even if you come alone, you're part of something bigger. \"\n\nMs Gillum founded her own line dancing business with the aim of replicating the experience she enjoyed in Nashville, in the United States.\n\n\"I started at one of Brisbane's country bars for free for seven months because I wanted to show them line dancing was a thing,\" she said.\n\nA study group has found there are physical and social benefits of line dancing. (Supplied: Gilly's Line Dancing)\n\nCQUniversity lecturer Danielle Le Lagadec was part of a group study, which found there were multiple benefits of taking up the form of dance.\n\n\"The physical benefits are the most obvious one,\" Dr Le Lagadec said.\n\n\"The movements increase stamina, balance and strength, but also are a type of rehab after illness.\n\n\"The social interaction of these events is also a big factor. It reduces anxiety and depression and supports positive wellbeing through interactions with like-minded people.\"\n\nSome attendees bring their families along and make a night of it. (ABC Capricornia: Freya Jetson)\n\nSomething for everyone\n\nFor a group of Rockhampton mums, attending line dancing was a New Year's resolution to try something different.\n\n\"We discovered that we could dance and laugh and have fun with each other here at line dancing, it's very relaxed here,\" said Bec Faria.\n\n\"They say when your age goes up, your care factor goes down.\"\n\nBec Faria (far left) says her group of friends will be line dancing on their overseas trip. (Supplied: Bec Faria)\n\nLine dancing instructor at the Great Western, Emily Holloway, said the free event was held fortnightly and catered for all abilities.\n\n\"It's really great to see so many people coming together and making friends,\" she said.\n\n\"[Instructor] Mahalia Hayman and I didn't know each other before we started line dancing, and we've become really good friends since.\n\nDance instructor Mahalia Hayman (left) and Emily Holloway lead the line dancing at the Great Western in Rockhampton. (ABC Capricornia: Freya Jetson)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/melbourne-storm-grand-final-jahrome-hughes/105853438",
        "title": "This star who 'used to hate' the Storm could lead them to another premiership",
        "publish_date": "Sat, 04 Oct 2025 22:11:57 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jahrome Hughes has a confession to make: he once was one of those who hated seeing Melbourne win.\n\nNot because he didn't like their players or respect coach Craig Bellamy, he just got sick of watching them succeed when he was a youngster.\n\n\"I remember, I actually used to hate the Storm because they were so good,\" the Storm half admitted this week.\n\nHughes will on Sunday play his third grand final in six seasons for the Storm, while gunning for a second premiership to go with the ring he won in 2020.\n\nWhat you need to know about NRL grand final day Photo shows Reece Walsh takes a shot at goal during an NRL game. Kick-off times, pre-game entertainment and all the players taking the field. Here's everything you need to know for grand final day in Sydney.\n\nNo club has played in more grand finals in the NRL era, with Melbourne's 12 four clear of the next best, the Sydney Roosters.\n\nSunday's decider against Brisbane will also mark Craig Bellamy's 11th as coach, taking him past Wayne Bennett for the most in history.\n\nAnd on joining the Storm in 2017, Hughes immediately saw what made them the winning machine he once envied.\n\n\"I've got a lot of respect for Craig and what he's done,\" Hughes said.\n\n\"I know he's a big reason for it, just what he brings to the club, and how hard he works. He demands that from his players, and his staff as well.\"\n\nHughes is not alone.\n\n\"Because they're so successful, I think it's hard to like the Storm when you're a fan of another team,\" prop Josh King said.\n\n\"I certainly never hated them that much that I was actively cursing them or anything.\n\n\"But when you're a young fella and probably don't understand much about footy, it's easy to dislike a team that wins all the time.\n\n\"Once I started to play professionally and tried to better myself, that's when the Storm became really intriguing to me.\"\n\nFor others, there were obvious reasons to like the Storm.\n\nHarry Grant says he always had respect for the Storm and its Queensland contingent. (Getty Images: Cameron Spencer)\n\n\"I always liked the Storm and respected them from afar, with so many good Queenslanders playing for them,\" captain Harry Grant said.\n\n\"But also just the way they carried themselves and played in games, it was pretty enjoyable and exciting to watch.\"\n\nIn reality, the likes of Hughes are now the ones driving the next generation of Melbourne success, and giving rival fans every reason to look on with envy.\n\nHis effort to return 22 days after breaking his forearm to play in a preliminary final will likely go down in folklore, and last year's Dally M Medallist again looms as crucial on Sunday night.\n\n\"It was very, very inspiring to see,\" Grant said.\n\n\"The way he sort of attacked that … he played within 22 days but was training for a week before that.\n\n\"The best thing was, he went out and did his job to the standard that we know Jahrome can do, and you know, fingers crossed, he can do that again on Sunday.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/buddha-found-in-shark-bay-urged-to-be-repatriated/105831250",
        "title": "Accidental treasure hunters want to send ancient Buddha statue 'home'",
        "publish_date": "Sat, 04 Oct 2025 21:59:48 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Two mates who unearthed a centuries-old rare Buddha statue in Western Australia's remote Shark Bay region are calling on Prime Minister Anthony Albanese to diplomatically return the Ming Dynasty figurine \"home\" to China.\n\nLeon Deschamps and Shayne Thompson want the Buddha repatriated as a symbol of peace and goodwill, and for Shark Bay to be publicly acknowledged as the birthplace of WA's pearling industry.\n\nLeon Deschamps hopes the Baby Buddha can be returned to China, appealing through the prime minister's office. (ABC Midwest and Wheatbelt: Chris Lewis)\n\nSeven years ago, the pair stumbled upon a 15-centimetre bronze Buddha, buried beneath 20cm of topsoil near a roadside.\n\n\"When I first lifted the statue from the ground, its weight struck me, and as I turned it over in the late afternoon sun, the worn gold shimmered,\" Mr Thompson said.\n\nThe discovery has seen them spend considerable time and money investigating theories about how the small statue came to rest in the red dirt of the WA's north.\n\nLeon Deschamps says, to his knowledge, no-one has returned to the site where the Baby Buddha was discovered to see what else might lie beneath the sands. (ABC Midwest and Wheatbelt: Chris Lewis)\n\n\"However it got here, it was carried by someone who held it sacred and potentially who had it in their family for centuries prior to that,\" Mr Deschamps said.\n\n\" It's four or 500 years old, it's only been buried for the last couple of hundred. \"\n\nShayne Thompson at the 2025 Perth Multicultural Festival. (Supplied: Shayne Thompson)\n\nA seven-year mystery\n\nAfter finding the Buddha, the pair were convinced it was from a Ming \"treasure\" ship, large wooden vessels that sailed from China in the 15th century.\n\nDespite their efforts, including engaging a television shipwreck hunter program, the theory has never been proven.\n\nThe bronze Buddha has a chocolate-brown patina, with worn gilding that glows gold under sunlight. (Supplied: Shayne Thompson)\n\nIan MacLeod of the West Australian Museum identified that the Buddha was buried between 100 and 150 years ago, and it was verified as from the Ming Dynasty by Asian art expert Lee Young.\n\nMr Thompson said Ming Dynasty Buddhas were typically made of gilt bronze using the lost-wax casting method.\n\n\"This process involves creating a wax model of the statue, enclosing it in a clay mould, melting the wax to create a cavity, and then pouring molten bronze into the cavity,\" he said.\n\nFrom the red sands of Shark Bay, the finders hope Baby Buddha will one day return to its homeland in China. (Supplied: Shayne Thompson)\n\n\"After the metal cools, the mould is broken away, and the bronze casting is then finished with gilding, which applies a thin layer of gold to the surface.\n\n\"Once a year, on Buddha's birthday, devotees pour water over the statue's shoulders while reciting three mantras: do good deeds, speak good words, and think good thoughts.\"\n\nMr Deschamps believed the sands of Shark Bay kept many secrets of the past.\n\n\"We're still not sure what lies beneath where we found the Buddha, we'd love to see an archaeological dig at the location,\" he said.\n\nPearls of history\n\nThe pearling lugger Galli-Cuci (also known as \"The Galla\"), once used in the pearling industry by Dennis Holt’s father. (Supplied: Dennis Holt)\n\nA more commonly accepted theory is the Buddha belonged to one of the early pearlers in the Shark Bay region.\n\nOnce only accessible by ship, Shark Bay was the birthplace of Western Australia's pearling industry in the 1850s, driven by demand for pearl shell to make buttons.\n\nPearlers used Malay, Chinese and Aboriginal people as labourers, but eventually Chinese-owned pearling operations established their own camps in the region.\n\nToday a popular tourist destination, the town of Denham was once a thriving fishing community. (Supplied: Dennis Holt and ABC Midwest and Wheatbelt: Chris Lewis)\n\nAccording to the WA Museum, a 1886 census counted 200 people involved in the Shark Bay pearl fishery consisting of 60 Europeans, 102 Chinese and 68 Malays, with the Chinese controlling seven of the 68 vessels in the Bay.\n\nBut the population then dwindled later that year, after the government restricted the number of pearling leases Chinese people could buy, leading to a tense stand-off with armed police.\n\nMr Deschamps said this history should be recognised.\n\n\"In Broome, you see the Japanese pearling industry acknowledged and honoured, and it's a massive part of their tourism industry, we want that for Shark Bay,\" he said.\n\n\"So part of what we'd really like to see is a [Chinese] memorial of some description, we'd love to see a Buddhist peace memorial.\"\n\nRed sands and tidal waters, the locals often refer Shark Bay to where the desert meets the sea. (ABC Midwest and Wheatbelt: Chris Lewis)\n\nAn act of diplomacy\n\nMr Deschamps wants Prime Minister Anthony Albanese to give the infant Buddha statue to Chinese President Xi Jinping to be passed to the Buddhist community in China as a symbol of peace and recognition of history between the countries.\n\n\"It's important that this isn't done quietly; we could hand it back tomorrow to a Buddhist organisation in China, and no-one would ever hear about this,\" he said.\n\n\"What's important is having the government acknowledge its importance as a sacred item, and acknowledge the importance of repatriating that item to the people that it belongs to.\"\n\nFossicking through the pearling camps\n\nDennis Hoult has uncovered several historical artefacts, including what appear to be Chinese cash coins, once used up until the 20th century. (ABC Midwest and Wheatbelt: Chris Lewis)\n\nDennis Hoult has spent his life in the Shark Bay region as a commercial fisher, but his father was the last pearler in Shark Bay, taking over the family business from his father.\n\nNumerous remnants of old pearling camps have been discovered across Shark Bay. (ABC Midwest and Wheatbelt: Chris Lewis)\n\nHis great-grandmother was half Malay and half Aboriginal, while his great-grandfather was a Malay man from Broome, drawn to the area to find the area's unique pearls with gold lustre and abundant pearl shell.\n\nUnder the Pearling Act, Shark Bay licences were issued by the WA government to regulate and control the industry. (ABC Midwest and Wheatbelt: Chris Lewis)\n\nHe remembers his family speaking about the pearling camps scattered across the region, and himself fossicking and finding some trinkets, belt buckles and coins.\n\n\"I have a map that we collated together with my uncle before he passed a few years ago, and we've got all the names of all the pearling camps, and there was something like 55,\" he said.\n\nDennis Hoult descends from one of Shark Bay's pioneering pearling families. (ABC Midwest and Wheatbelt: Chris Lewis)\n\nHonouring Nick's legacy of peace\n\nMr Deschamps' quest for public acknowledgement of Chinese pearlers is motivated by his late friend Nick Pedrocchi, who died in 2022.\n\nMalgana man Nick Pedrocchi, who passed in 2022, was a cherished friend to Leon and Shayne. (Supplied: Shayne Thompson)\n\n\"On the night that we found the Buddha, we bought it home, and my Malgana friend Nick was there, and his very first response was that the Buddha was sacred, that it wasn't just a valuable item, but it was something that people worshipped,\" he said.\n\n\"The sacred items of his people are in museums all over the world, so he sent us on a journey which has been about getting the Buddha home to the people that find it sacred.\n\n\"If we can use the Buddha to bring people together, then I know it would make Nick really happy.\"\n\nMr Thompson said finding the right custodians was vital.\n\n\"It's important the statue goes to custodians who will connect with it, and Leon and I now feel a bond with Buddhism through this single object,\" he said.\n\nA sunset over Little Lagoon, Shark Bay, a wild place of beauty and stories still untold. (ABC Midwest and Wheatbelt: Chris Lewis)\n\nA federal government spokesperson said cultural heritage objects had previously been returned to foreign governments voluntarily, including by major cultural institutions.\n\nIt is open to the discoverers of the figurine to return it to China voluntarily, the spokesperson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/tasmania-remote-learning-technology-trial-for-missing-school/105583408",
        "title": "Classroom remote learning trial to tackle non-attendance, school refusal",
        "publish_date": "Sat, 04 Oct 2025 21:50:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "For year 11 student Amadeo Ambrosino, a school day can be far from typical.\n\nThe 17-year-old lives with cerebral palsy and quadriplegia, and often has appointments during school hours.\n\nBut an educational trial, where a robot takes Amadeo's place in class, has transformed his learning.\n\nWith the help of his mum, he can use his laptop keypad to move the robot between classrooms, and use its microphone and speakers to talk with his teachers and peers.\n\nAmadeo is writing a musical aria, which he wants to share with this class. (ABC News: Andy Cunningham)\n\n\"The robot is amazing for me,\" Amadeo said.\n\n\" I can talk or listen and I can tell the other students about my ideas or news. It can feel like I am connecting with my class. \"\n\nThe two-way telepresence robot has meant Amadeo can learn from the comfort of his Hobart home, or hospital bed, if needed.\n\nSocial isolation overcome\n\nNot-for-profit organisation Missing School has been trialling the robots in schools across the country, with the exception of the Northern Territory, for the past three years.\n\nSince 2022, more than 220 robots have been sent into classrooms.\n\nUsing a robot has transformed Amadeo's learning. (ABC News: Ebony ten Broeke)\n\nMissing School co-founder Megan Gilmour said the technology connected vulnerable students — who are unable to be in the classroom due to disability, health or other stressors — with access to teachers, peers and learning.\n\n\"We know that close to half of the children in the trial were falling behind academically, so it was a really troubling picture,\" she said.\n\n\"But when we provide this two-way digital connection to the classroom for these kids, we see really significant differences.\n\n\"It's just a fact that if you can't get access to school, you can't achieve at school.\"\n\nMegan Gilmour was awarded the 2025 ACT Australian of the Year for her work with Missing School. (Supplied: Salty Dingo)\n\n'Equitable' access to education\n\nAmadeo's mum, Jane Patel, said the telepresence robot had dismantled barriers to her son's learning.\n\n\"The psychological impact of the robot is immeasurable,\" Ms Patel said.\n\n\"It's been an amazing process for him. It's really opened my eyes up for how Amadeo is able to access education in a really meaningful and equitable way.\n\n\"School is not an all-day thing for us … and I think it's a very lonely existence to be in the shoes of someone like Amadeo. He has a lot of barriers to learning.\"\n\nJane Patel is her son's primary carer. (ABC News: Andy Cunningham)\n\nRosny College English teacher Emma Mathieson said having Amadeo's robot in class had challenged the way she taught.\n\n\"The curriculum is really broad, so we can engage students in their passions. Amadeo's is music, so he's brought that into our classroom,\" she said.\n\n\"It's also enabled the other students to be more accepting and developed empathy and understanding, and for Amadeo, it's brought a sense of belonging as well.\"\n\nEmma Mathieson says she is very grateful for what Amadeo brings to the class. (ABC News: Ebony ten Broeke)\n\nEvery child, every school\n\nWhile the Missing School program pilot was designed to support the educational and social needs of children absent from school due to serious illness or injury, the trial's success has meant a wider group of students will soon benefit from the remote-education model.\n\nFrom Monday, the program's reach will expand beyond its current students with a new approach using school-owned technology.\n\nThe computer's arrow keys can move the robot forward and backwards and around. They also tilt the camera. (ABC News: Andy Cunningham)\n\nA modified program, Scaling Statewide School Telepresence Solutions to Increase School Attendance — in partnership with the Department of Education, Children and Young People — aims to capture all students unable to attend school.\n\nIf your child can't go to school – what can you do? Photo shows A composite of three images, of a young girl in a school uniform, clinging to school gates or lying on steps. There's no easy solution, and every kid's situation is different, but here are some resources that might help.\n\n\"The program can work for any student experiencing school isolation. It can be students with school anxiety or school refusal, those in remote areas who can't physically reach a school, even students having a relatively short-term illness or injury,\" Ms Gilmour said.\n\n\"It's so adaptable, so long as there's a connection between the school and the family.\"\n\nMs Gilmour said since COVID, the legislation has been in place in Australia to implement the program at scale. What was missing was the policy to enable it.\n\nWith a grant from the Tasmanian Community Fund, Tasmania will be the first state to trial the expanded program, with a cluster of 34 schools to take part in the initial 18-month pilot.\n\nLoading...\n\nIf successful, Missing School intends to scale up the program to be adopted nationwide using schools' own technology.\n\n\"We're talking about screens, tablets and those video conferencing tools that are used ubiquitously now, such as Microsoft Teams and Zoom, to enable students to dial in,\" Ms Gilmour said.\n\n\" We call it 'teach one technology' where teachers are able to teach to students who are coming in virtually while other students are physically present. \"\n\nIncreasing school attendance\n\nTasmania, with its poor school attendance rates and low attainment rate, stood to benefit from the virtual learning model.\n\n\"We know that 50 per cent of children did not complete year 12 in 2023,\" Ms Gilmour said.\n\n\"We also know that about 50 per cent of children in Tasmania are experiencing chronic school non-attendance.\n\n\"One in three students, about 24,000 children in Tasmania, could be experiencing missed school due to a health condition, either a medical condition or a mental health condition.\"\n\nAmadeo can typically sit in his wheelchair for about 2 hours before feeling uncomfortable. (ABC News: Simon Farrell)\n\nMs Gilmour said reconnecting with the classroom, importantly, helped students to continue friendships.\n\n\"Social connection is one of the primary things enabled,\" she said.\n\n\"This Australian first is a proud moment for Tasmania in its commitment to keeping vulnerable students connected to school. An education system that puts school connection, wellbeing and learning first, will support students wherever they are.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/history-of-unparliamentary-language-in-queensland/105847384",
        "title": "From 'snotty nose' to 'yahoos': The language banned from parliament",
        "publish_date": "Sat, 04 Oct 2025 21:14:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Have you ever called your colleague a \"hairy-nose wombat\", a \"giggling goose\", or yelled \"hell yeah\" across the office?\n\nIf you were a politician and used one of those expressions in parliament, you would've been asked to withdraw your comment.\n\nIn Australian politics, words and phrases used in parliament that are seen as insulting, abusive, or a deliberate lie are deemed to be 'unparliamentary language'.\n\nQueensland members of parliament have been called out when referring to each other as \"slipperier than an eel in a bucket of snot\", \"big fat bag of wind\", and \"the Ned Kelly who occupies the Chair of this Assembly\".\n\nMembers have been asked to withdraw for using phrases like 'knucklehead' and 'humbug'. (ABC News: Peter Mullins)\n\nThe speaker of the House, a member of parliament (MP) who is assigned to oversee the sitting proceedings, decides what language is unparliamentary, and they'll ask the member who said the phrase to withdraw it.\n\nUnparliamentary language can be \"difficult to define\" and there is \"no exhaustive list\", as then-acting speaker Jim Fouras explained to the 51st Queensland parliament.\n\nWords and phrases banned from parliament Snotty nose\n\nDrunk as a skunk\n\nMean girl stance\n\nGuts\n\nHooligans\n\n\"Generally, it is any language or expression that is unworthy of the dignity of the House or parliament as an institution,\" he told the House in 2005.\n\nExpressions that have been declared unparliamentary over the decades in the state's parliament also include: ranting ratbag, mob of shysters, bushrangers, city slicker, humbug, political loafer, and knucklehead.\n\nNo 'bin chicken' noises\n\nUniversity of Queensland research fellow Sam Hames, from the school of languages and cultures, said what is considered unparliamentary is up to the interpretation of the speaker.\n\nHe said some of the rulings weren't \"necessarily consistent over time\" due to different speakers making the calls.\n\nJulian Hill withdrew his comments that likened opposition MPs to the sounds of ibises. (ABC News: Matt Roberts )\n\nIn the federal parliament, the term \"bin chickens\" was ruled to be unparliamentary by Deputy Speaker Maria Vamvakinou in late 2022.\n\nJulian Hill, the federal MP for Bruce, had referred to the opposition as sounding like ibises in the House of Representatives.\n\n\"We've heard the blather and the noise from the bin chickens over there,\" the Labor MP told the House.\n\nWords and phrases banned from parliament Parliamentary delinquent\n\nNo. 1 political plagiarist and brain-sucker of the Chamber\n\nWhy don't you do it like a man and not like a worm?\n\nHaven't seen a gutter you don't want to get into\n\nBefore withdrawing the comment, Mr Hill said it was \"a bit unfair to bin chickens\".\n\nIn this instance, Dr Hames said the speaker saw the term \"bin chickens\" being used to reflect the noise specific members were making in the House.\n\n\"I imagine there would be many other instances in parliament where bin chickens was not considered a reflection of other members, and it was acceptable to say,\" he said.\n\nThe house speaker will call on a member that uses language deemed unparliamentary to withdraw comments. (ABC News: Peter Mullins)\n\n'Happy to drop the c-word'\n\nSometimes politicians have attempted to be creative with unparliamentary language.\n\nIn a debate on the latest budget in 2018, then-Whitsunday MP Jason Costigan declared to the House he was \"happy to drop the c-word in here\".\n\nWords and phrases banned from parliament He did not have a great deal between the ears\n\nGiggling goose\n\nYou're as crooked as a corkscrew\n\nHe has been knocked about by a buffalo himself\n\nHe followed up by saying \"because coal is king\" — the combustible rock being the \"c-word\" the MP was referring to in his speech.\n\nAt the end of his contribution to the proposed legislation, then-deputy speaker Joe Kelly cautioned all members that going forward, using the phrase \"the c-word\" would be considered unparliamentary.\n\n\"If you want to refer to coal, refer to it as coal,\" Mr Kelly told the House.\n\nCertain words and phrases cannot be uttered in the walls of Queensland Parliament House. (ABC News: Brigham Edgar)\n\n'Parliamentary delinquent'\n\nThe official transcripts reveal Queensland politicians have been calling each other \"fools\" since the 1800s.\n\nThe ABC looked at the records of debates and procedures, known as the Hansard, from the 19th century to the present day.\n\nPhrases and words can be banned from being used in the chamber if they are considered to be unparliamentary. (ABC News: Peter Mullins)\n\nHere are some phrases from politicians over the decades that were ruled unparliamentary and withdrawn by MPs:\n\nBugger-all people\n\nSquealed like hell\n\nThe hairy-nosed wombat of environment ministers across Australia\n\nSuper rat is on his feet\n\nI know he prefers to sit in dark rooms with his little tin foil hat on and draw out his policies\n\nYahoos\n\nYou smell\n\n'That is just how I talk'\n\nLoading...\n\nIt is not an excuse to use unparliamentary language because it is just the way you talk, as a Central Queensland MP learned the hard way.\n\nWords and phrases banned from parliament This man trades in death\n\nRottener than anybody in Queensland\n\nI thought you had just come out of the sewer to deliver your speech\n\nQueens Street clot\n\nShe is coming as a jellyfish, because they do not have a spine\n\nVaughan Johnson, who held the seat for the seat of Gregory in 2014, had used the phrase \"like bloody hell!\" when debating legislation on livestock offences.\n\nIt prompted then-deputy speaker, Verity Barton, to tell Mr Johnson he \"may have cussed\" during his contribution.\n\nMiss Barton then explained to him that he \"may have sworn and used unparliamentary language\".\n\n\"That is just how I talk all the time, Madam Deputy Speaker,\" the LNP MP said, before eventually agreeing to withdraw.\n\nSometimes politicians have attempted to be creative with unparliamentary language. (ABC News: Peter Mullins)\n\nA reflection of society\n\nDr Hames, along with a team of researchers from UQ, analysed the proceedings of the Australian House of Representatives and Senate from 1901 to early 2024.\n\nDuring this time, nearly 1.8 million speeches were given by politicians, with the term 'unparliamentary' appearing more than 7,100 times.\n\nHe said the language considered unparliamentary had evolved over time reflecting the broader changes in society.\n\nDr Hames said in the earliest parliament, there was a lot of heavily racialised and derogatory language which was not ruled unparliamentary.\n\n\"Whereas today it definitely would be unparliamentary,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/de-minaur-hits-career-best-mark-with-win-at-shanghai-masters/105853398",
        "title": "De Minaur hits career-best mark with win at Shanghai Masters",
        "publish_date": "Sat, 04 Oct 2025 21:14:46 +0000",
        "category": "sports",
        "authors": [],
        "text": "Alex de Minaur's late-season surge towards again featuring in the end-of-season ATP Finals has continued with the Australian ace enjoying a landmark day as he roared into the last-16 at the Shanghai Masters.\n\nBut not for the first time, \"Demon\" will be the only Aussie left standing in the singles at a Masters 1000 event after his two compatriots, Chris O'Connell and Aleksandar Vukic, both went tumbling out of the tournament.\n\nDe Minaur proved far too good for world number 45 Camilo Ugo Carabelli, dispatching the Argentine 6-4, 6-2 in just 88 minutes to annex a personal-best 48th victory of the season.\n\nThe victory took him past the mark of 47 wins in the 2024 and 2022 seasons, while his 35th hard-court victory of 2025 is the most on the surface by any player this campaign.\n\nOnly Carlos Alcaraz (67) and Taylor Fritz (50) have enjoyed more victories this year than his 48, while de Minaur is also the first Australian man for 21 years, since Lleyton Hewitt, to enjoy that many wins in a single campaign.\n\nHe seems to be getting stronger the longer the season progresses, and will fancy his chances of bringing up a half-century this week as he next faces Poland's world number 66 Kamil Majchrzak, a 6-4, 6-0 victor over 29th-seeded American Brandon Nakashima.\n\nDe Minaur lost to Italian Jannik Sinner in the China Open semifinals in Beijing earlier this week, his 11th straight loss to the world number two, but the pair can not meet in Shanghai until the final as they are on opposite sides of the draw.\n\nEventual Beijing champ Sinner made a solid start to his title defence with a straightforward 6-3, 6-3 win over German Daniel Altmaier, setting up a last-16 clash with Dutchman Tallon Griekspoor in the next round.\n\nBut life looks easier on de Minaur's half of the draw after Alcaraz pulled out of the tournament with a left ankle concern following his victory in the Japan Open.\n\nThe Australian could meet Daniil Medvedev, a 6-1, 6-1 winner over qualifier Dalibor Svrcina on Saturday, should he get past Majchrzak, and that would consolidate his already strong position to get into the ATP Finals in Turin for the second straight year.\n\nHe is currently seventh in the season-long \"Race to Turin\" with only the top eight qualifying, and he has already built a healthy lead over the ninth-placed player, Britain's Jack Draper.\n\nBut once again, de Minaur has proved the best of the original half-dozen Australians in the Shanghai main draw after his fellow Sydneysiders both succumbed, O'Connell eliminated by Canada's 23rd seed Denis Shapovalov 6-3, 6-2 and Vukic going down to Portugal's Nuno Borges 7-6 (9/7), 6-4.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/farmers-begin-long-recovery-after-year-long-sa-drought/105850610",
        "title": "South Australian farmers 'on knife edge' ahead of summer after a year of dry conditions",
        "publish_date": "Sat, 04 Oct 2025 21:14:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "South Australian farmers say they are still feeling the strain of drought after inconsistent winter rains left little room for recovery before the coming summer.\n\n\"We're on a knife edge,\" SA Dairyfarmers' Association president Robert Brokenshire said.\n\n\"We are all concerned about what's going to happen late spring/summer.\n\n\"If the spring shuts off early and we have a hot, tough, long summer … we'll be in bother bigger than you could believe.\n\n\"So again, we're nervous that's it.\"\n\nThe conditions had been brewing in the state for more than a year, according to the Bureau of Meteorology's Daniel Sherwin-Simpson.\n\n\"Since the start of last year, we've seen very much long-term rainfall deficiencies, some of them being the highest on record across the agricultural areas of South Australia,\" he said.\n\n\"Those continued well into this year.\"\n\nIn the Adelaide Hills, Callington farmer Jodie Burr said she had spent tens of thousands of dollars on water and fodder for her horses and alpacas.\n\nJodie Burr is an alpaca farmer in the Adelaide Hills. (ABC News: Ashlin Blieschke )\n\n\"This has been the worst year that I've seen,\" she said.\n\n\" I've been living in the country ever since I was about 10 years old, and I've never seen it this bad. \"\n\nOn the Yorke Peninsula, Maitland farmer Ben Wundersitz said he had experienced his \"driest six months on record\".\n\n\"We basically went for nine months without rain and I think it has an impact on everyone,\" he said.\n\nFarmer Ben Wundersitz says he's received enough rain to begin drought recovery. (ABC News: Declan Durrant)\n\n\"The local town ran out of water. The golf course was dead.\n\n\"You did have that concern that it was never going to rain again. All our rainwater storage was empty.\"\n\nWinter rain brings hope for some\n\nWinter rains offered relief for some parts of the state, but not everyone benefited.\n\nMr Sherwin-Simpson said while some parts of the Eyre Peninsula received record rainfall in July, parts of the Murraylands and Riverland regions \"missed out\".\n\nHe said while large parts of the state — outside of the Murraylands and Riverland — received near to slightly above-average rainfall through winter, it was not enough to make up for the \"rainfall deficiencies\".\n\n\"It was a step in the right direction, but we've seen things still broad-spectrum remain fairly dry across the state,\" he said.\n\nIn the Yorke Peninsula, Mr Wundersitz said he received just enough rain to start recovery.\n\nImpact of climate change on farming Photo shows Sheep and ram bones on the ground The farming town of Orroroo, in South Australia's mid north, is a microcosm of the drought plaguing swathes of Australia. What is its future in a changing climate?\n\n\"Once it sort of rained, we could see hope,\" he said.\n\n\"For us, I suppose the drought has broken. Obviously for many areas in the state that's ongoing.\"\n\nMr Wundersitz said it would still be a challenging road to recovery.\n\n\"We're in for a couple of tough years,\" he said.\n\n\"I think to bounce back to where we were is quite a few years away.\"\n\nMr Brokenshire also believes a full recovery will take time.\n\n\"This is a significant drought; I've never seen anything like it before,\" he said.\n\n\"I'm hoping I'm wrong and that it breaks, but at the moment the signals are not strong for a break in the drought.\n\n\"Depending on the severity of the drought in each region, it could take three to four years.\n\n\" But certainly there wouldn't be one farmer in South Australia that will meet full recovery from this drought in less than two years. \"\n\nEntering a 'green drought'\n\nWhile fields of green have been appearing across the state, Mr Brokenshire said the prolonged periods of dry conditions meant many of South Australia's farms had entered a \"green drought\".\n\n\"[People] driving through Mount Compass over the weekend would think, 'What am I talking about? Look how green and lush it is',\" he said.\n\n\"Well, that's called a green drought because there's no bulk in that green, there's no fibre in that green, and that is unusual but that's part of the problem we have when we have a drought.\n\n\" To the eye it looks great but when you're farming you know it's not anywhere near it where it would be. \"\n\nBack in the Adelaide Hills, even with some rain, Ms Burr said she has struggled to grow grass and her fields have been overcome with weeds.\n\nMs Burr says she has to keep the weeds if she wants to maintain moisture. (ABC News: Ashlin Blieschke)\n\n\"There is a lot of green around but if you have a look, it is capeweed — all that yellow flower is capeweed,\" she said.\n\nMs Burr said she had no choice but to keep the weeds if she wanted any hope of maintaining moisture in the ground.\n\nFarmers forced to innovate\n\nThe challenge of drought has also presented opportunities for innovation, as farmers find new ways to keep producing under the strain of the conditions.\n\n\"I think the positive from these dry seasons really has been our ability to grow grain on so little rainfall,\" Mr Wundersitz said.\n\n\"Even as little as 10 years ago we would have basically produced just about nothing, but we just keep edging forward and our productional farming systems just become more and more sustainable.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/softball-decline-struggle-young-players-exposure-olympics/105851876",
        "title": "Australia were world champs, now teams are scrambling for players",
        "publish_date": "Sat, 04 Oct 2025 21:13:25 +0000",
        "category": "sports",
        "authors": [],
        "text": "Players tossed their gloves in the air in celebration as they ran towards a huddle in the middle of the softball field. Australian flags waved in the stands and the team shouted with joy.\n\nWith a throw to first base to run the final Canadian batter out, the Australian men's softball team — the Aussie Steelers — were crowned world champions in 2022.\n\nIt was just the second time the Steelers had been world champions and appeared to be a sign the sport, a popular inclusion in Australian schools for years, was reaching new heights.\n\nHarry Saisell says many of his friends will miss softball games because they have another sporting match they care more about at the same time. (ABC News: Emily Anderson)\n\nBut less than three years after watching his idols take home the trophy, Canberra softballer Harry Saisell is battling to find enough players to fill a team sheet each week.\n\n\"People don't want to be seen playing softball,\" the 16-year-old said.\n\n\"It's a hard sport, and it's really fun, but people don't see that.\"\n\nA once-thriving sport\n\nSoftball is a variation of baseball invented in the late 1800s and uses a larger ball and smaller field.\n\nThe sport is predominantly played by female participants and will be included in the 2028 Los Angeles Olympic Games as a women's only sport, however, the men's game has a strong presence around the world.\n\nArchive footage of a softball camp from 1961. (ABC News: archives)\n\nBut in Australia, players and the sport's peak bodies are concerned softball is no longer able to compete with the popularity of other sports.\n\nIt means remaining junior players like Harry regularly play up for older divisions and fill in for multiple teams each season.\n\n\"I'm worried to see what will happen in the future — I've lost heaps and heaps of friends to other sports,\" he said.\n\n\"A lot of people in my teams miss out on most games due to basketball grand final, cricket grand finals, [and] baseball.\"\n\nSince the pandemic, juniors numbers in the ACT have shrunk to the point where the territory's competitions had to be consolidated into one association with just four or five teams in each division.\n\nOf the 23,000 softball members across Australia, there are 1,200 based in the ACT, according to Softball Australia.\n\nThere are 23,000 softball players across Australia, according to Softball Australia. (ABC News: Emily Anderson)\n\nNo young blood\n\nSoftball ACT operations manager Shaun Carroll remembers a time when softball was second to only cricket in its popularity.\n\n\"Once upon a time, everyone played softball at school … it was really the only thing around,\" he said.\n\n\"But like everything else, things come and go and there seem to be a lot more things coming for kids to select and go play.\"\n\nShaun Carroll says softball used to be second in popularity only to cricket. (ABC News: Mark Moore)\n\nFive years ago, Mr Carroll remembers a vibrant scene of softballers at the long-running Australia Day Carnival in Canberra.\n\nIt has not run since 2023 due to a lack of young participants.\n\n\"We had hundreds of kids floating around,\" he said.\n\n\" We tried to get it back up off the ground this year, but the interest just isn't there. \"\n\nMr Carroll knows that with fewer young players coming up the ranks, softball competitions could be on their last legs.\n\nGrassroots and junior levels of softball have been struggling to attract the numbers they once did. (ABC News: Emily Anderson)\n\n\"I'd love to say that softball's going to be around for 15 or 20 years,\" he said\n\n\"The way it's heading at the moment, it's not looking great.\n\n\"But you never know what's around the corner.\"\n\nThough Mr Carroll admits the Australian Masters Games — which will be hosted in Canberra in October 2025 — tell a different story.\n\nWith almost 700 players, softball is the third most popular sport in the biennial competition.\n\nOlympic dreams\n\nState-representative softballer Laura Pardoe first played as a young child and said she was sad to see opportunities to learn softball in school disappear despite it being an Olympic sport.\n\n\"The opportunities for those players have just become smaller and smaller, especially for the women and girls,\" she said.\n\n\"This is a sport that's back in the Olympics for 2028, and we're not on that trajectory of opportunities to get to that higher level.\"\n\nLaura Pardoe is hopeful a big increase in the number of people wanting to play softball is just around the corner. (ABC News: Emily Anderson)\n\nIn the 2025 season, the ACT women's competition has just four teams, while the men's grades have seven.\n\nAlthough the Australian Sports Commission has given an additional $1.96 million to fund high-performance programs for women's softball ahead of the Olympics, this money can not be used at the local level.\n\nHopes to become 'the next Matildas'\n\nBut Softball Australia chief executive Sarah Loh is hopeful Australia's successful bid to host the next Women's Softball World Cup will solve the sport's lack of exposure problem.\n\n\"When you're not in schools and you're not on TV, why would a kid want to play softball?\" she said.\n\n\"This is why our investment into kids is paramount.\"\n\nSarah Loh can already see growth in the sport after the World Cup announcement. (ABC News: Glen Mullane)\n\nMs Loh said the World Cup announcement had already started to create growth within the sport, particularly in Queensland.\n\n\"Winning that bid, it's literally changed our fortunes now,\" she said.\n\n\"We have producers putting their hand up saying we want to make you the next Matildas.\"\n\nThe World Cup will be held in Brisbane in April 2027 and is the qualifying event for the 2028 Los Angeles Olympic Games.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/economic-doubts-over-browse-gas-project/105838392",
        "title": "Financial analysts cast doubt on mega Woodside gas project",
        "publish_date": "Sat, 04 Oct 2025 21:00:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Oil and gas giant Woodside's fight to develop the huge Browse offshore gas fields has so far been fought on environmental lines.\n\nOpponents say its proximity to the remote Scott Reef would cause irreparable damage to coral and marine life, and associated carbon emissions were too high in light of recent climate change impact reports.\n\nOpponents of the project gathered in Broome on Friday, amid growing concerns about its impact on Scott Reef. (ABC News: Dunja Karagic)\n\nBut some analysts, such as head of energy research at MST Financial, Saul Kavonic, argue Woodside should be more worried about the project's financial viability.\n\n\"The cost of the development itself ... leave us with a questionable set of economics for the project,\" he said.\n\nBig up-front costs\n\nThe gas industry has had its eyes on Browse for decades, but past efforts have failed to clear the economic hurdle of drilling for gas in such a remote location.\n\nWoodside needs to build a drilling platform, two floating production facilities and drill around 20 gas wells almost 300 kilometres off WA's Kimberley coast.\n\nTo process the gas, it would need to be transported via a 900-kilometre pipeline to the North West Shelf facility in Karratha.\n\nMr Kavonic said the idea was considered and then abandoned 15 years ago.\n\n\"They [also] looked to do the James Price Point development [in the Kimberley], which turned out to be too costly,\" he said.\n\n\"They looked to do floating LNG which turned out to be too risky.\"\n\nWhen Woodside abandoned plans to develop Browse as a floating LNG project in 2016, the WA premier at the time said the company was facing engineering costs above $50 billion.\n\nComplicated joint venture\n\nAnother hurdle for the project is its complicated corporate structure.\n\nWhile Woodside is the company the public associates with Browse, the project is a joint venture between several gas players who have agreed to share responsibility for its profits, losses and costs.\n\nBrowse joint venture Company Interest (%) Woodside 30.6 BP Developments Australia 44.33 Japan Australia LNG 14.40 PetroChina International Investment 10.67\n\nMr Kavonic said any of the partners could effectively veto the project if they decided it was not in their interest.\n\n\"So you need to herd a lot of cats, a lot of disparate interests, in order to get this over the line,\" he said.\n\nOptimistic oil price\n\nMr Kavonic is not the project's only sceptic.\n\nA new report from climate research group Accela Research states many of the assumptions driving Browse's profitability are \"fragile\".\n\nOne of those is the long-term price of oil — the yardstick commonly used when the oil and gas industry plans for the future.\n\nDeveloping Browse would mean drilling gas wells within 10 kilometres of the remote Scott Reef. (Supplied: Alex Westover)\n\nWoodside is predicting the price of a barrel of oil will hover around $US78 over the next few decades.\n\nBut Accela Research financial analyst Axel Dalman said this put the company at odds with others in the industry, including BP, which he said forecast the price would be around $US50 in 2050.\n\n\"Whereas other companies think that, perhaps misguidedly, that oil demand will continue to be strong over the next few decades and that will keep prices high,\" he said.\n\nMr Dalman said an imminent \"glut\" in global liquid natural gas (LNG) production, driven by Donald Trump's 'drill baby, drill' agenda, was also likely to bring down prices.\n\nThe return of Donald Trump to the White House has sparked a spike in new LNG proposals. (ABC News)\n\n\"This new LNG coming out of the US will probably oversupply the market and drive down prices,\" he said.\n\n\"That could be a problem for Browse because obviously the price of LNG is the biggest factor in how profitable the project is because it's going to sell mostly LNG.\"\n\nBut Mr Kavonic cautioned against reading too much into oil price predictions and short-term spikes in LNG supply.\n\n\"Browse will probably not be coming online until the early-to-mid-2030s,\" Mr Kavonic said.\n\n\"So that's well after the period of oversupply which some are forecasting between 2027 and 2030.\"\n\nA Woodside spokesperson said the company did not expect the current LNG supply wave to have a \"sustained impact on pricing\".\n\n\"For example, the International Energy Agency's concerns expressed in both 2009 and 2016 of a sustained LNG glut, with far-reaching impacts on gas prices, did not eventuate,\" they said.\n\nThey said the company was committed to the current Browse to North West Shelf concept.\n\n\"[Woodside] remains focused on overcoming key challenges to the delivery of a globally competitive investment proposal.\"\n\nBrowse to Darwin an option\n\nMr Kavonic said if the Browse to North West Shelf strategy does not work, eyes might turn towards the Ichthys LNG plant in Darwin.\n\nThe Inpex LNG plant in Darwin could be a more viable option to process the Browse basin gas than the North West Shelf in Karratha. (ABC News: Dane Hirst)\n\n\"The operator of that project has already built a very long pipeline out to the Browse basin to develop their Ichthys fields,\" he said.\n\n\"That gas will start running out in about 10 years and then you could plug Browse into existing infrastructure rather than having to spend the money to build new floating infrastructure and new pipelines.\"\n\nA date for the final investment decision on the Browse to North West Shelf project has not been set, but is expected by the late 2020s.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/how-the-tallis-scholars-opened-the-world-of-sacred-choral-music/105849010",
        "title": "One of the world's best vocal groups is sharing centuries-old music on their Australian tour",
        "publish_date": "Sat, 04 Oct 2025 21:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Once upon a time, you could only hear choirs singing angelic music with no instruments in churches.\n\nIt was only relatively recently that groups like The Tallis Scholars started bringing this music into concert halls.\n\nThe music is reverential, but the experience isn't exclusively religious.\n\nWith just a small number of singers, they perform incredibly intricate music with no help from any accompanying instruments to keep them in tune.\n\nThis style of singing is called a cappella.\n\nThe Tallis Scholars travel across the world to perform choral music from the Renaissance. (Sydney Opera House/Tallis Scholars via Salle Bourgie)\n\n\"They're probably the most iconic vocal ensemble across the world with one of the most extensive recording catalogues,\" says soprano Amy Moore, co-artistic director of The Song Company.\n\nShe has sung with The Tallis Scholars in the past.\n\n\"They have a very consistent, beautiful sound,\" she adds.\n\nFormed in 1973, The Tallis Scholars is still lead by founding artistic director Peter Phillips.\n\nThe group last visited Australia in 2022.\n\nThis tour marks their return to the Sydney Opera House's Concert Hall since the year 2000. They will also grace Australian stages in Melbourne, Canberra, Adelaide and Brisbane.\n\nAhead of the group's Australian tour, Phillips and other singers share their enduring fascination with renaissance choral music and why Australia holds a special place in their heart.\n\nSinging sacred Renaissance choral music\n\nPeter Phillips formed The Tallis Scholars to share his love of Renaissance music. (Sydney Opera House/Tallis Scholars: Peter Adamik)\n\nPhillips founded The Tallis Scholars when he was just 19.\n\n\"I just wanted to put on concerts of music that I enjoyed singing and conducting,\" he says. \"[Music by] Thomas Tallis and William Byrd in particular.\"\n\nThese composers lived in 16th-century England, during a time known as the Renaissance era.\n\nBoth wrote music for the Catholic church at a time when being Catholic could get them killed.\n\nPhillips says during the group's early days, these intricate polyphonies, written exclusively for singers singing different notes on each part, was rarely performed by other ensembles.\n\nInstead, most concert-goers expected to hear music from the 18th and 19th-centuries.\n\n\"We were just getting out of the Mozart, Beethoven and Haydn phase and getting into the Bach and Handel phase,\" Phillips recalls.\n\nAlthough these better-known composers have written music for singers, they almost always include accompanying instruments.\n\nThe Tallis Scholars perform centuries-old choral music, without accompanying instruments. (Sydney Opera House/Tallis Scholars: Jess Mac)\n\nBut Phillips wanted to specialise in a cappella music, which ranges from intimate, secret masses written for three to five voices, to choral extravaganzas.\n\nThomas Tallis, the group's namesake, wrote a 40-part vocal piece called Spem In Alium, which requires at least 40 singers to perform.\n\nMuch of this music was consigned to the archives.\n\nBut today, thanks to groups like the Tallis Scholars, they have become incredibly popular.\n\nFrom amateurs to Renaissance rock stars\n\nThe Tallis Scholars are famed for their unique, crystal-clear singing, which has become the gold-standard for many choirs.\n\nMembers of the original group started as amateurs, but over the years, they became professional a cappella singers with a huge catalogue of recordings.\n\nThe group's extensive catalogue amassed a following, earning them the accolade of \"renaissance rock stars.\"\n\nThe Tallis Scholars first came to Australia in 1985 and have made frequent visits over the years. (Sydney Opera House/Tallis Scholars)\n\nPhillips says many of these albums were recorded in a church in the English countryside.\n\nThe group also started touring, first to Belgium and Europe, before taking on the world, including Australia in 1985.\n\n\"Australia was our first big tour,\" Phillips says. \"We were completely inexperienced, but we had to shape up.\"\n\nSingers like Moore remember travelling all over the world and connecting with fans on these tours.\n\n\"The Tallis Scholars managed to capture the imagination of everyone who was going to geek out about this music,\" Moore says. \"And [those fans] would listen to everything they recorded.\"\n\nWorking with centuries of choral music\n\nThe group usually takes 10 singers on tour, but they perform pieces as wide-ranging as 12th-century chants by Hildegard von Bingen to music by living composers Arvo Pärt and Nico Muhly.\n\nFormer organist for Queen Elizabeth shares what it's like working with royals Photo shows A close-up shot of organist James O'Donnell in a suit with pocket hankerchief, seated at an organ. James O'Donnell was the former Organist of Westminster Abbey, directing music heard during historic occasions. He shares his favourite moments working with the royals.\n\n\"The sound is just coming from the small group of singers who are on the stage, so it can feel quite intimate,\" says Elisabeth Paul, one of the singers currently touring Australia.\n\n\"I get comments from audience members I meet after concerts who are blown away by [the sound].\"\n\nWhile in Australia, The Tallis Scholars will also be joined by Melbourne bass-baritone Lachlan McDonald, who was invited to sing with the group after one of their regular singers became unavailable.\n\nPhillips says music written more recently can go hand in hand with the centuries-old music that The Tallis Scholars are known for.\n\nOne reason this works is because composers of church music throughout history often use chant melodies harking back to one of the oldest sources of written notation: the Gregorian chant tradition.\n\nIf you're familiar with these chants, you can find them like clues in music across the centuries, Phillips explains.\n\nOne of the staples of the group's touring repertoire is Miserere by 17th-century composer Gregorio Allegri, which incorporates plainchant and more elaborate renaissance polyphony.\n\nThe performance features offstage soloists, including a spine-tingling high C in the treble part.\n\n\"It's the one piece that everybody knows and it's the one piece they want to hear,\" Phillips says.\n\nMany chamber choirs and small ensembles have been formed since The Tallis Scholars brought sacred Renaissance polyphony to global concert stages.\n\nMoore now works and sings with The Song Company, an Australian vocal ensemble that was formed in 1984.\n\nThey often perform the same kind of music as The Tallis Scholars, as well as choral music written by Australian composers today.\n\nDespite the ease of finding this music on streaming platforms, Moore says there's something special about witnessing singers performing live on stage.\n\n\"There's a tremendous power in the human voice, in its ability to reach, touch and move people,\" Moore says.\n\n\"Sometimes we're trying to make them laugh, sometimes we're trying to make them cry, but as singers, our primary goal is always trying to connect with the audience through music.\"\n\nThe Tallis Scholars are touring Australia from October 5-12, performing in Melbourne, Canberra, Adelaide, Brisbane and Sydney. You can hear the Melbourne and Sydney performances on ABC Classic across November and December.\n\nGet the latest classical music stories direct to your inbox",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-05/australasia-gaa-championships-2025/105849238",
        "title": "'That's the beauty of sport': How an ancient Irish game connects",
        "publish_date": "Sat, 04 Oct 2025 20:58:25 +0000",
        "category": "sports",
        "authors": [],
        "text": "Echoing amongst the gum trees under the blazing sun of Willawong in Brisbane's south is a sound typical of the Irish countryside for countless generations.\n\nThe thwack of a leather ball flying off an ash stick, the whip-like crack of ash on ash.\n\nThe ancient Irish sport of hurling has been a part of life in rural Ireland for centuries.\n\nThe sport's roots are steeped in the mythological tales of Fionn mac Cumhaill and Cú Chulainn, and its earliest written reference is in a document from over 3,000 years ago.\n\nOn the face of it, this most Irish of sports may not be synonymous with modern Australia.\n\nYet hurling, along with Gaelic football, has been playing a key role in the life of Irish expats for over 150 years, both as a tie to a distant home and an enduring symbol of Irish identity.\n\nThe Australasian Gaelic Games Championships\n\nHurling is a mix of lacrosse, hockey and football all mixed into one. (Supplied: An Astráil/Julie Anne Miller)\n\nAround 400 players, representing 19 teams from across Australia and New Zealand, converged on Brisbane for the 2025 Australasia Gaelic Games Championships on Friday, with the finals set for Sunday.\n\nThe championships have been contested almost every year since 1974 and feature a mix of expat Irish players and an increasing number of Aussies who have stumbled across the sports.\n\nThe players are, particularly in hurling and camogie (the women's version of the game, which is nearly identical bar the name) predominantly expats.\n\nVictoria has representatives of 15 different Irish counties in its 27-man hurling squad, with defender Tommy Gallagher playing inter-county for Westmeath.\n\nVictoria defender Tommy Gallagher played inter-county hurling for Westmeath. (ABC Sport: Simon Smale)\n\n\"Hurling, on a summer's day like this, it's the best sport in the world,\" Gallagher says after his side beat out Queensland 3-18 to 2-12 in a fierce battle in the midday sun.\n\nGallagher, like plenty of his teammates, is a hurler of some repute.\n\nHe was a part of the Westmeath side that won the second-tier Joe McDonagh Cup at Croke Park in 2021.\n\nGallagher has lived in Australia for three years, working in the Melbourne construction industry, and, like many of the Irish diaspora, the local GAA club was his first port of call when he landed.\n\nVictoria held off a late surge from Queensland to win their opening clash of the 2025 Australasia Championships. (ABC Sport: Simon Smale)\n\n\"Really, wherever I went in the world, you'd always go and find the GAA club,\" Gallagher says.\n\n\"You make your contacts there and like, if you ask any of the lads here, the GAA club is really where you get work, and that's across the board anywhere in the world.\n\n\"I was in New York and the same thing, you went to the GAA club and you've got a job straight away.\n\n\"The Irish community abroad is great like that. You really look after each other.\"\n\nA home away from home\n\nCamogie is the women's version of hurling, although there are no discernible differences between the sports aside from the name. (Supplied: An Astráil/Julie Anne Miller)\n\nAs an often-used Irish phrase, Níl aon tinteán mar do thinteán féin, will tell you, there's no place like home.\n\nYet for many of the 100,000-plus Ireland-born people living in Australia and 2.4 million who claim Irish descent, sport is helping to make a mockery of the 16,000km distance between the two nations.\n\n\"It's kinda nearly like a home away from home,\" NSW camogie coach Ciara Holden tells ABC Sport of the atmosphere at her local GAA club on the Central Coast.\n\n\"You know everybody is there because they want to be playing and have the same interests, I suppose it's like your family, in a way.\"\n\nCiara Holden is a former camogie player with Kilkenny. (ABC Sport: Simon Smale)\n\nHolden played camogie for powerhouse county Kilkenny but has been in Australia almost six years now, and underlined how important the local club was for expats, whether they played the sport or not.\n\n\"It's such a good way to meet people,\" Holden says.\n\n\"When you come over, at first it's daunting having to start again, new teams and clubs.\n\n\"The social aspect is just as important for people coming over … whether you play or you don't play.\"\n\nVictorian Gaelic footballer Orlagh Farmer agrees.\n\n\"I suppose that's the beauty of sport,\" Farmer tells ABC Sport.\n\n\"It brings people together and, particularly the Irish community, no matter where you are, you just fit in … it's just that sense of belonging and sense of community is really important.\n\nSix-time All-Ireland winner Orlagh Farmer is enjoying her time in Australia. (ABC Sport: Simon Smale)\n\n\"Just speaking to some of the girls on the Victorian team, they were kind of saying they'd be lost without Gaelic, that had they not joined the club here, they would have struggled to make friends and to make memories — and that's what it's all about.\n\n\"We'll never again be this team. We'll never play [together]. So you kind of have to appreciate that for what it is as well. Like, it's one moment in time, it's going to be gone on Sunday, hopefully after we win and we'll have even better memories.\n\n\"But look, what is it they say? The medal will tarnish, but the memories won't. I'm a big believer in that, too.\n\n\"Obviously, we want to win and we want to have those good times too, but at the same time, it's the people, that's what matters at the end of the day.\n\n\"You won't really look back in 20, 30 years' time, 'where's my medal from the State Games', you look back and say, 'it was brilliant, we nearly sizzled in the sun there back in Brisbane,' but that's what you want.\n\n\"And that's the joy of sport, I guess. That's what it can bring.\"\n\n'It's in our blood'\n\nThe Senior Ladies Gaelic Football Championship featured the highest quality of players. (Supplied: An Astráil/Julie Anne Miller)\n\nThe community aspect of the GAA is a huge part, but so too is the competition, the standard of which is astonishing.\n\nAnd Farmer should know — she has summitted the pinnacle of the sport, winning six All Ireland ladies football championships with Cork in front of 50,000 fans at Croke Park.\n\n\"I've been living and working in Australia the last year and I always wanted to, I suppose, play my national sports in another country,\" Farmer says.\n\n\"It's that pride and being able to actually represent your national sports abroad.\n\n\"I just think it's amazing that you can travel, you get to play with other people, you get to meet new people … it's fantastic.\"\n\nPlayers representing all 32 counties of the island of Ireland are represented. (Supplied: An Astráil/Julie Anne Miller)\n\nIrish sports are not entirely unfamiliar to Australian sports fans — the so-called Irish experiment brought Jim Stynes to Melbourne in the 1980s, while semi-regular contests between Ireland and Australia in the International Rules from 1984 also exposed Australians to the national sport of Ireland.\n\nThere is evidence to say that Ireland's sporting connection to Australia goes much further back than that.\n\nNewspaper reports suggest that hurling has been played in Australia since the 1840s, decades before the Gaelic Athletic Association (GAA) instigated a hurling revival in Ireland in the 1880s.\n\nThe GAA grew from a small organisation into a sporting and cultural behemoth in Ireland, intrinsically linked to a sense of Irishness forged as the nation fought for its independence from Britain in the early 20th century.\n\n\"It's just a common thread, it's almost like an unseen thing,\" Farmer says.\n\n\"It's in our blood. It's in our DNA, being a GAA player.\"\n\nThe Aussies\n\nSiena Covino stumbled into Gaelic football by chance. Now, she's hooked. (ABC Sport: Simon Smale)\n\nNot all the players taking part have such a rich Gaelic footballing heritage as Farmer.\n\nSiena Covino is no stranger to playing football — she was named best and fairest for National Premier Leagues SA side Campbelltown City SC this past year — and it was through those soccer connections that she was introduced to Gaelic.\n\n\"I've grown up playing soccer my entire life,\" Covino says.\n\n\"In 2018-ish I had a soccer friend and she said, 'Oh, we need some numbers to fill a Gaelic footy team, can you come and join?' and I said, 'absolutely, number one and number two, what's that?'\"\n\nUndaunted and prepped with a couple of YouTube tutorials, Covino turned up at training with Flinders O'Neill initially just to keep up her soccer fitness during the summer, then for a genuine love of the sport.\n\n\"Soccer is a very technical, very strict sport where I feel in Gaelic I am able to be more creative and build more confidence on the ball,\" Covino says.\n\n\"There's a bit more flexibility, I always say it's like if AFL and soccer had a baby, that's what Gaelic is, and so I could use a lot of my soccer skills and felt confident in that.\n\n\"But to me it's just like an art form on the pitch. So I really enjoy playing it.\"\n\nSiena Covino has represented the Australia-born team at the GAA World Games. (Supplied: An Astráil/Julie Anne Miller)\n\nIt helps that the community is so welcoming as well.\n\n\"I don't know, I just love the Irish community. I find the Irish very similar to the Italian [community],\" Covino, a second-generation Italian, says.\n\n\"Very family-oriented, very community, very welcoming, it kind of feels like home. It feels familiar.\"\n\nWatching Covino play, alongside her South Australian teammates in the intermediate ladies football competition as they ran North Queensland ragged in a 1-10 to 0-2 victory, it's hard to tell that she's a relative novice.\n\nEnergetic and blessed with impressive pace, Covino has that eye for space innate to footballers, coupled with the sense of where pressure is coming from and how to escape from it.\n\nIt's easy to see how, just five years after hearing about the sport, she was playing for the Australian-born Australasian team at the GAA World Games in Derry.\n\nA large number of the South Australian players do not have an Irish background. (Supplied: An Astráil/Julie Anne Miller)\n\n\"That was just an insane experience,\" Covino says.\n\n\"I'd spent three months or four months already travelling at that point, so being able to play sport, have competition, have a community like your team but then also meeting so many people from all different areas of the world.\n\n\"Oh man, it's just like all my favourite things in one.\"\n\nGaelic games go global\n\nTrina Murray was appointed president of the Ladies Gaelic Football Association in March 2025. (ABC Sport: Simon Smale)\n\nThat GAA World Games says a lot about the expanded reach of Gaelic sport.\n\nAt that 2023 World Games, more than 1,500 players representing 93 teams from as diverse locations as Australia, Argentina, Canada, Europe, Asia and the Middle East took part in a four-day event.\n\nTrina Murray, the newly appointed president of the Ladies Gaelic Football Association, said it was \"incredible\" to see Gaelic sports flourishing all around the world.\n\n\"It's just incredible to see, so far away from home, to have so many people playing our sport,\" she says.\n\n\"There's so many homegrown [Australian and New Zealand] players now and you wouldn't actually know that they weren't Irish, their skill is immense and they've really embraced our sport.\n\n\"It's fantastic, it's grown and grown. I'm so proud of ladies football and the Gaelic family as a whole and it's wonderful to see so many players playing our sport and they've really embraced it, they've embraced the culture and the spirit of our game. It's just immense.\"\n\nThe connection between the Ladies Gaelic Football Association and Australia is perhaps even larger than in men's football due to the large number of Irish players making their way to the AFLW in recent years.\n\nTwo-time AFLW Premiership player with Brisbane Orla O'Dwyer has played both football and camogie at All Ireland level for Tipperary. (Getty Images: Sportfile/Piaras Ó Mídheach)\n\nFar from seeing this as a drain of talent, though, Murray says it shows the value Gaelic football — which remains staunchly amateur — has.\n\n\"I think we've over 30 players now from our inter-county teams playing out here [in the AFLW],\" Murray says.\n\nIrish influx is shaping the game in AFLW Photo shows A Geelong AFLW player on one knee in the goalsquare raises a fist in celebration after kicking a goal. The AFLW has had an influx of Irish talent in recent years, with the new talent helping change the game.\n\n\"It's a fantastic opportunity for the players, and look, you can't blame them, you've got everything here, you've got the weather, it's a professional sport as well.\"\n\nDespite her pedigree, Farmer says she has not been tempted to try out for an AFLW team: \"I think I've kind of gone past that,\" she says, adding that the number of players in the league is a \"credit to Gaelic football\".\n\nInstead, she will stick with the round ball, helping to inspire the next generation of homegrown players.\n\n\"A lot of Irish are here now over the last 10 years and their kids are playing,\" she says.\n\n\"I actually coach a team in Melbourne now, Young Melbourne, and you've over 100 young kids turning up on a Sunday morning to train in Gaelic football, camogie, hurling — and it's just fantastic to see.\n\n\"No matter where you go, you can bring the hurley stick and you can bring the Gaelic football.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/nrl-grand-final-2025-live-updates-broncos-fight-to-end-almost-two-decade-premiership-drought-against-storm-roosters-v-broncos-in-nrlw-decider-20251002-p5mzmn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NRL grand final 2025 LIVE updates: Broncos fight to end almost two-decade premiership drought against Storm; Roosters v Broncos in NRLW decider",
        "publish_date": "Sun, 05 Oct 2025 13:00:03 +1100",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "Rugby league fans, grand final day has finally arrived.\n\nIt’s been a long season, a dramatic season, but by 10pm tonight it will all be run, done and won.\n\nBillie Eder here to take you through today’s action, and there will be plenty of action across the nine hours.\n\nHere’s a quick rundown of the day.\n\n1pm: Gates open at Accor Stadium\n\nGates open at Accor Stadium 1.20pm: State championships kick-off\n\nState championships kick-off 4pm: NRLW grand final Roosters v Broncos\n\nNRLW grand final Roosters v Broncos 6.30pm: Pre-game entertainment\n\nPre-game entertainment 7.30pm: NRL grand final Storm v Broncos",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/living/does-break-my-heart-phoebe-burgess-lists-southern-highlands-home-20251003-p5mzvn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Does break my heart’: Phoebe Burgess lists Southern Highlands home",
        "publish_date": "Sun, 05 Oct 2025 13:00:00 +1100",
        "category": "finance",
        "authors": [],
        "text": "When she fled Sydney during the COVID lockdown and the end of her marriage to former NRL player Sam, Phoebe Burgess sought solace in the Southern Highlands at her parents’ estate, Daffodil Downs, outside Bowral.\n\n“It was always a place to come home to fireplaces and that cosy feeling of being locked away on your property with your family, good food and the people you love,” says the former magazine journalist and now social media influencer.\n\nOwner: Phoebe Burgess\n\nPhoebe Burgess The property: Four-bedroom Tuscan-style retreat on 6949-square-metre block\n\nFour-bedroom Tuscan-style retreat on 6949-square-metre block Address: 613 Moss Vale Road, Burradoo, NSW\n\n613 Moss Vale Road, Burradoo, NSW Price guide: $1.9 million\n\n$1.9 million Private sale\n\n“It was a sanctuary for me; I was going through a painful time, and I had these two little kids who just came to life every time we drove down the highway.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/is-he-though-legends-debate-moses-snub-20251005-p5n06e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Is he though?': Legends debate Moses snub",
        "publish_date": "Sun, 05 Oct 2025 12:35:33 +1100",
        "category": "finance",
        "authors": [],
        "text": "'Is he though?': Legends debate Moses snub\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/new-technology-could-predict-risk-of-deadly-thunderstorm-asthma-20251005-p5n06c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New technology could predict risk of deadly thunderstorm asthma",
        "publish_date": "Sun, 05 Oct 2025 12:31:17 +1100",
        "category": "finance",
        "authors": [],
        "text": "New technology could predict risk of deadly thunderstorm asthma\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/meghan-makes-paris-fashion-week-debut-20251005-p5n057.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan makes Paris Fashion Week debut",
        "publish_date": "Sun, 05 Oct 2025 11:24:24 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Meghan makes Paris Fashion Week debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/consumer-affairs/australia-wants-to-export-shredded-soft-plastic-local-recyclers-are-worried-20250909-p5mto0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia wants to export shredded soft plastic. Local recyclers are worried",
        "publish_date": "Sun, 05 Oct 2025 11:19:58 +1100",
        "category": "finance",
        "authors": [
            "Hannah Kennelly"
        ],
        "text": "Australian recycling companies have raised concerns over the government’s decision to consider licenses to export shredded soft plastic overseas, saying it undermines the country’s domestic recycling efforts and investments into local infrastructure.\n\nAustralia used to send much of its waste overseas, however following China’s Sword policy, the government introduced the Recycling and Waste Reduction Act in 2020 and implemented staged export restrictions and regulations to promote a circular economy.\n\nAustsing manager Clive Townsend and Plastec Recycling director Steve Rawson. Credit: Joe Armao\n\nHowever on July 31 this year, Australian recycling companies received an email from the Department of Climate Change, Energy, the Environment and Water (DCCEEW), saying the department was satisfied it was “appropriate to consider licence applications to export shredded flexible waste plastic”.\n\nClive Townsend said he was shocked to receive the email and surprised there had been no industry consultation. Townsend works as a sales manager for Austsing – a private soft plastics recycling facility based in Pakenham, Victoria which converts commercial soft plastic waste into recycled pellets.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/taylors-growing-pat-cummins-ashes-concern-20251005-p5n056.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Taylor's growing Pat Cummins Ashes concern",
        "publish_date": "Sun, 05 Oct 2025 11:14:29 +1100",
        "category": "finance",
        "authors": [],
        "text": "Taylor's growing Pat Cummins Ashes concern\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/johnsons-huge-praise-for-walsh-ahead-of-gf-20251005-p5n054.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Johnson's huge praise for Walsh ahead of GF",
        "publish_date": "Sun, 05 Oct 2025 10:59:39 +1100",
        "category": "finance",
        "authors": [],
        "text": "Johnson's huge praise for Walsh ahead of GF\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/encouraging-campaign-but-the-wallabies-saved-their-worst-for-last-20251005-p5n04x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Encouraging campaign, but the Wallabies saved their worst for last",
        "publish_date": "Sun, 05 Oct 2025 10:55:02 +1100",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "1. Wallabies save their worst for last\n\nThe Wallabies’ 11th loss in a row to the All Blacks in Perth is an unwanted record that has crept up stealthily, and as it now spans three coaching regimes, it is not solely owned by the current group.\n\nBut what will frustrate them after the 28–14 loss — their widest margin of defeat in the Rugby Championship — is the nagging suspicion that they lost too many of the effort areas in the second half.\n\nBy my count, there were three kick chases in which the All Blacks showed more urgency, all leading to either turnovers or an accumulation of pressure. While black jerseys swarmed around the ball, there were fewer Wallabies in support, and by the final 10 minutes, the struggling Tane Edmed was almost an isolated figure in the backfield.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/key-players-and-first-round-picks-up-for-grabs-your-team-by-team-guide-to-trade-period-20250930-p5myvi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Key players and first-round picks up for grabs: Your team-by-team guide to trade period",
        "publish_date": "Sun, 05 Oct 2025 10:25:16 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik",
            "Peter Ryan",
            "Marc Mcgowan"
        ],
        "text": "Charlie Curnow is exploring his options but is contracted to the Blues. Credit: The Age Collingwood Draft picks: 34, 52, 64, 70\n\nKey players: Brody Mihocek, Mason Cox, Tom Mitchell, Bobby Hill Coach Craig McRae said he wanted a balance between securing established talent, while also having a good draft hand. Swans key forward Jack Buller is Magpies-bound on a two-year deal, and that should not be too complicated a trade, but they are not likely to pursue Demons defender Steven May. Jamie Elliott will stay, rejecting a three-year offer from the Suns to re-sign for two seasons, but Brody Mihocek is headed to Melbourne. Bobby Hill only recently signed a contract extension, but rival clubs have asked about him, after personal issues impacted the end of his season. Collingwood encouraged Mason Cox and Tom Mitchell to explore their options elsewhere. – Jon Pierik Essendon\n\nDraft picks: 4, 5, 22, 25\n\nKey players: Sam Draper, Zach Merrett Hawthorn wait with bated breath to see if the Bombers will trade captain Zach Merrett after his shock meeting with Hawks coach Sam Mitchell. The six-time club champion wants to play finals football and contend for flags, both of which have proven elusive at Essendon. Sam Draper has already announced he is leaving in free agency for Brisbane. The Bombers were aggressively pursuing in-demand Sun Sam Flanders but missed out, and are battling Port Adelaide for Gold Coast’s free agent winger Brayden Fiorini. Hawks key defender Jai Serong is also a player of interest, while they could make a play for young Roo Zane Duursma, brother of Xavier. Delisted defender Jayden Laverde will sign with GWS post-draft. – Marc McGowan Sam Draper has played his last game for the Bombers. Credit: Getty Images Fremantle Draft picks: 11, 29, 38, 47, 65\n\nKey players: Will Brodie, Liam Reidy\n\nAfter being starved of opportunities, Will Brodie and Liam Reidy will head to Port Adelaide and Carlton, respectively, while speculation about Sean Darcy’s future happens every year – and every season he stays. Fremantle have convinced mobile Melbourne defender Judd McVee to play alongside Jordan Clark, but will need to broker a trade with the Demons, who were disappointed to lose him. They are also open to trading their first pick in this year’s heavily compromised draft, which will be pushed back by academy and father-son selections. – Peter Ryan Judd McVee is on his way out of Melbourne. Credit: AFL Photos Geelong Draft picks: 17, 35, 53, 71\n\nKey players: Rhys Stanley The Cats are bringing in ex-Hawk and local lad James Worpel on a four-year deal to add to their midfield depth. While Worpel is not an A-grader, Geelong’s lack of midfield depth was obvious in the grand final. They are in the hunt for Charlie Curnow, the Blues forward keen for a fresh start, although a trade will be extremely complicated. St Kilda ruckman Rowan Marshall has requested a trade to the Cats, although the Saints have previously said they won’t budge. It shapes as a fascinating trade period for Geelong, who want to remain in the premiership hunt. – Jon Pierik\n\nGeelong have landed James Worpel. Credit: AFL Photos Gold Coast Draft picks: 6, 13, 16, 31, 56, 67\n\nKey players: Connor Budarick, Sam Flanders, Bailey Humphrey, Malcolm Rosas jnr Champion Demon Christian Petracca has requested a trade to the Suns, and looms as the club’s biggest recruit since Gary Ablett jnr. Now they need to appease Melbourne in a deal, and this is their priority over any potential Charlie Curnow pursuit, which is looking unlikely. Gold Coast are so far resisting making Bailey Humphrey available, but the forward-midfielder has interest from three clubs, including the Dees, who are also in a four-way race for Sam Flanders. Connor Budarick and Malcolm Rosas jnr requested trades to Western Bulldogs and Sydney, respectively, while Port Adelaide and Essendon are keen on free agent winger Brayden Fiorini. The Suns missed out on Jamie Elliott in free agency, but have met with troubled Bulldog Jamarra Ugle-Hagan and registered interest in contracted Swan James Rowbottom. – Marc McGowan GWS\n\nDraft picks: 12, 30, 32\n\nKey players: Jacob Wehr, Leek Aleer, Wade Derksen The Giants will ask for a first-round selection for Leek Aleer, but the Saints won’t be handing one over easily despite the lucrative contract on offer, and the fact he played the final 13 matches in defence. Wade Derksen is in limbo; the Demons lost interest after trying to land him last season as he seeks more AFL opportunities, while Jacob Wehr is off to Port Adelaide as a free agent. Essendon’s Jayden Laverde has joined the Giants, and they are interested in Demon Clayton Oliver, who has fallen out of favour. – Peter Ryan Hawthorn Draft picks: 8, 26, 55, 69\n\nKey players: James Worpel, Jai Serong, Henry Hustwaite, Cam Mackenzie Restricted free agent midfielder James Worpel has left for Geelong on a four-year deal, but Sam Butler resisted West Coast’s strong interest to ink a new two-year deal. He will now hope for more midfield time. Jai Serong, who was hindered by the additions of Josh Battle and Tom Barrass this year, has been linked to North Melbourne, Essendon and Sydney. Cam Mackenzie played 12 games this year, and has interest from the Saints, while midfielder Henry Hustwaite had little opportunity this year, with Richmond among his suitors. – Jon Pierik\n\nLoading Melbourne Draft picks: 23, 53, 59\n\nKey players: Steven May, Judd McVee, Clayton Oliver, Christian Petracca, Charlie Spargo The Demons’ flag-winning era is officially over, with coach Simon Goodwin sacked, Christian Petracca requesting a trade to Gold Coast, and both Steven May and Clayton Oliver encouraged to explore opportunities elsewhere. Charlie Spargo, who also played in the 2021 premiership, inked a free agency deal with North Melbourne, while wanted defender Judd McVee requested a trade home to Fremantle. Melbourne have lured Collingwood forward Brody Mihocek on a three-year deal, which could be via trade or free agency, while they hope to trade for St Kilda ruckman Max Heath. Beyond them, new coach Steven King has met with contracted Sun Bailey Humphrey. They are no longer interested in untried Giant Wade Derksen. – Marc McGowan North Melbourne\n\nDraft picks: 20, 21, 39, 57\n\nKey players: Jy Simpkin Contracted skipper Jy Simpkin wants more midfield time, but is yet to put in a trade request. If he did, the Kangaroos would drive a hard bargain for any suitors. Melbourne premiership forward Charlie Spargo joins as a free agent after an injury-riddled two seasons. An elite kick inside 50, Spargo is a handy, cheap addition if he can get on the park regularly. They are in the market for Hawks key defender Jai Serong after missing out on St Kilda’s Marcus Windhager, who re-signed, and Gold Coast’s Connor Budarick, who nominated the Western Bulldogs instead. – Peter Ryan Will the Roos lose their co-captain Jy Simpkin? Credit: AFL Photos via Getty Images Port Adelaide Draft picks: 24, 42, 60\n\nKey players: Zak Butters\n\nLoading It will be interesting to see how the Power position themselves heading into Josh Carr’s maiden season in charge. Fremantle midfielder Will Brodie, contracted until the end of 2027, has requested a trade to Alberton, seeking greater opportunity. Giant Jacob Wehr, a running defender and wingman, has signed with the Power as an unrestricted free agent, while they are trying to convince Gold Coast’s Brayden Fiorini to join them as a free agent. Silky midfielder Zak Butters will be a restricted free agent next year, but could be lured home to Victoria despite the Power and his manager insisting he will remain. He has been offered a two-year extension, plus a player option to extend it by a further six years, but he is yet to sign. – Jon Pierik Richmond Draft picks: 2, 3\n\nKey players: Tylar Young Much-improved defender Tylar Young requested a trade to West Coast after a strong second half of the season, in a blow to the Tigers, who remain in rebuilding mode and are unlikely to be overly active in the trade period. They missed out on Gold Coast goalsneak Malcolm Rosas jnr, who picked the Swans over them, but those are the cheap types they are most likely to target. Richmond are willing to trade their No.3 pick, which they acquired from North Melbourne, for the right deal after selecting seven players in the top 30 last year. – Marc McGowan\n\nRowan Marshall wants out of the Saints as Tom De Koning arrives. Credit: AFL Photos St Kilda Draft picks: 7, 43, 58\n\nKey players: Rowan Marshall, Jack Steele, Callum Wilkie All-Australian defender Callum Wilkie entertained a serious offer from the Bulldogs before deciding not to push for a trade with two years remaining on his contract. Rowan Marshall might reach Geelong, but there is plenty of water to go under the bridge, while skipper Jack Steele is set to stay, too, despite the Saints encouraging him to look around. St Kilda have landed free agents Tom De Koning and Jack Silvagni, and have the Giants’ Leek Aleer and West Coast’s Liam Ryan wanting to join them. The Suns’ Sam Flanders has nominated them as his new home – the No.7 pick is likely what gets the deal done. It’s an unprecedented opening of the piggy bank as they attempt to return to premiership contention. It may lose them Marshall. – Peter Ryan Sydney\n\nDraft picks: 9, 27, 45, 63\n\nKey players: James Rowbottom Gold Coast forward Malcolm Rosas jnr has chosen Sydney as his preferred new home, but it’s Charlie Curnow whom the Swans dearly want. The star Blue has three clubs he is keen to get to – Gold Coast, Geelong or Sydney. However, as the Cats said, it’s going to take something special to get a deal done for a man who is contracted to Carlton until the end of 2029. The Swans delisted Aaron Francis and Robbie Fox, who are now on the Giants’ radar. James Rowbottom is contracted for three more seasons, but the Suns are interested in the tough midfielder. – Jon Pierik Malcolm Rosas has nominated the Swans as his preferred new home. Credit: AFL Photos West Coast Draft picks: 1, 15, 19, 33, 51\n\nKey players: Oscar Allen, Tyler Brockman, Campbell Chesser, Liam Ryan\n\nLoading It has already been an eventful off-season for the wooden-spooners, with Richmond defender Tylar Young requesting a trade west and dual premiership-winning Lions defender Brandon Starcevich agreeing to join them as well. The Eagles plan to trade for Starcevich instead of signing him in free agency, to avoid diluting their compensation for Allen leaving for Brisbane. The AFL awarded West Coast an end-of-first-round selection as part of an assistance package, which could be the key piece in trading for Starcevich. Campbell Chesser and All-Australian forward Liam Ryan requested trades to Carlton and St Kilda, respectively. Close friend Ryan’s impending exit could lead to Tyler Brockman exploring his options as well. – Marc McGowan Western Bulldogs Draft picks: 10, 28\n\nKey players: Buku Khamis, Jamarra Ugle-Hagan The Bulldogs made a big offer to St Kilda’s Callum Wilkie in a long-shot attempt to prise him out of the Saints as they seek to bolster their defence, but he is set to stay after a pay rise. Buku Khamis wants a trade to the Blues, while Jamarra Ugle-Hagan has almost certainly played his last match for the club. He will either be traded to the Suns on a new contract or take a long road back to the AFL. The Dogs also landed the big body they were after, with the Suns’ Connor Budarick asking to be traded to the Kennel. But they missed out on Deven Robertson, who chose West Coast instead as his preferred new home. – Peter Ryan",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/meghan-duchess-of-sussex-makes-surprise-debut-at-paris-fashion-week-20251005-p5n03p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan, Duchess of Sussex, makes surprise debut at Paris Fashion Week",
        "publish_date": "Sun, 05 Oct 2025 09:33:03 +1100",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "Who was that figure in a white cape taking her seat at the very last moment before the Balenciaga show began at Paris Fashion Week? Was it a supermodel, Meryl Streep or an HRH? No, it was Meghan, Duchess of Sussex making her front-row debut in the fashion capital.\n\nThe former Suits actor upstaged front-row companions Lauren Sanchez-Bezos, Anne Hathaway and PinkPantheress with her unexpected appearance at the debut of former Valentino creative director Pierpaolo Piccioli as creative director of Balenciaga.\n\nDuring her acting days as Meghan Markle, she was a regular fixture at New York Fashion Week, with her most recent fashion show RSVP to a runway at Toronto Fashion Week way back in 2015. A front-row seat in Paris is a right royal step up.\n\n“Meghan, Duchess of Sussex, attended the Balenciaga show in Paris on Saturday night in support of Pierpaolo Piccioli, who recently assumed the role of creative director for the house,” a representative for the duchess said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/twelve-apostles-are-down-to-five-and-the-sea-could-reclaim-another-any-minute-20251003-p5mzym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Twelve Apostles are down to seven, and the sea could reclaim another any minute",
        "publish_date": "Sun, 05 Oct 2025 09:30:00 +1100",
        "category": "finance",
        "authors": [
            "Benjamin Preiss",
            "Liam Mannix"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In the beginning, Victoria’s south-west coastline was formless and empty, submerged by the ocean. Darkness cloaked the surface of the deep. Not for long. The Earth cooled. Far to the south, glaciers formed. The skirts of the ocean were pulled back, revealing a coastline of striped yellow limestone. And then, over a few thousand years, waves and wind did their work, battering the shoreline into a dramatic form of environmental stonemasonry. A view of the Twelve Apostles, which remains a popular tourist attraction. Credit: Nicole Cleary Today, we call it the Twelve Apostles – a natural formation that continues to draw millions of tourists from across the country, and the world. There was a time when at least 13 limestone pillars were part of the natural formation. Five of those pillars now sit below the water, gaining the term the “drowned apostles” by researchers. The last apostle to drown came crashing down in 2005, leaving just seven standing.\n\nAdvertisement\n\nCoastline experts say it is a matter of when and not if the next sea stack crumbles into the ocean. “I wouldn’t be surprised if one fell down next week,” says David Kennedy, a professor of coastal geomorphology at the University of Melbourne. “I do wonder if I’ll see one collapse each time I visit there.” Despite their collapsing state, the Twelve Apostles remain a popular tourism attraction. Credit: Nicole Cleary Anticipation of the next collapse is against a backdrop of debate about whether visitors should be charged to view the natural attraction while surrounding geological wonders remain closed to the public due to concerns about coastal erosion. Last week, the Great Ocean Road Regional Tourism group and local council called for the introduction of a visitor payment scheme to maintain facilities and help protect the fragile coastline. The push comes after the state government announced completion of a rooftop structure last month as part of a new $126 million visitor centre being built in a redevelopment of the area. The centre will also include shops, eateries and a garden.\n\nAdvertisement\n\nPrincetown resident Dion Webber has been flagging concerns about water discharge at the Twelve Apostles and access closures at nearby sites, including Gibson Steps, Loch Ard Gorge and The Arch. Webber worries that construction work at the Twelve Apostles tourism site is contributing to cliff instability. And he says the closures result in a poorer experience for tourists, who make the trip to the south-west coast, as well as locals. “It’s terrible to see all this happening,” Webber says. Dion Webber has been raising concerns with water runoff at the Twelve Apostles site. Credit: Nicole Cleary Richard Riordan, Liberal MP for Polwarth, which covers the south-west, says the closure of so many of the area’s tourist sites calls into question the value visitors receive, particularly if they will be charged to visit in future. “This is such a lost opportunity. It’s such an important part of Victoria’s tourism offer,” he says. “Sadly, it’s at risk of being a huge white elephant.” Riordan says the government spending on the Twelve Apostles redevelopment is not commensurate with the condition of the sites, which he argues have been poorly managed.\n\nAdvertisement\n\nHowever, a state government spokeswoman says the Twelve Apostles redevelopment will transform the destination, ensuring it is safer and easier to experience while encouraging people to stay longer in the region. She says no decisions have been made about charging visitors. A spokesman for the Great Ocean Road Coast and Parks Authority says Gibson Steps will reopen soon and Loch Ard Gorge is still a great place to visit with a new blowhole lookout now open. The authority confirmed it is investigating feasibility options for stairs at Loch Ard Gorge. It is also considering the effect of rain and stormwater volume entering the drainage system from the Twelve Apostles visitor centre site. Asking whether more apostles will fall down misunderstands the landmark, scientists say. They are constantly in the process of eroding and collapsing. “We are looking at a snapshot in time of 6000 years of the coast retreating,” says Kennedy. “They are a geographical quirk.” The coastline around Port Campbell was laid down hundreds of millions of years ago, when sea levels were tens of metres higher and the area was a shallow marine bay known as the Otway Basin.\n\nAdvertisement\n\nSwarms of shellfish and single-celled protozoans were born, lived and died here, their shells laid down in sediment that eventually became rich yellow limestone. The sea gradually retreated, no longer sitting atop the rock but now chiselling at its edges. Some rock is too hard to be eroded, like the shoreline at Wilsons Promontory. Some is so soft it could not support the weight of a stack and crumbles away to a cliff-face, like those at Anglesea. Loch Ard Gorge where there have been some access closures. Credit: Nicole Cleary Here, the limestone is just soft enough to weather slowly, but with enough strength to hold up hundreds of tonnes of rock. “The sea eats at them, and eventually, they fall,” says associate professor Stephen Gallagher, a micropalaeontologist at the University of Melbourne. The problem is predicting just when that collapse might happen.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw7-arsenal-vs-west-ham-20251005-p5n040.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW7: Arsenal vs West Ham",
        "publish_date": "Sun, 05 Oct 2025 09:06:18 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW7: Arsenal vs West Ham\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw7-man-utd-vs-sunderland-20251005-p5n043.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW7: Man Utd vs Sunderland",
        "publish_date": "Sun, 05 Oct 2025 09:06:16 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW7: Man Utd vs Sunderland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/millions-of-australians-to-see-their-student-debts-slashed-heres-what-you-need-to-know/jk27nb331",
        "title": "We now know when your HECS debt will be slashed, and by how much",
        "publish_date": "Sun, 5 Oct 2025 00:15:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Millions of Australians will see their student debt slashed from next month.\n\n\n\n\n\nThe federal government said the Australian Tax Office would begin applying the 20 per cent cut from mid-November, with most seeing their balances reduced by the end of the year.\n\n\n\n\n\nEducation minister Jason Clare confirmed the timeline on Sunday and said about three million Australians would benefit from the debt relief.\n\n\n\n\n\n\"We promised we would cut your student debt by 20 per cent and we are delivering,\" he said.\n\n\n\n\n\n\"This cut is already locked in to people’s balances at 1 June but soon they will be able to see it and feel it.\"\n\n\n\n\n\nHere's everything you need to know.\n\n\n\nHow much is the cut and who will benefit?\n\nThe cut is a one-off reduction of 20 per cent on all Higher Education Loan Program (HELP) debts, including university loans, known as HECS. The cut will be backdated to balances on 1 June before indexation was applied.\n\n\n\nThe government estimates about three million Australians will see their debt reduced.\n\n\n\n\n\nA person with an average debt of $27,600 will see $5,520 wiped.\n\n\n\nWhen will my debt be reduced?\n\nThe ATO will begin applying the cut from mid-November, with about half of those with student loans to see their debt slashed by the end of the month. Most others will see the cut applied by mid-December.\n\n\n\nWhy is the debt being cut?\n\nThe government says the debt relief is about recognising the financial pressure faced by many Australians, particularly younger Australians. About 70 per cent of student debt is held by Australians aged 35 or younger.\n\n\n\nDo I need to do anything?\n\nNo, the reduction will be automatically applied to your balance by the ATO.\n\n\n\nWill I still receive the cut if I have paid off my loan?\n\nIf you have repaid your student loans and don’t have a debt balance as of 1 June 2025 you will not receive the cut. The reduction will only apply to debt that exists as of 1 June 2025.\n\n\n\nHow can I check my debt?\n\nYou can check your loan balance via the myGov website after linking your account to the ATO's online services.\n\n\n\nHow much will it cost the government?\n\nThe government expects the reduction will wipe out about $16 billion in student debt.\n\n\n\nREAD MORE How does a HECS debt affect your home loan borrowing power?\n\nThis is in addition to $3 billion that was removed after the indexation on student loans was tied to the lower of the wage price index or consumer price index.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/location-tracking-apps-a-great-tool-to-keep-loved-ones-safe-or-a-harmful-invasion-of-privacy/isma6nxvo",
        "title": "Location-tracking apps: A harmful invasion of privacy or a great tool to keep loved ones safe?",
        "publish_date": "Sat, 4 Oct 2025 21:08:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "As her 18-year-old son backpacked around Europe last year, Christine Milostnik found reassurance in watching his exact location on her phone through a simple app.\n\n\n\n\n\nMilostnik said her son had agreed to the arrangement before he left, and it gave both of them peace of mind during his travels.\n\n\n\n\n\n\"I called and said, 'Oh, you haven't moved for 24 hours,' and then he said, 'Yes, I'm sick'. It was also good for him that someone was looking after him,\" she told SBS News.\n\n\n\n\n\nMilostnik said that, as her children are now grown up, she has largely stopped using location tracking apps, but for years she was comforted by knowing when they returned from school.\n\n\n\n\n\nShe also previously used the apps to monitor her mother with dementia, who would sometimes get lost.\n\n\n\n\n\n\"Having that helped me a lot because there was one day that she got a little bit confused from going to the church in the morning, coming back, and then I could ask a friend of mine to pick her up,\" she said.\n\n\n\nPutting some 'nobility' around it\n\nDespite safety and privacy concerns, an increasing number of Australians are tracking the whereabouts of their children, ageing parents, and sometimes even partners and friends, 24 hours a day, using phone applications such as Life360, Find My iPhone, and Find My Device.\n\n\n\n\n\nThe exact number of people in Australia tracking others or being tracked remains unknown.\n\n\n\n\n\nApple said that it doesn't have access to this information, and Life360 — which has previously reported having more than two million users in Australia — didn't respond to an SBS News request for information.\n\n\n\nLISTEN TO Helpful or spying? Do we really need to track where our loved ones are? SBS News 09:43 English\n\nElisabeth Shaw, CEO of Relationships Australia New South Wales, said we find it easy to justify our desire to track loved ones.\n\n\n\n\n\n\"I think part of it is the speed of life,\" she told SBS News. \"Instead of leaving anything to chance — that 'I'm not sure when the family's coming home tonight' — there's a need to know.\"\n\n\n\n\n\n\"Then we put some nobility around that. We say, well, because life isn't as safe as it used to be, then this is a reflection of how much I love my family.\"\n\n\n\n\n\nIn many ways, Australia is actually safer than it ever was.\n\n\n\n\n\nThe number of offenders police dealt with in 2023–24 was at its lowest recorded level since 2008 to 2009, while we've seen a reduction in homicides and robbery, according to the Australian Bureau of Statistics (ABS).\n\n\n\n\n\nHowever, the number of certain crimes, such as domestic violence-related assaults and sexual assaults, has increased in recent years.\n\n\n\nData from the ABS shows that there were 40,087 victims of sexual assault recorded in Australia in 2024, a 10 per cent increase from the previous year.\n\n\n\n\n\nShaw said that, with consent, location-tracking can be an immensely useful safety tool in some situations — such as when a friend tracks another's first date or someone monitors a loved one's trip in an Uber.\n\n\n\n\n\n\"There are ways which are very much in the individual's control, where they can invite people in and then exclude them at other times,\" Shaw said.\n\n\n\n\n\n\"I think in those sorts of ways, where there is regular checking in on consent, the clarity of purpose, all of that is actually a great benefit in how we live our lives.\"\n\n\n\nA normalisation of surveillance?\n\nHowever, some are concerned by what they consider to be a normalisation of surveillance occurring alongside the uptake of location-tracking apps.\n\n\n\n\n\nBridget Harris, director of the Monash Gender and Family Violence Prevention Centre, told SBS News that society has clearly experienced a shift in norms around privacy.\n\n\n\n\n\n\"That's how much information we share, the devices we share, and also expectations about that. So, expectations that we are, for instance, findable by our partners, by our children, by everybody,\" she said.\n\n\n\n\n\nShe said that, as digital surveillance creeps into ever-more aspects of our lives — work, education, interactions with the government — we come to normalise surveillance in our personal lives.\n\n\n\nResearch shared by the eSafety Commissioner in May showed that almost one in five young adults aged 18 to 24 think it's reasonable to expect to track a romantic partner whenever they want.\n\n\n\n\n\nHarris says the normalisation of location-tracking may lead to victims' calls for help not being taken seriously.\n\n\n\n\n\n\"If someone's trying to articulate the violence of their experience ... it might be discounted by someone else. They might say, 'Oh no, that's really normal. My partner and I do it too,' but what is actually happening is very different,\" she said.\n\n\n\n\n\n\n\nShaw said it's \"very important\" that intimate partners openly discuss the use of such technology.\n\n\n\n\n\n\"Even if someone dresses up their behaviour as good intentions or caring and concern, if the other doesn't experience it that way, then the issue has to be dealt with.\"\n\n\n\nLISTEN TO 'It's about power': How sexual harassment affects those on the margins SBS News 09:58 English\n\nShaw also warns that, even if it's mutually agreed upon, tracking a partner can shift expectations in a romantic relationship.\n\n\n\n\n\n\"People are judging the speed at which their partner responds: 'You didn't respond for an hour, so that means you don't love me',\" she said.\n\n\n\n\n\n\"We are conflating, sometimes, access with love and devotion.\"\n\n\n\n'It's definitely spying'\n\nSome, like Alyssa Carter, say they would never allow their partners to track their locations.\n\n\n\n\n\n\"I wouldn't like a partner to track me at all. I think it is absolutely, for myself, an invasion of my own privacy ... There is no reason for a partner, as far as I'm concerned, to want to know where you are,\" she told SBS News.\n\n\n\n\n\nCarter has always refused to monitor the whereabouts of her 16-year-old daughter, and says her daughter would be horrified at the suggestion.\n\n\n\n\n\n\"It's definitely spying … I think she would feel absolutely that it was an invasion of her privacy and her autonomy,\" Carter said.\n\n\n\n\n\nIf you or someone you know is impacted by family and domestic violence, call 1800RESPECT on 1800 737 732, text 0458 737 732, or visit 1800RESPECT.org.au . In an emergency, call 000.\n\n\n\n\n\nThe Men's Referral Service , operated by No to Violence, can be contacted on 1300 766 491.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/yazidi-refugees-in-toowoomba-find-community-through-hockey/j814wa3h1",
        "title": "Yazidi refugees in Toowoomba find community through hockey",
        "publish_date": "Sat, 4 Oct 2025 20:00:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nAmeerah Silo is carefully packing her bag before hockey training.\n\n\n\n\n\nShe's one of the many Yazidi refugees in Toowoomba who are part of a program hoping to give migrants a taste of the sport.\n\n\n\n\n\nThe 21-year-old moved to Australia in 2023 and says playing the sport has helped her build English skills and meet new people.\n\n\n\n\n\n“I don’t know the speaking, I don’t know anybody, difficult, first time living in a different country. Like when I go to hockey, like we make a friend and trying together and talking together and we are running together, everything is together.\"\n\n\n\n\n\nToowoomba has the largest Yazidi population in Australia, according to data from the last census.\n\n\n\n\n\nMany now call the regional centre their home, after fleeing Islamic State in northern Iraq and Syria.\n\n\n\n\n\nThis hockey initiative is aiming to build language skills and a sense of belonging for a community with complex needs.\n\n\n\n\n\n18-year-old Asmhan Kankah is also one of the program's participants.\n\n\n\n\n\n\"Hockey Australia has helped us to forget what we've endured before coming to Australia. It has helped us Yazidis to be happier, and that's what I like about it most.\"\n\n\n\n\n\nHelping to run the program every Friday is Toowoomba Hockey Association manager Jessie McCartney.\n\n\n\n\n\nHe says improving self esteem has helped some Yazidis to find employment.\n\n\n\n\n\n\"We knew that when they first came that they would be nervous and their English language was still developing and they had never played the sport before, so it was really important that we had a very nurturing environment that was just about building connections with people. What we've learnt through the Belong Hockey program is that we actually have to create an environment where people feel like they belong and then that integration happens automatically.\"\n\n\n\n\n\nA big part of making the program accessible is through providing transport to training.\n\n\n\n\n\nLocals like Geoff and Karen Murdoch are some of the many retirees that volunteer each week.\n\n\n\n\n\nThey drive Ameerah to practice and also help out on the field.\n\n\n\n\n\nKaren says she's made many new young friends, which makes her feel younger too.\n\n\n\n\n\n\"We felt these kids deserve to have people welcome them into their circle and it took a little while but I think they have come out here and they have found their group. We have been welcomed into their homes at different times for cups of tea or meals and I think they have looked upon us as mentors and almost grandparents and we have just lapped it up and loved it.\"\n\n\n\n\n\nGeoff says bringing together locals and the refugee community has also helped breakdown misconceptions about refugees.\n\n\n\n\n\n\"I had no understanding of their plight, when we first started. I hadn't heard of Yazidis and where they came from and we have done quite a bit of research on it and you get a much better understanding of what they've been through and what they are trying to deal with and it makes you a lot more caring and understanding of people.\"\n\n\n\n\n\nSome of these players like Ameerah have also joined local hockey clubs.\n\n\n\n\n\nJessie again.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-is-deathmatch-wrestling-and-why-is-it-controversial/nj1sz5e5z",
        "title": "Blood, thumbtacks and whipper snippers: Inside the world of Australian deathmatch wrestling",
        "publish_date": "Sat, 4 Oct 2025 19:42:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "This article contains graphic descriptions and imagery.\n\n\n\n\n\nBetween the hours of 9am and 5pm, Joel Bateman is a \"mild-mannered government official\".\n\n\n\n\n\nBut when night hits, those mild manners are put to bed as he's pummelled into glass panes, thrown off ladders into beds of thumbtacks, and even endures a live whipper snipper ripping the skin raw from his back.\n\n\n\n\n\nIt's all pretty standard fare for the life of a deathmatch wrestler.\n\n\n\n\n\n\"The stunts we do in deathmatch wrestling are only limited by our imagination,\" Bateman tells SBS News.\n\n\n\nWhen Joel Bateman isn't working his government job, he's making himself bleed in unique and gruesome ways. Source: Supplied / Jake Hurdle (@jhmedia.jpeg) \"The fluorescent light tube is the staple of modern deathmatch wrestling. It's the same thing you'd find in your garage. But all the green initiatives are actually making them harder to find and more expensive — so we have to get more creative,\" Bateman says.\n\n\n\n\n\n\"We tend to wrap anything we can find in barbed wire, including the [wrestling] ring itself.\"\n\n\n\n\n\nWeapons in a deathmatch wrestler's arsenal might include: staple guns, fire, concrete blocks, cactus plants, gusset plates, thumbtacks and drawing pins, panes of tempered glass (because \"it won't cut you to the point where you need to go to the hospital\"), and perhaps the most surprising — whipper snippers.\n\n\n\n\n\n\"I've only done whipper snippers three or four times. Every time I do it, I don't remember it being that bad the last time. And then I do it and I go, 'Oh, it hurts exactly as much as I thought it did last time',\" Bateman says.\n\n\n\nIt's like being pink-bellied 150 times in the space of a quarter of a second.\n\nBateman started wrestling in 2001 at the tender age of 11. He had his first match two years later, and his first deathmatch in 2006 at age 16.\n\n\n\n\n\nThe now 36-year-old estimates he's performed over 200 deathmatches — a number that accelerated significantly since the launch of his own wrestling promotion (business), Deathmatch Downunder.\n\n\n\nIn the world of deathmatch wrestling, anything goes — even eating glass tubes, like Japanese professional wrestler Abdullah Kobayashi here. Source: Supplied / Jake Hurdle (@jhmedia.jpeg) At first glance, anyone could think death matches are just blood, gore and violence — and, look, that's partially right — but for those in this niche little world, it's about so much more.\n\n\n\nWelcome to the world of deathmatch wrestling\n\nDeathmatch wrestling is a subgenre of professional wrestling, Bateman explains.\n\n\n\n\n\nThere's standard professional wrestling. Think: World Wrestling Entertainment (WWE), with big names like John Cena and The Rock.\n\n\n\n\n\nThen, under that umbrella is hardcore wrestling. That's a more turbo version of your standard wrestling match, involving weapons such as chairs, ladders, tables and garbage bins.\n\n\n\n\n\nThen there's deathmatch wrestling, which takes hardcore wrestling and turns the dial up by 100.\n\n\n\n\n\n\"Instead of using things like chairs and tables, we find ourselves using things like barbed wire, fluorescent light bulbs and fire,\" Bateman says.\n\n\n\n\n\n\"It's like the Police Academy stunt show at Movie World, crossed with a live-action horror movie with the performance art of pro wrestling.\"\n\n\n\nThe first time Jordan Whyte and Joel Bateman wrestled each other in a deathmatch, Jordan got a fluorescent light tube straight to the face. Source: Supplied / Jaden Lee (@jiwcphotos) While professional wrestling is pre-determined (not to be confused with fake), all props used in deathmatch wrestling are 100 per cent real. Matches are a hotbed of creativity with no rules — except that there needs to be blood. And lots of it.\n\n\n\n\n\nBateman describes it as a \"wide barometer of bloodletting\".\n\n\n\n\n\n\"Everything is legitimate. Through repetition, you learn how to take these household objects and use them in a way that you could draw blood with them safely — like the most [bonkers] surgeon you've ever seen,\" he says.\n\n\n\nA double life\n\nThe first time budding primary school teacher Jordan Whyte met Bateman in the ring, he was smashed in the face by a fluorescent light tube.\n\n\n\n\n\nWhyte is relatively new to the deathmatch scene. While he's wrestled under the name Jesse Flynn for about four years, he competed in his first deathmatch in Sydney two months ago — with Bateman.\n\n\n\n\n\n\"We had light tubes, chairs, tables and gusset plates — the things that hold houses together — which aren't nice,\" Whyte says.\n\n\n\n\n\n\"The first time I got hit was with the glass tube. I thought it was really hot in there.\n\n\n\nThen I wiped the sweat from my face and was like, 'Oh, I'm gushing blood'.\n\n\"Then Joel set his knee on fire and kneed me in the face.\"\n\n\n\nJordan Whyte first entered the niche world two months ago in a match with legacy deathmatcher, Joel Bateman. They say trust and a good relationship are key components of the process. Source: Supplied / Jaden Lee (@jiwcphotos) The venue held about 120 people. One spectator was a university classmate of Whyte's, who was shocked to see the soon-to-be primary school teacher dripping blood on stage.\n\n\n\n\n\nWhyte says he's still not sure how to balance his double life, especially with classrooms filled with tiny people on the horizon.\n\n\n\n\n\n\"Part of me thinks I should finish my degree, then hang the boots up, but then part of me is hoping that I could still wrestle on weekends while teaching,\" he says.\n\n\n\n\n\n\"I know a few wrestlers who are teachers, but they're a very different [wrestling] style … but I'm like, no — hit me over the head with a chair. I think that extra step is what makes it such an insane comparison.\"\n\n\n\n\n\nIn the grand scheme of things, a chair on the head is the least of Whyte's problems. Instead, he says there are three weapons that rank the highest on the pain scale.\n\n\n\nSkewers in the head is one of the most painful stunts in deathmatch wrestling, Jordan Whyte says. (Pictured: Jordan Sampson and Aidan Osbourne). Source: Supplied / Jaden Lee (@jiwcphotos) The first is wooden skewers, which are pierced into the victim's forehead.\n\n\n\n\n\n\"I knew that would hurt, but when we did it, I was like, I don't want to do this again,\" Whyte says.\n\n\n\n\n\nThe second is barbed wire.\n\n\n\n\n\n\"It gets caught on you,\" Whyte explains.\n\n\n\n\n\n\"I'll say yes to using it as long as it stays out of my hair — I don't want to cut my hair.\"\n\n\n\n\n\nThe third: a Guitar Hero guitar, which Whyte describes as \"weirdly painful\".\n\n\n\nIn deathmatch wrestling, anything goes: even Guitar Hero. Source: Supplied / Jaden Lee (@jiwcphotos) \"It was very solid. When I got it off Facebook Marketplace, the lady was like, 'Are you sure you want it? It doesn't work.' And I was like, 'That's fine, I don't need it to work',\" Whyte says.\n\n\n\nControversial, even in the wrestling world\n\nThere's a lot of stigma that follows deathmatches, even in the professional wrestling world.\n\n\n\n\n\nBateman says before he started his promotion, he'd need to convince promoters to let him do a deathmatch — and if he managed to get it over the line, they'd often be so traumatised by the event that they'd refuse to host it again.\n\n\n\n\n\nHe says it's often been called \"organised barbarism\" by critics and that this controversy isn't new by any means.\n\n\n\n\n\nIn the late 1980s, Japanese wrestler Atsushi Onita founded a hardcore promotion in Japan called Frontier Martial-Arts Wrestling, giving birth to the death match genre.\n\n\n\n\n\nThe promotion staged the first-ever 'Exploding Ring Death Match' in 1990.\n\n\n\n\n\nIt's exactly what it sounds like on the tin: barbed wire surrounded the ring and triggered explosions when touched. One iteration featured a countdown timer that, at zero, would cause the entire ring to explode (yes, with people still inside).\n\n\n\nThe death match style started to seep into American television in the 1990s, as a ratings war — known as the Monday Night Wars — that erupted between WWE and its competitors, World Championship Wrestling (WCW) and Extreme Championship Wrestling (ECW).\n\n\n\n\n\nAs the three largest Western wrestling dynasties jostled for the top position, one thing became clear — sex and blood were key, and shock was currency.\n\n\n\n\n\nWWE dabbled in a tamer version. Its 'Buried Alive' match involved tossing an opponent into an open grave and burying them 'alive' with soil. Another derivative was WWE's 'Hell In A Cell' concept, which witnessed two opponents trapped in a ring surrounded by a five-metre-tall wire cage.\n\n\n\n\n\nOver at ECW, things were far more extreme.\n\n\n\n\n\nEach week, matches won with DIY weapons became the standard, making the promotion synonymous with the bloody and violent subculture, but also a haven for those who wanted a more brutal viewing experience. Both Whyte and Bateman credit ECW as the inspiration for their own careers.\n\n\n\nNew Jack was one of the most controversial hardcore wrestlers of all time and carried the label of one of the most dangerous and unpredictable people in the industry's history. Source: Supplied / ECW But it was not without risk: one ECW house show resulted in a 17-year-old aspiring wrestler being injured after he was 'bladed' (the act of intentionally and discreetly cutting oneself in a match to draw blood for dramatic effect) too deeply by another wrestler, New Jack, severing two of his arteries and almost killing him.\n\n\n\n\n\nAnother incident led to New Jack and Vic Grimes falling 15 feet, with a miscue sending them straight to the concrete ground. New Jack sustained brain damage and lost sight in one eye.\n\n\n\n\n\nA year later, in a rematch, New Jack allegedly tried to kill Vic Grimes by intentionally going off-script, tasing him and throwing him off the scaffolding. In the wrestling documentary Dark Side of the Ring, New Jack said: \"I was trying to throw his ass to the floor … He was lying in the ring and I told him, 'Now we're even, you f**cker.\"\n\n\n\nJordan Whyte and Joel Bateman were both inspired by Extreme Championship Wrestling in the 90s, which became synonymous with deathmatch-style wrestling. Source: Supplied / Jaden Lee (@jiwcphotos)\n\n'Organised barbarism' unfairly 'demonised'\n\nWrestling's great debate lies in what constitutes a \"shoot\" — something real and unscripted — and a \"work\" — an intentional and predetermined part of the script that's designed to look spontaneous and real.\n\n\n\n\n\nEven today, there are still debates over whether New Jack's attempted killing of Vic Grimes was real or just a masterful example of 'kayfabe' — the wrestling term for portraying events in a fictional narrative as real and genuine.\n\n\n\n\n\nWhatever the truth, deathmatches in the mainstream died as WWE's competitors did. With the company now firmly in its 'PG Era', blood and violence on screen are largely a thing of the past.\n\n\n\n\n\nSome say that's for good reason.\n\n\n\nDeathmatch wrestling has its share of critics — even from those within the professional wrestling industry. Source: Supplied / Jaden Lee (@jiwcphotos) Critics of deathmatch wrestling say it is inherently dangerous, violent for the sake of violence, and a lesser form of professional wrestling. Others say it's for the talentless and has a low bar for skill. Some say it's dangerous for fans, gives wrestling a bad name, or is just plain repetitive with a limited repertoire.\n\n\n\n\n\nWhyte found that after he entered the world of deathmatches, some local Australian promotions were hesitant to work with him. \"It can be pretty frowned upon,\" he says.\n\n\n\n\n\n\"Certain companies won't use you if you're doing deathmatches.\"\n\n\n\n\n\nBut Bateman says the subgenre is unfairly \"demonised\".\n\n\n\nI take a lot of pride in the fact that we have such a safe space — both for our performers and fans.\n\n\"In over 60 events we've run [in our promotion] in five years, we've never had an insurance complaint. We've never had a fan injured,\" he says.\n\n\n\n\n\n\"Any fans who have gotten little cuts and scratches from flying glass absolutely love it … we'll ask if they want a bandaid and they're like, nah, we're fine. We love it. This is why we come here.\"\n\n\n\nSurprisingly, glass is one of the safer weapons in deathmatches. Joel Bateman says it's because they use tempered glass, which \"won't cut you to the point where you need to go to the hospital\". Source: Supplied / Jake Hurdle (@jhmedia.jpeg) Bateman says the Australian scene was almost decimated in 2002 after a \"disgruntled wrestler\" went to the media about a particular \"family-friendly\" deathmatch, calling it \"organised barbarism\" and claiming blood was sprayed on the crowd. In three weeks, crowd numbers went from 1,200 people to 80.\n\n\n\n\n\nIt almost killed the scene entirely, but it's starting to pick up again, albeit slowly, he says.\n\n\n\n\n\n\"Other companies in Melbourne are pushing the envelope more in that deathmatch direction,\" he says, crediting long-term Australian deathmatch wrestlers like KrackerJak and Mad Dog, who have been performing for over 20 years.\n\n\n\n\n\nBateman says there is \"quite a roster\" of deathmatch wrestlers in Australia right now, estimating there are between 30 and 40 of them.\n\n\n\n\n\n\"[Attitudes] are starting to change and people are becoming more accepting of it,\" he says.\n\n\n\nMore than blood\n\nDeathmatches are a visceral, violent experience. But for Bateman, they're about so much more — a place to connect with his First Nations identity.\n\n\n\n\n\nUntil he started his promotion, the Wotjobaluk man wasn't comfortable leading with his Aboriginality as a character trait in the professional wrestling space.\n\n\n\n\n\n\"It wasn't something I leaned into because anytime I did, I was met with a good amount of racism and a good amount of bullying. It was something I pushed down,\" he says.\n\n\n\n\n\n\"If you're a face in a crowd, people feel comfortable saying racist shit.\"\n\n\n\nAt first glance, deathmatch wrestling might look like needless violence. But for Joel Bateman, it's also about expressing his First Nations identity. Source: Supplied / Jaden Lee (@jiwcphotos) But Bateman says that launching the promotion at the start of the Black Lives Matter movement was a \"turning point\" for him and gave him the confidence to show himself wholly on stage.\n\n\n\n\n\nHe's since changed his entrance music to Solid Rock by Goanna, a song about Aboriginal land rights. He also started wearing the Aboriginal flag on his tights.\n\n\n\n\n\n\"I remember being kind of nervous to do it,\" he says.\n\n\n\n\n\n\"I remember finishing the match and just bursting into tears and then opening my eyes and seeing there was a standing ovation.\n\n\n\nIt was this culmination of 18 years of suppressing my genuine self.\n\nHe says his outward display of his identity has allowed other First Nations wrestlers to lean into theirs.\n\n\n\n\n\n\"There's probably more death match wrestlers in the country than there are First Nations wrestlers in the country, which is something I'm trying to rectify. But it's a very long and very slow journey to do so,\" he says.\n\n\n\nJoel Bateman never felt comfortable with his Aboriginality on display in the ring under he started Deathmatch his promotion (business). Now, he hopes to inspire other First Nations wrestlers in Australia. Source: Supplied / Jake Hurdle (@jhmedia.jpeg) The promotion also started in the midst of professional wrestling's own #MeToo movement — #SpeakingOut — which exposed systemic emotional, physical and sexual abuse in the industry.\n\n\n\n\n\nThis meant that, for Bateman, inclusivity was at the forefront of his promotion.\n\n\n\n\n\n\"We came at a time when people really needed to feel safe, and we put a lot of time and energy into creating that space,\" he says.\n\n\n\n\n\nHe says trans people have come out as their authentic selves for the first time in public at his shows.\n\n\n\n\n\n\"That's something that means the absolute world to me. I have a trans son … the first time they ever [went out in public as themselves] was at a wrestling show as well,\" he says.\n\n\n\n\n\nIt's easy to hate deathmatch wrestling from a distance, he says.\n\n\n\n\n\n\"But there's never been a single person I can recall who's taken the time to come and immerse themselves in an event who hasn't then left and said, 'This is kind of special. There's something different about this'.\n\n\n\n\n\n\"The world is a tough place in 2025 … but in wrestling, the real world just stops when you come into that door. It's a form of escapism.\n\n\n\n\n\n\"You can come and be your authentic self.\"\n\n\n\n\n\nReaders seeking support can ring Lifeline crisis support on 13 11 14 or text 0477 13 11 14, visit lifeline.org.au or find an Aboriginal Medical Service here . Resources for young Aboriginal and Torres Strait Islanders can be found at Headspace: Yarn Safe .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-health-problem-costing-australia-billions/g3usjolbe",
        "title": "'I passed out multiple times at work': The health problem costing Australia billions",
        "publish_date": "Sat, 4 Oct 2025 19:39:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "For Rachel Eleanor Hosking, managing her endometriosis symptoms at work has been \"dire\".\n\n\n\n\n\n\"There's been multiple times where I've actually passed out at work and fainted because of immense pain,\" she told SBS News.\n\n\n\n\n\nOn weekends, the 23-year-old PhD student works in retail, where she said standing up for eight hours at a time \"infiltrates\" her flare-ups.\n\n\n\n\n\nShe carries paracetamol and a TENS machine — a \"discreet\" device that delivers small electrical pulses for pain relief, but said they \"don't scratch the surface\" against the debilitating symptoms.\n\n\n\n\n\n\"It can be really difficult for employers to understand the severity of the condition, especially when you're so fatigued. And when you're fatigued, you don't really want to tell your male manager, who will say something like 'Oh, what's endometriosis?',\" Hosking said.\n\n\n\n\n\n\"And you're like, 'dude, I just want to lie in a ball right now, please look it up'.\"\n\n\n\nHosking is one of an estimated one million Australians with endometriosis, a chronic condition where tissue similar to the uterus lining grows outside of the uterus, sometimes in the pelvis or in organs like the ovaries or fallopian tubes.\n\n\n\n\n\nEach month, this tissue thickens and bleeds, which can cause chronic pain, inflammation, fertility issues, and other symptoms like fatigue, bloating and heavy bleeding.\n\n\n\n\n\nThis week, Endometriosis Australia, the nation's peak endometriosis charity, announced a workplace accreditation scheme designed to address the stigma surrounding the condition in the workplace.\n\n\n\n\n\nThe course, open to all businesses in the country, contains education for employers on endometriosis and how to better support staff.\n\n\n\nRachael Eleanor Hosking poses from a hospital bed on the day she received her endometriosis diagnosis. Living with endometriosis led her to pursue research in the same field. Credit: Supplied Monica Forlano, chair of the board at Endometriosis Australia, said the program \"signals to employees that these employers who are accredited [through the program] understand the condition, and it's a safe place\".\n\n\n\n\n\n\"We know that 70 per cent of people with endo have to take unpaid time off because they've exhausted their personal leave, and people are losing their jobs because they can't make ends meet, and a lot of people actually give up work altogether,\" Forlano told SBS News.\n\n\n\nBillions lost in productivity\n\nEndometriosis affects one in seven Australian women, and a lack of awareness around the disease is costing the country billions each year.\n\n\n\n\n\nA 2019 government study found endometriosis costs Australia between $7.4 billion and $9.7 billion per year, with roughly two-thirds of that figure attributed to lost productivity.\n\n\n\n\n\nForlano said the actual figures for the economic loss were likely to be significantly higher.\n\n\n\n\n\n\"That $9.7 billion was based on 2018 numbers and we know now that to the age of 49, one in seven women will have endometriosis, so we can only assume that figure is much greater,\" she said.\n\n\n\n\n\nAustralian government contributions to research have led to a surge in awareness, but she said we are still far behind.\n\n\n\n\n\n\"We now know that there's not just one type of endometriosis — there's at least three, and in regards to understanding this condition, we are where breast cancer was 20-30 years ago,\" she said.\n\n\n\nThe study further highlighted two key factors that contributed to productivity loss: 'absenteeism', where workers are forced to take leave to manage their symptoms at home, and 'presenteeism', where people may be present in the workforce but are unable to work to their full capacity due to their symptoms.\n\n\n\n\n\nWhen 52-year-old Calli Brown started her career in media, managing her endometriosis symptoms at work was a \"shameful\" and stressful process.\n\n\n\n\n\n\"The stress compounded and it was so debilitating, there was a lot of shame, no-one really talked about periods and so there wasn't an environment that was conducive to actually talk about what was going on for you,\" she told SBS News.\n\n\n\n\n\nBrown said she would need to take sick days off because of \"excruciating\" pain, which would often lead her to black out.\n\n\n\n\n\n\"But because you're junior and you're female, and it's a busy environment, and everybody is supposed to be tough, and there are some women who don't experience period pain, there were very few people I felt like I could turn to for support and for understanding,\" she said.\n\n\n\n\n\n\"And so that was very shameful. I would have to take sick days, and at the beginning of your career, you don't want to be having sick days all the time.\"\n\n\n\nLiving with an 'invisible' illness\n\nA survey of 389 workers with endometriosis conducted by Southern Cross University and Western Sydney University, which was supported by Endometriosis Australia, found one in six had lost their jobs to their diagnosis, while one in three said they had been passed over for promotions due to their condition.\n\n\n\nAnna Fragkoudi, a research fellow at The University of Adelaide's School of Public Health, said because endometriosis is an \"invisible\" disease, managers and superiors might not be understanding of the various methods people may need to manage their pain, such as taking sick leave or working from home.\n\n\n\n\n\n\"It is an invisible condition, so people might think, 'Oh, you're all right, so why would you like need to take leave if there is nothing wrong with you?',\" she told SBS News.\n\n\n\n\n\nThe survey found that flexible work arrangements introduced during the COVID-19 pandemic were the biggest contributor to increased productivity for people with endometriosis.\n\n\n\n\n\nHowever, Forlano said the real challenge is being able to discuss the diagnosis at work and confronting the stigma.\n\n\n\n\n\n\"There's a lot of anxiety and stigma raising your diagnosis, because you are seen as potentially unreliable and consistent,\" she said.\n\n\n\n\n\n\"And that's the experience that I had in my career, when managing the symptoms got so bad that I couldn't function.\n\n\n\n\n\n\"Chronic pain brings up real mental health issues because it's it's exhausting, and with the fatigue that comes with that, it was really hard to take on high-stress roles.\"\n\n\n\n\n\nShe said \"some kind of empathy\" from employers could go a long way.\n\n\n\n\n\n\"Some little things will make so much difference, commuting when you're having an endo flare just makes symptoms worse so if you can log in at home from your bed, close to your bathroom that you can fill a hot water bottle whenever you need to, or even have a nap at in your lunch break just so you can perform and work — that's huge for someone with with endo and they can thrive,\" she said.\n\n\n\nBrown said her experience navigating endometriosis in the workplace affected her mental health.\n\n\n\n\n\n\"You're having to push it down, which then just compounds your symptoms, because you're already really stressed. How can you improve your symptoms and get over something when you're stressed and holding it inside? It just compounds the depression, it compounds the anxiety, it compounds the shame,\" she said.\n\n\n\n\n\nShe said initiatives like the accreditation scheme were important because they established credibility towards a historically hidden and undermined disease.\n\n\n\n\n\n\"A lot of the time, women feel like it has to be a secret — to actually have a formal process means it's a conversation opener, right? The world is changing, a lot of women are working in male dominated industries and this makes it safe for them to actually start the conversation in a way that is already legitimate.\"\n\n\n\n\n\nBrown said she was happy that her daughter, who has endometriosis, won't have to go through what she did.\n\n\n\nCalli Brown and her daughter are both diagnosed with endometriosis. Credit: Supplied But Hosking, who now researches endometriosis at The University of Adelaide's Robinson Research Institute, said when it came to endometriosis in Australia, awareness was still the \"most important\" step.\n\n\n\n\n\n\"It's important not only for women to know so that they can know that their period pain is not normal, but knowing that men are also part of this conversation is something that is so important, because men make up [nearly] 50 per cent of the population, and if 50 per cent of the population do not understand the severity of what we are going through, then we're stuck in this sort of rock and a hard place,\" she said.\n\n\n\n\n\n\"It's been too long that women have stayed silent, people with endometriosis have just suffered in silence, hid their period products, their TENS machines, their Panadol, they've said, 'Oh, can I just pop to the restroom quickly?'. And then been denied that.\"\n\n\n\n\n\nShe said awareness was the first step, and now it's: \"How can we help?\"\n\n\n\n\n\nReaders seeking support with mental health can contact Beyond Blue on 1300 22 4636. More information is available at beyondblue.org.au . Embrace Multicultural Mental Health supports people from culturally and linguistically diverse backgrounds.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-everyone-loves-a-ghost-train-but-why-do-we-love-being-scared/u32c8730l",
        "title": "INTERVIEW: Everyone loves a ghost train: but why do we love being scared?",
        "publish_date": "Fri, 3 Oct 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-could-a-first-nations-voice-help-tackle-stubborn-public-health-challenges/9o1r5o95q",
        "title": "INTERVIEW: Could a First Nations voice help tackle stubborn public health challenges?",
        "publish_date": "Fri, 3 Oct 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/yoga-study-older-people-falls/s4gqz30zo",
        "title": "700 Australians were recruited for a yoga study. What researchers found surprised them",
        "publish_date": "Fri, 3 Oct 2025 20:55:12 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When Margaret Kirkwood broke her hip falling up the stairs of her home in Sydney, she could have become a statistic: falls are the leading cause of hospitalisation and injury deaths in Australia.\n\n\n\n\n\nInstead, the 83-year-old made a remarkable recovery. The day following her surgery, she was standing. Less than two weeks later, she was walking with the aid of a single crutch.\n\n\n\n\n\n\"The doctor said, 'You're a textbook case'. Your body is in fantastic condition,\" she said.\n\n\n\n\n\nKirkwood credited her recovery to her yoga practice.\n\n\n\n\n\nFor the past 25 years, she has attended Iyengar Yoga classes twice a week.\n\n\n\nKirkwood said it taught her about her body and has given her strength, which she notices while moving about the house and doing chores.\n\n\n\n\n\n\"If I weren't strong, I would have had a really bad fall,\" she said.\n\n\n\n\n\nHowever, a surprising new study from The University of Sydney has found that Iyengar yoga — a distinct form of yoga that uses props and is popular among older people — should not be recommended as a fall prevention measure.\n\n\n\n\n\nIn the biggest clinical trial investigating the effects of yoga on falls, researchers found that while yoga improved self-confidence and mobility, older people who practised yoga experienced a significantly higher incidence of falls.\n\n\n\nAn unexpected result\n\nThe study recruited 700 people over the age of 60 and invited them to participate in two yoga classes each week for a year.\n\n\n\n\n\nHalf of the cohort did Iyengar yoga, while the other half did seated breathing and stretching. Researchers then tracked the number of falls experienced by both groups over the course of that year.\n\n\n\nThere were limitations to the study, including the COVID-19 pandemic, which forced the classes online. Source: Supplied / Sue-Ellen Kohler Anne Tiedemann, lead researcher and professor of physical activity and health at The University of Sydney, said the results were \"the opposite of what we expected\".\n\n\n\n\n\n\"We have a lot of evidence that exercise, challenges, and balance can prevent falls ... We also know that older people like to do yoga, so we thought it's important to know whether it also prevents falls,\" Tiedemann said.\n\n\n\n\n\nThe yoga cohort reported 33 per cent higher rates of falls than the non-yoga-based group, with 276 falls compared to 164. However, there was only a slight increase in the rate of injury, with only 15 per cent of the yoga group and 13 per cent of the non-yoga group experiencing cuts, grazes, dislocations, sprains, fractures, or brain injury as a result of the fall.\n\n\n\n\n\n\"It's a combination of the environment, your behaviour, and your physiology which determines if you fall or not,\" Tiedemann explained.\n\n\n\n\n\n\"In our study, we identified that people who did the yoga-based exercise showed an improvement in their balance confidence ... So we think what has happened is that people have felt more confident in their abilities, and there was also an indication that they moved about more.\"\n\n\n\n\n\nTiedemann pointed out that the trial had limitations. Initially, the classes were held face-to-face, but when COVID-19 emerged, they transitioned online.\n\n\n\n\n\n\"People might not have pushed themselves as far as they would if they had an instructor in the room,\" Tiedemann said.\n\n\n\nYoga can't 'prevent falls forever'\n\nJean Leow runs Yoga Ink, teaching Iyengar to seniors in Sydney's south and in aged care facilities across the city.\n\n\n\n\n\n\"I love working with seniors. When they come to a class, they really take it on and I'm surprised by how well they adapt,\" she said.\n\n\n\nJean Leow teaches Iyengar classes customised for the needs of her senior students. Source: Supplied / Jean Leow Leow said that while she appreciated the study looked at the effects of yoga over a whole year, rather than just a few weeks, she stressed it's up to the instructor to ensure the classes are tailored to the needs and abilities of each student if they want to see the benefits.\n\n\n\n\n\n\"I can't emphasise enough the amount of customisation we as teachers have to be accountable for,\" she said.\n\n\n\n\n\nSue-ellen Kohler, who has been a yoga instructor for 30 years and teaches at Black Lotus in Sydney's inner-west, expressed concern that having the classes online may have influenced the results.\n\n\n\n\n\n\"The teacher needs to actually look at how the body is working and how the body is using its muscles. Online, you don't get any of that. They're just going to be making shapes,\" she said.\n\n\n\n\n\nLeow also said it's important to recognise the purpose of yoga isn't to \"prevent falls forever\".\n\n\n\n\n\n\"The aim is to help the older person understand what to do when they do fall, and how to correct themselves so they can arrest it and rebalance. That means they may still fall, but they're not going to hurt themselves in the process,\" she said.\n\n\n\n\n\n\"For my own students, some of them are avid travellers, some are gardeners. How do they recover from the things they love doing and protect their bodies enough to sustain their lifestyle?\"\n\n\n\nPreventing falls\n\nEvery day, 14 Australians aged 65 and over will die from a fall, according to the Falls, Balance and Injury Research Centre at Neuroscience Research Australia. A further 364 people will be hospitalised due to a fall each day.\n\n\n\nIn June, the Australian Commission on Safety and Quality in Health Care updated its falls guidelines for the first time since 2009. It emphasised the benefits of exercise for older people, recommending that two to three hours of exercise per week is crucial in preventing falls. It stated that the primary targets should be balance, mobility, and strength.\n\n\n\n\n\nTiedemann said for people whose main aim is fall prevention, there is evidence to show that activities like Tai Chi and classes that focus on functional balance training can be effective.\n\n\n\n\n\n\"I would not be promoting this type of yoga program for falls as the outcome, but it did have other benefits. People were more active and more likely to reach the goals they set,\" she said.\n\n\n\n\n\nShe pointed out that some of the participants in the study enjoyed yoga so much they continued after the program ended.\n\n\n\n\n\nKirkwood, who is still recovering from her fall, believes yoga is still \"perfect\" for her.\n\n\n\n\n\n\"I wouldn't be like this without Iyengar. I've got a really good teacher.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/nrl-grand-final-2025-live-updates-broncos-fight-to-end-almost-two-decade-premiership-drought-against-storm-roosters-v-broncos-in-nrlw-decider-20251002-p5mzmn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NRL grand final 2025 LIVE updates: Broncos fight to end almost two-decade premiership drought against Storm; Roosters v Broncos in NRLW decider",
        "publish_date": "Sun, 05 Oct 2025 13:00:03 +1100",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "Rugby league fans, grand final day has finally arrived.\n\nIt’s been a long season, a dramatic season, but by 10pm tonight it will all be run, done and won.\n\nBillie Eder here to take you through today’s action, and there will be plenty of action across the nine hours.\n\nHere’s a quick rundown of the day.\n\n1pm: Gates open at Accor Stadium\n\nGates open at Accor Stadium 1.20pm: State championships kick-off\n\nState championships kick-off 4pm: NRLW grand final Roosters v Broncos\n\nNRLW grand final Roosters v Broncos 6.30pm: Pre-game entertainment\n\nPre-game entertainment 7.30pm: NRL grand final Storm v Broncos",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/living/does-break-my-heart-phoebe-burgess-lists-southern-highlands-home-20251003-p5mzvn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Does break my heart’: Phoebe Burgess lists Southern Highlands home",
        "publish_date": "Sun, 05 Oct 2025 13:00:00 +1100",
        "category": "finance",
        "authors": [],
        "text": "When she fled Sydney during the COVID lockdown and the end of her marriage to former NRL player Sam, Phoebe Burgess sought solace in the Southern Highlands at her parents’ estate, Daffodil Downs, outside Bowral.\n\n“It was always a place to come home to fireplaces and that cosy feeling of being locked away on your property with your family, good food and the people you love,” says the former magazine journalist and now social media influencer.\n\nOwner: Phoebe Burgess\n\nPhoebe Burgess The property: Four-bedroom Tuscan-style retreat on 6949-square-metre block\n\nFour-bedroom Tuscan-style retreat on 6949-square-metre block Address: 613 Moss Vale Road, Burradoo, NSW\n\n613 Moss Vale Road, Burradoo, NSW Price guide: $1.9 million\n\n$1.9 million Private sale\n\n“It was a sanctuary for me; I was going through a painful time, and I had these two little kids who just came to life every time we drove down the highway.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/is-he-though-legends-debate-moses-snub-20251005-p5n06e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Is he though?': Legends debate Moses snub",
        "publish_date": "Sun, 05 Oct 2025 12:35:33 +1100",
        "category": "finance",
        "authors": [],
        "text": "'Is he though?': Legends debate Moses snub\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/new-technology-could-predict-risk-of-deadly-thunderstorm-asthma-20251005-p5n06c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New technology could predict risk of deadly thunderstorm asthma",
        "publish_date": "Sun, 05 Oct 2025 12:31:17 +1100",
        "category": "finance",
        "authors": [],
        "text": "New technology could predict risk of deadly thunderstorm asthma\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/meghan-makes-paris-fashion-week-debut-20251005-p5n057.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan makes Paris Fashion Week debut",
        "publish_date": "Sun, 05 Oct 2025 11:24:24 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Meghan makes Paris Fashion Week debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/consumer-affairs/australia-wants-to-export-shredded-soft-plastic-local-recyclers-are-worried-20250909-p5mto0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia wants to export shredded soft plastic. Local recyclers are worried",
        "publish_date": "Sun, 05 Oct 2025 11:19:58 +1100",
        "category": "finance",
        "authors": [
            "Hannah Kennelly"
        ],
        "text": "Australian recycling companies have raised concerns over the government’s decision to consider licenses to export shredded soft plastic overseas, saying it undermines the country’s domestic recycling efforts and investments into local infrastructure.\n\nAustralia used to send much of its waste overseas, however following China’s Sword policy, the government introduced the Recycling and Waste Reduction Act in 2020 and implemented staged export restrictions and regulations to promote a circular economy.\n\nAustsing manager Clive Townsend and Plastec Recycling director Steve Rawson. Credit: Joe Armao\n\nHowever on July 31 this year, Australian recycling companies received an email from the Department of Climate Change, Energy, the Environment and Water (DCCEEW), saying the department was satisfied it was “appropriate to consider licence applications to export shredded flexible waste plastic”.\n\nClive Townsend said he was shocked to receive the email and surprised there had been no industry consultation. Townsend works as a sales manager for Austsing – a private soft plastics recycling facility based in Pakenham, Victoria which converts commercial soft plastic waste into recycled pellets.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/taylors-growing-pat-cummins-ashes-concern-20251005-p5n056.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Taylor's growing Pat Cummins Ashes concern",
        "publish_date": "Sun, 05 Oct 2025 11:14:29 +1100",
        "category": "finance",
        "authors": [],
        "text": "Taylor's growing Pat Cummins Ashes concern\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/johnsons-huge-praise-for-walsh-ahead-of-gf-20251005-p5n054.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Johnson's huge praise for Walsh ahead of GF",
        "publish_date": "Sun, 05 Oct 2025 10:59:39 +1100",
        "category": "finance",
        "authors": [],
        "text": "Johnson's huge praise for Walsh ahead of GF\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/encouraging-campaign-but-the-wallabies-saved-their-worst-for-last-20251005-p5n04x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Encouraging campaign, but the Wallabies saved their worst for last",
        "publish_date": "Sun, 05 Oct 2025 10:55:02 +1100",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "1. Wallabies save their worst for last\n\nThe Wallabies’ 11th loss in a row to the All Blacks in Perth is an unwanted record that has crept up stealthily, and as it now spans three coaching regimes, it is not solely owned by the current group.\n\nBut what will frustrate them after the 28–14 loss — their widest margin of defeat in the Rugby Championship — is the nagging suspicion that they lost too many of the effort areas in the second half.\n\nBy my count, there were three kick chases in which the All Blacks showed more urgency, all leading to either turnovers or an accumulation of pressure. While black jerseys swarmed around the ball, there were fewer Wallabies in support, and by the final 10 minutes, the struggling Tane Edmed was almost an isolated figure in the backfield.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/key-players-and-first-round-picks-up-for-grabs-your-team-by-team-guide-to-trade-period-20250930-p5myvi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Key players and first-round picks up for grabs: Your team-by-team guide to trade period",
        "publish_date": "Sun, 05 Oct 2025 10:25:16 +1100",
        "category": "sports",
        "authors": [
            "Jon Pierik",
            "Peter Ryan",
            "Marc Mcgowan"
        ],
        "text": "Charlie Curnow is exploring his options but is contracted to the Blues. Credit: The Age Collingwood Draft picks: 34, 52, 64, 70\n\nKey players: Brody Mihocek, Mason Cox, Tom Mitchell, Bobby Hill Coach Craig McRae said he wanted a balance between securing established talent, while also having a good draft hand. Swans key forward Jack Buller is Magpies-bound on a two-year deal, and that should not be too complicated a trade, but they are not likely to pursue Demons defender Steven May. Jamie Elliott will stay, rejecting a three-year offer from the Suns to re-sign for two seasons, but Brody Mihocek is headed to Melbourne. Bobby Hill only recently signed a contract extension, but rival clubs have asked about him, after personal issues impacted the end of his season. Collingwood encouraged Mason Cox and Tom Mitchell to explore their options elsewhere. – Jon Pierik Essendon\n\nDraft picks: 4, 5, 22, 25\n\nKey players: Sam Draper, Zach Merrett Hawthorn wait with bated breath to see if the Bombers will trade captain Zach Merrett after his shock meeting with Hawks coach Sam Mitchell. The six-time club champion wants to play finals football and contend for flags, both of which have proven elusive at Essendon. Sam Draper has already announced he is leaving in free agency for Brisbane. The Bombers were aggressively pursuing in-demand Sun Sam Flanders but missed out, and are battling Port Adelaide for Gold Coast’s free agent winger Brayden Fiorini. Hawks key defender Jai Serong is also a player of interest, while they could make a play for young Roo Zane Duursma, brother of Xavier. Delisted defender Jayden Laverde will sign with GWS post-draft. – Marc McGowan Sam Draper has played his last game for the Bombers. Credit: Getty Images Fremantle Draft picks: 11, 29, 38, 47, 65\n\nKey players: Will Brodie, Liam Reidy\n\nAfter being starved of opportunities, Will Brodie and Liam Reidy will head to Port Adelaide and Carlton, respectively, while speculation about Sean Darcy’s future happens every year – and every season he stays. Fremantle have convinced mobile Melbourne defender Judd McVee to play alongside Jordan Clark, but will need to broker a trade with the Demons, who were disappointed to lose him. They are also open to trading their first pick in this year’s heavily compromised draft, which will be pushed back by academy and father-son selections. – Peter Ryan Judd McVee is on his way out of Melbourne. Credit: AFL Photos Geelong Draft picks: 17, 35, 53, 71\n\nKey players: Rhys Stanley The Cats are bringing in ex-Hawk and local lad James Worpel on a four-year deal to add to their midfield depth. While Worpel is not an A-grader, Geelong’s lack of midfield depth was obvious in the grand final. They are in the hunt for Charlie Curnow, the Blues forward keen for a fresh start, although a trade will be extremely complicated. St Kilda ruckman Rowan Marshall has requested a trade to the Cats, although the Saints have previously said they won’t budge. It shapes as a fascinating trade period for Geelong, who want to remain in the premiership hunt. – Jon Pierik\n\nGeelong have landed James Worpel. Credit: AFL Photos Gold Coast Draft picks: 6, 13, 16, 31, 56, 67\n\nKey players: Connor Budarick, Sam Flanders, Bailey Humphrey, Malcolm Rosas jnr Champion Demon Christian Petracca has requested a trade to the Suns, and looms as the club’s biggest recruit since Gary Ablett jnr. Now they need to appease Melbourne in a deal, and this is their priority over any potential Charlie Curnow pursuit, which is looking unlikely. Gold Coast are so far resisting making Bailey Humphrey available, but the forward-midfielder has interest from three clubs, including the Dees, who are also in a four-way race for Sam Flanders. Connor Budarick and Malcolm Rosas jnr requested trades to Western Bulldogs and Sydney, respectively, while Port Adelaide and Essendon are keen on free agent winger Brayden Fiorini. The Suns missed out on Jamie Elliott in free agency, but have met with troubled Bulldog Jamarra Ugle-Hagan and registered interest in contracted Swan James Rowbottom. – Marc McGowan GWS\n\nDraft picks: 12, 30, 32\n\nKey players: Jacob Wehr, Leek Aleer, Wade Derksen The Giants will ask for a first-round selection for Leek Aleer, but the Saints won’t be handing one over easily despite the lucrative contract on offer, and the fact he played the final 13 matches in defence. Wade Derksen is in limbo; the Demons lost interest after trying to land him last season as he seeks more AFL opportunities, while Jacob Wehr is off to Port Adelaide as a free agent. Essendon’s Jayden Laverde has joined the Giants, and they are interested in Demon Clayton Oliver, who has fallen out of favour. – Peter Ryan Hawthorn Draft picks: 8, 26, 55, 69\n\nKey players: James Worpel, Jai Serong, Henry Hustwaite, Cam Mackenzie Restricted free agent midfielder James Worpel has left for Geelong on a four-year deal, but Sam Butler resisted West Coast’s strong interest to ink a new two-year deal. He will now hope for more midfield time. Jai Serong, who was hindered by the additions of Josh Battle and Tom Barrass this year, has been linked to North Melbourne, Essendon and Sydney. Cam Mackenzie played 12 games this year, and has interest from the Saints, while midfielder Henry Hustwaite had little opportunity this year, with Richmond among his suitors. – Jon Pierik\n\nLoading Melbourne Draft picks: 23, 53, 59\n\nKey players: Steven May, Judd McVee, Clayton Oliver, Christian Petracca, Charlie Spargo The Demons’ flag-winning era is officially over, with coach Simon Goodwin sacked, Christian Petracca requesting a trade to Gold Coast, and both Steven May and Clayton Oliver encouraged to explore opportunities elsewhere. Charlie Spargo, who also played in the 2021 premiership, inked a free agency deal with North Melbourne, while wanted defender Judd McVee requested a trade home to Fremantle. Melbourne have lured Collingwood forward Brody Mihocek on a three-year deal, which could be via trade or free agency, while they hope to trade for St Kilda ruckman Max Heath. Beyond them, new coach Steven King has met with contracted Sun Bailey Humphrey. They are no longer interested in untried Giant Wade Derksen. – Marc McGowan North Melbourne\n\nDraft picks: 20, 21, 39, 57\n\nKey players: Jy Simpkin Contracted skipper Jy Simpkin wants more midfield time, but is yet to put in a trade request. If he did, the Kangaroos would drive a hard bargain for any suitors. Melbourne premiership forward Charlie Spargo joins as a free agent after an injury-riddled two seasons. An elite kick inside 50, Spargo is a handy, cheap addition if he can get on the park regularly. They are in the market for Hawks key defender Jai Serong after missing out on St Kilda’s Marcus Windhager, who re-signed, and Gold Coast’s Connor Budarick, who nominated the Western Bulldogs instead. – Peter Ryan Will the Roos lose their co-captain Jy Simpkin? Credit: AFL Photos via Getty Images Port Adelaide Draft picks: 24, 42, 60\n\nKey players: Zak Butters\n\nLoading It will be interesting to see how the Power position themselves heading into Josh Carr’s maiden season in charge. Fremantle midfielder Will Brodie, contracted until the end of 2027, has requested a trade to Alberton, seeking greater opportunity. Giant Jacob Wehr, a running defender and wingman, has signed with the Power as an unrestricted free agent, while they are trying to convince Gold Coast’s Brayden Fiorini to join them as a free agent. Silky midfielder Zak Butters will be a restricted free agent next year, but could be lured home to Victoria despite the Power and his manager insisting he will remain. He has been offered a two-year extension, plus a player option to extend it by a further six years, but he is yet to sign. – Jon Pierik Richmond Draft picks: 2, 3\n\nKey players: Tylar Young Much-improved defender Tylar Young requested a trade to West Coast after a strong second half of the season, in a blow to the Tigers, who remain in rebuilding mode and are unlikely to be overly active in the trade period. They missed out on Gold Coast goalsneak Malcolm Rosas jnr, who picked the Swans over them, but those are the cheap types they are most likely to target. Richmond are willing to trade their No.3 pick, which they acquired from North Melbourne, for the right deal after selecting seven players in the top 30 last year. – Marc McGowan\n\nRowan Marshall wants out of the Saints as Tom De Koning arrives. Credit: AFL Photos St Kilda Draft picks: 7, 43, 58\n\nKey players: Rowan Marshall, Jack Steele, Callum Wilkie All-Australian defender Callum Wilkie entertained a serious offer from the Bulldogs before deciding not to push for a trade with two years remaining on his contract. Rowan Marshall might reach Geelong, but there is plenty of water to go under the bridge, while skipper Jack Steele is set to stay, too, despite the Saints encouraging him to look around. St Kilda have landed free agents Tom De Koning and Jack Silvagni, and have the Giants’ Leek Aleer and West Coast’s Liam Ryan wanting to join them. The Suns’ Sam Flanders has nominated them as his new home – the No.7 pick is likely what gets the deal done. It’s an unprecedented opening of the piggy bank as they attempt to return to premiership contention. It may lose them Marshall. – Peter Ryan Sydney\n\nDraft picks: 9, 27, 45, 63\n\nKey players: James Rowbottom Gold Coast forward Malcolm Rosas jnr has chosen Sydney as his preferred new home, but it’s Charlie Curnow whom the Swans dearly want. The star Blue has three clubs he is keen to get to – Gold Coast, Geelong or Sydney. However, as the Cats said, it’s going to take something special to get a deal done for a man who is contracted to Carlton until the end of 2029. The Swans delisted Aaron Francis and Robbie Fox, who are now on the Giants’ radar. James Rowbottom is contracted for three more seasons, but the Suns are interested in the tough midfielder. – Jon Pierik Malcolm Rosas has nominated the Swans as his preferred new home. Credit: AFL Photos West Coast Draft picks: 1, 15, 19, 33, 51\n\nKey players: Oscar Allen, Tyler Brockman, Campbell Chesser, Liam Ryan\n\nLoading It has already been an eventful off-season for the wooden-spooners, with Richmond defender Tylar Young requesting a trade west and dual premiership-winning Lions defender Brandon Starcevich agreeing to join them as well. The Eagles plan to trade for Starcevich instead of signing him in free agency, to avoid diluting their compensation for Allen leaving for Brisbane. The AFL awarded West Coast an end-of-first-round selection as part of an assistance package, which could be the key piece in trading for Starcevich. Campbell Chesser and All-Australian forward Liam Ryan requested trades to Carlton and St Kilda, respectively. Close friend Ryan’s impending exit could lead to Tyler Brockman exploring his options as well. – Marc McGowan Western Bulldogs Draft picks: 10, 28\n\nKey players: Buku Khamis, Jamarra Ugle-Hagan The Bulldogs made a big offer to St Kilda’s Callum Wilkie in a long-shot attempt to prise him out of the Saints as they seek to bolster their defence, but he is set to stay after a pay rise. Buku Khamis wants a trade to the Blues, while Jamarra Ugle-Hagan has almost certainly played his last match for the club. He will either be traded to the Suns on a new contract or take a long road back to the AFL. The Dogs also landed the big body they were after, with the Suns’ Connor Budarick asking to be traded to the Kennel. But they missed out on Deven Robertson, who chose West Coast instead as his preferred new home. – Peter Ryan",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/meghan-duchess-of-sussex-makes-surprise-debut-at-paris-fashion-week-20251005-p5n03p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan, Duchess of Sussex, makes surprise debut at Paris Fashion Week",
        "publish_date": "Sun, 05 Oct 2025 09:33:03 +1100",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "Who was that figure in a white cape taking her seat at the very last moment before the Balenciaga show began at Paris Fashion Week? Was it a supermodel, Meryl Streep or an HRH? No, it was Meghan, Duchess of Sussex making her front-row debut in the fashion capital.\n\nThe former Suits actor upstaged front-row companions Lauren Sanchez-Bezos, Anne Hathaway and PinkPantheress with her unexpected appearance at the debut of former Valentino creative director Pierpaolo Piccioli as creative director of Balenciaga.\n\nDuring her acting days as Meghan Markle, she was a regular fixture at New York Fashion Week, with her most recent fashion show RSVP to a runway at Toronto Fashion Week way back in 2015. A front-row seat in Paris is a right royal step up.\n\n“Meghan, Duchess of Sussex, attended the Balenciaga show in Paris on Saturday night in support of Pierpaolo Piccioli, who recently assumed the role of creative director for the house,” a representative for the duchess said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/twelve-apostles-are-down-to-five-and-the-sea-could-reclaim-another-any-minute-20251003-p5mzym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Twelve Apostles are down to seven, and the sea could reclaim another any minute",
        "publish_date": "Sun, 05 Oct 2025 09:30:00 +1100",
        "category": "finance",
        "authors": [
            "Benjamin Preiss",
            "Liam Mannix"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size In the beginning, Victoria’s south-west coastline was formless and empty, submerged by the ocean. Darkness cloaked the surface of the deep. Not for long. The Earth cooled. Far to the south, glaciers formed. The skirts of the ocean were pulled back, revealing a coastline of striped yellow limestone. And then, over a few thousand years, waves and wind did their work, battering the shoreline into a dramatic form of environmental stonemasonry. A view of the Twelve Apostles, which remains a popular tourist attraction. Credit: Nicole Cleary Today, we call it the Twelve Apostles – a natural formation that continues to draw millions of tourists from across the country, and the world. There was a time when at least 13 limestone pillars were part of the natural formation. Five of those pillars now sit below the water, gaining the term the “drowned apostles” by researchers. The last apostle to drown came crashing down in 2005, leaving just seven standing.\n\nAdvertisement\n\nCoastline experts say it is a matter of when and not if the next sea stack crumbles into the ocean. “I wouldn’t be surprised if one fell down next week,” says David Kennedy, a professor of coastal geomorphology at the University of Melbourne. “I do wonder if I’ll see one collapse each time I visit there.” Despite their collapsing state, the Twelve Apostles remain a popular tourism attraction. Credit: Nicole Cleary Anticipation of the next collapse is against a backdrop of debate about whether visitors should be charged to view the natural attraction while surrounding geological wonders remain closed to the public due to concerns about coastal erosion. Last week, the Great Ocean Road Regional Tourism group and local council called for the introduction of a visitor payment scheme to maintain facilities and help protect the fragile coastline. The push comes after the state government announced completion of a rooftop structure last month as part of a new $126 million visitor centre being built in a redevelopment of the area. The centre will also include shops, eateries and a garden.\n\nAdvertisement\n\nPrincetown resident Dion Webber has been flagging concerns about water discharge at the Twelve Apostles and access closures at nearby sites, including Gibson Steps, Loch Ard Gorge and The Arch. Webber worries that construction work at the Twelve Apostles tourism site is contributing to cliff instability. And he says the closures result in a poorer experience for tourists, who make the trip to the south-west coast, as well as locals. “It’s terrible to see all this happening,” Webber says. Dion Webber has been raising concerns with water runoff at the Twelve Apostles site. Credit: Nicole Cleary Richard Riordan, Liberal MP for Polwarth, which covers the south-west, says the closure of so many of the area’s tourist sites calls into question the value visitors receive, particularly if they will be charged to visit in future. “This is such a lost opportunity. It’s such an important part of Victoria’s tourism offer,” he says. “Sadly, it’s at risk of being a huge white elephant.” Riordan says the government spending on the Twelve Apostles redevelopment is not commensurate with the condition of the sites, which he argues have been poorly managed.\n\nAdvertisement\n\nHowever, a state government spokeswoman says the Twelve Apostles redevelopment will transform the destination, ensuring it is safer and easier to experience while encouraging people to stay longer in the region. She says no decisions have been made about charging visitors. A spokesman for the Great Ocean Road Coast and Parks Authority says Gibson Steps will reopen soon and Loch Ard Gorge is still a great place to visit with a new blowhole lookout now open. The authority confirmed it is investigating feasibility options for stairs at Loch Ard Gorge. It is also considering the effect of rain and stormwater volume entering the drainage system from the Twelve Apostles visitor centre site. Asking whether more apostles will fall down misunderstands the landmark, scientists say. They are constantly in the process of eroding and collapsing. “We are looking at a snapshot in time of 6000 years of the coast retreating,” says Kennedy. “They are a geographical quirk.” The coastline around Port Campbell was laid down hundreds of millions of years ago, when sea levels were tens of metres higher and the area was a shallow marine bay known as the Otway Basin.\n\nAdvertisement\n\nSwarms of shellfish and single-celled protozoans were born, lived and died here, their shells laid down in sediment that eventually became rich yellow limestone. The sea gradually retreated, no longer sitting atop the rock but now chiselling at its edges. Some rock is too hard to be eroded, like the shoreline at Wilsons Promontory. Some is so soft it could not support the weight of a stack and crumbles away to a cliff-face, like those at Anglesea. Loch Ard Gorge where there have been some access closures. Credit: Nicole Cleary Here, the limestone is just soft enough to weather slowly, but with enough strength to hold up hundreds of tonnes of rock. “The sea eats at them, and eventually, they fall,” says associate professor Stephen Gallagher, a micropalaeontologist at the University of Melbourne. The problem is predicting just when that collapse might happen.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw7-arsenal-vs-west-ham-20251005-p5n040.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW7: Arsenal vs West Ham",
        "publish_date": "Sun, 05 Oct 2025 09:06:18 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW7: Arsenal vs West Ham\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw7-man-utd-vs-sunderland-20251005-p5n043.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW7: Man Utd vs Sunderland",
        "publish_date": "Sun, 05 Oct 2025 09:06:16 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW7: Man Utd vs Sunderland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/fine-cabbies-shock-188-ripoff-011528595.html",
        "title": "New fine for cabbies after shock $188 ripoff",
        "publish_date": "2025-10-05T01:19:21Z",
        "category": "finance",
        "authors": [],
        "text": "NSW taxi drivers who overcharge customers could be hit with a $3000 penalty in a fresh bid to crack down on fare-related offending.\n\nThe new fine, to be imposed on first fare-related offences, triples from an earlier $1000 penalty.\n\nIt follows the prosecution of a dodgy driver who charged an overseas family $188 for a 13km trip from Sydney Airport to the CBD.\n\nThe driver copped a $2000 penalty for that offence.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Tripling the penalty for first-time offence should serve as a big flashing light to any taxi driver doing the wrong thing that the NSW Government has zero tolerance for rip-offs and rackets being conducted from the driver’s seat of a cab,” Transport Minister John Graham said.\n\n“The vast majority of cab drivers are honest and upstanding and I want to thank the industry for working with us to protect their reputation by weeding out rogue cabbies.\n\n“Whether you are in the cab rank at Sydney Airport, hailing a taxi in the city or booking one from home, it should be a smooth, friendly and good value experience.”\n\nThe expanded penalty is designed to deter drivers who overcharge, refuse to use their meters or refuse a fare.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nNSW Taxi Council chief executive Nick Abrahim said he welcomed the tougher penalty threat.\n\n“The NSW Taxi Council commends the NSW government for adopting the tougher penalties, which is a part of the NSW Taxi Council Four Point Plan, focusing on weeding out Drivers who are tarnishing the good work delivered by the majority of our Cabbies,” he said.\n\nThe NSW government has increased penalties for cab drivers who overcharge customers. Picture: NewsWire / Sarah Marshall\n\nPoint to Point Transport Commissioner Anthony Wing said his team had issued more than one thousand $1000 fines to drivers for fare related offences in the past two years.\n\n“I take fare-related offences seriously – all passengers travelling in a taxi should feel confident they are getting a fair fare,” he said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Let me reinforce that most of the industry is doing a great job, it is a minority of drivers choosing to do the wrong thing and these rogue drivers will face the full force of the law for their behaviour”It follows an announcement last month of a flat $60 rate from Sydney Airport to the CBD.\n\nThe flat rate system will be trialled over a two-year period and only applies to trips from the airport to a 2000 postcode destination.\n\nThe fares will also rise with the consumer price index each year from July 2026.\n\nThe proposal is designed to block inconsistent fares to the city, with some passengers reporting a $50 trip while others shell out up to $100.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe changes come as taxi drivers face increased competition at the airport from rideshare services like Uber.\n\nIn 2018, taxis accounted for 57 per cent of pick-ups and drop-offs but only 27 per cent in June 2024, airport data shows.\n\nPassengers can now book trips through Uber near the southern end of the T1 taxi area.",
        "source": "Yahoo"
    }
]