[
    {
        "url": "https://www.9news.com.au/world/trump-threatens-canada-with-10-extra-import-tax-for-not-pulling-down-antitariffs-ad-sooner/1b2c71cf-9243-414b-9ef0-2c5277b9b0b1",
        "title": "Trump threatens to hike Canadian tariffs by 10 per cent in extraordinary rant",
        "publish_date": "Sat, 25 Oct 2025 22:03:15 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "President Donald Trump said he plans to hike tariffs on imports of Canadian goods by an extra 10 per cent because of an anti-tariff television ad aired by the province of Ontario.\n\nThe ad used the words of former President Ronald Reagan to criticise US tariffs, angering Trump who said he would end trade talks with Canada.\n\nOntario Premier Doug Ford said he would pull the ad after the weekend, and it ran Friday night during the first game of the World Series.\n\nPresident Donald Trump said he plans to hike tariffs on imports of Canadian goods by an extra 10 per cent. (AP)\n\n“Their Advertisement was to be taken down, IMMEDIATELY, but they let it run last night during the World Series, knowing that it was a FRAUD,” Trump said in a post on his Truth Social platform as he flew aboard Air Force One to Malaysia.\n\n\"Because of their serious misrepresentation of the facts, and hostile act, I am increasing the Tariff on Canada by 10 per cent over and above what they are paying now.”\n\nIt was unclear what legal authority Trump would use to impose the additional import taxes.\n\nThe White House did not immediately respond to a request for comment on when the 10 per cent hike would come into effect, and whether it would apply to all Canadian goods.\n\nCanada's economy has been hit hard by Trump's tariffs, and Canadian Prime Minister Mark Carney has been trying to work with Trump to lower them.\n\nMore than three-quarters of Canadian exports go to the U.S., and nearly $3.6 billion Canadian ($3.9 billion AUD) worth of goods and services cross the border daily.\n\nDonald Trump Truth Social post on Canada tariffs (Truth Social)\n\nA spokesperson for Carney didn’t immediately respond to a request for comment.\n\nMany Canadian products have been hit with a 35 per cent tariff, while steel and aluminium face rates of 50 per cent.\n\nEnergy products have a lower rate of 10 per cent, while the vast majority of goods are covered by the U.S.-Canada-Mexico Agreement, and are exempt from tariffs.\n\nThat trade agreement is slated for review. Trump negotiated the deal in his first term, but has since soured on it.\n\nTrump and Carney will both attend the Association of Southeast Asian Nations summit in Malaysia. But Trump told reporters traveling with him that he had no intention of meeting Carney there.\n\nTrump said the ad misrepresented the position of Reagan, a two-term president and a beloved figure in the Republican Party. But Reagan was wary of tariffs and used much of the 1987 address featured in Ontario's ad spelling out the case against tariffs.\n\nTrump has complained the ad was aimed at influencing the U.S. Supreme Court ahead of arguments scheduled for next month that could decide whether Trump has the power to impose his sweeping tariffs, a key part of his economic strategy.\n\nLower courts had ruled he had exceeded his authority.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/perinatal-anxiety-depression-gidget-house-opens-at-burleigh-heads-gold-coast-news/1dd0ac54-a3b8-4cc8-bf99-7f62b7802c37",
        "title": "'It was just emptiness': Mum's devastating realisation she needed help",
        "publish_date": "Sat, 25 Oct 2025 19:30:24 +0000",
        "category": "finance",
        "authors": [
            "Oct"
        ],
        "text": "Marcelle Cooper knew something was wrong when she looked down at her beautiful, giggling, baby and felt absolutely nothing.\n\nIn the years beforehand, Cooper had suffered six miscarriages, endured IVF and all kinds of alternative therapies, as she and husband Steve tried desperately to have a baby.\n\nAnd then, a year after the couple from North Sydney stopped trying, their \"beautiful miracle girl\" Skye arrived.\n\nMarcelle Cooper (right) with husband Steve (left) and daughter Skye. (Gidget Foundation)\n\n\"She was perfectly healthy and thriving,\" Cooper said.\n\n\"We were in our love bubble, it was so special and she was reaching every milestone effortlessly.\n\n\"But around the 12-week mark, I came tumbling down, like a brick wall.\"\n\n\"I was absolutely riddled with fear and dread so deep in my bones that I could barely eat and I couldn't sleep.\n\nCooper describes the emotional rollercoaster of having tried for a baby for so long, and then deciding to stop trying, only to then fall pregnant unexpectedly and carry a baby to term, as being completely overwhelming.\n\n\"You so desperately want answers, but there are none to give,\" she said.\n\n\"There's the hope and the grief and the anxiety and the shame, and that real feeling of failure, and almost desperation of like, 'my body is meant to be able to do this, why can't it?'\n\n\"We were broken, we were worn out physically and emotionally, and we sort of came to a place of surrender and acceptance.\"\n\nIt was after a year of travelling and rekindling their relationship that Cooper unexpectedly fell pregnant again, but she was immediately anxious.\n\n\"Given my history, I pretty much resigned myself to the fact that I was just gonna wait for (another) miscarriage, essentially.\n\n\"And then she actually arrived and she was this perfect baby.\n\n\"I was like, 'Oh my God, I don't know what to do. I can't stuff this up... I've got to do right by her'.\"\n\nSkye was born during the COVID-19 pandemic, meaning ﻿the Coopers could not have visits from family.\n\n\"It was just the two of us battling away, and we had absolutely no idea what we were doing,\" Cooper said.\n\n\"﻿Around the six-month mark, I really distinctly remember my husband was at work and Skye was on the change table, and she was trying so hard to like babble and giggle and engage with me and I remember looking at her, and it was just nothing there, it was just emptiness.\n\n\"It was just this devastating feeling of 'this poor baby deserves so much more than me as her mum'.\"\n\nAt that point, Cooper knew she needed help and had a telehealth consult with her GP, who referred her to the Gidget Foundation.\n\nMarcelle Cooper, now a 'Gidget Angel' speaks at the opening of Gidget House Burleigh Heads. (Gidget Foundation)\n\nGidget Foundation Australia is a not-for-profit organisation that supports expectant, new and potential parents who may be experiencing perinatal depression or anxiety with specialist care, including up to 10 bulk-billed, face-to-face, individual psychological counselling sessions for clients referred by their GP with a mental health care plan.\n\n\"It was just an instant sense of relief,\" Cooper said.\n\n\"I was so ashamed and felt so guilty and like I was such a failure and I thought I was the only person in the world that ever felt like that.\"\n\nShe began fortnightly ﻿consults with a Gidget clinician, via videolink due to the on-going pandemic.\n\n\"﻿They really grounded me and it never felt overwhelming... it was so self-paced.\n\n\"I felt like I could share my worries with someone without feeling like I was burdening my loved ones because they felt quite helpless as well.\"\n\nAccording to Gidget Foundation, one-in-five mums and one-in-10 dads will be diagnosed with perinatal depression and anxiety.\n\nThe foundation is the largest supplier of perinatal mental health support services﻿ but they only see 4.5 per cent of the 100,000 parents diagnosed annually.\n\n\"We know that there's roughly 95 per cent of people (who) are either trying to source out a private psychologist, which is rare and hard to find with specialist skills, but also probably going without, so we know the demand is really significant,\" Gidget Foundation CEO Arabella Gibson said.\n\nREAD MORE: Specialist taskforce to take over search for Dezi Freeman\n\nGidget Foundation CEO Arabella Gibson. (Gidget Foundation)\n\nEarly intervention is critical to changing the trajectory of families experiencing perinatal depression and anxiety, Gibson said.\n\n\"﻿Having a baby, the identity change that brings, the responsibility that brings, the pressures, financially, personally, from a relationship perspective, there's so many changes that we go through..\n\n\"So many people will go on for years feeling horrific and terrible and resorting to drugs, alcohol, gambling, whatever, when in fact, if we got in early, got them the support they need, gave them the tools and talked through the issues, we could actually capture a whole lot of heartache within a matter of months and have them back on track again.\n\n\"I know that probably sounds really simple, but in actual fact, it is that simple, because there is still a stigma around perinatal mental health, because it's meant to be a time of joy but actually it can quite often be incredibly challenging and the weight of bringing a new human into the world can be very heavy.\"\n\nThere are now 39 Gidget Houses across Australia - including the latest location which opened at Stockland Burleigh Heads on the Gold Coast last week.\n\nA Gidget House consultation room at Burleigh Heads. (Gidget Foundation)\n\nThe Gidget Foundation was named after a young mother who took her own life while experiencing postnatal depression﻿.\n\n\"(Gidget) had the beautiful marriage and the beautiful home, and the great job and the beautiful friends and everything like that,\" Cooper said.\n\n\"It doesn't discriminate.\n\n\"﻿Asking for help isn't a weakness, that's the strength, and that was definitely the scariest and most courageous thing I did.\n\n\"But it wasn't until I did reach out that everything changed.\"\n\nBaby Skye is now about to turn five, and will start school next year.﻿\n\n\"She's so caring and she's super sensitive to everyone else's feelings,\" Cooper said.\n\n﻿\"We look at each other sometimes and we're like, wow, this little human is so lovely.\"\n\nGidget Foundation Australia is not a crisis support service.﻿\n\nPerinatal mental health support is available from the PANDA National Helpline on 1300 726 306.\n\nThe Red Nose Grief and Loss Support Line is available 24/7 for anyone affected by the loss of a pregnancy, stillbirth or death of a baby or child on 1300 308 307.\n\nReaders seeking support can contact Lifeline on 13 11 14 or Beyond Blue on 1300 22 4636. In an emergency, dial Triple Zero (000).",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australian-womens-cricketers-allegedly-touched-inappropriately-icc-womens-world-cup/c41dad91-9ef6-421c-820d-60811174d445",
        "title": "Aussie women's cricketers allegedly 'touched inappropriately' on tour in India",
        "publish_date": "Sat, 25 Oct 2025 08:28:16 +0000",
        "category": "sports",
        "authors": [
            "Oct"
        ],
        "text": "women's cricket team have allegedly been followed and harassed by a man in the\n\nThe female players, who are in Indore for the ICC Women's World Cup, were on their way to a café when they were allegedly \"approached and touched inappropriately\" by a man on a motorbike, Cricket Australia confirmed in a statement.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/rugby-league-nrl-reece-walsh-kangaroos-england-ashes-first-test/105935528",
        "title": "Walsh hailed a 'freak of a player' after starring in Ashes Test win",
        "publish_date": "Sun, 26 Oct 2025 01:45:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "Nathan Cleary and Cameron Munster have heaped praise on Australia teammate Reece Walsh following his stunning Test debut against England at Wembley.\n\nWalsh scored two tries and starred elsewhere in attack and defence to earn the player-of-the-match award, as the Kangaroos recorded a convincing 26-6 victory in the opening Ashes Test.\n\nHis performance came three weeks after his breathtaking display for the Brisbane Broncos in their NRL grand-final win over the Melbourne Storm.\n\nOn that occasion, he was also named player of the match and received the Clive Churchill Medal.\n\nKangaroos crush England in Ashes opener Reece Walsh scored two tries and saved two more as the Kangaroos belted England 26-6 in front of a record crowd at Wembley Stadium in London.\n\nCleary and Munster — who are both regarded as potential NRL Immortals once they retire — were captivated by Walsh's efforts against England in front of 60,812 spectators.\n\n\"It's outstanding, what a freak of a player,\" Cleary said.\n\n\"It's an absolute pleasure to play alongside him.\"\n\nStorm great Munster saw Walsh's brilliance up close in his side's 26-22 loss to the Broncos in the NRL season decider in Sydney earlier this month.\n\n\"I'm very lucky to play with him. He broke my heart a couple of weeks ago,\" Munster said.\n\n\"He's a special talent and he's only going to get better. That's great to see.\"\n\nReece Walsh was a fan favourite with the crowd at Wembley. (Getty Images/CameraSport: Lee Clark)\n\nWalsh, though, is his own harshest critic.\n\nHe found fault in his game against England and vowed to improve in the second Test of the series, which will be played at Liverpool's Everton Stadium next Sunday morning AEDT.\n\n\"There's some things that I could definitely get better at, for sure,\" Walsh said.\n\n\"There was a few things in defence there, I sort of let the boys down in the game.\n\n\"I thought we were pretty scrappy out there … there's a lot of room for improvement.\n\n\"But when we're all chasing perfection, it doesn't mean you're going to get it. So we've just got to keep trying to get better.\"\n\nFollowing the second Ashes Test, the series will conclude at Headingley in Leeds on November 9 AEDT.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/nt-toddler-childcare-death-ebony-thompson-inquest-findings/105935362",
        "title": "Toddler's family call for 'Ebony's Law' after childcare centre death",
        "publish_date": "Sun, 26 Oct 2025 01:40:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "The death of a toddler who became trapped on a fence at a childcare centre outside Darwin last year after being unaccounted-for for up to 10 minutes was preventable, a coroner has found.\n\nEbony Thompson was found by a staff member hanging from the 900mm high loop-top fence in a \"blind spot\" behind a shed at the Humpty Doo Community & Child Care Centre on August 31 and could not be revived.\n\nIn handing down her findings into the 22-month-old's death, Coroner Elisabeth Armitage ruled Ebony had been trapped in the fence for at least four minutes after trying to lean over it to see into the centre's chicken coop.\n\nJudge Armitage said the lack of a \"yard check\" in the centre's \"active supervision strategy\" represented a \"systemic failure\" by the centre and childcare regulator Quality Education and Care Northern Territory (QECNT).\n\nThe Humpty Doo Community & Child Care Centre is about 37 kilometres south-east of Darwin. (ABC News: Hamish Harty)\n\nShe said the centre's response to an earlier incident in which a child wandered through an open gate into the centre's car park had failed to address shortcomings in the strategy.\n\n\"There was clearly a lapse of supervision, during which time this escape occurred, and the outcome could have been far more serious if the child had not been located and promptly returned to the centre,\" she said.\n\n\" The fact that Ebony was not positively accounted for over a 10 minute period demonstrates that in spite of those efforts, there was another occasion of inadequate supervision, this time with tragic results. \"\n\nJudge Armitage found that while it would be \"impossible to eliminate all supervision lapses\" QECNT had also failed to appreciate or adequately manage the risk posed by the fence.\n\nThe gate to the chicken coop was secured behind a taller flat-topped gate after Ebony's death and has since been removed. (Supplied: NT Courts)\n\n\"Immediately after the incident involving Ebony, a new blue gate was fitted minimising the possibility of children accessing the blind spot or the chicken coop gate,\" she said.\n\n\"And later, the island shed and chicken coop gate were removed, thereby eliminating both environmental hazards.\n\n\" Tragically, this simple fix was too late for Ebony. \"\n\nJudge Armitage acknowledged that childcare centres were regulated nationally but urged the NT government to advocate for upgraded fencing requirements and conduct a public awareness campaign about the dangers of loop-top fencing.\n\nShe also recommended the government conduct \"a supervision audit across all childcare centres in the NT\" and impose penalties on any that failed to rectify identified issues in a timely manner.\n\nEbony's family say childcare centres found in breach of their supervision obligations should be forced to rectify the issues. (Supplied)\n\nEbony's family called on the government to ban loop-top fencing under the banner of \"Ebony's Law\" and introduce a \"three strikes rule\" that would see centres in breach of their supervision obligations \"immediately temporarily closed pending assessment and rectification\".\n\n\"While my recommendations are not as comprehensive as those submitted by the family, each of the family’s recommendations is worthy of close consideration by the NT government and I have repeated all of them in full so that can occur,\" Judge Armitage said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/farm-boy-restores-vintage-toyota-landcruiser/105927368",
        "title": "Harry was bored on the farm. So he restored a vintage LandCruiser",
        "publish_date": "Sun, 26 Oct 2025 01:07:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Harry Strange is bored on his family farm, he goes to the tip to find motors he can fix.\n\nThe 11-year-old lives with his parents and two brothers at Bruce Rock, 240 kilometres east of Perth in the heart of Western Australia's Wheatbelt.\n\nHarry has made a habit of bringing old motors back from the farm tip and fixing them up.\n\nBut one afternoon earlier this year, he found something special.\n\nHarry Strange, with the help of his dad, restored the collectable ute at his property in WA's Wheatbelt. (Supplied: Dee-Anne Strange)\n\n\"I went down the tip hunting for a little engine to restore and while I was hunting around I found a 1970s FJ45 Toyota LandCruiser and I thought, 'I gotta have that,'\" he said.\n\nA restoration years in the making\n\nHowever, the car was owned by family friend Colin Turner, so he needed to be tracked down first.\n\nMr Turner said he had been given the car 15 years earlier.\n\n\"I planned to sort of restore it, and anyway, that never happened.\"\n\nWhen Harry asked if he could take it to have a go at fixing it, Mr Turner had no qualms in saying yes.\n\nHarry and Leigh Strange working on the ute. (Supplied: Dee-Anne Strange)\n\nGetting the engine running so they could get the car back to the Stranges' shed was easier than Mr Turner had expected.\n\n\"I said to Leigh [Harry's father], 'I think the motor's buggered, you know, probably will never get any life out of it.'\n\n\"But lo and behold, when we got a little bit of petrol down it and cranked it over,\" he said\n\nHarry then gave himself a deadline to get the car ready for the Bruce Rock show.\n\nThree months of hard yakka\n\nHarry estimated he spent four hours a day refurbishing the ute over three months, working every day after school until dinner.\n\nHis fascination with engines began when his father, Leigh Strange, brought home a couple of knockabout buggies for the farm.\n\n\"It first started when we got some buggies and they weren't right, they weren't running good, and Dad took us down the shed and had a crack at it, and we got them going,\" he said.\n\nHarry Strange spent hours after school each afternoon restoring the ute. (Supplied: Dee-Anne Strange)\n\nMost of the work done on the Toyota was completed by Harry under the watchful eye of his dad, who said Harry watched videos online to learn many of the skills he needed.\n\n\"He has got a real mind for motors,\" Mr Strange said.\n\n\"He's learned a lot off YouTube over the years, a lot of different channels there, mechanical channels,\" he said.\n\n\"He was doing up stationary motors and a couple of old chainsaws I thought weren't going to run again, he got them running.\n\n\"He's picked up a lot there, and then I sort of just helped him with the finishing.\"\n\nA desirable prospect\n\nToyotas are one of the most popular vehicles in regional Australia, with farmers having a love affair dating back decades.\n\nVintage car valuer Aaron Lofts viewed the photos of the FJ45 and was impressed.\n\n\"Some kids are just out there playing Clash Royale or scrolling TikTok, and [Harry] is out there restoring cars … it's really impressive,\" he said.\n\nMr Lofts said the FJ LandCruisers were really desirable with four-wheel-drive enthusiasts.\n\nThe ute was restored and taken to the Bruce Rock show. (Supplied: Dee-Anne Strange)\n\n\"What you might have there now is something that's probably at the bottom, where it's sort of $15,000, and it genuinely could be upwards from there,\" he said.\n\nIt does not matter how much it is worth, Harry says: \"I'm never selling it.\"\n\nThe people's choice\n\nHarry's Toyota FJ45 won the people's choice award at the Bruce Rock show.\n\nHe said his classmates were \"pretty amazed\" by his efforts.\n\nEven though he is not old enough to drive it on the road yet, Harry's first car is already turning heads.\n\nDrag racing champion Rosco McGlashan, Harry Strange and the ute's former owner, Colin Turner, at the Bruce Rock show. (Supplied: Dee-Anne Strange)\n\nAnd the vehicle's previous owner, Mr Turner, was impressed too.\n\n\"I was blown away,\" he said.\n\n\" When I came in I said, 'My God, look at that!' I was really gobsmacked when I saw it. \"\n\nHarry's parents said they were proud of him for sticking with the project.\n\n\"The amount of work that he has put in, probably more the fact that he's stuck with it, he hasn't got bored with it.\n\n\"You've been pretty determined to finish it, see it through.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/lani-pallister-kaylee-mckeown-swimming-world-records/105935460",
        "title": "Aussies continue to break world records at historic meet in Toronto",
        "publish_date": "Sun, 26 Oct 2025 00:54:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "Lani Pallister and Kaylee McKeown have continued Australia's record breaking run at the short course swimming World Cup in Toronto.\n\nPallister followed up her Australian record in the 400m freestyle on day one by posting a world record in the 800m on Saturday, local time.\n\nHer time of 7:54.00 also took more than three seconds off the previous record set in 2022 by American great Katie Ledecky.\n\nO'Callaghan breaks world record for second time in one week Mollie O'Callaghan caps a brilliant week at the swimming World Cup in Toronto, setting a new short-course world record in the 200-metre women's freestyle.\n\nMcKeown broke her own world record in the 200m backstroke just a week after setting the previous mark in the World Cup event in Westmont.\n\nPallister dominated the 800m, winning by more than 15 seconds ahead of New Zealanders Erika Fairwather and Caitlin Deans.\n\nThe Australian went out hard, posting a halfway split that would have placed her second in the 400m, only behind her own winning time and two seconds under world record pace.\n\nShe then stretched the advantage further in the third 200m before closing out in style.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong will tackle Australia's overdue reckoning with racism in sport, with the help of some of its biggest sports stars.\n\nIn her record-breaking swim, McKeown touched in 1:57.33, faster than her 1:57.87 from a week ago to edge out Regan Smith from the US who also swam just under McKeown's previous mark with 1:57.86.\n\nFellow American Phoebe Bacon closed out the podium but was more than three seconds behind the Aussie star.\n\nMcKeown's win puts her second in the overall World Cup standings and on top for the Toronto meet.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/boy-holds-toy-train-exhibition-to-raise-funds-for-sick-children/105899456",
        "title": "10yo boy holds toy train exhibition to raise funds for sick children",
        "publish_date": "Sun, 26 Oct 2025 00:31:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "On a regular Friday afternoon, the local country pub is usually where you would find workers winding down after a busy week, with a cold beer or two and a counter meal.\n\nBut one recent Friday afternoon, in a small western Victorian town, things looked a little different.\n\nTo raise money for the Royal Children's Hospital (RCH) in Melbourne 10-year-old Brock Mewett set about taking over his local pub, The National Hotel in Natimuk, with the best of his 235 toy train collection.\n\nBrock Mewett's love for Thomas the Tank Engine was bolstered after seeing his idol at live events. (Supplied: Sally Mewett)\n\nBrock fell in love with trains when he was given a Thomas the Tank Engine set for his first birthday.\n\nAfter visiting train shows locally and interstate he thought people might like to see his collection and the local pub seemed like the best option.\n\n\"Well, I watched train shows over the years in Adelaide and Stawell and I just would like to do my own,\" he said.\n\n\"I had the stuff pretty much and I asked the pub, and they let me.\"\n\nThe National Hotel is one of the few places to gather in Natimuk. (ABC News: Grace Marshall)\n\nA little train with a lot of impact\n\nNatimuk has a population of 548 and is famous for its world-class climbing at Dyurrite/Mt Arapiles.\n\nPublican Bill Lovell described a normal Friday at The National Hotel as a \"bit of madness\" but said the locals loved Brock's exhibition.\n\n\"They thought it was great and everyone that come in really enjoyed it,\" he said.\n\nBrock Mewett with Bill Lovell (left) and Matt Lovell (right) showing off donations. The event went on to raise $810. (Supplied: Bill Lovell)\n\nMr Lovell said when Brock approached him he jumped at the idea to support the exhibition as he wanted to support kids' ideas.\n\n\"When they come up with some ideas and you think, well, you've got to encourage it because otherwise they just go, 'Oh well, we won't even try anything later on,'\" he said.\n\nChildren and adults alike loved the exhibition at the pub. (Supplied: Sally Mewett)\n\nMore than 60 children, along with their parents, came and showed their support for Brock, joining in with regulars whose curiosity got the better of them.\n\n\"There were a couple of locals that normally go to the bar, come around, and regular Brad came in and he said, 'Oh wow, this is amazing,'\" said Brock's mum Sally Mewett.\n\n\"And he went back out and he sent more people.\"\n\nBrock's collection is made up of many different makes and models of trains, with Edward from Thomas the Tank Engine his favourite due to his kind and caring nature.\n\nLess than half of Brock Mewett's train collection was on display on the day. (Supplied: Sally Mewett)\n\nDigging deep\n\nCharging a gold coin donation as entry to the exhibition, everyone dug deep, raising $810 for the hospital.\n\n\"Some of it was to build enthusiasm and pretty much so we can raise some money and also so it will probably help out the Royal Children's Hospital themselves,\" Brock said.\n\nRoyal Children's Hospital Foundation (RCHF) chief executive Ryan Brown said \"every donation, large or small, played a crucial role in helping the RCH Foundation fund\".\n\n\"When we first learned about Brock's exhibition and his incredibly generous donation to The Royal Children's Hospital Foundation, we were delighted,\" Mr Brown said.\n\n\"Brock’s contribution will help ensure sick kids can receive the best possible health care, and we are immensely proud to have his support.\"\n\nBrock Mewett hopes to make his exhibition an annual event. (ABC News: Grace Marshall)\n\nMs Mewett said when people found out what Brock was raising money for they \"just put money in because they were so proud of him and chuffed that he was doing that\".\n\nBlown away by how the town came out in support of her son, Ms Mewett said \"seeing everyone's generosity for his initiative was simply overwhelming\".\n\n\"Words can't express how grateful I am for everyone's support and well wishes,\" she said.\n\nMr Lovell expected the event to generate a couple of hundred dollars, given the size of the town, and was impressed by how much Brock raised.\n\nAnd Brock is not done yet. He wants to make the exhibition an annual event.\n\nAnd with less than half his trains at the recent display, Brock is on track for many more exhibitions ahead.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/tiny-home-dream-shattered-for-woman-with-epilepsy-by-council/105922162",
        "title": "Tiny home dream shattered for woman with epilepsy amid legal 'confusion'",
        "publish_date": "Sun, 26 Oct 2025 00:04:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "A tiny home which began as a dream for Kathryn Payne, after she was diagnosed with epilepsy, has become little more than a $130,000 storage unit in her dad's front yard.\n\nThe 30-year-old West Australian and her father purchased the tiny home in 2023 to help kickstart her independence, while also having her close to home so she could be supported medically.\n\n\"It's felt absolutely horrendous to be having to deal with this, especially because I brought my dad into it,\" Ms Payne said.\n\nMs Payne had hoped to progress her professional life but has been bogged down by her tiny home nightmare. (ABC News: Cason Ho)\n\nUnder WA law, people can camp in tiny homes on wheels on private property for up to two years with local council approval.\n\nBut the tiny home is in limbo after a neighbour complained to the council — the City of Wanneroo — which is now demanding the structure be removed from the property.\n\n\"I feel like my life has just been pulled right out from underneath me,\" Ms Payne said.\n\nGerald Payne says the City of Wanneroo has provided little clarity about why the tiny home is not allowed. (ABC News: Cason Ho)\n\nThe City of Wanneroo is threatening to fine her father Gerald Payne $50,000 if the tiny home remains in his front yard.\n\n\"I can't take a hit like that, and I don't know what to do,\" Mr Payne said.\n\n\" It's been unbelievably stressful. \"\n\nMr Payne, 67, took money from his superannuation to pay for his daughter's tiny home, and to pay off most of his own mortgage.\n\nHe said they have tried to sell the tiny home following the local council's disapproval, but sales have always fallen through after the situation was explained to prospective buyers.\n\nMs Payne's tiny home on wheels has a shower and loft sleeping area. (ABC News: Cason Ho)\n\n\"We're honest people, we don't want to saddle someone else with this. We want them to know what they're getting themselves into,\" he said.\n\n\"They're facing the same uncertainty with councils. This is the big thing … there's no clarity, there's no certainty.\"\n\nIn a statement, the City of Wanneroo said it had provided \"clear advice\" on the requirements needed to ensure the structure meets safety and amenity standards.\n\n\"The City applies these laws consistently and fairly to maintain community safety and protect the rights of all residents,\" it said.\n\n'Complication and confusion'\n\nThe Payne family's experience is just one example of the broader issue sweeping through Australia.\n\nSmaller tiny homes can be classified as caravans if they meet road regulations. (Supplied: Aussie Tiny Houses)\n\nGriffith University urban management and planning emeritus professor Paul Burton said many councils were grappling with the definition and regulation of tiny homes.\n\n\"Across the country as a whole, it's a picture of great variation, complication and confusion,\" he said.\n\n\" Tiny homes won't solve the housing crisis, but they'll make a valuable contribution, so we shouldn't ignore them. \"\n\nThe Shire of Esperance in WA was the first council to implement a tiny home policy in 2023, recognising tiny houses as permanent dwellings, and other councils have since started creating their own policies.\n\nBut in many councils, people living in tiny homes are being served eviction notices and building orders.\n\nCouple fights tiny house eviction Josh Heins and Manu Bohn say their tiny home on wheels does not need approval, but the local council does not agree.\n\n\"My feeling is that at present, there isn't enough political momentum to drive this forward,\" Professor Burton said.\n\n\"I think the most we can hope for is that those councils, what they're doing becomes well known, and people go, 'if Esperance can do that and the sky hasn't fallen in and it's made a contribution, then why can't we do it?'\"\n\nUncertainty around state laws\n\nIn WA, a law change in 2024 allowed local councils to approve camping on private property, in caravans or tiny homes on wheels, for up to two years.\n\nTiny home advocates celebrated the change at the time, but Ms Payne's case throws into question how much the law reform has achieved.\n\nMs Payne hopes she can still pursue her dream of tiny living. (ABC News: Cason Ho)\n\n\"We've just been going in circles ... I wish my dad could retire. I wish I was the one supporting him at this stage, and I was hoping that's where we would be,\" Ms Payne said.\n\n\"I'm very lucky to be where I am right now and have had him continue to support me in this dream.\"\n\nIn correspondence seen by the ABC, the City of Wanneroo said it defined the structure as an \"ancillary dwelling\" and not a \"tiny home on wheels\".\n\nMr Payne says he has thrown everything at trying to keep his daughter's tiny home. (ABC News: Cason Ho)\n\nThe city said it had approved the tiny home to be relocated to the backyard as a permanent structure.\n\nBut this would require significant investment to meet building standards, as the tiny home was designed to meet road regulations as a caravan and has a vehicle identification number.\n\n\"We've spent money on surveyors and engineers and it's not progressed anywhere ... I drew back on my mortgage to help with that,\" Mr Payne said.\n\n\"I'm now in a situation where really, if I retire, it's probably not affordable.\"\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/mount-gambier-uniting-church-to-be-sold-steeple-repair-cost/105914782",
        "title": "Heritage-listed church to be sold to avoid steeple repair cost",
        "publish_date": "Sun, 26 Oct 2025 00:02:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Uniting Church will abandon its state heritage-listed church in the middle of Mount Gambier because of escalating costs to fix the 154-year-old building's steeple.\n\nThe church's pastor says the controversial move will allow him and the congregation to focus on Christian ministry rather than the building that services are held in.\n\nAn architecture lecturer says the sale of churches is a growing trend but it can allow heritage buildings to stay standing rather than falling into disrepair.\n\nPastor Dave Sigley outside St Andrew's Uniting Church. (ABC South East SA: Eugene Boisvert)\n\nThe Mount Gambier congregation voted on October 12 to move out of St Andrew's church on Elizabeth Street and to sell the building and the 9,500 square metres of land that surrounds it.\n\nThe vote came ahead of a deadline of October 30 set by the Uniting Church's statewide body, known as a synod, to make a decision on its future.\n\nThe steeple of Mount Gambier's St Andrew's Uniting Church has been fenced off for eight years. (ABC South East SA: Eugene Boisvert)\n\nHuge cost to avoid catastrophe\n\nA report produced by the synod in September said the rickety state of the spire meant there was an \"extreme risk of a catastrophic outcome\" through it collapsing.\n\nThe church was quoted $1.26 million to fix it.\n\nSt Andrew's Presbyterian Church, as it was formerly known, was built in 1871 with a spire built to be slightly taller than the nearby Catholic church.\n\nSt Andrew's Presbyterian Church in a photo from 1875. (Supplied: State Library of South Australia)\n\nThe spire was rebuilt in 1885, damaged in an earthquake in 1897, partially rebuilt in 1928 and repaired again in 1980.\n\nReverend Dave Sigley said the congregation did have enough money to pay for the repairs but then it would not have any funds to pay him, nor could it cover other maintenance on the building or his charitable works.\n\n\"The congregation chose to focus on the mission of the church and outreach rather than focusing on the building,\" he said.\n\n\"We believe that was important because, if we did fix it, we could have stayed in the building, but the congregation wouldn't have the resources or the funds to have a minister, for starters, and to continue with our outreach.\n\n\"For us, even though it's been a very difficult decision, and we lament that, and there's a lot of people who are feeling pain in this — myself included — we realise that the mission of the church and living out the mission of Christ is more important than maintaining a historical building.\"\n\nDave Sigley has led worship at St Andrew's for eight years but was only ordained as a minister in June. (ABC South East SA: Bec Whetham)\n\nThe congregation plans to hold its last service in the old church in January before moving to a new, hired space.\n\nSynod moderator Peter Morel said it was sad to leave the Gothic Revival church but there were many people looking for churches in non-traditional buildings with spaces such as creches separate to the main body of the church.\n\n\"The times have changed greatly and we need to be flexible [and] adaptable, as we're looking forward to newer ways of engaging people in our local communities,\" he said.\n\nEmergency food relief is provided at the Uniting Church. (ABC South East SA: Eugene Boisvert)\n\nSale could save building\n\nUniversity of Melbourne architectural design and history lecturer Stuart King said there was an ongoing trend of churches having to sell their buildings, including because of costs associated with the child abuse redress scheme.\n\nSon of TV royalty Ernie Sigley's journey from pig farming to preaching Born to TV royalty, the son of Ernie Sigley couldn't wait to escape to the country, a passion he shared with his famous father.\n\nDr King said keeping heritage buildings standing often meant finding new uses for them.\n\n\"Really, the best way to maintain them and to maintain a whole lot of values associated with them is to ensure that they have an ongoing use,\" he said.\n\n\"There is this challenge there about how you do that and whether the church community is able to sustain an ongoing use or whether or not you look at adapting them to different uses.\"\n\nA 2007 report by specialist heritage conservation architect Elizabeth Vines said St Andrew's church was \"indicative of the spread of Presbyterianism through the state\".\n\n\"The quality of architectural design and building construction is indicative of the degree of affluence of the Presbyterian congregation in the South East during the Edwardian period,\" she wrote.\n\nSt Andrew's has a prominent place in Mount Gambier's skyline. (ABC South East SA: Eugene Boisvert)\n\nAnger among congregation\n\nThe Uniting Church also has congregations in Mount Gambier's east and at Port MacDonnell.\n\nThey have decided not to merge, even if the Mount Gambier congregation decides to hold its Sunday services in the same building as the Mount Gambier East group.\n\nMegan McKenzie used to be the congregation chair at St Andrew's but now worships at the Port MacDonnell Uniting Church, even though she lives in Mount Gambier.\n\nShe said the decision to sell the church was \"appalling\".\n\nThe church was quoted $1.26 million to fix the steeple. (ABC South East SA: Eugene Boisvert)\n\n\"That church was built by our forebears at great physical and financial cost,\" she said.\n\n\"We owe it to them to honour the fact that they built a church for the people of Mount Gambier to care for, to be cared for, by the minister of the times.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/nationals-net-zero-report-canavan/105935222",
        "title": "Nationals' net zero review has not undertaken economic modelling",
        "publish_date": "Sat, 25 Oct 2025 23:50:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Details of a report expected to recommend the Nationals dump its support for net zero emissions by 2050 will be presented to the party on Monday, but the review has not undertaken economic modelling of the costs of doing so.\n\nNationals deputy leader and outspoken net zero opponent Matt Canavan led the review with his Senate colleague Ross Cadell and told Insiders on Sunday he would be presenting findings to his colleagues when parliament resumes.\n\nBut he flagged that discussions over the party's position were likely to be ongoing and it could take time for the matter to be settled, while declaring that it was clear Australians were not \"getting a good deal from net zero\" .\n\n\"I'll present work as I have been doing the last few weeks, but you probably have bosses or had bosses over your career, sometimes when you present something, they tell you: that's not good enough, go back and do some more work,\" he said.\n\n\"So that may very well happen tomorrow, as well.\"\n\nSenator Canavan also confirmed the review had not yet undertaken economic modelling to estimate the cost of dumping the net zero target, pointing instead to the cost of pursuing the target and the \"benefit of avoiding those costs\".\n\n\"It's very clear that the cost of not doing something is avoiding the cost of doing it. That's pretty common-sense,\" he said in a firey exchange.\n\n\"The lived reality of net zero is clear. It is not working for the Australian people.\n\n\"Sure, there's a role for modelling, but the old saying is also true that if you ask an economist how to open a can of tuna, they'll say: 'Let's assume that we have a can opener.'\"\n\nClimate policy has long been a point of contention within the Coalition and led to a brief split between the Nationals and Liberals after the federal election in May.\n\nIf the minor party does decide to dump the net zero commitment, it could potentially once again drive a wedge through the partnership.\n\nJoyce 'should come along' to Nationals party room\n\nThe Nationals senator also threw his support behind fellow net zero critic Barnaby Joyce, who last week announced he would not recontest his seat of New England at the next election after days of speculation that he was in talks to join Pauline Hanson's One Nation.\n\nWhile Mr Joyce technically remains a member of the Nationals, he last week said his relationship with the party's leader had irreparably broken down, raising questions about whether he would join the party room meeting when parliament resumes on Monday.\n\nSenator Canavan said he hoped Mr Joyce would come along.\n\n\"It's unfortunate when people don't feel that they're part of the team and loved,\" he said.\n\n\"And I know lots of people have reached out to him in the last few weeks and as I say, I'd love to keep him part of the team.\"\n\nUsing a sporting analogy, he said even if Mr Joyce was, as he has called himself, a \"free agent\", it made sense to keep him on the field.\n\n\"Support for net zero is dropping off a cliff,\" he said.\n\n\"And I think that Barnaby played a role in that.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/exoskeleton-trials-in-australian-workplaces/105924332",
        "title": "Exoskeletons trialled to reduce physical strain of repetitive labour",
        "publish_date": "Sat, 25 Oct 2025 23:31:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "Millions of Australians put their bodies on the line every day to keep some of the nation's essential industries moving — and the physical toll is mounting.\n\nJoint, ligament and muscle injuries lead the way in serious workers' compensation claims, and the numbers are climbing, according to a new Safe Work Australia report.\n\nThe annual snapshot reveals such claims rose to 53,000 in 2022-23, up from 49,300 the previous year. Musculoskeletal claims are also on the rise.\n\nIn the chilled rooms of Australia's meat-processing plants, Chris Fitzgerald is one professional investigating how technology could turn the trend around.\n\nThe ergonomist watches as workers strap on the Iron Hand — a high-tech glove linked via cables to a powered backpack.\n\nWorkers are being fitted with a glove that improves grip strength. (Supplied: Bioservo)\n\n\"This is truly a revolutionary device,\" he said.\n\nThe device, known as an exoskeleton, uses fingertip sensors to boost grip strength.\n\nIt assists when performing tasks that require high grip including consistent knife use for skinning, trimming, and vertical and table boning.\n\n\"[In] sheep processing, they'll process one every 6 seconds or so. With beef, it's probably closer to once a minute,\" he said.\n\n\"It's repetitive. There's not a lot of relief from that.\"\n\nExoskeletons such as the Iron Hand assist with a meatworker's grip. (Supplied: Chris Fitzgerald)\n\nIt is part of an Australian Meat Processor Corporation (AMPC) project exploring how technology could help reduce injuries in one of the country's most physically demanding sectors.\n\nStarting with 20 devices designed to support the hands, back and legs, Mr Fitzgerald has narrowed the list to six models — with promising feedback.\n\n\"I've had people with lacerated tendons say, 'My hand feels normal [after wearing it],'\" he said.\n\nThe AMPC is sharing the data with abattoirs to help guide future decisions.\n\nBut with some exoskeleton gloves costing more than $15,000 each, companies will need to weigh the benefits, from worker comfort to productivity gains through reduced strain and injury.\n\nFlat out with flat pack\n\nRetail giant Ikea has already gone global with exoskeletons, rolling out more than 400 units across 14 countries last year to reduce warehouse injuries and fatigue.\n\nThe company says the technology helps minimise the physical toll of heavy lifting and repetitive motion, allowing workers to finish shifts with \"more energy\".\n\nGold Coast physiotherapist Brad Beer sees both promise and pitfalls in the rise of robotic assistance.\n\nBrad Beer says exoskeletons offer promise in allowing workers to be more efficient and less prone to injury. (Supplied: Pogo Physio)\n\n\"It's very early days,\" he said.\n\n\"They offer potentially great promise in allowing workers to be more efficient, potentially less injury-prone, [and] potentially have a greater lifespan at work, but there can be downsides potentially as well.\n\n\"It's important to note that force is absolute. It doesn't disappear. The body just shifts it to other areas.\"\n\nBut while Mr Beer said careful integration was essential to avoid creating new types of strain injuries, he remained optimistic.\n\n\"It might be a little bit like AI. I wouldn't be surprised if we see [it] infiltrate into every industry,\" he said.\n\n\"In many ways, it's an exciting time to be alive. We've never seen such rapid technological change.\n\n\"There'll be a move with AI-driven exoskeletons that absolutely are autonomous with the human body.\"\n\nThe AI-enhanced worker\n\nThat future may already be taking shape, at least in Europe.\n\nIn May, robotics firm German Bionic unveiled Exia, which it called \"the world's first exoskeleton powered end-to-end by true augmented AI\".\n\nGerman Bionic says its exoskeleton can anticipate user needs and optimise support in real time. (Supplied: German Bionic)\n\nBuilt on billions of motion data points from logistics, health care and manufacturing, the device can reportedly offer up to 38 kilograms of lift assistance while continuously learning from its user.\n\n\"Exia doesn't merely respond or even just think — it actually learns,\" CEO Armin G. Schmidt said.\n\nBack in Australia, Mr Beer said there was no need to fear a robotic takeover.\n\n\"There's a fair degree of apprehension and fear that these things will take over,\" he said.\n\n\"They won't take people's jobs, but they'll augment them and help them.\"\n\nHe has seen firsthand the toll a manual job can have on a person.\n\n\"My father had his working career in the meat industry,\" Mr Beer said.\n\n\"Certainly, meat processing is probably one of the more demanding professions anyone could have.\n\n\"Long hours standing on their feet, performing all those repetitive movements, reaching, twisting, and carrying heavy carcasses. It's not for the faint-hearted.\n\n\"Having seen that firsthand, the exoskeleton integration has potentially great promise in an industry like that.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/driving-simulator-assists-people-with-disabilities/105758844",
        "title": "Kaitie was always told they would never drive. This new tech changed that",
        "publish_date": "Sat, 25 Oct 2025 23:20:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Kaitie Francis was always told they would never be able to drive a car, but their dream of hitting the road is now much closer to becoming a reality.\n\nThe 20-year-old is just one of 20 people who have been gaining confidence behind the wheel thanks to a driving simulator which has been made available by a regional disability support service provider.\n\nCommunity groups, including the Renmark Lions Club, donated money to assist with the creation of the simulator. (ABC Riverland: Amelia Walters)\n\nKaitie was born with mucopolysaccharidosis type 1 hurler syndrome (MPS type 1) and was deemed legally blind from a young age.\n\n\"My whole body is affected by the condition, and I am short-statured [too], so I always knew driving a car would be hard because I am so short,\" they said.\n\n\" I never had the same experience as other country kids, who could just drive around, because I was always told I would never be able to drive. \"\n\nBut following a cornea transplant in 2022, Kaitie sat and passed the written exam to get their licence.\n\nKaitie Francis says they felt very apprehensive about getting behind the wheel. (ABC Riverland: Amelia Walters)\n\nThey said while it was a positive first step, the thought of physically getting behind the wheel caused a lot of anxiety.\n\n\"I had never sat in the [drivers seat] of a car before, and it wasn't a great outcome at first. It actually put me off driving for a while,\" Kaitie said.\n\n20 clients 'now have their Ls'\n\nDylan Blackley is the director of Support & Connect, which is a disability support service located in South Australia's Riverland region.\n\nHe said Kaitie's lack of confidence to drive wasn't uncommon.\n\nDylan Blackley says people living in regional areas should have the same opportunities as their metro counterparts. (ABC Riverland: Amelia Walters)\n\n\"A lot of my clients told me driving was a daunting experience … and so I just really wanted to close that gap for them,\" he said.\n\n\"Living in a regional area we are always starved of those resources at the best of times. If [regional] clients don't have access to these services, that doesn't seem fair to me.\"\n\nHis search to help led him to the existing simulator technology, MyDriveSchool.\n\nBut he decided to take the course to the next level.\n\n\"I'm not one to do something half-hearted … so I decided to go out and get a car to make it an immersive experience,\" he said.\n\nThe car's steering wheel and brakes are connected to the computer program, which is displayed on a TV screen. (ABC Riverland: Amelia Walters)\n\n\"I found a Ford Falcon ute that could come straight off the chassis, which made it easy to transform into a purpose-built simulator.\n\n\" I have around 20 clients now who have gone on to get their Ls and they have said to me first-hand how much confidence they have gained from this. \"\n\nAccessibility in the regions\n\nKaitie was one of the first participants to take the wheel and said having the simulator in a nearby town made learning to drive much easier.\n\n\"When I heard the simulator was in Berri, I thought, 'Yes! I don't have to take a whole day out of my week to go to Adelaide to access something like this for maybe an hour,'\" they said.\n\nSenior support worker Brodie Thompson says Kaitie Francis's confidence has grown since completing the course. (ABC Riverland: Amelia Walters)\n\n\"The course has taken me from not knowing anything to knowing what to do in emergency scenarios, that could actually happen in real life.\n\n\" It has made me really confident and I don't think I'd be where I am now if I didn't use it. \"\n\nSimulator's impact proven\n\nThe chief executive of MyDriveSchool, Lisa Skaife, had the idea of developing simulation technology in Australia following her concerns about the rate of road trauma among Australian teenagers.\n\nShe said the results for students who participated in the program showed its impact.\n\nLisa Skaife says the technology opens the door for people with disabilities to potential employment opportunities. (ABC News)\n\n\"We had independent driving instructors rate competency among students, not knowing who had done the course prior,\" she said.\n\n\" The children who did [the course] first, came out 48 per cent more competent and 17 per cent less anxious. \"\n\nLisa Skaife's technology was cited in the final report of the Parliamentary Inquiry into Road Safety in 2022. (ABC Adelaide: Sarah Maunder)\n\nShe said the cost and loss of young people's lives was too great and the technology should be made accessible to all teenagers, no matter their ability.\n\n\"Last year 243 people, aged 17 to 25, died on the roads, and 39 drowned. Yet, we have six years of swimming lessons in schools but no driver training in high schools.\n\n\"Road trauma costs approximately $30 billion a year, that's $82 million a day.\n\n\"We can roll out simulation training in every government school across the country for less than the cost of 0.001 per cent of road trauma.\"\n\nTime to hit the road\n\nBack in South Australia's Riverland, Kaitie is now gearing up to get their P-plates, an achievement they once didn't think was possible.\n\nKaitie Francis says they finally feel the freedom that others in the community have. (ABC Riverland: Amelia Walters)\n\n\"The three years it's taken me to get to where I am is mind-blowing with how much I have achieved,\" they said.\n\n\"Knowing in three months I'll be driving alone kind of scares me, but it feels good knowing I'll be able to do things without relying on others.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/lassie-and-lost-in-space-star-june-lockhart-dies-aged-100/105935288",
        "title": "June Lockhart, beloved mother figure from Lassie and Lost In Space, dies aged 100",
        "publish_date": "Sat, 25 Oct 2025 22:54:59 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "June Lockhart, best known as the mother figure from Lassie and Lost in Space, has died aged 100.\n\nLockhart died on Thursday of natural causes at her home in Santa Monica, family spokesperson Lyle Gregory said on Saturday, local time.\n\n\"She was very happy up until the very end, reading the New York Times and LA Times every day,\" he said.\n\n\"It was very important to her to stay focused on the news of the day.\"\n\nThe daughter of prolific character actor Gene Lockhart, Lockhart was cast frequently in ingenue roles as a young film actor. Television made her a star.\n\nFrom 1958 to 1964 she portrayed Ruth Martin, who raised the orphaned Timmy (Jon Provost), in the popular CBS series Lassie.\n\nFrom 1965 to 1968 she travelled aboard the spaceship Jupiter II as mother to the Robinson family in the campy CBS adventure Lost in Space.\n\nThe crew from the original cast of the television series Lost in Space in 1995. (AP: Steven Senne)\n\nHer portrayals of warm, compassionate mothers endeared her to young viewers.\n\nDecades later, baby boomers flocked to nostalgia conventions to meet Lockhart and buy her autographed photos.\n\nActor preferred driving tanks and flying in balloons\n\nOffscreen, Lockhart insisted, she was nothing like the women she portrayed.\n\n\"I must quote Dan Rather,\" she said in a 1994 interview.\n\n\"I can control my reputation, but not my image, because my image is how you see me.\n\n\"I love rock'n'roll and going to the concerts. I have driven army tanks and flown in hot air balloons. And I go plane-gliding — the ones with no motors.\"\n\nEarly in her career Lockhart appeared in numerous films including All This, and Heaven Too, Adam Had Four Sons, Sergeant York, Miss Annie Rooney, Forever and a Day and Meet Me in St Louis.\n\nShe also made Son of Lassie, the 1945 sequel to Lassie, Come Home, playing the grown-up version of the role created by Elizabeth Taylor.\n\nJune Lockhart at the 60th Anniversary screening of Meet Me in St Louis in 2004. (AP: Nam Y Huh)\n\nFrom Lassie to Lost in Space\n\nWhen her movie career as an adult faltered, Lockhart shifted to television, appearing in live drama from New York and game and talk shows.\n\nShe was the third actor to play the female lead in Lassie on TV following Jan Clayton and Cloris Leachman.\n\n\"I worked with four Lassies,\" she said.\n\n\"There was only one main Lassie at a time. Then there was a dog that did the running, a dog that did the fighting, and a dog that was a stand-in, because only humans can work 14 hours a day without needing a nap.\"\n\nAfter six years in the rural setting of Lassie, Lockhart moved to outer space by embarking on the role of Maureen Robinson, the wise, reassuring mother of a family that departs on a five-year flight to a faraway planet in Lost in Space.\n\nAngela Cartwright, who played her daughter on Lost in Space, paid tribute to Lockhart in a post on Facebook.\n\n\"So smart, quick, and funny — she filled her 100 years with curiosity, laughter, and rock'n'roll,\" she said.\n\n\"I can only imagine she's feeling right at home as she steps off this planet and into the stars.\"\n\nJune Lockhart addresses bloggers at a NASA social media event in 2012. (AP: Damian Dovarganes)\n\nA little bit of everything\n\nLockhart remained active long after Lost in Space, appearing often in episodic television as well as in recurring roles in the daytime soap opera General Hospital and night-time soaps Knots Landing and The Colbys.\n\nHer film credits included The Remake and the animated Bongee Bear and the Kingdom of Rhythm, for which she provided the voice for Mindy the Owl.\n\nShe also used her own media pass to attend presidential news conferences, narrated beauty pageants and holiday parades, and toured in the plays Steel Magnolias, Bedroom Farce and Once More with Feeling.\n\n\"Her true passion was journalism,\" Mr Gregory said.\n\n\"She loved going to the White House briefing rooms.\"\n\nLockhart was married and divorced twice and had two daughters, Anne Kathleen and June Elizabeth.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/community-organisations-fear-abetz-budget-repair-hit/105933656",
        "title": "Abetz's cost-cutting priorities spark concerns for community organisations",
        "publish_date": "Sat, 25 Oct 2025 22:50:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tasmania's peak body for community services has warned the sector has \"real concerns\" about funding cuts, as the state government wrestles to get the budget under control.\n\nNew Treasurer Eric Abetz is set to release his first budget in the opening week of November, but with the document coming well into the financial year, it's been termed an \"interim\" budget.\n\nConsultation has now begun for his first full budget, covering the 2026/27 financial year, which is set to be released in May.\n\nHowever, the guidelines for submissions call for suggestions on investments that could be \"reconsidered\", services that could be \"transitioned out\" and for any new ideas to be offset by other savings:\n\nGuidelines for the pre-budget consultation 2026-27 • \"Which programs/projects could be refocused to deliver core outcomes with more streamlined resources or refined focus?\" • \"Are there initiatives or investments that could be reconsidered helping balance the budget now, without losing sight of long-term goals?\" • \"Are there programs or services that could be transitioned out as the needs of Tasmanians evolve and priorities shift?\" • \"Where could government activities be re-calibrated to operate more effectively, while still meeting essential needs?\" • \"For any new funding ideas (specifying whether operational or capital), what savings or offsets could be identified elsewhere to ensure the overall budget remains balanced?\"\n\nThis contrasts with last year's invitation for submissions, which, among the questions about potential efficiencies, also asked what areas should be a \"high priority\" for the government, or services that could be offered more successfully.\n\nAdrienne Picone says cuts to community organisations mean Tasmanians \"won't be able to access the services they need, where and when they need them\". (ABC News: Loretta Lohberger)\n\nTasmanian Council of Social Service (TasCOSS) chief executive Adrienne Picone said it highlighted the interim and first full budgets would potentially contain \"some significant cuts for organisations and certainly no new money\".\n\n\"This is really concerning for many of our members, particularly in the light of the increase in demand that many organisations are experiencing,\" she said.\n\nA spokesperson for the Tasmanian government said it \"highly values the work of community organisations and invests significantly in their work\".\n\n\"All feedback received through the community consultation process will be considered as part of the normal budget process,\" they said.\n\nOrganisations forced to downsize to survive\n\nHobart City Mission's (HCM) Harvey Lennon said any further cuts to the sector would \"push some not-for-profits to the brink\".\n\n\"We've sadly let a few people go over the last couple of months to help us get by,\" he said.\n\n\" We're also looking at options, such as the sale and lease-back of a couple of our properties, just to give us a bit more breathing room, whilst we navigate the current challenges that the community are facing. \"\n\nAs HCM battles for its own survival, it's also seeing as much need in the community as ever, doubling the number of food bags it has given out in the last two years.\n\n\"That's a huge increase, and just represents how tough people are finding things at the moment — people who are making decisions between funding doctors' bills, feeding themselves and feeding their children,\" Mr Lennon said.\n\nHarvey Lennon warns further cuts to the sector would \"push some not-for-profits to the brink\". (ABC News: Will Murray)\n\nMr Lennon said even if the government couldn't entirely fund organisations, partial funding could allow them to leverage further funding from other benefactors.\n\nMs Picone said many other TasCOSS members were worried they would have to consider cuts to staff or programs if the upcoming budgets cut funding.\n\n\" What this will mean is that waiting lists will grow and that Tasmanians won't be able to access the services they need, where and when they need them. \"\n\nMs Picone said the sector understood the budget was in a \"pretty dire shape\", but urged the government not to cut \"essential\" community services.\n\n\"The way we spend our money comes down to how our government makes choices, and we would really urge our government to make the choice to invest in Tasmanians and Tasmanians' well-being,\" she said.\n\nJeremy Rockliff (centre) reacts as the no-confidence motion passes in parliament in June. (ABC News: Ebony ten Broeke)\n\nTasmania's budget troubles well documented\n\nAugust's Preliminary Outcomes Report showed a net operating balance of $1.2 billion in the 2024-25 financial year, with net debt reaching $5.04 billion.\n\nMeanwhile, Treasury's Pre-election Financial Outlook warned that Tasmania's debt was headed for $13 billion by 2027-28, calling for \"immediate and sustained\" corrective action.\n\nEconomist's dire warning over Tasmania's financial state Tasmania's financial position is on track to \"become worse than that of any other state or territory over the next three years\", with $16 billion in debt by 2035, economist Saul Eslake's independent review of the state's finances finds.\n\nThe no-confidence motion in Jeremy Rockliff's leadership that passed, triggering July's state election, listed Tasmania's worsening finances as one of its key reasons.\n\nFollowing the state election, the returned Liberal government has convened a multi-partisan budget consultation panel which has been meeting to tackle the debt.\n\nTreasurer Abetz has also retained efficiency and productivity measures and a public sector hiring freeze.\n\nLabor has chosen not to engage with the panel.\n\nOpposition treasury spokesperson Dean Winter said the government was \"selling out Tasmanian organisations to pay for their decade of budget mismanagement\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/john-moriarty-football-for-change-aboriginal-soccer-program/105888794",
        "title": "Trailblazing Aboriginal soccer star drives change in remote communities",
        "publish_date": "Sat, 25 Oct 2025 22:23:06 +0000",
        "category": "sports",
        "authors": [],
        "text": "Nearly 1,000kms south of Darwin on the Stuart Highway, a road train rumbles through the remote town of Tennant Creek, muffling the sounds of children at play.\n\nTennant Creek Primary School serves the town's population of around 3,000 and its oval is a flurry of yellow and blue tunics.\n\n\"What a save, what a save!\" head coach Abraham Miranda shouts.\n\nIt's Wednesday — John Moriarty football day — and students are getting out of the classroom and onto the field to learn about soccer.\n\nBut that's not all they're learning about, Miranda explains.\n\n\"We are looking at teamwork, resilience, respect and leadership,\" he says.\n\nAbraham Miranda says the John Moriarty Foundation's football program teaches more than how to play soccer. (ABC News: Marcus Kennedy)\n\n\"Those core values, we want to encourage them, not just on the football field, but in life.\n\n\"So when hardship arrives in life, they remember those core values.\"\n\nSocceroos calling\n\nThe John Moriarty Foundation (JMF) and its football program are named after Yanyuwa man John Moriarty, the first Aboriginal player to be selected to represent Australia in football.\n\nHe was born in Borroloola in 1938 to Yanyuwa mother Kathleen Murrmayibinya and Irish father John Moriarty.\n\nJohn Moriarty was the first Aboriginal player to be selected to represent Australia in football. (Supplied: John Moriarty Foundation)\n\nAt the age of four, Moriarty was taken from his family as part of the Stolen Generations.\n\nThe almost Socceroo — who unluckily suffered a career-ending injury before taking the pitch for his country following a cancelled tour of Hong Kong — says football changed the trajectory of his life, helping him realise his full potential.\n\nAs a sport loved and played by people all over the world, Moriarty says the cultural diversity of the football community gave him a deep sense of belonging and equality.\n\nHe wants Indigenous kids everywhere to experience that too.\n\n\"JMF has the capacity to transform lives by creating ripples of change that start with 'a child, a football, a dream' and flow outwards to impact families, communities and the nation, creating opportunity and unlocking potential,\" he says.\n\nPathways to thrive\n\nNine-year-old Nikolias Hayes is one of about 5,000 children across 18 remote and regional communities participating in the program every year.\n\n\"I learned about passing and kicking goals and sharing the ball,\" he says.\n\n\" I want to go to the big city and play soccer. \"\n\nNikolias Hayes is a student at Tennant Creek Primary School taking part in the John Moriarty Foundation's football program. (ABC News: Marcus Kennedy)\n\nHe could follow in the footsteps of Borroloola's Shadeene Evans, who was part of the pilot program that began with 120 kids in her home town in 2012.\n\nBy 2018, Evans had made the Young Matildas squad and went on to play with the Central Coast Mariners.\n\nShadeene Evans, pictured here with John Moriarty, was a student in the first round of his foundation's football program. (Supplied: John Moriarty Foundation)\n\nBut it's not all about finding the next soccer star, it's about creating positive change in the community.\n\nWarunmungu teenagers Ethan Holt and Waikean Kelly are working as community coaches.\n\nSix years ago, they were part of the first wave of students when the program launched in Tennant Creek.\n\nEthan Holt and Waikean Kelly both started as students in the John Moriarty Football program and are now community coaches. (ABC News: Marcus Kennedy)\n\nKelly started training in 2023, and when he asked the head coach as a joke if he could work there, to his surprise the response was \"yes\".\n\n\"I started a school-based apprenticeship with JMF,\" he says.\n\n\"I go to school two days a week and the rest of the days go to work.\"\n\nFor Holt, it's the kids in community that make it worthwhile.\n\n\"We just go out to the school, give them some food, teach them a lesson or two, it's just fun,\" he says.\n\nEthan Holt says he enjoys working with the kids in the community to teach them soccer. (ABC News: Marcus Kennedy)\n\nBefore football, there's language and learning\n\nUnder a tree on country in Tingkkarli outside Tennant Creek, with kangaroo tail cooking on a nearby campfire, Indi Kindi, JMF's playgroup for kids under five is in session.\n\nHere, in place of coaches there are educators.\n\nToday they include Warumungu sisters and traditional owners Nadia Foster-Graham and Anthea Graham, who speak to the kids in language.\n\nAnthea Graham, Nadia Foster-Graham and Shauna Graham teach kids about culture, hygiene and language during the Indi Kindi program. (ABC News: Marcus Kennedy)\n\nServing up roo tail for lunch, the sisters explain to the children the importance of washing their hands and face before eating.\n\nThey share knowledge and culture as part of the curriculum, with Anthea bringing her expertise as a former ranger.\n\n\"She could be telling you what that animal is, the common name of it, the scientific name of it, and then she also says it in language which I think is pretty amazing,\" team leader and Warumungu and Wambaya woman Keara Baker-Storrey says.\n\nKeara Baker-Storrey says in addition to her team's cultural expertise, the knowledge of a former ranger means the children learn about science as well. (ABC News: Marcus Kennedy)\n\nCommunity-led governance\n\nJMF's football program was initiated in 2012 at the request of senior Aboriginal law women in Borroloola who wanted more educational opportunities for their grandchildren.\n\nIt now delivers soccer sessions out of four hubs — Borroloola, Cairns, Dubbo, and Tennant Creek — which all branch out to surrounding homelands.\n\nThe John Moriarty Foundation's football program has been running since 2012. (ABC News: Marcus Kennedy)\n\nThere are regular yarning sessions with the community, so the agenda remains true to its roots.\n\n\"The community comes together to make the guidelines,\" JMF executive general manager Chris Andrew explains.\n\n\"We are here to be invited in and provide opportunity.\"\n\nClosing the Gap impacts\n\nEarlier this year JMF commissioned a report from auditor Deloitte, which found its football program impacted 10 of the national Closing the Gap targets relating to health, education, wellbeing and employment.\n\nAnd Productivity Commission figures show it costs $3,600 a day to hold one young person in detention, adding up to $1.3 million a year.\n\nThe foundation's football program costs $1,300 per kid each year.\n\n\"You can put 1,000 young people on a football pitch for the same amount of money,\" Andrew says.\n\nThe John Moriarty Foundation says its football program works towards 10 of the national Closing the Gap targets. (ABC News: Marcus Kennedy)\n\nThis year the federal government granted $5.5 million to JMF to continue their delivery of the soccer program.\n\nAnd from what the community coaches say, they have no problem finding willing participants.\n\n\"Every time I go out there — just to see the smile on their face, you know,\" Holt says.\n\n\"They love it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/bright-future-for-jarjums-on-bundjalung-country/105719430",
        "title": "Return to traditional birthing ceremony brings joy on Bundjalung country",
        "publish_date": "Sat, 25 Oct 2025 21:28:30 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "The guests of honour at a smoking ceremony on Bundjalung country in northern New South Wales may not have understood the significance of the event, but it was not lost on their parents and grandparents.\n\nThe event was a first for the Ballina-based Bullinah Aboriginal Health Service, and part of its birthing-on-country Sistabirth initiative.\n\nMother-of-four Relicca Kelly brought along her youngest child, Yarambati.\n\n\"It's really nice … we can get a bit of our culture back,\" she said.\n\n\"People are raising their voice now just to show that our culture is still there, even though the majority of it got taken away.\n\n\" It's good to have these events just to feel connected. \"\n\nElders' pride\n\nElder and grandmother Fay Anderson said it was special occasion, which marked a big change from the way things were when she was growing up.\n\nFay Anderson with one of her many grandchildren at the ceremony. (ABC North Coast: Hannah Ross)\n\n\"It's the first time I've ever experienced this on country,\" she said.\n\n\"[It will mean] they will grow up knowing where they were born [and that] they come from this country.\"\n\nBullinah support coordinator Tarra Gordon said the faces of the elders lit up being around the babies and toddlers.\n\n\"It is very significant for our elders and women who didn't get to do traditional practices back when they were having babies,\" Ms Gordon said.\n\n\"It gives our elders hope that the next generation is going to be connected more to culture, to traditional practices, speaking more fluently in lingo.\"\n\nAged care support worker Tarra Gordon says the elders have high hopes for the next generation. (ABC North Coast: Hannah Ross)\n\nSystemic racism\n\nAccording to 2023 data published by the federal Department of Health, Disability and Ageing, Aboriginal women are three times more likely to die in childbirth and their babies are almost twice as likely to die in their first year of life.\n\nBirthing on country is a movement that has been gaining traction in Australia since the first national workshop was held in central Australia in 2012.\n\nIt aims to create Indigenous-led services that incorporate traditional birthing practices and cultural connection, ideally delivered by Indigenous doctors and midwives.\n\nSistabirth's program administrator at Bullinah, James Harrington, said his family used a birthing-on-country program in Queensland for the birth of his second child.\n\nHe said there were \"light years of difference\" between that \"culturally-safe care\" and what he experienced in the mainstream health system.\n\n\"There was better communication, better transparency and better cultural care, where I felt like we were shown respect and dignity,\" he said.\n\n\"With the local healthcare system or the hospitals, the community is facing challenges of systemic racism.\n\n\"It seems like an ongoing matter for a lot of families we speak to.\"\n\nJalissa Armstrong says her baby Violet will grow up proud of her culture. (ABC North Coast: Hannah Ross)\n\nThe Sistabirth program has been funded by the federal government for a five-year period.\n\nIt is delivered by Southern Cross University in partnership with Bullinah, the Pangula Mannamurna Aboriginal Corporation at Mount Gambier in South Australia, and Urapuntja Health Service north-east of Alice Springs.\n\nBullinah midwife Suzanne Weir and cultural advisor Deekeala Glew are among those working under the program in the Northern Rivers.\n\nBullinah Aboriginal Health Service midwife Suzanne Weir (left) and cultural advisor Deekeala Glew at the Sistabirth conference. (ABC North Coast: Hannah Ross)\n\nMs Weir said the project would be tailored to what the community wanted.\n\n\"The women want to be heard, they want to be respected, they want a safe place to get their care and to give birth,\" she said.\n\n\"They are aiming high. They talk about having their own birth house, and when they walk in they feel safe straight away.\"\n\nRegaining knowledge\n\nThe Sistabirth program has been running for several years at the Pangula Mannamurna Aboriginal Corporation.\n\nAunty Michelle Jacquelin-Furr has been involved with the Pangula Mannamurna Sistabirth program in South Australia. (ABC North Coast: Hannah Ross)\n\nMichelle Jacquelin-Furr said she spent weeks in the Adelaide Museum to acquire some knowledge to pass on to the young women going through the program.\n\n\"I think a lot of these women feel like they are getting some cultural advice,\" she said.\n\n\"I tell stories of my great Aunty Annie, I bring my possum skin cloak in, I get the seasonal calendar out and talk about what it was like for the Boandik women birthing.\n\n\"So it's just that cultural connection, and about bringing those things back into their journey.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-10-26/walking-netball-masters-games-active-inclusive-sport/105934176",
        "title": "Knee braces are the norm in this competitive sport adaptation",
        "publish_date": "Sat, 25 Oct 2025 21:25:04 +0000",
        "category": "sports",
        "authors": [],
        "text": "Before the Magnolias take the court, they strap on their knee braces and tie bows in their hair.\n\nOn the sidelines, their coach tells them to stay calm and slow down.\n\nThe group of women, aged in their late 60s and early 70s, dominate the competition in walking netball.\n\nWalking netball has become increasingly popular as a sport for former netball stars or people wanting to try it for the first time. (ABC News: Lily Nothling)\n\nThe modified version of the traditional game is designed to be more accessible, minimise injuries and keep participants playing the sport they love for longer.\n\nRunning and jumping are against the rules.\n\n\"I didn't think that I wanted to do it,\" Magnolias player Lyn Zanker said.\n\n\" I thought it was for old ladies, but it so is not just for old ladies. \"\n\nNetball is notoriously tough on knees, but Walking Netball allows players to keep on competing in the game they love. (ABC News: Lily Nothling)\n\nNetball is the most popular team sport among Australian women, but it can take a big toll on the body.\n\nMany who pivot to walking netball have grown up with the game.\n\n\"I've played since I was young — now I have to have a new knee, so I'm playing with braces on my knee,\" Sue Mauger said with a smile.\n\n\" The surgeon, to help me get here, has put some stuff between my bones so I can play. \"\n\nUnder the rules of walking netball, players are allowed to take up to two steps with the ball and maintain possession for an extra second.\n\nNetball is the most played team sport among Australian women. (ABC News: Lily Nothling)\n\nMs Mauger said the modifications made for a more inclusive environment.\n\n\"We have two women who are deaf, we have somebody who has just gone through chemotherapy and she comes out every week,\" she said.\n\n\" Another woman's had a brain tumour … and she's come along in leaps and bounds — she can now shoot a goal from anywhere in the ring and remember most people's names. \"\n\nTen walking netball teams from across the country have been competing at the Australian Masters Games in Canberra over the past week.\n\nThe Magnolias clinched gold in the over 65 category.\n\nStill as competitive as ever\n\nNetball ACT chief executive Sally Clark said the adapted sport was growing in popularity.\n\n\"Netball is not always kind to the body, to our knees and ankles, so it just allows people to continue to play for a lot longer and really enjoy the benefits of that social connection,\" Ms Clark said.\n\nSlight adaptations to the rules of traditional netball make walking netball inclusive to all sorts of people. (ABC News: Lily Nothling)\n\n\"You're seeing it now in quite a few of the codes, [with] walking hockey, walking football, and I've even heard of stroll-o polo.\"\n\nWhat walking netball may lack in speed, it makes up for in competitiveness.\n\n\"Some of the most competitive games come out of our 65-plus ladies this week,\" Ms Clark said.\n\n\"Been a few elbows, I believe.\"\n\n'You've got no excuse'\n\nKeeley Devery used to represent Australia in netball and thought she'd given up the game forever. (ABC News: Lily Nothling)\n\nStar defender Keeley Devery played for Australia's national netball team, the Diamonds, for a decade.\n\nShe retired in 1996 but was persuaded by friends to return to the court for the Australian Masters Games.\n\n\"I said, 'No, no, no, those days are over, my knees wouldn't cope',\" she said.\n\n\"This year they said, 'We've put a team in walking netball, you've got no excuse'.\"\n\nFor lifelong netball players, adapting to the no running and jumping rules can be a challenge.\n\n\"For the first three games, I was trying to work out what the hell I was doing … it does feel really weird,\" Ms Devery said.\n\nBut she has already signed up for another walking netball tournament next year.\n\n\"The appeal for me has always been a team sport … so it's very hard not get wrapped up in that excitement and enthusiasm.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/consumer-affairs/would-you-let-a-bot-choose-your-insurance-for-you-20251024-p5n53g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Would you let a bot choose your insurance for you?",
        "publish_date": "Sun, 26 Oct 2025 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Elias Visontay"
        ],
        "text": "Two of Australia’s largest insurers could see their dominance in home and motor policies take a hit as customers start using AI-powered bots to automatically gather and analyse personalised quotes, analysts have warned.\n\nMacquarie, in a research note issued last week, flagged the rise of “agentic AI shoppers” – artificially intelligent bot “agents” which act on behalf of a user to search for products, compare prices and execute transactions – as warranting the attention of both insurers and investors.\n\nIt’s a matter of time before Australians start using artificially intelligent bot “agents” to search for products, compare prices and execute transactions, experts say. Credit: Stephen Kiprillis\n\nThe Macquarie analysts highlighted the competitive threat the trend could pose to Insurance Australia Group, which is behind insurance brands including NRMA and CGU, and Suncorp, which has brands including AAMI, GIO and Bingle.\n\n“As agentic AI shoppers become more widely used in Australia, there is a material threat brewing for IAG and [Suncorp] to hold market share of profitable products, such as Home and Personal Motor,” Macquarie’s research note warned.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/alana-king-takes-a-record-7-18-at-women-s-cricket-world-cup-as-australia-beats-south-africa-20251026-p5n5a3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alana King has magic in her fingers. It’s a joy to watch, unless you’re the batter facing her",
        "publish_date": "Sun, 26 Oct 2025 12:29:57 +1100",
        "category": "sports",
        "authors": [],
        "text": "Delivered with perfect tempo and a classical leggie’s action, it whirrs down the pitch, drifting and dropping due to the spin imparted, then either darts sharply from leg to off or skids through unerringly at the stumps.\n\nTo that not quite exhaustive list of the most visually pleasing sights in sport, we must now add Alana King’s leg break, which is equal parts beautiful and devastating.\n\nIt’s also the embodiment of advice passed down for generations of leg-spinners, and best articulated by Richie Benaud in the precisely-typed letters he would send to prospective tweakers: “You should practice the hard-spun leg break 90 per cent of the time, the variations only 10 per cent.”\n\nKing’s spell – never has that word been more appropriate – against South Africa in Indore was one such day. At one stage she had the figures of 4-0 in 2.3 overs, before they finished at a startling 7-18, the best analysis ever returned at a women’s World Cup.\n\nAlana King took seven South African wickets. Credit: Getty Images\n\nThe natural variation created by her leg-breaks on a helpful surface was summed up by how four of King’s victims were bowled, either because the ball turned past their bats on the outside or slid through on the inside.\n\nIn some ways, this burst of wickets was a reward for how well King had been bowling in the tournament, when teams like England tried to sit on her and were strangled (her figures were 1-20 from 10 overs) rather than swept away.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/nrl-eyes-mega-worldwide-launch-in-2027-20251026-p5n5c8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NRL eyes mega worldwide launch in 2027",
        "publish_date": "Sun, 26 Oct 2025 12:11:36 +1100",
        "category": "finance",
        "authors": [],
        "text": "NRL eyes mega worldwide launch in 2027\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/piastri-s-grip-on-f1-lead-slipping-as-teammate-norris-qualifies-in-pole-position-20251026-p5n5bq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Piastri’s grip on F1 lead slipping as teammate Norris qualifies in pole position",
        "publish_date": "Sun, 26 Oct 2025 11:39:56 +1100",
        "category": "sports",
        "authors": [
            "Alan Baldwin"
        ],
        "text": "Mexico City: McLaren’s Lando Norris stormed to pole position with an epic lap at the Mexico City Grand Prix, with the Formula One lead in his sights after teammate Oscar Piastri qualified seventh.\n\nBriton Norris, 14 points behind Australian Piastri in the standings with five rounds remaining, beat Ferrari’s Charles Leclerc to the top spot by 0.262 seconds after leaving his best to last.\n\nIt was the 14th pole of his F1 career, fifth of the season and first since Belgium in July.\n\n“What a lap. Even I don’t know how I did that,” Norris said over the team radio as he realised the time of one minute 15.586 seconds was unbeatable.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/motorsport/norris-stunned-by-flying-mexican-gp-pole-lap-20251026-p5n5bt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Norris stunned by flying Mexican GP pole lap",
        "publish_date": "Sun, 26 Oct 2025 11:10:55 +1100",
        "category": "sports",
        "authors": [],
        "text": "Norris stunned by flying Mexican GP pole lap\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/liverpool-woes-mount-as-brentford-goes-2-0-up-20251026-p5n5bn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Liverpool woes mount as Brentford goes 2-0 up",
        "publish_date": "Sun, 26 Oct 2025 10:52:04 +1100",
        "category": "sports",
        "authors": [],
        "text": "Liverpool woes mount as Brentford goes 2-0 up\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw9-brentford-vs-liverpool-20251026-p5n5b7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW9: Brentford vs Liverpool",
        "publish_date": "Sun, 26 Oct 2025 09:51:41 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW9: Brentford vs Liverpool\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/england-have-enough-to-worry-about-without-second-guessing-australian-line-up-20251025-p5n587.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "England have enough to worry about without second-guessing Australian line-up",
        "publish_date": "Sun, 26 Oct 2025 09:45:00 +1100",
        "category": "sports",
        "authors": [
            "Geoff Lawson"
        ],
        "text": "Marnus Labuschagne is back in form. Matt Renshaw has been elevated to the ODI team, having regathered his mojo. Sam Konstas isn’t making enough (at the moment), and Usman Khawaja has been guaranteed his spot despite a lengthy run of below-average scores. Head, Green and/or Webster are in, then keeper Carey and the bowlers. Perennial tourist Sean Abbott can fulfil 12th man duties.\n\nWhile the bowlers more or less pick themselves, pundits and punters have been clashing over the make-up of the batting order for months now. Algorithms have been consulted and selectors have prevaricated.\n\nPat Cummins’s return to the top of his mark has been the subject of most conjecture due to the rate at which his back is healing rather than queries around form. The captain is an all-time great and there is little use fretting further over which Test match he will re-emerge in – he will be back when he wants to be back.\n\nPat Cummins is unlikely to play in the first Test against England because of back troubles. Credit: AP\n\nWe should bother ourselves more with the living and available. Fortunately, Scott Boland’s record on Australian pitches suggests England cannot take a single relieving breath. But beyond Boland, the staff are less obvious.\n\nCuriously, the England encampment appears to be founding its own self-belief on Australia’s injury toll and selection debates, rather than the obvious strengths of their own players. Contemporary mental coaching doesn’t emphasise the acknowledgement of your own weaknesses. The modern athlete wants to talk a good game before they play it, which surely only increases the pressure when it comes to “walking the walk”.\n\nThe Australians will be fortified rather than diminished by England’s name-calling. Sports psychology 101 dictates keeping your opponent off guard – winning the verbal battle counts for zero if the words aren’t backed up with deeds.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/miami-would-be-cool-players-and-clubs-back-nrl-s-global-round-plans-20251026-p5n5ae.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Miami would be cool’: Players and clubs back NRL’s global round plans",
        "publish_date": "Sun, 26 Oct 2025 09:41:00 +1100",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "Nathan Cleary and rugby-bound Mark Nawaqanitawase have led a chorus of support for the NRL’s global round concept, encouraging the game’s leaders to launch each season in cities around the world.\n\nThis masthead first reported the story on Saturday, revealing the NRL had ambitious plans to launch the 2027 season in cities such as London, Dubai, and Hong Kong in a bid to expand on its Las Vegas venture.\n\nThe news has been well received by the Australian players, who were talking about the NRL initiative when the story broke on the day of the first Test against England at Wembley Stadium. Cleary says he’d like the Panthers to play on the United States’ east coast.\n\n“I should probably say Manchester, because then I could see Mary [partner Mary Fowler],” Cleary said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/sunderland-stun-chelsea-man-united-make-it-three-in-a-row-newcastle-snatch-late-win-20251026-p5n5ad.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Liverpool cop fourth straight loss; Sunderland stun Chelsea; Man United make it three in a row",
        "publish_date": "Sun, 26 Oct 2025 09:33:24 +1100",
        "category": "sports",
        "authors": [],
        "text": "The visitors, who moved up to second place in the table, had gone behind in the fourth minute when Alejandro Garnacho claimed his first goal for Chelsea, cutting in from the left and shooting through the legs of Sunderland goalkeeper Robin Roefs. The Londoners’ lead was cancelled out by Wilson Isidor’s equaliser in the 22nd minute when the Frenchman stabbed in from close range after Chelsea failed to deal with a long throw. The game appeared to be heading for a draw as Chelsea failed to find a way through the Black Cats’ disciplined midfield and defensive lines. In the third minute of added time, however, Talbi collected a pass by fellow substitute Brian Brobbey and the Morocco winger placed his low shot perfectly for his first goal for Sunderland since signing from Club Brugge in July.\n\nSunderland coach Regis Le Bris said his players had found the right balance between pressing Chelsea high up the pitch in key moments before holding their deep blocking formation. Sunderland’s Wilson Isidor celebrates after scoring his side’s first goal. Credit: AP “It’s a good performance, especially after the early goal,” the Frenchman told reporters. “We won three points. We are happy with the way we played. It is important to grab this opportunity when possible.” Enzo Maresca’s men had been seeking their third league win in a row after victories over Liverpool and Nottingham Forest but failed to build on their early lead. Brazilian teenager Estevao, who came on to score the winner in the 2-1 victory over Liverpool, was largely held at bay by Sunderland after he replaced Garnacho in the 58th minute.\n\nChelsea’s Alejandro Garnacho shoots during the match against Sunderland. Credit: Getty Images Chelsea defender Trevoh Chalobah said the Blues had paid the price for losing concentration in the dying moments. “As a team it is not the best of games but it is one we have to learn from,” he told Sky Sports. “With the Champions League we have a lot of games but we can’t complain. These are the games we want to play in and we can’t use that as an excuse.” Man United hang on to make it three wins in a row The crisis is over for Manchester United. For now at least.\n\nA third straight win in the Premier League finally has Ruben Amorim’s team moving in the right direction, up to the heady heights of the top five on Saturday and with a sense of momentum not felt for a long time at Old Trafford. A 4-2 win against Brighton extended coach Amorim’s best run of league wins since he was appointed last November. It was the first time United had won three in a row in England’s top flight since February 2024. Victory also ended Brighton’s winning streak in this fixture, which dated back three seasons. It is still too early to tell if Amorim has turned a corner after such a wretched start to his tenure, including the 20-time champion’s worst-ever season in the Premier League last term.\n\nBut coming on the heels of last week’s morale-boosting win at Liverpool, the signs are positive, even if Brighton sparked a fightback to make it a nervy finish for the home fans. A prime source of encouragement for Amorim is the manner in which his summer signings have added a new dimension. Brazil forward Matheus Cunha scored his first goal for the club with a curling shot from outside the area to give United a 24th-minute lead. Manchester United’s Bryan Mbeumo, front, celebrates scoring his side’s third goal with teammates. Credit: AP Bryan Mbeumo also scored twice in the second half, making it three in his last two games, after Casemiro had doubled the lead with a deflected effort before the break.\n\nIt was a former United player, Danny Welbeck, who gave Brighton hope with a brilliant free kick that flew into the top corner and when substitute Charalampos Kostoulas headed another goal in time added on, the tension rose inside the stadium. Then came Mbeumo’s second to snuff out any chance of a collapse and ensure the winning streak continued. Thrilling late win for Newcastle United over Fulham Newcastle United’s dramatic late 2-1 Premier League win over Fulham on Saturday may prove more than just three points — it could be the emotional spark their season needs, said United boss Eddie Howe. Bruno Guimaraes’ 90th-minute strike rescued the Magpies from what looked like a damaging draw, and Howe believes the timing of the goal could have a ripple effect.\n\n“Late goals don’t just affect the game you’ve won, they affect mood and belief going forward,” Howe said. “It can have a big knock-on effect. We’ve had heartbreak the other way. This felt like a massive moment for us. We found a way to win.” Newcastle’s win was just their third of the season and saw them climb provisionally to 10th in the table. Howe wants more though after last season’s fifth-place finish and a League Cup victory.\n\nThe Magpies were looking to get their league campaign back on track after last weekend’s disappointing 2-1 loss at Brighton and Hove Albion, but were buoyed by their emphatic 3-0 Champions League victory over Benfica midweek. Howe had talked of reigniting Newcastle’s Premier League push — and his side backed up that ambition with a purposeful start with Jacob Murphy scoring in the 18th minute. Bruno Guimaraes celebrates his winning goal. Credit: Getty Images Sasa Lukic drew the visitors level in the 56th minute and the game looked to be heading towards a draw before Guimaraes’ late-game heroics. Substitute William Osula drove to the edge of the box, but his shot was parried into the path of Guimaraes by goalkeeper Bernd Leno, and the Brazilian poked it in from close range.\n\n“It’s one I’ll remember, that’s for sure,” Howe said. “You always remember when you win late, and it was a priceless win for us ... a big three points.” Howe had praised Guimaraes’ durability in logging thousands of miles to play for club and country in his pre-game press conference on Friday, pointing out that his captain “very rarely lets you down.” Bruno Guimaraes scores his team’s second goal against Fulham. Credit: Getty Images The midfielder proved his point at St James’ Park. “I feel unbelievable. We were very tired from Wednesday’s game and I think we had to learn how to finish the game,” Guimaraes said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw9-man-utd-vs-brighton-20251026-p5n5aw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW9: Man Utd vs Brighton",
        "publish_date": "Sun, 26 Oct 2025 09:13:06 +1100",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW9: Man Utd vs Brighton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw9-newcastle-vs-fulham-20251026-p5n5ax.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW9: Newcastle vs Fulham",
        "publish_date": "Sun, 26 Oct 2025 09:12:26 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW9: Newcastle vs Fulham\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw9-chelsea-vs-sunderland-20251026-p5n5av.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW9: Chelsea vs Sunderland",
        "publish_date": "Sun, 26 Oct 2025 09:12:25 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW9: Chelsea vs Sunderland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/labor-nepa-announcement-environment-watchdog/hewlqlxqb",
        "title": "Labor moves to create Australia's first national environment watchdog",
        "publish_date": "Sun, 26 Oct 2025 00:29:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "A new federal environmental watchdog will be set up by the Labor government as part of its attempt to revamp Australia's environmental laws.\n\n\n\n\n\nEnvironment Minister Murray Watt announced on Sunday that the government would establish the nation's first-ever National Environment Protection Agency (NEPA), a new independent body to strengthen oversight.\n\n\n\n\n\nHe said the proposed body would act as a \"strong, independent regulator\" responsible for ensuring compliance with new environmental laws, auditing state and territory processes for project approvals and educating industry and community on the country's environmental legislation.\n\n\n\n\n\n\"An independent NEPA will have strong compliance and enforcement oversight to better protect our precious environment and ensure those who seek to illegally destroy it pay a high price,\" Watt said in a statement.\n\n\n\nWhat will the NEPA do?\n\nThe new agency would exercise a range of powers independently of the environment minister, including compliance and auditing against new environmental laws, while allowing the minister to retain decision-making power for certain matters, including project approvals and accreditation of state and territory processes.\n\n\n\n\n\nThe establishment of NEPA is part of a broader package of proposed environmental law reforms, which also include new national environmental standards, changes to environmental offset policies and substantially higher penalties for businesses that break the law.\n\n\n\nSussan Ley has called Labor's proposed reforms an \"environmental approvals disaster\" that would add substantial red tape. Source: AAP / Mick Tsikas There have been multiple attempts in recent years to overhaul the existing Environment Protection and Biodiversity Conservation Act, with the latest reforms expected to be introduced to parliament as early as this week.\n\n\n\n\n\nWatt urged the Opposition and the Greens, which have been critical of the bill so far, to support the reforms when they come before parliament.\n\n\n\n\n\n\"The ball will soon be in the court of the Opposition and the Greens. Will they again team up to block these important reforms that will deliver better outcomes for our environment and for business?\" he said.\n\n\n\n\n\nWatt said Australia's laws \"remain broken\" nearly five years since Graeme Samuel tabled his report to then-environment minister Sussan Ley.\n\n\n\n\n\nThe Samuel Review, handed to the Coalition government in 2020 and led by the former Australian Competition and Consumer Commission chair, found Australia's national environmental laws were outdated and ineffective.\n\n\n\nREAD MORE Federal government approves Woodside gas project extension, with some conditions\n\nOn Friday, Samuel told the ABC he was \"frustrated\" and \"frankly, a little angry\" about the Greens and Opposition's position on the proposed changes.\n\n\n\n\n\nOn Friday, Opposition leader Ley called the reforms an \"environmental approvals disaster\" that would add layers of bureaucracy.\n\n\n\n\n\nGreens leader Larissa Waters has criticised the proposal for doing \"little to protect nature\", and that the change \"weakens an already weak piece of legislation\".\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/trump-hits-canada-with-10-per-cent-tariff-hike-in-retaliation-for-anti-tariff-tv-ad/vcaesuz3c",
        "title": "Trump hits Canada with 10 per cent tariff hike in retaliation for anti-tariff TV ad",
        "publish_date": "Sat, 25 Oct 2025 21:56:47 +0000",
        "category": "sports",
        "authors": [],
        "text": "United States President Donald Trump says he plans to hike tariffs on imports of Canadian goods by an extra 10 per cent because of an anti-tariff television ad aired by the province of Ontario.\n\n\n\n\n\nThe ad used the words of former US president Ronald Reagan to criticise US tariffs, angering Trump , who said he would end trade talks with Canada earlier this week in response.\n\n\n\n\n\nTrump criticised the ad as \"fraudulent\" at the time and the Ronald Reagan Foundation said in a post on X that it had used audio and video \"selectively\".\n\n\n\n\n\nThe footage of Reagan is from a radio address he delivered in April 1987, and is available in full on the Reagan Library official YouTube channel.\n\n\n\n\n\n\"Over the long run, such trade barriers hurt every American worker and consumer,\" Reagan says during the address, in comments used by the ad.\n\n\n\n\n\nLater in the speech, the former US president adds: \"At first, when someone says 'Let's impose tariffs on foreign imports', it looks like they're doing the patriotic thing by protecting American products and jobs. And sometimes, for a short while, it works. But only for a short time.\"\n\n\n\nOntario's premier Doug Ford said he would pull the ad after the weekend, and it ran on Friday night (local time) during the first game of the baseball World Series between the Toronto Blue Jays and Los Angeles Dodgers.\n\n\n\n\n\n\"Their Advertisement was to be taken down, IMMEDIATELY, but they let it run last night during the World Series, knowing that it was a FRAUD,\" Trump said in a post on his Truth Social platform as he flew aboard Air Force One to Malaysia.\n\n\n\n\n\n\"Because of their serious misrepresentation of the facts, and hostile act, I am increasing the Tariff on Canada by 10% over and above what they are paying now.\"\n\n\n\n\n\nTrump imposed tariffs on Canadian steel, aluminium and cars earlier this year , prompting Canada to respond in kind.\n\n\n\n\n\nThe two countries have been in talks for weeks on a potential deal for the steel and aluminium sectors.\n\n\n\nOntario premier Doug Ford said the ads would be pulled after the weekend. Source: AAP / AP / Nathan Denette Trump and Canadian Prime Minister Mark Carney will both attend the Association of Southeast Asian Nations summit in Malaysia.\n\n\n\n\n\nBut Trump told reporters travelling with him that he had no intention of meeting Carney there.\n\n\n\n\n\nCarney said on Saturday (AEDT) that Canada was ready for further trade talks whenever the United States is ready\n\n\n\n\n\n\"We stand ready to pick up on that progress and build on that progress when the Americans are ready,\" he told reporters.\n\n\n\n\n\n\"We cannot control the trade policy of the United States.\"\n\n\n\n\n\n— Reporting by the Associated Press via the Australian Associated Press, with additional reporting by Reuters.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/how-a-literacy-and-numeracy-program-is-helping-adults-open-up-career-options/dbsydr48w",
        "title": "How a literacy and numeracy program is helping adults open up career options",
        "publish_date": "Sat, 25 Oct 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nSecond-year apprentice carpenter, Cedrick Smith, is confident on the tools.\n\n\n\n\n\n(Sound of a drop saw)\n\n\n\n\n\n\"When I first came to the actual St Joseph's construction sites, I was doing the slabs. So we literally did the house from the slab up, all the way to fitout. It is very rewarding.\"\n\n\n\n\n\nBefore his apprenticeship he took part in a free work readiness program through Build Up Tassie, where he worked with a language literacy and numeracy coach.\n\n\n\n\n\n\"(We went through) things that would simplify calculations at work specific to carpentry. Nothing crazy. So like a lot of the older generation would have learnt, they would memorised these things like times tables to make it simpler because a lot of us young people we never memorise this sort of stuff and it does help on the job site, it really does help.\"\n\n\n\n\n\nThe lessons were directly related to his work.\n\n\n\n\n\n\"Things like multiples of three, that's one we worked on a lot because a lot of building products come in multiples of three so that’s very useful to know.\"\n\n\n\n\n\nHe says working one-on-one has been impactful.\n\n\n\n\n\n\"She gave me the confidence to realise that I've already got the skills I've just got to work on them a bit, just got to make them work for me.\"\n\n\n\n\n\nFleur McConnon is the language, literacy and numeracy Coast for Build Up Tassie.\n\n\n\n\n\nShe says the program’s approach is what makes it successful.\n\n\n\n\n\n\"The beauty of our program is it's a small group. Everyone's known. No one's flying under the radar. Everyone is known, and everyone is being picked up and swept along at their own pace.\"\n\n\n\n\n\nShe says it’s rewarding work.\n\n\n\n\n\n\"Seeing someone realise that, yes, I can do this just watching their confidence grow throughout the program and seeing the possibilities the future possibilities open and expand, is the best part of the job.\"\n\n\n\n\n\nGrant funding for the position comes through 26Ten, a Tasmanian program working to lift adult literacy and numeracy skills.\n\n\n\n\n\nSenior literacy advisor at Libraries Tasmania, Iona Johnson, says 26TeN has worked with more than 4,000 learners since it started in 2012.\n\n\n\n\n\n\"People generally come in with an idea of what it is that they're wanting to achieve in their life, and realising that literacy has kind of got in the way of them being able to achieve that. So they generally have some life goals that you know will tailor that learning around. So it might be about wanting to learn to read to their child. It might be about, you know, wanting to successfully pass a white card or a first aid certificate or do something towards repositioning themselves in terms of work.\"\n\n\n\n\n\nThe data on adult literacy and numeracy levels comes from the OECD, under the Programme for the International Assessment of Adult Competences, or PIAAC.\n\n\n\n\n\nThe figures show as many as one-in-five Australians have low levels of literacy or numeracy.\n\n\n\n\n\n\"Approximately 14 per cent of people have literacy skill levels below level two, so at much lower levels, who are likely to experience a significant gap between what they're able to do and their ability to engage in everyday life. 21 per cent of people have that gap in terms of their numeracy skills.\"\n\n\n\n\n\nThese figures were released more than 10 years ago, with those in the sector keen for an update to see what has – or hasn’t – changed.\n\n\n\n\n\n\"So the last survey was done in 2012 what the results came out in 2012 which is quite a long time now. It's very old data.\"\n\n\n\n\n\nAustralia temporarily withdrew from PIAAC but has since re-joined, with fresh data expected in 2029.\n\n\n\n\n\nJobs and Skills Australia is also conducting a national survey of adult literacy and numeracy skills, with those results due in late 2026.\n\n\n\n\n\nFor Cedrick Smith, a little help has opened up a lifelong career.\n\n\n\n\n\n\"It could take me a lot of places. There's unrelated fields where they need work that involves a carpentry background. I'm not too sure yet, I'm sort of open to what's going to come next. I'll sort of wait and see. (It could involve) you know having my own business maybe.\"\n\n\n\n\n\n(Sound of a saw)\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/are-aliens-from-space-waiting-to-invade-probably-not-say-the-scientists/trna0zcc6",
        "title": "Are aliens from space waiting to invade? Probably not, say the scientists",
        "publish_date": "Sat, 25 Oct 2025 20:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-deaths-of-despair-the-deadly-dangers-of-homelessness/vu64jdqbe",
        "title": "INTERVIEW: 'Deaths of Despair': the deadly dangers of homelessness",
        "publish_date": "Sat, 25 Oct 2025 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "If this story has raised issues for you or someone you know, you can get support from 1800 RESPECT at 1800 737 732, Lifeline on 13-11-14, Men's Referral Service 1300 766 491 and beyondblue on 1300 22 4636\n\n\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/uluru-marks-40-years-since-historic-handback/3gxknb6yl",
        "title": "Rain, reflection and renewal: Uluru marks 40 years since historic handback",
        "publish_date": "Sat, 25 Oct 2025 08:41:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Anangu traditional owners have marked 40 years since Uluru Kata Tjuta National Park was handed back to their people.\n\n\n\n\n\nThe handback on 26 October 1985 was a landmark moment for Aboriginal land rights in Australia and a powerful recognition of the enduring connection between First Nations peoples and Country.\n\n\n\n\n\nUluru and Kata Tjuta are some of central Australia's most iconic landscapes, included in the UNESCO World Heritage List, and have been sacred sites of the Anangu people for millennia.\n\n\n\n\n\nThey had been known by other names for decades, after European explorers renamed Kata Tjuta as Mount Olga, and Uluru as Ayers Rock, after South Australia’s Chief Secretary Sir Henry Ayers.\n\n\n\nCelebrations kick-off\n\nThe official celebrations have included a trip to London for a delegation of nine Anangu traditional owners, who met with High Commissioner to the UK Stephen Smith, and King Charles, as part of the official commemorations.\n\n\n\nKing Charles met with Anangu traditional owners at the Australian High Commission in London on Thursday. Source: PA / Jack Taylor Prime Minister Anthony Albanese and Governor-General Sam Mostyn were among those who travelled to Uluru for the celebrations.\n\n\n\n\n\nThunderstorms played out for hours at Uluru early on Saturday, with heavy rain soaking the rock and creating waterfalls down its sides before the sky cleared during the morning.\n\n\n\n\n\nAt Uluru-Kata Tjuta National Park, Albanese told reporters it was a great honour to be the first prime minister to attend a celebration of the handback of a symbol that signified Australia around the world.\n\n\n\n\n\nIt was an \"extraordinary place of beauty and spiritual significance for the Anangu people\" but anyone who visited felt the significance of a very sacred place, he said.\n\n\n\nPrime Minister Anthony Albanese takes a selfie with Mutitjulu school student Annalisha Buzzacott at Uluru on Saturday. Source: AAP / Sara Maiorino The Anangu people had been generous, the prime minister said, in welcoming visitors from around Australia and the world.\n\n\n\n\n\nAnangu woman Alison Milyika Carroll remembers attending the event with her father when in her 20s and seeing the title deeds handed over to male and female elders.\n\n\n\n\n\n\"This rock belongs to Anangu and is for everybody,\" she told reporters at Uluru.\n\n\n\n\n\n\"We love people coming here from all over to walk around and see it.\n\n\n\n\n\n\"They enjoy it, to see this amazing rock.\"\n\n\n\n\n\nCelebratory events being held on Saturday at Uluru's sunrise viewing site include traditional dance performances, a concert featuring local and national musicians, an art exhibition and arts and crafts stalls.\n\n\n\n\n\nMostyn will unveil a plaque commemorating the 40th anniversary of the handback on Sunday.\n\n\n\nHistoric handover\n\nIn 1985, the traditional owners of Uluru found themselves at the centre of a historic moment, announced by then Governor-General Sir Ninian Stephen.\n\n\n\n\n\nThe handback was a landmark moment for Aboriginal land rights in Australia and a powerful recognition of the enduring connection between First Nations peoples and Country.\n\n\n\n\n\nIt was the result of years of lobbying by the Central Land Council and Pitjantjatjara Council to recognise the rights of traditional owners, something the Northern Territory government had consistently resisted.\n\n\n\nLISTEN TO Traditional owners mark 40th anniversary of Uluru handback in London SBS News 06:08 English\n\nIn 1985, Chief Minister Ian Tuxsworth argued that the territory government should have control, and that the commissioner of the territory's land court should decide on ownership, even though Uluru had been excluded from the Territory's Aboriginal Land Rights Act when it was declared the Uluru–Kata Tjuta National Park in 1977.\n\n\n\n\n\n\"That commissioner has already determined that Uluru is not available for claim, and he's also not made any determination that there ARE traditional owners to the Uluru area,\" he said at the time.\n\n\n\n\n\n\"Now until those things are settled we are saying that the Aboriginal Land Rights Act has been subverted and changed for political convenience.\"\n\n\n\n\n\nThe territory government had accordingly lobbied for the title to be transferred to them, which the National Museum of Australia says would have resulted in a reduced title for the Anangu and no control in park management.\n\n\n\nThe Hawke government and governor-general believed otherwise.\n\n\n\n\n\nStephen said that would be rectified by the handback, and an agreement for the traditional owners to lease the park back to the government.\n\n\n\n\n\n\"The trust by the deed which is to be handed over today acquires inalienable Australian law to this place, which is so special to its members,\" he said.\n\n\n\n\n\n\"And at the same time, recognising the special significance of Uluru to all Australians, and the appropriateness of it remaining as an Australian national park, the Trust will today lease it back to the Australian National Parks and Wildlife Service as a national park.\"\n\n\n\nUluru is included in the UNESCO World Heritage List and is one of the most recognisable natural sites in the world.\n\n\n\n\n\nMillions of people visit every year, making it one of Australia's most popular tourist sites.\n\n\n\n\n\n— With additional reporting by Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/climate-change-disrupting-sleep/yadm6dg33",
        "title": "The global threat 'quietly undermining' our sleep",
        "publish_date": "Sat, 25 Oct 2025 07:13:33 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "As temperatures climb in Australia and around the world, researchers are warning that warmer nights are quietly eroding our sleep — with effects that could ripple through our health and wellbeing.\n\n\n\n\n\nNew international research led by Flinders University sleep experts analysed more than 165 million nights of sleep data from more than 317,000 users of sleep-tracking devices.\n\n\n\n\n\nThe analysis found that when night-time temperatures climbed from the global median of 12C to 27C, people lost an average of 15 to 17 minutes of sleep.\n\n\n\n\n\nWhile that might not seem like a lot, researchers found a far sharper effect when looking at the chances of getting too little sleep.\n\n\n\nREAD MORE No Australians immune: What 2050 and beyond will look like for your city\n\nOn hotter nights, the likelihood of sleeping less than six hours increased by about 40 per cent.\n\n\n\nSleep is 'essential' for good health\n\n\"Sleep is essential for physical and mental health, and our findings show that high temperatures are quietly undermining this fundamental biological need,\" said one of the study's lead authors, Bastien Lechat, a research associate at the Adelaide Institute for Sleep Health.\n\n\n\n\n\n\"This isn’t just about our comfort, it’s about our cognition, mood, immune function, and long-term overall wellbeing.\"\n\n\n\n\n\nSleep deprivation has been linked to depression, mood changes, cardiovascular disease and impaired cognitive function.\n\n\n\nIt's also been linked to an increased risk of accidents and various other health issues, co-lead author Barbara Toson told SBS News.\n\n\n\n\n\n\"So it's not just about the discomfort that you have that night and the following day, it's the cumulative effect that it will have on your condition, mood, immune function, and long-term well-being,\" she said.\n\n\n\n\n\nThe findings show heat-induced sleep loss is impacting people of all ages and backgrounds across various regions and demographics, she said.\n\n\n\nHow to safeguard sleep\n\nThe obvious methods include air conditioning, fans, breathable bedding and leaving windows open to allow in a breeze. It can also be helpful to close sun-facing windows and blinds during the day to prevent bedrooms from heating up.\n\n\n\nSleep experts also suggest drinking water regularly and avoiding caffeine, alcohol and heavy meals before bed.\n\n\n\n\n\nOn a societal level, there are a number of ways to adapt and protect sleep, said Danny Eckert, a senior researcher on the paper.\n\n\n\n\n\n\"Urban design, housing, and public health strategies such as using heat-resilient housing designs and urban cooling strategies, such as green roofs, tree planting, and reflective building materials could help,\" he said.\n\n\n\nDisproportionate impact on less affluent populations\n\nOne limitation of the study was its reliance on data from costly sleep-tracking devices, which are more prevalent in wealthier countries, Toson noted.\n\n\n\n\n\nAs a result, lower-income populations were likely underrepresented.\n\n\n\nThere's strong existing evidence that climate change hits poorer and more vulnerable communities hardest, exacerbating existing inequalities.\n\n\n\n\n\n\"It certainly affects those populations in a disproportionate way,\" Toson said, pointing to a lack of access to tools like air conditioning and cooler bedding.\n\n\n\n\n\nLast year, analysis by the Australia Institute found that extreme heat poses a greater threat to outer-urban and rural areas of the country, where vulnerable populations — including older people, those with chronic health conditions and people on lower incomes — are more concentrated.\n\n\n\nREAD MORE Michael Mosley suffered from chronic insomnia. Here were his tips on sleeping well\n\nData from the Australian Institute of Health and Welfare shows that extreme heat remains the leading cause of weather-related hospitalisations in Australia.\n\n\n\nLooking to the future\n\nAs the planet warms and nights grow hotter, researchers say the impact on sleep, and its flow-on effects for public health will only become more pronounced.\n\n\n\n\n\n\"Obviously, we would love to see an improvement on the policies that overall tackle global [climate] change,\" Toson told SBS News, adding that improvements to urban design, housing and green space will also be important considerations.\n\n\n\n\n\nThe take-home message, she said, is that this is something \"that will affect us and will affect everyone.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/matcha-boom-australia-shake-up/29635oedo",
        "title": "The $27 million reason Aussie matcha fanatics could face a shake-up",
        "publish_date": "Sat, 25 Oct 2025 00:07:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "In the cafes of bustling Australian cities, queues form early in the morning as customers wait for their daily fix of matcha.\n\n\n\n\n\nGlobal demand for the carefully produced powdered green tea synonymous with Japan has surged in recent years, fuelled by millennials and gen Z consumers seeking healthier drink options.\n\n\n\n\n\nHip cafes around the world now feature matcha lattes, smoothies, and desserts as staples. In Australia, the matcha market generated more than $54 million in revenue in 2024, according to market research firm Grand View Research.\n\n\n\n\n\nThat figure is expected to grow at 7.1 per cent annually over the next five years. By 2030, revenue is projected to exceed $81 million — a $27 million increase.\n\n\n\nBut that rise in popularity is being met with challenges. Extreme heat and labour shortages in Japan have hit tea plantations hard, leading to a decline in matcha production and surging prices.\n\n\n\n\n\nJapan's green tea exports to Australia reached 195,319 kg between January and August 2025, according to the Japanese Tea Export Promotion Council.\n\n\n\n\n\nThat's a 131 per cent year-on-year increase, making Australia the eighth-largest export destination.\n\n\n\n\n\nSupply has not kept up. The price of tencha, the raw leaf used for matcha, hit a record 8,235 yen/kg ($82/kg) at a May auction in Kyoto, up 170 per cent from a year earlier, according to the Global Japanese Tea Association.\n\n\n\nLISTEN TO Prices for matcha green tea set to jump by 70 per cent this year SBS News 00:54 English\n\nThose challenges have led some cafes in Australia to consider turning to another country to meet their matcha needs: China.\n\n\n\n\n\nOne cafe in Melbourne added Chinese matcha lattes to its menu alongside the traditional Japanese version when the shop opened in April.\n\n\n\n\n\n\"Chinese matcha has a stronger, more bitter tea base, which makes it great for iced drinks or pairing with plant-based milk,\" the shop posted on social media in July.\n\n\n\n\n\n\"Japanese matcha, on the other hand, is sweeter and more delicate, ideal for hot drinks or pairing with dairy milk.\"\n\n\n\nMatcha's popularity is surging around the world, an opportunity for Chinese suppliers amid price hikes in the Japanese industry. Source: SBS News / Nicole Gong The cafe said it was the first in the city to offer the alternative — but it's unlikely to be the last.\n\n\n\n\n\nUmesh Kumar, who runs a cafe in Melbourne's South Yarra, is also considering a shift to serving Chinese matcha.\n\n\n\n\n\n\"A lot of suppliers from China have approached me. I got 48 samples last month from China from different regions,\" the 29-year-old told SBS Chinese.\n\n\n\n\n\nKumar said the price of premium \"tier-one\" Japanese matcha has jumped from $390/kg to $500/kg in the past 12 months.\n\n\n\nMelbourne matcha cafe owner Umesh Kumar said his profit margins are shrinking as Japanese matcha prices soar. Source: SBS News / Nicole Gong His cafe uses about 120kg a month. While he's kept prices stable, his profit margins are shrinking.\n\n\n\n\n\n\"If the [Japanese matcha] pricing is going more than $600/kg, that means one cup's cost will be $5.80. It's not worth it to run at $9,\" he said. \"If nothing changes, Australians could be paying over $12 a cup soon.\"\n\n\n\nChina's matcha comeback\n\nZihan He, a social media influencer and Chinese tea culture insider, said the shortage of Japanese matcha offers \"a perfect alignment of timing, opportunity, and momentum\" for Chinese matcha to go global.\n\n\n\n\n\n\"There's a gap in the low-end tea market because of Japan's supply shortage,\" she said.\n\n\n\n\n\n\"In 2023, China might not have been ready, but 2025 is different — many factories now receive strong subsidies to expand their matcha production lines.\"\n\n\n\nZihan He travels to different tea regions in China and globally to promote Chinese tea. Credit: Supplied While Japan's matcha enjoys international prestige, He pointed out that matcha actually originated in China.\n\n\n\n\n\nIt flourished during the Tang and Song dynasties through the diancha (whisked tea) tradition and was known as \"mocha\" before fading in popularity after the Ming dynasty, as tea-drinking customs changed.\n\n\n\n\n\nWhen Zen Buddhism spread to Japan, matcha-making techniques went with it, eventually developing into Japan’s renowned tea ceremony culture.\n\n\n\n\n\nNow, matcha is experiencing a revival in China, with major production hubs in the Zhejiang and Guizhou provinces.\n\n\n\nWhat are the key differences between Chinese and Japanese matcha?\n\nHe acknowledged that a quality gap remains. Japanese matcha has a bright, vivid green colour and a smooth, sweet taste, while Chinese matcha still tends to be darker and more bitter, she said.\n\n\n\n\n\nOne key difference, she added, lies in shading — a vital process that boosts chlorophyll and amino acids, creating that signature green hue and mild flavour. Shading involves artificially reducing the amount of sun the tea bush is exposed to, usually via a canopy.\n\n\n\n\n\n\"Japan has centuries of experience and detailed data on how long shading should last in each region,\" she said. \"In China, we’re still experimenting — for example, if farmers follow Japan’s 20-day shading, it might make the tea too astringent at higher altitudes.\"\n\n\n\n\n\nStill, He remains optimistic: \"China may be slow from zero to one, but once it learns, it moves fast from one to one hundred.\"\n\n\n\nChange is brewing, but there's a sticking point\n\nFor cafe owners like Kumar, Chinese matcha's biggest appeal is price and scalability.\n\n\n\n\n\nHe said tier-three Chinese matcha sells for around $80/kg, compared with $299/kg for Japanese matcha of a similar grade — nearly four times the price.\n\n\n\n\n\nHowever, taste remains a sticking point.\n\n\n\n\n\n\"Japanese matcha is thicker and creamier … on the other side, Chinese matcha still tastes grainy and bitter at this stage,\" Kumar said.\n\n\n\n\n\nHe hasn't switched suppliers yet but is keeping an open mind.\n\n\n\n\n\n\"Chinese matcha will play a bigger role [in Australia] if they come with the good quality and pricing,\" he said.\n\n\n\n\n\n\"I'm telling you, businesses are ready to switch.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/peanut-butter-loving-babies-are-licking-allergies-study-suggests/m6cabwn8u",
        "title": "Peanut butter loving babies are licking allergies, study suggests",
        "publish_date": "Fri, 24 Oct 2025 21:31:25 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nTiffany Leon is a dietitian from Maryland in the United States - and also the mum of two boys.\n\n\n\n\n\nWhen they were little, she followed a new guideline - first issued in the US in 2015 - to introduce peanuts to them at an early age.\n\n\n\n\n\n“As a dietitian, I practice evidence-based recommendations throughout my career, and so when someone told me, 'Oh this is this is how it's done now, these are the new guidelines', I just thought, 'Oh okay, well this is what we're gonna do then'... So around four, around five months we like sat him in the chair and fed him a few of the lower risk allergenic foods. I think we did like green beans, infant cereal, you know, did a few things first. And then we just jumped in with two feet.”\n\n\n\n\n\nThe reason for this change in the Leon family is because up to that point, parents had been told to avoid exposing their children to potentially risky foods until they were three years old, in the hope of avoiding a full blown allergy.\n\n\n\n\n\nPeanut allergy is one of the most common of these conditions, caused when the body’s immune system mistakenly identifies proteins in peanuts as harmful and releases chemicals that trigger symptoms like hives, respiratory issues, and sometimes, life-threatening anaphylaxis.\n\n\n\n\n\nIn that event, as this parent told SBS in August, it can become an all-consuming situation.\n\n\n\n\n\n“Allergies aren't just an inconvenience. They really do shape every aspect of families' lives.”\n\n\n\n\n\nNew guidance aimed at avoiding this kind of outcome came out in a number of countries after Gideon Lack at King’s College London published the groundbreaking Learning Early About Peanut Allergy, or LEAP, trial, work that suggested earlier exposure might actually help children.\n\n\n\n\n\nSo says Dr David Hill, from the Children's Hospital of Philadelphia.\n\n\n\n\n\n“The LEAP study... showed that if we actually introduce that allergen to children by mouth, having them eat it, before they're introduced to it via their skin, we can reduce the risk that that child's going to go on to develop the food allergy itself.”\n\n\n\n\n\nVirginia's children appear to have avoided developing a peanut allergy - and now Dr Hill has published a new study after analysing electronic health records from dozens of paediatric practices to track diagnoses of food allergies in young children before, during and after the new guidelines were issued.\n\n\n\n\n\nIt's found thousands of other children in the US have also avoided developing peanut allergies after their parents followed the same dietary advice as the Leons.\n\n\n\n\n\n“What our data shows is that because of, or at least associated with those early introduction guidelines, there's about 60,000 less kids with food allergy today than there would have been. And that's a remarkable thing, right? That's the size of some cities.”\n\n\n\n\n\nAssociate Professor Rachel Peters is the Population Health Research Program Lead at the Murdoch Children's Research Institute's National Allergy Centre of Excellence.\n\n\n\n\n\nShe's been part of research at the Institute that's also exploring these issues.\n\n\n\n\n\nAccording to the charity group Allergy and Anaphlyaxis Australia, peanut allergy is one of the most common food allergies in childhood in Australia, affecting 3 percent of infants up to the age of 12 months.\n\n\n\n\n\nDr Peters says at least two major studies have been completed in Australia in the last decade to explore what might prevent such allergies in the first place - one study happening before Australia adopted new infant feeding guidelines in 2016, and one after that date.\n\n\n\n\n\n“We had two population-based studies recruited in the same region, which was Melbourne, Australia... So we had two cohorts recruited with exactly the same methods, but 10 years apart... Firstly, we measured what parents were doing in terms of infant feeding practices and we had some very promising results showing that nearly 90 percent of babies today are being fed peanut in the first year of life, and this is what the guidelines currently recommend... (and secondly) we certainly showed a modest reduction in food allergy, but perhaps not as much as we were expecting.”\n\n\n\n\n\nDr Peters says the Australian findings suggest much more study needs to be done to establish the various causes of food allergies.\n\n\n\n\n\n“Even though we are certainly starting to see a reduction in the rates of peanut allergy in Australia, they are still quite higher - and higher than in some other countries around the world, and higher than what was shown in this American study as well.”\n\n\n\n\n\nThe Associate Professor says some of that research has offered some promising evidence.\n\n\n\n\n\n“For example, there is a large trial underway examining whether Vitamin D supplementation in the first year of life is helpful for preventing food allergy... There's a number of studies that show in babies who live further from the equator - so they're geting less exposure to Vitamin D and less sunlight - that they're more likely to develop a food allergy. We even see that within Australia. We have higher rates of food allergy in Melbourne compared to what we see in Queensland.”\n\n\n\n\n\nBack in the United States, Dr Hill has been encouraged by his findings.\n\n\n\n\n\n“It's amazing for me to be able to sit here with you today and say, you know, for the first time in modern history, not only have we reduced the rate of food allergy diagnoses, but we're actually lower than we were five years ago.”\n\n\n\n\n\nIn the meantime, Dr Peters says parents can put their minds at ease.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-inside-sudans-deepening-humanitarian-crisis/ml9osho0f",
        "title": "INTERVIEW: Inside Sudan's deepening humanitarian crisis",
        "publish_date": "Fri, 24 Oct 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/traditional-owners-mark-40th-anniversary-of-uluru-handback-in-london/gmbtyod83",
        "title": "Traditional owners mark 40th anniversary of Uluru handback in London",
        "publish_date": "Fri, 24 Oct 2025 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nUluru and Kata Tjuta are some of central Australia's most iconic landscapes, included in the UNESCO World Heritage List, and for the longest time, have been sacred sites of the Anangu people.\n\n\n\n\n\nThey had been known by other names for decades, after European explorers renamed Kata Tjuta as Mount Olga, and Uluru as Ayers Rock, after South Australia’s Chief Secretary, Sir Henry Ayers.\n\n\n\n\n\nIn 1985, the traditional owners of Uluru found themselves at the centre of an historic moment, announced by then Governor General Sir Ninian Stephen:\n\n\n\n\n\n\"I now place in the hands of the Uluru Kata Tjuta Aboriginal Land Trust, the title deeds.\"]]\n\n\n\n\n\nThe handback was a landmark moment for Aboriginal land rights in Australia and a powerful recognition of the enduring connection between First Nations peoples and Country.\n\n\n\n\n\nIt was the result of years of lobbying by the Central Land Council and Pitjantjatjara Council to recognise the rights of traditional owners, something the Northern Territory government had consistently resisted.\n\n\n\n\n\nIn 1985, Chief Minister Ian Tuxsworth argued that the territory government should have control, and that the Commissioner of the Territory's Land Court should decide on ownership, even though Uluru had been excluded from the Territory's Aboriginal Land Rights Act when it was declared the Uluru–Kata Tjuta National Park in 1977.\n\n\n\n\n\n“That Commissioner has already determined that Uluru is not available for claim, and he's also not made any determination that there ARE traditional owners to the Uluru area. Now until those things are settled we are saying that the Aboriginal Land Rights Act has been subverted and changed for political convenience.”\n\n\n\n\n\nThe Territory government had accordingly lobbied for the title to be transferred to them - which the National Museum of Australia says would have resulted in a reduced title for the Anangu and no control in park management.\n\n\n\n\n\nThe Hawke government and Governor General believed otherwise.\n\n\n\n\n\nSir Stephen said that would be rectified by the handback - and an agreement for the traditional owners to lease the park back to the government.\n\n\n\n\n\n“The trust by the deed which is to be handed over today acquires inalieable Australian law to this place, which is so special to its members... And at the same time, recognising the special significance of Uluru to all Australians, and the appropriateness of it remaining as an Australian national park, the Trust will today lease it back to the Australian National Parks and Wildlife Service as a national park.”\n\n\n\n\n\nNow, the anniversary of that historic handback has been remembered 40 years on, with a public event at Talinguṟu Nyakunytjaku, the Uluṟu sunrise viewing area, with Prime Minister Anthony Albanese.\n\n\n\n\n\nBut the first commemorations took place weeks earlier, in early October, at London's Australia House.\n\n\n\n\n\nHigh Commissioner to the UK Stephen Smith says the official event included nine traditional owners, dignitaries, and King Charles - who visited the site in 1983 during his tour of Australia with then wife Princess Diana.\n\n\n\n\n\nHe appears to have never forgotten his experience.\n\n\n\n\n\n“I remember when I went. At the different times of day it was extraordinary. The light. I didn't have time to get my paintbrush out.”\n\n\n\n\n\nHarry Wilson was among the Anangu representatives who made the trip to the UK.\n\n\n\n\n\n“As you can see a picture of Uluru on the screen here, it brings us into tears, sadness and happiness as well.”\n\n\n\n\n\nStephen Smith says the event itself was a significant one - not just because it's the first time in seven years that King Charles has visited Australia House.\n\n\n\n\n\n“Normally the palace looks at 50 or 100 year anniversaries, so the fact that we're doing this on the 40th anniversary tells you this was something special.”\n\n\n\n\n\nAnthony Albanese offered some remarks to the official service at Australia House via a video message.\n\n\n\n\n\n“It was a milestone in Aboriginal land rights in Australia, and a powerful moment in the story of our continent. Around the world, Uluru is instantly recognised as Australia. In Australia, it stands as a monument to a peoples' love for country and their determination to see justice done.”\n\n\n\n\n\nThe Australian High Commissioner also spoke.\n\n\n\n\n\n“The Anangu have lived in the area around Uluru-Kata Tjuta for more than 30,000 years. These places are among the most recognised and significant living cultural landscapes, where knowledge, language, song and ceremony have been passed down across countless generations.”\n\n\n\n\n\nJust like 40 years ago, when traditional songs and dances were performed as the handback took place, the anniversary has also included performances, this time by the nine Anangu Traditional Owners - some of whom had never visited the United Kingdom before.\n\n\n\n\n\nSammy Wilson says the song is from their grandmothers and grandfathers - and talks about the significance of the rock.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/consumer-affairs/would-you-let-a-bot-choose-your-insurance-for-you-20251024-p5n53g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Would you let a bot choose your insurance for you?",
        "publish_date": "Sun, 26 Oct 2025 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Elias Visontay"
        ],
        "text": "Two of Australia’s largest insurers could see their dominance in home and motor policies take a hit as customers start using AI-powered bots to automatically gather and analyse personalised quotes, analysts have warned.\n\nMacquarie, in a research note issued last week, flagged the rise of “agentic AI shoppers” – artificially intelligent bot “agents” which act on behalf of a user to search for products, compare prices and execute transactions – as warranting the attention of both insurers and investors.\n\nIt’s a matter of time before Australians start using artificially intelligent bot “agents” to search for products, compare prices and execute transactions, experts say. Credit: Stephen Kiprillis\n\nThe Macquarie analysts highlighted the competitive threat the trend could pose to Insurance Australia Group, which is behind insurance brands including NRMA and CGU, and Suncorp, which has brands including AAMI, GIO and Bingle.\n\n“As agentic AI shoppers become more widely used in Australia, there is a material threat brewing for IAG and [Suncorp] to hold market share of profitable products, such as Home and Personal Motor,” Macquarie’s research note warned.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/alana-king-takes-a-record-7-18-at-women-s-cricket-world-cup-as-australia-beats-south-africa-20251026-p5n5a3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alana King has magic in her fingers. It’s a joy to watch, unless you’re the batter facing her",
        "publish_date": "Sun, 26 Oct 2025 12:29:57 +1100",
        "category": "sports",
        "authors": [],
        "text": "Delivered with perfect tempo and a classical leggie’s action, it whirrs down the pitch, drifting and dropping due to the spin imparted, then either darts sharply from leg to off or skids through unerringly at the stumps.\n\nTo that not quite exhaustive list of the most visually pleasing sights in sport, we must now add Alana King’s leg break, which is equal parts beautiful and devastating.\n\nIt’s also the embodiment of advice passed down for generations of leg-spinners, and best articulated by Richie Benaud in the precisely-typed letters he would send to prospective tweakers: “You should practice the hard-spun leg break 90 per cent of the time, the variations only 10 per cent.”\n\nKing’s spell – never has that word been more appropriate – against South Africa in Indore was one such day. At one stage she had the figures of 4-0 in 2.3 overs, before they finished at a startling 7-18, the best analysis ever returned at a women’s World Cup.\n\nAlana King took seven South African wickets. Credit: Getty Images\n\nThe natural variation created by her leg-breaks on a helpful surface was summed up by how four of King’s victims were bowled, either because the ball turned past their bats on the outside or slid through on the inside.\n\nIn some ways, this burst of wickets was a reward for how well King had been bowling in the tournament, when teams like England tried to sit on her and were strangled (her figures were 1-20 from 10 overs) rather than swept away.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/nrl-eyes-mega-worldwide-launch-in-2027-20251026-p5n5c8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NRL eyes mega worldwide launch in 2027",
        "publish_date": "Sun, 26 Oct 2025 12:11:36 +1100",
        "category": "finance",
        "authors": [],
        "text": "NRL eyes mega worldwide launch in 2027\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/piastri-s-grip-on-f1-lead-slipping-as-teammate-norris-qualifies-in-pole-position-20251026-p5n5bq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Piastri’s grip on F1 lead slipping as teammate Norris qualifies in pole position",
        "publish_date": "Sun, 26 Oct 2025 11:39:56 +1100",
        "category": "sports",
        "authors": [
            "Alan Baldwin"
        ],
        "text": "Mexico City: McLaren’s Lando Norris stormed to pole position with an epic lap at the Mexico City Grand Prix, with the Formula One lead in his sights after teammate Oscar Piastri qualified seventh.\n\nBriton Norris, 14 points behind Australian Piastri in the standings with five rounds remaining, beat Ferrari’s Charles Leclerc to the top spot by 0.262 seconds after leaving his best to last.\n\nIt was the 14th pole of his F1 career, fifth of the season and first since Belgium in July.\n\n“What a lap. Even I don’t know how I did that,” Norris said over the team radio as he realised the time of one minute 15.586 seconds was unbeatable.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/motorsport/norris-stunned-by-flying-mexican-gp-pole-lap-20251026-p5n5bt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Norris stunned by flying Mexican GP pole lap",
        "publish_date": "Sun, 26 Oct 2025 11:10:55 +1100",
        "category": "sports",
        "authors": [],
        "text": "Norris stunned by flying Mexican GP pole lap\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/liverpool-woes-mount-as-brentford-goes-2-0-up-20251026-p5n5bn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Liverpool woes mount as Brentford goes 2-0 up",
        "publish_date": "Sun, 26 Oct 2025 10:52:04 +1100",
        "category": "sports",
        "authors": [],
        "text": "Liverpool woes mount as Brentford goes 2-0 up\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw9-brentford-vs-liverpool-20251026-p5n5b7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW9: Brentford vs Liverpool",
        "publish_date": "Sun, 26 Oct 2025 09:51:41 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW9: Brentford vs Liverpool\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/england-have-enough-to-worry-about-without-second-guessing-australian-line-up-20251025-p5n587.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "England have enough to worry about without second-guessing Australian line-up",
        "publish_date": "Sun, 26 Oct 2025 09:45:00 +1100",
        "category": "sports",
        "authors": [
            "Geoff Lawson"
        ],
        "text": "Marnus Labuschagne is back in form. Matt Renshaw has been elevated to the ODI team, having regathered his mojo. Sam Konstas isn’t making enough (at the moment), and Usman Khawaja has been guaranteed his spot despite a lengthy run of below-average scores. Head, Green and/or Webster are in, then keeper Carey and the bowlers. Perennial tourist Sean Abbott can fulfil 12th man duties.\n\nWhile the bowlers more or less pick themselves, pundits and punters have been clashing over the make-up of the batting order for months now. Algorithms have been consulted and selectors have prevaricated.\n\nPat Cummins’s return to the top of his mark has been the subject of most conjecture due to the rate at which his back is healing rather than queries around form. The captain is an all-time great and there is little use fretting further over which Test match he will re-emerge in – he will be back when he wants to be back.\n\nPat Cummins is unlikely to play in the first Test against England because of back troubles. Credit: AP\n\nWe should bother ourselves more with the living and available. Fortunately, Scott Boland’s record on Australian pitches suggests England cannot take a single relieving breath. But beyond Boland, the staff are less obvious.\n\nCuriously, the England encampment appears to be founding its own self-belief on Australia’s injury toll and selection debates, rather than the obvious strengths of their own players. Contemporary mental coaching doesn’t emphasise the acknowledgement of your own weaknesses. The modern athlete wants to talk a good game before they play it, which surely only increases the pressure when it comes to “walking the walk”.\n\nThe Australians will be fortified rather than diminished by England’s name-calling. Sports psychology 101 dictates keeping your opponent off guard – winning the verbal battle counts for zero if the words aren’t backed up with deeds.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/miami-would-be-cool-players-and-clubs-back-nrl-s-global-round-plans-20251026-p5n5ae.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Miami would be cool’: Players and clubs back NRL’s global round plans",
        "publish_date": "Sun, 26 Oct 2025 09:41:00 +1100",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "Nathan Cleary and rugby-bound Mark Nawaqanitawase have led a chorus of support for the NRL’s global round concept, encouraging the game’s leaders to launch each season in cities around the world.\n\nThis masthead first reported the story on Saturday, revealing the NRL had ambitious plans to launch the 2027 season in cities such as London, Dubai, and Hong Kong in a bid to expand on its Las Vegas venture.\n\nThe news has been well received by the Australian players, who were talking about the NRL initiative when the story broke on the day of the first Test against England at Wembley Stadium. Cleary says he’d like the Panthers to play on the United States’ east coast.\n\n“I should probably say Manchester, because then I could see Mary [partner Mary Fowler],” Cleary said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/sunderland-stun-chelsea-man-united-make-it-three-in-a-row-newcastle-snatch-late-win-20251026-p5n5ad.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Liverpool cop fourth straight loss; Sunderland stun Chelsea; Man United make it three in a row",
        "publish_date": "Sun, 26 Oct 2025 09:33:24 +1100",
        "category": "sports",
        "authors": [],
        "text": "The visitors, who moved up to second place in the table, had gone behind in the fourth minute when Alejandro Garnacho claimed his first goal for Chelsea, cutting in from the left and shooting through the legs of Sunderland goalkeeper Robin Roefs. The Londoners’ lead was cancelled out by Wilson Isidor’s equaliser in the 22nd minute when the Frenchman stabbed in from close range after Chelsea failed to deal with a long throw. The game appeared to be heading for a draw as Chelsea failed to find a way through the Black Cats’ disciplined midfield and defensive lines. In the third minute of added time, however, Talbi collected a pass by fellow substitute Brian Brobbey and the Morocco winger placed his low shot perfectly for his first goal for Sunderland since signing from Club Brugge in July.\n\nSunderland coach Regis Le Bris said his players had found the right balance between pressing Chelsea high up the pitch in key moments before holding their deep blocking formation. Sunderland’s Wilson Isidor celebrates after scoring his side’s first goal. Credit: AP “It’s a good performance, especially after the early goal,” the Frenchman told reporters. “We won three points. We are happy with the way we played. It is important to grab this opportunity when possible.” Enzo Maresca’s men had been seeking their third league win in a row after victories over Liverpool and Nottingham Forest but failed to build on their early lead. Brazilian teenager Estevao, who came on to score the winner in the 2-1 victory over Liverpool, was largely held at bay by Sunderland after he replaced Garnacho in the 58th minute.\n\nChelsea’s Alejandro Garnacho shoots during the match against Sunderland. Credit: Getty Images Chelsea defender Trevoh Chalobah said the Blues had paid the price for losing concentration in the dying moments. “As a team it is not the best of games but it is one we have to learn from,” he told Sky Sports. “With the Champions League we have a lot of games but we can’t complain. These are the games we want to play in and we can’t use that as an excuse.” Man United hang on to make it three wins in a row The crisis is over for Manchester United. For now at least.\n\nA third straight win in the Premier League finally has Ruben Amorim’s team moving in the right direction, up to the heady heights of the top five on Saturday and with a sense of momentum not felt for a long time at Old Trafford. A 4-2 win against Brighton extended coach Amorim’s best run of league wins since he was appointed last November. It was the first time United had won three in a row in England’s top flight since February 2024. Victory also ended Brighton’s winning streak in this fixture, which dated back three seasons. It is still too early to tell if Amorim has turned a corner after such a wretched start to his tenure, including the 20-time champion’s worst-ever season in the Premier League last term.\n\nBut coming on the heels of last week’s morale-boosting win at Liverpool, the signs are positive, even if Brighton sparked a fightback to make it a nervy finish for the home fans. A prime source of encouragement for Amorim is the manner in which his summer signings have added a new dimension. Brazil forward Matheus Cunha scored his first goal for the club with a curling shot from outside the area to give United a 24th-minute lead. Manchester United’s Bryan Mbeumo, front, celebrates scoring his side’s third goal with teammates. Credit: AP Bryan Mbeumo also scored twice in the second half, making it three in his last two games, after Casemiro had doubled the lead with a deflected effort before the break.\n\nIt was a former United player, Danny Welbeck, who gave Brighton hope with a brilliant free kick that flew into the top corner and when substitute Charalampos Kostoulas headed another goal in time added on, the tension rose inside the stadium. Then came Mbeumo’s second to snuff out any chance of a collapse and ensure the winning streak continued. Thrilling late win for Newcastle United over Fulham Newcastle United’s dramatic late 2-1 Premier League win over Fulham on Saturday may prove more than just three points — it could be the emotional spark their season needs, said United boss Eddie Howe. Bruno Guimaraes’ 90th-minute strike rescued the Magpies from what looked like a damaging draw, and Howe believes the timing of the goal could have a ripple effect.\n\n“Late goals don’t just affect the game you’ve won, they affect mood and belief going forward,” Howe said. “It can have a big knock-on effect. We’ve had heartbreak the other way. This felt like a massive moment for us. We found a way to win.” Newcastle’s win was just their third of the season and saw them climb provisionally to 10th in the table. Howe wants more though after last season’s fifth-place finish and a League Cup victory.\n\nThe Magpies were looking to get their league campaign back on track after last weekend’s disappointing 2-1 loss at Brighton and Hove Albion, but were buoyed by their emphatic 3-0 Champions League victory over Benfica midweek. Howe had talked of reigniting Newcastle’s Premier League push — and his side backed up that ambition with a purposeful start with Jacob Murphy scoring in the 18th minute. Bruno Guimaraes celebrates his winning goal. Credit: Getty Images Sasa Lukic drew the visitors level in the 56th minute and the game looked to be heading towards a draw before Guimaraes’ late-game heroics. Substitute William Osula drove to the edge of the box, but his shot was parried into the path of Guimaraes by goalkeeper Bernd Leno, and the Brazilian poked it in from close range.\n\n“It’s one I’ll remember, that’s for sure,” Howe said. “You always remember when you win late, and it was a priceless win for us ... a big three points.” Howe had praised Guimaraes’ durability in logging thousands of miles to play for club and country in his pre-game press conference on Friday, pointing out that his captain “very rarely lets you down.” Bruno Guimaraes scores his team’s second goal against Fulham. Credit: Getty Images The midfielder proved his point at St James’ Park. “I feel unbelievable. We were very tired from Wednesday’s game and I think we had to learn how to finish the game,” Guimaraes said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw9-man-utd-vs-brighton-20251026-p5n5aw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW9: Man Utd vs Brighton",
        "publish_date": "Sun, 26 Oct 2025 09:13:06 +1100",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW9: Man Utd vs Brighton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw9-newcastle-vs-fulham-20251026-p5n5ax.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW9: Newcastle vs Fulham",
        "publish_date": "Sun, 26 Oct 2025 09:12:26 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW9: Newcastle vs Fulham\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw9-chelsea-vs-sunderland-20251026-p5n5av.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW9: Chelsea vs Sunderland",
        "publish_date": "Sun, 26 Oct 2025 09:12:25 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW9: Chelsea vs Sunderland\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    }
]