[
    {
        "url": "https://www.9news.com.au/national/a-minecraft-movie-moviegoers-choking-after-fire-extinguisher-let-off-in-melbourne-hoyts-cinema/dbdf7ecd-f6d3-48e3-bfce-6a63ab87ac13",
        "title": "Chaos erupts in cinema leaving moviegoers 'choking and crying'",
        "publish_date": "Thu, 17 Apr 2025 01:15:54 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Moviegoers were left \"choking and crying\" after unruly teenagers set off a fire extinguisher inside a cinema in Melbourne's east.\n\nA bizarre trend taking place during screenings of A Minecraft Movie, where cinemas erupt into chaos upon one particular scene, was taken to a new level at Eastland Hoyts in Ringwood.\n\nMelbourne mother Mel told 3AW her kids were left \"terrified\" after teenagers pulled the pin on a fire extinguisher inside a dark cinema.\n\nMelbourne mother Mel told 3AW her kids were left \"terrified\". (TikTok/ finlayw14_)\n\n\"It scared a lot of children, a lot of grandparents,\" Mel told hosts Mark Allen and Jimmy Bartel.\n\n\"You couldn't breathe, you couldn't swallow, the kids were choking, my kids were crying, their eyes were burning.\"\n\nFootage of the fire extinguisher incident was also shared on TikTok.\n\nMel said Hoyts checked the bags of some moviegoers and confiscated items such as flour and toilet paper.\n\nShe claimed several teenagers later snuck out to grab the fire extinguisher mid-film.\n\n\"I don't know where they got it from,\" Mel said.\n\n\"And then, bang. We were completely doused in it.\"\n\nHoyts staff moved the innocent attendees to another room where they continued playing the film.\n\nFootage of the fire extinguisher incident was also shared on TikTok. (TikTok/ finlayw14_)\n\nUsually, fans respond to a scene titled 'Chicken Jockey' by throwing popcorn, clapping and screaming.\n\nThis has become a viral trend on social media, filled with videos of overblown reactions to the popular Jack Black film.\n\nAnother mother of a Hoyts employee told 3AW her son had been a regular witness to this disruptive behaviour.\n\n\"Everyday he comes home with a new story about what kids have smuggled in their bags to try and throw at the screen,\" Helen* said.\n\n\"Yesterday there was roast chicken, some flour.. They've got longer shifts and more cleaning to do.\"\n\nREAD MORE: The election promises Labor and the Coalition have made to win your vote\n\nHelen said workers have been asked to check bags before people enter the cinema for A Minecraft Movie.\n\n\"They're not security guards, they're 15 and 16-year-olds, and this is their part-time job,\" she added.\n\n9news.com.au has contacted Hoyts for comment.\n\n*Not her real name.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/shein-and-temu-to-raise-prices-due-to-donald-trump-prices/418e488f-3c51-4902-8b38-a14c3d6ada65",
        "title": "E-commerce giants Temu and Shein say they're raising prices due to tariffs",
        "publish_date": "Thu, 17 Apr 2025 01:08:51 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "China-founded e-commerce sites Temu and Shein say they plan to raise prices for US customers starting next week, a ripple effect from President Donald Trump's attempts to correct the trade imbalance between the world's two largest economies by imposing a sky-high tariff on goods shipped from China.\n\nTemu, which is owned by the Chinese e-commerce company PDD Holdings, and Shein, which is now based in Singapore, said in separate but nearly identical notices that their operating expenses have gone up \"due to recent changes in global trade rules and tariffs\".\n\nBoth companies said they would be making \"price adjustments\" starting next Friday, although neither provided details about the size of the increases. It was unclear why the two rivals posted almost identical statements on their shopping sites.\n\nShein and Temu say they will raise prices due to Donald Trump's tariffs. (AP)\n\nSince launching in the US, Shein and Temu have given Western retailers a run for their money by offering products at ultra-low prices, coupled with avalanches of digital or influencer advertising.\n\nThe 145 per cent tariff Trump slapped on most products made in China, coupled with his decision to end a customs exemption that allows goods worth less than $US800 ($1250) to come into the US duty-free, has dented the business models of the two platforms.\n\nE-commerce companies have been the biggest users of the widely used exemption.\n\nTrump signed an executive order this month to eliminate the \"de minimis provision\" for goods from China and Hong Kong starting May 2, when they will be subject to the 145 per cent import tax.\n\nAs many as four million low-value parcels — most of them originating in China — arrive in the US every day under the soon-to-be cancelled provision.\n\nAmerican politicians, law enforcement agencies and business groups lobbied to remove the long-standing exemption, describing it as a trade loophole that gave inexpensive Chinese goods an advantage and served as a portal for illicit drugs and counterfeits to enter the country.\n\nChinese exports to the US are subject to a 145 per cent tariff. (AP)\n\nShein sells inexpensive clothes, cosmetics and accessories, primarily targeting young women through partnerships with social media influencers.\n\nTemu, which promotes its goods through online ads, sells a wider array of products, including household items, humorous gifts and small electronics.\n\nLast year the companies were among the largest advertising spenders on social media platforms, but they've both slashed that spending in recent weeks, according to data analytics provider Sensor Tower.\n\nThat could be bad news for the platforms such as Facebook, Instagram, Snap, X and TikTok that rely on advertising.\n\nTrump-backing billionaires poised to lose nearly a trillion dollars in two days View Gallery\n\nIn November, American e-commerce giant Amazon launched a low-cost online storefront featuring electronics, apparel and other products priced at under $US20 ($31).\n\nMany of the electronics, apparel and other products on the storefront this week resembled the types of items typically found on Shein and Temu.\n\nIn their customer notices about the pending price increases, the companies encouraged customers to keep shopping in the days ahead.\n\n\"We've stocked up and stand ready to make sure your orders arrive smoothly during this time,\" Temu's statement said.\n\n\"We're doing everything we can to keep prices low and minimise the impact on you.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/unemployment-rises-in-march/040dbb6f-79eb-47b4-a20e-ae44f5ae513e",
        "title": "Unemployment edges higher in March to 4.1 per cent",
        "publish_date": "Thu, 17 Apr 2025 01:34:56 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "A﻿ustralia's seasonally adjusted unemployment rate has edged higher to 4.1 per cent in March as 3000 people left the workforce.\n\nNew data from the Australian Bureau of Statistics (ABS) revealed that despite unemployment increasing slightly, more than 32,000 people found work in March.\n\nSean Crick, ABS head of labour statistics, said the annual growth of people entering employment was at a 20-year high.\n\nREAD MORE: ﻿ Former PM John Howard appears on campaign trail\n\nA﻿ustralia's seasonally adjusted unemployment rate has edged higher to 4.1 per cent in March as 3000 people left the workforce. (Louie Douvis)\n\n﻿\"With employment increasing by 32,000 people and the number of unemployed increasing by 3000 people, the unemployment rate rose slightly to 4.1 per cent for March,\" Crick said.\n\n\"The employment-to-population ratio remained at 64.1 per cent in March, while the participation rate increased slightly to 66.8 per cent.\"\n\nCrick said bad weather - including Cyclone Alfred - meant the total number of hours worked in March fell.\n\nAustralia's fastest growing jobs with competitive salaries View Gallery\n\n﻿\"A higher than usual number of people reported working reduced hours this month due to bad weather, coinciding with ex-Tropical Cyclone Alfred and other major weather events in New South Wales and Queensland,\" he said.\n\nThe unemployment rate, along with headline inflation and the ongoing disruption caused by Trump-led global tariffs, will play into the RBA's decision when it hands down its next interest rate move on May 20.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/nvidia-caught-in-the-uschina-trade-war-takes-a-55-billion-hit/8d4f126a-27ba-49bf-bd39-7b3a1937b9f0",
        "title": "Nvidia, caught in the US-China trade war, takes a $8.64 billion hit",
        "publish_date": "Wed, 16 Apr 2025 21:34:45 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "US multinational technology company Nvidia is caught in the middle of an escalating trade war between the world's two largest economies.\n\nNvidia on Tuesday said it will take a US$5.5 billion ($8.64 million) financial hit after Washington placed fresh restrictions on the export of its H20 artificial intelligence chips to China, in the latest escalation of a growing battle for AI dominance.\n\nNvidia slumped 6.87 per cent Wednesday after tumbling during premarket trading. The export restrictions on Nvidia come as President Donald Trump's tariffs are roiling global markets and raising concerns about the prospects for global economic growth.\n\nThe NVIDIA logo is displayed on a building in Taipei, Taiwan, on April 16, 2025. (Reuters via CNN)\n\nThe World Trade Organisation on Wednesday said its expectations for global trade this year have \"deteriorated sharply\" owing to the battery of new tariffs on goods and uncertainty around future trade policy.\n\nThe H20 chip, released just last year, was purposefully made to accommodate stringent US export controls to China and allowed Nvidia to continue selling to the country. The model has less computing power than the more powerful H100 AI chip, which has already been banned for sale to China.\n\n\"Nvidia specifically designed the H20 to comply with US exports restrictions…now the rules change and they lost $5 billion,\" said Jay Hatfield, chief executive at Infrastructure Capital Advisors.\n\n\"So this inconsistent trade policy is costing companies a lot of money.\"\n\nThe H20 is believed to have contributed to DeepSeek's successful development of its ChatGPT-like reasoning AI model, R1, which was said to be trained at a fraction of the cost of American equivalents. The development stunned the tech industry and sparked an AI revolution in China.\n\nNvidia said in a Tuesday regulatory filing that it was informed by the US government last week the H20 chips would now require a special licence to be exported to China, which accounted for 13 per cent of sales last year.\n\nThe chipmaker said it will report approximately $8.64 billion worth of charges in its first quarter's earnings on May 28, associated with H20 products for \"inventory, purchase commitments, and related reserves.\"\n\nAnalysts led by Dan Ives, global head of technology research at financial services firm Wedbush Securities, said the financial impact is small relatively, but the restrictions mark a \"strategic blow\" for Nvidia's efforts to continue engaging its Chinese customers.\n\n\"This disclosure is a clear sign that Nvidia now has massive restrictions and hurdles in selling to China as the Trump Administration knows there is one chip and company fueling the AI Revolution and it's Nvidia,\" they said in a Tuesday research note.\n\nNew export rules\n\nThe industry-leading AI chip designer has been caught in the crossfire in recent years as the US seeks to block China's use of American technology to advance its military and AI systems.\n\nThe US Commerce Department confirmed on Tuesday it was issuing new export licensing requirements on China-related exports of Nvidia's H20 and another American AI chipmaker AMD's MI308 chips, as well as their equivalents, according to Reuters.\n\n\"The Commerce Department is committed to acting on the President's directive to safeguard our national and economic security,\" a Commerce Department spokesperson was quoted as saying.\n\nNvidia was told the license requirement would be in place indefinitely, the company said in the filing. It is unclear how the US government would grant the licenses. The company declined to comment beyond its filing.\n\nPresident Donald Trump speaks during an event to announce new tariffs in the Rose Garden at the White House (AP)\n\nWhile the Trump administration's imposition of curbs on the H20 chips was widely expected, the restriction was more abrupt than anticipated, analysts at Morgan Stanley said in a Wednesday note.\n\nSince DeepSeek's R1 model shook global markets earlier this year, American lawmakers on both sides of the aisle jointly called for tighter export controls on AI chips.\n\nIn the months since, China has seen an AI boom, with DeepSeek's reveal galvanising investment and pressure on Chinese companies to advance its AI sector. Investor confidence in the country's tech sector has surged, driving rallies in China and Hong Kong stocks.\n\nDeepSeek, along with many of China's established tech giants, have been major consumers of Nvidia's H20 graphic processing units. While Chinese tech heavy-weight Huawei and AI chipmaker Cambroon have developed alternatives to H20s, those China-made chips generally lag in performance, particularly in software maturity, according to Brady Wang, associate director of Counterpoint Research, a market analysis firm.\n\nThe performance gap between Chinese chips and Nvidia's is expected to widen, Wang said, because of \"Nvidia's superior ecosystem and manufacturing advantages,\" even as DeepSeek's rise demonstrates that high-performing AI models can be trained with lower-spec hardware.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/i-dont-enjoy-seeing-your-silly-car-woman-told-to-stop-parking-in-nz-suburb/15bd3590-c25e-48a6-89e3-888f7deb51b4",
        "title": "'I don't enjoy seeing your silly car': Woman told to stop parking in NZ suburb",
        "publish_date": "Wed, 16 Apr 2025 22:59:35 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "A New Zealand woman is surprised after she was told to stop parking her eyelash- adorned vehicle in a CBD suburb.\n\nGeorgia Prince, who owns a local beauty salon Brows by Prince in Wellington, has large plastic eyelashes attached to the front of her car.\n\nHowever, last Sunday she returned to her parked car to discover a note on the windscreen telling her to stop parking in the suburb of Te Aro .\n\nThe eyelashes-adorned car, and the note Georgia Prince received. (Supplied/Stuff)\n\n\"Dear Beetle owner. I don't enjoy seeing your silly car with its silly eyelashes and pink sticking plasters. It looks like a car version of Nicki Minaj,\" the note read.\n\nIt continued, \"please refrain from parking here, there is a Wilson Parking nearby, or other options. Yours sincerely. The residents of Te Aro.\"\n\nA Wellington woman is surprised after she was told to stop parking her eyelashes- adorned vehicle in a CBD suburb.\n\nGeorgia Prince, who owns a local beauty salon Brows by Prince, has large plastic eyelashes attached to the front of her car.\n\nHowever, last Sunday she returned to her parked car to discover a note on the windscreen telling her to stop parking in the suburb of Te Aro .\n\n\"Dear Beetle owner. I don't enjoy seeing your silly car with its silly eyelashes and pink sticking plasters. It looks like a car version of Nicki Minaj,\" the note read.\n\nIt continued, \"please refrain from parking here, there is a Wilson Parking nearby, or other options. Yours sincerely. The residents of Te Aro.\"\n\n\"Never. It is the opposite. When I am walking to my car I will always see people smiling or laughing or taking photos. It brings people joy. That is all I have ever seen.\"\n\nPrince remains at a loss as to who placed the note on the car but believes it was one person acting alone and not the residents of the area as claimed by the note.\n\n\"I just genuinely feel a lot of pity and sadness for who would write that. What a sad life you live.\"\n\n\"Never. It is the opposite. When I am walking to my car I will always see people smiling or laughing or taking photos. It brings people joy. That is all I have ever seen.\"\n\nPrince remains at a loss as to who placed the note on the car but believes it was one person acting alone and not the residents of the area as claimed by the note.\n\n\"I just genuinely feel a lot of pity and sadness for who would write that. What a sad life you live.\"\n\nPrince said she would not be deterred by the note and will continue to park in the area.\n\n\"I'm gonna actually get that note laminated and stuck up on the inside of the back window. It's just so silly. Like, oh my god where is the fun and personality and spark in your life.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/images-from-inside-gene-hackmans-home-released-by-police/42cfe93f-cc91-45e8-8166-aa8da544f7a1",
        "title": "New images show inside home of Gene Hackman and wife after mysterious deaths",
        "publish_date": "Wed, 16 Apr 2025 03:24:26 +0000",
        "category": "lifestyle",
        "authors": [
            "April"
        ],
        "text": "3 of 8 Attribution: AP\n\nThe records detail some of Arakawa's last emails, phone calls and internet searches that appear to show she was looking for information on flu-like symptoms and breathing techniques.\n\nThe documents and video recordings were released after a court ruled that most of them are public record but ordered that the couple's bodies would have to be blocked from view.\n\nArakawa's computer showed that between February 8 and the morning of Febuary 12, she was researching medical conditions related to COVID-19 and flu-like symptoms, according to the records released by the Santa Fe County Sheriff's Office.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-17/afl-luke-beveridge-speaks-about-jamarra-ugle-hagan-future/105187192",
        "title": "Beveridge says Ugle-Hagan's future is in AFL hands as critics take aim",
        "publish_date": "Thu, 17 Apr 2025 01:31:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jamarra Ugle-Hagan's playing future is in the hands of the AFL amid calls for the troubled star to be stood down, Western Bulldogs coach Luke Beveridge says.\n\nThe number one draft pick has not played a game this season because of personal issues, and it is unclear when or whether he will return to action.\n\nProminent past players have led calls this week for the Bulldogs to stand down Ugle-Hagan after new vision of the 23-year-old partying emerged on social media.\n\n\"I try not to think about the social media side of things too much,\" Beveridge said on Thursday.\n\n\"At the moment the decision-making in regards to Marra's future and what that entails is significantly in the AFL's hands.\n\n\"We're waiting on them to do certain things and we're continually interacting with them and working through it to work out what's best for Marra.\"\n\nLuke Beveridge speaks with Jamarra Ugle-Hagan during the 2021 season. (Getty Images: Daniel Pockett)\n\nUgle-Hagan remains on what the Bulldogs termed a \"flexible\" training arrangement and is not a regular at the club.\n\n\"My focus is absolutely, totally on the group that's here,\" Beveridge said.\n\n\"Sometimes he's here, sometimes he's not. If he is and he isn't, it's not worth talking about.\n\n\"If he is and he joins in, we carry on. But because he's not currently available for selection, it's not at the forefront of my mind.\n\n\"It's just making sure that the group who are playing are ready to go.\"\n\nSt Kilda great Nick Riewoldt was among Ugle-Hagan's most vocal critics this week and called for clubs to be better protected\n\n\"There can be real reasons, legitimate reasons, but when you're behaving the way that Jamarra is you forfeit all rights,\" Riewoldt said.\n\n\"This is the issue, there is no mechanism for clubs to be protected.\n\n\"Not just the clubs but the players you're teammates with that are actually fronting up day after day doing the work for the cause, and you've got a teammate that is not buying in and is still taking five or six, seven per cent of the salary cap with no recourse from the football clubs.\"\n\nLoading...\n\nThe top draft pick in 2020, Ugle-Hagan has kicked 103 goals in 67 games for the Bulldogs, but has not played since last year's elimination final.\n\nMeanwhile, Bulldogs superstar Marcus Bontempelli is on track to play his first game of the AFL season in his side's Easter Sunday test against St Kilda.\n\nBontempelli has missed the Bulldogs' first five games because of a complex calf injury sustained in a practice match in February.\n\nThe six-time All-Australian took a step forward when he completed an extensive training session over the weekend while the Bulldogs were in Adelaide for Gather Round.\n\nHe must complete Thursday's main training session at Whitten Oval, but is expected to be cleared to return at Docklands on Sunday.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-17/oil-processing-facility-manjimup-reduces-avocado-food-waste/105152972",
        "title": "Shocking scale of avocado waste inspires engineer's new venture",
        "publish_date": "Thu, 17 Apr 2025 01:08:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Avocados are a breakfast and brunch staple, with Australians consuming upwards of 4 kilograms each year on average.\n\nBut strict requirements from supermarkets, as well as picky consumers, leave hundreds of tonnes of the fruit wasted each year.\n\nIn the heart of Western Australia's avocado heartland, a local entrepreneur is hoping turn some of that waste around.\n\nThird-grade avocados are often left to rot. (ABC South West: Georgia Hargreaves)\n\nWith a background in engineering, Lawrence Cheng noticed how much produce was going to waste at the farm level because it was either undersized, damaged or discoloured.\n\n\"I was working previously as a tech advisor in precision agriculture. Every time I would go visit farms I would see a lot of waste,\" he said.\n\n\"I started asking the question, what could we do about this?\"\n\nDiverting unsellable fruit\n\nGenerally, avocados that do not meet market specifications are destined to either be left in the paddock or sent to landfill.\n\n\"[Avocados] are usually left on farm if it's not going to the fresh market — it could be disposed of in a manner they deem environmentally and economically feasible,\" Mr Cheng said.\n\nThe wasted produce is what inspired Mr Cheng to invest in opening an avocado oil processing plant at the start of 2024, to give local producers another option for tackling food waste.\n\nMr Cheng's avocado oil processing plant opens options for tackling food waste. (ABC South West: Kate Forrester)\n\nThe engineer's business is still in its early stages, but there has already been involvement from local growers in Manjimup, a food bowl region well known for its avocado production.\n\n\"We are working with packhouses in the region to divert fruit from landfill to be turned into extra virgin avocado oil,\" Mr Cheng said.\n\nThe facility, which was primarily self-funded, has already diverted more than 90 tonnes of waste into oil.\n\nIt is the first season avocado oil has been produced at Southern Forest Food Technology. (Supplied)\n\n\"We have a production facility that can process up to 2 tonnes of avocados per hour.\"\n\nManjimup orchardist Kirsty Fontanini runs a packing shed in the region, where local farmers send bulk fresh produce to be packaged and sent to market.\n\nKirsty Fontanini grows a wide variety of fruit at her family farm. (Supplied: Craig Kinder Photography)\n\nThis season she was able to send several tonnes of third-grade avocados to Mr Cheng's facility.\n\n\"It's adding value to something that is otherwise unsellable,\" Ms Fontanini said.\n\n\"It's great because otherwise we would have had to dump them.\"\n\nTackling the broader issue\n\nAustralia wastes 7.6 million tonnes of food annually, according to End Food Waste Australia.\n\nHouseholds are responsible for wasting the most at 32 per cent, with primary production the second highest contributor.\n\nFood waste occurs at every stage of the supply chain. (Supplied: End Food Waste)\n\nMr Cheng said he planned to use the facility to process and value-add to other wasted produce from the region in the future.\n\n\"It doesn't just have to do with avocados, it's whatever the region holds,\" he said.\n\n\"We have plenty of orchards here with plenty of fruit that we're keen to explore and partner with the different growers to see what's possible.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-17/government-blocks-noosa-affordable-housing-project/105183520",
        "title": "Concern as government scraps affordable housing project at Noosa",
        "publish_date": "Thu, 17 Apr 2025 00:19:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "One of Queensland's most expensive neighbourhoods has blocked an \"inappropriate\" affordable housing project intended to ease the shortage of homes.\n\nThe state government announced it will scrap a four-storey project in Tewantin, in the Noosa Shire, citing community concerns that it would destroy the character of the seaside town.\n\nNoosa Council had fiercely campaigned against the \"massively overscale development\", saying it was too tall and would ruin the \"low-key, leafy village feel\" of the suburb.\n\nThe proposal received 495 submissions from residents who claimed it would increase traffic and harm the visual identity of Noosa.\n\nThe project was a State Facilitated Development, a planning tool created by the former Labor government that makes it harder for neighbours to block affordable housing.\n\nIt was the first time the current Queensland government was able to cancel a State Facilitated Development (SFD) using new powers it gave itself in December.\n\nA 'concerning precedent'\n\nFiona Caniglia says Brisbane is not building social houses fast enough to meet its 2032 population projections. (ABC Radio Brisbane: Kenji Sato)\n\nHousing body Q Shelter chief executive Fiona Caniglia said it set a concerning precedent for similar affordable housing projects in Queensland.\n\nMs Caniglia said Queensland urgently needed to increase its housing supply in order to alleviate the affordability crisis.\n\n\"We cannot reach these targets if these vital projects are delayed or opposed,\" she said.\n\n\"Q Shelter is concerned that community opposition to planned social and affordable housing projects will become a material risk to the delivery of housing targets.\n\n\"The ongoing housing crisis is of a magnitude that warrants special powers for governments to act quickly and decisively to deliver a mix of housing, including affordable homes for people on lower incomes.\"\n\nJarrod Bleijie says Labor is trying to make up for a decade of housing policy failure. (ABC News: Victoria Pengilley)\n\nDeputy Premier Jarrod Bleijie said a second 196-unit SFD in Noosa Heads was under assessment.\n\nMr Bleijie said all future SFDs would be made to obey each council's rules and preferences around height and other criteria.\n\nSFDs were supposed to take the approvals process out of councils' hands, instead fast-tracking approvals through the state planning department.\n\n\"In keeping with our election commitment, the government will make sure that any SFD is compliant with the local planning scheme,\" Mr Bleijie said.\n\n\"The LNP is resetting the planning partnership with councils and local communities to ensure new housing opportunities are locally informed, unlike the former Labor government that steamrolled everyone with bad planning decisions driven out of Brisbane.\"\n\nDeveloper confidence shaken\n\nThe Noosa council says it wants future developments to meet community expectations. (ABC Sunshine Coast: Owen Jacques)\n\nBruce Bairstow, the developer behind the Tewantin project, said the process had been slow, frustrating and bureaucratic.\n\nMr Bairstow said he had spent more than $100,000 filling in paperwork and responding to the state government's requests for information.\n\nMr Bairstow said the state government's intervention would undermine the trust in the supposedly fast-tracked process.\n\nThe project would have been 25 per cent affordable rentals and key worker accommodation. (Supplied: Poinciana Blue)\n\n\"It's introducing a new sovereign risk to developers from the state government if we go down this pathway to get affordable housing delivered,\" Mr Bairstow said.\n\n\" We're stuck in no-man's land, trying to interpret something they haven't written the rules of the game for. \"\n\nHe said his project had faced a negative campaign from Noosa Council, local LNP member Sandy Bolton, and various Noosa community groups.\n\nA Noosa Council spokesperson said they wanted future developments to conform to the neighbourhood character and meet community expectations.\n\nHome owners oppose affordable housing project Photo shows A group of people outside a church A group of Wakerley residents is trying to prevent a local church from building 44 affordable housing units on its own land.\n\n\"Council established the Noosa Plan to provide a framework for development which seeks to maintain Noosa's low-key, leafy village feel,\" the spokesperson said.\n\n\"Noosa's planning scheme promotes development utilising a high design quality, incorporating low rise contemporary sub-tropical building and landscape design that emphasises the casual, outdoor lifestyle.\"\n\nAn Everybody's Home report found the Noosa Shire region was among the least affordable areas to rent in Australia.\n\nA CoreLogic report found in 2024 the median house price in Noosa Heads increased 17.1 per cent, exceeding $2 million.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-17/ping-pong-helping-those-living-with-parkinsons-disease/105181792",
        "title": "Ping pong helps people with Parkinson's disease 'feel and move better'",
        "publish_date": "Wed, 16 Apr 2025 23:51:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "Once a week, Bob Staff finds blessed relief from the pain and fatigue that has plagued him for the past seven years.\n\nLike thousands of Australians, the 83-year-old has Parkinson's disease.\n\nBut when he plays ping pong every Monday afternoon in a modest council hall, Mr Staff feels as if he were a younger man again.\n\n\"As you play it you forget about all your aches and pains,\" he said.\n\n\" You're just normal again. \"\n\nThat's because the hand-eye coordination and quick reaction time featured in racquet sports such as ping pong and pickleball are helpful in reducing the symptoms of Parkinson's disease.\n\nTrevor Chong is an associate professor in cognitive neuroscience at Monash University, and leads the Monash Cognitive Neurology Laboratory.\n\nTrevor Chong says the unique features of ping pong make it particularly effective as a form of Parkinson's disease therapy. (Supplied: Trevor Chong)\n\nHe said while many forms of exercise could help improve the symptoms of Parkinson's disease, the unique features of ping pong made it particularly effective.\n\nThe sport's focus on balance, hand-eye coordination and reaction time can reduce the tremors and rigidity commonly experienced by people with Parkinson's disease.\n\nThe quick thinking and strategic decision-making involved in playing ping pong can reduce the symptoms of cognitive impairment including difficulty with memory, language and spatial orientation.\n\n\"Last but not least, ping pong is an activity [that] often occurs in a group setting, and social interaction has been shown to significantly improve both cognition and mood,\" Dr Chong said.\n\n\" Ping pong can help improve many domains that are often affected in Parkinson's disease. \"\n\nPing Pong Parkinson\n\nMr Staff is one of more than 150,000 people living with Parkinson's disease in Australia, making it the country's second most common neurological disease after dementia.\n\nAnd as the population ages, it is becoming increasingly common.\n\nAccording to the World Health Organisation, Parkinson's disease is the world's fastest-growing neurological disorder.\n\nSporting groups for people living with Parkinson's disease have developed to help alleviate the symptoms of the disease through exercise. (ABC Wide Bay: James Taylor)\n\nA Parkinson's Australia report estimates the number of people with the disease will triple over the next 25 years.\n\nHelen Halford is the Australian coordinator for Ping Pong Parkinson, an international organisation promoting the sport as a form of therapy for the disease.\n\nIt has more than 300 branches in 25 countries around the world, with the first Australian chapter opening last year in Hervey Bay, 300 kilometres north of Brisbane.\n\nMs Halford said the physical and mental health of the eight regular members, including Mr Staff, had improved since they took up a racquet.\n\nHelen Halford is the Australian coordinator for Ping Pong Parkinson. (ABC Wide Bay: James Taylor)\n\n\"I've had people telling me that they're feeling better and moving better,\" she said.\n\n\" The tremor goes away and their movement is fluid again … it's all really lovely and flowing. \"\n\n'Fills my heart with joy'\n\nMr Staff's son Robby said his father had become rejuvenated after joining the group.\n\nRobby Staff (right) with his father Bob (left) and Ping Pong Parkinson founder Nenad Bach (middle). (ABC Wide Bay: James Taylor)\n\n\"It's incredibly invaluable as a social activity and also a physical activity and just an enthusiasm for life,\" he said.\n\n\" It's absolutely holistic, I think there's a lot going on with it that's benefiting the participants. Not every medicine comes as a pill. \"\n\nPing Pong Parkinson founder Nenad Bach started the organisation in 2017 after being diagnosed.\n\nHe said he felt buoyed after a visit to the Hervey Bay chapter.\n\nNenad Bach founded Ping Pong Parkinson after he found the sport gave him relief from his Parkinson's disease symptoms. (ABC Wide Bay: James Taylor)\n\n\"When you put people in this room … you can't take the smile off the face,\" he said.\n\n\"It changes their life and for me, it fills my heart with joy.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-17/buffy-actor-michelle-trachtenberg-died-complications-diabetes/105186420",
        "title": "Medical examiner says Michelle Trachtenberg died of diabetes complications",
        "publish_date": "Wed, 16 Apr 2025 22:36:54 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Actor Michelle Trachtenberg died as a result of complications from diabetes, New York City's medical examiner said Wednesday local time.\n\nThe office said in a statement that it amended the cause and manner of death for the 39-year-old following a review of laboratory test results.\n\nTrachtenberg, who was known for her roles in Gossip Girl and Buffy the Vampire Slayer, was found unconscious and unresponsive in her luxury apartment tower in Manhattan in February.\n\nParamedics pronounced her dead at the scene.\n\nFormer Gossip Girl and Buffy star Michelle Trachtenberg dead at 39 Photo shows Actor Michelle Trachtenberg dressed in black at a Gala Michelle Trachtenberg, who is known for her roles in Gossip Girl and Buffy the Vampire Slayer, has died at 39.\n\nOfficials said at the time that no foul play was suspected, and the medical examiner's office had listed her death as \"undetermined\".\n\nTrachtenberg’s family had objected to an autopsy, which the medical examiner's office honoured because there was no evidence of criminality.\n\nHer representative didn't immediately respond to an email seeking comment Wednesday, the Associated Press said.\n\nTrachtenberg was found unconscious and unresponsive in her luxury apartment tower in Manhattan in February. (Reuters: Mario Anzuoni)\n\nSarah Michelle Gellar, Taylor Momsen and Blake Lively were among the celebrities who mourned Trachtenberg when her death was announced on February 26.\n\n\"She was fiercely loyal to her friends and brave for those she loved, she was big and bold and distinctively herself,\" Lively wrote on social media.\n\n\" The world lost a deeply sensitive and good person in Michelle. \"\n\nThe daughter of Jewish immigrants, Trachtenberg began her acting career at the age of three in commercials before starring in Nickelodeon series The Adventures of Pete & Pete.\n\nLoading...\n\nMichelle earned her big break at the age of 10 with her title role in hit movie Harriet the Spy, an American coming of age comedy film.\n\nIn 2000, Trachtenberg joined the cast of Buffy, playing Dawn Summers, the younger sister of the title character played by Sarah Michelle Gellar between 2000 and 2003.\n\nThe actress went on to play different recurring roles in Weeds, Six Feet Under and Gossip Girl, where she portrayed Georgina Sparks, a socialite who causes chaos throughout the show.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-17/shein-temu-to-get-pricier-as-trump-cracks-down-on-cheap-imports/105186260",
        "title": "Shein, Temu to get pricier as Trump cracks down on cheap imports",
        "publish_date": "Wed, 16 Apr 2025 22:26:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Chinese e-marketplace Temu and fast-fashion retailer Shein will raise prices next week as US President Donald Trump's sweeping tariffs and crackdown on low-value imports push up costs for the companies known for their budget offerings.\n\nIn nearly identical letters to customers this week, the two companies said they will be increasing prices starting April 25 and encouraged shoppers to purchase \"now at today's rates\".\n\nShein and Temu, sellers of everything from toys to smartphones, had grown rapidly in the US thanks in part to the \"de minimis\" exemption that allowed duty-free entry for merchandise priced below US$800 ($1255), enabling the companies to keep prices low.\n\nLoading...\n\nHowever, their business model has come under pressure from a recent executive order signed by Mr Trump that closes the trade loophole and goes into effect on May 2.\n\n\"Due to recent changes in global trade rules and tariffs, our operating expenses have gone up. To keep offering the products you love without compromising on quality, we will be making price adjustments starting April 25, 2025,\" the statements from both companies said.\n\nShein dresses are currently priced between $9 and $143 on its website, while Temu sells them at anywhere between $3.89 and $330 online.\n\n'Shein villages' hit hard by tariffs\n\nThe rapid rise of ultra-fast-fashion retailer Shein has been so key to the fortunes of a group of urban villages on the outskirts of China's southern metropolis of Guangzhou that they have been colloquially dubbed \"Shein villages\".\n\n'Going to China with an empty suitcase': US shoppers swap tips to beat tariffs Photo shows wokers on production line Chinese factories are trying to sell directly to American consumers on social media platforms in a bid to bypass the 145 per cent tariff hike imposed by Donald Trump.\n\nOn a recent visit to Shein villages in Panyu District, however, the mood was glum.\n\nThree factory bosses along with four local downstream suppliers said Shein's local orders were in decline, pointing the finger at moves to diversify production to Vietnam.\n\nFactory owner Mr Li has been in business since 2006, manufacturing apparel for both the Chinese and international markets.\n\nHe has been working with Shein for five years and says orders from the firm this year have dropped by 50 per cent as more orders have moved to Vietnam.\n\n\"The impact is quite obvious,\" he said.\n\n\" Tariffs are not something that we can see an end to for the time being, and we don't know what will happen next. \"\n\nA move to source more from Vietnam could help Shein to continue sending goods to the US at lower tariff rates or without import duties at all for packages sent under de minimis — though there is no guarantee the threshold will remain in place for goods sent from Vietnam.\n\nBut it also creates a Catch-22 situation for the company — a potentially costly and time-consuming one in an industry in which price and time are essential.\n\n\"The diversification of its sourcing base and a significant change in its business model will have to go hand-in-hand for Shein,\" said Sheng Lu, professor of fashion and apparel studies at the University of Delaware.\n\nWithout fundamentally changing the business model of pumping out thousands of new styles in small batches and shipping them quickly to end consumers, Shein can't diversify its supply chain, and without diversifying the supply chain away from South China, it can no longer ship products direct to US consumers at low, tariff-free prices, Professor Lu said.\n\nGo to Vietnam or go bankrupt\n\nAlison Layfield, is director of product development at ePost Global, which helps businesses manage cross-border shipping and customs challenges.\n\n\"The model is really genius when you think about it … but to move that whole business model, that's going to definitely put a hiccup in their turnaround times and their costs,\" she said.\n\n\" Of course they will want to pass those costs onto consumers but … then consumers are not going to be ordering at the quantity and the price point that they have in the past. \"\n\nFor Shein and Temu, cost and timing are essential. (AP: Richard Drew)\n\nFor Mr Li, the factory owner, the capital investment involved in a move to Vietnam, combined with what he said was less productive labour there compared with China, makes it an unappealing choice.\n\n\"Here we can finish 1,000 pieces of clothing in one day, there it takes a month,\" he said.\n\nWhile he plans to lean more heavily on his factory supplying the domestic market, Mr Li said for some of his compatriots there was little option left.\n\n\"They have only two choices. One is to go bankrupt, and the other is to go to Vietnam.\"\n\nLoading YouTube content\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-17/arsenal-real-madrid-champions-league-semi-finals/105186316",
        "title": "Arsenal run riot against Real Madrid to storm into Champions League semi-finals",
        "publish_date": "Wed, 16 Apr 2025 22:16:55 +0000",
        "category": "sports",
        "authors": [],
        "text": "Arsenal snuffed out any chance of a famous Real Madrid comeback to reach the Champions League semi-finals after a 2-1 victory in the Bernabeu Stadium completed a 5-1 aggregate win on Wednesday.\n\nHolders and 15-times winners Real never looked like clawing back a 3-0 deficit from last week's quarter-final first leg and when Bukayo Saka scored for the visitors in the 65th minute their fate was effectively sealed.\n\nVinicius Junior seized on a rare defensive slip a couple of minutes later to rouse the home crowd, but it proved too little too late as Carlo Ancelotti's side exited in feeble fashion.\n\nArsenal's superiority over the two legs was underlined in stoppage time as Gabriel Martinelli burst through to score.\n\nThey will face Paris St Germain in their first Champions League semi-final since 2009.\n\n\"I think it's such a special night for this club, it's a historic night for this club,\" said Arsenal's Declan Rice, whose two sublime free kicks last week put his side in control.\n\n\"There was a lot of talk coming in about them coming back from the dead, they've done it so many times before. But we had so much belief and confidence from that first leg that we had enough to come here and win the game.\"\n\nA cacophony of noise greeted kickoff with the home fans fuelled by the hope of witnessing what would have been one of the greatest Champions League comebacks.\n\nThey were silenced almost immediately though as Arsenal were handed the opportunity to kill the tie when Raul Asencio needlessly hauled down Mikel Merino from a corner and referee Francois Letexier eventually awarded a penalty after checking a pitch-side VAR monitor.\n\nSaka opted for a Panenka-style chipped penalty though and Real keeper Thibaut Courtois clawed away the ball.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nIt looked like a potentially pivotal moment and when Letexier pointed to the penalty spot at the other end after Kylian Mbappe tumbled under minimal contact from Declan Rice, Arsenal's night looked like taking a turn for the worse.\n\nAfter five painstaking minutes, however, Letexier was again invited by VAR to view the monitor and to a chorus of whistles from the home fans, overturned his original decision.\n\nThat scare aside, Arsenal coped easily with Real Madrid's famed frontline who were given little to work with.\n\nArsenal keeper David Raya was not required to make a save before halftime as Real's predilection for hopeful crosses into the area proved easy pickings for the visiting defence.\n\nReal's Mbappe barely had a sniff of a chance as Arsenal showed great control and Saka made up for his first-half miss with a clinical finish after being sent clear.\n\nWilliam Saliba gifted Real a lifeline when he was caught in possession on the edge of his area, allowing Vinicius to score, but there was never any sense of panic in the visiting ranks.\n\nMartinelli then put the icing on the cake in added time, to send the Arsenal fans into raptures.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-17/ipl-delhi-capitals-vs-rajasthan-royals-mitchell-starc-stars/105186394",
        "title": "Starc yorkers help Capitals force a super over win in intense IPL clash",
        "publish_date": "Wed, 16 Apr 2025 22:09:01 +0000",
        "category": "sports",
        "authors": [],
        "text": "Mitchell Starc inspired table-toppers Delhi Capitals to a tense victory in the super over against Rajasthan Royals in the Indian Premier League overnight.\n\nStarc forced the game into the super over with a brilliant eight-run 20th over as Rajasthan finished at 4-188 in reply to Delhi's 5-188.\n\nTwo run-outs in Starc's super over limited Rajasthan to 2-11 before Lokesh Rahul and Tristan Stubbs smashed Sandeep Sharma's first four balls for 13 runs and took Delhi to top of the points table with five wins from six games.\n\nRajasthan has plenty to catch-up as they dropped to number eight with just two wins from seven games.\n\nRajasthan seemed to have controlled the chase until Starc nailed a perfect yorker to half century-maker Nitish Rana (51) in the 18th over and had the left-hander plumb leg before wicket.\n\nStarc bowled four more yorkers in the final over and with two needed on the final ball, Dhruv Jurel drove Starc to mid-wicket but got run out while going for the winning run.\n\nRajasthan had an injury scare when their captain, Sanju Samson, walked off with a side strain after he had provided a brisk start with Yashasvi Jaiswal (51).\n\nSamson clutched his left side in pain after hitting three sixes and two boundaries in his 19-ball knock of 31 balls as he walked off in the sixth over with Rajasthan cruising to 0-61.\n\nDelhi captain Axar Patel finally got his first wicket of the season when he clean bowled Riyan Parag for 12 and Jaiswal holed out at long-on soon after completing his third half century of the season.\n\nPatel should have dismissed Rana on 20 in the 15th over but Stubbs dropped a sitter at long-on before Rana eased the target by smashing Kuldeep Yadav for a six and a four in the next over.\n\nHowever, Starc turned the tide in his return spell with flurry of yorkers and pushed the game into the super over.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nOpening batter Abishek Porel smashed fast bowler Tushar Deshpande for four boundaries and a six in the second over but Jake Fraser-McGurk's poor season continued when he holed out in Jofra Archer's second over after scoring nine off six balls.\n\nRahul and Porel put on 63 runs off 57 balls, but the slowness of the wicket didn't allow them to accelerate against either spin or pace.\n\nRahul was eventually dismissed in the 13th over when he pulled Archer to mid-wicket where Shimron Hetmyer took a good low catch and Porel got dismissed by Wanindu Hasaranga when he holed out at long-off after scoring 49 off 37 balls as Delhi slipped to 4-105.\n\nBut Patel and Stubbs provided late flurry by contributing 34 runs each. Axar countercharged against Hasaranga and smashed 34 off 14 balls while Stubbs, dropped on 18 off Hasaranga, consumed 18 balls for his unbeaten 34 as the last three overs provided Delhi 42 runs.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-17/outback-tourism-providers-desperate-for-visitors/105174444",
        "title": "Tourism plea as Queensland's rain creates 'brilliant' outback landscapes",
        "publish_date": "Wed, 16 Apr 2025 21:28:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Outback Queensland tourism providers are desperate for visitors to return to the region, after record-breaking floods struck some — but not all — communities.\n\nTourism providers have told the ABC that there have been widespread cancellations across the west, even in towns which didn't experience last month's devastating flooding.\n\nApril is traditionally the start of the outback tourist season, but the chief executive officer of Longreach's Stockman's Hall of Fame said he had seen cancellations as far ahead as July.\n\nLloyd Mills says there's been a number of cancellations this month. (ABC Western Queensland: Damien Larkins)\n\n\"This is coming off the back of six months of summer, where we do very little trade,\" Lloyd Mills said.\n\n\" It's the bakeries, the pubs, the small stores that will really feel this … it's been devastating. \"\n\nMr Mills said many tourists believed that roads were closed to the outback, but many had reopened.\n\nOutback Queensland is looking green after rain. (ABC Western Qld: Hannah Walsh )\n\n\"There's no need to postpone your trip, get on the road and get out here,\" he said.\n\nLydia Evert, who runs Winton's historic Royal Open-Air Cinema, said ticket sales had dropped off significantly compared to this time last year.\n\n\"We're lacking numbers, please keep coming and supporting us because we need this season to be successful,\" Ms Evert said.\n\nShe urged tourists to take advantage of extra accommodation made available since the cancellations.\n\nWinton's historic open air cinema has seen a slow start to the tourist season. (ABC Western Qld: Hannah Walsh )\n\nThat's exactly what Perth travellers Charlotte Jorgensen and Karsten Jensen did when their road trip plans were up-ended by the floods.\n\nRather than follow their original route, they stayed in Winton for four nights and urged other travellers to be flexible with their plans.\n\nMs Jorgensen said she'd expected to see a lot of red dust, but instead was shocked to see \"green everywhere\" and an abundance of birdlife now the rain had cleared.\n\n\"We're very lucky because it never looks like that,\" she said.\n\nCharlotte Jorgensen and Karsten Jensen have been surprised by the outback. (ABC Western Qld: Julia Andre )\n\nKaren Ticehurst, a business owner at Cunnamulla in south-west Queensland where it has been \"absolutely dead for about three weeks\", agreed.\n\n\"There are going to be wildflowers everywhere and lots of birds too — it's going to be brilliant,\" the Cunnamulla Caravan Park owner said.\n\nBringing tourists back\n\nWhile much of the outback is ready for visitors now, towns like Thargomindah and Adavale are still cleaning up from the floods but will need tourists as soon as they're open.\n\n\"We'd love to see you again, please re-book because I think it's going to be the most beautiful spring we've ever seen,\" Bulloo Shire Council Tourism Coordinator Danielle Tuit said.\n\nThe Queensland government estimated about 1 million people visited outback Queensland in 2024 and spent a total $791 million.\n\nOutback tourism operators say they're seeing a slow start to the season. (Supplied: Boulia Camel Races)\n\nThe chief executive of the Outback Queensland Tourism Association said she was hopeful tourists would want to experience the outback in full bloom after the rain had eased.\n\n\"We are ready to accept tourist in 90 per cent of our regions,\" Denise Brown said.\n\nShe said it may also be about re-imagining a holiday out west.\n\nRecent rain is turning parts of outback Queensland green. (Supplied: OBE Organic )\n\n\"The outback is not seen as a short break opportunity but if we get some good fares, we can encourage people to come out for four or six days, rent a car and drive around,\" she said.\n\nThe state government has renewed funding for the Outback Education Program, which offered financial incentives for schoolchildren to visit the outback.\n\nTourism Minister Andrew Powell said he was considering other ways he could assist to attract tourists back to the west.\n\n\"First and foremost, we want to get the tourists back,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-17/mary-fowler-suffers-ruptured-acl-for-manchester-city/105186244",
        "title": "Worst fears confirmed for Matildas star Mary Fowler after knee injury",
        "publish_date": "Wed, 16 Apr 2025 21:27:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "Matildas star Mary Fowler has ruptured her anterior cruciate ligament (ACL) and is in a race against time to play in next year's home Asian Cup.\n\nManchester City had been hopeful the brilliant winger had avoided the dreaded injury, suffered when she appeared to wrench her right knee while overstretching for the ball on Sunday.\n\nThe injury forced Fowler out of the FA Cup semi final against Manchester United, which City ultimately lost 2-0.\n\nCity interim manager Nick Cushing had admitted it \"doesn't look great imminently\" but said City were \"not fearing the worst.\"\n\nBut scans confirmed the 22-year-old had suffered the dreaded injury, which means a full knee reconstruction.\n\n\"Manchester City can confirm Mary Fowler has suffered a rupture to her anterior cruciate ligament,\" City said in a statement.\n\n\"Mary will remain under the care of the club's medical team and start her rehabilitation.\n\n\"Everyone at City wishes Mary all the best on a full and speedy recovery.\"\n\nIt will likely rule Fowler out for close to a year, in a hammer blow to Australia's hopes next March of winning the Women's Asian Cup for the first time since 2010.\n\nThe attacker has been in dynamic form for City, scoring 10 goals across all competitions, and underlined her ability with a starring role in Australia's friendlies against South Korea earlier this month.\n\n\"I'm really disappointed to be facing some time out of the game,\" Fowler said.\n\n\"It's never easy when something like this happens especially when you've been working so hard and feeling good.\n\n\"The road ahead will be challenging, but I'm ready to take it on.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\n\"There's still so much I want to achieve, and I'll be using this time to grow in every way I can.\n\n\"I'm committed to doing the work, staying positive and coming back better than ever.\"\n\nFowler's injury also means the new Matildas coach, widely expected to be current Lyon boss Joe Montemurro, will be unable to call on her early in their tenure.\n\n\"Everyone in the Matildas and Football Australia family — players, coaches, and support staff — will be right behind Mary as she takes the first steps toward her comeback,\" interim coach Tom Sermanni said.\n\nLosing Fowler also piles more pressure on Arsenal star Caitlin Foord to be Australia's main attacking threat.\n\nThe Matildas are still without skipper Sam Kerr, who suffered the second ruptured ACL of her career during a training camp with Chelsea in January 2024.\n\nKerr, who joined her Matildas teammates in camp this month, is still considered several weeks away from playing.\n\n\"It's difficult to put a timeframe on it,\" Chelsea coach Sonia Bompastor said on the weekend.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-17/asx-markets-business-live-news-april-17-2025/105186234",
        "title": "Live: Australia's unemployment rate rose to 4.1pc in March",
        "publish_date": "Wed, 16 Apr 2025 21:24:16 +0000",
        "category": "finance",
        "authors": [
            "Emilia Terzon",
            "Stephanie Chalmers",
            "Nadia Daly",
            "Michael Janda",
            "Angela Lavoipierre"
        ],
        "text": "Could the RBA go for a middle ground cut by 0.35% and get the rate back to \"round\" numbers? - Moomy\n\nMany of us would like it to Moomy, but I don't think the RBA is in a hurry to 'normalise' the cash rate back to more round quarter-percentage-point increments.\n\nFor those who don't know the background behind this discussion, the cash rate currently sits at 4.1%, after the RBA cut it to a low of 0.1% during the pandemic.\n\nNormally, the RBA moves in increments of 0.25 percentage points, sometimes 0.5 and very occasionally by a full percentage point (such as during the global financial crisis).\n\nHowever, it did not take the chance while raising rates to even up the ledger, and former governor Philip Lowe dismissed as somewhat ridiculous suggestions that it should.\n\nI'm not sure Michele Bullock has a different attitude.\n\nAlso, while the cash rate target is a slightly weird number, the interest rate on exchange settlement balances is an even 4%.\n\nThe two rates used to be set at the same level, but after COVID the RBA decided a lower exchange settlement rate was better to effectively implement monetary policy.\n\n\"The Reserve Bank currently pays an interest rate on ES balances that is 0.1 percentage points below the cash rate target. Banks have an incentive to deposit as little as possible at this rate, and instead prefer to earn the higher cash rate by lending out their balances,\" the RBA notes in this explainer. \"The Reserve Bank is also willing to lend ES balances to banks if this is required. The interest rate on these loans is 0.25 percentage points above the cash rate target. Banks have an incentive to borrow as little as possible at this rate, and instead prefer to borrow at the lower cash rate in the market.\"\n\nIn short, I think we may have to keep getting our heads around a slightly odd cash rate number for a bit longer.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-17/sydney-royal-easter-show-presidents-medal-tathra-oysters/105178206",
        "title": "Oyster grower claims Australia's most prestigious food prize",
        "publish_date": "Wed, 16 Apr 2025 21:19:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "The first winner of what is regarded as one of the most prestigious food awards in the country has claimed it for a second time, almost two decades later.\n\nTathra Oysters has been awarded the 18th annual Royal Agricultural Society of NSW President's Medal at the Sydney Royal Easter Show.\n\nIt's not only a shot in the arm for the business, but also for the oyster industry on the NSW South Coast which has suffered through bushfires, flood, emergencies and even an ex-tropical cyclone.\n\nRecovery from the 2018 bushfire in Tathra was slow, and a decline in tourism after disasters often affects oyster growers. (ABC News: Greg Nelson)\n\nTown hit by fires\n\nTathra Oysters operates on 20 hectares in Nelson Lake in the middle of Mimosa Rocks National Park.\n\nThe town is a jewel in the region's crown, but a disastrous fire in 2018 destroyed 65 homes.\n\nRebuilding was slow, tourism faded and recovery for Tathra Oysters was made harder by another fire in 2020 that polluted the surrounding coastline and forced the closure of the oyster lease.\n\nTathra Oysters are grown in Nelsons Lake in the middle of Mimosa Rocks National Park. (Supplied: RAS)\n\nGary Rodely, the owner and manager of Tathra Oysters, spoke with the ABC prior to the awards about his family's 36-year legacy of oyster farming.\n\nIn 2005, they won the inaugural President's Medal.\n\n\"Back then the $10,000 [prize] was a big part of our income that year,\" he said.\n\nMr Rodely said the business had grown off the back of that early recognition and now produced close to a million oysters a year.\n\nTathra produces Sydney rock oysters on the far south coast of NSW. (Supplied: RAS)\n\nThe solar-powered farm also produces up to 10 million juvenile oysters for other farmers to grow, has a shopfront in Tathra and supplies oysters direct to the Sydney restaurant market.\n\n\"Now we have the ability to employ lots of staff, pay good wages and contribute money into the town,\" Mr Rodely said.\n\nMr Rodely's son Sam, now a marine biologist, has returned to the family business as the time approaches for Mr Rodely and his wife Jo to hand over the family business.\n\n\"We're getting towards the twilight of our career,\" Mr Rodely said.\n\n\"He's taken the business to places we couldn't imagine.\n\n\"We're very proud our son Sam has the same passion for it and for Nelson Lake.\"\n\nTough competition to win\n\nSam, Jo, and Gary Rodely from Tathra Oysters grow Sydney Rock Oysters at Nelsons Lagoon. (Supplied: Dave Rogers)\n\nTo qualify for the Royal Agricultural Society of NSW (RAS) President's Medal, producers must have been champions in the previous year's Sydney Royal Wine, Dairy or Fine Food shows.\n\nTathra Oysters was up against seven other finalists in produce as diverse as olives, pork and gin.\n\nJudge Simon Marnie said the competition was one of a kind.\n\n\"It's the only one in Australia that allows us to judge a pork producer against a dairy or beer producer,\" he said.\n\nThe producers are judged not only on their product, but the overall integrity of their production practices, including environmental, economic and social sustainability.\n\nHard times for oyster growers\n\nWinning this competition is recognition as well for the oyster industry in NSW, which has had an especially difficult few years.\n\nThere are more 2,000 oyster leases in the state, but many have been shut for long periods in recent years due to disease outbreaks, floods, fires, blue algal blooms and other forms of contamination.\n\nOysters are like the canary in the coal mine.\n\nThey are often the first indicator of a problem because they filter the water and are very sensitive to changes.\n\nLeases are closed for safety when water testing shows concerns following flood, fire or contamination.\n\nWidespread flooding in coastal areas of NSW in 2021 shut down many areas and in 2023 floods closed 60 per cent of the oyster growing just before Christmas and the peak selling season.\n\nIn 2022 the Port Stephens oyster industry was shut down due to an outbreak of deadly QX disease, which affects Sydney Rock oysters.\n\nFour oyster businesses never recovered from that outbreak.\n\nIn 2024, a massive grain spill in the Shoalhaven River triggered a blue-green algae outbreak that shut the oyster industry there.\n\nMr Rodely said oyster growers were the stewards of coastal areas.\n\n\"Here we are with farms on the eastern seaboard of Australia where everyone wants to live, so these are environments under pressure,\" he said.\n\n\"You've got oyster farmers are eking out a living in these environments, so if anything goes wrong they've got their finger on the pulse, and that resonates with the values of this award.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-17/perth-rent-prices-australia-second-most-expensive/105183136",
        "title": "As Perth rents soar, Melbourne's are staying more affordable. Why?",
        "publish_date": "Wed, 16 Apr 2025 21:16:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Times are definitely tough for WA renters.\n\nThose in Perth are facing a level of growth that has seen it go from being the country's most affordable capital to rent in, to the second-most expensive in just five years.\n\nAccording to the latest market insight report from property advertising platform REA Group, the median weekly rent for a house in Perth is now $700.\n\nPerth is now Australia's second-most expensive capital city to rent in. (ABC News: Nic MacBean)\n\nThat is 7.1 per cent more than 12 months ago, marking the biggest growth among the country's capital cities.\n\nThe growth in rent for units has been even bigger, with the median rent for a unit in Perth up 8.3 per cent from last year to $650.\n\nREA Group Senior Economist Anne Flaherty said the change was \"astonishing\".\n\nAnne Flaherty says Perth was the most affordable capital city to rent in five years ago but is now the second most expensive, behind Sydney. (Supplied)\n\n\"Five years ago, Perth was actually the most affordable capital city to rent in,\" she said.\n\n\"It's now the second most expensive, behind only Sydney, and what we've seen is that there's been very strong population growth across Perth, but the rate at which we've been building homes is nowhere near keeping up with that.\n\n\" Building capacity is facing some massive constraints, and in the Perth market it's especially the unit sector that's facing really significant cost barriers to more development. \"\n\nMs Flaherty said engineering costs, complex materials and labour shortages in WA, due to the mining sector's higher wages, all contributed to the issue.\n\nHome opens for rental properties around Perth are drawing massive queues. (ABC News: Gian De Poloni)\n\n\"The reality is that for a lot of apartment projects, unless they're being sold at a very, very high price, they're not currently feasible,\" she said\n\nNot enough construction\n\nIn terms of total dwellings — houses and units combined — the median rent for Perth is at $680, $70 a week less than Sydney's $750.\n\nOn the other end of the scale sits Melbourne, with median rent for dwellings there now at $575.\n\n\"Melbourne is the second-fastest growing capital city in percentage terms, behind Perth,\" Ms Flaherty said.\n\nMelbourne has done a better job of keeping up to speed with dwelling construction, according to Ms Flaherty. (Unsplash: Pat Whelen)\n\n\"But in Victoria, they've been relatively better at building enough homes to accommodate population growth.\n\n\"They're still falling short, but the shortfall is worse in Western Australia than it is in any other state.\"\n\nThe state's growing population is obviously not confined to Perth, with regional WA the most expensive for rentals across the country, according to REA Group's latest report.\n\nRenting 'in a bad way'\n\nFor Yvonne Larsen, who moved to Australia in 2004 from Norway, the country's relationship with renting has been hard for her to comprehend.\n\nYvonne Larsen says there is a different culture around renting in Norway. (Supplied)\n\n\"How you rent here is absolutely amazing, in a bad way,\" the 50-year-old said.\n\n\"I understand it's different in culture, I find that people who rent here are not really making a rental a home.\n\nThe postcodes where rent takes half your pay cheque Photo shows Gold Coast renters Jazlyn, Melanie and Nahla Misuraca smiling at the camera These are the nation's worst postcodes for renters, as well as the places hit with the biggest rent hikes since the pandemic.\n\n\"In Norway it's completely different — you take care of the place, you're allowed to make modifications.\"\n\nAnd unlike the Australian home ownership dream, she said in Norway renting for life was common.\n\nThe increasing cost and dwindling supply of rentals in Perth has had a massive impact on her life.\n\n\"I had to let go of my kids nearly two years ago now, and ask them to live with their dad because we couldn't find a rental, me and my partner,\" she said.\n\n\"So we had to move into his old childhood room for 12 months, and we were just lucky that a friend of mine, whose partner has got a rental, said we could rent his house.\"\n\nUnattainable dream\n\nMichael Reeve-Fowkes and his wife have been renting in Wellard, a suburb about 35 kilometres south of Perth, for seven years.\n\nWhile their rent has increased, it has been well below the market average.\n\nThe rent on their house has gone from $295 a week in 2018 to $425 — a level he believes has been down to the landlord resisting suggested increases from his real estate company.\n\n\"I've seen on a number of occasions they'll (real estate company) send through something about increasing the rent, and then suddenly we'll get an email from the agency saying they've revoked that,\" he said.\n\nWellard is a growing suburb about 35 kilometres south of Perth. (Supplied: Google Maps)\n\n\"So I suspect that the landlord was actually pushing back.\"\n\nMr Reeve-Fowkes, an anaesthetic technician, said he knew he was \"lucky\" when he spoke to friends and colleagues.\n\nBut he said the commute for he and his wife, who both work at hospitals in either Perth or Fremantle, was not ideal.\n\nData shows chasm between rent and income Exclusive new data shows skyrocketing rents have outpaced income growth in every regional area in Australia and all but one capital city.\n\n\"I would absolutely much rather be living much closer (to work), especially if I'm called in the middle of the night for something … like a patient who's bleeding out,\" he said.\n\n\"You don't want to be stuck in traffic trying to get there in a hurry.\n\n\"But if we were to move closer to work to reduce our commute we'd easily double or more our rent.\"\n\nAnd he said while the pair hoped to attain home ownership one day, legal fees from a divorce had left him with huge amounts of debt.\n\n\"Every time we manage to make a chunk out of that (debt) disappear, we will then look at the housing market again and we've fallen behind,\" he said.\n\n\"For every $10,000 we pay off it feels like the market's gone up 1$100,000 … we're just not keeping up.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/federal-election-2025-live-updates-treasurer-claims-second-debate-a-decisive-win-for-pm-labor-slams-dutton-s-comments-on-russia-indonesia-military-plans-20250416-p5lsa6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Treasurer claims second debate a ‘decisive win’ for PM; McKenzie apologises over China, Russia comments",
        "publish_date": "Thu, 17 Apr 2025 11:56:56 +1000",
        "category": "finance",
        "authors": [
            "Michaela Whitbourn"
        ],
        "text": "The unemployment rate rose to 4.1 per cent in March as the number of employed people grew by less than expected.\n\nFresh data from the Australian Bureau of Statistics (ABS) today showed the number of employed people jumped by 32,000 last month, slightly below consensus expectations for a 40,000 rebound, but partly making up for a fall of 52,800 in February.\n\nLoading\n\nEagle-eyed readers might recall the unemployment rate reading came in at 4.1 per cent in February. However, the ABS revised down the unemployment rate for that month to 4 per cent in its latest release.\n\nThe number of unemployed people grew by 3000 people in March, as the participation rate – the share of working-age people working or looking for a job – rose from 66.7 per cent to 66.8 per cent.\n\nHowever, the annual rate of employment growth over the past 12 months remaining slightly higher than the 20-year pre-pandemic average.\n\nMonthly hours worked decreased by 0.3 per cent, falling for the second month in a row, despite the growth in employment this month.\n\nABS head of labour statistics Sean Crick said this was due to a higher than usual number of people reporting working reduced hours this month due to bad weather, coinciding with ex-tropical cyclone Alfred and other major weather events in NSW and Queensland.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/where-to-dine-in-st-kilda-balaclava-windsor-prahran-and-surrounds-20250410-p5lqu6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Where to dine in St Kilda, Balaclava, Windsor, Prahran and surrounds",
        "publish_date": "Thu, 17 Apr 2025 11:47:19 +1000",
        "category": "finance",
        "authors": [],
        "text": "Collection\n\nWhere to dine in St Kilda, Balaclava, Windsor, Prahran and surrounds\n\nFrom hatted restaurants with sea views to buzzy Italian trattorias, these are Good Food’s picks for dining out around bayside Melbourne.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/vic-good-food-guide/saigon-street-eats-20250417-p5lshs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Saigon Street Eats",
        "publish_date": "Thu, 17 Apr 2025 11:42:21 +1000",
        "category": "finance",
        "authors": [
            "Dani Valent"
        ],
        "text": "1 / 3 Panko-crumbed eggplant bao at Saigon Street Eats. Kristoffer Paulsen 2 / 3 Assorted dishes at Saigon Street Eats. Kristoffer Paulsen 3 / 3 Trouper manager Rachel Bradley and Saigon Street Eats’ Kim Le Tet. Penny Stephens Previous Slide Next Slide\n\nVietnamese$$$$\n\nIn St Kilda, local favourite Saigon Street Eats has bunked in with Trouper cafe after operating out of a nearby Carlisle Street shopfront for over 10 years. The Chapel Street corner premises now serves coffee in the morning, then morphs into a Vietnamese restaurant for lunch and dinner. At 11.30am, the milk cartons are put away, teaspoons are replaced with chopsticks, and customers come for pho instead of a flat white.\n\nBut the upbeat feeling remains at this Vietnamese canteen, always bustling with soup slurpers, spring roll munchers and busy folks grabbing takeaway. Slow-simmered pho is made to an old family recipe, but there’s a keen eye on innovation in dishes like the panko-crumbed eggplant bao and salt-and-pepper tofu banh mi – both vegan and rocking with flavour.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/fyre-festival-2-postponed-with-no-new-date-set-20250417-p5lsf1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fyre Festival 2 postponed with no new date set",
        "publish_date": "Thu, 17 Apr 2025 11:41:03 +1000",
        "category": "finance",
        "authors": [
            "Nell Geraets"
        ],
        "text": "It seems the second time may not be the charm for the Fyre Festival.\n\nThe sequel to the notorious event was announced amid a burst of publicity in February, but its future remains in doubt after organisers shared – and shortly deleted – an announcement stating it was postponed.\n\nFyre 2 was scheduled for May 30 to June 2 at Mexico’s Isla Mujeres. It was promoted as a follow-up to the original Fyre Festival, which was cancelled in 2017 after a string of bungles, including ramshackle tents and a lack of bathrooms.\n\nThe first Fyre Festival was a mess of ramshackle tents and cold cheese sandwiches.\n\nAccording to US outlet ABC News, an announcement on the event’s website on Wednesday (US time), said it “has been postponed and a new date will be announced”. Ticket holders were told refunds had been issued, and that they could repurchase tickets once a new date had been announced.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/why-these-three-words-might-be-the-most-beautiful-cliche-in-footy-20250415-p5lrto.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why these three words might be the most beautiful cliche in footy",
        "publish_date": "Thu, 17 Apr 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Bob Murphy"
        ],
        "text": "“Play your role” might be the most beautiful cliche in footy. You’ve heard it a million times from players or coaches and you’d be forgiven for tuning out. It’s become almost an industry default catchphrase when a microphone is put in front of people.\n\nFor the purposes of simplicity, let’s bundle them all into the same basket, marked footy cliches. Within that basket, one diamond, for me at least, shines a little brighter than the rest.\n\nI have a deep curiosity about the language we use in football. The phrases, the tropes and the pieces of wisdom. All of it. From the quizzical, such as “lower your eyes”, to the rhythmic nonsense of “would-be tackler” and the eternal guiding force of footy’s optimistic spirit, “there’s always next week”.\n\nIf done right, each player’s determination to do their bit, even if it goes unnoticed from the masses, is all in service for the greater good. Understanding and executing your role gives each player their dignity, a sense of inner peace, because they know that it helps their teammate. The mantra of “play your role” can quieten down any intrusive inner thoughts, worries or anxieties that will hamper a footballer’s creativity, clarity and ultimately, performance.\n\nAnd it’s performance that footy on the biggest stage is all about. Under the brightest lights the game has to offer, the judgment can be as searingly hot as those burning lightbulbs in the sky. This Friday those lights will be shining down on the Blues and the Kangaroos, just so we can all get a better look at who they are as a collective.\n\nThe pressure is always on if you’re an AFL club; it’s just a matter of what type. The Kangaroos have been a developing side, under the eye of Alistair Clarkson, for some time now, and the moment for some significant results has arrived. North Melbourne, who are you?\n\nThe Blues are the fascination of the league. Like a macabre mutation of everyone’s second team. Everyone has got a friend who is a tormented Blues supporter. The spotlight on them has gone past the comical though; their pressure situation could be described as like living, training and playing at altitude. The air is thin up there, on those rocky peaks of doubt, and it’s hard to breathe. Only wins can bring Michael Voss and his boys down the mountain to breathe with freedom once again.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-to-edge-lower-after-nvidia-weighs-on-wall-street-20250417-p5lsdy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX opens slightly up despite more trouble on Wall Street",
        "publish_date": "Thu, 17 Apr 2025 11:25:30 +1000",
        "category": "finance",
        "authors": [
            "Nick Newling",
            "Stan Choe"
        ],
        "text": "Australian shares have opened slightly higher, with a strong start for the energy sector, after expectations of a decline following a weak night on Wall Street. Yesterday, tech giant Nvidia said US government rules restricting its exports of chips to China would hit its profits, causing trouble on the American bourse.\n\nBy 10.25am, the S&P/ASX 200 was up 7.2 points, or 0.1 per cent, to 7766.1, with the energy, materials and real estate sectors all stronger. Energy was up by just over 2 per cent, with materials and real estate up 0.8 and 0.4 per cent respectively.\n\nThe ASX 200 opened higher on Thursday despite expectations of a dip after Wall Street sank overnight. Credit: Getty Images\n\nHealthcare took the biggest hit by sector, down 0.8 per cent, followed by information technology (down 0.4 per cent) and communication services (down 0.3 per cent). The Australian dollar was at US63.66¢ by 10.30am.\n\nIt was a good start to the morning for miners, which bolstered the energy sector. Lynas Rare Earths (up 3.7 per cent), Santos (up 2.4 per cent) and Woodside (up 2.2 per cent) were all trading higher. Ampol also recovered well from a 3.1 per cent hit yesterday, with a 4.6 per cent increase on Thursday morning.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/basketball/white-finds-giddey-with-sweet-assist-20250417-p5lsi6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "White finds Giddey with sweet assist",
        "publish_date": "Thu, 17 Apr 2025 11:24:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "White finds Giddey with sweet assist\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/nrl-tips-round-7-20250417-p5lsh5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NRL Tips: Round 7",
        "publish_date": "Thu, 17 Apr 2025 11:20:28 +1000",
        "category": "finance",
        "authors": [],
        "text": "NRL Tips: Round 7\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/people-are-microdosing-weight-loss-drugs-a-gp-explains-what-to-watch-out-for/bczlioijl",
        "title": "People are 'microdosing' weight-loss drugs. A GP explains what to watch out for",
        "publish_date": "Thu, 17 Apr 2025 01:12:54 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Injectable medications originally developed for the treatment of diabetes are also effective for weight loss, and have surged in popularity for this purpose around the world.\n\n\n\n\n\nIn Australia, Ozempic is approved for the treatment of type 2 diabetes, while Wegovy is approved for weight management.\n\n\n\n\n\nBoth are formulations of the drug semaglutide, which mimics the action of the naturally occurring GLP-1 hormone on GLP-1 receptors in the gut and the brain, helping regulate appetite and making you feel fuller for longer.\n\n\n\n\n\nHowever these medications are expensive, and sometimes hard to get. They also come with side effects. For these reasons, people are taking to \"microdosing\" weight-loss drugs, or using less than the dose recommended by the manufacturer.\n\n\n\n\n\nBut is this effective, and is it safe? As a GP, people are asking me these questions. Here’s what we know — and what we don’t know yet.\n\n\n\nWhy are people microdosing weight-loss drugs?\n\nMicrodosing usually refers to psychedelic medication, where people take a low dose of a psychedelic drug to enhance performance, or reduce symptoms of stress and anxiety.\n\n\n\n\n\nHowever, the term is increasingly being used to describe the use of weight-loss injectables at lower-than-recommended doses.\n\n\n\n\n\nThree common reasons come up when I ask patients why they microdose weight-loss drugs.\n\n\n\nCost: Injectables used for weight loss are not covered by the Pharmaceutical Benefits Scheme, so patients must pay for these out-of-pocket. Costs start from $260 per month and increase from there.\n\n\n\nAvailability: Worldwide shortages of these injectable medications have led doctors and patients to seek alternative solutions.\n\n\n\nSide-effects: They are common, and can include nausea, vomiting, bowel habit changes and reflux . Lower doses cause fewer side-effects, which is why the recommended dosing schedule starts low and gradually builds up.\n\nHow do people microdose weight-loss drugs?\n\nA standard dose of semaglutide is 2.4mg, but we start patients on much lower doses (0.25mg) and gradually build up to this by increasing the dose each month. This is because starting at the full dose invariably causes bad side effects.\n\n\n\n\n\nInjectables come in an adjustable auto-injector pen which is twisted until the dose counter shows the prescribed dose in milligrams. There’s a click every time the dial is turned. Once the prescribed dose is showing, it’s injected under the skin.\n\n\n\nREAD MORE Experts call for 'urgent' scrutiny after weight loss drugs are linked to suicidal thoughts\n\nTo microdose, patients simply turn the dial fewer times than recommended for the full dose. They estimate a microdose by \"counting clicks\", which means they’re turning it according to the clicks they hear rather than until they see the dial showing the correct dose has been reached.\n\n\n\n\n\nAlternatively, they may inject the full recommended dose but do so less often than once per week.\n\n\n\nIs it safe?\n\nUsing injectables in this way has not been researched, so the safety has not been established. However, it’s unlikely lower doses would lead to higher safety concerns.\n\n\n\n\n\nIn fact, logically, lower doses are likely to mean fewer side effects.\n\n\n\n\n\nBut these drugs do expire after a few weeks, and microdosing could increase the risk of inadvertently using them after their expiration date. Injecting out-of-date medication can be a significant health risk. For example, it could cause infection if bacteria has started to grow.\n\n\n\nREAD MORE Can this small patch really help you lose weight and live a healthier life?\n\nThe biggest concern around the safety of microdosing is if patients are doing it without the knowledge of their treating team (such as their GP, dietitian and pharmacist).\n\n\n\n\n\nBecause there are no clear guidelines around microdosing, patients should only try it with caution and under medical care. Their team can assist with issues such as accounting for the limited shelf-life of the medication.\n\n\n\nIs it effective?\n\nAs lower doses than recommended for weight loss have not been tested, we cannot answer this question yet. However, reduced side effects at lower doses make it likely there are also reduced therapeutic effects.\n\n\n\n\n\nIn my experience there’s a reason patients increase their doses as recommended: they simply don’t lose enough weight on the starting doses.\n\n\n\nAt the height of semaglutide shortages in 2023, experts from the American Diabetes Association published recommendations around how to prescribe lower doses for patients with diabetes. But these recommendations were for diabetes management, not for patients using the drug for weight loss.\n\n\n\n\n\nIt’s also important to note that for patients using Wegovy to reduce heart attack and stroke risk — which Australia’s Therapeutic Goods Administration recently approved it for — there’s no evidence that cardiovascular benefits will be achieved at lower-than-recommended doses.\n\n\n\nIs there any role for microdosing weight-loss drugs?\n\nThere may be a role for microdosing in a few scenarios:\n\n\n\n\n\nWhen side-effects are not manageable: when side-effects are intolerable for patients, even on the lowest introductory dose, there may be a role for individualised approaches. But this is best done with clear communication and regular monitoring, so patients are not under-treated.\n\n\n\nREAD MORE I used Ozempic to help me realise my dream of becoming a mum. It took a toll even after I quit\n\nSupply disruption: if there’s a supply disruption, lowering the dose or lengthening the time between doses may be preferable to ceasing the medication altogether.\n\n\n\n\n\nMaintenance of weight loss: once therapeutic levels have helped patients achieve their goal weight, lowering the dose may be a helpful longer-term way of keeping them there. We know stopping these drugs altogether results in rebound weight gain. We await evidence for microdosing for weight maintenance.\n\n\n\nSo what’s the take-home message?\n\nPatients who use injectables as part of their approach to weight loss should be under the care of an experienced team, including a GP, who can monitor their progress and ensure they achieve their weight loss in a safe and sustainable way.\n\n\n\n\n\nMicrodosing weight-loss drugs currently has no clear evidence base, but if a person wants to attempt it, they should do so with the full knowledge of their treating team.\n\n\n\n\n\nNatasha Yates is a practising clinician and a PhD candidate at Bond University.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/cost-of-living-secrets-subscriptions/w8zzubukl",
        "title": "Cost of Living Secrets: Subscriptions",
        "publish_date": "Wed, 16 Apr 2025 22:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Associate Professor Louise Grimmer, one of Australia's leading retail experts breaks down what you can do to manage your subscription services.\n\n\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/housing-dominates-second-leaders-debate-ahead-of-2025-federal-election/38khldk5i",
        "title": "Housing dominates second leaders debate ahead of 2025 federal election",
        "publish_date": "Wed, 16 Apr 2025 21:12:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nThe leaders of both major parties have locked horns in a second leaders debate hosted by the A-B-C.\n\n\n\n\n\nOpposition Leader Peter Dutton framed his pitch to voters around a familiar question.\n\n\n\n\n\n\"Are you better off today than you were three years ago?\"\n\n\n\n\n\nHis answer:\n\n\n\n\n\n\n\n\"As I've moved around the country and spoken to literally thousands of Australians - young families, pensioners, people in small businesses - it's been obvious to me that people don't feel better off.\"\n\n\n\n\n\nBut Prime Minister Anthony Albanese says that's not true - and he has an optimistic vision for Australia's future.\n\n\n\n\n\nHe says Labor will cut taxes, boost manufacturing, strengthen healthcare, slash student debt by 20 per cent and lower the deposit required from first home buyers to five per cent.\n\n\n\n\n\n\"We're turning the corner. We have inflation that's down. We have real wages that are up. We have unemployment that's very low at just four point one percent, and interest rates have started to fall. They started to rise before the last election. But we know that there's much more work to do. And that's why we have a plan.\"\n\n\n\n\n\nHousing was the first major issue canvassed in the debate, and it got the most time, off the back of a string of centrepiece policies unveiled in recent days.\n\n\n\n\n\nHost David Speers asked about economist analysis that suggests both parties' policies could raise house prices.\n\n\n\n\n\nAnthony Albanese says the government's plan would not make things worse.\n\n\n\n\n\n\"We have a comprehensive $43 billion Homes for Australia plan, making sure, whether it's about increased social housing, increased private rentals or increased home ownership, as well for our Help to Buy scheme, that will all assist. The key of course, is supply, and that's why only Labor is offering a plan at this election, to increase supply of housing.\"\n\n\n\n\n\nPeter Dutton has blamed high house prices on recent spikes in immigration.\n\n\n\n\n\nHe says the Coalition is proposing a $5 b illion fund to identify land releases that are being stalled by a lack of infrastructure like sewage or roads, and also to reduce migration by 25 per cent for two years, while preventing foreigners from buying houses during that time.\n\n\n\n\n\nAnother key plank of Coalition policy to support first home owners is that -\n\n\n\n\n\n\"For the first six hundred fifty thousand dollar of your mortgage that will be interest that you could claim against your income. So for an average couple that will be about 11 or $12,000, a year over five.\"\n\n\n\n\n\nBoth leaders shut down the prospect of reform to negative gearing, seen by many as the elephant in the room of Australia's housing debate.\n\n\n\n\n\nBut the other elephant looming large has been Donald Trump.\n\n\n\n\n\nPeter Dutton was asked if he trusts him:\n\n\n\n\n\nDUTTON: \"Well, we trust the United States and I don't know the President, I've not met him, the Prime Minister, obviously, has been able to.”\n\n\n\nSPEERS: “So you're not willing to say you trust Donald Trump?”\n\n\n\nDUTTON: “I don't know Donald Trump, is my point. My point is that who I trust is the Australian people and my job is to stand up for our country's interests.\"\n\n\n\n\n\nAnthony Albanese has been equally diplomatic.\n\n\n\n\n\n\"I have no reason not to. I've had a couple of discussions with him. In the last discussion, we agreed on a series of words that he would give consideration, great consideration was the words that he used, and he did that. In the end, he made a decision as part of the US administration to put these tariffs on every country. We got the lowest amount but we made it very clear that that was an act of self harm by the United States.\"\n\n\n\n\n\nOn the topic of international relations, Mr Dutton was forced into an awkward admission of fault during the debate after previously refusing to back down on his erroneous claim that Indonesian President Prabowo Subianto publicly announced a request by Russia to host military aircraft on Indonesian territory.\n\n\n\n\n\n\n\nPeter Dutton says he was in error.\n\n\n\n\n\n\"It was a mistake.\"\n\n\n\n\n\nBut the Opposition Leader maintained that the Prime Minister was caught unawares.\n\n\n\n\n\n\"What we've seen in the last 12 hours or so is that the Russian envoy to Indonesia has confirmed that there have been discussions, and obviously there is a concerning closeness in that relationship. And I think the main point here is that the Prime Minister knew nothing of it.\"\n\n\n\n\n\nThe Prime Minister jumped on his opponent's admission.\n\n\n\n\n\nALBANESE: \"Peter say why didn't we know something that didn't exist, and what didn't exist, and Indonesia has confirmed, (is) the idea of a base being used by the Russian Air Force in West Papua.\"\n\n\n\nSPEERS: \"Do you accept that Mr Dutton?\"\n\n\n\nDUTTON: \"No, I don't, I don't accept that. I think the Prime Minister's full of bluster here.\"\n\n\n\n\n\nMr Albanese says Australia has a strong relationship with Indonesia.\n\n\n\n\n\n\"The idea that you just throw out these comments, is just extraordinary. And the fact that we just saw a double down on it as if there's nothing to see here just shows that there's no understanding of the need for diplomacy.\"\n\n\n\n\n\nAsked to name a major economic reform he'd most like to be remembered for, Mr Dutton pointed to structural changes in energy markets, starting with a gas reservation and later strengthened by nuclear plants.\n\n\n\n\n\n\"Energy is the economy, David. Everything we use, everything around us is either running or has been created because of the use of energy, farming, fertilizer, cold storage. Everything that we rely on in our society, in a modern society like ours relies on energy.\"\n\n\n\n\n\nAnthony Albanese pointed to affordable childcare as his big-vision reform, saying Labor secured a three-day guarantee for parents in its first term.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/adelaide-joins-million-dollar-club-domain-report/hf2v8mpv6",
        "title": "After a $525k decade, another Australian capital has joined the million-dollar club",
        "publish_date": "Wed, 16 Apr 2025 14:01:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's worsening housing affordability has reached a new milestone, with another capital city entering the $1 million club for median houses prices — Adelaide.\n\n\n\n\n\nDomain's report for the March quarter, released on Thursday, found Adelaide's median house price grew $11,119 (or 1.1 per cent) to $1,000,202 — surpassing the $1 million mark for the first time, according to the property listings website.\n\n\n\n\n\nIt is the fifth capital city to crack a seven-figure median, according to Domain, joining others including Sydney, Melbourne, Brisbane and Canberra.\n\n\n\n\n\nAdelaide's record wasn't the only one that was marked in Domain's latest report. It found median house prices also reached new highs in Sydney ($1.692 million), and Perth ($917,706) which Domain believes will reach $1 million by the end of the year. The median at a combined capital level also reached a record high ($1.179 million).\n\n\n\n\n\n\"But even though we've seen a quarterly growth for house prices, we've got a slowdown in the pace of price gains and on that annual basis,\" said Nicola Powell, the chief of research and economics at Domain. \"It's the slowest increase that we've seen in two years.\"\n\n\n\nHow are house prices tracking across the country?\n\nOver the past decade, house prices have surged across most of Australia, though some cities have experienced steeper increases than others.\n\n\n\n\n\nHobart recorded the strongest growth, with median house prices rising 111 per cent since 2015. The median now sits at $710,077, up from $335,814.\n\n\n\n\n\nAdelaide followed closely with a 110 per cent increase (or $524,922), taking the median price to $1,000,202 from $475,280.\n\n\n\n\n\nBrisbane also witnessed a steep rise, up 108 per cent to a median of $1,022,026, compared to $491,431 ten years ago.\n\n\n\nCredit: SBS News In Sydney — already the country's most expensive market — the median house price jumped 82 per cent, from $930,009 in 2015 to $1,691,731.\n\n\n\n\n\nMelbourne's median rose 60 per cent to $1,035,887, up from $648,527.\n\n\n\n\n\nCanberra experienced a 72 per cent increase, bringing its median to $1,049,067, from $608,585.\n\n\n\n\n\nPerth recorded a 51 per cent rise, with the median climbing from $608,312 to $917,706.\n\n\n\n\n\nDarwin was the exception, with prices virtually flat over the decade. The median house price rose just 1 per cent, from $652,173 in 2015 to $659,172.\n\n\n\nWhat's driving the growth in Adelaide?\n\n\"It's been continuous for Adelaide in terms of that price growth,\" Powell said.\n\n\n\n\n\n\"Obviously, the low cash rate during the pandemic initiated this upswing in price, and it's almost been unstoppable since then — up 84 per cent over the past five years.\"\n\n\n\n\n\nShe pointed to a range of demand drivers: \"Strong population change, demographic patterns in terms of demand for housing have certainly supported price growth. I think strong rates of overseas migration as well as positive interstate migration means that Adelaide has benefited from strong population flows.\"\n\n\n\nCredit: SBS News Credit: SBS News Powell said a growing population and weaker supply have contributed to price growth.\n\n\n\n\n\n\"When you layer with some of the other things like remote working, the lifestyle that Adelaide has to offer — what we've seen in the past five years is that 110,000 people have been added to the population. That is like adding the LGA (local government area) of Tea Tree Gully … to the population in a five-year period,\" she said.\n\n\n\n\n\n\"Ultimately, supply just hasn't been able to keep pace.\"\n\n\n\nHousing heats up as an election battleground\n\nHousing affordability is already emerging as a key issue in this federal election, and Powell said 2025 could prove pivotal — especially for first home buyers.\n\n\n\n\n\n\"2025 is the year to watch,\" she said.\n\n\n\n\n\n\"Housing is a key battleground clearly for the election. And so housing policies for first home buyers might be that difference on whether somebody can purchase their home this year or not.\"\n\n\n\n\n\nBoth major parties are offering demand-side support.\n\n\n\n\n\n\"The 5 per cent [first home buyer] deposit scheme being expanded by Labor and then the tax deductibility for new homes from the Coalition — what this will do is help to bring forward demand and that in itself could support pricing at the lower end of the housing market,\" she said.\n\n\n\n\n\nBut Powell warned a \"demand-side policy needs to be complimented by a supercharged supply- side policy\".\n\n\n\n\n\n\"We need to reduce the cost of building a new home,\" she said.\n\n\n\n\n\n\"Taxation contributes anywhere between 20 and 40 per cent of the new home. We need to do something about that taxation cost because, ultimately, that will bring down the cost of buying a new home.\"\n\n\n\n\n\nPowell also noted the Coalition's approach appeared to be more \"targeted\" towards new homes, which could in turn incentivise new construction because of those tax benefits.\n\n\n\nWhat's next?\n\nPrices are still expected to rise in Adelaide and other capitals, but the pace of growth is likely to be restrained by worsening affordability, Powell said.\n\n\n\n\n\nWhile February's interest rate cut has slightly improved borrowing capacity, Powell doesn't consider it a \"game changer\" for buyers.\n\n\n\n\n\n\"There has been a widening gap between where home prices sit and the capacity of buyers to pay for a home. Obviously, with the reduction in the cash rate in February, that has improved borrowing capacity. But I don't think that's a game changer for buyers.\n\n\n\n\n\n\"We need multiple rate cuts to really help alleviate the burden, the financial burden.\n\n\n\n\n\n\"Until home loan serviceability improves significantly, it’s difficult to envisage our housing markets transitioning into another pronounced growth trend.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/greens-leader-adam-bandt-praises-mp-for-getting-attention-on-his-onlyfans-account/zzqiuy43j",
        "title": "Adam Bandt backs OnlyFans content posted by Greens MP for Brisbane",
        "publish_date": "Wed, 16 Apr 2025 12:21:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points The Greens member for Brisbane has launched an account on the platform usually known for its adult content.\n\nStephen Bates MP launched his account by announcing a Greens plan to make a HIV preventative medication free.\n\nHe said people should not have to \"pay a fortune to be sexually responsible\".\n\nGreen leader Adam Bandt has praised MP Stephen Bates after the federal politician started sharing content on OnlyFans.\n\n\n\n\n\nThe member for Brisbane published his first post on the platform known for its adult content on Wednesday.\n\n\n\n\n\nBates, who is the Greens LGBTIQA+ spokesperson, used the post to launch the Greens' push to make a drug free in Australia that significantly reduces the risk of HIV transmission.\n\n\n\n\n\nThe Greens leader praised Bates’ inventive methods.\n\n\n\n\n\n\"When it comes to saving lives, you need to talk to everyone you can and if that means using inventive measures to reach audiences with a plan that will save lives, then I think we should do it,\" Bandt said.\n\n\n\n\n\n\"Steven Bates has a long history of really connecting with his community and making sure that the people who need to hear the message about how can save lives, get to hear it.\"\n\n\n\nBates said while the drug PrEP was covered by the pharmaceutical benefits scheme (PBS) , \"the gap payment can add up to hundreds of dollars a year\".\n\n\n\n\n\n\"In a cost of living crisis, that’s just too much. You shouldn’t have to pay a fortune to be sexually responsible,\" he said.\n\n\n\n\n\n“Ending HIV is too important to fly under the radar.\"\n\n\n\n\n\nUnder the PrEP drug regimen patients typically take a daily pill, which — even without the use of condoms — is close to 100 per cent effective at preventing contraction of HIV, according to experts.\n\n\n\nGreens member for Brisbane Stephen Bates has created an OnlyFans account. Source: AAP / Jane Dempster Bates said he was using the OnlyFans platform as he knew it would get people's attention.\n\n\n\n\n\n\"Sometimes you have to make a splash to make people pay attention to the things that matter,\" he said.\n\n\n\n\n\nWhile the subscription service is adults only, it is not just pornographic content shared on it.\n\n\n\n\n\nPrEP has been part of the PBS since 2018 and is used by about 100,000 Australians.\n\n\n\n\n\nThis is not the first time Bates has taken to social media to campaign.\n\n\n\n\n\nIn 2022 he used the slogan \"You always come first with the Greens\" as part of an advertised on Grindr, a social networking app for those in the LGBTIQ+ community.\n\n\n\n\n\nHe was elected to the seat of Brisbane at the 2022 federal election and in his first speech to parliament, he shared his emotional story of coming out as gay.\n\n\n\n\n\nThe Greens presented their plan for tackling LGBTIQA+ discrimination at Equality Australia’s Rainbow Votes Forum in Surry Hills on Tuesday night.\n\n\n\n\n\nThe full plan calls for the appointment of an LGBTIQA+ Human Rights Commissioner to be a watchdog for the LGBTIQA+ community.\n\n\n\nThe Greens want to make PrEP free for Australians, saying the drug that prevents HIV infection was costing too much. Source: Getty / nito100 Greens candidate for Sydney Luc Velez said queer people still face discrimination every day.\n\n\n\n\n\n\"Our community has higher rates of homelessness and mental ill health, and faces systemic barriers to our safety, workplace rights and access to services,\" he said.\n\n\n\n\n\n\"As we are seeing the right lean into queerphobia and fearmonger about trans bodies and healthcare, a dedicated LGBTIQA+ human rights commissioner will ensure there are always the resources and expertise to defend our human rights.\"\n\n\n\n\n\nThere has been much discussion about whether the Greens will be part of a minority government following the 3 May election.\n\n\n\n\n\nLabor has promised to cap most PBS medicines at a maximum of $25 if elected, a commitment the Liberals have said they would match.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/chinas-economy-expands-ahead-of-trade-war-escalation/h84w24a6l",
        "title": "China's economy expands ahead of trade war escalation",
        "publish_date": "Wed, 16 Apr 2025 08:08:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/housing-different-plans-to-ease-the-crisis-but-will-any-of-them-work/euwk5dg7e",
        "title": "Housing: Different plans to ease the crisis, but will any of them work?",
        "publish_date": "Wed, 16 Apr 2025 02:34:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPM: \"Housing.\"\n\n\n\n\n\nDutton: \"Home Ownership.\"\n\n\n\n\n\nBandt: \"And just on housing.\"\n\n\n\n\n\nDutton: \"Housing crisis.\"\n\n\n\n\n\nBandt: \"Renters and first home buyers.\"\n\n\n\n\n\nDutton: \"The dream of home ownership.\"\n\n\n\n\n\nPM: \"Their dream of home ownership.”\n\n\n\n\n\nIt's the topic on party leader's minds - housing.\n\n\n\n\n\nSpecifically, helping people buy their first home.\n\n\n\n\n\nAnd for good reason.\n\n\n\n\n\nIt's getting harder and harder to buy your first home in Australia.\n\n\n\n\n\nMore than half of people born in the 1950s owned a home before they were 30. By 2016, that had dropped to around 35 per cent.\n\n\n\n\n\nSo, what are the major parties offering first home buyers heading into the election?\n\n\n\n\n\nWe'll start off with the current government - Labor.\n\n\n\n\n\n“I want young people and first home buyers to achieve their dream of home ownership.”\n\n\n\n\n\nCentral to Anthony Albanese's plan is enabling all first home buyers to purchase a place with a 5 per cent deposit.\n\n\n\n\n\nGenerally, you need a 20 per cent deposit to buy a house.\n\n\n\n\n\nIf you don't have the full amount, you have to pay Lenders' Mortgage Insurance.\n\n\n\n\n\nLMI is valued at 1 to 5 per cent of the loan, and exists to protect banks against risky loans. They take out insurance, you pay for the premium.\n\n\n\n\n\nUnder Labor's plan, the government will guarantee the difference for first home buyers - basically telling the bank they're good for the rest of the deposit amount if the home owner defaults on the loan.\n\n\n\n\n\n“It will be available for homes valued all the way up to the average price in every city and region. And you won't have to pay a single dollar in mortgage insurance.”\n\n\n\n\n\nThis isn't a new policy - the First Home Guarantee has existed in some form since the Morrison Coalition Government.\n\n\n\n\n\nPreviously, there were restrictions on who could access it, and a limited number of placements per year, starting at 10,000 places in 2020, up to 50,000 in the last financial year.\n\n\n\n\n\nWhat's different about Labor's policy is it's open to ALL first home buyers, without a cap on income, or a limit on places per year.\n\n\n\n\n\nWhat that looks like for the median priced Australian house,at $820,000 is:\n\n\n\n\n\nYou can buy it with a deposit of $41,000, compared to $160,000; and you save around $35,000 in LMI costs, although the exact amount varies state by state.\n\n\n\n\n\nBut to actually service the loan with a a 5 per cent, you probably need to earn about $150,000 as a single, or $180,000 as a couple with no kids, well above the average Australian household income of $120,000 a year (according to the Grattan Institute).\n\n\n\n\n\nNone of that takes into account the other costs associated with buying a home, like stamp duty which could cost anywhere between $5,000 and $50,000 for an $820,000 home depending on where you live.\n\n\n\n\n\nAssociate Professor Michelle Cull from Western Sydney University says it may help some people.\n\n\n\n\n\n“ Lower income earners would not be able to borrow that amount anyway. So it's still not a solution for them. But for those once again on slightly higher incomes and to have security with their their work and maybe younger people who are expecting their incomes to increase, it could work very well. But if we did have interest rates increase rapidly, as we've seen in the past, then that's going to put a lot of pressure on those people with big mortgages.”\n\n\n\n\n\nLabor is also looking at targeted increases to supply - building 100,000 new homes in eight years, reserved for first home buyers.\n\n\n\n\n\n“No competition from property investors, just a fair crack for young Australians.”\n\n\n\n\n\nThe plan is to work with the states to speed up the house building process - fast tracking land release and planning decisions.\n\n\n\n\n\nIt includes $2 billion in grants on offer to states and territories, that will have to be matched, and $8 billion in zero interest loans.\n\n\n\n\n\nLabor says construction on the first homes will begin in 2026, and the first will be ready to move in to by 2028.\n\n\n\n\n\nThe coalition has a two part pitch.\n\n\n\n\n\nThe first idea is recycled from the last election.\n\n\n\n\n\n“We will allow Australians to access up to $50,000 of their super towards a deposit for their first home. That allows home ownership earlier. Your super, ultimately, is your money. It's not the government’s money.”\n\n\n\n\n\nThe money would need to be returned to super once the house was sold.\n\n\n\n\n\nThere are concerns that removing money from superannuation would impact the amount someone retires with, and that many young people don't have $50,000 in superannuation anyway.\n\n\n\n\n\nThe second is an idea that's very new to Australia.\n\n\n\n\n\nShadow Housing Spokesperson Michael Sukkar says the coalition will allow first home buyers to claim interest paid on tax.\n\n\n\n\n\n“For so many young Australians, the ability for them to buy a home is constrained by the fact that with relatively high interest rates, they're just unable to make money. We're not giving them a grant, we're not giving them a free kick. We're gonna give them back a bit more of their own money for those first five years, which is the most critical time for a first time buyer.”\n\n\n\n\n\nIt's ONLY for new homes, and ONLY for first home buyers.\n\n\n\n\n\nThere's no cap on the total amount of the loan or price of the house, but it's only applied to $650,000 of a loan, and for the first five years.\n\n\n\n\n\nAnd there's an income cap for who can access it - $175,000 for individuals, and $250,000 for couples.\n\n\n\n\n\nLiam Davies from the Centre for Urban Research says it won't help with the upfront cost of a home.\n\n\n\n\n\n“The Liberal party's policy is effectively to make it cheaper to take on larger loans. Now this is based on the idea that the household already has a deposit. Households that don't have a deposit won't benefit from this scheme, but households that have a deposit will be able to leverage that deposit slightly further or increase the amount of loan they take because of the tax concessions they'll get.”\n\n\n\n\n\nHelping people buy their first home is one part of the plans.\n\n\n\n\n\nThe other is supply.\n\n\n\n\n\nLabor has set a target of 1.2 million new homes to be built in 5 years, from July 1 last year, until mid 2029.\n\n\n\n\n\nThat means building 60,000 homes every three months, or 240,000 each year.\n\n\n\n\n\nIt's ambitious - Australia has never done it before - the best quarter on record saw 56,000 dwellings completed.\n\n\n\n\n\nBetween July and September last year, there were just 45,000 homes built.\n\n\n\n\n\nLabor's new supply policy - the 100,000 new homes set aside for first home buyers - is part of this 1.2 million home goal.\n\n\n\n\n\nMatt Bowes from the Grattan Institute says it could help.\n\n\n\n\n\n“If that 100,000 new homes target that they've announced for the scheme is met, that would have an important impact on adding to new housing supply at a time when housing construction and housing starts are quite low, when housing construction costs are very high and interest rates are high.”\n\n\n\n\n\nAnother first term supply policy from Labor is the Housing Australia Future Fund.\n\n\n\n\n\nIt was set up in 2023, with $10 billion put into an investment account, called a future fund.\n\n\n\n\n\nThe profits made from that investment go towards housing - specifically, $500 million is taken out once a year.\n\n\n\n\n\nThe goal was to build 30,000 social and affordable homes in five years.\n\n\n\n\n\nNo homes have been completed.\n\n\n\n\n\nMr Albanese says some are in the pipeline.\n\n\n\n\n\n“ 28,000 under construction or in planning, so awaiting approval”\n\n\n\n\n\nThe Coalition has vowed to axe the HAFF if it wins the election.\n\n\n\n\n\nThe Liberal Party has promised $5 billion towards essential infrastructure to build new homes - to establish water, power, and sewerage connections to new development sites.\n\n\n\n\n\nMr Sukkar says there are already places identified where it will help.\n\n\n\n\n\n“We've worked directly with hundreds of councils, literally hundreds. We've identified the precise projects by lock 500,000 new homes, and we know those sorts of projects will be overwhelmingly projects that will be attractive to young first home buyers.”\n\n\n\n\n\nWith no policies to actually build houses, Peter Dutton says his focus is on reducing demand.\n\n\n\n\n\n“We're cutting the migration program by 25 per cent because Labor has had it at a record high. And that's increased the demand on housing.”\n\n\n\n\n\nThe plan is to reduce permanent migration from 185,000 to 140,000 for two years, and will further reduce international students to 240,000 a year compared to Labor's current 270,000 level.\n\n\n\n\n\nBoth Labor and the Coalition will ban foreign investors buying established homes for 2 years.\n\n\n\n\n\nThe final piece of the housing puzzle is having people to build them.\n\n\n\n\n\nChief Executive of Master Builders Australia Denita Wawn says there aren't enough tradies.\n\n\n\n\n\n“We need more people. We need skilled people to do the job. One of the reason that costs are so high is simply we are taking too long to build because we don't have enough skilled people.\n\n\n\n\n\nThe coalition will subsidise businesses employing apprentices in areas there's a skills shortage - giving them $12,000 a year for the first two years for new apprentices.\n\n\n\n\n\nLabor's will continue offering free TAFE , and set up an incentive payment worth $10,000 across the course of an apprenticeship, for apprentices in residential construction.\n\n\n\n\n\nBut - will all this drive up house prices?\n\n\n\n\n\nWhen Peter Dutton was asked exactly that, he said:\n\n\n\n\n\n“Our prices will drive up home ownership. Our policies will drive up home ownership. That's what we're on about here.”\n\n\n\n\n\nWhilst Finance Minister Katy Gallagher told the ABC modelling has been done.\n\n\n\n\n\nGALLAGHER: \"Well, it was advice from Treasury and the advice was that this expansion of this program would not have a significant impact on house prices.\n\n\n\n\n\nREPORTER: \"Is there a number?\"\n\n\n\n\n\nGALLAGHER: \"No, there isn't a number.”\n\n\n\n\n\nIndependent Economist Saul Eslake says both policies will drive up house prices.\n\n\n\n\n\n“ Well, both major parties policies will have the effect of putting upward pressure on house prices by allowing people to borrow more money which they'll spend on housing than they would otherwise. And that's consistent with what's now more than 60 years of evidence that unambiguously shows that anything that allows Australians to spend more on housing, whether it's first time owner grants, stamp duty, concessions, easier lending criteria, lower interest rates, mortgage guarantee schemes, Shared Equity schemes, lower interest rates, all the proposals that are being put at this election, they result in higher house prices and fewer Australians owning housing.”\n\n\n\n\n\nHe says the coalitions tax break policy will increase what people can spend.\n\n\n\n\n\n“Especially when combined with their other super for housing policy, will allow those eligible to borrow more and spend more on housing than they otherwise would. That will drive up prices, and even though the coalition says that skewing demand from first home buyers to new houses will prompt builders to build more new houses. The reality is that that will take time.”\n\n\n\n\n\nAnd Labor's policy will have a similar effect.\n\n\n\n\n\n“Labor’s at least being honest in admitting that they're just arguing that it won't be a significant increase in house prices.”\n\n\n\n\n\nAnd lastly - the Greens.\n\n\n\n\n\nWhilst they're not going to be in a position to form government, they may be part of a minority government.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-vegemite-is-causing-a-stir-in-canada/rjgnk5s8m",
        "title": "Canada's war on Vegemite: Why this Aussie icon is causing a stir",
        "publish_date": "Wed, 16 Apr 2025 01:44:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Found Coffee, a chain of Aussie-style cafes in Toronto, has become the centre of an unexpected culture clash after Canada's food authority ordered its owner to stop serving Vegemite.\n\n\n\n\n\nOwner Leighton Walters, who is a dual Canadian and Australian citizen, has been importing the iconic spread for five years but was recently told by the Canadian Food Inspection Agency (CFIA) that Vegemite was non-compliant with its health regulations due to added vitamins in the product.\n\n\n\n\n\n\"I grew up as a Vegemite kid ... eating it for breakfast every second day,\" Walters told CBC Toronto.\n\n\n\n\n\n\"It's an iconic Australian product ... we've been so proud to serve it to thousands and tens of thousands of Australians, Canadians, travellers and tourists.\n\n\n\n\n\n\"Pulling Vegemite off our shelves hits at the core and the heart of our brand.\"\n\n\n\nREAD MORE Why taking vitamin D tablets could be a waste of money\n\n'I am pro-Vegemite' says Anthony Albanese\n\nPrime Minister Anthony Albanese has come out in support of Walters.\n\n\n\n\n\nAfter reporters asked if he had a message for Canada, Albanese said: \"I stand with the Aussie café owner.\"\n\n\n\n\n\n\"I can confirm here today that I am pro-Vegemite. I actually put a lot of Vegemite on my toast when I eat bread,\" he said.\n\n\n\n\n\n\"It's a good thing. I did hear the report. It's rather odd they're allowing Marmite, which frankly, is rubbish. Let's be clear: I'm pro-Vegemite, anti-Marmite. That's my position.\"\n\n\n\n\n\nVegemite's British rival, Marmite, was granted approval by the CFIA in 2020 despite the fact that an earlier shipment was blocked due to concerns about added vitamins.\n\n\n\nREAD MORE The fruit that is a source of folate and right on our doorstep\n\nIn a video posted to Instagram, Walters shared his disappointment over the CFIA's decision to remove approximately CA$8,000 ($9,031) worth of stock and ban the spread from the cafe's menu.\n\n\n\n\n\n\"Despite Amazon and major grocery stores continuing to profit of the sale of Vegemite and similar products like Marmite, for some reason, our genuinely Australian/Canadian coffee shops offering a healthy slice of home away from home is seemingly worth targeting,\" he said.\n\n\n\n\n\nSpeaking from a hospital bed while receiving treatment for spina bifida, a condition linked to folate deficiency during early weeks of pregnancy, he said Vegemite had a personal significance to him, as the spread is fortified with folic acid.\n\n\n\n\n\n\"Spina bifida exists because there's a lack of folate in the diet at conception. One of the major things that Vegemite adds to everyone's daily intake is folate.\n\n\n\n\n\n\"I want to fight for my business; I'm going to stand up for what I believe in.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/federal-election-2025-live-updates-treasurer-claims-second-debate-a-decisive-win-for-pm-labor-slams-dutton-s-comments-on-russia-indonesia-military-plans-20250416-p5lsa6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Federal election 2025 LIVE updates: Treasurer claims second debate a ‘decisive win’ for PM; McKenzie apologises over China, Russia comments",
        "publish_date": "Thu, 17 Apr 2025 11:56:56 +1000",
        "category": "finance",
        "authors": [
            "Michaela Whitbourn"
        ],
        "text": "The unemployment rate rose to 4.1 per cent in March as the number of employed people grew by less than expected.\n\nFresh data from the Australian Bureau of Statistics (ABS) today showed the number of employed people jumped by 32,000 last month, slightly below consensus expectations for a 40,000 rebound, but partly making up for a fall of 52,800 in February.\n\nLoading\n\nEagle-eyed readers might recall the unemployment rate reading came in at 4.1 per cent in February. However, the ABS revised down the unemployment rate for that month to 4 per cent in its latest release.\n\nThe number of unemployed people grew by 3000 people in March, as the participation rate – the share of working-age people working or looking for a job – rose from 66.7 per cent to 66.8 per cent.\n\nHowever, the annual rate of employment growth over the past 12 months remaining slightly higher than the 20-year pre-pandemic average.\n\nMonthly hours worked decreased by 0.3 per cent, falling for the second month in a row, despite the growth in employment this month.\n\nABS head of labour statistics Sean Crick said this was due to a higher than usual number of people reporting working reduced hours this month due to bad weather, coinciding with ex-tropical cyclone Alfred and other major weather events in NSW and Queensland.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/where-to-dine-in-st-kilda-balaclava-windsor-prahran-and-surrounds-20250410-p5lqu6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Where to dine in St Kilda, Balaclava, Windsor, Prahran and surrounds",
        "publish_date": "Thu, 17 Apr 2025 11:47:19 +1000",
        "category": "finance",
        "authors": [],
        "text": "Collection\n\nWhere to dine in St Kilda, Balaclava, Windsor, Prahran and surrounds\n\nFrom hatted restaurants with sea views to buzzy Italian trattorias, these are Good Food’s picks for dining out around bayside Melbourne.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/vic-good-food-guide/saigon-street-eats-20250417-p5lshs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Saigon Street Eats",
        "publish_date": "Thu, 17 Apr 2025 11:42:21 +1000",
        "category": "finance",
        "authors": [
            "Dani Valent"
        ],
        "text": "1 / 3 Panko-crumbed eggplant bao at Saigon Street Eats. Kristoffer Paulsen 2 / 3 Assorted dishes at Saigon Street Eats. Kristoffer Paulsen 3 / 3 Trouper manager Rachel Bradley and Saigon Street Eats’ Kim Le Tet. Penny Stephens Previous Slide Next Slide\n\nVietnamese$$$$\n\nIn St Kilda, local favourite Saigon Street Eats has bunked in with Trouper cafe after operating out of a nearby Carlisle Street shopfront for over 10 years. The Chapel Street corner premises now serves coffee in the morning, then morphs into a Vietnamese restaurant for lunch and dinner. At 11.30am, the milk cartons are put away, teaspoons are replaced with chopsticks, and customers come for pho instead of a flat white.\n\nBut the upbeat feeling remains at this Vietnamese canteen, always bustling with soup slurpers, spring roll munchers and busy folks grabbing takeaway. Slow-simmered pho is made to an old family recipe, but there’s a keen eye on innovation in dishes like the panko-crumbed eggplant bao and salt-and-pepper tofu banh mi – both vegan and rocking with flavour.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/fyre-festival-2-postponed-with-no-new-date-set-20250417-p5lsf1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fyre Festival 2 postponed with no new date set",
        "publish_date": "Thu, 17 Apr 2025 11:41:03 +1000",
        "category": "finance",
        "authors": [
            "Nell Geraets"
        ],
        "text": "It seems the second time may not be the charm for the Fyre Festival.\n\nThe sequel to the notorious event was announced amid a burst of publicity in February, but its future remains in doubt after organisers shared – and shortly deleted – an announcement stating it was postponed.\n\nFyre 2 was scheduled for May 30 to June 2 at Mexico’s Isla Mujeres. It was promoted as a follow-up to the original Fyre Festival, which was cancelled in 2017 after a string of bungles, including ramshackle tents and a lack of bathrooms.\n\nThe first Fyre Festival was a mess of ramshackle tents and cold cheese sandwiches.\n\nAccording to US outlet ABC News, an announcement on the event’s website on Wednesday (US time), said it “has been postponed and a new date will be announced”. Ticket holders were told refunds had been issued, and that they could repurchase tickets once a new date had been announced.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/why-these-three-words-might-be-the-most-beautiful-cliche-in-footy-20250415-p5lrto.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why these three words might be the most beautiful cliche in footy",
        "publish_date": "Thu, 17 Apr 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Bob Murphy"
        ],
        "text": "“Play your role” might be the most beautiful cliche in footy. You’ve heard it a million times from players or coaches and you’d be forgiven for tuning out. It’s become almost an industry default catchphrase when a microphone is put in front of people.\n\nFor the purposes of simplicity, let’s bundle them all into the same basket, marked footy cliches. Within that basket, one diamond, for me at least, shines a little brighter than the rest.\n\nI have a deep curiosity about the language we use in football. The phrases, the tropes and the pieces of wisdom. All of it. From the quizzical, such as “lower your eyes”, to the rhythmic nonsense of “would-be tackler” and the eternal guiding force of footy’s optimistic spirit, “there’s always next week”.\n\nIf done right, each player’s determination to do their bit, even if it goes unnoticed from the masses, is all in service for the greater good. Understanding and executing your role gives each player their dignity, a sense of inner peace, because they know that it helps their teammate. The mantra of “play your role” can quieten down any intrusive inner thoughts, worries or anxieties that will hamper a footballer’s creativity, clarity and ultimately, performance.\n\nAnd it’s performance that footy on the biggest stage is all about. Under the brightest lights the game has to offer, the judgment can be as searingly hot as those burning lightbulbs in the sky. This Friday those lights will be shining down on the Blues and the Kangaroos, just so we can all get a better look at who they are as a collective.\n\nThe pressure is always on if you’re an AFL club; it’s just a matter of what type. The Kangaroos have been a developing side, under the eye of Alistair Clarkson, for some time now, and the moment for some significant results has arrived. North Melbourne, who are you?\n\nThe Blues are the fascination of the league. Like a macabre mutation of everyone’s second team. Everyone has got a friend who is a tormented Blues supporter. The spotlight on them has gone past the comical though; their pressure situation could be described as like living, training and playing at altitude. The air is thin up there, on those rocky peaks of doubt, and it’s hard to breathe. Only wins can bring Michael Voss and his boys down the mountain to breathe with freedom once again.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-to-edge-lower-after-nvidia-weighs-on-wall-street-20250417-p5lsdy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX opens slightly up despite more trouble on Wall Street",
        "publish_date": "Thu, 17 Apr 2025 11:25:30 +1000",
        "category": "finance",
        "authors": [
            "Nick Newling",
            "Stan Choe"
        ],
        "text": "Australian shares have opened slightly higher, with a strong start for the energy sector, after expectations of a decline following a weak night on Wall Street. Yesterday, tech giant Nvidia said US government rules restricting its exports of chips to China would hit its profits, causing trouble on the American bourse.\n\nBy 10.25am, the S&P/ASX 200 was up 7.2 points, or 0.1 per cent, to 7766.1, with the energy, materials and real estate sectors all stronger. Energy was up by just over 2 per cent, with materials and real estate up 0.8 and 0.4 per cent respectively.\n\nThe ASX 200 opened higher on Thursday despite expectations of a dip after Wall Street sank overnight. Credit: Getty Images\n\nHealthcare took the biggest hit by sector, down 0.8 per cent, followed by information technology (down 0.4 per cent) and communication services (down 0.3 per cent). The Australian dollar was at US63.66¢ by 10.30am.\n\nIt was a good start to the morning for miners, which bolstered the energy sector. Lynas Rare Earths (up 3.7 per cent), Santos (up 2.4 per cent) and Woodside (up 2.2 per cent) were all trading higher. Ampol also recovered well from a 3.1 per cent hit yesterday, with a 4.6 per cent increase on Thursday morning.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/basketball/white-finds-giddey-with-sweet-assist-20250417-p5lsi6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "White finds Giddey with sweet assist",
        "publish_date": "Thu, 17 Apr 2025 11:24:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "White finds Giddey with sweet assist\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/nrl-tips-round-7-20250417-p5lsh5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "NRL Tips: Round 7",
        "publish_date": "Thu, 17 Apr 2025 11:20:28 +1000",
        "category": "finance",
        "authors": [],
        "text": "NRL Tips: Round 7\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-community-embarrassed-by-absolute-mess-left-at-beachfront-park-ahead-of-easter-070539644.html",
        "title": "Aussie community 'embarrassed' by 'absolute mess' left at beachfront park ahead of Easter",
        "publish_date": "2025-04-16T07:05:39Z",
        "category": "finance",
        "authors": [],
        "text": "A local woman discovered the \"mess\" during her morning walk, and was immediately struck by the foul smell coming from the mud.\n\nA proud Aussie community has been left embarrassed at the “absolute mess” created near one of the nation's most popular beaches. Pictures shared to social media show the grassy area up from the Gold Coast’s famous Burleigh Heads has been turned into a field of mud following a two-day surf event.\n\nLocal woman Cindy Amey walks up the hill at 6:00am every morning, and she was left “shocked” by what she saw this week. With so many tourists in town for the Easter holidays, she’s worried what they’ll think of her suburb.\n\n“I just couldn’t believe what I was seeing, it’s horrific. The grass up there had been looking so good, they’d even relaid turf up there recently,” she told Yahoo News.\n\n“Families go up there, and the view is fantastic. It’s a good place to go and have a picnic, but you couldn’t do that now, it’s embarrassing. If I arrived here on holidays and that was on my doorstep, I'd be wondering what's going on?”\n\nADVERTISEMENT\n\nAnother woman Lisa Evans said on Facebook that she feared no one would be able to use the park for months. \"Locals [are] throughly irritated and disappointed by the use & abuse of the park time and time again,\" she wrote.\n\nDeep tyre tracks and puddles of water can be seen across the hilltop, and many have complained the area had begun to smell like a bog. “It’s got that creek-like sewer smell,” one resident told Yahoo.\n\nBurleigh Heads is ordinarily a popular place for tourists and locals to relax. Source: Getty/Cindy Ames\n\nWhile many locals were outraged, others were confident the grass would soon grow back. Source: Cindy Amey\n\nDozens of Gold Coast locals have shared their frustration at the “trashing” of the hill on social media. “This is a disgrace. There have been hundreds of events on Burleigh Hill over the years… Never has the hill been left in such a state as this,” one person wrote. “A once beautiful area enjoyed by families, especially over Easter, is now just a mud bath,” another added. “Just horrible,” someone else lamented.\n\nADVERTISEMENT\n\nBut others weren’t phased by the state of the park, with some confident a sprinkling of seeds and a few weeks of sunshine would see the grass restored. “It will be as good as ever in a few weeks. I think people and tourists expect this in a heavy downfall of rain,” one person said.\n\nLocals fear it will be weeks before the park is restored. Source: Lisa Evans\n\nPark likely to be fully restored after Easter\n\nYahoo News has made several attempts to speak with Surfing Australia, which hosted the Boardriders Battle at Burleigh Heads on April 12 and 13. But it did not respond before publication.\n\nGold Coast City Council told Yahoo News its officers will inspect the site for any damage once the organisers have finished packing up at the end of the week. There’s another surf event planned next week, so full repairs aren’t expected until that has concluded after Easter.\n\nADVERTISEMENT\n\nEvent organisers are responsible for all costs associated with rectifying any damage as a result of the event, including grass restoration,” it said in a statement.\n\n“Minor repairs will be conducted where possible prior to the World Surf League event beginning set up early next week. Full repairs will be conducted following the conclusion of the surf events.”\n\nOrdinarily, the entire hill would be flooded with surfers and families. Source: Cindy Amey\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
        "source": "Yahoo"
    }
]