[
  {
    "url": "https://www.9news.com.au/national/blue-mountains-australia-police-incident/5866891d-cd2f-49b3-9bda-1df08390a302",
    "title": "Three people found unresponsive, two with stab wounds, in Blue Mountains home",
    "publish_date": "Sun, 24 Aug 2025 00:36:02 +0000",
    "category": "sports",
    "authors": [
      "Aug"
    ],
    "text": "Three people are in hospital after they were found unresponsive at a home in the\n\nBlue Mountains\n\njust outside of\n\nSydney\n\n.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/nsw-weather-rain-ruins-weekend-spots-for-entire-month-fields-ovals-underwaters/5d7ff8f5-c17a-4abd-944d-d60d1df67575",
    "title": "'Heartbreaking': Hidden toll of Sydney's wettest August in 27 years",
    "publish_date": "Sun, 24 Aug 2025 00:52:00 +0000",
    "category": "sports",
    "authors": [
      "Aug"
    ],
    "text": "C﻿ountless sporting fields and ovals across Sydney are still underwater following the city's wettest August in 27 years.\n\nThe record deluge has come at a high price for young people – weekend sports.\n\nPerpetually soggy grounds have resulted in soccer matches in some areas being rained out for the past month.\n\nSoggy soccer fields across Sydney have resulted in soccer games being cancelled for a month. (9News)\n\nPresident of Holroyd Soccer Club Danny Rizk told Today it has been a \"heartbreaking\" few weeks for young players.\n\n\"The whole reason we're here is for these kids to to enjoy their sport and get out on the field. And it's it's heartbreaking when we have to tell them, sorry, look, you're not playing,\" Rizk said.\n\n\"That's happened now for four weekends.\"\n\n\"We work extremely hard to keep our kids on the field playing sport, keeping healthy,\" he added.\n\n\"And all this does is just drives them away and keeps them at home on monitors and on screens.\"\n\nHolroyd Soccer Club President Danny Rizk. (9News)\n\nRizk said his one of the local fields in Guildford has poor drainage and is a muddy mess after heavy rain over the past few weeks.\n\nHe said when 75 per cent of the fields are unplayable, the whole round is cancelled.﻿\n\nThe soccer president said synthetic turf is a good way to ensure wet weather doesn't destroy the field.\n\n\"﻿It's not the only solution, but it's definitely a solution,\" he said.\n\n\"Having a few more around the area will definitely keep weekends like the ones that we've had in the past four weeks operating, at least moving in our local area,\n\n\"We've only got one synthetic field and it's just not enough. We had to play 58 games last weekend. That's as an association and they weren't able to play it.\"\n\nThe torrential rain that battering Sydney also caused a giant sinkhole open up on a sporting oval in Cammeray.\n\nLocals first spotted the sinkhole at Tunks Park on Thursday after another big night of rain.\n\nA sinkhole appeared at Tunks Park on Sydney's north shore. (Nine News)\n\nFields with poor drainage mean the grounds can stay wet and soggy for weeks. (9News)\n\nThe sinkhole was pictured close to the goal posts at the park, which has been completely submerged by water.\n\nThursday was the wettest day of the year to date for Sydney.\n\nThe city's monthly rainfall total reached a record 368.8mm by Friday morning,\n\nConditions eased on Saturday﻿ and the sun finally made a long-awaited appearance following Sydney's wettest August since 1998.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/spirit-of-tasmania-iv-new-boat-arrives-in-hobart/c55135c4-f6d6-4c3d-80fe-15a731b86bc0",
    "title": "Spirit of Tasmania IV arrives in Hobart amid doubts over company's future",
    "publish_date": "Sat, 23 Aug 2025 10:37:54 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "The operator of the Spirit of Tasmania has revealed it may need to be bailed out by the Tasmanian government, with the cost of new boats and ports pushing it to the brink.\n\nTT-Line confirmed its financial woes today as the new Spirit of Tasmania IV finally arrived in Hobart.\n\nCrowds lined the waterfront to get a glimpse of the boat, which is long overdue.\n\nREAD MORE: Search for missing Melbourne man in Victorian forest narrows after fresh information\n\nCrowds lined the waterfront to get a glimpse of the boat, which is long overdue. (Nine)\n\nIt's one of two ships that will replace the existing fleet that have done the Bass Strait crossing for more than two decades.\n\nThey're not only longer and taller but can also accommodate an extra 400 passengers, and have more space for cars, caravans and trucks.\n\nBut its journey to Australia has been far from smooth sailing, hailed the biggest infrastructure stuff-up in Tasmania's history.\n\nThe ship is too big for the existing berth in Devonport and the new one is still under construction.\n\nSo while Spirit of Tasmania IV has been delivered, it won't take passengers until the new berth is ready, about October next year.\n\nThey're not only longer and taller but can also accommodate an extra 400 passengers, and have more space for cars, caravans and trucks. (Nine)\n\n\"We accept that things could have gone far better,\" Premier Jeremy Rockliff said.\n\nThe new ship will stay in Hobart for the next eight weeks for staff training and to be completely fitted out.\n\nIt will then head to Geelong for further testing.\n\nTT-Line then needs to find a location to store it until the new berth is ready.\n\nIt's likely it will be held at a Victorian port while Spirit of Tasmania V will stay in Europe until early next year.\n\nBut the cost of new ships and berths, including the recently completed Geelong terminal, has pushed TT-Line to the brink.\n\nThe ship is too big for the existing berth in Devonport and the new one is still under construction. (Nine)\n\n\"We are working with the state government, particularly with the Treasury around the financial position of the company,\" TT-Line chair Ken Kanofski said.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/air-guitar-world-title-returns-home-to-finland-after-25-years/105690596",
    "title": "Air guitar world title returns to Finland after 25 years",
    "publish_date": "Sun, 24 Aug 2025 01:51:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "Finland, the home of the World Air Guitar Championships, has produced its first winner since 2000.\n\nLocal hope Aapo \"The Angus\" Rautio won the 30th edition of a three-day event that brings together competitors from 13 countries.\n\nThe final was held on Friday evening on a square in the city of Oulu on Finland's west coast.\n\nYuta “Sudo-chan” Sudo from Japan was second, with Belgium's Lèon \"Leonfire\" Ostrowsky named as the audience favourite.\n\nContestants are judged on the performance of two songs in two separate rounds, each lasting 60 seconds, with the singers pretending to play an imaginary guitar.\n\nHeidi \"Pink Passion\" Toivio of Finland performs in Oulu. (AP: Eeva Riihela/Lehtikuva)\n\nPassion is a must, but much of the rest is up to the contenders.\n\nProps and costumes are allowed, but backup bands and real instruments are off-limits.\n\nThe two-hour final pitted last year's winner, Canada's Zachary \"Ichabod Fame\" Knowles, against eight national champions and seven contenders who emerged from the qualifying rounds.\n\nThe challengers include US champion Saladin \"Six String Sal\" Thomas and German champion Patrick \"Van Airhoven\" Culek.\n\nAapo \"The Angus\" Rautio won the title, marking Finland’s first win since 2000. (AP: Eeva Riihela/Lehtikuva)\n\nThe winner is chosen by a five-member jury of performing arts professionals.\n\nThe champion takes home an actual guitar — a \"Flying Finn\" made by Finnish luthier Matti Nevalainen.\n\nThe championships were first held in 1996.\n\nOrganisers say that \"according to the competition ideology, wars will end, climate change will stop and all bad things will vanish when all the people in the world play the air guitar\".\n\nPatrick \"Van Airhoven\" Culek of Germany. (AP: Eeva Riihela/Lehtikuva)\n\nContestants may, according to the rules, \"use an electric or an acoustic air guitar, or both\".\n\nThe jury takes into account \"originality, the ability to be taken over by the music, stage presence, technical merit, artistic impression and airness\".\n\nEach jury member scores the performances with a mark between 4.0 and 6.0.\n\nEach contestant's scores from the first and second round — the first with a song chosen by the performer and the second with one chosen by the organisers — are added together and the candidate with the highest total score wins.\n\nAP",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/dockers-nat-fyfe-last-game-lake-grace-bombers-finals-hopes/105685890",
    "title": "As Nat Fyfe plays to keep AFL finals dream alive, his junior club does too",
    "publish_date": "Sun, 24 Aug 2025 01:47:04 +0000",
    "category": "sports",
    "authors": [],
    "text": "As the Fremantle Dockers prepare for today's do-or-die clash with the Western Bulldogs, the childhood club of one of its most celebrated stars is playing to keep its finals dreams alive too.\n\nThe Ongerup Football Association (OFA), deep in WA's southern grain belt, has produced its fair share of AFL greats over the years.\n\nHowever, for the Lake Grace-Pingrup Bombers, 300 kilometres south-east of Perth, there is none as revered or decorated as dual-Brownlow medallist, Nat Fyfe.\n\nIn his final season before retirement, Fyfe and his Dockers teammates are chasing the premiership title that has eluded both player and club.\n\nA win today would keep that dream alive.\n\nNat Fyfe started playing junior football in Lake Grace. (AAP Image: Tony McDonough)\n\nA tale of two teams\n\nBut as the ball bounces down in Victoria for what could be Fyfe's last game, the hometown team where he started his football journey are hoping for a win of their own.\n\n\"It's the Bombers vs the Bombers; Lake Grace-Pingrup versus Boxwood Hill,\" Lake Grace-Pingrup club president Chris Poot said.\n\n\"It will be a tight tussle, but I'd like to think we can come away with the win and push through to the preliminary final.\"\n\nChris Poot hopes both the Dockers and Bombers can keep their finals hopes alive. (ABC Great Southern: Andrew Chounding.)\n\nLake Grace-Pingrup, the league's reigning champions who sit third on the OFA ladder, will play at the same time as the Dockers.\n\nPoot said the shared fate of both teams wasn't lost on locals.\n\n\"It's pretty serendipitous or coincidental, but it's definitely one of those things that's sort of dawning on us as well,\" he said.\n\n\"We're all rooting for Nat and the Dockers tomorrow, so that Nat goes one more, and we'll be giving it our all tomorrow as well.\"\n\nMore than 800 people came to watch the semi-finals on Saturday. (ABC Great Southern: Andrew Chounding.)\n\nWhile it may not have been the tens of thousands who bought tickets for the Dockers game in Melbourne, hundreds of people from across the Great Southern flocked to watch their local teams compete yesterday.\n\nPoot, who will run on in today's semi-final, said regardless of the outcome, Fyfe's legacy among the hometown faithful had already been secured.\n\n\"We just love seeing him run around, and there's a lot of support and love there for him as well,\" he said.\n\n\" It's fantastic, it just makes us all proud…[Fyfe] gives our kids aspiration. \"\n\nA banner hung from the Lake Grace pub celebrates Nat Fyfe's first Brownlow Medal win. (ABC Great Southern)\n\nFollowing in Fyfe's footsteps\n\nThose aspirations are already coming to the fore with a crop of the club's promising young players making their mark in the junior league.\n\nUnder 13s player Darcey Pelham, named fairest and best for the league this year, said Fyfe, along with other local players who made it to the AFL, showed young players what could be achieved.\n\n\"It's pretty good to have someone like that come from my town,\" he said.\n\n\"He's just so explosive, how good he used to be; the Brownlows, all the Brownlows he's won.\"\n\nDarcy Pelham hopes to one day make it to the AFL. (ABC Great Southern: Andrew Chounding )\n\nPelham, who was instrumental in his team's 97-16 semi-final win over the Gnowangerup Bulldogs on Saturday, said he hoped to follow in the footsteps of his former clubmate.\n\n\"We played a lot better than last week. Now we're going into the finals and we know we can beat them,\" he said.\n\nHis plan is to move to Claremont Football Club in Perth.\n\n\"I'll try my hardest from there to try and get drafted,\" he said.\n\nAlong with Fyfe, Lake Grace-Pingrup has produced several former AFL players including Mark Bairstow and the Moreton brothers: Cale, Mitch and Jarryd.\n\nIts current crop of players included West Coast's Liam Baker and AFLW player Belinda Smith.\n\nAndrew Lewis says playing conditions in the county produces top grade players. (ABC Great Southern: Andrew Chounding.)\n\n'Full on football'\n\nJuniors coach Andrew Lewis said the hard style of football played in the county was one of the defining qualities of its successful players.\n\n\"They come into a style of football pretty early in their years, that a lot of the suburban football leagues, they don't tend to play the grade of football that we do as a junior footy side,\" he said.\n\n\"They're exposed to some pretty full-on football early in their years, so they come along really well.\n\nThe club has a number of junior players who are earmarked to make it to the next level. (ABC Great Southern: Andrew Chounding)\n\nHe said, along with Pelham, there were several other junior players the club had its eye on that could follow in the footsteps of the likes of Fyfe and Smith and make their way to the AFL.\n\n\"There's a lot of talent … they are sort of half a dozen, I reckon, around the association, they could definitely go further,\" he said.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/afl-r24-gws-saints-bulldogs-dockers-lions-hawks-live-blog/105690572",
    "title": "Live: Giants aiming to lock in finals spot before Dogs-Dockers blockbuster",
    "publish_date": "Sun, 24 Aug 2025 01:42:06 +0000",
    "category": "sports",
    "authors": [
      "Chris De Silva"
    ],
    "text": "The GWS Giants host St Kilda at the Sydney Showgrounds as one of four separate teams who require a win to seal their spot in the top eight for the AFL finals.\n\nLater, the Western Bulldogs face off against Fremantle from 3:15pm (all times AEST), with the loser of that clash at risk of missing out on the top eight.\n\nIn Sunday's final match, the Brisbane Lions host Hawthorn at the Gabba from 7:20pm, with the Hawks needing a win to secure their finals spot.\n\nThere are also four AFLW matches on, starting with Richmond's clash with the Western Bulldogs at Princes Park from 12:35pm.\n\nLater on Sunday, North Melbourne hosts Port Adelaide at Arden Street from 1:05pm, while Essendon will look to build on a big win last week when it hosts West Coast at Windy Hill from 2:35pm. The final match of Round 2 sees Adelaide host Geelong at Unley Oval from 3:05pm.\n\nFollow the live blog below, keep up to date with all the latest stats in our ScoreCentre, and tune in to our live radio coverage.\n\nKey Events GWS vs STK team news: No late changes for either side 22 minutes ago AFL Sunday live scoreboard C By Chris De Silva A deep dive into the Bulldogs-Dockers blockbuster C By Chris De Silva Pumped for this afternoon's clash between the Western Bulldogs and Fremantle? This yarn from Cody Atkinson and Sean Lawson is the perfect preview for you as they break down all the big numbers involving the two teams. Key numbers that will settle the epic Bulldogs-Dockers season finale A cool bit of symmetry involving Nat Fyfe C By Chris De Silva Fremantle superstar Nat Fyfe is essentially playing to extend his AFL career this afternoon. In a wonderful little twist, Fyfe's home town team, the Lake Grace-Pingrup Bombers, will also take the field around the same time as the Dockers to keep their own finals hopes alive! As Nat Fyfe plays to keep AFL finals dream alive, his junior club does too How could today's action shape the top eight? C By Chris De Silva Hey Chris looking forward to an exciting finals shaping day I know the main events are the last 2 today and night what implications do they have on the 8 - Bailey OK, let's try and break this all down then. If the Giants beat St Kilda first up, they rise to 64 points, however due to their percentage (115.5), they are likely to finish no higher than fifth. Brisbane, currently fourth, will finish with 66 points to go third on the ladder with a win over Hawthorn tonight. If the Hawks win, they rise to 64 points and their superior percentage of 122.7 would see them rise to fourth on the ladder. Then that Dogs-Dockers match. If the Bulldogs win, they will go to 60 points and due to their percentage of 140.3, could rise as high as fifth. Fremantle would rise to 64 points with a win, but are unlikely to finish any higher than sixth due to their percentage of 108.6. I hope that all makes sense Bailey! GWS vs STK team news: No late changes for either side C By Chris De Silva Both GWS and St Kilda are set to line up as originally selected at the Showgrounds this afternoon. Jacob Wehr starts as the Giants sub, while Jack Macrae is St Kilda's sub. Here's a look at the two team line-ups. Just a reminder that the first bounce is set for 12.20pm. GWS and St Kilda's team line-ups for the Round 24 clash at the Sydney Showgrounds. (AFL.com.au) Here's this afternoon's AFLW action C By Chris De Silva We've also got four AFLW matches on deck today, it's really the perfect day if you're a footy lover. Here's a look at what time those are on, and where the teams are playing: 12.35pm: Richmond vs Western Bulldogs @ Princes Park 1.05pm: North Melbourne vs Port Adelaide @ Arden Street 2.35pm: Essendon vs West Coast @ Windy Hill 3.05pm: Adelaide vs Geelong @ Unley Oval Welcome! C By Chris De Silva Good morning and welcome to ABC Sport's live AFL coverage. Whew, what a massive day filled with finals implications we've got ahead of us! Here are the three men's fixtures on deck, with up to four teams needing a win to ensure a spot in September: 12.20pm: (6th) GWS Giants vs St Kilda @ Sydney Showgrounds 3.15pm: (8th) Western Bulldogs vs (7th) Fremantle @ Docklands Stadium 7.20pm: (4th) Brisbane Lions vs (5th) Hawthorn @ Gabba Strap yourselves in as we bring you all the latest news from around the league as well as live action, which kicks off in just under an hour's time!",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/golf-minjee-lee-brooke-henderson-canadian-open-3rd-round/105690598",
    "title": "Double eagles help Lee draw level with hometown hero at Canadian Open",
    "publish_date": "Sun, 24 Aug 2025 01:26:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "The eagle has landed — twice — to help Australian golfer Minjee Lee soar to a share of the lead at the Canadian Women's Open.\n\nLee wasn't the only player to go on a scoring tear, with Canadian Brooke Henderson also holing out for eagle from a greenside bunker on the short par-4 17th to the delight of her large partisan gallery.\n\nBoth Lee and Henderson carded six-under 65s in the third round at the Mississaugua Golf and Country Club to sit at 11-under 202, sharing a handy three-shot buffer over their nearest challengers going into the final round.\n\nLee chipped in for birdie on the par-4 eighth, then made a long eagle putt on the par-5 12th. She ran in an eight-footer for another eagle on the 17th, then chipped in again to save par on the par-4 18th.\n\n\"I would say those two [eagles] are my highlights and, obviously, the chip-in on the last,\" Lee said.\n\n\"There are no pictures on the scorecard.\"\n\nLee won the KPMG Women's PGA Championship in Texas in June for her third major title and 11th LPGA Tour title, and is currently ranked No.4 in the world.\n\n\"I think it will just be extra exciting being in the final group with Brooke,\" the 29-year-old Australian said.\n\nCanada's Brooke Henderson currently shares the lead with Lee following the third round. (Getty Images: Vaughn Ridley)\n\nHenderson, the 2018 champion at Wascana in Saskatchewan, had an eagle, six birdies and two bogeys in breezy and cloudy conditions on Saturday.\n\nThe local favourite won the last of her 13 LPGA Tour titles in January 2023.\n\n\"It's always been a really special week,\" Henderson said.\n\n\"I feel like I've learned so much every single year playing in it.\n\n\"I was just trying to lean back on some times when I've had a lot of success here, what I did and the mentality I had going into it.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nJapan's Akie Iwai, the Portland Classic winner last week who took a three-stroke lead into the weekend, bogeyed the first three holes in a 72 to drop into a tie for third at eight under with top-ranked Jeeno Thitikul, of Thailand.\n\nThitikul, who shot a third-round 69, is making her first start since taking the No.1 spot in the world from American Nelly Korda.\n\nAustralian Grace Kim (71, 69, 67) is in a four-way tie for seventh place at six under.\n\nAphrodite Deng, a 15-year-old Canadian amateur who was tied for second after an opening 66, was also at six under after a 68.\n\n\"It's been incredible with all the people out here supporting me,\" Deng said.\n\nKorda was tied for 24th at three under after a 72.\n\nAAP",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/training-young-people-to-run-music-festivals/105538970",
    "title": "Young musicians go behind the scenes to drive next wave of festivals",
    "publish_date": "Sun, 24 Aug 2025 00:55:38 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Energy vibrates through a small town backyard shed as a young band jams, inspired by classic Aussie hard rock.\n\nTemperate, whose members rehearse in Coramba in northern New South Wales, is preparing to perform at an upcoming all-ages live music event at Coffs Harbour.\n\nThe Coastal Grown event, which is being curated and delivered by a group of young people from the region, will feature aspiring local bands.\n\nIt is the culmination of pilot project Outset by the state's music body, MusicNSW.\n\nThe aim is to boost opportunities for regional musicians while also supporting Australia's music festival industry, which has struggled in recent years.\n\nTemperate guitarist, 21-year-old Scott Shrimpton, is part of the 10-member Outset youth committee running the event.\n\nScott Shrimpton plays guitar with band Temperate during a jam session at Coramba. (ABC News: Charles Rushforth)\n\n\"It's such a crucial part for us as Temperate to know how to reach out to people and how to put this live event together, not just for us, but for other musicians as well,\" he said.\n\n\"We are just five young kids coming from the Coffs Coast trying to make a bigger name, and share what we love to do.\n\n\"It's amazing to see there are other people like that, even in our community.\"\n\nMusicNSW program manager Caitlin McGregor said the committee members, all aged 15 to 25, were receiving hands-on experience in every aspect of event planning while being mentored by industry experts.\n\nThe Outset youth committee meets with project manager Andrew Davis. (Supplied: MusicNSW)\n\nMs McGregor said MusicNSW hoped to eventually expand the program across NSW.\n\n\"We want to make sure we are giving young people the skills to eventually put on their own DIY events and all-ages events,\" she said.\n\n\"We feel like that's something that has really limited capacity at the moment across NSW.\n\n\"So, we think equipping this next generation we'll be able to change that festival environment, and the way people are experiencing and getting involved in music.\"\n\nSam Duff is a member of the Outset youth committee and also plays drums. (Supplied: Sam Duff)\n\nPort Macquarie's Sam Duff is also part of the youth committee.\n\nThe 17-year-old is used to being on stage as a drummer and hopes to study at Sydney's Conservatorium of Music.\n\n\"It's really fascinating to look from the other side and discover how music festivals are run; they seem very simple for someone who buys a ticket and turns up, but there's so much that goes into it,\" he said.\n\n\"We spent a day planning, picked our bands, toured the venue, chose names … we also worked with well-known graphic designers, figured out what our posters and social media would look like.\"\n\n'Festival band camp'\n\nThe Young Gums band performs at this year's Gum Ball festival at Dashville. (Supplied: Earth Sea and Sound Photography)\n\nA similar music festival training program runs in conjunction with the annual Gum Ball music festival at Dashville in the Hunter Valley.\n\nThe festival's founder, Matt Johnston, said the program, Young Gums, started after the COVID-19 pandemic to increase opportunities for up-and-coming musicians and boost their waning engagement with teenagers.\n\n\"The Young Gums is a five-day mentorship where we get a lot of the performers from the festival, a lot of local professional musicians with different skill sets, and they sit in with 10 kids [aged 13-17] from regional NSW,\" he said.\n\n\"They write songs, and on the last day of the festival they all come together and form a band.\n\n\"It's an incredible thing to witness these kids evolve and come out of their shell.\n\n\"They see what's achievable and they have a sense of ownership and feel part of the festival.\"\n\nRex Wardle and Neve Scully perform as part of Young Gums. (ABC News: Anthony Scully)\n\nYoung Gums musical director Laura Sands said this year's event in April was another success.\n\n\"This is pretty much a band camp for festivals,\" she said.\n\n\"This is the fifth year, and the kids are smashing it.\"\n\nLaura Sands and Christopher Dale are mentoring young people. (ABC News: Anthony Scully)\n\nMr Johnston, 42, said it was crucial the next generation was equipped with the skills needed to run music festivals.\n\n\"I have been doing the festival for 20 years,\" he said.\n\n\" It's nice for us to know there are young people there to take the baton and be part of it in the future. \"\n\nMusic industry hopes\n\nAustralian Festival Association managing director Olly Arkins said it was encouraging to see programs like Outset and Young Gums as the festival industry started to regain confidence after the COVID-19 pandemic.\n\nThe Dashville Skyline music festival has drawn crowds. (Supplied: Dashville Skyline)\n\n\"In 2025 we have seen the sector turn a corner. From a ticket sales perspective and anecdotally, it feels a lot more positive,\" they said.\n\n\"We are still needing to ensure grassroots festivals are starting … so we have that pipeline of talent and audience coming through.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/online-how-to-sew-content-creator-turns-hobby-into-business/105660000",
    "title": "Teacher turns sewing hobby into social media business",
    "publish_date": "Sun, 24 Aug 2025 00:33:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "As the rhythmic sound of Domenica Tootell's sewing machine fills her studio, each loading of the bobbins and stitch change is captured by a simple yet sophisticated video camera set-up.\n\nShe is among a growing cohort of creatives who have turned to social media as a means to educate others, and earn an income, from home.\n\nBut Mrs Tootell is not new to the online business world.\n\nHer passion for sewing began when she moved to Loxton in 2007 to teach in South Australia's Riverland.\n\nDomenica Tootell showcases different machines used in her sewing video content. (ABC Riverland: Stephanie Nitschke)\n\nThough she was new to the practice, she says she took to the creative activity like a fish to water.\n\n\"When I was in high school I really enjoyed woodwork. Sewing wasn't available at my particular school, so anything that was to do with making things with my hands, I really enjoyed,\" she said.\n\nIn 2013, while on maternity leave after having her daughter, Elyse, Mrs Tootell turned her hobby into an online business.\n\n\"I put everything together about what I love doing: teaching, sewing, learning,\" she said.\n\n\"I'm a visual learner, so it just happened that making a website and a YouTube channel teaching people how to sew was what seemed to work for me.\"\n\nDomenica Tootell uses social media to teach others how to sew. (ABC Riverland: Stephanie Nitschke)\n\nHumble beginnings\n\nThe success of her online business has allowed Mrs Tootell to take a break from the classroom this year.\n\n\"I still work two days a week running playgroups … and doing some relief teaching work here and there,\" she said.\n\n\" The business is gradually becoming the main hustle, and makes my weekdays more flexible. \"\n\nMrs Tootell has come a long way from being a beginner herself.\n\n\"The first thing I made that I was really proud of was a little welcome applique block,\" she said.\n\n\"I remember taking it to work one day to show a lady there who was really into quilting.\n\n\"I thought, 'She's going to be so impressed with this' [but] she looked at it and said, 'What did you cut your fabric with?'\n\n\" The cutting lines that were supposed to be straight were not straight, because I just cut them with normal scissors. \"\n\nSewing shears are a popular choice to make sure fabric is cut clean. (ABC Riverland: Stephanie Nitschke)\n\nSome 12 years on, her YouTube follower count hit 210,000, with more than 21.7 million views across her top 10 videos.\n\n\"It's … something that's grown slowly. It just feels like something I do now,\" she said.\n\n\" It's something that I still learn a lot from, watching videos. \"\n\nHow-to boom\n\nToday, online how-to content is available for almost everything on creator platforms including YouTube and TikTok.\n\nCharles Sturt University senior communications lecturer Travis Holland said social media had democratised content creation to allow people to both produce and distribute it, and access it from an audience perspective.\n\nTravis Holland says social media has disrupted traditional content creation. (Supplied: Travis Holland)\n\n\"We are seeing people, for example, in regional areas being able to build those global audiences despite being outside the sort of traditional circuits of capital and influence that we might have seen previously,\" he said.\n\n\" You don't have to be in Sydney anymore to be at the centre of Australia's cultural industries, you can be in a regional town. \"\n\nDr Holland said the medium stood out to people looking to turn hobbies into businesses, and despite a drop-off post-pandemic, the number of creators had continued to grow.\n\n\"The trajectory is only [going] up,\" he said.\n\n\"If you can have an audience of even 2,000 people who are regular viewers and engage with your content, but they're scattered all over the world, that's something that would never have flown on traditional media.\"\n\nDomenica Tootell has updated her home sewing room to have storage space for all her supplies. (ABC Riverland: Stephanie Nitschke)\n\nA new space for growing passion\n\nDr Holland said authenticity was a major drawcard for audiences engaging in online educational content.\n\n\"You actually have to be interested in the thing you're producing content around in order for other people who are in that space to trust you,\" he said.\n\n\"And so we get creatives like sewing instructors representing the shift from traditional craft education, that might have happened in community centres, to this personalised on-demand learning.\"\n\nDomenica Tootell now has a dedicated workspace for sewing. (ABC Riverland: Stephanie Nitschke)\n\nMrs Tootell's online success has allowed her to establish a bigger creative space to continue to film her sewing content.\n\n\"In the past I've really just worked from our little office in the house … it was very hard to create in there,\" she said.\n\n\"Having a nice, big space just makes it easier. I can have a couple of projects on the go if I want to as well, and I've got a dedicated workspace to go into now.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/teen-girl-prepares-for-car-burnout-comps-in-custom-v6-commodore/105649696",
    "title": "14yo 'leadfoot' hopes to take WA's burnout scene by storm",
    "publish_date": "Sat, 23 Aug 2025 23:58:36 +0000",
    "category": "sports",
    "authors": [],
    "text": "As the dust from a smoking set of tyres settles, a 14-year-old girl steps out of the haze.\n\nClutching a nitrous bottle plush toy and a black and yellow number plate marked SKIDZZZ, Briella Scantlebury hopes to show young women they can claim their place on the pad.\n\nFrom the town of Harvey, south of Perth, Briella had been begging her parents for a skid car for months, after being exposed to the sport at the Collie Motorplex.\n\nBriella Scantlebury's birthday skid car was completed with a personalised licence plate for the sport. (ABC South West WA: Pip Waller)\n\n\"It was the morning of my 14th birthday and I was opening my presents when my parents told me to walk outside,\" Briella said.\n\n\"And there it was, sitting out there on a trailer.\n\n\" It was probably one of the best birthdays I've ever had — getting a bloody skid car. \"\n\nBriella's stepdad Damien Shaw modified a Holden Commodore V6 ute to ensure it was appropriate for burnout competitions.\n\nThose competing in the sport are judged based on their ability to perform controlled manoeuvres, with points awarded for smoke volume and driving skill.\n\nMr Shaw said Briella was a \"leadfoot\" the moment she got behind the wheel.\n\n\"She's not one of these kids where you have to turn around and say you need to push the accelerator harder,\" Mr Shaw said.\n\n\"She pretty much bashed it to the limiter straight away.\n\n\" Instead of her sitting on her phone and scrolling through videos of other people doing it, now she can do it herself. \"\n\nBriella Scantlebury took part in an Open Pad Skids event at the Collie Motorplex in August. (ABC South West WA: Pip Waller)\n\nBehind the wheel at 14?\n\nIn order to compete, Briella needs a special licence issued by the Australian Auto-Sport Alliance.\n\nShe can drive only with parental permission and needs to have someone over 18 years old in the car with her.\n\nMr Shaw said both the cars and venues were fully prepared to cope in the event of an incident.\n\nDamien Shaw says his stepdaughter's reaction was \"gold\" when she first got behind the wheel of her new skid car. (ABC South West WA: Pip Waller)\n\n\"The car has a fire extinguisher inside it and the skid pad itself has fire marshals and ambulance crew,\" he said.\n\n\"Helmets are mandatory and we've gone a little bit above with Briella and bought her a fire suit even though she doesn't need one.\"\n\nBriella said it was \"pretty out of sorts\" to be a 14-year-old girl competing in the motorsport, and she hoped to show other girls there was a place for them too.\n\nBriella Scantlebury and Damien Shaw work on modifying their Commodore together. (ABC South West WA: Pip Waller)\n\n\"There's some people out there that hate on the sport and they think it's just not good enough,\" Briella said.\n\n\"But I find it really interesting how people just like tip in really fast and swing the car and create lots of smoke.\n\n\" Girls can do the same amount of things boys can do. If you don't like it, you don't like it, but if you do, you may as well get into it. \"\n\nChallenging the 'hoon' stereotype\n\nBriella is aiming to take part in a burnout competition by the end of 2025.\n\nA number of events are held in regional WA, including in Bunbury, Collie, Waroona and Albany.\n\nChloe Wojtowicz, who helps organise the Bunbury Burnout Challenge, said she had seen a \"huge climb\" in drivers of all genders over the past decade.\n\n\"At some comps there's usually a ladies class, prizes for the best lady driver and they often out-drive the boys,\" Ms Wojtowicz said.\n\n\"Not only are you having a bit of fun and getting comfortable testing the limits, but you're also learning defensive driving as well.\"\n\nChloe Wojtowicz says interest in the burnout scene has skyrocketed in the past decade. (ABC South West WA: Pip Waller)\n\nMs Wojtowicz said those involved in the sport were working hard to challenge negative stereotypes.\n\n\"When people hear a loud car they obviously think bogans, ferals, that kind of thing,\" she said.\n\n\"But at the end of the day we're all people that love that horsepower, the loud sounds, the loud music and the fun nights.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/cycling-jasper-philipsen-wins-first-stage-la-vuelta-a-espana/105690520",
    "title": "Belgian star recovers from horror crash to claim first stage of La Vuelta",
    "publish_date": "Sat, 23 Aug 2025 23:33:36 +0000",
    "category": "sports",
    "authors": [],
    "text": "Sprint ace Jasper Philipsen has bounced back from the crash that prematurely ended his Tour de France, leaving him with a broken collarbone and ribs, as he sprinted to victory on the opening stage of La Vuelta a Espana.\n\nWith the great Spanish race making its first ever start in Italy, the star Belgian speedster claimed the red jersey after comfortably outpacing his nearest challengers in Novara following a textbook lead-out from his Alpecin-Deceuninck team in Saturday's (Sunday AEST) bunch finish.\n\nBriton Ethan Vernon, of Israel-Premier Tech, was second and Venezuelan Orluis Aular, of Movistar, came home third, but neither looked close to upsetting the 27-year-old Philipsen, the quickest man in the peloton right now, as he eased to his 14th Grand Tour stage win.\n\nOn the largely flat 186.1km ride from Turin to Novara, which had previously hosted two Giro d'Italia finishes, six riders formed a breakaway and opened up a two-minute lead.\n\nBurgos Burpellet's Hugo de la Calle launched a solo attack with 83km to go but he was caught by the peloton with 38km left before the teams set the stage up for the sprint finish which Philipsen finished off with aplomb.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nPhilipsen, who had also taken the yellow jersey at last month's Tour before a third-stage crash ended up ruling him out of the race, enthused: \"Winning is always a nice feeling and definitely when there is a reward like the red jersey, of course it's a nice present.\n\n\"We managed to do our lead-out the way we wanted to. In the final kilometre, they executed it perfectly. I saw 175 meters to go and had to start sprinting, I'm really happy it worked out for us.\n\n\"After my crash in the Tour, I was really disappointed to be out, it was a setback. This was a nice goal, but I knew we only had one chance because there aren't many opportunities for a sprinter like me at this Vuelta.\"\n\nNine of the 10-strong Australian contingent, headed by world road race silver medallist Ben O'Connor (Jayco AlUla) and former Giro d'Italia champ Jai Hindley (Red Bull-BORA-hansgrohe), safely negotiated the opening day.\n\nBut Jay Vine (UAE Team Emirates) had a bad day, bringing up the rear of the field nearly three-and-a-half minutes adrift.\n\nAAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/op-shop-use-but-also-fast-fashion-on-rise-due-to-cost-of-living/105672094",
    "title": "Fast fashion undermines op shop efforts to keep stuff out of landfill",
    "publish_date": "Sat, 23 Aug 2025 22:40:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Graeme Kendall rarely misses the opportunity to snap up a bargain.\n\nHe has been a loyal customer at his local tip shop for years and regularly digs out hidden treasures.\n\nIn an increasingly throwaway society, tip shops and second-hand stores are playing a vital role in keeping rubbish out of landfill.\n\nHowever, as consumers turn toward e-commerce retailers like Shein and Temu that sell items at a very low cost, second-hand stores are being overwhelmed with donations of poor quality.\n\nThe Reviva Centre in Noosa recycles all kinds of household items, giving them a second life. (ABC Sunshine Coast: Jessica Ross)\n\nFinding quality items at a low price comes with the territory for experienced tip-shoppers like Mr Kendall.\n\nVisits have not been as frequent since the retiree had a procedure on his eye last year.\n\n\"When I was right, about 12 months ago, I would come here every four to six weeks,\" he said.\n\n\"You'd find stuff here all the time. I got really wrapped up one day and I bought a spa bath.\n\n\"I haven't put it in yet but I've cut the hole in the deck so I can just walk out of my bedroom and get in the spa bath under the stars.\"\n\nMore than 7,000 mattresses were recycled at the Reviva Centre last financial year. (ABC Sunshine Coast: Jessica Ross)\n\nProviding a second life\n\nThe local tip shop and second-hand stores have long been ingrained in Australian society, giving household items and clothing a second life.\n\nThe Reviva Centre, based in Noosa, plays a crucial role in keeping items out of landfill.\n\nSite manager Mitchell McIntyre said they had noticed an increase in sales over the past few years, and he suspected it was due to the cost-of-living crisis.\n\nMitchell McIntyre says he still gets surprised by some of the things that come through the store. (ABC Sunshine Coast: Jessica Ross)\n\nPeople had told him they would normally go to big hardware stores, but these days, \"They're coming to us first,\" he said.\n\n\" Anything from hardware, wood to furniture, we're probably 10 to 20 per cent of the price — if it's in good condition — of the Bunnings equivalent. \"\n\nTrips to the tip have allowed Mr Kendall to save more than a penny or two.\n\n\"Thousands and thousands and thousands, mate,\" he chuckled.\n\n\"You've gotta walk around and see things and you use your imagination.\"\n\nThe Reviva Centre, a not-for-profit, diverted more than 270 tonnes of waste last financial year and served more than 23,000 customers.\n\nThe Reviva Centre rehomed more than 277 tonnes of household items in the past financial year. (ABC Sunshine Coast: Jessica Ross)\n\nMr McIntyre admitted he had raised an eyebrow at a few things that had come through the facility.\n\n\"I can't say the strangest thing I've seen as it's a little bit X-rated, but we've had some really amazing stuff like full-on boats that we can only just fit in the yard,\" he said.\n\n\"Lately, we're averaging around 500 to 600 recycled mattresses every month. You can imagine 8,000 mattresses piled up in landfill.\n\n\"We have guys here that will strip the mattress, take the steel out, get the foam out of it, and the foam will go down to Clark Rubber and be recycled into underlay.\n\n\"It's saving a lot.\"\n\nFast fashion crippling progress\n\nWhile some consumers are turning to a sustainable approach of using recycled goods to save money, experts argue the progress made is likely being cancelled out by the rise of online fast-fashion stores.\n\nUniversity of the Sunshine Coast international business educator and researcher Jacqueline Burgess said there was a tug of war taking place among young consumers.\n\nJacqueline Burgess warns single-use clothing from fast-fashion retailers voids the rise in second-hand consumers. (ABC Sunshine Coast: Jake Kearnan)\n\nDr Burgess said while people aged between 18 and 35 were more likely to shop at a second-hand store than any other demographic, they were also the biggest consumers of fast-fashion retailers.\n\n\"While sustainability is important and a factor there somewhere, it seems like it's more low cost that is driving this,\" she said.\n\n\" The issue is: if you can buy it new for $5 why are you going to spend $4 at a second-hand store? \"\n\nLow-cost e-commerce retailers provide an option for consumers grappling with rising costs. (Reuters: Dado Ruvic)\n\nOnline retailer Shein recorded more than $1.2 billion in sales in the Australian market last financial year and it has set off a chain reaction.\n\nDr Burgess said Shein's business model of low cost, low risk and fast delivery was creating a market for single-use clothing, wreaking havoc on local businesses.\n\n\"There is less reusable clothing coming through because Shein has designed clothing that can be worn once,\" Dr Burgess said.\n\n\"Op shops are being absolutely drowned in donations but unfortunately the quality of those donations is decreasing, which then goes into landfill.\"\n\nThe 18-35-year-old demographic is the most likely to buy second-hand goods. (ABC Sunshine Coast: Jessica Ross)\n\nDr Burgess said the cost-of-living crisis was aiding fast fashion and that unless stricter regulations were implemented, online retailers were here to stay.\n\n\"Secondhand stores are binning huge amounts of donations because they don't have the energy, time or resources to repair anything,\" she said.\n\n\"It's a real cycle of problems happening here.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/tas-north-hobart-skate-park/105632292",
    "title": "Hobart skaters petition for park rebuild as wheels 'get stuck in cracks'",
    "publish_date": "Sat, 23 Aug 2025 22:25:51 +0000",
    "category": "sports",
    "authors": [],
    "text": "It was the most bizarre thing skater Paul McMacken had ever seen.\n\nEach week, 50 to 100 girls were turning up to the skate park in North Hobart to learn how to skateboard.\n\n\"I'd speak to people all over the country and they couldn't understand what was going on in Hobart,\" he said.\n\n\"I mean, it was a sport that was always male-dominated worldwide.\"\n\nPaul McMacken coaches the next generation of Tasmanian talent, running She Shreds sessions and high-performance training for Hobart skaters. (ABC News: Ebony ten Broeke)\n\nMr McMacken said the surge in female skaters during the 2010s came when father-of-two Jared Andrews started the organisation 'She Shreds', to give local girls a safe opportunity to try skating.\n\n\"Before She Shreds started, I probably could have named the one or two, three girls in Tasmania who skated,\" Mr McMacken said, as president of the organisation.\n\n\" And now there's thousands of them. \"\n\nNorth Hobart Skate Park was built in 2002, quickly becoming a central spot for the local scene. (ABC News: Ebony ten Broeke)\n\nEleven years on, skaters say She Shreds deserves a facility that can further ramp up their skaters' success.\n\nThe petition to Hobart Council and the Tasmanian government says an upgrade will level the playing field for local athletes. (ABC News: Ebony ten Broeke)\n\nAn online petition with more than 1,000 signatures lists annoyances at North Hobart Skate Park, including cracks and a lack of lights or shelter.\n\nIt also envisions more modern obstacles to restore the renown the park enjoyed in the 2000s.\n\nHobart City Council occasionally repairs damage but can't keep up with the facility's age, skaters report. (ABC News: Ebony ten Broeke)\n\nGen Alpha skaters reach for greater heights\n\nFifteen-year-old Zailee Jackson has skated for five years. She Shreds sessions and high-performance groups with Mr McMacken helped her find her bearings.\n\n\"It would be pretty cool to become a professional skateboarder,\" she said.\n\n\" But it's a bit hard down here in Tassie to get to that good of a level. \"\n\nZailee Jackson has visited visited skate parks on the mainland that allow for more advanced training. (ABC News: Ebony ten Broeke)\n\nShe said other states had more advanced and better-maintained skate parks.\n\n\"A lot of the concrete is falling apart so it makes it a bit tricky to dodge the holes in the concrete,\" she said about North Hobart Skate Park.\n\n\" Sometimes when I'm doing tricks, my wheels will get stuck in one of the little gaps or cracks. \"\n\n'Vert ramps' in Hobart are only half the height of those found in high-level skate parks. (ABC News: Ebony ten Broeke)\n\nNext year, She Shreds will be forced to vacate their shed and find a new home. They also rely on public facilities like North Hobart Skate Park.\n\nMr McMacken said it was time for governments to back young Tasmanian skaters with adequate facilities.\n\n\"I think they need to understand now it's an Olympic sport, we've got skaters down here that could be competing on the world stage.\"\n\nShe Shreds will be forced to leave their shed in Melville Street next year, the premises up for sale by the University of Tasmania. (ABC News: Ebony ten Broeke)\n\nTokyo 2020 Olympian Grace Cochrane spent several years with She Shreds.\n\n\"She could have continued if she had the opportunities. It was pretty hard for her,\" Mr McMacken said.\n\nNostalgic skaters hesitant to erase history\n\nLouis Carney's daughter Iris now contributes to the legacy of the skate park, affectionately known as Elizabeth College Skate Park, or EC. (ABC News: Ebony ten Broeke)\n\nSkater Louis Carney has documented the history of the park from its beginnings.\n\n\"It is more than just concrete and it's so deeply embedded with decades of history, stories and community identity,\" he said.\n\nMr Carney recently returned to skating and makes a point to bring his daughter to the North Hobart Skate Park next to Elizabeth College (EC).\n\n\" We'll drive 45 minutes to go to EC and we'll drive past three skate parks on the way. You want to be at EC because it's the hub. \"\n\nNorth Hobart Skate Park is imprinted with memories for multiple generations of skaters. (ABC News: Ebony ten Broeke)\n\nHe was shocked to see the state of the park but suggested rolling current features into any new design.\n\n\"I think a full demolition would be harsh and culturally insensitive,\" he said.\n\n\"It's critical that the council and the designers work closely with the local skate community.\"\n\nThe right facility for a diverse community\n\nHarrison Mol co-organised the petition to upgrade the skate park near Elizabeth College, affectionately known as EC Skate Park. (ABC News: Ebony ten Broeke)\n\n\"If you come down here on a weekend or during peak times, it is packed. It's still obviously a highly valued location,\" lifelong skater Harrison Mol said.\n\n\"However, it's no longer up to the standard that it should be,\" Mr Mol said.\n\nMr Mol said planners should work with everyone involved to get a better facility.\n\n\"Whether that's doing a complete redo or trying to preserve some of the features of the skate park that are important and are of historical relevance.\"\n\nHarrison Mol has travelled extensively as a skater and seen large investments into skate parks on the mainland. (ABC News: Ebony ten Broeke)\n\nMr Mol said She Shreds was an initiative he had not seen the likes of elsewhere in Australia.\n\n\"We should be building this skate park for She Shreds.\"\n\nThe Hobart City Council is currently working on renewing its lease over the Crown land where the North Hobart Skate Park is located, according to David Reeve, the council's director infrastructure and assets network.\n\nThe Hobart City Council maintains North Hobart Skate Park. (ABC News: Luke Bowden)\n\n\"When the lease is resolved — pending both ministerial and council approval — plans will be developed to renew the skate park as part of broader sport and recreation priorities,\" Mr Reeve said.\n\n\"In the meantime, while the facility is nearing the end of its useful life, council continues to carry out regular maintenance, including routine inspections and repairs to ensure the park remains safe and usable.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/call-to-reopen-rapid-bay-jetty-dive-site-after-storm-damage-sa/105670726",
    "title": "Operator says business will go under if SA dive site doesn't reopen",
    "publish_date": "Sat, 23 Aug 2025 22:21:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "Divers and tourism operators are lobbying the South Australian government to secure the remnants of the Rapid Bay jetty in the state's south-east so the world-class dive site beneath can be reopened.\n\nThey have been unable to access the site since a 20-metre exclusion zone for all swimmers and boats was placed around the remaining sections of the jetty in June, after it was further damaged by storms.\n\nThe original jetty was constructed in the 1940s by BHP and was used to load limestone from an adjacent quarry.\n\nAt 488m long with a 200m T-section at the end, it fell into disrepair in the 1990s and was closed to pedestrians in 2004.\n\nHowever, it remained an important site for marine life and divers.\n\nA concerted effort by residents to ensure the community was not left without a jetty resulted in a new Rapid Bay jetty being constructed and opened in 2009, with the old jetty structure remaining in place.\n\nFear dive business will go under\n\nPeter Corrigan has been diving since 1986 and is one of several tourism operators who conduct underwater tours at Rapid Bay.\n\nPeter Corrigan, runs Sea Dragon Dive Lodge, says the old jetty can be repaired. (Supplied: Peter Corrigan)\n\nHe said if the area underneath the old jetty was not made safe and the site reopened, his business, which was already suffering due to the state's algal bloom, would go under.\n\nMr Corrigan said it was obvious the storm damage had made the jetty more dangerous to dive under, but any parts posing a danger could be removed or secured.\n\n\"It can be repaired and made safe for divers again,\" he said.\n\n\" It's one of the best dives in the world. That's no exaggeration. \"\n\nThe damaged old Rapid Bay jetty, as seen from the end of the new jetty. (ABC South East SA: Caroline Horn)\n\nMr Corrigan said many of his international and interstate customers came to the state specifically to see leafy seadragons in the area.\n\n\"It's on a lot of people's bucket list to scuba dive and they get trained up and they come down here and they do courses,\" he said.\n\nMr Corrigan is hopeful the area, with its historically large colony of leafy seadragons, will recover from the current algal bloom and said it could even help repopulate the species in other areas.\n\nHopes for future after bloom\n\nCatherine Larkin, a marine biologist and operations manager for the conservation organisation AusOcean, also believes the area under the old Rapid Bay jetty is one of South Australia's best dive sites.\n\nCatherine Larkin says Rapid Bay is an important training site for divers. (ABC South East SA: Caroline Horn)\n\n\"I don't think people realise how important this site is for divers,\" she said.\n\n\" It's one of the only sites in the state where you are pretty much guaranteed to see the leafy seadragon. \"\n\nA petition created by AusOcean, with the support of the Scuba Divers Federation of South Australia, has already attracted more than 1,700 signatures.\n\nMs Larkin said on her last dive, shortly before the storm damage, it was apparent the site had been impacted by the algal bloom, but at that time there was still visible life in the area.\n\nSome of the marine life under the old Rapid Bay jetty. (Supplied: Catherine Larkin)\n\nMs Larkin said Rapid Bay was one of only a few sites accessible to divers from shore and it was important for diver training.\n\nShe said the best area to see the marine life in the area was under the remaining T-section of the jetty.\n\nA spokesperson for the Department for Infrastructure and Transport, which is responsible for the old and new Rapid Bay jetties, said an assessment carried out after storms in May confirmed the structure had further deteriorated.\n\nConstruction on the old jetty started in 1938. (Supplied: State Library of South Australia)\n\nThe spokesperson said the department would investigate options to reduce or remove the current 20m exclusion zone and meet with divers and interested groups to find the best way forward.\n\n\"These investigations, including the costs and viable options, are expected to be finalised in late 2025.\"\n\nThe investigation will also undertake contamination testing on timber and steel components of the old jetty.\n\nNew jetty also under repair\n\nWhile the assessment on the old jetty is carried out, renewal work is being carried out on the adjacent \"new\" jetty.\n\nSwimming and boating has been banned within 20m of the old jetty since June. (ABC South East SA: Caroline Horn)\n\nThe work includes the replacement of four ladders, repairs to steel sections where the coating has been damaged, and installation of protective wrapping on the base of some piles to prevent corrosion.\n\nThe department spokesperson said work on the new jetty, which was open and accessible to all users, was on track to be completed in mid-September.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/tim-looker-admitted-as-lawyer-on-74th-birthday/105660596",
    "title": "74yo swaps birthday cake for lawyer certificate",
    "publish_date": "Sat, 23 Aug 2025 21:57:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "Every month, hundreds of promising legal minds around the country apply to court to be admitted to practice law.\n\nAnd while many are only at the start of their careers, one South Australian man has attended the ceremony before the Supreme Court on his 74th birthday.\n\n\"I've had some interesting birthdays, but this one tops the lot,\" he said.\n\nTim Looker (right) with University of South Australia chancellor John Hill. (Supplied)\n\nMr Looker left school at 15 and spent a few years driving tractors, before a 35-year career as a science teacher and then a stint working in local government.\n\nHe was also awarded a Medal of the Order of Australia in 2003 for his service to youth through the development of outdoor recreation and camping programs with the YMCA.\n\nBut when he retired, he was keen to pick up a hobby.\n\n\"I'm not a fisherman or a golfer, so why not go back to uni and run up a HECS debt?\" he said.\n\nMr Looker said he did not have much of a plan for his law degree, focusing on subjects that caught his interest.\n\n\"All of a sudden I'm finished, and they sent me an email saying I'm about to graduate,\" he said.\n\nMr Looker joked that he \"kept away from the pub crawls\".\n\nTim Looker was awarded a Medal of the Order of Australia (OAM) in 2003 from then-governor Marjorie Jackson-Nelson. (Supplied)\n\nThe most recent available national data from the federal education department found around 3,300 students over 60 started a higher education degree in 2023, making up about 0.05 per cent of new students — a rate that has remained steady for the past decade.\n\nAnd Law Council of Australia data from last year showed about 1 per cent of lawyers in South Australia were still practising past the age of 75.\n\nWhile the South Australian Law Society could not confirm if Mr Looker was the oldest new lawyer in the state's history, president Marissa Mackie commended him for his pursuit.\n\n\"Mr Looker's worldly experience and history of community service, combined with his newly acquired legal credentials, will be ideal for his role in enhancing access to justice for those who need it most,\" she said.\n\n'Very proud' moment for family and friends\n\nLawyers-to-be need a current lawyer to vouch for them at their admission ceremony and for Mr Looker, that lawyer was Richard Tran.\n\n\"It's a ceremony role, but it's really meaningful,\" Mr Tran said.\n\nRichard Tran met Tim Looker at university. (Supplied)\n\nThe pair met in law school and, despite the 50-year age gap, formed a bond.\n\n\"He's always been caring towards me, taught me things about fixing cars, like little stuff that fathers teach their son,\" Mr Tran, who moved to Australia from Vietnam in 2017, said.\n\nMr Looker taught Mr Tran to drive and said he \"sort of adopted him as my fourth child\".\n\nRichard Tran says Mr Looker has taught him a lot. (ABC News: Marco Catalano)\n\nMr Looker said he does not intend to make a living as a lawyer, but will continue to volunteer at a not-for-profit legal service.\n\n\"My degree will be applied to helping those who are disadvantaged,\" he said.\n\n\"I'll do that as long as I'm able and don't lose the plot.\"\n\nHis dad, Don Looker — who is 102 and served in World War II — said he was shocked when he found out his son was studying again and noted how special the timing of the admission ceremony was.\n\nDon Looker (right) says he's \"very proud\" of Tim. (Supplied)\n\n\"I think it's quite meritorious,\" Don said.\n\n\"It's a great achievement and I'm very proud of him.\"\n\nHis daughter, Kate Looker, said she boasts about her dad to everyone — and joked she has big shoes to fill.\n\n\"It makes me feel like I haven't achieved much, but it also means that I have a lot of time to achieve things,\" she said.\n\n\"I'm just incredibly proud.\"\n\nTim Looker with daughter Kate, who says she's \"incredibly proud\" of her dad. (ABC News: Marco Catalano)\n\nMr Looker said he hoped he can inspire older people to never give up on life.\n\n\"Do not talk yourself into old age, there is always something new and exciting out there to do,\" he said.\n\n\"Don't stop.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/football-nestory-irankunda-watford-free-kick-goal/105690460",
    "title": "'Look at my highlight reels': Irankunda opens English account with wondergoal",
    "publish_date": "Sat, 23 Aug 2025 21:49:08 +0000",
    "category": "sports",
    "authors": [],
    "text": "Socceroo teen star Nestory Irankunda has continued his terrific start to life in England, netting his first goal for Watford via a sensational free kick.\n\nThe 19-year-old Tanzanian-born winger, who starred at Adelaide United but didn't make the grade at German champions Bayern Munich, curled a glorious 25-yard free-kick home to give the second-tier Hornets the lead at Swansea in the 35th minute of their 1-1 draw.\n\nBut he had to persuade Moussa Sissoko to let him take the kick, suggesting that his experienced French international captain really ought to take a look at his highlights reels, which feature similar strikes when he was at the Reds.\n\nThe belting strike capped another impressive performance from Irankunda, who proved a real handful for the Swansea defence, including fellow Socceroo Cameron Burgess, all afternoon with his speed and trickery until he was brought off just before the hour as a precaution when he appeared to suffer a hamstring knock.\n\nSnapped up from the Bundesliga giants on a five-year deal, Irankunda had already made a big impression, and was quick to tell reporters how his ambition was to \"make the crowd go wild\" at Vicarage Road.\n\nHe did just that when winning the free kick just after the half-hour, before picking himself up to whip the ball up and over the Welsh side's wall and into the left-hand corner.\n\n\"Oh, my. I've scored some good goals but I reckon that could be in my top five,\" Irankunda said.\n\nWith usual free-kick taker Imran Louza out injured, he took his chance.\n\n\"Obviously, you have to ask for permission, and I said to Moussa, 'I feel confident in taking a free kick',\" he said.\n\n\"He asked me a couple times, 'are you sure you can take free kicks?', I said, 'yeah, go look at my highlight reels!' Then after that, I just put it into the corner …\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nWhen Irankunda went off, soon after being fouled by Swansea's new signing Marko Stamenic, Watford's impetus seemed to be lost and Zan Vipotnik came off the bench for the Swans to rescue a point with an 82nd-minute goal.\n\nIrankunda has been enjoying being back in the thick of the action after his confidence took a bit of a hit in Germany.\n\n\"It's been good,\" he said.\n\n\"I feel like myself again, a whole lot more confident. It's fun to come to training every day. I love playing here.\"\n\nHe's not the only Australian making an early-season mark in English soccer's second tier.\n\nPortsmouth midfielder Adrian Segecic again impressed in a 1-1 draw at West Brom, while Sammy Silvera continues to shine for Middlesbrough as a 2-1 win at Norwich took the side joint-top on a maximum nine points from three games, alongside Stoke, who won 2-1 at Southampton.\n\nAAP",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/workers-take-retailers-to-court-over-safety-aldi-woolworths/105689638",
    "title": "Staff safety concerns raised over supermarket bag checks, security gates",
    "publish_date": "Sat, 23 Aug 2025 21:31:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Sadie Simmonds was just 18 years old when she was attacked at work while conducting a bag check.\n\nShe was working at Aldi in West Footscray and asked a woman at the check-out if she could inspect her bag.\n\nThe customer threw a carton of milk at her face, Ms Simmonds said, and shoved her so forcefully she fell backwards out of her seat, and on to her back on the floor.\n\nShe said what happened to her was not out of the ordinary.\n\n\"I have seen a co-worker have to get stitches because he was so brutally bashed,\" she said.\n\nFormer Aldi worker Sadie Simmonds says she always felt an \"impending sense of doom\" that she might be attacked. (ABC News: Patrick Rocca)\n\nIt made going to work a weekly struggle.\n\n\"There was always this impending sense of doom that at any moment you could be attacked.\"\n\nMs Simmonds, now 20, said it was the moment she decided to join the retail workers union.\n\nAbout 18 months later, working as the health and safety representative at a different Aldi in Keilor Downs, Ms Simmonds handed out a trades hall safety survey to try and gather evidence for her employer that staff did not feel safe at work.\n\nMs Simmonds was fired for allegedly breaching company policy. (ABC News: Patrick Rocca)\n\nWhen she went back to the staff with the results, she was fired for allegedly breaching company policy.\n\n\"I just wanted to draw attention to the issues retail workers face. We have been seeing heightened levels of aggression and violence in stores,\" she said.\n\nThe union filed an unfair dismissal case in the Federal Court on Ms Simmonds's behalf on Thursday.\n\n\" I want retail workers to know they're not alone in this ... They don't actually deserve to be treated like this and legally they should not be treated like this. \"\n\nMs Simmonds hopes her case will lead Aldi to stop mandatory bag checks by staff.\n\nOn Friday, a worker from Woolworths at Werribee Plaza in Melbourne's west lodged a case backed by the union in the Fair Work Commission.\n\nThey claimed bag checks and new security gates at self-serve check-outs had created \"specific and significant risks of customer and offender aggression\" by \"locking abusive … and violent offenders into a confined space with employees and customers\".\n\nThe worker and the union want Woolworths to back down on mandatory bag checks and remove security gates.\n\nThe union has called on Woolworths to stop mandatory bag checks by staff. (ABC News)\n\nRetail and Fast Food Worker Union secretary Josh Cullinan said staff were increasingly afraid to go to work.\n\n\"Bag checks are likely to lead to forms of violence,\" he said.\n\n\"Even if it's one in a 100, they've got so many customers [to serve] they have to worry every single time they look in someone's bag: what's going to come next, is it going to be abuse, is it going to be harassment, is it going to be a punch?\"\n\nMr Cullinan said body-worn cameras rolled out by Coles and Woolworths also put staff at risk because they had to tell customers during bag checks when they began recording.\n\n\"It's about putting staff on the front line to stop stock loss, it's not about safety, it's about theft. Having to have a camera strapped to your body that is in your face … is just asking for trouble. These steps need to stop.\"\n\nA Coles worker wears a body-worn camera in 2023. (ABC News)\n\nAccording to documents from the ACCC supermarkets inquiry last year, abuse, threats, intimidation, assaults and other workplace violence involving Woolworths staff had increased year-on-year since 2014.\n\nRecords of a point-of-sale \"verbal abuse tool\" that allows Woolworths staff to push a button and record verbal abuse instances found they were occurring almost 700 times a week on average, impacting 430 staff members across 233 stores.\n\nDuring the inquiry, Coles reported that from June 2013 to March 2024, about 8,000 cases of customer violence or aggression towards staff were reported.\n\nData from Victoria Police also found retail theft was up 36 per cent across the state in the past year.\n\n\"By putting in place structures to limit stock loss [from] theft, [supermarkets] have been putting our members on the front line and that's what's causing a lot of this hostility,\" Mr Cullinan said.\n\nPolice Minister Anthony Carbines says the government will soon introduce retail worker harm legislation. (ABC News)\n\nPolice Minister Anthony Carbines said the government would be introducing retail worker harm legislation this year, \"that brings serious consequences to those who do harm and assault retail workers\".\n\n\"We need to send a very clear message to the community and reflect the community's expectations that young people and all people who work in our retail sector are safe.\"\n\nAn Aldi spokesperson said the company valued its people and was \"committed to their health and safety\".\n\n\"This matter is currently going through legal proceedings so we cannot comment on the specifics of it.\"\n\nA Woolworths spokesperson said the company treated \"the safety of our team members and customers very seriously\".",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/bendigo-writers-festival-impact-free-speech/105680834",
    "title": "Regional city fears reputational hit over writers' festival fallout",
    "publish_date": "Sat, 23 Aug 2025 21:30:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Bendigo residents believe the recent controversy surrounding the city's signature writers' festival will damage its reputation for years to come.\n\nMore than 50 writers and hosts withdrew from the Bendigo Writers Festival after organiser Greater Bendigo City Council sent a code of conduct to participants.\n\nThe code stipulated writers should \"avoid language or topics that could be considered inflammatory, divisive or disrespectful\".\n\nIt also required guests speaking at La Trobe University-sponsored sessions to comply with Universities Australia's definition of anti-Semitism.\n\nThe move has largely been criticised by free speech advocates.\n\nBendigo council and La Trobe University have not commented on what prompted them to send the code two days before the festival's opening night.\n\nHard work undone\n\nAnthony Radford is a founding member of Believe in Bendigo, a campaign championing diversity in the regional Victorian city following anti-mosque protests in 2015.\n\nHe said the festival fallout had \"without a doubt\" undone some of the work to restore the reputational damage of those protests.\n\n\"Ten years after that to have more national headlines about race in Bendigo is horrible,\" he said.\n\n\" We want people to come to this city and celebrate these events, not boycott these events. \"\n\nMr Radford said the city had more to offer.\n\n\"The [writers' festival] was a way we could promote the city, and the harmony and cultural attributes this city has, and I just feel what happened over the past weekend has potentially been the result of people not understanding that.\"\n\nBusiness owner Georgie Pell says the usually busy writers' festival weekend was quiet this year. (ABC Central Victoria: Emile Pavlich)\n\nBusinesses disappointed\n\nMultiple businesses on Bendigo's main street opposite the arts precinct had ordered extra stock for the weekend.\n\nGeorgie Pell's clothing store Pink Honey was one of those businesses.\n\n\"It's usually a really happening buzz, but it was very, very quiet,\" she said.\n\n\" I felt like many people boycotted the event and didn't come [to Bendigo]. \"\n\nMeanwhile, two hospitality businesses near festival venues decided to close on the Sunday due to a lack of foot traffic.\n\nHayley Tibbett says the festival was not a great result for the local economy. (Supplied: Be.Bendigo)\n\nHayley Tibbett, chief executive of Bendigo's chamber of commerce, Be.Bendigo, said it was a difficult situation and not a great result for the region's economy.\n\n\"It's not really the look that we want for our city either,\" she said.\n\nCity of Greater Bendigo Mayor Andrea Metcalf told ABC Radio Central Victoria Breakfast it was disappointing author cancellations had become the main narrative at a storytelling event.\n\nMayor Andrea Metcalf says it wasn't the writers' festival the city had hoped for. (ABC Central Victoria: Shannon Schubert)\n\n\"It isn't about the city being the story,\" she said.\n\n\" Writers' festivals are risky and they exist to push boundaries, they are there for debate. \"\n\nIn a statement, Greater Bendigo City Council said it intended to \"honour the financial commitments\" to local businesses.\n\n\"The city will reach out to those businesses to chat with them about what that loss looks like,\" Cr Metcalf told the ABC.\n\nBudget papers reveal $2.3 million was allocated for Bendigo Venue and Events in 2024/25, which is a local government arm in charge of all major events.\n\nThe council declined to respond to questions about how much taxpayer funds had been allocated to the festival.\n\nWriter Di Dempsey is worried about the festival's future. (ABC News)\n\nFuture uncertain\n\nGreater Bendigo City Council is yet to confirm if the festival will return in 2026.\n\nBendigo writer Di Dempsey, who attended the festival while expressing solidarity with those boycotting it, said she was \"terrified\" it would shut down permanently.\n\n\"I really hope they don't,\" she said.\n\n\"I hope they use this publicity as a way of turning it around and … say, 'We're not going to let this happen again.'\"\n\nMr Radford agreed and said it was an opportunity for the festival to come back bigger than ever in 2026.\n\n\"A festival that celebrates everything writers love and everything that's really positive about Bendigo,\" he said.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-24/rugby-union-south-africa-vs-wallabies-wrap-o-connor/105690440",
    "title": "'Could've gone either way': Injury-hit Wallabies fall short of second-straight South Africa heist",
    "publish_date": "Sat, 23 Aug 2025 21:27:25 +0000",
    "category": "sports",
    "authors": [],
    "text": "James O'Connor has missed three crucial late kicks as the injury-hit Wallabies suffered an agonising 30-22 loss to South Africa in Cape Town.\n\nThe Wallabies entered Saturday night's (Sunday morning AEST) Rugby Championship match looking to win back-to-back Tests against the Springboks in South Africa for the first time since 1963 following last week's famous 38-22 triumph in Johannesburg.\n\nSouth Africa led 20-7 approaching half-time, but the Wallabies hit back hard after the break and closed the margin to one point in the 68th minute when reserve hooker Brandon Paenga-Amosa touched down following a successful rolling maul.\n\nO'Connor slightly slipped during his conversion attempt, pulling the kick to the near side in what proved to be a major missed opportunity.\n\nSouth Africa extended their lead 30-22 in the 75th minute, but O'Connor had a chance to close the gap back to five points three minutes later with a 25m penalty from a slight angle.\n\nO'Connor pushed that kick to the right this time, and his 50m penalty attempt in the 80th minute, which would have given Australia a losing bonus point, fell short.\n\nYet it was still another brave and encouraging performance from the Wallabies, who were again hamstrung by more injuries.\n\nTom Wright (left) was forced off the ground after just four minutes of action. (Getty Images: Grant Pitcher)\n\nA devastated Tom Wright lasted just four minutes before going off with a left knee injury, while scrumhalf Nic White was forced off in the 13th minute with concussion after his head was slammed into the turf during a slinging tackle.\n\nProp Taniela Tupou dislocated his left pinky shortly before half-time, and outside centre Joseph-Aukuso Suaalii was subbed out at the break after an apparent head knock.\n\nIt came on top of the Wallabies losing skipper Harry Wilson (knee), James Slipper (concussion) and Dylan Pietsch (broken jaw) last week.\n\n\"I'm super proud of my boys,\" stand-in Wallabies skipper Fraser McReight said.\n\n\" We lost a few good men out there, and under a bit of adversity we fought right until the end. It could have gone either way. \"\n\nSouth Africa scored two penalties inside the opening six minutes of the match before the Wallabies struck back through debutant Corey Toole in the eighth minute.\n\nWhite was the mastermind behind the try, with his quick tap-and-go and subsequent dribble kick allowing Toole to run on to the bouncing ball.\n\nSouth Africa replied soon after, with Handre Pollard's cross-kick finding an open Canan Moodie for an easy try.\n\nMcReight was denied a 13th-minute try due to an earlier knock-on, and Australia were left to rue twice turning down kickable penalties in favour of going for touch.\n\nCorey Toole took just eight minutes to score his first Wallabies try on debut. (Getty Images: Ashley Vlotman)\n\nSouth Africa's defence held firm on each occasion, and the scoreline read 20-7 when forward Kwagga Smith barged over in the 35th minute.\n\nO'Connor's penalty after the half-time siren reduced the deficit to 10 points at the break.\n\nAustralia struck first in the second half when O'Connor's chaos kick couldn't be controlled by Springboks winger Moodie, allowing Max Jorgensen to swoop on the loose ball and race over.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nA Wallabies win in Cape Town for the first time in 33 years was on the cards when Paenga-Amosa scored with 12 minutes remaining, but O'Connor's conversion miss was a huge turning point.\n\nBut there were many positives for the visitors, not least the debut of Toole, whose extreme pace and no-fear attack were a constant threat.\n\n\"I know it is a loss, but it was three tries apiece with a team that got destabilised early on. It does give belief,\" Wallabies coach Joe Schmidt said.\n\n\"I feel like we have built some belief. It is a group of players I am enjoying working with immensely. They enjoy their work and the way we are trying to play.\n\n\"I have never had so many messages of support for Australian rugby as I have seen this week.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/afl/afl-live-gws-st-kilda-bulldogs-fremantle-hawthorn-brisbane-in-finals-deciding-super-sunday-20250823-p5mp8d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL LIVE: GWS host St Kilda to kick off Super Sunday",
    "publish_date": "Sun, 24 Aug 2025 12:10:06 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari",
      "Scott Spits"
    ],
    "text": "If GWS expect an easy win over St Kilda, Giants star Tom Green reckons they’d be kidding themselves.\n\nThe Giants only need to flick to last year in the history books to be reminded of how easily Ross Lyon’s Saints can upset the finals order.\n\nIt was round 24, 2024 and Carlton needed to beat St Kilda to seal their top-eight spot.\n\nInstead, Jack Higgins’ last-gasp goal fired the Saints to an upset two-point win that opened the door for Fremantle, who were playing in the last game of the home-and-away season.\n\nTom Green. Credit: Getty Images\n\nThe Dockers ultimately lost to Port Adelaide but it remains a cautionary tale as 12th-placed St Kilda seek to play finals spoilers at Engie Stadium on Sunday, when GWS look to secure a home elimination final.\n\nNow boasting the signature of in-demand talent Nasiah Wanganeen-Milera, Lyon’s side are gunning for a fifth straight win.\n\nThe Giants, one of four teams that started the final round on 60 points, can finish as high as fifth or as low as eighth, depending on how results fall.\n\nIf that wasn’t enough motivation, Giants academy product and defender Harry Himmelberg will also mark his 200-game milestone.\n\n“If we think we’re going to roll in and just get a result, I think we’d be kidding ourselves,” Giants midfielder Green told AAP. “There’s a lot to play for. We won’t be taking the game lightly.”\n\nCurbing Wanganeen-Milera’s impact on the game will be No.1 on the agenda for the Giants.\n\nThe 22-year-old has had a devastating effect on opponents since being moved from half-back into the midfield this year.\n\nDeploying Toby Bedford as a tagger is a lever GWS coach Adam Kingsley could pull, though the midfielder-forward hasn’t been used recently in that role.\n\nIf it were up to Green, it wouldn’t be him either.\n\n“He’s (Wanganeen-Milera) probably too quick for me,” Green joked. “He’s playing a little bit of everywhere and has a bit of a license to go and influence the game in all parts of the ground. He will be a tough prospect to stop and if we can go some way to dealing with him, I’m sure that’ll help us get close to a good result.”\n\nGWS are unchanged for Sunday’s clash after initial hopes of defender Jack Buckley (calf) playing his first game since round 20. Lethal small forward Brent Daniels, absent since round 14, will make his return from an adductor injury through the VFL.\n\nSt Kilda made one change, with last week’s debutant Alex Dodson making way for Isaac Keeler.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/afl/st-kildas-won-the-lottery-bartel-on-splash-for-reid-20250824-p5mpc4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'St Kilda's won the lottery': Bartel on splash for Reid",
    "publish_date": "Sun, 24 Aug 2025 11:46:06 +1000",
    "category": "finance",
    "authors": [],
    "text": "'St Kilda's won the lottery': Bartel on splash for Reid\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/go-kid-fogartys-box-seat-for-mudgee-miracle-20250824-p5mpbr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Go kid': Fogarty's box-seat for Mudgee miracle",
    "publish_date": "Sun, 24 Aug 2025 11:05:32 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Go kid': Fogarty's box-seat for Mudgee miracle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/the-hill-was-pumping-dce-reflects-on-milestone-game-20250824-p5mpbj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'The hill was pumping': DCE reflects on milestone game",
    "publish_date": "Sun, 24 Aug 2025 10:35:19 +1000",
    "category": "sports",
    "authors": [],
    "text": "'The hill was pumping': DCE reflects on milestone game\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/best-goals-mw1-premier-league-20250822-p5mp12.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Best Goals | MW1: Premier League",
    "publish_date": "Sun, 24 Aug 2025 09:51:58 +1000",
    "category": "sports",
    "authors": [],
    "text": "Best Goals | MW1: Premier League\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/chalobah-seals-it-for-chelsea-20250823-p5mp6l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chalobah seals it for Chelsea",
    "publish_date": "Sun, 24 Aug 2025 09:51:55 +1000",
    "category": "finance",
    "authors": [],
    "text": "Chalobah seals it for Chelsea\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/gyokeres-opens-his-premier-league-account-20250824-p5mpa1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gyokeres opens his Premier League account",
    "publish_date": "Sun, 24 Aug 2025 09:51:17 +1000",
    "category": "sports",
    "authors": [],
    "text": "Gyokeres opens his Premier League account\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/wet-weather-ruins-weekend-sports-across-sydney-20250824-p5mpb5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wet weather ruins weekend sports across Sydney",
    "publish_date": "Sun, 24 Aug 2025 09:46:40 +1000",
    "category": "sports",
    "authors": [],
    "text": "Wet weather ruins weekend sports across Sydney\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/regret-hits-pep-after-goalkeepers-horror-error-20250823-p5mp9m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Regret hits Pep after goalkeeper's horror error",
    "publish_date": "Sun, 24 Aug 2025 09:45:53 +1000",
    "category": "sports",
    "authors": [],
    "text": "Regret hits Pep after goalkeeper's horror error\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/surfer-shares-update-after-shark-attack-on-nsw-beach-20250824-p5mpb4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Surfer shares update after shark attack on NSW beach",
    "publish_date": "Sun, 24 Aug 2025 09:39:56 +1000",
    "category": "finance",
    "authors": [],
    "text": "Surfer shares update after shark attack on NSW beach\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/business/companies/subway-s-new-challenger-the-next-penfolds-six-asx-chiefs-on-what-s-hot-20250819-p5mnxv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Subway’s new challenger, the next Penfolds: Six ASX chiefs on what’s hot",
    "publish_date": "Sun, 24 Aug 2025 09:30:00 +1000",
    "category": "finance",
    "authors": [
      "Jessica Yun"
    ],
    "text": "There are only a handful of names that can be considered luxury Australian brands. R.M.Williams is one; Aesop paved the way for high-end handwash; and Penfolds is another. The luxury wine makes up more than a third of parent company Treasury Wine Estates’ total revenue of nearly $3 billion. Patrimony wine from Daou Vineyards: is this the next Penfolds? Treasury has weathered Australia’s trade war with the lucrative China market, which has been fatal for many Australian wineries, without suffering brand damage. It lifted prices, and held them, at a time when many households were struggling with cost of living pressures. While demand for luxury wine continues to grow steadily, cheaper wine has become unpopular. Treasury has been forced to keep its commercial wine brands after trying and failing to find a buyer for the right price. There’s a lot riding on the success of Penfolds. Would it be prudent to have another brand in the works?\n\nIndustry watchers will know that what Treasury’s $1.6 billion acquisition of Californian wine brand Daou Vineyards was about. “It’s interesting; if you’re in California, Daou needs no introduction and Penfolds probably does. Here in Australia, or in China obviously, it’s vice versa,” said Treasury chief Tim Ford. Loading How exactly do you build a brand that’s considered luxury? It’s all about experiences, said Ford, who said old, traditional advertising methods would not cut it any more. “A brand that links to experiences, that then brings status to the consumer as they are consuming, buying, gifting that product, whatever the occasion may be, is how you build these brands,” he said. “It’s a luxury brand playbook from around the world … We don’t think we’ve created it, we’ve copied them from other luxury brands, but we’ve done a pretty good job with Penfolds, and we plan to do a similar job at Daou.”\n\nA2 Milking it Former market darling A2 Milk is best known for its infant formula, but tucked away in this $5.8 billion dual-listed company is a tiny, fast-growing part of the business: milk powder for adults and seniors. One of A2 Milk’s biggest challenges is the declining birth rate in China, a market that accounts for three-quarters of the business. Meanwhile, millions of people are getting older every year, and demand is increasing for fortified and functional milk powder. A2 Milk chief David Bortolussi: The infant formula company’s fastest-growing part of the business isn’t infant formula. Credit: David Rowland “The number of newborns has come down over the last 20 years from 30 million to less than 10 million,” said A2 Milk chief David Bortolussi. “Every year you’ve got almost like 25 to 30 million seniors falling into that [60 years and above] category … Not surprisingly, their nutritional needs are not too dissimilar to younger people.”\n\nA2 Milk recently introduced three new products for bone strength, gut health, and heart health that are going well, Bortolussi said. Its fortified milk business grew 23 per cent during fiscal 2025. “I’d want [it] to be as big as it possibly can.” Subway has a new challenger You might not know Retail Food Group by name, but you’ve almost certainly heard of Gloria Jean’s and Donut King. The food franchisor’s portfolio also encompasses pizza chain Crust, Brumby’s Bakery, Beefy’s pies, Firehouse Subs, Michel’s patisserie, as well as CIBO Espresso and Pizza Capers. ASX food chain franchisor Retail Food Group is positioning Firehouse Subs as a superior rival to Subway. Running 1250 outlets across 30 countries is a lot to keep track of, which is why Retail Food Group has been phasing out low-performing brands (such as Michel’s and CIBO) and backing brands they see growth potential in.\n\n“The best chance of accelerating growth in the next phase is around our Beefy’s and Firehouse [Subs] businesses,” said Retail Food Group chief Matthew Marshall. Loading Retail Food Group has aggressive store expansion plans for Beefy’s Pies (50 stores by 2028) and sandwich business Firehouse Subs, with a target to open 165 stores, which Marshall is hoping will eat some of Subway’s lunch. “It’s a $1.7 billion category, it’s growing fast, and it’s really only got one big competitor in Subway,” he said. “We’ve got a really, really strong case here to shake up the category and have a real go at bringing something new.” As part of efforts to focus on fewer, better brands, the group is putting Brumby’s Bakery up for sale. A review of the bakery chain’s value resulted in a $12.2 million write-down. “Our priorities have changed over the years,” the company stated.\n\nDiscounting is out of fashion Two years ago, when Australians were counting their dollars more carefully after 13 interest rate rises, retail markdowns of 30 per cent to 40 per cent were common – but you won’t find smart retailers doing that. Youth fashion retailer Universal Store grew total sales by 15.5 per cent despite a pretty tough retail environment, which chief executive Alice Barbery said was down to “great range curation” and “really robust and beautiful” offers. Universal Store chief executive Alice Barbery. Credit: Peter Wallis “A lot of people might be growing with top-line sales, but they’re doing it at the cost of gross margin, so it’s through discounting. We’ve been able to do that without … participating in the rampant discounting,” she said. Tight inventory control is also key. “We’ve trained our customer to pay full price. We also want to be sure that we don’t end up with over-stock issues, which devalues the product.”\n\nUniversal Store appears to be doing much better than its rival, General Pants Co, which has been quietly closing stores across the country and is battling its third attempt to be wound up by frustrated suppliers attempting to claw back thousands of dollars owed by the retailer. Ingham’s hungry for fast food Chicken has been a winner on the dinner tables of Australians for its relative affordability compared with red meat prices, which have risen by 25 per cent for lamb and 40 per cent for beef over the past five years. Ingham’s needs to win new customers. Credit: But major poultry supplier Ingham’s has had a tough year; a major supply contract with Woolworths ended after the nation’s grocery chain decided to diversify its pool of suppliers, leaving Ingham’s to fill the gap by selling more to Coles, Aldi and IGA.\n\nIn short, Ingham’s needs more customers for its chicken. It’ll focus on what it can control, but is hoping for a fast-food fix. “There’s some good growth prospects as it relates to the emerging and medium-sized quick-service restaurants,” said new chief Edward Alexander. Loading Ingham’s supplies chicken to KFC, McDonald’s and Nandos. Cost of living pressures have led customers to make meals at home instead of eating out, to the detriment of Ingham’s food-service sales, but Alexander is hoping to see foot traffic return to eateries. “[Quick-service restaurant] operators have really gotten back, not to a point of growth, but certainly seeing some green shoots as it relates to the sales and some of their foot traffic measures,” said Alexander.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/who-are-wa-s-work-release-prisoners-and-the-nordic-model-experts-say-we-should-follow-20250819-p5mo83.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Who are WA’s work-release prisoners? (And the Nordic model experts say we should follow)",
    "publish_date": "Sun, 24 Aug 2025 09:22:23 +1000",
    "category": "finance",
    "authors": [
      "Rebecca Peppiatt"
    ],
    "text": "When it was revealed this month that prisoners on secondment at work placements had reportedly been eating guinea pigs, moral condemnation was followed by the question; who are these prisoners, and what are they doing out of their cells?\n\nA new report released this week shed some light on the matter, revealing conditions within the program were less than ideal and inmates were being paid less than $8 a day while being given limited food and performing physically demanding work in the community.\n\nWooroloo Prison Farm is a minimum-security facility near Perth. Credit: Office of the Inspector of Custodial Services\n\nHowever, despite the poor pay, competition to be part of the work release program is high, with the report revealing the numbers of prisoners wanting to participate outweighed the number of places.\n\nThe work they complete is community-oriented and well-received, according to the report from the Office of the Inspector of Custodial Services.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw2-man-city-vs-spurs-20250824-p5mpao.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW2: Man City vs Spurs",
    "publish_date": "Sun, 24 Aug 2025 09:05:46 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW2: Man City vs Spurs\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-rapa-nuis-famous-moai-statues-are-under-threat/a7vwmg2rb",
    "title": "INTERVIEW: Rapa Nui's famous moai statues are under threat",
    "publish_date": "Sat, 23 Aug 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-the-truth-about-working-from-home-and-should-we-work-on-friday-afternoons/tjp0um4gy",
    "title": "INTERVIEW: The truth about working from home - and should we work on Friday afternoons?",
    "publish_date": "Sat, 23 Aug 2025 21:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/win-win-roadmap-government-pauses-building-code-updates-to-speed-up-housing-supply/ayylbnkqk",
    "title": "'Win-win roadmap': Government pauses building code updates to speed up housing supply",
    "publish_date": "Sat, 23 Aug 2025 21:21:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "The federal government says it has the balance right between sustainability and energy standards and removing red tape to speed up building approvals.\n\n\n\n\n\nA suite of changes to construction guidelines aimed at reducing delays comes after Treasurer Jim Chalmers confirmed alterations to the national code at the conclusion to last week's productivity summit.\n\n\n\n\n\nUnder the plan, updates to the 2000-page construction code will be frozen until mid-2029 once the 2025 changes are finalised. The code normally updates every three years.\n\n\n\n\n\nThe freeze excludes essential safety and quality changes and maintains the strong residential standards adopted in 2022, including 7-star energy efficiency.\n\n\n\n\n\nThe government will use the pause to streamline the code, including improving its usability with artificial intelligence, removing barriers and encouraging modern methods of construction, such as prefab and modular housing, and improving how code additions are developed.\n\n\n\nJim Chalmers confirmed alterations to the national code at last week's productivity summit. Source: AAP / Mick Tsikas Removing building red tape to speed up housing construction won't cut corners on standards, Housing Minister Clare O'Neil said.\n\n\n\n\n\n\"It's too hard to build a home in this country. We want builders on site, not filling in forms to get their approval,\" she said.\n\n\n\n\n\nThe government will also fast-track environmental assessment applications for more than 26,000 homes by creating a specialised environment department team, prioritising robust development applications.\n\n\n\n\n\nIt is also looking to use AI tools to simplify and hasten approvals.\n\n\n\n\"Piloting an AI program to help users navigate the volumes of codes and standards will add significant value, allowing more time to build homes and potentially reducing paperwork,\" Housing Industry Association director Jocelyn Martin said.\n\n\n\n\n\nEnvironment Minister Murray Watt said fast-tracked projects will still need to meet all environmental requirements, but developers will be incentivised to provide required information up front.\n\n\n\n\n\n\"This approach will ensure strong national environmental protections, while also leading to faster decision making, more certainty for industry and more homes for Australians,\" he said.\n\n\n\n\n\nRemoving impediments for superannuation investment in new housing and working with the states and territories to accelerate planning, zoning and approvals are also slated under the changes.\n\n\n\n\"We want builders on site, not filling in forms to get their approval,\" Housing Minister Clare O'Neil said. Source: AAP / Joel Carrett At the government's Economic Reform Roundtable in Canberra last week, a simplification and tidy-up of the code attracted broad support, with few disputing the need for standards that work together better and are easier to navigate.\n\n\n\n\n\nAs a \"floor\" for quality and performance, some saw it as a necessary tool to keep the next generation of homes safe, comfortable and not wasting energy.\n\n\n\n\n\nThe Property Council of Australia's Mike Zorbas said the measures will help unlock tens of thousands of new homes.\n\n\n\n\n\n\"This is a win-win roadmap to better housing supply,\" he said.\n\n\n\nMaster Builders Australia chief executive Denita Wawn applauded the government, saying the constant churn of regulatory change had added pressure to a complex and costly system.\n\n\n\n\n\nAustralian Council of Social Service chief executive Cassandra Goldie, at the summit, warned a construction code freeze could mean households least able to afford home retrofits for a changing climate and energy future could lose out if reforms miss the mark.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-why-this-emergency-nurse-is-putting-his-life-on-the-line-again-in-gaza/9f7mw71cx",
    "title": "INTERVIEW: Why this emergency nurse is putting his life on the line – again – in Gaza",
    "publish_date": "Sat, 23 Aug 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/whats-behind-the-success-of-kpop-demon-hunters/5pu1ek9la",
    "title": "'Girl warriors' fighting demons with song: Behind Netflix's viral K-pop movie",
    "publish_date": "Sat, 23 Aug 2025 20:33:16 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "In schoolyards and dance clubs across the country, Australians are embracing a genre-bending animated film centred around a K-pop girl band that secretly fights demons.\n\n\n\n\n\nThe Netflix original KPop Demon Hunters has become an unlikely worldwide phenomenon, including in Australia, and is now the second most popular English-language movie globally.\n\n\n\n\n\nIn the nine weeks since its premiere on 21 June, it has racked up 210 million views and is second only to action comedy film Red Notice on the screener's list of most popular movies. It's the first animated movie to enter the list.\n\n\n\nThe animated film KPop Demon Hunters follows a girl band called Huntr/x. Source: Supplied / Netflix In Australia, KPop Demon Hunters is currently the number one film on Netflix and has spent nine weeks in the top 10.\n\n\n\n\n\nIt's become so popular that singalong screenings are being held in Hoyts cinemas across the country this weekend.\n\n\n\nWhat is KPop Demon Hunters about?\n\nThe English-language animated musical is a vibrant introduction to the world of K-pop and follows the lives of girl group Huntr/x, whose soaring vocals help keep demons away.\n\n\n\n\n\nThe music drives much of the film's appeal, and the soundtrack has been the number one album on the ARIA charts in Australia for five non-consecutive weeks. The song Golden has also topped the Top 50 Singles, securing a rare ARIA chart double.\n\n\n\n\n\nDirected and co-written by Maggie Kang, who was born in South Korea and grew up in Canada, the film was inspired by Kang's love of K-pop.\n\n\n\nREAD MORE Why Australians are getting hooked on Korean TV\n\n\"I have been a fan of these incredible artists and their work for many years, so it's a dream come true to have original songs written and produced for our film by legendary talent such as The Black Label [a leading South Korean record label],\" Kang says.\n\n\n\n\n\nDr Sung-Ae Lee, an expert in Asian cinema at Macquarie University, describes the film's blend of fast-paced visuals as channelling \"global energy\".\n\n\n\n\n\nShe points to its incorporation of K-pop culture, which thrives online, and says it reflects young people's use of social media platforms such as TikTok and YouTube, as well as its fan communities.\n\n\n\n\n\n\"I think it's kind of a turning point ... it's a really innovative idea of K-pop idols plus this fantasy genre,\" she says.\n\n\n\nKPop Demon Hunters follows the lives of K-pop superstars Rumi, Mira and Zoey, who use their secret identities as demon hunters to protect their fans from a supernatural threat. Source: Supplied / Netflix While Lee believes the success of the music, which is performed by real singers, is connected to its narrative context within the film, others have suggested it also demonstrates the potential for animated bands, possibly driven by artificial intelligence , to achieve chart success.\n\n\n\n\n\nSuk-Young Kim, a professor at the University of California, told the Wall Street Journal the film's success shows it's possible for fans to connect with nonhuman idols.\n\n\n\n\n\n\"This is a long-running dream for K-pop companies,\" Kim said. \"Here we have idols who never sleep, never get sick, never age.\"\n\n\n\nSchoolkids embrace hit film\n\nThe popularity of the film appears to have grown organically without the publicity that has helped fuel the success of other Netflix hits such as Red Notice.\n\n\n\n\n\nSydney mother Alison McLeod says she watched KPop Demon Hunters with her seven-year-old daughter after it was recommended by the Netflix algorithm.\n\n\n\n\n\nThe 44-year-old says the film reminded her of the Japanese manga series Astro Boy and other animations she watched as a child.\n\n\n\n\n\n\"I had friends that were into manga and definitely into K-pop music ... I knew a little bit about the genre and what to expect. And it just looked fun,\" McLeod tells SBS News.\n\n\n\nWhat I really liked once we started watching it was the themes ... the girl power.\n\n\"It embraces the [non] typical girl — these three girls are different. They just presented as really good role models for my little one, she's fiesty.\"\n\n\n\n\n\nHer daughter now re-enacts scenes from the movie with her friends at school, and McLeod says she also attended a seven-year-old's birthday party recently that featured songs from the soundtrack during a game of musical bumps (like musical statues but players sit instead of freeze).\n\n\n\n\n\n\"They were rocking out to the Demon Hunter soundtrack and every single kid there knew all the words,\" she says.\n\n\n\nMcLeod says her daughter is predominantly attracted to the music, with the film's soundtrack now on daily rotation in their car and home. But she also seems to identify more with the characters than those in other films, such as Encanto and Trolls, which have been previous obsessions.\n\n\n\n\n\nMcLeod has previously dyed her hair purple and both she and her partner have tattoos — like the lead character in Demon Hunters, Rumi. She says the film is helping her daughter to embrace differences in personal style and expression as \"cool\".\n\n\n\n\n\n\"We're not the norm in society, and I think that she [McLeod's daughter] feels like the Huntr/x girls embody that in a really cool way ... she'll [now] be like 'I can have purple hair'.\"\n\n\n\nA Hollywood film featuring Korean culture\n\nThe film has also been a hit within the Korean community and remains the top movie on Netflix in South Korea.\n\n\n\n\n\n\"I thought maybe Korean audiences [would] resist it but it was really popular and they like it,\" Lee says.\n\n\n\n\n\n\"I think it's because it's youth culture.\"\n\n\n\n\n\nLee says she didn't like KPop Demon Hunters the first time she watched it because it seemed Americanised.\n\n\n\n\n\n\"[While] the subject is quite Korean ... it's not Korean at all, it's actually Hollywood.\n\n\n\nThe animation is American to me — the body language and facial expression — they're all American, not Korean.\n\nShe says it's hard to pinpoint exact movements, but one example is shrugging, a common gesture in the US, and quite different to gestural conventions in Korean films.\n\n\n\n\n\nBut in other ways, it incorporates culturally Korean tropes, and folklore elements that Lee found impressive.\n\n\n\n\n\nThe film features a tiger and a magpie, a combination that is often seen in Korean folk paintings called Jakhodo. They symbolise good fortune and are thought to ward off evil spirits.\n\n\n\nA scene featuring a large tiger and magpie talking to the lead character Rumi. Source: Supplied / Netflix \"I was really surprised in the beginning [that] they're using it. I think it's one of the most beloved folk images [in Korean culture],\" Lee says.\n\n\n\n\n\nThe name of the boy band in the film, Saja, also has a dual meaning in Korean. It can refer to a lion, symbolising strength and courage, but can also refer to a grim reaper, a meaning that makes sense in the film as the band members are collecting souls.\n\n\n\nK-pop girl band Huntr/x must battle Saja, an irresistible rival boy band of demons in disguise. Source: Supplied / Netflix Leah Hyein Na, executive producer of the Korean program at SBS, says the Korean community in Australia is proud of the film and appreciates its meticulous depiction of Korean elements. She says her children also love the film and sing the songs with friends at school.\n\n\n\n\n\nAssociate professor in Korean studies at Australian National University, Roald Maliangkay, says the Korean studies community — both Korean and non-Korean — is particularly interested in how Korean folk elements have been incorporated in the film.\n\n\n\n\"I was shown an exhibition of Chosun dynasty clothes at the Korea University museum [recently] and the lady giving the tour pointed at a very old sword, noting that it was just like the one used in KPop Demon Hunters,\" he says.\n\n\n\n\n\nThe song Golden was also being played everywhere during Maliangkay's recent visit to South Korea, which he says is a good indication of its popularity with foreign tourists as well.\n\n\n\nWhy is Kpop Demon Hunters so popular?\n\nWorkers at the I HEART KPOP store in Brisbane say they saw an immediate impact on sales following the film's release.\n\n\n\n\n\n\"We had so many parents coming in looking for any of the merch from the movie,\" store worker Aurelia says.\n\n\n\n\n\nThe 24-year-old says the store has always attracted a mixed demographic — across race, age and gender — but they have seen more people coming in who aren't interested in K-pop but love the film.\n\n\n\n\n\nA recent K-pop party hosted by the store in Brisbane, which usually attracts around 800 people, drew around 1,200 attendees.\n\n\n\n\n\n\"The crowd went very crazy for the songs from KPop Demon Hunters,\" Aurelia says.\n\n\n\nAurelia has been a fan of K-pop since 2019 after stumbling upon a video of the boy band BTS on YouTube.\n\n\n\n\n\n\"I was really touched by the way that BTS talk about their fans, the relationship that they had between the fans and the respect that they had for them,\" she says.\n\n\n\n\n\nWhile she was initially sceptical of KPop Demon Hunters, she says she was happily surprised after watching it.\n\n\n\n\n\n\"You could see — as a K-pop fan — it was made by fans ... I thought that was awesome,\" she says.\n\n\n\nAurelia (left) is a K-pop fan and recently attended a dance party in Brisbane that drew 1,200 people. Source: Supplied / Silvana Sanchez Audrey Nuna, who voices Mira in the film, told SBS Korean that she had a feeling the movie would do well.\n\n\n\n\n\n\"When I was recording the songs for this movie, I did tell my mum,\" she says.\n\n\n\n\n\n\"I was like: 'mum, I think this movie's going to do really, really well' because I think so many people have a love — even people who are not Korean — have such a love for Korean music, Korean pop, Korean culture.\n\n\n\n\n\n\"[But] I don't think I ever could have expected it to be at this level.\"\n\n\n\nWith its themes of girl power, coming of age and youth culture, Lee says the film feels \"fresh\", and she also eventually embraced it.\n\n\n\nIt's not a typical supernatural action genre — it's quite fresh and [there's] flair to it, that's why I like it.\n\nLee believes audiences may also be drawn to its themes of self-acceptance, friendship and empowerment.\n\n\n\n\n\nOther shows featuring demon hunters, such as Buffy the Vampire Slayer and Sailor Moon, have also been popular with Western audiences in the past.\n\n\n\n\n\n\"Generation X or even older generations, they are really interested in K-pop and things like that because they grew up with [these shows],\" Lee says.\n\n\n\n\n\n\"These are all women warriors or girl warriors.\"\n\n\n\nMovie sparks interest in Korean culture\n\nMcLeod says her daughter is envious of her two Korean friends at school because they can understand parts of the songs that aren't translated into English.\n\n\n\n\n\n\"Their school teaches Mandarin, and she was like 'I wish they taught Korean instead',\" she says.\n\n\n\n\n\nHer daughter is also now asking to go to Korean restaurants instead of her usual favourite, which is Japanese.\n\n\n\n\"I think it's great that something that's a bit of a counter culture has reached such mainstream popularity,\" McLeod says.\n\n\n\n\n\n\"I hope that it has opened the door for other genres.\n\n\n\n\n\n\"It's wild that my anglo-Australian child is into K-pop, I love that so much.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-23-august-2025/hhiyp0sww",
    "title": "Evening News Bulletin 23 August 2025",
    "publish_date": "Sat, 23 Aug 2025 07:09:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nMultiple UN agencies call for urgent action to help more than half a million people in Gaza trapped in famine\n\nA milestone in Aboriginal land rights remembered 50 years on\n\nAustralia take on Samoa at the Women's Rugby World Cup\n\nMultiple UN agencies have repeated calls for an immediate ceasefire and unhindered humanitarian access, as famine is officially confirmed in Gaza.\n\n\n\n\n\nThe latest report by the UN-backed group responsible for monitoring global hunger crises says 514,000 people are experiencing famine in Gaza - a quarter of the population, with that number expected to rise to 641,000 by the end of September.\n\n\n\n\n\nIt is the first time the Integrated Food Security Phase Classification system has recorded famine outside of Africa.\n\n\n\n\n\nDr Mark Manary is an expert on child malnutrition at Washington University. He says now that so many people are already experiencing famine, regular food is not enough to save them.\n\n\n\n\n\n\"So when somebody is malnourished, how can they recover? Well, the answer is fairly simple. It's being provided therapeutic food. Therapeutic food is food that is completely replete with all the nutrients that are needed in ample quantities. If you had enough food in Gaza today for everyone to eat as much as they wanted, it would be three months before everyone would be recovered. But a week's worth of therapeutic food is life-saving.\"\n\n\n\n\n\nIsrael controls the flow of aid into Gaza and has dismissed the findings as biased.\n\n\n\n\n\n---\n\n\n\n\n\nWorkers in the childcare sector say staffing issues remain unaddressed, after Friday's meeting on childcare safety attended by state and territory ministers.\n\n\n\n\n\nThe ministers have agreed to establish a national register of childcare workers to be trialled and launched in early 2026.\n\n\n\n\n\nThere will also be a CCTV trial that will run at 300 centres across the country from October or November.\n\n\n\n\n\nPreeti Soodan, from the United Workers Union, says there needs to be change to ensure adequate staffing numbers.\n\n\n\n\n\n\"When we talk about the under roof ratio, it is extremely important to have minimum staff, as per that licensing of the childcare centre because it leads to... It is important that it should meet the Australian quality framework. And we are just demanding for the bare minimum, which is essential for the safety and wellbeing of the children.\"\n\n\n\n\n\n---\n\n\n\n\n\nMembers of the Gurindji community in the Northern Territory are marking 50 years since the Gurindji land handback, a historic turning point for Aboriginal land rights in Australia.\n\n\n\n\n\nAfter an almost decade-long struggle, in 1975 then Prime Minister Gough Whitlam poured sand into the hands of Gurindji man Vincent Lingiari - granting his people a lease to a parcel of land on the Wave Hill cattle station.\n\n\n\n\n\nThe moment paved the way for the Aboriginal Land Rights Movement – and the Northern Territory Aboriginal Land Rights Act.\n\n\n\n\n\nFor the first time Indigenous Australians could claim land rights if they could prove traditional ownership.\n\n\n\n\n\nGurindji Elder George Edwards says the community has come together this weekend - for the annual Gurindji Freedom Day Festival - to mark the significance of that moment, and the leadership shown by Vincent Lingiari then and the historic Wave Hill Walk-off a decade earlier.\n\n\n\n\n\n\"He was a great leader. He was the leader of the tribe, all tribe... Mr Lingiari, he was a great man. He was a hero for me. For what he done for us, done for our people.\"\n\n\n\n\n\n---\n\n\n\n\n\nIn Rugby Union, Wallaroos co-captain Emily Chancellor says the team wants to make a strong statement in their opening game against Samoa at the Women's Rugby World Cup.\n\n\n\n\n\nThe game takes place in Manchester later tonight.\n\n\n\n\n\nAustralia's best women's World Cup finish was a third-place showing in New Zealand in 2010.\n\n\n\n\n\nThere are ten Wallaroos players on their World Cup debuts - and forging strong group ties has been a focus of the preparation.\n\n\n\n\n\nTrilleen Pomare competed for Australia at the 2017 and 2021 Rugby World Cups.\n\n\n\n\n\nShe says this time Australia is in it to win it.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/made-by-hand-and-powered-by-the-sun-these-vehicles-are-setting-off-on-a-3000km-journey/vmpd3g4vp",
    "title": "Made by hand and powered by the sun, these vehicles are setting off on a 3,000km journey",
    "publish_date": "Sat, 23 Aug 2025 05:00:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "Daniel Blik has travelled to Australia from the Netherlands to take part in a race in which his hi-tech vehicle will likely be overtaken by grey nomads towing caravans.\n\n\n\n\n\nLuckily, it's not the hope of lightning-fast speed that draws competitors from around the world to Australia to take part in the Bridgestone World Solar Challenge.\n\n\n\n\n\nThe manager of Solar Team Twente from the Netherlands told SBS Dutch that the event is more than just a race.\n\n\n\n\n\n\"For us, it's very important to show that there are other modes of transport available and that actual sustainable mobility is an option,\" he said.\n\n\n\n\n\nAlmost 40 sun-powered cars will set off from Darwin on Sunday as part of the challenge.\n\n\n\nInternational teams, many representing universities, have descended on Darwin for the beginning of the Bridgestone World Solar Challenge. Source: Supplied / Timo Hoogewoonink All of the vehicles taking part have been designed, engineered and built by the teams racing them.\n\n\n\n\n\nThe course, which covers just over 3,000 kilometres through the Australian outback, from the Darwin to Adelaide, takes place every two years.\n\n\n\n\n\nThe event aims to promote the development of energy-efficient transport as part of global decarbonisation efforts.\n\n\n\n\n\nIt often attracts teams from international universities and technical institutes as well as private entrepreneurs.\n\n\n\n\n\nVehicles compete within three different 'classes', allowing a variety of technology to be showcased.\n\n\n\nKevin van der Putte is a member of the Innoptus Solar Team from Belgium, which topped the competition's 'challenger' class in both 2023 and 2021.\n\n\n\n\n\nTheir vehicle completed the course travelling at an average speed of 88 km per hour.\n\n\n\n\n\n\"Our solar car is a really aerodynamic car, it's super light, it only weighs around 70 kilograms, purely made out of carbon,\" he said.\n\n\n\n\n\n\"And it also doesn't require fuel, so it only uses the energy of the sun.\"\n\n\n\nJules Teeuwen will be behind the wheel for the Brunel Solar Team from the Netherlands.\n\n\n\n\n\nHe said conditions in the car posed challenges to drivers.\n\n\n\n\n\n\"It's not very comfortable, in fact, in previous editions, we measured temperatures of up to 55 degrees Celsius, and you can also lose up to five kilos of sweat after one drive of the solar car,\" Teeuwen said.\n\n\n\n\n\nThe event continues until 31 August, giving teams just over a week to complete the challenge.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-theres-only-one-covid-vaccine/fby4h6mju",
    "title": "Australians can only access one COVID-19 vaccine right now. Experts say that's a problem",
    "publish_date": "Sat, 23 Aug 2025 01:00:00 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "People seeking a booster shot of the COVID-19 vaccine may have noticed that there is only one option available: Pfizer Comirnaty JN.1.\n\n\n\n\n\nAccording to the latest figures from the Department of Health, Pfizer has been the only vaccine brand administered to Australians since the start of the year .\n\n\n\n\n\nWith two COVID-19 variants circulating across the country, and only 1.9 million Australians having received a vaccine in the past six months, experts say choice is important when it comes to encouraging Australians to get the jab.\n\n\n\n\n\nSo why is there only one vaccine currently available?\n\n\n\nPfizer's Comirnaty JN.1 vaccine is the dominant vaccine brand in Australia. Source: AAP / Jenny Kane\n\nWhat happened to the other vaccines?\n\nThe main mRNA alternative to Pfizer is Moderna. Both companies have produced vaccines targeting the Omicron variant JN.1, which was dominant across Australia for much of 2023 and 2024.\n\n\n\n\n\nModerna's JN.1 vaccine was approved for use in Australia in late 2024 by the Therapeutic Goods Association (TGA), the body responsible for approving medical products in Australia.\n\n\n\n\n\nHowever, despite approval, in 2024 the Australian government decided not to replenish its supply.\n\n\n\n\n\n\"The Commonwealth has sufficient supplies of alternative COVID-19 vaccine brands for 2024,\" a Department of Health spokesperson told SBS News at the time .\n\n\n\n\n\nThis could change next year, however, as a newly built Moderna Technology Centre at Monash University in Melbourne is aiming to locally produce 100 million vaccines per year for COVID-19, influenza, and respiratory syncytial virus. It is expected to start production in late 2025.\n\n\n\nREAD MORE Why a popular COVID-19 vaccine has been withdrawn worldwide\n\nAnother mRNA vaccine, AstraZeneca, was recalled globally in 2024 after the company admitted it could cause adverse side effects.\n\n\n\nWhy isn't Novavax available?\n\nOne mRNA alternative also not on our shelves is Novavax.\n\n\n\n\n\nIn 2020, Novavax was one of the first batches of vaccines to bought by Australia. Its original COVID-19 vaccine, Nuvaxovid, was available for Australians from early 2022 .\n\n\n\n\n\nIts updated vaccine, Nuvaxovid XBB.1.5, did not receive TGA approval in Australia.\n\n\n\n\n\n\"It wasn't that approval was revoked with any specific safety or efficacy concerns. It was just that the amount of data required for that approval to be met just wasn't achieved,\" Dr Paul Griffin, infectious diseases physician and clinical microbiologist at Brisbane's Mater Health Services, said.\n\n\n\nNovavax withdrew its updated vaccine for TGA approval in 2024 but says it is committed to making its vaccine available to Australians. Source: AAP / Matthias Bein Novavax told SBS News it is committed to making the vaccine available to Australians and are working with the TGA to determine the best path forward. However, according to the TGA, Novavax withdrew its registration on 21 May 2024.\n\n\n\n\n\nProfessor Adrian Esterman, chair of biostatistics and epidemiology at the University of South Australia, said that low uptake in Australia may have been a factor in the company deciding not to renew its registration.\n\n\n\n\n\n\"It's not so much that the vaccine doesn't work, but it's simply not commercially viable for them,\" he said.\n\n\n\n\n\n\"Since then, they've developed a JN.1 vaccine which has been approved in several other countries, but they haven't bothered with Australia.\"\n\n\n\n\n\nEsterman said this is not good news for people who relied on Novavax as an alternative to mRNA offerings.\n\n\n\nWhy do some people prefer Novavax?\n\nNovavax is a protein subunit vaccine. Esterman said it's made by taking the genetic material of the virus, the DNA, and putting it into the cells of a moth. This makes the moth produce spike proteins.\n\n\n\n\n\n\"They then add to that what they call an adjuvant, which is a substance they get from a soapbark tree, and that helps the body react to these spikes ... and that's what they inject in you,\" he said.\n\n\n\n\n\nAn mRNA vaccine, by contrast, tells your body to make the spike proteins. Griffin said Novavax is preferred by some people who have had reactions to mRNA vaccines in the past.\n\n\n\n\"There are a whole host of people who have had reactions to mRNA vaccines, things like myocarditis, for example, and it's thought that perhaps that's a lower risk with Novavax. Or people who just don't like the thought of a vaccine based on the mRNA technology.\"\n\n\n\nWhy choice matters\n\nEsterman explained that having a variety of vaccine options is about making sure you have the right tools for the job.\n\n\n\n\n\n\"It's best to have several tools in your tool case. You wouldn't have one type of hammer; what if it doesn't work? You need something different. So it's good to have a variety of vaccines, and most countries do that.\"\n\n\n\n\n\nIt can also impact overall vaccination uptake, which both Griffin and Esterman say is currently low among vulnerable populations.\n\n\n\nExperts say the perception of choice when it comes to vaccine brands can help stimulate vaccine uptake among vulnerable populations. Source: AAP / Joan Mateu July figures from the Department of Health indicate that only 35 per cent of Australians aged 75 and over received a vaccination in the last six months, dropping to 22 per cent for those aged 65 to 74. Only 3 per cent of people between 18 and 64 received a vaccine this year. While these figures are slightly higher than previous months, overall rates of vaccination are lower than experts would like .\n\n\n\n\n\n\"There's certainly a lot of people that aren't opposed to being vaccinated who just don't want, or can't have, an mRNA vaccine, and so are likely to remain unvaccinated, which is a huge issue,\" Griffin said.\n\n\n\n\n\n\"If we could get a proportion of those people to be boosted, it would certainly be beneficial. So I'd really like to see there be an option for an alternative.\"\n\n\n\nAre we still catching COVID-19?\n\nIn short: yes.\n\n\n\n\n\nGenerally speaking, there are two COVID-19 waves each year: summer and winter. A recent winter peak is subsiding after an outbreak across more than 200 aged facilities.\n\n\n\nREAD MORE Has COVID changed in five years? What to know as winter looms\n\nThe current dominant strain in Australia is NB.1.8.1 or the Nimbus variant. Another variant, XFG or Stratus, is growing in dominance overseas, with high rates of infection in India, Spain, the United Kingdom, and the United States.\n\n\n\n\n\nGriffin warned that there are still risks between the waves, and it is important not to be complacent.\n\n\n\n\n\n\"Between those waves we see significant numbers of cases, and still see people in hospital from COVID-19...and that's why we really need to keep the highest risk people regularly vaccinated to keep them protected.\"\n\n\n\n\n\nThe Australian government recommends those in high-risk groups, such as the over-75s, aged care residents, or the immunocompromised, receive a booster shot every six months. For lower-risk groups, a booster shot every 12 months should suffice.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/famine-declared-in-gaza-city-morning-news-bulletin-23-august-2025/x08ay1bas",
    "title": "Famine declared in Gaza City | Morning News Bulletin 23 August 2025",
    "publish_date": "Fri, 22 Aug 2025 20:43:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "TRANSCRIPT\n\n\n\nFamine officially declared in Gaza City by a UN-backed group.\n\nThe Coalition has welcomed progress towards improving safety in Australia's childcare system.\n\nAnd in the NRL, the Storm defeat the Bulldogs in AAMI Park in Melbourne.\n\n----\n\n\n\n\n\nFamine has been confirmed in Gaza for the first time.\n\n\n\n\n\nA UN-backed group responsible for monitoring food security says 514,000 people - nearly a quarter of Palestinians in Gaza - are experiencing famine.\n\n\n\n\n\nIn its latest report, the Integrated Food Security Phase Classification Famine Review Committee says that number is expected to rise to 641,000 by the end of September.\n\n\n\n\n\nIsrael has rejected the report, with Prime Minister Benjamin Netanyahu calling it an “outright lie.”\n\n\n\n\n\nThe IPC, says famine is happening in Gaza City, home to hundreds of thousands of Palestinians, and could spread south to Deir al-Balah and Khan Yunis by the end of next month.\n\n\n\n\n\n----\n\n\n\n\n\nUnited States President Donald Trump says that in two weeks he should know whether progress is possible in his bid to end Russia's invasion of Ukraine and he again raised the prospect of imposing sanctions on Moscow.\n\n\n\n\n\nMr Trump says he's not happy with any aspect of the effort to find peace.\n\n\n\n\n\nA week ago Trump held talks in Alaska with Russian President Vladimir Putin and has been unable thus far to coax him into a meeting with Ukraine President Volodymyr Zelenskyy.\n\n\n\n\n\n\"I think in two weeks we'll know which way I'm going. Because I'm going to go one way or the other, and they'll learn which way I'm going. And it's going to be a very important decision. And that's whether or not it's massive sanctions or massive tariffs or both. Or do we do nothing and say 'it's your fight'?\"\n\n\n\n\n\n----\n\n\n\n\n\nThe Coalition has welcomed progress towards improving safety in Australia's childcare system, but says the test for governments will be how quickly action is taken.\n\n\n\n\n\nA meeting of state, territory and federal ministers on Friday agreed to a series of changes that will be implemented in stages over the coming months.\n\n\n\n\n\nThis includes plans to establish a national register for childcare workers by February, and a ban on mobile phones due to come into effect this September.\n\n\n\n\n\nMore mandatory training and spot checks at centres will also be rolled out, alongside a trial of CCTV at hundreds of childcare centres from December.\n\n\n\n\n\nOpposition spokesperson for education and early childhood learning, Jason Duniam says privacy protections will be an important part of using CCTV.\n\n\n\n\n\n\"So of course, we need to get it right. The trial I think is a very good step in the right direction. I accept that there are going to be privacy concerns, and we know for a fact that, sadly, those who prey on our most vulnerable, on children, have utilised CCTV and other systems to their own ends, which is something we need to guard against. So, this trial, informed by law enforcement officials and cyber experts in partnership with the child care sector will be about getting it right. We support that.\"\n\n\n\n\n\n----\n\n\n\n\n\nFive bodies have been exhumed from shallow graves in Kenya, near a site where more than 400 bodies of followers of a doomsday cult were recovered two years ago.\n\n\n\n\n\nGovernment pathologist Dr Richard Njoroge says 10 human body parts were also recovered, scattered in nearby thickets about two kilometres from the site of the Shakahola cult.\n\n\n\n\n\nHe says these are just a handful of 27 suspected grave sites that homicide detectives and forensic experts are continuing to investigate.\n\n\n\n\n\n\"At the commencement of this exercise we had 27 suspected graves. So, today we managed to exhume 6. Of the six graves, we found five bodies. So we had remaining 21 graves, for which the exercise will continue.\"\n\n\n\n\n\nIn 2023, more than 400 bodies were exhumed from shallow graves in the Shakahola area, where pastor Paul Mackenzie instructed his followers to starve themselves to death in order to \"meet Jesus.\"\n\n\n\n\n\nHe was arrested and charged with murder and is in custody awaiting trial.\n\n\n\n\n\n----\n\n\n\n\n\nIn rugby league,\n\n\n\n\n\nMelbourne have locked down a top-two ladder position with two rounds to play after holding out Canterbury in their blockbuster NRL showdown.\n\n\n\n\n\nThe Storm were forced to work hard for a 20-14 win over a much-improved Bulldogs outfit.\n\n\n\n\n\nThe AAMI Park victory put Melbourne four points clear of third-placed Canterbury, but they have a far superior points differential.\n\n\n\n\n\nMeanwhile, a dramatic golden-point victory by Canberra over Penrith has put the Raiders in prime position to claim the minor premiership.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/darce-wants-to-play-aussie-rules-but-they-say-its-culture-makes-them-feel-unsafe/0f8cbi9oz",
    "title": "Darce cried in the shower after Aussie rules games. They're pushing for the sport to change",
    "publish_date": "Fri, 22 Aug 2025 20:34:24 +0000",
    "category": "sports",
    "authors": [],
    "text": "Darce always loved Australian rules football. They played sports their entire life, dabbling in hockey, cricket, and footy since they were a kid.\n\n\n\n\n\nBut now, they feel physically sick if they hear the whirl of the AFL siren or pass an Aussie rules field.\n\n\n\n\n\nThe 32-year-old is non-binary and typically played in local women's leagues. But they say that because of their physical presentation, they've been subject to transphobic and homophobic slurs and physical abuse — something they say has ramped up in the last few years.\n\n\n\n\n\n\"I've had people just yell slurs from the sidelines while I'm trying to play a game — people who don't even know me. It's really alienating and terrifying,\" Darce told SBS News.\n\n\n\n\n\nSBS News has chosen not to publish these slurs.\n\n\n\n\"I remember playing a game and I could hear the coach just referring to me as 'he' … then these players come and they play on you with the mindset that they're playing on a man, so they start tackling you really hard and hurting you,\" Darce said.\n\n\n\n\n\nDarce says that the last game they played, they were tackled so violently that it led to a concussion. They say an unsafe culture is embedded in local leagues, adding that many of their gender-diverse and queer friends have also been subject to physical and verbal discrimination under the guise of competition and routine sledging.\n\n\n\n\n\n\"Players will get called slurs and it's treated like a very minor thing [by the league],\" they said said. \"Any kind of diversity or deviation from what is considered the norm of 'who plays footy' is targeted.\"\n\n\n\nNow, they have stopped playing in their local league and have stopped attending official AFL matches.\n\n\n\n\n\n\"I was taking off so much work after games because I’d be crying in the shower all night, and I wouldn’t be able to sleep. And this is even just local footy,\" they said.\n\n\n\n\n\n\"I miss the sport so much and I miss my friends, but I'm at the point where I haven't physically been able to go to a game since then. Even when I hear the umpire's whistles at the park around the corner, I get anxiety.\n\n\n\n\n\n\"It was something I really loved and it was causing me so much harm that I had to step away entirely.\"\n\n\n\nAdelaide Crows player Izak Rankine has been hit with a four-match suspension for the use of a \"highly offensive homophobic slur\" against a Collingwood opponent. Source: AAP / Matt Turner\n\nDoes AFL have a culture of homophobia and transphobia?\n\nThe sport's stated aim of stamping out homophobia at the top level to the grassroots was under a spotlight this week.\n\n\n\n\n\nAdelaide Crows player Izak Rankine was sanctioned on Thursday for using a homophobic slur against an unnamed Collingwood opponent last Saturday night.\n\n\n\n\n\nThe AFL hit Rankine with a five-match suspension, which was later downgraded to four matches, citing \"compelling medical submissions\". SBS News has contacted the AFL for comment on what those medical submissions were.\n\n\n\n\n\n\"Rankine rang the Collingwood player to personally apologise and he fully cooperated with the subsequent investigation by the AFL Integrity Unit including by admitting the use of the homophobic slur and being remorseful for it,\" the AFL said in a statement.\n\n\n\n\n\nAFL general counsel Stephen Meade said: \"The language used was offensive, hurtful and highly inappropriate. Our players have a very clear understanding of what is acceptable on the football field. Importantly, in this instance it was called out by players and acknowledged by Izak himself as wrong — and that reflects the standards we expect and demand in our game.\"\n\n\n\n\n\nAFL CEO Andrew Dillon said \"inclusion and respect are key priorities for the AFL\" and acknowleged that there was \"much more work to do\".\n\n\n\n\n\n\"I know people in the LGBTQI+ community are hurting when an incident like this happens,\" Dillon said on Thursday.\n\n\n\n\n\nOn Monday, Adelaide captain Jordan Dawson denied the incident was a sign of a wider cultural issue in the AFL.\n\n\n\nDr Robert Boucaut, a lecturer in media at the University of Adelaide, however, said the incident was a \"symptom of a broader problem\" and wasn't just an isolated incident.\n\n\n\n\n\n\"In team sports, you are often prioritising and valuing traits around hyper-masculinity and aggression — and looking towards methods to undermine opposing teams on those levels,\" Boucaut told SBS News.\n\n\n\n\n\n\"Homophobia, misogyny, queerphobia and transphobia all plays into that culture of sledging in the game,\" he said. \"The language used on-field and, more than likely behind the scenes, is one of exclusion, one of ostracisation, and othering.\"\n\n\n\n\n\nHe says it \"threatens the safety and viability of diverse communities being able to participate in sport\".\n\n\n\nRankine is the sixth AFL-listed player banned for a homophobic slur against an opponent in the past 16 months.\n\n\n\n\n\nBoucaut says there has been an uptick in reporting these incidents since 2023, which may indicate a slight cultural shift. But he says the way these incidents are tackled still \"misses the bigger picture of a culture of institutional homophobia\".\n\n\n\n\n\n\"The AFL is unique amongst the world’s elite sporting codes in never having had an openly gay male player — that itself supports this picture of the AFL being an unsafe and unsupportive environment.\"\n\n\n\n\n\nDarce says the incident sends the message that Aussie rules is not a safe place for queer people like them: \"It's very clearly saying that we're not safe playing footy and that we’re not welcome.”\n\n\n\n\n\n\"The AFL tried to brush it off as a single incident, not that it's a cultural issue.\"\n\n\n\nThe 'tip of the iceberg'\n\nDr Ryan Storr from the Sport Innovation Research Group at Swinburne University of Technology is a co-author of the Free to Exist research paper, published last year.\n\n\n\n\n\nIt found that 53 per cent of young LGBTQIA+ people have witnessed discrimination, and 40 per cent have experienced discrimination — mostly through verbal vilification.\n\n\n\n\n\nStorr says gay men were the largest group to report discrimination, with 76 per cent hearing or witnessing homophobia.\n\n\n\nHe's not surprised by Darce's experience. \"In the last couple of years, in particular with the rise of right-wing conservatism, the Trump effect, and what we've seen in the UK in changing the definition of a woman, there's been an increase in anti-LGBTQIA+ sentiment.\"\n\n\n\n\n\n\"Unfortunately, trans and gender diverse people have been copping this.\n\n\n\n\n\n\"This is just the top of the iceberg.\"\n\n\n\n\n\nHe says the environment has led to an increase in body policing — something that Darce has experienced: \"In men’s sports and the men’s football, anything that’s seen as feminine — whether it be having longer hair or painting your nails — there's this assumption of your sexuality that this person might be gay and that’s somehow not masculine.\"\n\n\n\n\n\n\"In the women’s comp, it’s less homophobia you face and it’s more transphobia you get,\" they said. \"If your hair is too short or you’re too tall or your voice is a bit deep, there’s this assumption that, 'oh, you mustn’t be a girl then'.\"\n\n\n\nBut Storr is cautious to place the blame entirely on politics, saying the AFL needs to take ownership of the culture it has created.\n\n\n\n\n\n\"Sport is a reflection of society, but I think sometimes it can be heightened,\" he said.\n\n\n\n\n\n\"In the Izak Rankine case, if you had said this in a work setting, you're not getting a slap on the wrist — you'd be fired. Sport seems to be immune to this.\"\n\n\n\nFlow on for community sports\n\nBut instances like Rankine's don't just take place at Adelaide Oval. It can also have devastating flow-on effects in community spaces and online.\n\n\n\n\n\n\"Every time an incident like this happens, you get maybe four or five days afterwards of just online commentary — and it's often quite negative,\" Storr said.\n\n\n\n\n\n\"Ultimately, what you have is overt homophobia in online environments … it sends the message that LGBTQIA+ people aren't welcome in sport.\"\n\n\n\n\n\nHis research has also led to him speaking to local clubs, with one club manager explaining that incidents like these can lead to a rise in homophobic language on the field.\n\n\n\nAFL CEO Andrew Dillon said \"inclusion and respect are key priorities for the AFL\", adding that \"people in the LGBTQI+ community are hurting when an incident like this happens\". Source: AAP / Joel Carrett \"The large percentage of community clubs and sport volunteers have mentioned that homophobic language is very prevalent and a problem. One club said that the last time this happened, discussion of and use of homophobic language increased,\" Storr says.\n\n\n\n\n\nBoucaut adds that larger cultural attitudes in the AFL can trickle down into local, community, and junior leagues.\n\n\n\n\n\n\"The flow-on effects to communities would be disheartening,\" he said.\n\n\n\n\"If the elite spaces of AFL aren’t leading the charge, it puts community clubs in a stymied position, because it gives a pass for those behaviours to trickle down — to be seen as just part of the game.\"\n\n\n\n\n\nFor Storr, that's particularly worrying.\n\n\n\n\n\n\"When they hear their role models say it, it gives these young boys ammunition to do that.\"\n\n\n\n\n\n\"The main perpetrators of homophobia are young teenage boys in groups — that's why sport is rife for this and it's an area that promotes it, unfortunately.\"\n\n\n\n'We're not problems to be fixed'\n\nAs for what that change might look like, it's difficult to envision.\n\n\n\n\n\nStorr advocates for a \"multi-pronged\" approach, including education, to get to the core of the problem.\n\n\n\n\n\n\"A band-aid solution of giving a ban is not working,\" he said. \"Culture change and attitudinal change takes a long time, but they need to realise this is a problem and have a carefully curated plan and strategy.\"\n\n\n\n\n\nBoucaut says systemic homophobia and queerphobia can't simply be fixed through match bans, sanctions, or pride education.\n\n\n\n\n\nInstead, he urges to shift the conversation away from punishment and look at more holistic efforts to enhance queer representation in the league, especially in the commentary space.\n\n\n\n\n\n\"There is space for the sport and the code to change. The game has made many adaptations over its existence — this can be another adaptation they choose to make,\" Boucaut said.\n\n\n\nBut for Darce, dreams are as simple as wanting to kick a footy safely.\n\n\n\n\n\n\"Queer people are treated as an outside problem to be solved or worked out or tolerated, rather than people who are part of the sport and have every right to simply be included and belong without our existence being questioned,\" Darce said.\n\n\n\n\n\n\"The queer community has had such immeasurably positive impacts for the good of Australian sports and society — it's insulting that the conversation seems to be around treating queer people like they're the problem, when they are the ones that should be receiving the most support right now.\"\n\n\n\n\n\n\"Everyone should be comfortable playing sports. We're not problems to be fixed.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-aunty-donna-went-from-a-two-star-comedy-review-to-landing-a-netflix-series/ssq4uaa40",
    "title": "Why Aunty Donna want to build a 'mini Netflix for Australian comedy'",
    "publish_date": "Fri, 22 Aug 2025 20:34:10 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "In 2014, Aunty Donna's promising comedy career was on a knife-edge.\n\n\n\n\n\nAfter being nominated for the prestigious Golden Gibbo award for their first live show, the then-four-person sketch comedy crew were down a member and questioning whether they could work as a trio.\n\n\n\n\n\nTo add salt to the wound, the venue they'd been put in for the Melbourne International Comedy Festival was on the fringes of the CBD, far away from all the action.\n\n\n\n\n\n\"It was an impasse where it's like: this is either going to fall apart or gain momentum,\" Broden Kelly says of how he and the other two performing members of the group were feeling at the time.\n\n\n\nIn the early years of their comedy career, Aunty Donna performed as a quartet. Credit: Isabelle Clara Mason After \"white-knuckling it\" to create a show they were really proud of, SBS Comedy gave them a less-than-favourable review.\n\n\n\n\n\n\"They hated it,\" Mark Samual Bonanno recalls.\n\n\n\n\n\n\"We had a sit-down on Lygon Street and we went around a circle and said something we like about each other — that's how much it affected us.\"\n\n\n\n\n\nWhile that two-star review knocked their confidence, Zachary Ruane credits it with being \"a very important step in our journey\".\n\n\n\nREAD MORE The funny side of grief: What the fear of dying young taught Michelle Brasier about life\n\n\"The big lesson that we got out of it was that we might work really hard to get on that stage and to make a good thing, but when people come and watch us, they've just worked hard at probably something that matters a lot more than what we do,\" he says.\n\n\n\n\n\n\"They don't come to us to see us working hard; they come to us to forget about the hard work they've just done, to forget about their struggles … so we need to just get up there and have fun.\n\n\n\n\n\n\"That kind of conversation and that realisation, I think, informed so much of what we do.\"\n\n\n\nFinding non-traditional pathways to success\n\nA decade on, and Aunty Donna — made up of writers and performers Bonanno, Kelly, and Ruane, along with head writer and stage director Sam Lingham, director Max Miller, and composer Thomas Zahariou — have toured all over the world, created two TV shows, released a studio album, worked with the likes of Shaun Micalleff, Tony Martin and Weird Al Yankovic, and published a colouring book.\n\n\n\n\n\nMuch of that success is thanks to the loyal following they built online through their YouTube channel, which boasts more than 639,000 subscribers, their self-titled podcast and their Patreon.\n\n\n\n\n\n\"When we were starting, there were three or four people at festivals and networks that had to like what you did, and if they didn't like what you did, then good luck to you,\" Ruane says.\n\n\n\n\n\n\"We were kind of the first generation that were then able to go: 'Well, you don't like us, but we'll go find an audience'.\"\n\n\n\nWith 2018's Always Room for Christmas Pud, a largely improvised sketch that is perhaps Aunty Donna's most well-known, they had their first taste of something approaching virality.\n\n\n\n\n\nThe original upload has amassed over 4.3 million views on YouTube and Pud has also become a running gag and annual cultural celebration amongst their fans, spawning a pannettone version (a nod to Bonanno's Italian heritage), a family-friendly version, a picture book, and a mockumentary about the making of the sketch.\n\n\n\nWhile the group's vast body of work is varied in its themes and tone, their brilliance lies in their ability to take a universal experience — like dealing with horrible real estate agents, forgetting to take your reusable bags to the shops, trying to have a picnic as an adult, and offloading cake at the end of a party — and add an absurdist and oftentimes dark edge to it.\n\n\n\n\n\nOne thing Aunty Donna generally steers clear of is being overtly political.\n\n\n\nBut Kelly rejects the idea that they're \"never saying anything\".\n\n\n\n\n\n\"I really struggle with that because I think everything that we are doing is really saying something really simple, and that is that 'If you're a man, it's okay to look silly or to be stupid. It's okay to be weird',\" he says.\n\n\n\n\n\n\"The world I lean into now with footy [Kelly hosts an AFL podcast] as well, there's so much negativity and putting down and just sort of tropes that are masculine, and just trying to reaffirm by setting the example that it doesn't have to be that way.\n\n\n\n\n\n\"We do that a lot with our stuff — but I think if things are too didactic or too instructional, you do lose a lot of people, when you could be getting them.\"\n\n\n\nGiven how many Australian references are littered throughout Aunty Donna's work (everything from Hey, Hey, it's Saturday to Eagle Boys Pizza), it's perhaps surprising that global streaming giant Netflix was willing to give them their own show before any local TV networks.\n\n\n\n\n\nAunty Donna's Big Ol' House of Fun, which was co-produced by Office star Ed Helms' company Pacific Electric Picture Company, was also the only time they were given free rein to make the show they wanted.\n\n\n\n\n\n\"Every other time, it was very heavily: 'You can't just do what you want to do. It has to be this, it has to tick all these boxes,' Bonanno says.\n\n\n\n\n\nKelly adds: \"Often we've seen in places we've made shows before that the shows they make need to be for everyone at one time, and there's an argument that's not the best representation of diversity … maybe it's giving chances to diverse people to represent what they want to represent, as opposed to putting a square peg in a round hole.\"\n\n\n\nAunty Donna's Coffee Café, the TV series they produced for the ABC, featured a long list of guest start including Rake star Richard Roxburgh (centre) and Matt Doran (second from left), who played Mouse in The Matrix. Source: Supplied / ABC Asked if they felt they needed to make it overseas to be taken seriously back home, Aunty Donna doesn't pull any punches.\n\n\n\n\n\n\"It's almost like we don't need to answer that question; the world answered the question for us,\" Ruane says.\n\n\n\n\n\nBonanno adds: \"That is Australia. That's music, that's TV, that's comedy, that's all the arts in Australia is. We don't tend to lift people up until overseas says 'This is great'.\"\n\n\n\nBuilding a 'mini Netflix for Australian comedy'\n\nThe risk-averse nature of the local screen industry has prompted Aunty Donna to invest their own money in nurturing talent that doesn't necessarily fit a mainstream mould, through their production company Haven't You Done Well and comedy network Grouse House.\n\n\n\n\n\n\"We kind of entrepreneurially just saw that there was a hole in the market and that every network in the country was not doing their job in platforming really good people,\" Kelly says.\n\n\n\n\"We just thought: 'Let's see if we can build something that can eventually compete,' so we've hired a whole team around us who are building this platform and building out shows and rollouts, and it's really fun to watch.\"\n\n\n\n\n\nWhile they're starting small by funding comedians they've worked with in the past, including Demi Lardner and Greg Larsen, they hope in the long-term that Grouse House can become a \"mini Netflix for Australian comedy\".\n\n\n\n\"We see these people that are really, really good … they just need that opportunity,\" Ruane says of their desire to help other Australian comedians create sustainable careers.\n\n\n\n\n\n\"As we grow that community out and fold more people in, hopefully, eventually we get to a place where [people say] 'Well, if Grouse House is doing it, then it's good'.\n\n\n\n\n\n\"The goal would be that there are fans of Grouse House in five years' time that have never heard of Aunty Donna, they just love that brand.\"\n\n\n\nThe end of an era\n\nNever ones to rest on their laurels, Aunty Donna are back out on the road with DREM, their first live show in two years.\n\n\n\n\n\nThe show promises to be as silly and energy-filled as audiences have come to expect from the group, while also offering something new.\n\n\n\n\n\n\"I would argue that DREM is our freest show when it comes to the ideas that are in it and how we've kind of put the show together. Production-wise, I'm the most excited about [it] because we are doing stuff that we have never done before,\" Bonanno says.\n\n\n\nAunty Donna's live shows are known for being a high octane, assault on the senses — in the best kind of way. Source: Getty / Roberto Ricciuti It's also the first time in their career that they don't have any plans about when they'll tour again.\n\n\n\n\n\n\"We're kind of okay with the idea we won't be touring after this for a little bit because, for me at least, it feels like a real bookmark of this era where we learned all these lessons about how to make audiences laugh,\" Kelly says.\n\n\n\n\n\nRuane adds: \"It's nice to just have a bit of ambiguity there. We haven't had that for a long time.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/video/indian-australian-filmmaker-debuts-video-installation-at-darwin-festival/t94apy14s",
    "title": "Indian Australian filmmaker debuts video installation at Darwin Festival",
    "publish_date": "Fri, 22 Aug 2025 10:07:19 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Indian Australian filmmaker debuts video installation at Darwin Festival\n\nPublished 22 August 2025, 9:18 am\n\nOne of the Northern Territory's largest cultural festivals is happening in Darwin, featuring more than 700 local and international artists. Among the artists is Naina Sen, whose installation involved the input of hundreds of women from Australia's Indian diaspora to reconstruct the meaning of their female identity.",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/zelenskyy-returns-to-the-white-house-netanyahu-torches-albanese-xi-visits-tibet/iar43mh8n",
    "title": "Zelenskyy returns to the White House, Netanyahu torches Albanese & Xi visits Tibet",
    "publish_date": "Fri, 22 Aug 2025 08:13:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/sport/afl/afl-live-gws-st-kilda-bulldogs-fremantle-hawthorn-brisbane-in-finals-deciding-super-sunday-20250823-p5mp8d.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL LIVE: GWS host St Kilda to kick off Super Sunday",
    "publish_date": "Sun, 24 Aug 2025 12:10:06 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari",
      "Scott Spits"
    ],
    "text": "If GWS expect an easy win over St Kilda, Giants star Tom Green reckons they’d be kidding themselves.\n\nThe Giants only need to flick to last year in the history books to be reminded of how easily Ross Lyon’s Saints can upset the finals order.\n\nIt was round 24, 2024 and Carlton needed to beat St Kilda to seal their top-eight spot.\n\nInstead, Jack Higgins’ last-gasp goal fired the Saints to an upset two-point win that opened the door for Fremantle, who were playing in the last game of the home-and-away season.\n\nTom Green. Credit: Getty Images\n\nThe Dockers ultimately lost to Port Adelaide but it remains a cautionary tale as 12th-placed St Kilda seek to play finals spoilers at Engie Stadium on Sunday, when GWS look to secure a home elimination final.\n\nNow boasting the signature of in-demand talent Nasiah Wanganeen-Milera, Lyon’s side are gunning for a fifth straight win.\n\nThe Giants, one of four teams that started the final round on 60 points, can finish as high as fifth or as low as eighth, depending on how results fall.\n\nIf that wasn’t enough motivation, Giants academy product and defender Harry Himmelberg will also mark his 200-game milestone.\n\n“If we think we’re going to roll in and just get a result, I think we’d be kidding ourselves,” Giants midfielder Green told AAP. “There’s a lot to play for. We won’t be taking the game lightly.”\n\nCurbing Wanganeen-Milera’s impact on the game will be No.1 on the agenda for the Giants.\n\nThe 22-year-old has had a devastating effect on opponents since being moved from half-back into the midfield this year.\n\nDeploying Toby Bedford as a tagger is a lever GWS coach Adam Kingsley could pull, though the midfielder-forward hasn’t been used recently in that role.\n\nIf it were up to Green, it wouldn’t be him either.\n\n“He’s (Wanganeen-Milera) probably too quick for me,” Green joked. “He’s playing a little bit of everywhere and has a bit of a license to go and influence the game in all parts of the ground. He will be a tough prospect to stop and if we can go some way to dealing with him, I’m sure that’ll help us get close to a good result.”\n\nGWS are unchanged for Sunday’s clash after initial hopes of defender Jack Buckley (calf) playing his first game since round 20. Lethal small forward Brent Daniels, absent since round 14, will make his return from an adductor injury through the VFL.\n\nSt Kilda made one change, with last week’s debutant Alex Dodson making way for Isaac Keeler.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/afl/st-kildas-won-the-lottery-bartel-on-splash-for-reid-20250824-p5mpc4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'St Kilda's won the lottery': Bartel on splash for Reid",
    "publish_date": "Sun, 24 Aug 2025 11:46:06 +1000",
    "category": "finance",
    "authors": [],
    "text": "'St Kilda's won the lottery': Bartel on splash for Reid\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/go-kid-fogartys-box-seat-for-mudgee-miracle-20250824-p5mpbr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Go kid': Fogarty's box-seat for Mudgee miracle",
    "publish_date": "Sun, 24 Aug 2025 11:05:32 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Go kid': Fogarty's box-seat for Mudgee miracle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/the-hill-was-pumping-dce-reflects-on-milestone-game-20250824-p5mpbj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'The hill was pumping': DCE reflects on milestone game",
    "publish_date": "Sun, 24 Aug 2025 10:35:19 +1000",
    "category": "sports",
    "authors": [],
    "text": "'The hill was pumping': DCE reflects on milestone game\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/best-goals-mw1-premier-league-20250822-p5mp12.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Best Goals | MW1: Premier League",
    "publish_date": "Sun, 24 Aug 2025 09:51:58 +1000",
    "category": "sports",
    "authors": [],
    "text": "Best Goals | MW1: Premier League\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/chalobah-seals-it-for-chelsea-20250823-p5mp6l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chalobah seals it for Chelsea",
    "publish_date": "Sun, 24 Aug 2025 09:51:55 +1000",
    "category": "finance",
    "authors": [],
    "text": "Chalobah seals it for Chelsea\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/gyokeres-opens-his-premier-league-account-20250824-p5mpa1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gyokeres opens his Premier League account",
    "publish_date": "Sun, 24 Aug 2025 09:51:17 +1000",
    "category": "sports",
    "authors": [],
    "text": "Gyokeres opens his Premier League account\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/wet-weather-ruins-weekend-sports-across-sydney-20250824-p5mpb5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Wet weather ruins weekend sports across Sydney",
    "publish_date": "Sun, 24 Aug 2025 09:46:40 +1000",
    "category": "sports",
    "authors": [],
    "text": "Wet weather ruins weekend sports across Sydney\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/regret-hits-pep-after-goalkeepers-horror-error-20250823-p5mp9m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Regret hits Pep after goalkeeper's horror error",
    "publish_date": "Sun, 24 Aug 2025 09:45:53 +1000",
    "category": "sports",
    "authors": [],
    "text": "Regret hits Pep after goalkeeper's horror error\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/surfer-shares-update-after-shark-attack-on-nsw-beach-20250824-p5mpb4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Surfer shares update after shark attack on NSW beach",
    "publish_date": "Sun, 24 Aug 2025 09:39:56 +1000",
    "category": "finance",
    "authors": [],
    "text": "Surfer shares update after shark attack on NSW beach\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/business/companies/subway-s-new-challenger-the-next-penfolds-six-asx-chiefs-on-what-s-hot-20250819-p5mnxv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Subway’s new challenger, the next Penfolds: Six ASX chiefs on what’s hot",
    "publish_date": "Sun, 24 Aug 2025 09:30:00 +1000",
    "category": "finance",
    "authors": [
      "Jessica Yun"
    ],
    "text": "There are only a handful of names that can be considered luxury Australian brands. R.M.Williams is one; Aesop paved the way for high-end handwash; and Penfolds is another. The luxury wine makes up more than a third of parent company Treasury Wine Estates’ total revenue of nearly $3 billion. Patrimony wine from Daou Vineyards: is this the next Penfolds? Treasury has weathered Australia’s trade war with the lucrative China market, which has been fatal for many Australian wineries, without suffering brand damage. It lifted prices, and held them, at a time when many households were struggling with cost of living pressures. While demand for luxury wine continues to grow steadily, cheaper wine has become unpopular. Treasury has been forced to keep its commercial wine brands after trying and failing to find a buyer for the right price. There’s a lot riding on the success of Penfolds. Would it be prudent to have another brand in the works?\n\nIndustry watchers will know that what Treasury’s $1.6 billion acquisition of Californian wine brand Daou Vineyards was about. “It’s interesting; if you’re in California, Daou needs no introduction and Penfolds probably does. Here in Australia, or in China obviously, it’s vice versa,” said Treasury chief Tim Ford. Loading How exactly do you build a brand that’s considered luxury? It’s all about experiences, said Ford, who said old, traditional advertising methods would not cut it any more. “A brand that links to experiences, that then brings status to the consumer as they are consuming, buying, gifting that product, whatever the occasion may be, is how you build these brands,” he said. “It’s a luxury brand playbook from around the world … We don’t think we’ve created it, we’ve copied them from other luxury brands, but we’ve done a pretty good job with Penfolds, and we plan to do a similar job at Daou.”\n\nA2 Milking it Former market darling A2 Milk is best known for its infant formula, but tucked away in this $5.8 billion dual-listed company is a tiny, fast-growing part of the business: milk powder for adults and seniors. One of A2 Milk’s biggest challenges is the declining birth rate in China, a market that accounts for three-quarters of the business. Meanwhile, millions of people are getting older every year, and demand is increasing for fortified and functional milk powder. A2 Milk chief David Bortolussi: The infant formula company’s fastest-growing part of the business isn’t infant formula. Credit: David Rowland “The number of newborns has come down over the last 20 years from 30 million to less than 10 million,” said A2 Milk chief David Bortolussi. “Every year you’ve got almost like 25 to 30 million seniors falling into that [60 years and above] category … Not surprisingly, their nutritional needs are not too dissimilar to younger people.”\n\nA2 Milk recently introduced three new products for bone strength, gut health, and heart health that are going well, Bortolussi said. Its fortified milk business grew 23 per cent during fiscal 2025. “I’d want [it] to be as big as it possibly can.” Subway has a new challenger You might not know Retail Food Group by name, but you’ve almost certainly heard of Gloria Jean’s and Donut King. The food franchisor’s portfolio also encompasses pizza chain Crust, Brumby’s Bakery, Beefy’s pies, Firehouse Subs, Michel’s patisserie, as well as CIBO Espresso and Pizza Capers. ASX food chain franchisor Retail Food Group is positioning Firehouse Subs as a superior rival to Subway. Running 1250 outlets across 30 countries is a lot to keep track of, which is why Retail Food Group has been phasing out low-performing brands (such as Michel’s and CIBO) and backing brands they see growth potential in.\n\n“The best chance of accelerating growth in the next phase is around our Beefy’s and Firehouse [Subs] businesses,” said Retail Food Group chief Matthew Marshall. Loading Retail Food Group has aggressive store expansion plans for Beefy’s Pies (50 stores by 2028) and sandwich business Firehouse Subs, with a target to open 165 stores, which Marshall is hoping will eat some of Subway’s lunch. “It’s a $1.7 billion category, it’s growing fast, and it’s really only got one big competitor in Subway,” he said. “We’ve got a really, really strong case here to shake up the category and have a real go at bringing something new.” As part of efforts to focus on fewer, better brands, the group is putting Brumby’s Bakery up for sale. A review of the bakery chain’s value resulted in a $12.2 million write-down. “Our priorities have changed over the years,” the company stated.\n\nDiscounting is out of fashion Two years ago, when Australians were counting their dollars more carefully after 13 interest rate rises, retail markdowns of 30 per cent to 40 per cent were common – but you won’t find smart retailers doing that. Youth fashion retailer Universal Store grew total sales by 15.5 per cent despite a pretty tough retail environment, which chief executive Alice Barbery said was down to “great range curation” and “really robust and beautiful” offers. Universal Store chief executive Alice Barbery. Credit: Peter Wallis “A lot of people might be growing with top-line sales, but they’re doing it at the cost of gross margin, so it’s through discounting. We’ve been able to do that without … participating in the rampant discounting,” she said. Tight inventory control is also key. “We’ve trained our customer to pay full price. We also want to be sure that we don’t end up with over-stock issues, which devalues the product.”\n\nUniversal Store appears to be doing much better than its rival, General Pants Co, which has been quietly closing stores across the country and is battling its third attempt to be wound up by frustrated suppliers attempting to claw back thousands of dollars owed by the retailer. Ingham’s hungry for fast food Chicken has been a winner on the dinner tables of Australians for its relative affordability compared with red meat prices, which have risen by 25 per cent for lamb and 40 per cent for beef over the past five years. Ingham’s needs to win new customers. Credit: But major poultry supplier Ingham’s has had a tough year; a major supply contract with Woolworths ended after the nation’s grocery chain decided to diversify its pool of suppliers, leaving Ingham’s to fill the gap by selling more to Coles, Aldi and IGA.\n\nIn short, Ingham’s needs more customers for its chicken. It’ll focus on what it can control, but is hoping for a fast-food fix. “There’s some good growth prospects as it relates to the emerging and medium-sized quick-service restaurants,” said new chief Edward Alexander. Loading Ingham’s supplies chicken to KFC, McDonald’s and Nandos. Cost of living pressures have led customers to make meals at home instead of eating out, to the detriment of Ingham’s food-service sales, but Alexander is hoping to see foot traffic return to eateries. “[Quick-service restaurant] operators have really gotten back, not to a point of growth, but certainly seeing some green shoots as it relates to the sales and some of their foot traffic measures,” said Alexander.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/who-are-wa-s-work-release-prisoners-and-the-nordic-model-experts-say-we-should-follow-20250819-p5mo83.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Who are WA’s work-release prisoners? (And the Nordic model experts say we should follow)",
    "publish_date": "Sun, 24 Aug 2025 09:22:23 +1000",
    "category": "finance",
    "authors": [
      "Rebecca Peppiatt"
    ],
    "text": "When it was revealed this month that prisoners on secondment at work placements had reportedly been eating guinea pigs, moral condemnation was followed by the question; who are these prisoners, and what are they doing out of their cells?\n\nA new report released this week shed some light on the matter, revealing conditions within the program were less than ideal and inmates were being paid less than $8 a day while being given limited food and performing physically demanding work in the community.\n\nWooroloo Prison Farm is a minimum-security facility near Perth. Credit: Office of the Inspector of Custodial Services\n\nHowever, despite the poor pay, competition to be part of the work release program is high, with the report revealing the numbers of prisoners wanting to participate outweighed the number of places.\n\nThe work they complete is community-oriented and well-received, according to the report from the Office of the Inspector of Custodial Services.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw2-man-city-vs-spurs-20250824-p5mpao.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW2: Man City vs Spurs",
    "publish_date": "Sun, 24 Aug 2025 09:05:46 +1000",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW2: Man City vs Spurs\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://au.news.yahoo.com/big-detail-road-user-tax-013909733.html",
    "title": "Big detail in road user tax confirmed",
    "publish_date": "2025-08-24T01:39:09Z",
    "category": "finance",
    "authors": [
      "Jessica Wang"
    ],
    "text": "With EV driver set to face a road user tax in the coming years, Jim Chalmers has said the levy will not operate as a “double tax” on petrol cars. Picture: NewsWire/Tertius Pickard\n\nJim Chalmers has clarified the pending road user charge will only be applied to electric vehicle drivers and will not be used as a way to “double tax” motorists who use petrol vehicles.\n\nFollowing Thursday’s three-day roundtable, the Treasurer said there was broad consensus for a tax which would result in EV drivers being slugged with a tax, to make up for revenue lost through the fuel excise for petrol vehicles, currently calculated at 51.6 cents a litre.\n\nThe money is used to pay for road maintenance and upgrades, with the fee is automatically calculated into the cost of petrol when filling us at the bowser.\n\nFurther talks, including the presentation of an options paper, will occur at a joint state and federal treasurers’ meeting on September 5, following consultation with states and Infrastructure Minister Catherine King.\n\nADVERTISEMENT\n\nOn Sunday Mr Chalmers clarified the road user charge would only be applied to EV drivers and said it would not a “double tax on internal combustion engines”.\n\n“Our focus in road user charging is on electric vehicles,” he confirmed.\n\n“We are trying to make sure that people who drive EVs, increasing numbers of people who drive electric vehicles are making a contribution to the upkeep of the roads that they use.”\n\nThe Commonwealth government is progressing negotiations on a road user charge for EV vehicles. Picture: NewsWire/ Tertius Pickard\n\nMr Chalmers added that members at the roundtable flagged questions on whether the rollout of a charge would be staggered or include light vehicles (i.e. cars) from the outset.\n\n“The main point of contention at the reform roundtable was actually whether a road user charging regime focused on electric vehicles begins with heavy electric vehicles like electric trucks and there is some kind of sequence after that, or whether we be more ambitious earlier,” he said.\n\nADVERTISEMENT\n\n“I don’t want to predetermine the discussions I’ve had with the states and considerations with our government … but we have made it clear that we do think a change is required here and we will take the time to get it right.”\n\nNSW is the only state which has flagged a road user charging system to hit EVs either by July 2027 or when EVs make up 30 per cent of all new vehicle sales.\n\nJim Chalmers has said it will not be a ‘double tax’ on petrol cars. Picture: NewsWire / Martin Ollman\n\nVictoria attempted to bring in a similar proposal – calculated about 2 cents a kilometre – in 2022.\n\nBut the High Court ruled it as unconstitutional in 2023 and said the excise tax should be in the realm of the Commonwealth.\n\nThe Coalition has also indicated support for a levy on EV drivers, saying it will consider the merits of the policy once more details are released.\n\n“Everybody agrees that it is not fair that some road users who fill up their car with petrol and diesel pay the costs of maintaining roads, and some road uses who have an EV don’t contribute to that cost, and so that is an issue which needs to be recognised,” Coalition finance spokesman James Paterson said on Friday.\n\nADVERTISEMENT\n\n“We want to see the details here, and it will involve co-operation with the states. It sounds like it’s not something that’s going to come very quickly, but we’ll consider on its merits any proposal that the government brings forward.”\n\nhttps://www.instagram.com/brandon_69x5/",
    "source": "Yahoo",
    "cluster_id": 42
  },
  {
    "url": "https://au.news.yahoo.com/tax-perks-super-retirees-deserved-005739328.html",
    "title": "Tax perks on super for retirees 'deserved': treasurer",
    "publish_date": "2025-08-24T00:57:39Z",
    "category": "finance",
    "authors": [
      "Andrew Brown"
    ],
    "text": "Retirees still deserve concessional treatment on their superannuation, the treasurer says, despite mounting calls for an overhaul of the tax system.\n\nJim Chalmers said fairness for younger generations needed to be considered as part of any change to taxes, following talks at the three-day productivity roundtable in Canberra.\n\nWhile he said calls for tax reform at the summit would inform upcoming federal budgets, he said there was no plan to alter concessional tax measures for retirees on their super balances.\n\n\"They still deserve concessional treatment to encourage people to be in superannuation, and that's not something that we have been proposing to change,\" Dr Chalmers told ABC's Insiders program on Sunday.\n\nIntergenerational fairness would be central to any reform of the tax system, Jim Chalmers says. (David Crosling/AAP PHOTOS)\n\n\"We need to ensure, collectively as Australians, that the fair go is the defining part of our future and not just the defining part of our past.\"\n\nADVERTISEMENT\n\nAhead of the summit, there were calls for attendees to consider changes to capital gains tax and negative gearing, as well as an overhaul of the GST.\n\nWhile the treasurer said intergenerational fairness would be central to any changes, there would not be a rush on implementing reform.\n\n\"The best way to work out any additional steps beyond that is to do that in the government's usual consultative and considered way, which is what we're doing,\" he said.\n\n\"We didn't, at the conclusion of the roundtable, rewrite our policies in those areas. More broadly, intergenerational equity has been a motivation for so much of what we're already doing in tax.\"\n\nThe treasurer also confirmed proposed changes to tax on super balances over $3 million, would not be brought to parliament in the upcoming sitting fortnight, but would be brought in eventually.\n\nThe Treasurer said calls for tax reform at the summit would inform upcoming federal budgets. (Mick Tsikas/AAP PHOTOS)\n\n\"I proposed what is a pretty modest change, but a meaningful change which makes the system a bit more sustainable,\" Dr Chalmers said.\n\nADVERTISEMENT\n\n\"It doesn't begin to be calculated until the second half of next year, and so we've got time to reintroduce that.\"\n\nWhile there was support at the economic summit for a road user charge for electric vehicle drivers, the treasurer said those who have petrol cars would not be double taxed for the measure.\n\nIt comes as shadow treasurer Ted O'Brien admitted the coalition got its tax position wrong ahead of the May federal election, when the opposition opposed broad tax cuts.\n\nBut he said he would not be surprised if the government introduced a raft of additional taxes.\n\n\"If you just keep on spending, you've got to get the money from somewhere,\" he told Sky News.\n\n\"When you can't control your spending, you're just going to increase debt and increase taxes. That's pretty clear.\"",
    "source": "Yahoo",
    "cluster_id": 43
  }
]