[
    {
        "url": "https://www.9news.com.au/world/trump-installs-gigantic-us-flags-at-the-white-house/cd552c24-8464-4c04-85ce-dcdab3bef21f",
        "title": "'The best poles': Trump's odd installation",
        "publish_date": "Thu, 19 Jun 2025 04:31:13 +0000",
        "category": "finance",
        "authors": [
            "June"
        ],
        "text": "5 of 9 Attribution: AP\n\nTrump is still a real estate magnate, enthusiastically consumed with the finer details of construction – including the materials used inside the poles, which he says he paid for himself.\n\nThe reality of his day job, however, repeatedly cut in to Wednesday's festivities.\n\nTrump fielded questions on Iran, Israel, immigration and protests in California.\n\nIn between, he marvelled at the process of lifting the pole, which he said cost \"like $50,000\".\n\n\"They put sand inside, and if they use dirt or anything else other than sand, it rots out the pole over a period of years.\n\n\"But sand, for some reason, chemically just works. It gives you flexibility and it doesn't do anything to the cask,\" he said as he observed the new, nearly 30m pole being put in the ground.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/queensland-crane-drivers-milliondollar-mission-to-cure-the-cancer-that-killed-his-daughter/015cc6d9-b1f3-4ac6-9188-7ea5af74f3c1",
        "title": "A dad's million-dollar mission to fight the cancer that killed his daughter",
        "publish_date": "Wed, 18 Jun 2025 19:51:41 +0000",
        "category": "sports",
        "authors": [
            "Jun"
        ],
        "text": "Exclusive: Ren Pedersen's daughter, Amy, loved ballet and would run like the wind, with her strawberry-blonde hair flying behind her.\n\nNot long before she was diagnosed with a DIPG brain tumour - known as the deadliest childhood cancer - the seven-year-old won an interschool sprint race.\n\nThe first sign that something was wrong came when she started tripping over her feet, Pedersen said.\n\nAmy loved ballet and was an athletics champion. (Supplied)\n\n\"She said, 'Dad, it's these thongs', so I was chasing footwear,\" said the crane driver from Townsville.\n\n\"Then she started turning her head, and she was having little funny eye episodes,\" Pedersen said.\n\nPedersen took his daughter to an ophthalmologist, who told them to get to a doctor straight away.\n\n\"She didn't elaborate, but we found out soon after that Amy's ophthalmologist had lost both of her children to brain cancer,\" Pedersen said.\n\nWith no cure for the aggressive cancer, and limited treatment options, most children with DIPG die within a year.\n\nHaving caught the tumour relatively early, Amy managed to live for 16 more months, before she died, aged 9, in 2009.\n\nFor years after her death, Pedersen would find heartwrenchingly sweet handwritten notes Amy had left for him around the house.\n\nREAD MORE: Steve donated his kidney to a stranger and set an Australian record\n\nRen Pedersen's daughter Amy died in 2009, aged 9. Pictured at right is one of the many notes from Amy that Pedersen found after her death. (Supplied)\n\n\"They would say things like, 'Don't give up, Dad',\" he said.\n\n\"She'd hide them in between a pair of shorts or something like that.\"\n\nThe notes tracked the progression of Amy's illness as she lost the ability to write with her right hand and had to relearn the skill with her left.\n\n\"There were dozens of notes,\" he said.\n\n\"I get them out every now and again, but I can't lie to you, they're very hard to read.\"\n\nLosing Amy galvanised Pedersen into action, inspiring him to fight for a cure for DIPG.\n\nHaving no medical background proved to be somewhat of an advantage for Pedersen, who simply jumped right in, approaching Australia's leading oncologists and neurosurgeons he had come to know well during Amy's illness.\n\n\"I used these personal connections and I asked, once my daughter passed away, 'What would you do? What can I do as a father to empower you to save these kids in the future?'\" Pedersen said.\n\n\"The first thing we needed was autopsy samples. So I had parents approach me with children with terminal illness, and we created protocols that could debulk or remove the tumours from these deceased children.\"\n\nRen Pedersen, pictured with his daughter Amy, and (right) more of the notes she left for him in their home. (Supplied)\n\nWith the help of Pedersen's connections, the Children's Cancer Institute established Australia's first-ever tumour bank for DIPG in 2011, led by Associate Professor David Ziegler – a paediatric oncologist at Kids Cancer Centre, Sydney Children's Hospital, as well as a cancer researcher at the Institute.\n\nResearch into DIPG has come a long way in the past 15 years, with significant breakthroughs made by Australian researchers.\n\nIn 2021, research from Ziegler's team was published showing the tantalising potential of a revolutionary drug combination.\n\nPre-clinical testing in mouse models showed impressive results, with the promising drug combination leading to survival in two-thirds of the mice.\n\nIn March this year, another Australian-led study investigating incurable brain cancers, including DIPG, was published.\n\nThe study of 252 patients, 153 of whom had DIPG, revealed that 7.5 percent of the children had important changes in cancer predisposition genes, including the BRCA gene, best known for its association with breast and ovarian cancer.\n\nFor the first time, the research showed the tumours could develop because of underlying germline variants. The study may have major therapeutic implications and help researchers understand how the tumours begin and how they might be treated.\n\nHowever, the challenge remains to bridge the gap between groundbreaking research and accessible treatments.\n\n\"What we've got to do is get these treatments to the bedsides of the children,\" Pedersen said.\n\nWith this core aim in mind, Pedersen - who has received an Order of Australia medal for his work - launched \" Ren's Million Dollar Mission \" last November.\n\nThe mission aims to raise one million dollars for the Children's Cancer Institute , with Pedersen vowing to seek out 1000 individuals or companies who could each donate $1000.\n\n\"It's quite a daunting thing,\" Pedersen said.\n\n\"I'm in a town that's just been smashed by floods. It's had the toughest year. But I thought, surely there's got to be 1000 people across Australia with $1000 who can tap on a credit card.\n\nSo far, Pedersen has raised $110,000 in Townsville alone. He is now casting his net wider and taking his mission to the bigger cities, visiting Sydney next week.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-20/state-of-the-budget-tasmanian-election-campaign-analysis/105438996",
        "title": "'Show us their savings': Business leader, economist on Tasmanian election",
        "publish_date": "Fri, 20 Jun 2025 00:50:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Labor declared it had tabled a motion of no-confidence in Premier Jeremy Rockliff, it listed three main reasons.\n\nThey were the potential privatisation of public assets, the failure to deliver the new Spirit of Tasmania ferries on time, and the state of the Liberal government's budget.\n\nOn that budget, here are a few quick figures:\n\nTasmania currently has $3.5 billion in debt\n\nIn four years' time that is expected to grow to $10.7 billion\n\nBy that point the repayments on that debt will total roughly $650 million a year\n\nThe state is not expected to return to a net operating surplus (meaning we earn more than we spend) until the end of the decade\n\nTasmania is aiming to achieve a fiscal balance by 2033 (meaning once you take away federal government grants for projects the state is still earning more than it spends)\n\nLoading...\n\nNow, with Tasmania in an election campaign, business leaders and economists are hoping to hear the major parties' plans for repairing the balance sheet.\n\nThe Tasmanian Chamber of Commerce and Industry's Michael Bailey says as the election is largely about the budget, the campaign should be fought on it.\n\n\"What we're calling for both sides to do is to show us their savings plans,\" Mr Bailey said.\n\nMichael Bailey wants efficiencies within the public service found. (ABC News: Jonny McNee)\n\nWhat are Tasmanians being promised at their state election? Photo shows Thumbnail image for Tasmania state election 2025 promise tracker article. We keep track of each party's election promises so voters can make an informed decision.\n\n\"Tasmania has a spending problem at the moment.\n\n\"We need to make sure that we can get our spending back under control.\"\n\nThat partially refers to the fact the state has a history of spending more than it budgets for, particularly in health.\n\nHere's how the Liberals and Labor have been treating the issue of spending and budget repair:\n\nParties often spend big at elections\n\nElections are often a big-spending affair.\n\nThe Liberals have previously been accused of pork barrelling (slang for bribing the electorate for their votes), but they say they are simply listening to community concerns.\n\nLabor also promised a whole heap of community grants last election. The main difference is the relevant department would eventually assess them to decide if they were worthy of spending money on.\n\nYour Say: Tell us what matters to you this Tasmanian election Photo shows Have your say for the Tasmanian election. We want to know what issues matter most to you and what you want us to find out as Tasmania goes to another election.\n\nThere are also a whole heap of other policies, such as the stamp duty exemption for first home buyers, that will cost taxpayers money.\n\nAnd those spending promises really add up.\n\nEconomist Saul Eslake says Treasury data shows the 2018 and 2021 elections each added $1.4 billion of spending to the budget without any mention of how to pay for the promises.\n\nLast year's was even more expensive.\n\nSaul Eslake says that as a proportion of our economy, Tasmania's debt is larger than that of any other state or territory. (ABC News: John Gunn)\n\n\"The government in the 2024 election committed to spending $1.7 billion whilst only mentioning $11 million of revenue by way of a levy on short-stay accommodation,\" Mr Eslake said.\n\n\"[The levy is] about the only election commitment that hasn't been met since the election.\n\n\"Labor would've spent an additional $2 billion over five years if they had won.\n\n\"So, to hope that that wouldn't be repeated in the election campaign would be a bit like Samuel Johnson's definition of second marriage — a triumph of hope over experience.\"\n\nSaul Eslake has long suggested that Tasmania swap stamp duty for land tax. (ABC News)\n\nHow could Tasmania increase its revenue?\n\nAt the moment, 40 per cent of Tasmania's money comes from the carve up of GST. Around a third is own-source revenue.\n\nThe Tasmanian state budget has been handed down. What's in it? Photo shows A female paramedic walks past an ambulance parked outside the Royal Hobart Hospital. The Tasmanian budget has been handed down for 2025-26. So what's being spent where?\n\nMr Eslake has put forward several options to raise more money, including collecting more payroll tax from businesses, raising car registration fees, adding a duty on the purchase of expensive new motor vehicles — \"with appropriate concessions for pensioners and other low-income earners\".\n\nHe also suggested switching stamp duty to a land tax and increasing mining royalties.\n\nHe says Tasmania collects about $40-50 million a year less than it would if its scheme was equivalent to those of other states.\n\nTreasurer Guy Barnett's 2025-26 state budget included more than $1 billion for health services over the next four years. (ABC News: Luke Bowden)\n\nMoney could also be found by asking the salmon industry to pay royalties for the use of Tasmanian waters.\n\n\"If they were to pay a royalty of 5 per cent of revenue, for example, that could potentially raise $6.75 million for the budget annually,\" Mr Eslake said.\n\n\"That wouldn't solve Tasmania's problems, of course, but it would make a useful contribution to reducing the deficit over time.\"\n\nAll of these ideas have been rejected by the major parties.\n\nMr Rockliff also pointed out that legislative changes in 2023 meant the salmon industry now pays for its own regulation.\n\n\"The salmon companies cost government. They return that to government, so it's cost neutral and that's been a significant reform under our government,\" he said.\n\nSalmon farming in Tasmanian waters has been a divisive issue. (ABC News: Ebony ten Broeke)\n\nAnother way to raise revenue, selling off state-owned companies and government business enterprises has been ruled out by both major parties already.\n\nTasmania's deteriorating finances 'entirely attributable' to government policies, independent review finds Photo shows A man in the suit on the left looks happy with himself and a man in the right in a suit looks up up at the gallery Tasmania's financial position is on track to \"become worse than that of any other state or territory over the next three years\", with $16 billion in debt by 2035, economist Saul Eslake's independent review of the state's finances finds.\n\nAs have any new taxes.\n\nGrowing the economy is also a big part of how both major parties plan to get the state out of debt.\n\nAs part of that, the Liberals have been waging a war on red tape, and if some of Labor's new policies are anything to go by, they're planning to do the same.\n\nWhen asked about increasing revenue, Labor leader Dean Winter talked about growing the economy by unlocking $25 billion in renewable energy developments.\n\nPremier Jeremy Rockliff on the other hand said investments in key services such as health, education and community safety would help increase revenue.\n\nThe Spirit of Tasmania debacle was listed as one of the reason's behind Labor Leader Dean Winter's push for a no-confidence motion. (ABC News: Mackenzie Heard)\n\nWhere are the parties eyeing cuts?\n\nThe TCCI's Michael Bailey is less worried about the revenue side of things.\n\n\"You don't give someone with a spending problem more money,\" he says.\n\nMr Bailey wants the parties to find efficiencies in the public service, arguing that it's grown by 30 per cent since the COVID pandemic.\n\n\"We know that we're borrowing to pay for those wages,\" he said.\n\n\"They do wonderful work, but it's simply too big for what Tasmania can afford right now, so we would argue that that's the first thing that should be looked at.\"\n\nTasmania was forced back to the polls after Premier Jeremy Rockliff refused to stand down after a successful no-confidence motion. (ABC News: Ebony ten Broeke)\n\nBoth major parties have revealed their plans to find some savings, and they include the creation of new units.\n\nThe Liberals' plan, which was announced in March, is called the Efficiency and Productivity Unit (EPU); Labor has the Review and Evaluation Unit (REU).\n\nTwo names and slightly different descriptions for two things that will do very similar things — examine the effectiveness and value for money of government programs to try and identify savings.\n\nThe Liberals are assuming they will be able to cut spending to the point where in three years' time overall government expenses will be less than they are this year.\n\nThey hope to find savings through:\n\nAn efficiency dividend of $300 million over three years that started in the 2024-25 financial year\n\nA productivity and efficiency measure that replaces the efficiency dividend in 2027–28. It'll be aiming to find at least $150 million in savings across the whole of government sector in that first year\n\nCutting 2,500 public sector jobs over the next decade\n\nLabor's plans to \"save the budget more than half a billion dollars\", while not outlined in an alternative budget, were part of leader Dean Winter's budget reply speech.\n\nThey hope to do this by:\n\nAbandoning the fifth lane on the Southern Outlet ($160m savings)\n\nRemoving the associate secretary roles put in place a few years ago ($8 million per year)\n\nDitching the Liberals' $10 million tourism voucher scheme (the vouchers are due to be dispensed during the election period)\n\nSetting a cap on departmental spending on consultants, government advertising and travel ($60m savings)\n\nCutting the number of government media advisers in half (saving $5 million over the forward estimates)\n\nThis list is far from extensive, however, none of the policies have been costed by treasury.\n\nIf the party that wins government does not right the ship, Mr Eslake estimates Tasmania is heading to a debt of $16 billion by 2035 with repayments to hit $750 million a year.\n\n\"We've gone from in the middle of the past decade, being a net creditor, that is having more money in the bank than the government owes by way of debt, to now having debt and other liabilities,\" Mr Eslake said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-20/electrify-2515-renewable-energy-household-conversion-milestone/105426002",
        "title": "Scores of homes go green amid plan to run entire postcode off renewables",
        "publish_date": "Fri, 20 Jun 2025 00:25:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Scores of households have been converted to run off renewable energy in a significant step towards the goal of electrifying an entire New South Wales postcode.\n\nTosca Lloyd is one of the lucky few to benefit from the Electrify 2515 community pilot, which has so far converted 60 homes in the Illawarra postcode.\n\nShe said saving money was just as important as addressing climate change.\n\n\"We see switching to renewables and electrifying as one and the same as addressing the cost of living crisis and also the climate crisis,\" Ms Lloyd said.\n\nThe battery connected to Tosca Lloyd's family home will be switched on in July. (Supplied: Electrify 2515)\n\nShe was also motivated to get gas out of the house for health reasons because her young son suffers from a respiratory illness.\n\nMs Lloyd installed a \"really big\" solar system, a large battery, converted to a ducted heating system and installed an electric heat pump.\n\n\"All of that cost around $40,000, but we only ended up being out of pocket by around $32,000.\n\n\" I think we got around $8,000 from this program and that was the maximum we could get for our income bracket. \"\n\nAnother 440 households have signed up for the program.\n\nAustralian-American inventor Saul Griffith says wealthier households are waiving the subsidy. (ABC Illawarra: Brooke Chandler)\n\nA step towards rewiring the nation\n\nRewiring Australia founder Saul Griffith said the scheme was about starting small and then going big.\n\nMeet the 'genius' engineer with a plan to electrify everything Photo shows Man writes with texta on a clear sheet of glass Inventor Saul Griffith is sparking an energy revolution in Australia with a goal to create the first all-electric community.\n\n\"So we know that 11 million Australian households have to get to zero emissions by probably 2040,\" he said.\n\n\"We thought we would really try to accelerate what that looks like in one community — that was the origins of 2515.\n\n\"We've had a great community response … 500 homes out of 4,000.\n\n\"That's about 15 per cent have signed up to participate.\"\n\nThe scheme has built-in equity measures — the more you earn, the lower the subsidy.\n\n\"A really kind of fabulous thing we found out about our community is a lot of the higher net-worth families are doing it for climate reasons,\" Dr Griffith said.\n\n\" They are actually donating back their subsidies so it can be amplified or reused by low income homes. \"\n\nJames Hazelton says Endeavour Energy supports the initiative. (ABC Illawarra: Brooke Chandler)\n\nNo charge increase, utility says\n\nThe Australian Renewable Energy Agency (ARENA) has funded the program to the tune of $5.4 million so far.\n\nEndeavour Energy manages the network and its future-energy strategy manager James Hazelton said he was confident the grid could handle the added load and that customers would not face higher energy costs.\n\nLoading...\n\n\"But we also want to make it clear that through the journey to electrification, while customers are going to save money by having less fuel use and gas use, they are not going to face higher network charges,\" he said.\n\n\" We are very comfortable that it won't make the lights go out or anything like that for this trial. \"\n\nThe network operator will closely monitor the program to determine whether improvements are required for converted households.\n\n\"We're using this as a case study to understand what's the right balance of visibility and network upgrades that might need to take place,\" Dr Hazelton said.\n\nWider electrification goals\n\nThe Illawarra region, which includes the city of Wollongong and Port Kembla has become a hub for renewable development.\n\nIt remains to be seen whether a proposed offshore wind farm eventuates 20 kilometres off the coast, but in May the NSW government announced that the region had become the state's first \"urban renewable energy zone\".\n\nEnergy Minister Penny Sharpe said that meant preparations were underway for more green manufacturing opportunities, research, renewable energy storage facilities and trial of new grid technologies to improve solar uptake.\n\nThe proposed offshore wind area would stretch from to Kiama, south of Wollongong, to the Stanwell Park area (pictured). (ABC Illawarra: Justin Huntsdale)\n\nIn January, federal Climate Change Minister Chris Bowen encouraged community energy projects similar to Electrify 2515 to apply for funding.\n\nARENA has confirmed it is also funding about half of a $13.8m home electrification pilot for 500 homes in South Australia.\n\n\"The primary project objective is to demonstrate the customer and sector benefits of demand flexibility and smart homes to help accelerate their deployment at scale,\" an ARENA spokesperson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-20/gascoyne-junction-pub-reopens-doors-outback-wa/105395932",
        "title": "Outback community overjoyed as pub reopens after six-month dry spell",
        "publish_date": "Fri, 20 Jun 2025 00:10:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "For residents of a small town in Western Australia's remote Gascoyne, a cold pint of beer has — until now — required a near-350-kilometre round trip.\n\nAfter a six-month dry spell, locals in Gascoyne Junction, 1,000 kilometres north of Perth, were overjoyed to see the doors of the local pub reopen on Monday this week.\n\nResident Jarrod Walker said it had been a long wait for locals and visitors.\n\n\"Everyone's pretty excited to get there and have a beer tonight,\" he said.\n\nJarrod Walker has lived in Gascoyne Junction for over a decade. (ABC Pilbara: Lina Elsaadi)\n\n\"It's the social hub, it's the fabric of the community.\n\n\"It just really lifts the whole community and gives everyone another reason to come to [this] beautiful part of the world.\"\n\nRoad to reopening\n\nThe pub closed its doors in December, when the previous owners decided to retire.\n\nThe six-month hiatus left people facing the 174km drive to Carnarvon if they wanted a beer or a pub meal.\n\nFor the past six months, Gascoyne Junction residents faced a three-hour return trip for a beer. (ABC Pilbara: Lina Elsaadi)\n\nThe Shire of Upper Gascoyne took the opportunity to complete renovations, as well as mulling and abandoning the idea to re-open the pub under a cooperative model.\n\nDespite the delay, Mr Walker said he always remained optimistic.\n\n\"We always knew that we'd get [the pub] up and running again, but we didn't think it would take this long,\" he said.\n\n\" The people around here, they're pretty resilient. \"\n\nResidents and tourists have a drink at the Junction bar on opening day. (ABC Pilbara: Lina Elsaadi)\n\nSocial connection point\n\nAs in many regional towns, the Junction Pub serves as more than just a place to have a drink.\n\nUpper Gascoyne Shire tourism and development officer Ainsley Hardie said the pub played a crucial part in keeping the town connected.\n\n\"It's our roadhouse, coffee shop, supermarket, takeaway, it's our restaurant, accommodation, pub … it's the place where we come to be social,\" she said.\n\n\"It might be the first time you've had a conversation in a week for some of our pastoralists with another person.\"\n\nThe roadhouse is also a shop for groceries and essentials, with the nearest supermarket more than 150km away. (ABC Pilbara: Lina Elsaadi)\n\nMs Hardie noted while the pub's doors were closed, the lack of accommodation had also affected tourist numbers in the community.\n\n\"We are definitely seeing a drop in visitor numbers,\" she said.\n\n\"But we're spreading the word that we're open again and we've still got an amazing area to come and visit.\"\n\nTiny town 'one big family'\n\nThe town is home to 65 people, with a further 105 scattered across the Shire as a whole.\n\nBut it is familiar territory for the pub's new lessees, Daniel Bond and Evangelitsa Cartwright.\n\nDan and Litza are the owners and chefs of the Junction pub. (Supplied: Charlotte and James Maddock)\n\n\"My dad's side of the family owned Edmund Station, and mum's side of the family were on Jimba Jimba,\" Mr Bond said.\n\n\"The pub actually resides on Vivash Way, which is my mum's maiden name.\n\n\"We have the old shearers table out the back, which was donated from Edmund station years ago to the Shire to be put in the pub by our family.\n\n\"It's sort of full circle now that we've come back to town.\"\n\nLitza and Dan met while working in restaurant kitchens together in Toronto, Canada. (ABC Pilbara: Lina Elsaadi)\n\nMr Bond had worked on cattle stations around the town, before breaking his leg and training as a chef.\n\nHe moved to Canada where he met Litza, his partner, before moving back to Australia and taking over the pub together.\n\n\"In these towns, sometimes they don't get people coming back once they leave,\" he said.\n\n\"It's good to come back with experience and a willingness to get it done for the community. That makes me smile at the end of the day.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-20/traditional-owners-urge-government-consults-north-west-shelf/105432418",
        "title": "Traditional owners feel 'sidelined' on North West Shelf conditions",
        "publish_date": "Thu, 19 Jun 2025 23:24:18 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A group of Murujuga traditional custodians is calling on the federal government to immediately release the conditions attached to its 40-year extension of Woodside's North West Shelf gas project.\n\nFederal Environment Minister Murray Watt waved through the approval three weeks ago, allowing Australia's largest oil and gas facility to continue operating in Western Australia's Pilbara region until 2070.\n\nNgarluma woman Samantha Walker penned a letter to the government on Tuesday last week, gathering signatures from multiple traditional owners and elders with connections to the landscape.\n\n\"Our people have not consented to the proposal,\" she wrote.\n\n\" This is not only a matter of process — it is a matter of justice. \"\n\nWoodside is facing mounting pressure to reply to the Commonwealth's provisional 40-year extension of its largest asset. (Supplied: Woodside)\n\nMr Watt gave Woodside 10 days to respond to the approval's \"strict\" conditions, which he indicated focused on the protection of ancient Aboriginal rock art.\n\nLast Friday, the gas giant breezed past that deadline and neither Woodside nor Mr Watt could confirm the date negotiations would be finalised when asked by the ABC.\n\nMs Walker said she was \"alarmed\" that the right of reply was afforded solely to Woodside.\n\n\"We understand there are statutory requirements, however, the approvals process has sidelined Murujuga Ngurrara-ngarli [Murujuga traditional owners],\" she wrote.\n\n\"They have a process with Woodside and the government, but they don't take into account our cultural processes, which we have as well, which is very saddening.\"\n\nWatt yet to visit Pilbara\n\nMs Walker repeated calls for Mr Watt to visit Murujuga — the Aboriginal name for the Burrup Peninsula — where Woodside's main processing plant is located, about 1,500 kilometres north of Perth.\n\nThe area is home to some of the world's oldest known rock art, the preservation of which became a flashpoint amid the extension decision.\n\nThe Murujuga Aboriginal Corporation (MAC) administers cultural matters involving the peninsula on behalf of five language groups: the Ngarluma, Mardudhunera, Yaburara, Yindjibarndi, and Wong-Goo-Tt-Oo peoples.\n\nThe corporation was formed in 2006 and granted joint management of Murujuga National Park in exchange for extinguishing native title rights to land earmarked for industrial development.\n\nThe chair of MAC, Peter Hicks, flew to Canberra this week to meet with Mr Watt.\n\nMurujuga Aboriginal Corporation says it is satisfied the North West Shelf project is not damaging ancient Aboriginal rock art. (ABC Pilbara: Alistair Bates)\n\nMr Hicks said he was confident findings of a two-year rock art monitoring program, carried out by MAC and the WA government, showed the North West Shelf project was not currently harming the ancient petroglyphs.\n\nThe rock art is central to the organisation's bid to have Murujuga listed by the United Nations as a World Heritage site.\n\nThis goal was thrown into doubt by a UNESCO draft decision calling for the area's industrialisation to be halted, triggering protests from the federal government.\n\nWhile Ms Walker backed the embattled World Heritage push, she said more consultation on the North West Shelf project and its impact was needed.\n\n\"Broader consultation means speaking with the whole community, all of the families, the connections who have a connection to the place,\" Ms Walker explained.\n\n\"The minister needs to speak to us, according to our cultural protocols,\" she said.\n\n\" We need a seat at the table when these decisions are being made. \"\n\nA law professor says Mr Watt could make the conditions public, given the wide-ranging concern over his decision. (ABC News: Keane Bourke)\n\nShe argued that the violation of traditional owners' informed consent was grounds for a human rights complaint, and current economic arrangements between Woodside and traditional owners had become obsolete.\n\n\"It is severely remiss of the Commonwealth to consider approving a major project while relying on an outdated agreement that is in urgent need of modernisation,\" Ms Walker said.\n\nMr Watt did not respond to specific questions put to him by the ABC.\n\nPublishing conditions 'justified'\n\nSamantha Hepburn, a professor at Deakin Law School, said it was not typical for proponents to miss response deadlines, although this case was \"unique\" given its magnitude and the extent of public interest.\n\nDr Hepburn believed Mr Watt possessed the legal discretion to make the conditions public and would be \"justified\" in doing so because the approval was so controversial.\n\n\"We see a broad range of the community very, very concerned about the impact that this extension is likely to have and wanting to make sure that the conditions are capable of addressing those concerns,\" she said.\n\n\" Transparency [means] we can feel secure as a community that the rule of law is doing its job effectively and with integrity. \"\n\nThe decision to extend the major gas project is currently facing court challenges on several fronts.\n\nMs Walker says failures to consult violated traditional owners' right to informed consent. (ABC Pilbara: Charlie Mclean)\n\nDr Hepburn said publicising the conditions would be a show of good faith ahead of federal environmental law reform, the subject of high-level talks hosted by Mr Watt on Thursday.\n\n\"Showing a preparedness to be responsive to the concerns, I think, is a very, very important thing that the government has the opportunity to [do],\" she said.\n\nMs Walker said she had only received a response from WA Senator Dorinda Cox, who could not be reached for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-20/sport-marnus-labuschagne-dropped-steve-smith-injured/105440480",
        "title": "Labuschagne dropped for West Indies Test, as injured veteran misses out",
        "publish_date": "Thu, 19 Jun 2025 23:10:19 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's selectors have made their biggest call in recent memory, dropping Marnus Labuschagne from the top order and replacing him with Sam Konstas.\n\nChief selector George Bailey confirmed on Friday that Labuschagne would miss next week's first Test against the West Indies.\n\nSteve Smith will also miss the match as he recovers from a finger dislocation, with medical staff to assess him ahead of the second Test.\n\nJosh Inglis will come into the XI, while it's expected Konstas will open.\n\nAustralia will unveil the batting order and bowling attack closer to the start of the first Test next Wednesday.\n\nBut it is the decision to drop Labuschagne that will be the biggest talking point since Bailey took over as chief selector in 2021.\n\nSteve Smith suffered a nasty finger injury in the World Test Championship final at Lord's. (AP: Kirsty Wigglesworth)\n\nLabuschagne was the top-ranked Test batter in the world as recently as two years ago, but has averaged just 27.82 for the past 12 months.\n\nHe was moved from his regular spot at number three to open in the World Test Championship final loss to South Africa last week, for returns of 17 and 22.\n\n\"Marnus at his best can be a really important member of this team. He understands his output hasn't been at the level we, or he, expects,\" Bailey said in a statement.\n\n\"We will continue working with him on the areas of his game we feel he needs to rediscover.\n\n\"We continue to value his skill and expect him to work through the challenge positively.\"\n\nKonstas's recall comes after he was left out of the team for Sri Lanka, following the teenager's high-profile start to Test life with a half-century on debut on Boxing Day against India.\n\nSam Konstas is likely to open in the West Indies. (Getty Images: Russell Freeman)\n\nSelectors opted to go with Travis Head at the top of the order in Galle, given their preference to have him open on spinning wickets.\n\nBut that move was only ever temporary, leaving the opening spot free for Labuschagne at Lord's last week and now seemingly Konstas in the West Indies.\n\nInglis also impressed with a century on debut in Galle in January, before being squeezed out of the side for the Test Championship final.\n\n\"Steve needs more time for the wound to heal so we'll give him another week's rest and assess his functionality after that,\" Bailey said.\n\n\"We have made the decision to give Josh and Sam the opportunity to replace Steve and Marnus.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"We are excited to see them get the chance to further their fledgling Test careers.\n\n\"In his only opportunity in Test cricket to date, Josh was outstanding in Sri Lanka, showing great intent and ability to put pressure on the opposition.\"\n\nThe decision to drop the 30-year-old Labuschagne comes after former coach Justin Langer urged officials to keep him in the side this week, with his experience valuable.\n\nUsman Khawaja is aged 38 and Smith 36, meaning a transition in the top order looms after David Warner's retirement from Test cricket last year.\n\n\"He's actually a very, very important link in this chain,\" Langer said on Monday.\n\n\"You think about the history of Australian cricket. The best young players come in surrounded by absolute guns.\n\n\"Michael Clarke, Ricky Ponting, Damien Martyn and Matthew Hayden. They come in and they're around gun players.\n\n\"If you just all of a sudden bring a couple of kids in, Cameron Green's still young to the game, and you have to bring another kid in there [to replace Labuschagne].\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-20/tyres-illegally-dumped-isla-gorge-national-park/105437990",
        "title": "Anger, costly clean-up after 200 tyres dumped in national park gorge",
        "publish_date": "Thu, 19 Jun 2025 22:08:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Authorities have spent more than $100,000 and delayed bushfire safety work to remove hundreds of illegally dumped tyres from one of Queensland's most pristine national parks.\n\nThe tyres were found in a deep ravine in Isla Gorge National Park, south-west of Rockhampton, during a bushfire in October.\n\nThe Department of Environment and Banana Shire Council launched a joint investigation and finished removing 200 tyres this week.\n\nThe ABC understands a 130-tonne crane used for the clean-up cost more than $100,000 to hire.\n\nA 130-tonne crane was hired for the costly clean-up. (Supplied: Department of Environment)\n\nAuthorities believe a business or individual has been dumping tyres in the same location, off the Leichhardt Highway, for months.\n\nThe national park is a maze of gorges and sandstone outcrops popular with bushwalkers and campers.\n\nAppeal for information\n\nSenior Ranger, Chris Job said the tyres posed a significant fire risk and had polluted a highly sensitive environment.\n\n\"They all look very similar in degradation, so I would say they [were dumped] within the last year,\" Mr Job said.\n\n\"We believe someone in the region knows who is responsible ... and we are asking anyone with information to call us.\"\n\nThe illegal dumping has delayed the department's bushfire hazard reduction plans.\n\nTwo hundred tyres will be sent to a recycler for processing. (Supplied: Department of Environment )\n\n\"Isla Gorge had a large planned burn for this season for hazard reduction … with those tyres in the deep ravine it was unwise to burn,\" Mr Job said.\n\n\"It's quite a large fire risk — 200 tyres going up in one single location would put a lot of toxic smoke up and is, obviously, horrible for the environment.\"\n\nThe tyres will be sent to a recycler for processing.\n\nBanana Shire Council Mayor Nev Ferrier said the dumping was unacceptable.\n\n\"It's just disgraceful,\" he said.\n\n\"Whoever did this clearly has no regard for the land, our national parks, or the people who care for them.\n\n\"The Isla Gorge is one of the most beautiful parts of our region and to see it treated like this is heartbreaking.\"\n\nPeople can report illegal dumping to the Department of Environment or their local council.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-20/spacex-starship-rocket-explodes-into-dramatic-fireball/105440090",
        "title": "SpaceX says 'major anomaly' caused dramatic Starship rocket explosion",
        "publish_date": "Thu, 19 Jun 2025 21:45:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "SpaceX's massive Starship spacecraft has exploded in a dramatic fireball during testing in Texas.\n\nIt is the latest in a series of setbacks for billionaire Elon Musk's Mars rocket program.\n\nThe explosion occurred about 11pm local time while Starship was on a test stand at its Brownsville, Texas Starbase.\n\nThe spacecraft was preparing for its 10th test flight, SpaceX said in a post on Mr Musk's social media platform X.\n\nThe company attributed it to a \"major anomaly\", and said all personnel were safe.\n\nMr Musk said preliminary data suggested a nitrogen gas storage unit, known as a \"composite overwrapped pressure vessel\", had \"failed below its proof pressure\".\n\nFlames rise as a SpaceX rocket explodes in Brownsville, Texas. (TheRocketFuture via X/via Reuters)\n\n\"If further investigation confirms that this is what happened, it is the first time ever for this design,\" he said in a post on X.\n\nSpaceX did not immediately respond to a request for further comment from Reuters.\n\nThe Starship rocket appeared to experience at least two explosions in quick succession, lighting up the night sky and sending debris flying.\n\nRocket system faces string of failures\n\nThe 122-metre rocket system is at the core of Mr Musk's goal to send humans to Mars, but it has been beset by a string of failures this year.\n\nSpaceX Starship launched on ninth test flight Photo shows smoke and flames emerge from a spacex launch in texas The two-stage spacecraft blasted off at about 7:36pm local time on Tuesday in Texas.\n\nIn late May, SpaceX's Starship rocket spun out of control about halfway through a flight without achieving some of its most important testing goals.\n\nThe Starship lifted off from SpaceX's Starbase launch site, flying beyond the point of two previous explosive attempts this year that sent debris streaking over Caribbean islands and forced dozens of airliners to divert course.\n\nTwo months earlier, the spacecraft exploded in space minutes after lifting off from Texas, prompting the US Federal Aviation Administration (FAA) to halt air traffic in parts of Florida.\n\nLoading...\n\nVideos on social media showed fiery debris streaking through the dusk skies near south Florida and the Bahamas after Starship broke up in space shortly after it began to spin uncontrollably with its engines cut off, a SpaceX live stream of the mission showed.\n\nMr Musk said the explosion was \"a minor setback\".\n\nThe FAA said this month it had closed an agency-required investigation into the mishap, citing a hardware failure in one of the engines as the probable cause.\n\nDebris streaks through the sky in Hog Cay, Bahamas. (Reuters: )\n\nSpaceX identified eight corrective actions to prevent a recurrence and the FAA said it verified SpaceX implemented those prior to the late May Starship mission.\n\nIn January, a Starship rocket broke up in space minutes after launching from Texas, raining debris over Caribbean islands and causing minor damage to a car in the Turks and Caicos Islands.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-20/lionel-messi-scores-winner-inter-miami-beat-porto-fifa-cwc/105440192",
        "title": "Magic Messi free kick steers Inter Miami to victory",
        "publish_date": "Thu, 19 Jun 2025 21:30:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "Lionel Messi has scored the winner as Inter Miami claimed its first-ever victory in FIFA's bloated and controversial Club World Cup.\n\nMessi was taken down just outside the penalty area by Rodrigo Mora after he scythed his way down the middle of the field on Friday (AEDT).\n\nWith chants of \"Messi! Messi!\" rocking Mercedes-Benz Stadium in Atlanta, the 37-year-old Argentine star's left-footed blast cleared the wall and sailed into the top right corner.\n\nInter Miami had earlier equalised thanks to Telasco Segovia's goal two minutes into the second half.\n\nPorto had struck first thanks to a contentious Samu Aghehowa penalty in just the eighth minute.\n\nBoth teams came into the contest after 0-0 draws, Miami held by Cairo-based Al Ahly on Saturday and Porto suffered the same result against Palmeiras on Sunday.\n\nMessi's goal continued his good form in the calendar year.\n\nThough the team has had a slow start, he has 10 goals and seven assists in 12 starts.\n\nIt felt like a home game for Miami, with an overwhelmingly pink crowd in Atlanta.\n\nWith Messi's 38th birthday less than a week away, his continued success is a positive sign for fans, including the thousands wearing his number 10 jerseys inside the stadium, that his retirement is not imminent.\n\nABC/wires\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-20/sydney-property-prices-on-the-rise-prospective-buyers-react/105437154",
        "title": "Prospective buyers left 'angry' in efforts to enter Sydney housing market",
        "publish_date": "Thu, 19 Jun 2025 21:27:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sydney's rising house prices have long been a thorn in the side of prospective buyers, given that the most expensive city in the country has experienced sustained growth over the past 25 years.\n\nA new Domain report suggests that trend is set to continue, with the median house price in Sydney forecast to rise by 7 per cent in the 2025-26 financial year.\n\nThe record-high $1.83 million median price tag is inhibitive to most, considering national median earnings are $67,600, as per Australian Bureau of Statistics data.\n\nBroderick Wright, a Western Sydney real estate agent who shows homes in Oatlands and Parramatta, said lower interest rates, strong demand, and a limited supply of homes were fuelling price rises.\n\nBroderick Wright, a real estate agent in Western Sydney, says he has noticed a change in buyer behaviour. (ABC News: Nabil Al-Nashar)\n\n\"We're finding now that buyers are having to become savvy in what they buy in terms of compromise,\" he said.\n\n\"They're happy to make a compromise and just try and get in, whether that means they move suburbs or move further afield in terms of away from the CBD.\"\n\nThe ABC went to three open homes in Sydney's west to see how people trying to enter the property market are really feeling.\n\n'I feel really angry'\n\nKathryn McCorkindale feels terrified about the state of housing in Sydney. (ABC News: Nabil Al-Nashar)\n\nKathryn McCorkindale is a young mother of two who is trying to find more room for her growing family.\n\n\"I have an apartment nearby, two bedrooms and two small kids, and at some point we'll need to upsize, but it's tricky,\" she said while looking at a property in Parramatta.\n\n\"It's frankly terrifying, and I feel really angry about the state of housing in Sydney.\"\n\nMs McCorkindale, who is an architect, believes the solution lies in planning and density.\n\n\"I think that we're not building enough townhouses, and family-friendly high-to-medium-density homes where they're required … the missing middle type,\" she said.\n\n\"I think successive governments have given lip service to show that … they want to appear like they're doing something, but they're not actually doing anything.\n\n\"People are going into a lot of debt trying to make the dream happen; you wonder if staying put is the better option.\"\n\n'You don't have bank of mum and dad to assist you'\n\nKim Lam is a prospective first-home buyer. (ABC News: Nabil Al-Nashar)\n\nKim Lam is in her early 30s and has been looking for a home for more than six months.\n\n\"It's difficult — anyone who's a first-home buyer with interest rates coming down, it's great, but then you know there'll be a surge in housing prices,\" she told ABC while viewing a Parramatta apartment.\n\nMs Lam believes the government incentives to help first-home buyers are good but not effective for buyers like herself.\n\n\"I tend to fall just outside the people who benefit from any of these incentives. Every year it just gets more difficult.\n\n\"It must be working, otherwise there would be an uproar of some sort,\" she said.\n\n\"People sitting in my kind of bracket, it's still kind of difficult to go at it by myself, and you don't have bank of mum and dad to assist you.\"\n\nConcerns high-density is 'the stacking up of humanity'\n\nWarwick Smith feels worried for future generations trying to enter the property market. (ABC News: Nabil Al-Nashar)\n\nDespite renting and living in Leichhardt, Warwick Smith fought rush hour traffic to check out homes in Parramatta.\n\nHe's looking for a two-or three-bedroom place with two bathrooms but does not believe he will find anything under $2 million.\n\nMr Smith has found himself disappointed with the market pushing more people towards higher-density housing.\n\nPointing at Parramatta's nearby CBD, he said: \"My concept of a home has a little to [do] with this Hong Kong style of this place.\n\n\"It is the stacking up of humanity, which I don't think bears much scrutiny unless you enjoy that sort of lifestyle, and I'm afraid I don't.\"\n\nHe is inspecting a heritage-listed home, which means there will be limits on what he can change about the property if he buys it.\n\nWhile he has owned many properties over the years — and therefore is not severely impacted by the increasingly difficult market — he does fear for the future generations.\n\n\" It does affect things like children and grandchildren enormously. \"\n\nHe said he would not mind if house prices came down.\n\n\"I'd be perfectly happy about that, because it won't all come down together.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-20/underground-music-culture-poster-donation-libraries-tasmania/105371348",
        "title": "Donation captures decades of Tassie's underground music culture",
        "publish_date": "Thu, 19 Jun 2025 21:24:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Music posters and handbills spanning 30 years of live performance in Hobart have been donated to Libraries Tasmania.\n\nThey offer a rare glimpse into underground music culture in Tasmania from the 1990s onwards, focusing on when bands largely relied on street advertising rather than the internet to promote shows.\n\nActing heritage librarian Alex Tassell said memorabilia, such as music posters, band T-shirts and DIY music releases, was \"really valuable\" because it was ephemeral and often not kept for preservation purposes.\n\nMusician and library worker Julian Teakle donated the posters.\n\nHe said they held huge sentimental value, but public access to documentation of Hobart's underground music scene was important.\n\nJulian Teakle holds one of the posters he donated to Libraries Tasmania. (ABC Hobart: Lucie Cutting)\n\nCollection amassed over decades\n\nMr Teakle can recall looking for expired local music advertisements when doing poster runs, starting in the 1990s, for his own bands and gigs he had organised.\n\nAs he put posters up, he would take down expired local music posters for keeping.\n\nA poster advertising a performance at the Goulburn Arms in Hobart. (Supplied: Libraries Tasmania)\n\n\"I hadn't thought of any purpose why I collected them, at the time they were mementos,\" Mr Teakle said.\n\n\"I put a lot of hard work into this gig.\"\n\nHe accumulated more than 150 items, some gathered on the streets of Hobart and others given to him by friends.\n\nMr Teakle shared the advertisements on social media, on his page Goulburn Street Archive, but after decades of collecting, he questioned what to do with the physical posters and handbills.\n\nThe items are now rare because they were not made to last.\n\n\"I didn't want it to stay in my garage and get gradually damaged … I didn't want the silverfish to get them,\" Mr Teakle said.\n\nTo ensure free access for current and future generations, he donated the collection to Libraries Tasmania.\n\nHe said preservation of the posters was important to understanding street culture and life in Hobart.\n\nHis donation to the library is now called the Teakle Poster Collection.\n\n\"History isn't all about the big things, it's about what people were doing on a day-to-day basis.\" Mr Teakle said\n\n\"All that is represented by some of these gigs is the poster, there's no other documentation.\n\n\" [Donating the posters] is like trying to prevent cultural amnesia. \"\n\nA drawer of posters from the Teakle Poster Collection. (ABC Hobart: Lucie Cutting)\n\nDIY posters document more than music\n\nIt is more than music documented on the posters and handbills Mr Teakle collected.\n\nMany of the venues where performances took place have ceased to exist.\n\nVenues such as Round Midnight, the Doghouse, which later became the Goulburn Hotel, and the Brisbane Hotel appear in the collection.\n\nA poster illustrated by Rodney Febey. (Supplied: Libraries Tasmania)\n\nMr Tassel, who played in bands in Hobart, can remember sticky floors, stale beer and local characters in venues.\n\nHe said people could respond quite emotionally to seeing library collection items that evoked memories.\n\n\"I know so many people who were around this sort of music, who are really excited to see this sort of stuff,\" Mr Tassel said.\n\n\" This is their childhood, their young adulthood … it's what many people have experienced. \"\n\nThe collection also preserves the work of local artists.\n\nIllustrations by internationally successful Tasmanian cartoonist Simon Hanselmann are on several posters.\n\nIn 2022, his cartoon series Megg, Mogg and Owl had its animated debut on streaming service Hulu, featuring the voice of actor Macauley Culkin.\n\nHanselmann's early designs are reminiscent of his current style.\n\nA poster illustration by cartoonist Simon Hanselmann. (Supplied: Libraries Tasmania)\n\nNot all posters and handbills in the collection feature the work of known artists; many are made with creative use of a photocopier and marker pens.\n\n\"There's great variety,\" Mr Tassell said.\n\n\"It's really the DIY thing of people [making] their own posters.\"\n\nEphemera wanted for state collection\n\nThe musicians and artists who created the posters and handbills now held by Libraries Tasmania likely never imagined they would be enclosed in archival-grade sleeves and made available for public access decades later.\n\nPoster advertising Little Ugly Girls (LUGS) and 50 Million Clowns. (Supplied: Libraries Tasmania)\n\nThe memorabilia is part of a growing collection of cultural ephemera kept by the library.\n\nBand T-shirts, restaurant menus and stage show posters can also be found.\n\nMr Tassell was particularly interested in donations that documented Tasmania's underground music scene.\n\n\"I'm always happy to look and chat about things people may have and if there's a place for it in our collection,\" Mr Tassell said.\n\n\" I don't think you've heard the last of this, I think there'll be exciting things happening with this type of content. \"\n\nAlex Tassell hopes more Tasmanians will donate cultural ephemera to the library. (ABC Hobart: Lucie Cutting)\n\nMr Teakle continues to find posters and handbills stashed away at home that he is donating to Libraries Tasmania.\n\n\"There's a huge sentimental value, I look at these posters and they're pivotal moments of my life,\" Mr Teakle said.\n\n\"But I know that as this is a public collection, I can access them at any time.\"\n\nJulian Teakle looks through the collection of posters and handbills he donated. (ABC Hobart: Lucie Cutting)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-20/wa-budget-analysis-keane-bourke-fortress-around-state/105436636",
        "title": "The WA budget has a clear theme, and it's not cost-of-living relief",
        "publish_date": "Thu, 19 Jun 2025 21:16:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "For everything governments say about their priorities, budget papers reveal where their real intentions lie.\n\nWA Premier Roger Cook's first budget since being elected in his own right has a clear theme, and for the first time in a few years, it's not cost-of-living relief.\n\nThose immediate pressures, at least according to the budget papers, are largely in the rear-view mirror.\n\nDon't worry, the state's coffers are still overflowing with iron ore royalties, which have remained higher than expected, and huge GST payments from the Commonwealth.\n\nCook and Treasurer Rita Saffioti's first post-election budget pays for the basics, then looks to use the rest to start re-shaping the state's economy.\n\nIf it goes to plan, that will mean being less reliant on importing many products by manufacturing more locally, and diversifying what the state exports to the world.\n\n\"If we don't explore these opportunities to value-add, to have more local manufacturing, then we will be filled with a lot of regret in 10 years' time,\" Saffioti told reporters yesterday.\n\nRita Saffioti's focus is on protecting WA from economic headwinds now approaching. (ABC News: Andrew O'Connor)\n\nAs you'd expect, industry is already singing the government's praises.\n\n\"Just like Taylor Swift, the government's entered a new era,\" Chamber of Commerce and Industry chief economist Aaron Morey said.\n\n\"It's moving from the roads era to the industrial era [with] significant funding in ports, water, energy — so critical to the future of the WA economy.\"\n\nIt's a bold ambition, and one many have spent years calling for.\n\nIt's also well-timed, according to the government, to see the state through the global shocks ahead.\n\nWA scores seventh consecutive budget surplus, as net debt climbs Photo shows Roger Cook and Rita Saffioti look down at budget papers This year's budget cements the state as the nation's economic engine room as West Australians face higher power bills amid growing pressures on the bottom lines.\n\nBut, like everything in life, it comes at a cost.\n\nRoyalty flush\n\nTo be clear, the cost isn't as great as it might have been in other places, thanks to two of the WA budget's familiar friends: GST payments and iron ore royalties.\n\nRoyalties have benefited from an iron ore price that has remained higher for longer than expected, although it is expected to fall over the years ahead.\n\nThat would probably still leave the books in decent shape, but luckily for Saffioti, WA's GST take will also be rising.\n\nTogether, those sources will continue to account for about a third of the state's revenue.\n\nOther states are continuing to battle deficits, and no doubt another year of seeing WA's surpluses towering over them from across the Nullarbor will be met with the usual complaints.\n\nPrime Minister Anthony Albanese's Labor Party enjoyed another strong showing in WA during the recent federal election. (ABC News: Courtney Withers )\n\nBut given Western Australia again rewarded Anthony Albanese for his deference to the state, it's unlikely he will be racing to change those arrangements, despite the significant cost to the Commonwealth budget.\n\nIt gives the government financial power that many others could only dream of.\n\nA 'fortress' around WA\n\nThat power is nothing new, of course, and especially since COVID has been focused on two areas: immediate cost-of-living relief and building the Metronet projects that helped Labor get elected in the first place.\n\nThis budget effectively places both in the past.\n\nOnly a portion of Metronet projects remain unfinished, and the government's headline cost-of-living measure — hundreds of dollars off households' electricity bills — has been scrapped.\n\nMost of the government's Metronet projects have been completed. (ABC News: Cason Ho)\n\nInstead, the bulk of the government's infrastructure spending — some 40 per cent, or $15.1 billion over the next four years — is being put towards power and water infrastructure and ports.\n\nSaffioti told parliament that infrastructure would enable private sector investment, which would help build a \"fortress\" around the state's economy, like the state did during the pandemic.\n\n\"While not a worldwide pandemic, the global instability and volatility we now face means we must once again stand together to repel any economic threat,\" she said.\n\n\" We protect our existing economic strengths but also venture to secure new jobs and new opportunities for Western Australia's future. \"\n\nBut some West Australians will be left wondering if such a heavy focus on the future is slightly premature.\n\n'Collateral damage'\n\nThe government argues economic pressures have eased, which is true, looking at key indicators.\n\nInflation has cooled, and there are signs the rental market is stabilising, even if prices remain higher than many can afford.\n\nSaffioti said that meant the risk of global turmoil had overtaken the cost of living as the most pressing issue for the government.\n\n\"We don't want WA to be collateral damage in global economic chaos,\" she told the ABC.\n\nBut people are still doing it tough, with ShelterWA still reporting \"overwhelming\" demand for housing support services.\n\nBasil Zempilas says the government missed its opportunity to help those doing it tough. (ABC News: Lauren Smith)\n\n\"The question really has to be asked: where is the cost-of-living pressure relief, [with] the cost of water up, the cost of electricity up, the cost of emergency services levy up?\" Opposition Leader Basil Zempilas said yesterday.\n\nThe government's solutions are targeted, which helps with not fuelling inflation again, but means some miss out.\n\nThe $337 million on offer for residential battery rebates and no-interest loans is great for those who own a home, and works into plans to develop a local battery manufacturing industry, but does nothing for renters or people without solar panels.\n\nAnother round of the up-to-$250 student assistance payment would be welcome relief for families, but it means nothing for anyone without school-aged children.\n\nAnd capping public transport fares at one zone will save $196, but it isn't much good for people not near public transport, or who need to drive for their work.\n\nTrouble ahead\n\nThe bigger, structural relief the government is promising will take some time to come.\n\nMore housing will be years away, given the long game of catch-up the construction sector is playing after a post-COVID population surge.\n\nThe five things you should know about the WA budget Photo shows WA Treasurer Rita Saffioti stands speaking in parliament. Roger Cook's government has handed down its second budget. Here's what you need to know.\n\nSecure skilled local jobs will also take time to materialise as the government's money to grow local industries filters through boardrooms and into construction and jobs.\n\nAnd pressures on the health system look set to continue, with those on the front line having little hope that promised changes will make that big a difference.\n\nIt won't be easy, even with time and money. Successive governments have tried to break WA's boom-and-bust cycle without any luck.\n\nAnd that global uncertainty Saffioti wants to protect the state against could arrive faster than her fortress.\n\nLuckily for the government, the next time voters will have a chance to pass judgement on their plans is in four years.\n\nBy then, they should have a sense of whether that fortress has been built or crumbled under the weight of reality.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/health/2025-06-20/osteostrong-bone-density-health-study-retraction-health-research/105225286",
        "title": "Study supporting 10-minute 'bone-strengthening' exercise called into question",
        "publish_date": "Thu, 19 Jun 2025 21:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A study claiming a popular exercise regimen called OsteoStrong can help strengthen bones in post-menopausal women has been criticised by scientists, with some saying it should never have been published.\n\nThe research, which was accepted for publication in the Journal of Clinical Endocrinology & Metabolism (JCEM) in February this year, was hailed as \"groundbreaking\" by the international franchise behind the exercise program.\n\n\"The acceptance of this research in a prestigious, peer-reviewed medical journal like JCEM is a monumental step in validating OsteoStrong as a science-backed solution for osteoporosis management,\" the company said in a press release at the time.\n\nBut the study has since attracted international criticism, with questions being raised about its design, data analysis and conclusions.\n\n\"We really questioned the [journal] editor on how this paper got through the peer-review process,\" said Robin Daly, a researcher in exercise and ageing at Deakin University.\n\n\" It had so many flaws and so many holes in it. \"\n\nClaims 'not supported by data'\n\nThe study examined the effectiveness of the OsteoStrong program, which was described as \"a bone-strengthening system implementing four devices and incorporating brief (10-minute), weekly, low-impact, and high-intensity osteogenic loading exercises\" in postmenopausal women with osteoporosis.\n\nThe researchers separated 147 women into two groups. One group did the program and the other did not. The group that did the exercise program was further divided into two groups, one of which was on bone-strengthening medication and one that was not.\n\nMeasures of bone strength were carried out at the start and end of the 12-month trial.\n\nThe study claimed bone density was improved in women who did OsteoStrong (compared to those who didn't), and that among participants who were also on medication, it enhanced the effect of the drugs.\n\n\"This is the first study that clearly demonstrates benefit\" from the OsteoStrong program, the researchers wrote.\n\nThis graph on the OsteoStrong Australia website suggests the program is more effective than drugs at increasing bone mineral density, which is contrary to mainstream understanding. (Supplied)\n\nBut among numerous concerns expressed by critics are that the clinical trial had no clear statistical plan, failed to reduce the risk of bias, had no ethical approval and was not registered online for transparency.\n\nAccording to Professor Daly, \"the claims [of the study] are totally misleading. They're not supported by the data\".\n\nHe said the way the study was designed and its results were analysed made it difficult to conclude anything.\n\n\"The whole paper is extremely difficult to interpret.\n\n\" There's no way that you can make a claim that it's an effective program. \"\n\nProfessor Daly and University of Waterloo bone researcher Lora Giangregorio sent a letter to the editor of the journal calling for the study's retraction.\n\nProfessor Giangregorio was concerned that publicity of the study's findings would lead people to make uninformed decisions about the OsteoStrong program.\n\n\"The way that they present the statistics actually doesn't make any sense,\" she said.\n\n\"The claims made in the study were not appropriate.\"\n\nOsteoStrong is an international franchise with hundreds of centres including in the US and Australia. (Getty Images: Smith Collection/Gado/Contributor )\n\nOther experts have also expressed concern about the failure of the study to adhere to normal standards and guidelines for clinical trials.\n\nThey were concerned the clinical trial was not registered, a practice that helps make research more transparent, and prevent publication bias.\n\nIt also lacked appropriate ethics approval and there were \"potential unacknowledged conflicts of interest\", Professor Daly added.\n\nIn March this year, Osteoporosis Canada expressed concern about the study and the evidence base for the OsteoStrong program.\n\nIn a statement, also co-authored by Professor Giangregorio, the organisation said:\n\n… Osteoporosis Canada cannot support recommendations regarding its use for fracture prevention based on existing research.\n\n'Does not provide believable evidence'\n\nChris Maher, director of the University of Sydney Institute for Musculoskeletal Health, agreed with the concerns raised about the study.\n\n\"That study is flawed and does not provide believable evidence on the effect of OsteoStrong,\" Professor Maher said.\n\nHe pointed specifically to the lack of registration and ethical clearance.\n\n\"It therefore does not conform to the Declaration of Helsinki, so it has no standing in medical science and should never have been published.\"\n\nMaria Fiatarone Singh, a University of Sydney geriatrician who researches the impacts of exercise, was also highly critical of the study.\n\n\"I think it is too flawed to draw any conclusions,\" she commented by email.\n\n\"It is shocking that the editors allowed this to be published in a peer-reviewed journal and it indeed should be retracted and re-analysed at the very least.\"\n\n'Plausible' mechanism\n\nShoshana Sztal-Mazer, an endocrinologist and expert in bone disease at Alfred Health in Melbourne, said the principle behind OsteoStrong was \"plausible\".\n\nThe company states its system relies on \"osteogenic loading\", which is where force on your bones stimulates them to grow stronger.\n\n\"Physiologically it makes sense,\" Dr Sztal-Mazer said.\n\nBut she agreed there were concerns about the study.\n\n\"It doesn't look like it was rigorously conducted.\n\n\" I think that study was not of a standard that we would normally expect to read in that journal. \"\n\nMost of our bones' internal structure is a little like honeycomb, making them rigid yet somewhat light. (Getty Images: Science Photo Library/STEVE GSCHMEISSNER)\n\nOne of the major sources of bias in the study, according to critics, was allowing patients to choose which group they were in, Professor Fiatarone Singh said.\n\n\"It is well known that people who choose exercise are healthier and at less risk of disease for numerous reasons than sedentary individuals or those who choose a non-exercise control condition when given a choice.\"\n\nWhy building strong bones needs to start early Photo shows Mature woman drinking water from a bottle while exercising. We talked to experts about healthy bones and how to keep them healthy for as long as possible.\n\nIn a statement provided to the ABC, the Endocrine Society, which publishes the Journal of Clinical Endocrinology & Metabolism, said: \"We recognise the shortcomings in the research's design and analyses as reported in the online accepted manuscript.\n\n\"Following a detailed editorial assessment, we confirmed the need for significant revisions.\"\n\nThe authors of the study are in the process of submitting a corrected version of the paper, the statement added.\n\nOsteoStrong was approached for comment, but did not respond specifically to concerns raised by Osteoporosis Canada and others.\n\nInstead, Perry Eckert, managing director of OsteoStrong Australia, pointed to recent unpublished research partly sponsored by the company.\n\nAccording to Mr Eckert, the study showed \"a significant improvement\" in bone mineral density and overall strength in 38 postmenopausal women with osteoporosis.\n\nCan exercise increase bone density?\n\nHealthy Bones Australia endorses exercise as an important part of reducing bone loss in older age.\n\nBut most trials on exercise programs to strengthen bones are small compared to those studying pharmaceuticals, so the evidence for exercise is not as strong as that for drugs.\n\nThe majority of experts the ABC spoke to were not convinced at this stage exercise could reverse bone mineral density loss that occurs in post-menopausal women, although it might slow down the rate of loss.\n\nWhat is bone mineral density, and how is it tested? Photo shows Woman in a pink dress in a DEXA machine scanning her bone density with a person in a white coat standing nearby. A bone density test can diagnose osteoporosis. So how does it work?\n\nBut despite there being better evidence behind the use of medications to increase bone density, Dr Sztal-Mazer prescribes exercise as well as medications to help stave off bone loss in this age group.\n\n\"Exercise is important as a part of holistic care for osteoporosis and generally for healthy bones.\"\n\nAs well any impact on bone density, the right kind of exercise — along with adequate vitamin D, calcium and other nutrients — plays a key role in preventing fractures, Dr Sztal-Mazer said.\n\nExercise can also improve strength and balance, which can also help prevent falls, the main cause of bone fragility fractures.\n\nBut, Dr Sztal-Mazer cautions, guidelines for exercise used by physiotherapists and exercise physiologists to manage osteoporosis suggests a much bigger time commitment is required than that proposed by OsteoStrong.\n\n\" So if somebody's going to propose a 10-minute-a-week quick fix, it really does need to be proven by rigorous studies. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-20/asx-markets-business-live-news-date-year/105440118",
        "title": "Live: ASX drops, oil prices rise as Israel continues strikes on Iran",
        "publish_date": "Thu, 19 Jun 2025 20:59:12 +0000",
        "category": "finance",
        "authors": [
            "Rhiana Whitson",
            "Emilia Terzon",
            "Daniel Ziffer"
        ],
        "text": "You might remember this story from earlier this year, where we delved into how TikTok has become a bartering chip in the ongoing trade war between the US and China.\n\nTikTok is owned by Chinese company Bytedance, and has grown to become one of the most lucrative and widely used social media platforms in the world.\n\nEven before US President Donald Trump was elected, laws and regulations were being lobbed against Bytedance by US regulators, alleging it was posing a geopolitical security threat in the US due to its Chinese owners.\n\nThe latest was that Trump was pushing for Bytedance to divest its US operations, possibly into a joint venture with US owners. Big tech players have been rumoured to be involved in discussions, including Oracle, Microsoft and Amazon.\n\nNow, Trump has extended the deadline for ByteDance to divest until September 17. This is despite a law that mandated a sale or shutdown without significant progress.\n\nTrump signed an executive order pushing back Thursday's deadline for 90 days, a step he had previously signalled.\n\nTrump has said he wants to keep the app, which helped him woo young voters in the 2024 presidential election, active in the U.S.\n\nHe has also expressed optimism that Chinese President Xi Jinping would approve a deal that preserves the app, though it is unclear how significantly the topic has featured in the two countries' ongoing talks to resolve a tariff dispute.\n\n\"We are grateful for President Trump's leadership and support in ensuring that TikTok continues to be available,\" TikTok said in a statement posted on its website.\n\nFor now, looks like Americans shall keep on Tokking.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/world/middle-east/israel-iran-conflict-live-updates-middle-east-war-news-20250619-p5m8um.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Israel-Iran conflict LIVE updates: Australia deploys ADF to Middle East to evacuate citizens after embassy in Tehran closes; Trump to decide on US involvement ‘within two weeks’",
        "publish_date": "Fri, 20 Jun 2025 12:06:03 +1000",
        "category": "finance",
        "authors": [
            "Lachlan Abbott",
            "Anthony Segaert",
            "Lynette Eyb"
        ],
        "text": "Over the past 24 hours, about 38 Australians were evacuated from Israel to Jordan via bus, Penny Wong said.\n\nShe added that another bus had led evacuations the day before, although not every Australian in Israel and Iran wanted to leave.\n\nForeign Minister Penny Wong during a press conference earlier this month. Credit: Alex Ellinghausen\n\n“I think with the Sabbath coming, it will make it more difficult over the next couple of days, but we hope to increase the number of people who are travelling out, if they wish to do so, by bus to Jordan,” she said.\n\nWong has also just added that the border crossing into Azerbaijan was “the most likely exit from Tehran”.\n\nThe foreign minister said 2000 Australians in Iran had registered for DFAT support. In Israel, that number was about1200.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/i-was-very-raw-skelton-s-12-year-journey-back-to-facing-the-lions-20250619-p5m8ux.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I was very raw’: Skelton’s 12-year journey back to facing the Lions",
        "publish_date": "Fri, 20 Jun 2025 11:58:00 +1000",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "Will Skelton’s senior status in the Wallabies squad is underlined not just by recently celebrating his 33rd birthday, but also by being one of just two players, alongside prop James Slipper, who have faced the British and Irish Lions before.\n\nAfter his season ended in France with La Rochelle, Skelton needed to look into his past to embrace the future. The giant second-rower watched the Waratahs’ 30-point defeat against a team featuring Johnny Sexton and Geoff Parling, now assistant coaches with the Lions and Wallabies, respectively.\n\nSkelton’s choice of post-season entertainment had a purpose; he wanted to remind himself of the intensity that a British and Irish series brings, on and off the field. Skelton has subsequently won three European Cups and captained his country in a World Cup, but the Lions still feel different.\n\n“I was very raw, I didn’t understand the magnitude of the tour, as I do now, with all the experience I’ve had. It’s a massive, massive occasion for rugby, and especially rugby in Australia,” Skelton said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/lions-reject-golden-point-for-wallabies-series-20250620-p5m8zs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lions reject golden point for Wallabies series",
        "publish_date": "Fri, 20 Jun 2025 11:50:17 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "The British and Irish Lions have rejected a proposal from Rugby Australia to use golden point in next month’s Test series against the Wallabies, leaving open the possibility of the teams sharing the spoils in a tied series.\n\nAs reported by this masthead, Rugby Australia boss Phil Waugh pitched the idea of golden point to their Lions at recent meetings, in an attempt to ensure the three-Test series would have a winner.\n\nIn 2017, the Lions and the All Blacks shared the series trophy 1-1 after a draw in the third Test, with no provisions to play any extra time.\n\nThat is set to be the case again in the 2025 series against the Lions, after the Lions board decided to not back RA proposal.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/brisbane-eating-out/brisbane-s-best-chook-sanger-here-s-a-textural-flavour-filled-contender-20250619-p5m8op.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane’s best chook sanger? Here’s a textural, flavour-filled contender",
        "publish_date": "Fri, 20 Jun 2025 11:47:56 +1000",
        "category": "finance",
        "authors": [
            "Matt Shea"
        ],
        "text": "Advertisement\n\nEating outSandwich Watch Brisbane’s best chook sanger? Here’s a textural, flavour-filled contender Freshly baked bread? Check. Brined chicken? Check. Umami packed dressing? Check. There’s just so much to love about this fabulous creation. Matt Shea June 20, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nTom Cooney will tell you Riser has and always will be a team effort. “The staff at Riser are such a big part of what we do,” Cooney says. Riser’s chicken caesar sandwich. Morgan Roberts “It’s not really a pyramid, top-down structure. Maybe it would be different if it was chef-owned. But we’re excited to have people bring their ideas in to work on. “It’s definitely the sum of all its parts.”\n\nAdvertisement\n\nThe philosophy neatly extends to the main reason (among, it must be said, a bunch of supplementary ones) to check out this Toowong bakery and cafe: its chicken caesar sandwich. Because this is one of the very best chook sangers in the city. Seriously. Related Article Is this sanger Brisbane’s best hangover cure? More about the sandwich in a second. But first, let’s talk about Riser Riser is the creation of Cooney, Kieran Ryan and Duncan McKay, who between them have run, worked, baked at or owned Cup Specialty Roasters, Coffee Supreme, Banneton, The Scratch and Netherworld, among others.\n\nAdvertisement\n\nThey opened Riser in late 2022 in the storied Queenslander-style shopfront formerly occupied by 85 Miskin Street, and before that Bruno Loubet’s iconic Bruno’s Tables. Riser is tucked away on a back street in bucolic Toowong. Morgan Roberts From the outside, it looks much the same as its suburban restaurant days, but inside it’s transformed, the old ground-floor dining room occupied by an expanded open kitchen and concrete counter and display box. On weekends, it’s the scene of orderly chaos as customers queue around the timber floor and out the door under a shaded patio. What are they queueing for?\n\nAdvertisement\n\nRelatively quiet during the week, Riser regularly has queues out the door on Saturdays and Sundays. Morgan Roberts Precisely baked danishes, croissants, scrolls and sausage rolls, sure, but also a fabulous chicken caesar sandwich stacked with flavour. Riser’s chicken caesar sandwich As mentioned, the chicken caesar sanger at Riser is a team effort that’s been iterated on at least twice since it was first created (with input from Cooney, Ryan and McKay) by the venue’s original chef, Amos Ilett. Arguably, though, the killer move was the addition of croutons, which was Cooney’s idea. Along with the flecks of bacon, it adds a welcome textural element to the sandwich, and illustrates from the first bite how much thought has gone into this thing.\n\nAdvertisement\n\nRelated Article A Hector’s Deli founder is behind one of Brisbane’s tastiest sandwiches Any carb-on-carb crime is avoided via the sourdough sandwich bread — baked fresh on site and lent a touch more oil than your typical loaf, it’s about as soft as sourdough gets without losing its structure. “Amos was our first sandwich guy and he was really excited about the chicken caesar, and it was instantly awesome,” Cooney says. “But I said, ‘Look, I think it needs more crunch.’ And he, being an open-minded, wonderful chef, decided that bread on bread wasn’t the end of the world and that he’d give it a go, and once he did we were all excited about the outcome.” Can’t score a spot in Riser’s pretty backyard? Then our recommendation is to take away to Mount Coot-tha Botanic Gardens. Morgan Roberts\n\nAdvertisement\n\nThe rest of the sandwich is pretty straightforward: chicken thigh, mesclun (rather than cos lettuce), house-pickled onions, house-made caesar dressing with dill, and a firm wipe of butter on the bread to head off any sogginess. Still, there are neat tweaks under the hood, this time courtesy of current chef Gabriel Escalante-Gafau. “Gabriel said, ‘I want to brine my chicken so it’s just going to be slightly more tender than before,’” Cooney says. “And then he added a little bit more punch to the dressing by upping the anchovy and the parmesan side of things.” Riser’s immaculately soft, freshly baked sourdough loaf helps the sandwich avoid any carb-on-carb crime. Morgan Roberts The brined thigh is full of flavour and softer than the breast you’ll find in most sangers, while the extra parmesan and anchovy Escalante-Gafau has added to the dressing kicks up the umami quotient.\n\nAdvertisement\n\nWe talk a lot about chef-made sandwiches on Sandwich Watch, and Riser’s chicken caesar sanger eats like one, with a flavour profile that’s strident but balanced. No wonder it’s a bestseller, with a third of its five sandwiches sold every week (out of four regulars and a weekly special) a chicken caesar. Where to get it Riser’s chicken caesar sandwich is $16. You can get one at 85 Miskin Street, Toowong. Maybe avoid peak hour on the weekends. Visiting during the week? The play is to take away to Mount Coot-tha Botanic Gardens, drive into the park up to the secluded back lake and enjoy your lunch in the company of the inquisitive bush turkeys. Related Article The ‘Reuben’ that’s not a Reuben, but you need to eat ASAP anyway Related Article This pop-up CBD stall might just serve Brisbane’s best falafel\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/suspects-accidentally-set-own-care-on-fire-20250620-p5m915.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Suspects accidentally set own care on fire",
        "publish_date": "Fri, 20 Jun 2025 11:40:01 +1000",
        "category": "finance",
        "authors": [],
        "text": "Suspects accidentally set own care on fire\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/cricket-great-johnson-backs-perth-bears-20250620-p5m913.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cricket great Johnson backs Perth Bears",
        "publish_date": "Fri, 20 Jun 2025 11:35:03 +1000",
        "category": "sports",
        "authors": [],
        "text": "Cricket great Johnson backs Perth Bears\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/i-was-at-the-airport-and-did-the-opposite-of-the-let-them-theory-i-have-no-regrets-20250619-p5m8ui.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I was at the airport and did the opposite of the Let Them theory – I have no regrets",
        "publish_date": "Fri, 20 Jun 2025 11:32:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "Now the paint-by-numbers fever dream has left me and there may be no more Mission Impossible films to look forward to, I’ve been trying to find the next diversion to get me through winter. And I think I’m onto something.\n\nOr rather, my friend Amy is. She lives in Boston, has great teeth a great sense of humour and, it turns, out, great life hacks. Watching her two sons’ ice hockey practice, Amy complained to another mum about how her bust is so big that her bra straps cut divots in her shoulders.\n\nWho says you need to chop off your hair just because White Lotus star Leslie Bibb did? Credit: Wolter Peeters\n\nThe friend was bemused. Said she never wears a bra, especially in winter when you have on five layers. Asked why Amy would ever wear one unless meeting the bank manager.\n\nThe conversation spurred Amy to do two things. First, abandon a bra unless she’s working out. Second, ask why it took her until she was 40 to question doing something every day which she hated.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/the-downfall-of-a-drug-racket-an-underworld-drama-20250617-p5m7zr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The downfall of a drug racket: An underworld drama",
        "publish_date": "Fri, 20 Jun 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "John Silvester"
        ],
        "text": "Soon it was obvious that Hafner was a bigger fish than first thought. Hafner had form, not so much in his criminal records but in his associates, including the notorious Tony Mokbel. Act One, Scene Two: A bizarre claim in the County Court In 2007, Hafner went to the County Court to argue that a house in Bulleen that had been seized as part of Tony’s impressive real estate portfolio was, in fact, his. He explained that the house had been given to him by his generous grandmother and had somehow been scooped up as part of Mokbel’s $55 million asset portfolio.\n\nAn honest (well dishonest) mistake, he told the County Court. Hafner, you see, was going through a difficult divorce, and he wanted to make sure his partner could not get her hands on half the title. Tony Mokbel leaves court in 2006. Credit: Andrew De La Rue. “My words were that basically I was having domestics with my missus and, basically, I don’t know what to do with my grandmother’s house, and we ... came to the conclusion that I’d sign it over to him,” he said. The ever-helpful Tony was happy to oblige.\n\nOf course, Mokbel was not in a position to corroborate his mate because at that time he was sitting in a Greek cell having sailed away from Australia on the yacht, Edwena. Unfortunately, an argumentative lawyer for the prosecution suggested Hafner had handed over the house because he owed Mokbel $360,000 and the property was a square-off. The house was valued about $500,000 at the time, and on June 15, 2001, National Australia Bank records show the house was transferred to Tony, who forgave a $320,000 debt and in return transferred $50,000 to Hafner. Mokbel even paid the $17,000 stamp duty to make it all above board. A detective who worked on the Mokbel case said: “Tony was the biggest dealer in town, and Darren owed him money from a drug debt. When he couldn’t pay, Tony said, ‘What have you got?’ and that’s why he signed over his grandmother’s house.” But every cloud has a silver lining, and when the seized house was sold on July 12, 2008, it fetched $625,000, which went to the State Revenue Office.\n\nHafner’s story, unlike the Edwena, sank without trace. County Court judge Michael McInerney dismissed the case, adding: “I do not accept [Hafner] as a credible or reliable witness.” Tony Mokbel fled overseas on the Edwena. Mokbel could afford to be generous because the Hafner debt was chump change. Mokbel, the suburban pizza shop owner, who police described on his file as “lacking financial acumen”, was now flying. By 2000, he was planning to build an $18 million, 10-storey “winged keel” apartment tower over Sydney Road. The plan was to build 120 apartments and townhouses, offices, restaurants, a gym with pool and a four-storey car park on the old Whelan the Wrecker site. No one seemed to wonder how he could generate that sort of money.\n\nHe was also developing 10 units in Templestowe, which he planned to sell for $300,000 each. In 2000, he owned the Brunswick market site and claimed to make $500,000 a year in rent money. His business portfolio was admirably diverse, including investments in shops, cafes, fashion houses, fragrances, restaurants, hotels, nightclubs and land in regional Victoria. He and his companies owned two white vans, two Commodores, a red Audi, a 2000 silver Mercedes, a Nissan Skyline and a red Ferrari Roadster, which he bought in September 1999. He even managed to give his wife a Kilmore pub as part of the family businesses. One of his fashion houses was appropriately named LSD – apparently an abbreviation for Love of Style and Design. His social network was also varied. It included an MP, a tame bank manager, a bent accountant, a newsagent who gratefully accepted $20,000 a week that Tony invested in Tattslotto, seven jockeys and trainers, and a handful of bookies. One jockey, who was in Mokbel’s car when the drug dealer had a fender-bender with a tradie near the State Library, showed his athletic prowess, opening the door and making a dash for the shadows while a contrite Tony apologised and exchanged details with the second driver. One bookie opened a ghost betting account allowing Mokbel to punt under another name. In one week during the 2002 spring racing carnival, the account turned over $445,000. To Tony, it was just pocket money. The bets were made just weeks after Mokbel was finally granted $1 million bail on the serious drugs charges.\n\nWhen one bookie came to collect $80,000 at Tony’s Port Melbourne home, they walked to Mokbel’s car, where he opened the glove box. While forward-thinking motorists might have a roll of coins for parking meters, the bookie estimated the wad of stashed cash was “at least $300,000”. Loading You might think that having lost a house to Mokbel, Hafner would have sought an alternative income stream. But he was nothing if not persistent. He did branch out, receiving workers’ compensation for several years, doing cash jobs on the side (despite a bad back), then going on the dole for 10 years while selling drugs and using stolen credit cards in a fraud ring. In 10 court hearings he collected 36 convictions.\n\nAct Two, Scene One: The Fawkner cops get the green light The Fawkner detectives built up a case and went to their bosses, and it was at that point Operation Manic was established. Hafner was followed around the state, and soon a case was built that he was the middleman in an international syndicate. Federal police tracked three shipments of pure pseudoephedrine, the key ingredient in speed, flown into Australia from Malaysia, India and Dubai, and identified two other key members, Sarah Baines and Abdul Diallo. At one point, police tracked the crew to a Thomastown service station, where they were to buy a kilogram of speed for $165,000. But, in a familiar story in a drug business that is riddled with rip-offs and no-shows, after the initial meeting, the deal fell through. By September, police had enough to move in and arrest the three.\n\nThe finale: Courtroom justice If everyone has 15 minutes of fame, Baines, 33, must be truly annoyed at how she used hers. When she appeared in court as part of Hafner’s syndicate, the Herald Sun wrote: “A Melbourne party girl who peddled dildos for a living is down on her luck after she was accused of running a high-end drug-trafficking racket.” At court, it was found she had worked in a retail sex shop and ran a cleaning service, and in prison had become an unofficial carer for a disabled inmate. She had been using drugs from her early 20s, and when police raided her Southbank apartment they found evidence of drug transactions, and of the drug, 1,4-butanedoil. Diallo, the court was told, was an African leader in the community, having arrived in Australia as a young refugee from Sierra Leone after his father was murdered.\n\nHafner had been examined in prison. Quoting the psychological report, the judge said: “You looked and sounded despondent and depressed. You presented as being at least moderately depressed and mildly anxious.” Little wonder when you are looking at a long stretch and could well die in jail When it came to sentencing, no one was spared. County Court judge Richard Maidment gave Diallo 12 years with a minimum of eight years and eight months, while Hafner was sentenced to 12 years with a minimum of eight years and four months. Baines received 11 years with a minimum of seven.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/this-inner-city-concrete-wasteland-could-be-sydney-s-next-beer-garden-20250617-p5m82l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This inner-city concrete ‘wasteland’ could be Sydney’s next beer garden",
        "publish_date": "Fri, 20 Jun 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney"
        ],
        "text": "It’s the concrete hole in the ground that anyone making the dreaded hike up the steep hill of Albion Street in Surry Hills would have noticed.\n\nGiant weeds have sprouted from gaps in the concrete, rusty fences line the block and residents of apartments opposite are treated to a view of an eyesore that has sat unchanged for years.\n\nBut the site would be transformed into a spot for food trucks, a beer garden, a performance space, markets or even a roller-skating rink under a proposal to be presented to City of Sydney council on Monday.\n\nThis block in Surry Hills will become a future substation. Credit: Louise Kennerley\n\nThe prime slice of Surry Hills land, opposite Frog Hollow Reserve, was a warehouse before it was demolished in 2003 to make way for apartments. That plan fell through, and the land was bought by Ausgrid, which used it as a dive site for the construction of power cable tunnels in 2013.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/perth-eating-out/small-wonder-willetton-s-little-gan-s-rethinks-the-suburban-family-run-asian-restaurant-20250620-p5m90h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Small wonder: Willetton’s Little Gan’s rethinks the suburban, family-run Asian restaurant",
        "publish_date": "Fri, 20 Jun 2025 11:29:54 +1000",
        "category": "finance",
        "authors": [
            "Max Veenhuyzen"
        ],
        "text": "Advertisement\n\nReview Eating outPerth Small wonder: Willetton’s Little Gan’s rethinks the suburban, family-run Asian restaurant Asian-influenced pastas plus a snappy wine and drinks package in a cosy 24-seat setting equals a blueprint for the neighbourhood eatery circa 2025. Max Veenhuyzen June 20, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 7 Beef cheek agnolotti with a brown butter sugo. Matt O’Donohue 2 / 7 Grilled tiger prawns with ssamjang butter and bisque. Matt O’Donohue 3 / 7 Pork scotch fillet on a pumpkin and coconuit puree with radish kimchi. Matt O’Donohue 4 / 7 Miso eggplant with pickle onion and rice pearls. Matt O’Donohue 5 / 7 Black angus ribeye with mushroom puree and black garlic jus. Matt O’Donohue 6 / 7 Grilled octopus with harissa and pineapple salsa. Matt O’Donohue 7 / 7 Muscovado tart. Matt O’Donohue Previous Slide Next Slide 14.5 / 20 How we score Modern Australian$$$$ The first person you’ll meet at Little Gan’s will probably be Jocelyn Gan, the restaurant’s cordial, all-knowing manager. Those raised with traditional Asian values might feel compelled to call Jocelyn “auntie”, such is the aura of calm, wisdom and you-better-listen-to-me that she (non-threateningly) exudes. However you address Jocelyn, one thing is certain: the First Lady of Little Gan’s goes about her work with the quiet confidence of someone who feels at home. Largely because she is. Before it was Little Gan’s, this was Foo Wah. I don’t know when Foo Wah opened, but I do know that Jocelyn and her husband Steven bought it in 1996 when it was takeaway-only. In the quarter of a century that they ran it, the Gans added a dining room and fleshed out the menu with Chinese cooking deep cuts such as eight treasure duck to accompany crowd-pleasers a la sweet and sour pork. So far, so very suburban Chinese restaurant, right up until Foo Wah closed in mid-2021. Which is when the story takes a turn.\n\nAdvertisement\n\nRichard, Jocelyn and Steven Gan. Matt O’Donohue Reader, meet the Gans’ youngest son, Richard. Recently returned from Melbourne where he cooked at long-standing beachside fortress Stokehouse, Richard told his parents that he wanted to resurrect the mothballed Foo Wah as a polished, mid-range neighbourhood restaurant serving contemporary cooking – plot twist number two! – that locals previously needed to travel for. They agreed, and in Easter 2022, Little Gan’s entered the fray. Richard, like all his siblings, helped out in Foo Wah growing up. Now that he was calling the shots, mum and dad returned the favour (most of Papa Gan’s work, however, happens behind the scenes in the kitchen). Although Richard was based in the Foo Wah kitchen, his job was bagging takeaways rather than preparing them. It wasn’t until his early 20s that he started learning to cook professionally, initially at TAFE, then at the Culinary Institute of America in New York. After graduation, he joined upscale Manhattan restaurants Marea and Vaucluse and learned Italian and French cooking respectively. His time at the latter comes through clearly in the textbook tri-tip beef tartare: bouncy and saucy of body, confidently seasoned and unflinchingly classic. Richard’s attitude towards Italian cooking, however, is less traditional.\n\nAdvertisement\n\nRather, he reckons that handmade pastas and maverick sauces is a great way to lure la cucina vera out of its comfort zone. That pickled shimeji mushrooms are an inspired way to brighten bonbon-like agnolotti packing unctuous beef cheek. That coating toothsome spaghetti with a verdant purée of garlic scapes isn’t sacrilege. And that chilli-spiked linguine yearns for the crunch of golden fried prawn heads: pangratatto for crypto millionaires. Richard Gan (second from right) and his siblings watch Richard’s uncle handling a Tasmanian king crab, Foo Wah, 2000. Courtesy of the Gan family This bowerbird thinking informs other dishes. Korean chilli butter prolongs the crustacean-on-crustacean rapture of juicy tiger prawns paired with a stupid good bisque. The combination of North African harissa and Thai fish sauce makes a compelling argument to let all octopus hold dual citizenship. I’ve eaten plenty of sweet and salty Japanese-style grilled eggplant in my 46-year innings. This was the first that a miso dengaku “side dish” threatened to steal the spotlight from charry steak and juicy pork scotch fillet. Granted, Little Gan’s brand of modern Australian has a pronounced Asian accent, but this isn’t food driven by a mission statement or – sharp inhale – “chef’s philosophy”. Instead, these are organically evolved dishes that taste unforced and emblematic of the global village we all live in. Once upon a time, crossover cooking was a byproduct of colonisation. Today, an Instagram DM plus a valid passport are enough to sow the seeds for a win-win collaboration. The comfortable albeit basic dining room shares the kitchen’s cosmopolitan spirit. Framed art on the walls includes pieces from Japan’s Yayoi Kisuma and American painter Edward Hopper, as chosen by Richard’s sister Gillian. (The bijou ceramic vases on the tables, meanwhile, are also made by her).\n\nAdvertisement\n\nRelated Article The Weekly Special The Weekly Special: Subi cantina opens; truffle season returns; winter escapes to Rotto The clientele reflects the multicultural, upwardly population that inhabits the City of Canning’s golden triangle of Rossmoyne, Willetton and Lynwood. Mum, dad and the two kids are out celebrating exam success. Dates and double dates unfold around me. Lubricated by an armful of BYO fizz, a party of 10 is making the most of its Friday night out. Two straight-talking desserts reiterate Little Gan’s democratic nature. Fluffy Basque cheesecake is great as far as baked cheesecakes go, but lacked the wobble found in the genre’s Premier League specimens. No such qualms with the lithe muscovado tart though, its jiggly mahogany custard made hench by the richness of unrefined cane sugar. While this essay’s subject matter is a single address, the truth is that Foo Wahs and (potential) Little Gan’s exist in almost every postcode. Sometimes they’re a proudly un-gourmet fish and chipper. Other times they’re an increasingly regional-specific eatery where the tables are undressed, but the social fabric is strong. All are in various stages of flux and evolution as they try to balance the needs and aspirations of management with those of the paying public. Success happens when both parties meet in the middle.\n\nAdvertisement\n\nLittle Gan’s is a deeply likeable – and deeply delicious – example of a multigenerational family restaurant successfully entering its second act. One reason for this smooth transition is longevity. When you convert restaurant years to human years, a quarter of a century is a lifetime. The other, I think, is support. Not just from customers, but from loved ones. Jocelyn and Steven might have hoped Richard would take after them and his eldest brother and become an accountant. But once they realised his dream was somewhere else, they quickly changed theirs. “I would like my children to be themselves and not have any regrets,” says Jocelyn. “I want them to be able to say that they did what they did because they wanted to, not just because mum and dad told them to.” The low-down Atmosphere: a likeable neighbourhood eatery delivering a neat take on the suburban, family-run Chinese restaurant. Go-to dishes: prawn linguine, miso eggplant. Drinks: a surprisingly contemporary cross-section of classic and new-wave wines, although the glass pours aren’t quite as exciting as what’s by the bottle. BYO is also available ($15 per bottle). Cost: about $140 for two people. Good Food reviews are booked anonymously and paid independently. A restaurant can’t pay for a review or inclusion in the Good Food Guide.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/mystery-lagoon-leak-leaves-south-bank-beach-closed-with-no-reopening-date-20250619-p5m8tx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mystery lagoon leak leaves South Bank beach closed, with no reopening date",
        "publish_date": "Fri, 20 Jun 2025 11:29:22 +1000",
        "category": "finance",
        "authors": [
            "Catherine Strohfeldt"
        ],
        "text": "The lagoon at South Bank is empty again, with investigators yet to find where the 33-year-old pool has been leaking and no time frame given for when it will reopen.\n\nThe Streets Beach pool was closed and drained on March 3, while the government-owned organisation that managed the 42-hectare precinct, South Bank Corporation, investigated a water leak and completed repair works.\n\nThe artificial beach remained closed but was refilled several weeks ago, but management drained it again on Monday.\n\nThe Streets Beach lagoon at South Bank has been closed and drained for a second time this year while management investigates a leak. Credit: Catherine Strohfeldt\n\nA South Bank Corporation spokeswoman said the pool was still leaking.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/jason-ryles-is-swimming-with-eels-and-piranhas-20250618-p5m8lx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jason Ryles is swimming with Eels … and piranhas",
        "publish_date": "Fri, 20 Jun 2025 11:20:00 +1000",
        "category": "sports",
        "authors": [
            "Roy Masters"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Roy Masters interviews the NRL coaches, discovering out what drives them and how they approach the modern game. See all 6 stories . When Jason Ryles was appointed head coach of the Eels in July last year, a Parramatta premiership player and former club official sent me a text. Aware of my relationship with Ryles who was then an assistant at the Storm, the ex-player wrote: “Tell Jason to surround himself with his own people. That (Parramatta) river isn’t full of eels, it’s full of piranhas. He’ll kill it there if he lives by his sword.” As it transpired, Ryles’s actions suggest he instinctively reached the same conclusion. He installed Nathan Brown, his former head coach at the Dragons, as his No 1 assistant, telling this masthead, “I knew I needed more experience in the coaching group. Brownie was available, he was my coach at the Dragons, had also coached the Knights and Warriors and had only ever been a head coach. He’s also good with the attack. He’s complements me.” Ryles, 46, also wielded his own sword when he moved on fullback and captain Clint Gutherson and veteran prop Reagan Campbell-Gillard, as well as sidelining regular forwards Shaun Lane and Ryan Matterson. Ryles says, “The changes needed to happen but happened naturally. The fullback and front rower got longer and better money deals elsewhere. I also knew I had to regenerate the roster. The roster was older and not as fast and athletic as I wanted. I didn’t know how it would all work out but it went well in the end.” Jason Ryles with assistant coach Nathan Brown. Credit: NRL Photos It’s addition by subtraction. By releasing highly paid older players, Ryles has money in the salary cap to reward a greater number of talented youngsters. The downside is a team which can’t stay the distance with the top clubs, as demonstrated in the last two losses, 18-10 to the Panthers and 30-12 to the Bulldogs. “We can’t hang in there for the long period,” Ryles said. “We have a lot of young kids here.”\n\nAdvertisement\n\nRyles’s approach to players is similar to the legendary coach Jack Gibson who won Parramatta’s first premiership, 34 years after the club’s entry into the top league, a drought exceeded by the current one where the Eels last grand final victory was in 1986. Gibson coached by osmosis, the imperceptible assimilation of knowledge. While Ryles is not Gibson, he does encourage players to figure things out for themselves. As one of his colleagues said of Ryles time in Melbourne, “He likes to plant the seed and let it germinate in the player’s mind.” Jack Gibson during his time coaching Parramatta. Credit: Fairfax For example, I asked how he treated Zac Lomax who was signed by former coach Brad Arthur for less money than he was receiving at the Dragons because he was a winger wanting to play centre. Ryles started him there in the opening round, a humiliating 56-18 loss to the Storm but Lomax has starred for NSW as a winger and will be compensated for the money lost by leaving the Dragons via the NSWRL’s payment of $30,000 for each Origin match. “I let him work that out for himself,” Ryles said of a talented player who confused himself and must now realise he is a winger, not a centre. As for the warning to Ryles that the Parramatta river is “full of piranhas” - suggesting a club with marrow-deep grudges and a witches brew of ancient hatreds - Ryles makes it clear he quarantines himself from what are now called “external factors” and is a player’s coach. “The biggest thing for me is the support I get from Mitch (Moses) and Junior Paulo. I keep them in the loop on what I plan to do, while always getting their opinion but not compromising my relationship with the other players.” Ryles has a finely tuned sensitivity meter. He knows a coach must never under-estimate the petty jealousies in the dressing room. Clubs, such as the Rabbitohs, have imploded by the coach investing too much power in two senior players.\n\nAdvertisement\n\nGibson faced a simmering mutiny when he joined Parramatta in 1981 after the club had failed to recover from the 1977 grand final loss to the Dragons - then captained by Steve Edge. A veteran Parramatta player predicted “Jack Gibson will f--- this club”, after Gibson recruited Edge as captain, rather than giving the honour to an Eel. Gibson’s Parramatta won three successive premierships with Edge as skipper. Eels halfback Mitchell Moses. Credit: Getty Images Ryles has similar faith in his captain, saying of Moses, “We got all the options out of his contract. He’s done until the end of 2029. He’s the cornerstone of where we are going.” Although a player’s coach, Ryles is not deaf to any murmurs outside the dressing room. He says of chief executive Jim Sarantinos and football manager Mark O’Neill, “At times I can sense their nervousness at some of the decisions I’ve made but they’ve supported me.” Of the possibility of piranha sightings in the Parramatta river, he says, “I’ve experienced challenges in a couple of areas but the club knew it was ready for change.” Ryles’s journey to the top is different from all the assistants who have been working up the NRL’s food chain to head coach. Wests Tigers Benji Marshall, like Brown, went straight from playing to head coach and others, such as the Sharks Craig Fitzgibbon, had a long apprenticeship. Ryles spent the interim between playing and being an NRL assistant at the Storm and Roosters as captain/coach of the Wollongong Red Devils, 2014-15. He had his own team.\n\nAdvertisement\n\n“It was one of the hardest things I have ever done,” he says. “I don’t recommend it, if you are a front rower. But it helped me enormously because I had to do everything, from putting the witches hats out to dropping players. I had to do all that while being captain, calling the shots and putting my head into the scrum.” An NRL assistant is excused from performing one of a head coach’s most difficult duties – staring a player in the eye and demoting him to reserve grade. “I’ve drawn on that Wollongong experience when dropping players,” he says, perhaps explaining why he can sensitively deliver bad news in an era when players resemble Ming vases – precious commodities that shatter when dropped. Ryles’s empathy with players is also born of his own disappointments. “Wayne (Bennett) moved me on (from the Dragons in 2009) and then I got moved on by the Roosters (in 2011).” In the middle year (2010), the Dragons won the premiership, beating his Roosters. He then joined the Storm but a hamstring injury ruled him out of Melbourne’s 2012 victory. Melbourne coach Craig Bellamy with Ryles in 2020. Credit: Getty Images He went to Melbourne, he says, “to play with Smithy.” If learning under hooker Cameron Smith, the NRL’s most capped player made Melbourne the place to be, it is also the club to be tutored by, as he says, “the greatest coach ever” (Craig Bellamy). To follow Bellamy who has “put all the systems in place” was the principal reason he agreed to return to the club as a head coach in waiting, after rejecting an offer to coach the Dragons. The Dragons claim to have cooled on Ryles when, during negotiations for a five-year contract, the possibility of a pay-out after year three was raised. Ryles says, “I haven’t heard that. Maybe that’s more to do with George (Mimis, his manager). The reason I went back to Melbourne was it was there. They thought Craig was getting closer to the end. If Melbourne wasn’t on offer, I would have gone to the Dragons.” As it transpired, Bellamy will coach into his 24th season in 2026.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/pm-yet-to-decide-on-whether-to-attend-nato-summit-midday-news-bulletin-20-june-2025/kmh62m1j3",
        "title": "PM yet to decide on whether to attend NATO summit | Midday News Bulletin 20 June 2025",
        "publish_date": "Fri, 20 Jun 2025 01:56:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/moira-deeming-john-pesutto-urged-to-smell-the-roses-after-party-grants-bankruptcy-bailout/rpkvf8xbf",
        "title": "Moira Deeming, John Pesutto urged to 'smell the roses' after party grants bankruptcy bailout",
        "publish_date": "Thu, 19 Jun 2025 12:02:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "A $1.5 million loan has been granted to former Victorian Liberal leader John Pesutto, with the fractured party desperate to draw a line under a long-running defamation saga.\n\n\n\n\n\nThe Victorian Liberals' administrative committee met on Thursday night and agreed to lend former leader John Pesutto $1.55 million to settle his debt to first-term MP Moira Deeming.\n\n\n\n\n\nThe cash is separate from campaign money and not drawn from taxpayer funds.\n\n\n\n\n\nThe Hawthorn MP was ordered to pay $2.3 million in legal costs to Deeming after the Federal Court found he defamed her by implying she was associated with neo-Nazis.\n\n\n\n\n\nIt left him facing bankruptcy, which would have triggered his exit from parliament and a subsequent by-election in his marginal seat , unless the debt was repaid within a matter of weeks.\n\n\n\n\n\nPesutto, who has already coughed up $315,000 in damages, had only raised about $750,000 through wealthy backers and a GoFundMe campaign.\n\n\n\nLiberal MP Moira Deeming was found to have been defamed by former Victorian Liberal leader John Pesutto last year. Source: AAP / Joel Carrett An offer to defer some of the legal bill in exchange for Deeming's guaranteed preselection and Pesutto swearing off trying to return as leader for three years was rebuffed.\n\n\n\n\n\nIn a letter to party members late on Thursday, Victorian Liberal president Philip Davis said the money would be paid directly to Deeming.\n\n\n\n\n\nPesutto will be required to repay the loan at market-rate interest.\n\n\n\n\n\nDavis said the deal would avert a by-election and allow the Liberals' parliamentary party to focus on the issues that matter to the Victorian community.\n\n\n\n\n\nEntering parliament on Thursday morning, Pesutto was upbeat about the committee agreeing to his loan request.\n\n\n\n\n\n\"Tonight's an opportunity to square [the issue] off and put it all behind us,\" he said.\n\n\n\nDeeming sceptical of détente\n\nDeeming, who was expelled from the party room before being welcomed back in December, was sceptical it would end the infighting that has engulfed the party since March 2023.\n\n\n\n\n\n\"I assume that they will continue with their quest to try to annihilate me,\" she said.\n\n\n\n\n\nDeeming said the party could \"do what they like\" but she would take any support of Pesutto as a \"direct rebukement (sic)\" of the court judgment.\n\n\n\n\n\nIn social media posts made following news of the bailout, Deeming wrote: \"They failed to protect her when she was attacked .... They punished her for defending herself ... this is what institutional abuse looks like.\"\n\n\n\n'We've put the line in the sand'\n\nVictorian Opposition leader Brad Battin was among those who voted to support the deal.\n\n\n\n\n\n\"We've actually put the line in the sand on that and now we really have to focus on moving forward,\" Battin told ABC Radio Melbourne on Friday.\n\n\n\n\n\nBattin urged his fellow MPs to stop the infighting to present a credible alternative to the Victorian Labor government, in power for all but four years since 1999.\n\n\n\nFollowing news of former Victorian Liberal leader John Pesutto's bailout, current leader Brad Battin said: \"I really believe now is our opportunity to ensure each and every one of my members has a think about what they've wanted to get into parliament for, and it wasn't to be in opposition,\" he said. Source: AAP / Diego Fedele Earlier, he warned Deeming and Pesutto to \"smell the roses\" if either woke up on Friday morning unhappy with the outcome.\n\n\n\n\n\nTime is running out for Battin to unite the Liberals before the next state election in November 2026.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/football-and-brain-health-new-findings-on-how-heading-affects-athletes/505ozozxf",
        "title": "Football and brain health - new findings on how heading affects athletes",
        "publish_date": "Thu, 19 Jun 2025 09:55:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "Football and brain health - new findings on how heading affects athletes\n\nPublished 19 June 2025, 9:19 am\n\nHeading a soccer ball repeatedly can cause changes in the brain, even without concussion or symptoms. That’s the key finding from a world-first Sydney University study, which could help reveal if these changes worsen over time.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/australia-amongst-most-prosperous-countries-in-the-world-ubs-report-reveals/z8t953dwy",
        "title": "Australia amongst most prosperous countries in the world, UBS report reveals",
        "publish_date": "Thu, 19 Jun 2025 09:49:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia amongst most prosperous countries in the world, UBS report reveals\n\nPublished 19 June 2025, 9:19 am\n\nAustralia is among the most prosperous countries in the world according to a new report, ranking the nation 5th for average adult wealth and second in median terms. The report also coined a new term, the rise of EMILLIs, or Everyday Millionaire - people with assets of one to five million US dollars. With all that money, why do some Australians not feel rich?",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/trump-v-powell-us-president-calls-fed-chair-stupid/waad3o614",
        "title": "Trump v Powell: US President calls Fed Chair 'stupid'",
        "publish_date": "Thu, 19 Jun 2025 07:16:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-problem-that-could-cost-australia-more-than-8-billion-every-year/w2n6n6ge1",
        "title": "The problem that could cost Australia more than $8 billion every year",
        "publish_date": "Thu, 19 Jun 2025 05:45:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "From droughts to fires, cyclones, and floods, Australia has been hit with a series of devastating extreme weather events, and the financial burden is becoming increasingly heavy.\n\n\n\n\n\nAccording to a new Climate Change Authority (CCA) report, back-to-back disasters have cost the Australian economy $2.2 billion in the first half of 2025 alone.\n\n\n\n\n\nThe cost is projected to rise to $8.7 billion annually by 2050 without strong action, the report stated.\n\n\n\n\n\nThe Home safe: National leadership in adapting to a changing climate report examines the increasing frequency of extreme weather events and calls for national leadership on climate action.\n\n\n\nThe economic cost of natural disasters and extreme weather\n\nThe Insurance Council of Australia estimates bushfires, cyclones, and floods are costing Australian homeowners around $4 billion each year, from a combination of both insured and uninsured losses, mental health impacts, and loss of housing and employment.\n\n\n\n\n\nCosts are rising as the climate changes and hazards become more frequent and severe, with regions and homes that were previously unaffected now becoming at risk, according to the Climate Change Authority.\n\n\n\n\n\nClimate Change Authority chair Matt Kean said: \"Our homes are our sanctuaries — and the biggest financial investment most Australians will ever make.\"\n\n\n\n\n\n\"Millions of Australian homes now face escalating risks from climate change. Devastating flooding on the NSW mid-north coast last month is the latest example, but won't be the last.\"\n\n\n\nThe report referenced recent research from the Insurance Council of Australia (ICA), the Treasury, and The McKell Institute into the costs of residential building damage resulting from extreme weather. The research found the cost to residential buildings is $2 billion a year for cyclones, $1.5 billion a year for floods and $486 million a year for bushfires.\n\n\n\n\n\nAs these events become more frequent, the cost of insurance premiums has also increased. The CCA examined research from the Actuaries Institute and ICA, which found insurance claims for ex-Tropical Cyclone Alfred and the North Queensland floods exceeded $1.2 billion.\n\n\n\n\n\nAs cost of living pressures also increase, 15 per cent of Australian households experienced home insurance affordability stress in 2024, according to the research.\n\n\n\n\n\nClimate-related disasters can also have a lasting impact on property prices in affected areas, and the report projects climate change could wipe over $500 billion off the Australian property market by 2030.\n\n\n\nProperty damage is not the only economic impact of climate change and extreme weather events.\n\n\n\n\n\nAlongside housing costs, Australians are also facing costly impacts to their physical health, mental health, displacement, and impacts on their ability to work and study, the report said.\n\n\n\nCan climate change costs be reduced?\n\nThe CCA has called on the government to take steps to reduce the risks and costs associated with climate-related extreme weather events.\n\n\n\n\n\nThe report's recommendations include making appropriate investments in infrastructure and services, ensuring standards, laws and regulations are fit-for-purpose for a changing climate, and equipping Australians with the information and resources to improve their decision-making.\n\n\n\n\n\nResearch by the CSIRO, Australia's national science agency, found every dollar invested in climate adaptation or disaster risk reduction saves $2 to $11 in recovery costs.\n\n\n\n\n\n\"Authorities will need to review and tighten building codes. Parts of coastal Queensland and WA not now covered by cyclone construction standards may need to be, and soon,\" Kean said.\n\n\n\n\n\n\"These are the kinds of practical steps we can take to make Australia more resilient in a changing climate.\"\n\n\n\nA spokesperson from the Department of Climate Change, Energy, the Environment and Water said work is underway across all levels of government and the private sector to improve the resilience of infrastructure, services, and the built environment.\n\n\n\n\n\n\"The government released the National Climate Risk Assessment first pass in March 2024, and is now progressing to the full release of Australia's first National Climate Risk Assessment as a matter of priority, in addition to a corresponding National Adaptation Plan,\" the spokesperson said.\n\n\n\n\n\n\"The National Adaptation Plan will represent a step change in the Australian government's response to climate change. It establishes, for the first time, a framework for adapting to the physical climate risks that are nationally significant.\"\n\n\n\n\n\nThe National Climate Risk Assessment identified 56 nationally significant climate risks facing Australia, along with a subset of 11 priority risks that require further analysis. It is being used by the government to examine the impacts and risks to Australia from climate change.\n\n\n\n\n\nCurrent planning and investments in infrastructure and services include the Critical Infrastructure Resilience Strategy and Plan, the Disaster Ready Fund, and the Queensland Betterment Funds program.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australias-highest-paid-ceos-and-the-one-woman-on-the-list/sbt8rntnf",
        "title": "Australia's highest-paid CEOs revealed — and the one woman on the list",
        "publish_date": "Thu, 19 Jun 2025 02:22:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "The CEOs of Australia's largest ASX-listed companies earn 55 times the average Australian worker's wage, with a United States-based chief executive topping the pay rankings in 2024.\n\n\n\n\n\nThe Australian Council of Superannuation Investors (ACSI) ranks the highest-paid CEOs of ASX 200 companies in its annual review each year.\n\n\n\n\n\nThe median realised pay for ASX 100 leaders, which includes fixed pay and bonuses received, was $4.15 million, up from $3.96 million a decade prior in 2014.\n\n\n\n\n\nCEO pay at smaller listed companies has increased over time, with the median wage climbing from $1.74 million in 2014 to $2.2 million in 2024.\n\n\n\n\n\nWhile CEOs earn millions annually, the gap between them and the average worker has been shrinking over the past decade.\n\n\n\nThe top-paid CEO was Robert Thomson, a US-based executive who heads News Corporation and earns nearly $42 million annually. Source: SBS News\n\nExecutives in the US and one woman make the list\n\nThe top earner for the financial year 2024 was Robert Thomson of News Corporation, who earned $42 million annually, closely followed by Victor Herrero, CEO of jewellery retailer Lovisa, with $39.5 million.\n\n\n\n\n\nShemara Wikramanayake, the only woman in the top 20, made $30 million as CEO of Macquarie Group.\n\n\n\n\n\nWikramanayake was the highest-paid CEO if only ASX 100 companies were analysed.\n\n\n\n\n\nTwo US companies made the top five: News Corp and medical equipment firm ResMed, which paid its CEO, Mick Farrell, $20 million last financial year.\n\n\n\n\n\nAnother three US-based businesses cracked the top 20, with their CEOs earning more on average — a trend ACSI attributes to North American \"pay practices\".\n\n\n\nLISTEN TO SBS On the Money: Concerns of CEO pay break out + ASX200 at record SBS News 12/07/2024 12:07 Play\n\nCEOs earned 55 times the average wage of an Australian worker in 2024, representing a wider gap than the previous year, when leaders outearned average workers by 50 times.\n\n\n\n\n\nBut the gap has narrowed significantly compared to 2014, when CEOs earned 71 times more than the average worker in Australia.\n\n\n\n\n\nEd John, ACSI's executive manager of stewardship, said: \"Australia is actually doing well relative to other markets where there's been a significant breakout in CEO pay.\"\n\n\n\n\n\n\"There's been recent studies that show CEO pay is a multiple of about 106 times median salaries in the UK and in the US, that's actually more than 300 times in the largest companies.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/energy-price-rules-for-electricity-retailers-are-changing-soon-heres-what-to-know/xlx4f75p1",
        "title": "Energy price rules for electricity retailers are changing soon. Here's what to know",
        "publish_date": "Thu, 19 Jun 2025 00:58:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Energy retailers will be barred from raising bills more than once a year and will be forced to remove unfair fees for vulnerable customers under new rules announced by the energy market rule maker.\n\n\n\n\n\nThe move will help reduce the complexity and opacity of the poorly understood electricity system, and prevent customers from being ripped off, Energy Minister Chris Bowen said.\n\n\n\n\n\nThe changes announced by the Australian Energy Market Commission include:\n\n\n\nPreventing retailers from increasing prices more than once a year\n\nBanning excessive fees for late payments, and\n\nProhibiting fees for vulnerable customers\n\nRetailers must also ensure vulnerable Australians are receiving their best available plan.\n\n\n\n\n\nThe commission's rule changes will be phased in over the course of next year, with the first tranche coming into effect on 1 July 2026 and the remaining changes applying from 30 December 2026.\n\n\n\n\n\nThe changes are intended to clamp down on retailers who lure customers in with cheap deals, only to move them onto higher cost plans or impose hidden fees and charges.\n\n\n\n\n\n\"I'm not going to pretend that they're a silver bullet, but clearly, the situation hasn't been working,\" Bowen told ABC Radio National on Thursday.\n\n\n\n\"There are many, many Australians, either in hardship or not in hardship, who aren't on their best possible plan. That's not their fault. We need to make it as easy as possible for them to change.\"\n\n\n\n\n\nResearch has found about 40 per cent of Australians don't read their energy bill. More needs to be done to ensure busy consumers receive their best offer, Bowen said.\n\n\n\n\n\nBut it's only part of a broader reform process to make the energy system simpler and fairer, he said.\n\n\n\nREAD MORE Solar batteries are about to get cheaper. But some existing solar panel users are sceptical\n\nOn Wednesday, Bowen flagged changes to so-called Default Market Offer rules in a bid to force energy companies to compete harder for customer dollars and prevent unfair price hikes.\n\n\n\n\n\nThe regulations were intended to establish a benchmark price to limit price gouging and put downward pressure on prices through competition between energy companies, but were not working as planned, Bowen told the Australian Energy Week conference in Melbourne.\n\n\n\n\n\nBowen flagged reforms to the Australian Energy Regulator's price-setting mechanism for NSW, South Australia and Queensland to better align with Victoria's rules.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australias-unemployment-rate-set-to-remain-steady-at-4-1-per-cent/nfj6ldgkf",
        "title": "Australia's unemployment rate remains steady at 4.1 per cent",
        "publish_date": "Thu, 19 Jun 2025 00:22:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "The unemployment rate held steady at 4.1 per cent in May, in line with forecasts, despite a surprise fall in jobs.\n\n\n\n\n\nSome 2,500 jobs were lost from the economy despite forecasters tipping a 20,000 employment gain, according to Australian Bureau of Statistics figures.\n\n\n\n\n\nThere was a surprise surge of 89,000 jobs in April.\n\n\n\n\n\nThe participation rate — which reflects the proportion of the working-age population that is actively participating in the labour market — fell 0.1 per cent to 67 per cent.\n\n\n\n\n\nAustralia's unemployment rate has stayed below pre-COVID averages, despite elevated interest rates, in part because the labour market has been underpinned by strength in government-funded employment, such as in health and aged care.\n\n\n\nSalaries go up in the month of May, data shows\n\nMeanwhile, listed salaries increased by 3.6 per cent in the year to May, according to a report by online jobs site Seek.\n\n\n\n\n\nBut monthly growth in May was just 0.2 per cent, the smallest one-month increase since October.\n\n\n\nREAD MORE More Australians are juggling multiple jobs while spending more on healthcare\n\nSeek senior economist Blair Chapman said the increase in advertised wages was welcome.\n\n\n\n\n\n\"The growth in average advertised salaries is currently outpacing living costs, which is good news for those switching employers as they are likely gaining a real wage increase.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/world/middle-east/israel-iran-conflict-live-updates-middle-east-war-news-20250619-p5m8um.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Israel-Iran conflict LIVE updates: Australia deploys ADF to Middle East to evacuate citizens after embassy in Tehran closes; Trump to decide on US involvement ‘within two weeks’",
        "publish_date": "Fri, 20 Jun 2025 12:06:03 +1000",
        "category": "finance",
        "authors": [
            "Lachlan Abbott",
            "Anthony Segaert",
            "Lynette Eyb"
        ],
        "text": "Over the past 24 hours, about 38 Australians were evacuated from Israel to Jordan via bus, Penny Wong said.\n\nShe added that another bus had led evacuations the day before, although not every Australian in Israel and Iran wanted to leave.\n\nForeign Minister Penny Wong during a press conference earlier this month. Credit: Alex Ellinghausen\n\n“I think with the Sabbath coming, it will make it more difficult over the next couple of days, but we hope to increase the number of people who are travelling out, if they wish to do so, by bus to Jordan,” she said.\n\nWong has also just added that the border crossing into Azerbaijan was “the most likely exit from Tehran”.\n\nThe foreign minister said 2000 Australians in Iran had registered for DFAT support. In Israel, that number was about1200.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/i-was-very-raw-skelton-s-12-year-journey-back-to-facing-the-lions-20250619-p5m8ux.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I was very raw’: Skelton’s 12-year journey back to facing the Lions",
        "publish_date": "Fri, 20 Jun 2025 11:58:00 +1000",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "Will Skelton’s senior status in the Wallabies squad is underlined not just by recently celebrating his 33rd birthday, but also by being one of just two players, alongside prop James Slipper, who have faced the British and Irish Lions before.\n\nAfter his season ended in France with La Rochelle, Skelton needed to look into his past to embrace the future. The giant second-rower watched the Waratahs’ 30-point defeat against a team featuring Johnny Sexton and Geoff Parling, now assistant coaches with the Lions and Wallabies, respectively.\n\nSkelton’s choice of post-season entertainment had a purpose; he wanted to remind himself of the intensity that a British and Irish series brings, on and off the field. Skelton has subsequently won three European Cups and captained his country in a World Cup, but the Lions still feel different.\n\n“I was very raw, I didn’t understand the magnitude of the tour, as I do now, with all the experience I’ve had. It’s a massive, massive occasion for rugby, and especially rugby in Australia,” Skelton said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/lions-reject-golden-point-for-wallabies-series-20250620-p5m8zs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lions reject golden point for Wallabies series",
        "publish_date": "Fri, 20 Jun 2025 11:50:17 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "The British and Irish Lions have rejected a proposal from Rugby Australia to use golden point in next month’s Test series against the Wallabies, leaving open the possibility of the teams sharing the spoils in a tied series.\n\nAs reported by this masthead, Rugby Australia boss Phil Waugh pitched the idea of golden point to their Lions at recent meetings, in an attempt to ensure the three-Test series would have a winner.\n\nIn 2017, the Lions and the All Blacks shared the series trophy 1-1 after a draw in the third Test, with no provisions to play any extra time.\n\nThat is set to be the case again in the 2025 series against the Lions, after the Lions board decided to not back RA proposal.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/brisbane-eating-out/brisbane-s-best-chook-sanger-here-s-a-textural-flavour-filled-contender-20250619-p5m8op.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane’s best chook sanger? Here’s a textural, flavour-filled contender",
        "publish_date": "Fri, 20 Jun 2025 11:47:56 +1000",
        "category": "finance",
        "authors": [
            "Matt Shea"
        ],
        "text": "Advertisement\n\nEating outSandwich Watch Brisbane’s best chook sanger? Here’s a textural, flavour-filled contender Freshly baked bread? Check. Brined chicken? Check. Umami packed dressing? Check. There’s just so much to love about this fabulous creation. Matt Shea June 20, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nTom Cooney will tell you Riser has and always will be a team effort. “The staff at Riser are such a big part of what we do,” Cooney says. Riser’s chicken caesar sandwich. Morgan Roberts “It’s not really a pyramid, top-down structure. Maybe it would be different if it was chef-owned. But we’re excited to have people bring their ideas in to work on. “It’s definitely the sum of all its parts.”\n\nAdvertisement\n\nThe philosophy neatly extends to the main reason (among, it must be said, a bunch of supplementary ones) to check out this Toowong bakery and cafe: its chicken caesar sandwich. Because this is one of the very best chook sangers in the city. Seriously. Related Article Is this sanger Brisbane’s best hangover cure? More about the sandwich in a second. But first, let’s talk about Riser Riser is the creation of Cooney, Kieran Ryan and Duncan McKay, who between them have run, worked, baked at or owned Cup Specialty Roasters, Coffee Supreme, Banneton, The Scratch and Netherworld, among others.\n\nAdvertisement\n\nThey opened Riser in late 2022 in the storied Queenslander-style shopfront formerly occupied by 85 Miskin Street, and before that Bruno Loubet’s iconic Bruno’s Tables. Riser is tucked away on a back street in bucolic Toowong. Morgan Roberts From the outside, it looks much the same as its suburban restaurant days, but inside it’s transformed, the old ground-floor dining room occupied by an expanded open kitchen and concrete counter and display box. On weekends, it’s the scene of orderly chaos as customers queue around the timber floor and out the door under a shaded patio. What are they queueing for?\n\nAdvertisement\n\nRelatively quiet during the week, Riser regularly has queues out the door on Saturdays and Sundays. Morgan Roberts Precisely baked danishes, croissants, scrolls and sausage rolls, sure, but also a fabulous chicken caesar sandwich stacked with flavour. Riser’s chicken caesar sandwich As mentioned, the chicken caesar sanger at Riser is a team effort that’s been iterated on at least twice since it was first created (with input from Cooney, Ryan and McKay) by the venue’s original chef, Amos Ilett. Arguably, though, the killer move was the addition of croutons, which was Cooney’s idea. Along with the flecks of bacon, it adds a welcome textural element to the sandwich, and illustrates from the first bite how much thought has gone into this thing.\n\nAdvertisement\n\nRelated Article A Hector’s Deli founder is behind one of Brisbane’s tastiest sandwiches Any carb-on-carb crime is avoided via the sourdough sandwich bread — baked fresh on site and lent a touch more oil than your typical loaf, it’s about as soft as sourdough gets without losing its structure. “Amos was our first sandwich guy and he was really excited about the chicken caesar, and it was instantly awesome,” Cooney says. “But I said, ‘Look, I think it needs more crunch.’ And he, being an open-minded, wonderful chef, decided that bread on bread wasn’t the end of the world and that he’d give it a go, and once he did we were all excited about the outcome.” Can’t score a spot in Riser’s pretty backyard? Then our recommendation is to take away to Mount Coot-tha Botanic Gardens. Morgan Roberts\n\nAdvertisement\n\nThe rest of the sandwich is pretty straightforward: chicken thigh, mesclun (rather than cos lettuce), house-pickled onions, house-made caesar dressing with dill, and a firm wipe of butter on the bread to head off any sogginess. Still, there are neat tweaks under the hood, this time courtesy of current chef Gabriel Escalante-Gafau. “Gabriel said, ‘I want to brine my chicken so it’s just going to be slightly more tender than before,’” Cooney says. “And then he added a little bit more punch to the dressing by upping the anchovy and the parmesan side of things.” Riser’s immaculately soft, freshly baked sourdough loaf helps the sandwich avoid any carb-on-carb crime. Morgan Roberts The brined thigh is full of flavour and softer than the breast you’ll find in most sangers, while the extra parmesan and anchovy Escalante-Gafau has added to the dressing kicks up the umami quotient.\n\nAdvertisement\n\nWe talk a lot about chef-made sandwiches on Sandwich Watch, and Riser’s chicken caesar sanger eats like one, with a flavour profile that’s strident but balanced. No wonder it’s a bestseller, with a third of its five sandwiches sold every week (out of four regulars and a weekly special) a chicken caesar. Where to get it Riser’s chicken caesar sandwich is $16. You can get one at 85 Miskin Street, Toowong. Maybe avoid peak hour on the weekends. Visiting during the week? The play is to take away to Mount Coot-tha Botanic Gardens, drive into the park up to the secluded back lake and enjoy your lunch in the company of the inquisitive bush turkeys. Related Article The ‘Reuben’ that’s not a Reuben, but you need to eat ASAP anyway Related Article This pop-up CBD stall might just serve Brisbane’s best falafel\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/suspects-accidentally-set-own-care-on-fire-20250620-p5m915.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Suspects accidentally set own care on fire",
        "publish_date": "Fri, 20 Jun 2025 11:40:01 +1000",
        "category": "finance",
        "authors": [],
        "text": "Suspects accidentally set own care on fire\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/cricket-great-johnson-backs-perth-bears-20250620-p5m913.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cricket great Johnson backs Perth Bears",
        "publish_date": "Fri, 20 Jun 2025 11:35:03 +1000",
        "category": "sports",
        "authors": [],
        "text": "Cricket great Johnson backs Perth Bears\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/i-was-at-the-airport-and-did-the-opposite-of-the-let-them-theory-i-have-no-regrets-20250619-p5m8ui.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I was at the airport and did the opposite of the Let Them theory – I have no regrets",
        "publish_date": "Fri, 20 Jun 2025 11:32:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "Now the paint-by-numbers fever dream has left me and there may be no more Mission Impossible films to look forward to, I’ve been trying to find the next diversion to get me through winter. And I think I’m onto something.\n\nOr rather, my friend Amy is. She lives in Boston, has great teeth a great sense of humour and, it turns, out, great life hacks. Watching her two sons’ ice hockey practice, Amy complained to another mum about how her bust is so big that her bra straps cut divots in her shoulders.\n\nWho says you need to chop off your hair just because White Lotus star Leslie Bibb did? Credit: Wolter Peeters\n\nThe friend was bemused. Said she never wears a bra, especially in winter when you have on five layers. Asked why Amy would ever wear one unless meeting the bank manager.\n\nThe conversation spurred Amy to do two things. First, abandon a bra unless she’s working out. Second, ask why it took her until she was 40 to question doing something every day which she hated.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/the-downfall-of-a-drug-racket-an-underworld-drama-20250617-p5m7zr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The downfall of a drug racket: An underworld drama",
        "publish_date": "Fri, 20 Jun 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "John Silvester"
        ],
        "text": "Soon it was obvious that Hafner was a bigger fish than first thought. Hafner had form, not so much in his criminal records but in his associates, including the notorious Tony Mokbel. Act One, Scene Two: A bizarre claim in the County Court In 2007, Hafner went to the County Court to argue that a house in Bulleen that had been seized as part of Tony’s impressive real estate portfolio was, in fact, his. He explained that the house had been given to him by his generous grandmother and had somehow been scooped up as part of Mokbel’s $55 million asset portfolio.\n\nAn honest (well dishonest) mistake, he told the County Court. Hafner, you see, was going through a difficult divorce, and he wanted to make sure his partner could not get her hands on half the title. Tony Mokbel leaves court in 2006. Credit: Andrew De La Rue. “My words were that basically I was having domestics with my missus and, basically, I don’t know what to do with my grandmother’s house, and we ... came to the conclusion that I’d sign it over to him,” he said. The ever-helpful Tony was happy to oblige.\n\nOf course, Mokbel was not in a position to corroborate his mate because at that time he was sitting in a Greek cell having sailed away from Australia on the yacht, Edwena. Unfortunately, an argumentative lawyer for the prosecution suggested Hafner had handed over the house because he owed Mokbel $360,000 and the property was a square-off. The house was valued about $500,000 at the time, and on June 15, 2001, National Australia Bank records show the house was transferred to Tony, who forgave a $320,000 debt and in return transferred $50,000 to Hafner. Mokbel even paid the $17,000 stamp duty to make it all above board. A detective who worked on the Mokbel case said: “Tony was the biggest dealer in town, and Darren owed him money from a drug debt. When he couldn’t pay, Tony said, ‘What have you got?’ and that’s why he signed over his grandmother’s house.” But every cloud has a silver lining, and when the seized house was sold on July 12, 2008, it fetched $625,000, which went to the State Revenue Office.\n\nHafner’s story, unlike the Edwena, sank without trace. County Court judge Michael McInerney dismissed the case, adding: “I do not accept [Hafner] as a credible or reliable witness.” Tony Mokbel fled overseas on the Edwena. Mokbel could afford to be generous because the Hafner debt was chump change. Mokbel, the suburban pizza shop owner, who police described on his file as “lacking financial acumen”, was now flying. By 2000, he was planning to build an $18 million, 10-storey “winged keel” apartment tower over Sydney Road. The plan was to build 120 apartments and townhouses, offices, restaurants, a gym with pool and a four-storey car park on the old Whelan the Wrecker site. No one seemed to wonder how he could generate that sort of money.\n\nHe was also developing 10 units in Templestowe, which he planned to sell for $300,000 each. In 2000, he owned the Brunswick market site and claimed to make $500,000 a year in rent money. His business portfolio was admirably diverse, including investments in shops, cafes, fashion houses, fragrances, restaurants, hotels, nightclubs and land in regional Victoria. He and his companies owned two white vans, two Commodores, a red Audi, a 2000 silver Mercedes, a Nissan Skyline and a red Ferrari Roadster, which he bought in September 1999. He even managed to give his wife a Kilmore pub as part of the family businesses. One of his fashion houses was appropriately named LSD – apparently an abbreviation for Love of Style and Design. His social network was also varied. It included an MP, a tame bank manager, a bent accountant, a newsagent who gratefully accepted $20,000 a week that Tony invested in Tattslotto, seven jockeys and trainers, and a handful of bookies. One jockey, who was in Mokbel’s car when the drug dealer had a fender-bender with a tradie near the State Library, showed his athletic prowess, opening the door and making a dash for the shadows while a contrite Tony apologised and exchanged details with the second driver. One bookie opened a ghost betting account allowing Mokbel to punt under another name. In one week during the 2002 spring racing carnival, the account turned over $445,000. To Tony, it was just pocket money. The bets were made just weeks after Mokbel was finally granted $1 million bail on the serious drugs charges.\n\nWhen one bookie came to collect $80,000 at Tony’s Port Melbourne home, they walked to Mokbel’s car, where he opened the glove box. While forward-thinking motorists might have a roll of coins for parking meters, the bookie estimated the wad of stashed cash was “at least $300,000”. Loading You might think that having lost a house to Mokbel, Hafner would have sought an alternative income stream. But he was nothing if not persistent. He did branch out, receiving workers’ compensation for several years, doing cash jobs on the side (despite a bad back), then going on the dole for 10 years while selling drugs and using stolen credit cards in a fraud ring. In 10 court hearings he collected 36 convictions.\n\nAct Two, Scene One: The Fawkner cops get the green light The Fawkner detectives built up a case and went to their bosses, and it was at that point Operation Manic was established. Hafner was followed around the state, and soon a case was built that he was the middleman in an international syndicate. Federal police tracked three shipments of pure pseudoephedrine, the key ingredient in speed, flown into Australia from Malaysia, India and Dubai, and identified two other key members, Sarah Baines and Abdul Diallo. At one point, police tracked the crew to a Thomastown service station, where they were to buy a kilogram of speed for $165,000. But, in a familiar story in a drug business that is riddled with rip-offs and no-shows, after the initial meeting, the deal fell through. By September, police had enough to move in and arrest the three.\n\nThe finale: Courtroom justice If everyone has 15 minutes of fame, Baines, 33, must be truly annoyed at how she used hers. When she appeared in court as part of Hafner’s syndicate, the Herald Sun wrote: “A Melbourne party girl who peddled dildos for a living is down on her luck after she was accused of running a high-end drug-trafficking racket.” At court, it was found she had worked in a retail sex shop and ran a cleaning service, and in prison had become an unofficial carer for a disabled inmate. She had been using drugs from her early 20s, and when police raided her Southbank apartment they found evidence of drug transactions, and of the drug, 1,4-butanedoil. Diallo, the court was told, was an African leader in the community, having arrived in Australia as a young refugee from Sierra Leone after his father was murdered.\n\nHafner had been examined in prison. Quoting the psychological report, the judge said: “You looked and sounded despondent and depressed. You presented as being at least moderately depressed and mildly anxious.” Little wonder when you are looking at a long stretch and could well die in jail When it came to sentencing, no one was spared. County Court judge Richard Maidment gave Diallo 12 years with a minimum of eight years and eight months, while Hafner was sentenced to 12 years with a minimum of eight years and four months. Baines received 11 years with a minimum of seven.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/this-inner-city-concrete-wasteland-could-be-sydney-s-next-beer-garden-20250617-p5m82l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This inner-city concrete ‘wasteland’ could be Sydney’s next beer garden",
        "publish_date": "Fri, 20 Jun 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney"
        ],
        "text": "It’s the concrete hole in the ground that anyone making the dreaded hike up the steep hill of Albion Street in Surry Hills would have noticed.\n\nGiant weeds have sprouted from gaps in the concrete, rusty fences line the block and residents of apartments opposite are treated to a view of an eyesore that has sat unchanged for years.\n\nBut the site would be transformed into a spot for food trucks, a beer garden, a performance space, markets or even a roller-skating rink under a proposal to be presented to City of Sydney council on Monday.\n\nThis block in Surry Hills will become a future substation. Credit: Louise Kennerley\n\nThe prime slice of Surry Hills land, opposite Frog Hollow Reserve, was a warehouse before it was demolished in 2003 to make way for apartments. That plan fell through, and the land was bought by Ausgrid, which used it as a dive site for the construction of power cable tunnels in 2013.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/perth-eating-out/small-wonder-willetton-s-little-gan-s-rethinks-the-suburban-family-run-asian-restaurant-20250620-p5m90h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Small wonder: Willetton’s Little Gan’s rethinks the suburban, family-run Asian restaurant",
        "publish_date": "Fri, 20 Jun 2025 11:29:54 +1000",
        "category": "finance",
        "authors": [
            "Max Veenhuyzen"
        ],
        "text": "Advertisement\n\nReview Eating outPerth Small wonder: Willetton’s Little Gan’s rethinks the suburban, family-run Asian restaurant Asian-influenced pastas plus a snappy wine and drinks package in a cosy 24-seat setting equals a blueprint for the neighbourhood eatery circa 2025. Max Veenhuyzen June 20, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 7 Beef cheek agnolotti with a brown butter sugo. Matt O’Donohue 2 / 7 Grilled tiger prawns with ssamjang butter and bisque. Matt O’Donohue 3 / 7 Pork scotch fillet on a pumpkin and coconuit puree with radish kimchi. Matt O’Donohue 4 / 7 Miso eggplant with pickle onion and rice pearls. Matt O’Donohue 5 / 7 Black angus ribeye with mushroom puree and black garlic jus. Matt O’Donohue 6 / 7 Grilled octopus with harissa and pineapple salsa. Matt O’Donohue 7 / 7 Muscovado tart. Matt O’Donohue Previous Slide Next Slide 14.5 / 20 How we score Modern Australian$$$$ The first person you’ll meet at Little Gan’s will probably be Jocelyn Gan, the restaurant’s cordial, all-knowing manager. Those raised with traditional Asian values might feel compelled to call Jocelyn “auntie”, such is the aura of calm, wisdom and you-better-listen-to-me that she (non-threateningly) exudes. However you address Jocelyn, one thing is certain: the First Lady of Little Gan’s goes about her work with the quiet confidence of someone who feels at home. Largely because she is. Before it was Little Gan’s, this was Foo Wah. I don’t know when Foo Wah opened, but I do know that Jocelyn and her husband Steven bought it in 1996 when it was takeaway-only. In the quarter of a century that they ran it, the Gans added a dining room and fleshed out the menu with Chinese cooking deep cuts such as eight treasure duck to accompany crowd-pleasers a la sweet and sour pork. So far, so very suburban Chinese restaurant, right up until Foo Wah closed in mid-2021. Which is when the story takes a turn.\n\nAdvertisement\n\nRichard, Jocelyn and Steven Gan. Matt O’Donohue Reader, meet the Gans’ youngest son, Richard. Recently returned from Melbourne where he cooked at long-standing beachside fortress Stokehouse, Richard told his parents that he wanted to resurrect the mothballed Foo Wah as a polished, mid-range neighbourhood restaurant serving contemporary cooking – plot twist number two! – that locals previously needed to travel for. They agreed, and in Easter 2022, Little Gan’s entered the fray. Richard, like all his siblings, helped out in Foo Wah growing up. Now that he was calling the shots, mum and dad returned the favour (most of Papa Gan’s work, however, happens behind the scenes in the kitchen). Although Richard was based in the Foo Wah kitchen, his job was bagging takeaways rather than preparing them. It wasn’t until his early 20s that he started learning to cook professionally, initially at TAFE, then at the Culinary Institute of America in New York. After graduation, he joined upscale Manhattan restaurants Marea and Vaucluse and learned Italian and French cooking respectively. His time at the latter comes through clearly in the textbook tri-tip beef tartare: bouncy and saucy of body, confidently seasoned and unflinchingly classic. Richard’s attitude towards Italian cooking, however, is less traditional.\n\nAdvertisement\n\nRather, he reckons that handmade pastas and maverick sauces is a great way to lure la cucina vera out of its comfort zone. That pickled shimeji mushrooms are an inspired way to brighten bonbon-like agnolotti packing unctuous beef cheek. That coating toothsome spaghetti with a verdant purée of garlic scapes isn’t sacrilege. And that chilli-spiked linguine yearns for the crunch of golden fried prawn heads: pangratatto for crypto millionaires. Richard Gan (second from right) and his siblings watch Richard’s uncle handling a Tasmanian king crab, Foo Wah, 2000. Courtesy of the Gan family This bowerbird thinking informs other dishes. Korean chilli butter prolongs the crustacean-on-crustacean rapture of juicy tiger prawns paired with a stupid good bisque. The combination of North African harissa and Thai fish sauce makes a compelling argument to let all octopus hold dual citizenship. I’ve eaten plenty of sweet and salty Japanese-style grilled eggplant in my 46-year innings. This was the first that a miso dengaku “side dish” threatened to steal the spotlight from charry steak and juicy pork scotch fillet. Granted, Little Gan’s brand of modern Australian has a pronounced Asian accent, but this isn’t food driven by a mission statement or – sharp inhale – “chef’s philosophy”. Instead, these are organically evolved dishes that taste unforced and emblematic of the global village we all live in. Once upon a time, crossover cooking was a byproduct of colonisation. Today, an Instagram DM plus a valid passport are enough to sow the seeds for a win-win collaboration. The comfortable albeit basic dining room shares the kitchen’s cosmopolitan spirit. Framed art on the walls includes pieces from Japan’s Yayoi Kisuma and American painter Edward Hopper, as chosen by Richard’s sister Gillian. (The bijou ceramic vases on the tables, meanwhile, are also made by her).\n\nAdvertisement\n\nRelated Article The Weekly Special The Weekly Special: Subi cantina opens; truffle season returns; winter escapes to Rotto The clientele reflects the multicultural, upwardly population that inhabits the City of Canning’s golden triangle of Rossmoyne, Willetton and Lynwood. Mum, dad and the two kids are out celebrating exam success. Dates and double dates unfold around me. Lubricated by an armful of BYO fizz, a party of 10 is making the most of its Friday night out. Two straight-talking desserts reiterate Little Gan’s democratic nature. Fluffy Basque cheesecake is great as far as baked cheesecakes go, but lacked the wobble found in the genre’s Premier League specimens. No such qualms with the lithe muscovado tart though, its jiggly mahogany custard made hench by the richness of unrefined cane sugar. While this essay’s subject matter is a single address, the truth is that Foo Wahs and (potential) Little Gan’s exist in almost every postcode. Sometimes they’re a proudly un-gourmet fish and chipper. Other times they’re an increasingly regional-specific eatery where the tables are undressed, but the social fabric is strong. All are in various stages of flux and evolution as they try to balance the needs and aspirations of management with those of the paying public. Success happens when both parties meet in the middle.\n\nAdvertisement\n\nLittle Gan’s is a deeply likeable – and deeply delicious – example of a multigenerational family restaurant successfully entering its second act. One reason for this smooth transition is longevity. When you convert restaurant years to human years, a quarter of a century is a lifetime. The other, I think, is support. Not just from customers, but from loved ones. Jocelyn and Steven might have hoped Richard would take after them and his eldest brother and become an accountant. But once they realised his dream was somewhere else, they quickly changed theirs. “I would like my children to be themselves and not have any regrets,” says Jocelyn. “I want them to be able to say that they did what they did because they wanted to, not just because mum and dad told them to.” The low-down Atmosphere: a likeable neighbourhood eatery delivering a neat take on the suburban, family-run Chinese restaurant. Go-to dishes: prawn linguine, miso eggplant. Drinks: a surprisingly contemporary cross-section of classic and new-wave wines, although the glass pours aren’t quite as exciting as what’s by the bottle. BYO is also available ($15 per bottle). Cost: about $140 for two people. Good Food reviews are booked anonymously and paid independently. A restaurant can’t pay for a review or inclusion in the Good Food Guide.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/mystery-lagoon-leak-leaves-south-bank-beach-closed-with-no-reopening-date-20250619-p5m8tx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mystery lagoon leak leaves South Bank beach closed, with no reopening date",
        "publish_date": "Fri, 20 Jun 2025 11:29:22 +1000",
        "category": "finance",
        "authors": [
            "Catherine Strohfeldt"
        ],
        "text": "The lagoon at South Bank is empty again, with investigators yet to find where the 33-year-old pool has been leaking and no time frame given for when it will reopen.\n\nThe Streets Beach pool was closed and drained on March 3, while the government-owned organisation that managed the 42-hectare precinct, South Bank Corporation, investigated a water leak and completed repair works.\n\nThe artificial beach remained closed but was refilled several weeks ago, but management drained it again on Monday.\n\nThe Streets Beach lagoon at South Bank has been closed and drained for a second time this year while management investigates a leak. Credit: Catherine Strohfeldt\n\nA South Bank Corporation spokeswoman said the pool was still leaking.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/jason-ryles-is-swimming-with-eels-and-piranhas-20250618-p5m8lx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jason Ryles is swimming with Eels … and piranhas",
        "publish_date": "Fri, 20 Jun 2025 11:20:00 +1000",
        "category": "sports",
        "authors": [
            "Roy Masters"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Roy Masters interviews the NRL coaches, discovering out what drives them and how they approach the modern game. See all 6 stories . When Jason Ryles was appointed head coach of the Eels in July last year, a Parramatta premiership player and former club official sent me a text. Aware of my relationship with Ryles who was then an assistant at the Storm, the ex-player wrote: “Tell Jason to surround himself with his own people. That (Parramatta) river isn’t full of eels, it’s full of piranhas. He’ll kill it there if he lives by his sword.” As it transpired, Ryles’s actions suggest he instinctively reached the same conclusion. He installed Nathan Brown, his former head coach at the Dragons, as his No 1 assistant, telling this masthead, “I knew I needed more experience in the coaching group. Brownie was available, he was my coach at the Dragons, had also coached the Knights and Warriors and had only ever been a head coach. He’s also good with the attack. He’s complements me.” Ryles, 46, also wielded his own sword when he moved on fullback and captain Clint Gutherson and veteran prop Reagan Campbell-Gillard, as well as sidelining regular forwards Shaun Lane and Ryan Matterson. Ryles says, “The changes needed to happen but happened naturally. The fullback and front rower got longer and better money deals elsewhere. I also knew I had to regenerate the roster. The roster was older and not as fast and athletic as I wanted. I didn’t know how it would all work out but it went well in the end.” Jason Ryles with assistant coach Nathan Brown. Credit: NRL Photos It’s addition by subtraction. By releasing highly paid older players, Ryles has money in the salary cap to reward a greater number of talented youngsters. The downside is a team which can’t stay the distance with the top clubs, as demonstrated in the last two losses, 18-10 to the Panthers and 30-12 to the Bulldogs. “We can’t hang in there for the long period,” Ryles said. “We have a lot of young kids here.”\n\nAdvertisement\n\nRyles’s approach to players is similar to the legendary coach Jack Gibson who won Parramatta’s first premiership, 34 years after the club’s entry into the top league, a drought exceeded by the current one where the Eels last grand final victory was in 1986. Gibson coached by osmosis, the imperceptible assimilation of knowledge. While Ryles is not Gibson, he does encourage players to figure things out for themselves. As one of his colleagues said of Ryles time in Melbourne, “He likes to plant the seed and let it germinate in the player’s mind.” Jack Gibson during his time coaching Parramatta. Credit: Fairfax For example, I asked how he treated Zac Lomax who was signed by former coach Brad Arthur for less money than he was receiving at the Dragons because he was a winger wanting to play centre. Ryles started him there in the opening round, a humiliating 56-18 loss to the Storm but Lomax has starred for NSW as a winger and will be compensated for the money lost by leaving the Dragons via the NSWRL’s payment of $30,000 for each Origin match. “I let him work that out for himself,” Ryles said of a talented player who confused himself and must now realise he is a winger, not a centre. As for the warning to Ryles that the Parramatta river is “full of piranhas” - suggesting a club with marrow-deep grudges and a witches brew of ancient hatreds - Ryles makes it clear he quarantines himself from what are now called “external factors” and is a player’s coach. “The biggest thing for me is the support I get from Mitch (Moses) and Junior Paulo. I keep them in the loop on what I plan to do, while always getting their opinion but not compromising my relationship with the other players.” Ryles has a finely tuned sensitivity meter. He knows a coach must never under-estimate the petty jealousies in the dressing room. Clubs, such as the Rabbitohs, have imploded by the coach investing too much power in two senior players.\n\nAdvertisement\n\nGibson faced a simmering mutiny when he joined Parramatta in 1981 after the club had failed to recover from the 1977 grand final loss to the Dragons - then captained by Steve Edge. A veteran Parramatta player predicted “Jack Gibson will f--- this club”, after Gibson recruited Edge as captain, rather than giving the honour to an Eel. Gibson’s Parramatta won three successive premierships with Edge as skipper. Eels halfback Mitchell Moses. Credit: Getty Images Ryles has similar faith in his captain, saying of Moses, “We got all the options out of his contract. He’s done until the end of 2029. He’s the cornerstone of where we are going.” Although a player’s coach, Ryles is not deaf to any murmurs outside the dressing room. He says of chief executive Jim Sarantinos and football manager Mark O’Neill, “At times I can sense their nervousness at some of the decisions I’ve made but they’ve supported me.” Of the possibility of piranha sightings in the Parramatta river, he says, “I’ve experienced challenges in a couple of areas but the club knew it was ready for change.” Ryles’s journey to the top is different from all the assistants who have been working up the NRL’s food chain to head coach. Wests Tigers Benji Marshall, like Brown, went straight from playing to head coach and others, such as the Sharks Craig Fitzgibbon, had a long apprenticeship. Ryles spent the interim between playing and being an NRL assistant at the Storm and Roosters as captain/coach of the Wollongong Red Devils, 2014-15. He had his own team.\n\nAdvertisement\n\n“It was one of the hardest things I have ever done,” he says. “I don’t recommend it, if you are a front rower. But it helped me enormously because I had to do everything, from putting the witches hats out to dropping players. I had to do all that while being captain, calling the shots and putting my head into the scrum.” An NRL assistant is excused from performing one of a head coach’s most difficult duties – staring a player in the eye and demoting him to reserve grade. “I’ve drawn on that Wollongong experience when dropping players,” he says, perhaps explaining why he can sensitively deliver bad news in an era when players resemble Ming vases – precious commodities that shatter when dropped. Ryles’s empathy with players is also born of his own disappointments. “Wayne (Bennett) moved me on (from the Dragons in 2009) and then I got moved on by the Roosters (in 2011).” In the middle year (2010), the Dragons won the premiership, beating his Roosters. He then joined the Storm but a hamstring injury ruled him out of Melbourne’s 2012 victory. Melbourne coach Craig Bellamy with Ryles in 2020. Credit: Getty Images He went to Melbourne, he says, “to play with Smithy.” If learning under hooker Cameron Smith, the NRL’s most capped player made Melbourne the place to be, it is also the club to be tutored by, as he says, “the greatest coach ever” (Craig Bellamy). To follow Bellamy who has “put all the systems in place” was the principal reason he agreed to return to the club as a head coach in waiting, after rejecting an offer to coach the Dragons. The Dragons claim to have cooled on Ryles when, during negotiations for a five-year contract, the possibility of a pay-out after year three was raised. Ryles says, “I haven’t heard that. Maybe that’s more to do with George (Mimis, his manager). The reason I went back to Melbourne was it was there. They thought Craig was getting closer to the end. If Melbourne wasn’t on offer, I would have gone to the Dragons.” As it transpired, Bellamy will coach into his 24th season in 2026.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/gold-prospectors-incredible-find-in-remote-aussie-bush-amazed-010331213.html",
        "title": "Gold prospector's incredible find in 'remote' Aussie bush: 'Amazed'",
        "publish_date": "2025-06-20T01:03:31Z",
        "category": "finance",
        "authors": [],
        "text": "Locals have known about the secret site for over a century, but interest has quietly been growing online.\n\nAn Aussie prospector has pulled gold nuggets out of the ground, and found old relics like a silver-plated bobby pin, and even old coins. But the most remarkable thing he’s ever stumbled across is an ancient ruin in the bush.\n\n“Locals have always kept quiet about it, and it’s pretty remote,” prospector Bart van Uyen told Yahoo News after an expedition to photograph the site. The structure’s symmetrical brick walls tower over three metres from the ground, almost resembling an Aztec temple. However, it's never had a mythological use — its purpose was purely industrial.\n\nBack in 1887 when the walls were built, a large wheel was placed between them, and when it spun, it powered the Bendigo and Fryers Goldmining Company’s large stamp battery — a device used for crushing ore to extract gold.\n\nRelated: ⚱️ Aussie prospector reveals secret maps to find fortune\n\nHow the prospector stumbled upon the ruin\n\nYou won’t find the Mopoke Gully water wheel in tourist brochures. But locals living close by, in a tiny town south of Castlemaine in Victoria, know where to find it. And in recent years, a few online posts have popped up about its history. Yahoo has chosen not to publicise its exact location.\n\nADVERTISEMENT\n\nBart has been visiting the ruin for a few years, and it has a special place in his heart. When he first saw it, much of the state had been locked down due to the Covid-19 pandemic, and stumbling upon something so unexpected while he was searching for gold left him “amazed”.\n\n“I was travelling around doing some prospecting. I tend to go down every dirt track possible, and it was just sitting there,” he said.\n\nBart spoke to Yahoo News after returning from a trip to photograph the Mopoke Gully water wheel. Source: Golden Triangle Nugget Hunter\n\nThe structure is similar to the better-known Garfield water wheel, which attracts history buffs from around the country. That one is in a state park, while the Mopoke Gully water wheel is on private land which Bart has permission to enter. Both structures were built in 1887, but the wheels themselves were disassembled in the early 1900s.\n\nIt’s seen better days, and it’s covered in moss, but that’s all part of its charm. “Standing inside it is awesome, it’s such an impressive thing. There’s gorgeous bushland around it. “It’s great to see something like that still intact,” he said.\n\nADVERTISEMENT\n\nBart likes to imagine what life was like back in the gold rush, and their work ethic and sense of adventure leave him in awe.\n\n“It’s quiet there now. But I just imagine the hustle and bustle around that place when it was going,” he said. “People risked life and limb to come to Victoria to dig for gold. People died, others made money, some went broke.”\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-drivers-face-fines-of-up-to-3000-from-major-road-rule-change-just-days-away-040352084.html",
        "title": "Aussie drivers face fines of up to $3,000 from major road rule change just days away",
        "publish_date": "2025-06-19T04:03:52Z",
        "category": "finance",
        "authors": [],
        "text": "Cameras have been silently monitoring driver behaviour since their installation, but now they're being flicked into enforcement mode.\n\nAverage speed cameras will be switched into enforcement mode in two high-risk NSW spots from July 1. Source: AAP/Daily Telegraph/NSW govt\n\nDrivers in the country's most populous state are being urged to slow down and take notice, with a major shift in road safety enforcement just days away.\n\nFrom July 1, average speed cameras at two NSW locations will switch from trial to active enforcement mode, and the consequences for speeding could be severe, with fines of up to $2,959 for light vehicles and the loss of six demerit points.\n\nThese cameras calculate a vehicle’s average speed over a monitored road section rather than capturing speed at a single point. The system works by recording a vehicle’s entry and exit times at two points, then calculating whether the average speed exceeds the limit.\n\nThe cameras are positioned on two key routes: The Pacific Highway, along a 15 km stretch between Kew and Lake Innes on the NSW Mid North Coast, and on the Hume Highway, along a 16 km stretch between Coolac and Gundagai in the state's south. These are the only average speed cameras in NSW to date that will lead to fines for light vehicles, all other locations around the state monitor the speed of heavy vehicles only.\n\nADVERTISEMENT\n\nTransport for NSW (TfNSW) says the aim is to \"prevent speeding and reduce lives lost and serious injuries on the road network\". According to NSW legislation, penalties vary depending on the severity of the offence and the posted speed limit.\n\nA breakdown of NSW speeding fines for light vehicles\n\nExceed speed limit by 10 km/h or less\n\nUnrestricted licence: $145 fine, 1 demerit point\n\nLearner or P1/P2 licence: $145 fine, 4 demerit points\n\nExceed speed limit by over 10 km/h but not more than 20 km/h\n\nUnrestricted licence: $334 fine, 3 demerit points\n\nLearner or P1/P2 licence: $334 fine, 4 demerit points\n\nExceed speed limit by over 20 km/h but not more than 30 km/h\n\nAll drivers: $574 fine, 4 demerit points\n\nExceed speed limit by over 30 km/h but not more than 45 km/h\n\nAll drivers: $1,097 fine, 5 demerit points\n\nExceed speed limit by over 45 km/h\n\nAll drivers: $2,959 fine, 6 demerit points\n\nThese penalties apply outside of double demerit periods. Fines are also higher if drivers are caught speeding in a school zone. It's understood that fine amounts are also likely to increase from July 1, in line with the Consumer Price Index (CPI). The current list of speeding penalties in NSW can be viewed here.\n\nExperts say average speed cameras are one of the most effective tools for reducing speeding-related crashes. \"We’re committed to making NSW roads safer. Average speed safety cameras encourage drivers to stick to the speed limit over longer distances, not just when they see a camera,\" a TfNSW spokesperson said.\n\nWhile these cameras have been silently monitoring driver behaviour since their installation, from July 1, they’ll start issuing fines.\n\nLawyer says average speed cameras target 'everyday driver'\n\nBut prominent road lawyer Hayder Shkara told Yahoo the move may target the \"everyday driver\" who drifts between five and 10km/h over the limit while \"overtaking or distracted\" and not the hoon putting lives at risk.\n\nADVERTISEMENT\n\n\"Average speed enforcement doesn’t target the hoon doing 130 in a 60 zone who brakes when they see a cop,\" he said. \"This can penalise minor, unintentional lapses, especially when driving for long distances,\" he told Yahoo News. \"The blanket approach lacks nuance—something you’d expect more of if the goal is truly road safety rather than punishing drivers.\"\n\n\"I also think the average speed cameras may encourage drivers to become overly fixated on maintaining speed rather than focusing on overall safety, like adjusting to conditions or anticipating hazards.\"\n\nLetters have already gone out to residents in affected areas, warning them of the change. The NSW government has also published notices across its website and social media, but many drivers remain unaware. With enforcement beginning July 1, motorists are advised to check their regular routes and ensure they’re sticking to the limit.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]