[
  {
    "url": "https://www.9news.com.au/national/inflation-australia-cpi-december-2025-abs-data-interest-rates-predictions/9a98d32e-bcec-48d6-ae84-f3cae992c5f2",
    "title": "'Locked and loaded': The three words no Aussie wanted to hear",
    "publish_date": "Wed, 28 Jan 2026 02:11:25 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "Millions of homeowners are firmly at risk of being hit by an interest rate hike next week after new inflation data came in hotter than expected.\n\nThe consumer price index (CPI) for December rose to 3.8 per cent for the past 12 months – up from 3.4 per cent in November and more than the roughly 3.5 per cent economists had expected, the Australian Bureau of Statistics announced this morning.\n\nThe trimmed mean – the Reserve Bank's preferred measure of underlying inflation – also rose to 3.3 per cent, comfortably above the central bank's target range.\n\nInflation has picked up once again. (Max Mason-Hubers)\n\nAhead of the data release, the big four banks were split as to whether the RBA will hike the cash rate next week, while the market was pricing in a slightly better than even chance of a rise.\n\nCommonwealth Bank﻿ and NAB are both forecasting a 25-basis-point increase next week, while Westpac and ANZ have predicted a hold.\n\nFollowing the fresh figures, Bank of Queensland﻿ chief economist Peter Munckton said a hike appears likely.\n\n\"Almost all the main CPI measures are comfortably above the RBA's target band,\" he said.\n\n\"This is also consistent with the message from the level of inflation expectations of both firms and consumers.\n\n\"Both the press conference post the December meeting as well as the minutes of that meeting suggest the RBA was becoming increasingly concerned about inflation.\n\n\"Since then, we have found out that inflation ended the year higher than RBA forecasts and above target...\n\n\"A quarter percentage point cash rate hike will likely be locked and loaded for the February meeting.\"\n\nZyft consumer finance expert Joel Gibson said a rate rise would be a significant blow to household budgets.\n\n\"﻿Aussies were spending $178 per week on groceries in August 2025, but with today's CPI figures in mind, inflation will add another $6 a week to the trolley, or $312 across the course of the coming year,\" he said.\n\nREAD MORE: David Littleproud to face leadership spill after splitting Coalition ﻿\n\nAn interest rate hike would add $115 a month to an average mortgage payment. (Joe Armao/The Age)\n\n\"This trolley hit is even more severe when you look at the essentials: coffee, tea and cocoa are up 15.3 per cent, while proteins like lamb and goat have jumped 13.4 per cent, and beef and veal have risen 10.8 per cent.\n\n\"And if we get a rate rise, a 0.25 per cent hike could add another $115 to the monthly repayment on an average $694,000 mortgage.\n\n\"All of these increases combined would mean an average Australian household should stand to shell out an additional $2192 over the course of this year.\"\n\nThe RBA will hand down its next interest rate decision on Tuesday.﻿\n\nNEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/finance/australian-dollar-hits-three-year-high-of-70-us-cents/4e4f2855-1dd7-43c4-9c82-94e4e52f96aa",
    "title": "Australian dollar cracks 70 US cents on climb to three-year high",
    "publish_date": "Tue, 27 Jan 2026 23:09:43 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "The Australian dollar has surged overnight to its highest level against its US counterpart since February 2023, driven by a plunge in the greenback.\n\nThe Aussie currency was buying US70.11 cents earlier today after climbing 1.4 per cent.\n\nIt hit the mark in the lead-up to the release of new inflation figures today, expected at 11.30am.\n\nThe Australian dollar has hit a three-year high against the US dollar. (Picture:Wayne Taylor/AFR) (Wayne Taylor)\n\nThe Reserve Bank of Australia is tipped to lift interest rates at its meeting next week if there is a larger-than-expected increase in consumer prices.\n\nIG market analyst Tony Sycamore told the Australian Financial Review that geopolitical uncertainty and a falling greenback were behind the spike in the Aussie dollar.\n\n\"The Australian dollar's gains continued to be driven by a number of factors, including broad-based weakness in the US dollar which has accelerated post last weeks Greenland drama's and is now poised for a perilous break lower,\" he said.\n\nOn Tuesday (US Eastern Time) the US dollar recorded its lowest one-day drop since last April after US President Donald Trump said he was not concerned about its recent falls, reports Reuters.\n\n\"I think it's great,\" he said, when asked if the US dollar's value had declined too much.\n\n\"The dollar's doing great.\"\n\nIt finished Tuesday at a four-year low.﻿\n\nNEVER MISS A STORY: Get your breaking news and exclusive stories first by following us across all platforms.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/nipah-virus-outbreak-west-bengal-india-symptoms-cure-treatment-what-it-does/c78d27d4-2a7a-45fc-8779-9d00ee7f89fb",
    "title": "Untreatable, usually fatal virus detected in India",
    "publish_date": "Wed, 28 Jan 2026 00:31:04 +0000",
    "category": "lifestyle",
    "authors": [
      "Jan"
    ],
    "text": "Airports across Asia are bringing in tighter screening measures after an untreatable and usually fatal disease was detected in India .\n\nTwo people have contracted Nipah virus , a zoonotic illness spread by fruit bats.\n\nAnother 196 contacts have been tested for the disease in West Bengal province, the Minister of Health said in a statement.\n\nNipah virus is frequently fatal and can leave survivors with brain damage. (NIAID)\n\n\"A total of 196 contacts linked to the confirmed cases have been identified, traced, monitored, and tested,\" the statement read.\n\n\"All traced contacts have been found asymptomatic and have tested negative for Nipah Virus Disease.\n\n\"The situation is under constant monitoring, and all necessary public health measures are in place.\"\n\nBetween 40 and 75 per cent of people infected by the virus do not survive, the UK Health Security Agency said.\n\n\"Some survivors may be left with lasting neurological difficulties, including persistent seizures and personality changes,\" the agency said in a statement.\n\n\"In rare cases, the virus can reactivate months or even years after the initial infection.\"\n\nWhile fruit bats are natural hosts of the virus, it is capable of spreading to pigs, dogs, cats, goats, horses and sheep.\n\nThe virus can be spread from animals to humans or person-to-person via contaminated food.\n\nNipah virus is typically spread by fruit bats. (Adobe Stock)\n\nThe virus can often survive in fruit or fruit juice, which has been contaminated with the bodily fluids of infected bats.\n\nThe most common examples stem from the consumption of raw date palm sap.\n\nThere are documented cases of the spread of the virus between infected patients and those taking care of them.\n\nIn humans, symptoms typically appear between four and 21 days after infection.\n\nWhen the symptoms do appear, they can be sudden.\n\nFlu-like symptoms, fever and pneumonia can develop.\n\nBut the virus also commonly causes meningitis or encephalitis (swelling of the brain), conditions which are often fatal.\n\nThere is no vaccination or treatment for the virus.\n\nQuarantine doctors watch thermal scanning of travellers from west Bengal, India at the airport in Samut Prakarn, Thailand. (AP)\n\nPrevious outbreaks have occurred in Bangladesh , Malaysia , Singapore , the Philippines and other parts of India .\n\nHong Kong has announced that passengers arriving from India will be screened for the virus.\n\n\"Hong Kong has the ability to detect infections of unknown causes and emerging infectious diseases at boundary control points and in hospitals,\" Hong Kong's Centre for Health Protection Controller Dr Edwin Tsui said.\n\nAn earlier statement from Australia's Department of Agriculture said it was possible for virus from fruit bats to move into the country from South East Asia.\n\n\"Australia is currently free of Nipah virus, however, an incursion of this virus would have serious consequences for both animal and human health,\" the statement read.\n\n\"Over one million pigs were slaughtered in Malaysia in an attempt to control this disease.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/hecs-debt-reduction-what-do-after-paying-off-loan-how-to-stop-employer-deductions-explained/ad7cbd83-c97f-45b3-8ba6-fc37a159f10d",
    "title": "'Doesn't make any sense': Forgotten HECS detail delaying money in your pocket",
    "publish_date": "Wed, 28 Jan 2026 01:23:40 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "T﻿he federal government's 20 per cent HECS reduction scheme has resulted in some Australian taxpayers inadvertently losing unnecessary money from their paycheques.\n\nNearly three million Australians have an average of $5500 in HECS debts owing to the government – and this debt is paid off slowly through compulsory repayments.\n\nThe relief was applied to balances that were still active on June 1, 2025 and has helped some taxpayers clear their debt after years.\n\nREAD MORE: Scientists set a new time for the Doomsday Clock\n\nAround three million Australians have an average of $5,500 in HECS debts. (Getty)\n\nBut if you've forgotten to tell your employer to stop garnishing your wages for fully-paid HECS debts, you might need to act fast.\n\n﻿Director of Tax Communication at H&R Block Mark Chapman told nine.com.au that Australians who don't stop redundant repayments are essentially giving the federal government a no-strings-attached loan.\n\n\"If you do overpay, the money isn't lost, but you won't actually see it again until tax time,\" Chapman explained.\n\n\"You have to lodge your tax return, and at that point, the ATO will repay it. But that does mean that there will be quite a lengthy delay.\n\n\"You're basically just using the money to make a free loan to the government, which doesn't make any sense.\"\n\nAustralian pool manager Maddie paid off her $12,000 HECS debt late last year.\n\nShe told nine.com.au ﻿the 20 per cent reduction shaved off around $2500 from her balance, meaning she could make one voluntary payment and reduce it to zero.\n\nMaddie hasn't told her employer about paying it off yet.\n\n\"There's very little clear or accessible information about paying off HECS – especially about what steps to take once it's fully cleared,\" she said.\n\n\"﻿The lack of guidance makes it confusing and easy to miss important steps.\"\n\nShe expects a hefty tax return come June 30.\n\nMaddie paid off her $12,000 HECS debt in December 2025. (Supplied)\n\nHECS debt repayments don't automatically stop even if you log onto MyGov and find the balance has reached zero, Chapman said.\n\nYou need to fill out a tax form ﻿called a \"withholding declaration\", which indicates to your employer that you no longer have a HECS debt.\n\nIt's as simple as ticking the box ﻿\"no\" on the form when it asks if you have a Higher Education Loan Program (HELP), VET Student Loan (VSL), Financial Supplement (FS), Student Start-up Loan (SSL) or an Australian Apprenticeship Support Loan (AASL) debt.\n\nOnce this has been lodged, your next weekly, fortnightly or monthly pay will be a little bigger.\n\nThis figure will vary depending on your salary and what your regular contributions were.﻿\n\nFor example, anyone earning between $67,001 and $15,000 pays 15c for each dollar over $67000.\n\nThe HECS debt 20 per cent reductions were applied to loans last year. (Supplied)\n\n\"Say you're having $500 taken out of your salary each month to pay your HECS bill. If your HECS bill is no longer there, that $500 is paid to you in extra cash,\" Chapman added.\n\n\"If you told your employer that the HECS debt is gone, that immediately puts more money into your pocket.\n\n\"If you haven't yet, it's not something to panic about, but you should always make sure that you do actually notify your employer as soon as possible because that just makes financial sense for you.\"\n\nIf your HECS debt has reduced to a small amount, Chapman said it is important to clear it to zero before filling out the withholding declaration form.\n\nMark Chapman, Director of Tax Communications at H&R Block (Supplied)\n\n\"﻿If it is a bigger balance, that will actually cost you in terms of additional indexation,\" Chapman said.\n\n\"Your tax agent will be able to give you specific advice regarding your particular circumstances.\"\n\nMaddie said it feels like a financial burden﻿ has been lifted from her shoulders after years of compulsory payments.\n\n\"Even though I didn't finish my degree, carrying a HECS debt of over $12,000 was something that weighed on me,\" she said.\n\n\"Paying it off feels like a massive relief. I no longer feel guilty about leaving university, and mentally it feels like closing a chapter.\n\n\"Financially, it means I can focus more on travelling and future goals without the ongoing pressure of student debt hanging over me.\"\n\nThe information provided on this website is general in nature only and does not constitute personal financial advice. The information has been prepared without taking into account your personal objectives, financial situation or needs. Before acting on any information on this website you should consider the appropriateness of the information having regard to your objectives, financial situation and needs.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-28/australian-open-coco-gauff-smashed-racquet/106278048",
    "title": "Gauff backed by ex-players after smashing racquet at Australian Open",
    "publish_date": "Wed, 28 Jan 2026 02:09:15 +0000",
    "category": "sports",
    "authors": [],
    "text": "Former men's world number one Andy Roddick is among the ex-players supporting Coco Gauff after footage was shown of her smashing a racquet at the Australian Open.\n\nGauff had just left Rod Laver Arena after her 6-1, 6-2 quarterfinal loss to Elina Svitolina when the TV broadcast caught the American venting her frustration inside the Melbourne Park facility.\n\nThe two-time major champion told her post-match media conference players deserved privacy after they came off court.\n\n\"I tried to go somewhere where they wouldn't broadcast it, but obviously they did,\" Gauff said.\n\n\"Maybe some conversations can be had, because I feel like at this tournament the only private place we have is the locker room.\"\n\nABC Sport has approached Australian Open organisers for comment.\n\nGauff calls for greater privacy after clip goes viral Coco Gauff loses her cool in the tunnels of Melbourne Park, only for it to be broadcast around the world on live TV.\n\nRoddick said Gauff should have been afforded a moment in private where she could deal with the loss immediately after leaving the court.\n\n\"Can she go somewhere, where she can just detonate?\" he said on his podcast Served with Andy Roddick.\n\n\"Can she just be allowed to be pissed? Also can be there a unisex place for people to have private conversation and/or break something?\"\n\nRetired Australian professional John Millman also showed support for Gauff.\n\n\"Maybe there should be a room where you can do that privately, where the cameras aren't,\" Millman said on the Nine Network.\n\n\"But let's not blow this out of proportion. She was letting off a bit of steam because she was hugely frustrated with her performance.\n\n\"I just think that is normal behaviour.\"\n\nCoco Gauff told reporters players deserved privacy. (Getty Images: Robert Prange)\n\nTood Woodbridge, who won 16 majors in doubles, said players needed some leeway, given the emotion toll a loss could take.\n\n\"I'm sure she's pretty upset about having that out there,\" he said.\n\n\"It does show the emotion that she cares but it's not a great look. I've done it and you don't feel good about doing it.\n\n\"But I would like to think they [players] can get off the court and go somewhere, where there isn't a camera.\"\n\nGauff said she would never smash a racquet on court during a match because it was not a \"good representation\" and children could be watching.\n\nThe women's world number three also said she did not want to lash out at her support team.\n\n\"They're good people. They don't deserve that and I know I'm emotional,\" Gauff said.\n\n\"I know I need to let out that emotion.\n\n\"Otherwise, I'm just going to be snappy with the people around me and I don't want to do that … they did their best, I did mine.\"",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-28/brisbane-house-prices-forecast-increase-2026/106277456",
    "title": "Brisbane house prices forecast to rise by 20pc in two years, report finds",
    "publish_date": "Wed, 28 Jan 2026 01:19:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Brisbane's scorching property market shows no signs of abating, with house prices projected to rise by almost 11 per cent this year, a new report has revealed.\n\nKPMG's residential property outlook forecast tipped Queensland's capital as the second strongest performer for 2026, behind Perth.\n\nHouse prices are forecast to rise 10.9 per cent this year and 8.9 per cent in 2027.\n\nUnit prices are also projected to increase by 7.8 per cent this year and 4.9 per cent the next.\n\nThe numbers predict Brisbane as the second-highest performer this year, with only Perth expected to see higher growth. (Supplied: KPMG)\n\nKPMG chief economist Dr Brendan Rynne said strong growth in the first half of 2025 should have moderated due to affordability constraints.\n\n\"But instead, the second half of last year accelerated growth further, especially in already overheated cities Perth and Brisbane, supported by the expanded 5 per cent deposit scheme,\" Dr Rynne said.\n\n\"Despite the fact there aren't enough houses being built, buyers in these cities are prepared to pay more than the supply shortage would justify.\n\n\"As a result, at the entry level, the market will continue outperforming this year, with more young people seizing the opportunity to break the rent cycle and lock in their first home sooner, intensifying competition at the affordable end and ensuring prices remain firm.\"\n\nBrendan Rynne says population growth is making housing supply shortages more severe. (ABC News: Scott Jewell)\n\nAccording to the latest Cotality figures, Brisbane's median home value was $1,036,323 in December, increasing 1.6 per cent in the month alone, and more than 14 per cent for the year.\n\nDr Rynne said south-east Queensland's population growth was exacerbating supply constraints.\n\n\"More and more people are making the move to Brisbane, but as with most other cities, housing supply has not kept pace, amplifying cost pressures.\n\n\"As a result, Brisbane's growth is expected to continue for the foreseeable future\".\n\nTreasurer defends scheme for first-time buyers\n\nThe report noted that part of the market's growth was driven by the federal government's 5 per cent deposit scheme.\n\nIt enables first home buyers to purchase a property with just a 5 per cent deposit and not pay costly Lenders Mortgage Insurance (LMI), with the Commonwealth acting as a guarantor.\n\nQuestioned on whether it's fuelling dwelling price increases, Treasurer Jim Chalmers defended the initiative.\n\n\"It's a really important program which is about making it easier for first-time buyers to get a toehold in the market,\" he said.\n\n\"It operates alongside a number of very substantial efforts that we're making to build more homes as well, so that there are more affordable options in the market.\"\n\nJim Chalmers has defended the federal government's 5 per cent deposit scheme. (ABC News: Ian Cutmore)\n\nThe Commonwealth's National Housing Accord sets a target of 1.2 million new well-located homes by mid-2029.\n\n\"We're working very closely with the states and local governments on planning and zoning, we're trying to make the sector more productive,\" Mr Chalmers said.\n\n\"We haven't made sufficient progress as a country over the last decade or so when it comes to building new homes and we're doing our best, to turn that around.\"\n\nGovernment 'hell-bent' on increasing supply\n\nPremier David Crisafulli said the government was squarely focused on increasing supply.\n\nQueensland property market surges ahead Brisbane's housing market remains one of the strongest in the nation, with prices up 1.6 per cent in December.\n\n\"There's no doubt there's real confidence at the moment in the Queensland property market,\" he said.\n\n\"But the problems we're seeing is because of a lack of supply that hasn't been delivered for a long time.\n\n\"And whilst it won't change overnight, we are hell-bent on making sure that there are more options for people to get into a home, and whether that's buying their first home, being able to afford their rent, or putting a roof over the head of the disadvantaged.\"\n\nThe report noted the main downside risk to its outlook was the growing affordability constraints facing first-home buyers.\n\nNationally, the KPMG report projected house values to increase by 7.7 per cent, despite ongoing speculation on the central bank's movements.\n\nThe Queensland government has committed to building one million new homes, including 53,000 social and affordable homes, by 2044.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-28/inflation-ahead-of-rba-rate-decision-december-quarter-cpi/106277748",
    "title": "Breaking: Inflation hotter than forecast at end of 2025",
    "publish_date": "Wed, 28 Jan 2026 00:52:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "Repayments on mortgages and debts are more likely to increase, after a higher-than-expected Inflation result puts pressure on the Reserve Bank to lift interest rates in response next week.\n\nThe speed of annual prices rises accelerated at the end of 2025, picking up more than forecast and adding to expectations of rate hikes — which the central bank uses to lower the temperature of the economy.\n\nThe Consumer Price Index (CPI) rose 3.8 per cent annually in December, up from 3.4 per cent in the year to November, according to the Australian Bureau of Statistics (ABS).\n\nIn the month, the CPI rose 1 per cent.\n\nThe trimmed mean, a measure of underlying inflation, rose 3.3 per cent annually in December, up from 3.2 per cent a month earlier.\n\nThe RBA's interest rate setting board will deliver its first decision of 2026 this coming Tuesday.\n\nRate hike now more likely\n\nEconomists and analyst tend to agree that the 'hot' result makes it more likely the Reserve Bank will increase the cost of money.\n\nThe RBA sets a key interest rate, which repayments on mortgages and debts are then calculated on.\n\nBecause it wants prices to rise only between 2 to 3 per cent every year — what it calls the 'target band' — this new data showing inflation well above that will be influential in their decision-making.\n\nCaptial Economics Abhijit Surya says the sharper-than-expected rise in makes it \"all but certain that the Reserve Bank of Australia will raise interest rates at its meeting next week\".\n\nWhat he calls \"shelter inflation\" — the cost of housing — continues to pick up. Rental inflation lifted from 3.8 per cent to 4 per cent, its first increase in seven quarters. And inflation in the cost of new dwellings rose from 0.9 per cent to 2.5 per cent, its highest level in a year.\n\n\"With the housing market still running hot, shelter inflation is likely to rise further in the months ahead,\" he added.\n\nBDO chief economist Anders Magnusson suggests the Reserve Bank is now \"primed\" to lift interest rates.\n\nHe says the result \"reinforces the message from the September quarter\" that underlying price pressures are proving more persistent than expected.\n\n\" With inflation now overshooting the Bank's forecast for two consecutive quarters, the likelihood of a rate hike has increased substantially. Markets were already pricing a significant chance of tightening, and today's result will only strengthen that expectation. \"\n\n(Tightening means increasing the cost of money. By lifting interest rates, the repayments on money owed go up).\n\n\"It's important to note that the RBA does not shift into a tightening cycle lightly. If the Bank does move to raise rates next week, it would signal that it sees long-term inflation dynamics emerging, not just a temporary overshoot. That would mark a meaningful shift in the monetary policy cycle.\"\n\nWhat did it? Lots of things, but mainly housing\n\nThe largest contributors to annual inflation over the last 12 months were housing (+5.5 per cent), food and non-alcoholic beverages (+3.4 per cent), and recreation and culture (+4.4 per cent), the ABS said.\n\nThe timing of electricity rebates continued to have an impact on the data. Electricity costs rose 21.5 per cent in the year to December, up from 19.7 per cent a month earlier, which the ABS said was largely due to state government rebates being used up by households in Queensland and Western Australia.\n\nExcluding the impact of Commonwealth and state rebates in the past year, electricity prices rose 4.6 per cent in the 12 months to December, unchanged from November.\n\nThe Reserve Bank raised concerns when inflation moved back above the mid-point of its 2–3 per cent target band in the back half of 2025, but deputy governor Andrew Hauser earlier this month told ABC News the central bank takes a one-to-two-year view on inflation.\n\nThe ABS also released quarterly data, which is a longer-term data series closely monitored by the central bank and economists.\n\nThe CPI showed prices rising 0.6 per cent in the December quarter, or 3.6 per cent annually. The quarterly figures eased back from 1.3 per cent in the prior quarter, but rose on a yearly basis.\n\nThe quarterly trimmed mean came in at 0.9 per cent for the quarter, above forecasts of economists polled by Reuters. That saw the annual trimmed mean pick up to 3.4 per cent in the quarter.\n\nAhead of the CPI release, market pricing indicated around a 60 per cent chance of a rate hike next week.\n\nMore likely than not: economist\n\nThe top economist at RSM Australia, Devika Shivadekar, puts it at 55:45: meaning more likely there will be a hike than a hold.\n\n\"Today's data supports a narrative of uneven but moderating inflation, where pockets of price pressure persist, yet the broader trajectory continues to grind lower rather than justify an imminent policy response\" she says, in a statement responding to the data.\n\n\"The RBA's patience may be wearing thin. A February hike cannot be ruled out if the Board judges that establishing a firmer policy stance early in the year is preferable, even if followed by a prolonged period on hold.\n\nShe sees it as a \"narrow call\", around a 55:45 proposition.\n\n\"With the RBA potentially opting to move pre-emptively and hike now rather than risk having to tighten more forcefully later.\"",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-28/vine-won-tour-down-under-with-broken-wrist-after-kangaroo-crash/106277862",
    "title": "Vine won Tour Down Under with broken wrist after kangaroo crash",
    "publish_date": "Wed, 28 Jan 2026 00:48:05 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's Jay Vine won the Tour Down Under with a fractured wrist that will now sideline him from racing.\n\nVine was hurt after being caught up in a crash involving two kangaroos during the final stage of the Tour in Adelaide and its surrounds last Sunday.\n\nThe 30-year-old had surgery on Tuesday and will miss this weekend's Cadel Evans Great Ocean Race.\n\nVine's UAE Team Emirates-XRG said a timeline for the Australian's return remained unknown.\n\n\"After the race Jay reported pain in his wrist from his crash during the final stage,\" team medical director Adrian Rotunno said on Wednesday.\n\n\"After medical review, it was found that he sustained a significant left wrist scaphoid fracture and underwent successful surgery on Tuesday morning.\n\n\"He will be withdrawn from competition for post-op recovery and rehabilitation.\"\n\nKangaroo causes crash chaos as Jay Vine taken out on final TDU stage Jay Vine was taken out by a pair of kangaroos and lost yet another teammate to injury, but was still able to hang on and claim a second career Tour Down Under victory.\n\nVine was among several riders who crashed when two kangaroos jumped on to the course with about 95 kilometres remaining on the Tour's last stage.\n\nHe needed a bike change as a result but continued on to claim his second Tour triumph, repeating his 2023 feat.\n\n\"All the Europeans ask me what's the most dangerous animal in Australia — I always tell them it's the kangaroos,\" Vine said after his victory.\n\n\"They wait in the bushes until you cannot stop and then they jump out in front of you.\"\n\nThe Tour Down Under was the opening event of the 2026 World Tour, which continues on Sunday with the Great Ocean ‍Road Race in Victoria.\n\nThe weekend men's and women's events will go ahead despite extreme heat and bushfire risks forcing organisers to cancel the Surf Coast Classic races in Victoria scheduled for Wednesday and Thursday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-28/australian-open-live-blog-day-11-%C5%9Bwi%C4%85tek-djokovic-sinner/106277086",
    "title": "Live: Rybakina in control over six-time major winner Iga Świątek",
    "publish_date": "Tue, 27 Jan 2026 23:58:25 +0000",
    "category": "sports",
    "authors": [
      "Simon Smale",
      "Andrew Mcgarry"
    ],
    "text": "(Getty Images)\n\nBlimey, service games are harder to hold onto than an icy pole during yesterday's Melbourne Park furnace out there at the moment.\n\nThree break points earned for Świątek straight away.\n\nRybakina serves an ace to save one of them.\n\nŚwiątek went long with a return to lose the next.\n\nAnd then another unreturnable serve cancels out the third.\n\nThat's so good from Rybakina — she needed to step up with her first serve there and she finally delivered with it.\n\nBut perhaps it was too good to be true — a double fault wipes out game point for Rybakina and then she offers Świątek another look at the second serve — only for the Polish player to find the net.\n\nAnd then she goes long to hand Rybakina a hard-fought game.\n\nWe're back on serve.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-28/diamonds-name-squad-jamaica-series-commonwealth-games/106277330",
    "title": "Diamonds bolster defence for Jamaica series as Commonwealth Games loom",
    "publish_date": "Tue, 27 Jan 2026 23:54:50 +0000",
    "category": "sports",
    "authors": [],
    "text": "Defender Matilda Garrett has been summoned to Australia's netball squad for the looming three-Test series against Jamaica.\n\nThe Adelaide Thunderbird is among a 12-strong squad for next month's series picked by coach Stacey Marinkovich after a training camp in Canberra.\n\nGarrett bolsters Marinkovich's defensive options after Sunday Aryang suffered a torn anterior cruciate ligament in her knee in the Diamonds' most recent Test against New Zealand on October 29.\n\nThe world number one Australians host number three Jamaica in a series starting in Adelaide on February 5, with Tests in Perth (February 8) and Melbourne (February 11) to follow.\n\nCoach Marinkovich was eager for the Diamonds to return to action ahead of the highlight of their netball calendar, the Commonwealth Games in Glasgow starting in late July.\n\n\"Coming up against Jamaica will be a significant test as we continue to build towards this year's pinnacle event, the Commonwealth Games,\" Marinkovich said.\n\n\"This team was selected at a training camp at the AIS in Canberra, where the squad continued to challenge each other while driving training standards.\n\n\"After a strong international Test series against South Africa and New Zealand last year, I am excited to see what the team can bring out onto the court.\"\n\nCaptain Liz Watson is set for a rare milestone during the Jamaica series — if she features in all three games, she will become just the sixth Australian to play 100 Tests.\n\nLiz Ellis (122), Sharelle McMahon (118), Cath Cox (108), Vicki Wilson (104) and Caitlin Bassett (102) are the others.\n\nAustralia squad: Liz Watson (capt), Kiera Austin, Courtney Bruce, Sophie Dwyer, Sophie Garbin, Matilda Garrett, Georgie Horjus, Sarah Klau, Cara Koenen, Kate Moloney, Jamie-Lee Price, Joanna Weston\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-28/tiktok-settles-meta-youtube-face-trial-social-media-addiction/106277142",
    "title": "TikTok settles as social media giants face trial over youth addiction claims",
    "publish_date": "Tue, 27 Jan 2026 23:22:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "TikTok has agreed to settle a landmark lawsuit on social media addiction, according to one of the plaintiff's lawyers, the same day the trial was due to start against Meta and YouTube.\n\nTerms of the settlement reached in a California court on Tuesday, local time, were not disclosed.\n\nTikTok is one of four companies — including Meta, Snap and YouTube, which is a unit of Alphabet-owned Google — facing allegations that their platforms are fuelling a youth mental health crisis.\n\nSnap settled the case last week for an undisclosed sum.\n\nThe case involves a 19-year-old from California, identified as KGM, who said she became addicted to the companies' platforms at a young age because of their attention-grabbing design, according to court filings.\n\nShe blames her depression and suicidal thoughts on the apps she used and is seeking to hold the companies that designed them responsible.\n\nYouTube, along with Meta, is facing trial over the social media addiction lawsuit. (ABC News: Ian Cutmore)\n\nKGM \"reached an agreement in principle to settle her case\" with TikTok, said Joseph VanZandt, a lawyer for KGM.\n\nTikTok did not immediately respond to requests for more details about the settlement.\n\nSnap settled with KGM on January 20. A Snap spokesperson and the plaintiff's attorneys declined to provide details about that agreement.\n\nKGM's case is one of three scheduled test cases, known as bellwether trials, chosen from hundreds of related lawsuits accusing the platforms of harming youth.\n\nThe outcome of her lawsuit could help determine how the other cases are handled.\n\nJoseph VanZandt, co-lead counsel for the plaintiff, said in a statement on Tuesday that TikTok remained a defendant in the other personal injury cases, and that the trial would proceed as scheduled against Meta and YouTube.\n\nMark Zuckerberg is expected to testify in the trial. (AP: Godofredo A. Vásquez)\n\nThe trial against the two social media giants was scheduled to begin with jury selection on Tuesday, local time, in the California Superior Court in Los Angeles.\n\nIt is the first time the companies will argue their case before a jury, and the outcome could have profound effects on their businesses and how they will handle children using their platforms.\n\nUS and China sign off on TikTok agreement to avoid ban Social media giant TikTok has reached a deal for a new joint venture in the United States to avoid being banned for American users. The platform's Beijing-based parent company ByteDance will retain a 19.9 per cent stake in the company.\n\nThe selection process is expected to take at least a few days, with 75 potential jurors questioned each day through until at least Thursday.\n\nThe lawsuit says the social media companies borrowed \"heavily from the behavioural and neurobiological techniques used by slot machines and exploited by the cigarette industry\".\n\n\"Defendants deliberately embedded in their products an array of design features aimed at maximising youth engagement to drive advertising revenue,\" the lawsuit says.\n\nExecutives, including Meta CEO Mark Zuckerberg, are expected to testify at the trial, which will last six to eight weeks.\n\nExperts have drawn similarities to the Big Tobacco trials that led to a 1998 settlement requiring cigarette companies to pay billions in healthcare costs and restrict marketing targeting minors.\n\n\"Plaintiffs are not merely the collateral damage of defendants' products,\" the lawsuit says.\n\n\"They are the direct victims of the intentional product design choices made by each defendant.\n\n\" They are the intended targets of the harmful features that pushed them into self-destructive feedback loops. \"\n\nThe tech companies dispute the claims that their products deliberately harm children, citing a bevy of safeguards they have added over the years and arguing that they are not liable for content posted on their sites by third parties.\n\nA Meta spokesperson said in a statement on Monday the company strongly disagreed with the allegations outlined in the lawsuit and that it was \"confident the evidence will show our longstanding commitment to supporting young people\".\n\nJosé Castañeda, a Google spokesperson, said on Monday that the allegations against YouTube were \"simply not true\".\n\nIn a statement, he said \"providing young people with a safer, healthier experience has always been core to our work\".\n\nThe case will be the first in a slew of lawsuits beginning this year that seek to hold social media companies responsible for harming children's mental wellbeing.\n\nReuters/AP",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-28/asx-markets-business-live-news/106276952",
    "title": "Live: ASX falls on inflation news, dollar drops below 70 cents to USD",
    "publish_date": "Tue, 27 Jan 2026 21:09:10 +0000",
    "category": "finance",
    "authors": [
      "Jason Dasey",
      "Daniel Ziffer",
      "David Chau",
      "Stephanie Chalmers"
    ],
    "text": "This result is seen as key for the Reserve Bank's decision, next week, about changing the cost of money.\n\nThat interest rate call is influenced by inflation - the speed of price rises, an indication of too much \"heat\" in the economy.\n\nAlso factoring in, the unemployment rate, our housing market and much more. But inflation is key.\n\nHere's Devika Shivadekar, the top economist at RSM Australia,with her thoughts. Some good stuff in here:\n\n\"December's CPI print confirms inflation remains sticky rather than re-accelerating, but the details matter.\n\n\"Headline inflation lifted to 3.8% year-on-year, driven largely by housing and discretionary services, while the trimmed mean edged higher to 3.3%, signalling only a marginal firming in underlying pressures.\n\n\"Housing inflation (5.5%) continues to do the heavy lifting, though this is overwhelmingly an electricity story rather than broad-based cost escalation. Once government rebates are stripped out, electricity prices rose a modest 4.6% over the year, unchanged from November and consistent with annual retailer price resets rather than fresh inflationary momentum.\n\n\"Rent inflation continued to ease (3.9%), reflecting stabilising vacancy rates, reinforcing the view that housing inflation is peaking rather than re-igniting.\n\n\"Beneath the surface, services inflation remains the key challenge for the RBA, lifting to 4.1% and reflecting strong seasonal demand rather than entrenched overheating.\n\n\"The sharp rise in recreation and culture inflation (4.4%) was driven by holiday travel and accommodation, which surged on Christmas, summer holidays and major events, while food inflation ticked slightly higher due to weather-related supply disruptions and global demand for Australian red meat.\n\n\"Importantly, the December quarter CPI rose just 0.6%, with the quarterly trimmed mean at 0.9%, consistent with gradual disinflation rather than a loss of control. Taken together, today's data supports a narrative of uneven but moderating inflation, where pockets of price pressure persist, yet the broader trajectory continues to grind lower rather than justify an imminent policy response.\n\n\"From a policy perspective, February remains finely balanced, with the trimmed mean and quarterly CPI far more decisive than labour market data. Historically, the RBA has viewed a tight labour market as a risk to the outlook rather than a direct trigger for tightening. On balance, a hold remains the more defensible outcome, particularly when domestic inflation dynamics are set against heightened and asymmetric global risks that could escalate quickly and threaten broader financial stability. This approach would still allow the RBA to strike a firmer tone in its communications, reinforcing that further tightening remains on the table should inflation prove more persistent than expected.\n\n\"That said, the RBA's patience may be wearing thin. A February hike cannot be ruled out if the Board judges that establishing a firmer policy stance early in the year is preferable, even if followed by a prolonged period on hold.\n\n\"As such, we see the February decision as a narrow call, around a 55:45 proposition with the RBA potentially opting to move pre-emptively and hike now rather than risk having to tighten more forcefully later.\n\n\"Should the RBA choose to hold, expect some stern messaging from Gov Bullock at the press conference and a hike may not be too far away.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-28/floor-collapses-at-brisbane-toll-warehouse/106272588",
    "title": "Ground caves in at Queensland's only vaccine warehouse, causing statewide shortages",
    "publish_date": "Tue, 27 Jan 2026 21:03:48 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "A section of floor has caved-in at Queensland's only vaccine warehouse, causing statewide delays to childhood vaccination schedules.\n\nPhotos obtained by 612 ABC Radio Brisbane shows part of the loading bay has collapsed and slid down a retaining wall at the Toll warehouse in Richlands.\n\nA Toll spokesperson said the \"retaining wall incident\" happened in late December 2025, prompting them to close out of safety concerns.\n\nThe fault line goes across several truck parking spots. (ABC Radio Brisbane: Kenji Sato)\n\nThe warehouse was the sole distribution centre for Queensland Health, and contained the department's entire stockpile of vaccines.\n\nThe $10 million facility was opened in 2023 as a \"cutting edge\" healthcare distribution centre.\n\nDocuments obtained by 612 ABC show vaccines are now being delivered to Queensland clinics from Victoria using coolers.\n\nA Queensland Health spokesperson said the vaccines in the Toll warehouse remained safely refrigerated, although inaccessible for the time being.\n\nThe spokesperson said clinics should not be concerned about access to vaccine stock.\n\nThe Toll warehouse was built to the tune of $10 million. (ABC NEWS: Mark Leonardi)\n\n\"Toll has temporarily relocated operations to support the Queensland vaccine program from a site in Victoria and there is currently no anticipated additional cost to taxpayers,\" the spokesperson said.\n\n​\"Sufficient vaccine stock exists through Toll's interim arrangements, and there is no cause for vaccine service providers to be concerned about access to vaccine stock.\"\n\nNot the reality on the ground\n\nMaria Boulton said doctors were having to turn parents away due to the vaccine shortages. (ABC News: Alice Pavlovic)\n\nBrisbane general practitioner Maria Boulton said the department's claims that there was \"sufficient vaccine stock\" did not reflect the reality on the ground for GPs.\n\nThe former Australian Medical Association Queensland president said her clinic was still awaiting orders for several childhood vaccines.\n\nDr Boulton said this now included vaccines for six-week-olds, four-month-olds, and six-month-olds through the National Immunisation Program.\n\nDr Boulton said this meant Queensland babies were not getting their scheduled shots at a critical part of their early childhood development.\n\n\"It's very, very important to have those vaccines on time, and it's upsetting and distressful to parents when those vaccines are not available,\" Dr Boulton said.\n\n\" We rely on those orders we place every fortnight, and we rely on those vaccines to come in when we place an order. \"\n\nDr Boulton said there were also shortages for meningococcal B and flu shots, particularly for the over 65s.\n\nThe entire warehouse sits upon the retaining wall. (ABC Radio Brisbane: Kenji Sato)\n\nThe Toll closure has also disrupted supply to private medical suppliers that used the warehouse, such as the biotechnology company CSL.\n\nA CSL spokesperson said they had since found alternative arrangements.\n\n\"The supply of CSL products to healthcare professionals and patients hasn't been impacted as we have been able to supply from within our network,\" the spokesperson said.\n\nA Toll spokesperson said they were working to minimise disruption to the supply chain.\n\n\"We are working closely with our customers to establish interim distribution arrangements and continue to cooperate with the relevant authorities,\" the spokesperson said.\n\n\"We appreciate the patience of healthcare providers and the community during this time.\"\n\nDouglas Construction and Engineering, which built the warehouse, did not respond to the ABC's questions.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-28/tennis-carlos-alcaraz-aus-open-quarterfinal-analysis/106276424",
    "title": "Alcaraz approaches 'unmatchable' level through powers of concentration",
    "publish_date": "Tue, 27 Jan 2026 20:53:27 +0000",
    "category": "sports",
    "authors": [],
    "text": "The way Carlos Alcaraz has stacked accolades so far in his career, it is easy to forget he is still just 22.\n\nAlready a six-time grand slam champion, there is little space in Alcaraz's game or his resume that you can pick holes in.\n\nThe glaring spot has been at the Australian Open, where he hadn't advanced past the quarterfinal stage until Tuesday night's demolition job of hometown hero Alex de Minaur.\n\nAlcaraz's record at Melbourne Park sticks out like a sore thumb when you compare it to how he has performed in the other three grand slams around the world.\n\nThe Spaniard's win percentage in Australia is in the 70s, a figure which pales in comparison to his combined career record of 73-9 at Roland-Garros, Wimbledon and the US Open.\n\nWith the Australian Open being the first grand slam of the year, Alcaraz's poor record opened the door for questions about his preparation over the off-season.\n\nSo far this year, Alcaraz has put those questions to rest with a sublime five matches where he is yet to drop a single set.\n\nAlcaraz is as big a rockstar as there is on the men's tour. He had world-famous DJ Peggy Gou in his box for the de Minaur clash, he wears a big gold watch on his wrist immediately after his matches and was even happy to delve into his bag of racquet tricks during a post-match chat with Jim Courier.\n\nBut do not let any of that fool you into thinking the Spaniard is not locked in.\n\nMuch of the pre-match chatter surrounding the quarterfinal was the prospect of it being a test of where de Minaur stood on the pecking order of the men's tour.\n\nTwelve months earlier, the Aussie had been wiped off the floor with utter disdain by the tournament's eventual winner, Jannik Sinner.\n\nAlcaraz (left) was outfoxed by Novak Djokovic in last year's Australian Open quarterfinal. (Getty Images: Cameron Spencer)\n\nWhat was forgotten in the pre-match discussions was Alcaraz's own disappointing exit at the same stage last year, when he was beaten by a hobbled Novak Djokovic.\n\nDespite downing the aging champion in two straight Wimbledon finals, Alcaraz was undone mentally by Djokovic in last year's quarters, becoming the umpteenth opponent to be the victim of the Serb when he looks on the verge of being unable to walk.\n\nWith that history, this year's quarterfinal against a red-hot de Minaur in front of his home crowd presented Alcaraz the perfect test to see just how far his powers of concentration had come.\n\nAnother quarterfinal exit for de Minaur as Alcaraz wins in straight sets Alex de Minaur has been knocked out of the quarterfinals by world number one Carlos Alcaraz in straight sets.\n\nTo de Minaur's credit, he went toe to toe with the Spaniard for much of the first set, as the pair of roadrunners exchanged break after break.\n\nAlcaraz raced out to a 3-0 lead, only to be pegged right back to 3-3 by the Aussie.\n\nHe then broke de Minaur to go up 5-4 before de Minaur broke right back to stay in the set.\n\nThe final break of the set would seal it for Alcaraz and it would be the closest de Minaur would get. The Spaniard flicked the afterburners on and there was no catching him, even for an opponent as speedy as de Minaur.\n\nBeing more locked in isn't a surprise for Alcaraz, but rather a years long process.\n\n\"I've been working on this, the concentration, the focus,\" Alcaraz told reporters at Melbourne Park.\n\n\"Not having ups and downs in the matches has been one of the main goals for me, which I am trying to put into work every practice.\n\n\"If I have a practice of two hours, I'm trying to play the same level and having the same concentration point after point after point.\n\n\"I think the work is paying off and I'm just having a great mindset and great concentration during the whole tournament.\n\n\"I'm really proud of seeing all the hard work pay off.\"\n\nAlex de Minaur was left with no answers amid an Alcaraz onslaught. (Reuters: Tingshu Wang)\n\nWhat cannot be disputed is Alcaraz's hunger to be great. It is the only way you can stack the number of grand slam titles he has at such a young age.\n\nThe downside of that is wanting it all now, something that he has continued to work on, with the help of his team. This year, Alcaraz is more prepared to ease into the tournament.\n\n\"This is my first tournament of the year, but sometimes I'm not that patient,\" he said.\n\n\"In the first match I want to play at my best level, but this is not really possible. You have to get the rhythm of competition again.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"My team just told me to be patient and that the level [I] want is going to come for sure.\"\n\nHaving stacked his best ever week and a half together at Melbourne Park, Alcaraz is now two wins away from completing a career grand slam.\n\nTo get there, he'll have to overcome another man who has previously capitalised on his sloppiness at an Australian Open quarterfinal, Alexander Zverev, who also happens to be last year's runner-up.\n\nThe back end of Alcaraz's year is always strong, a stark contrast to how he starts out.\n\nHe finished last year with a US Open title and as the runner-up in the ATP Finals in career-best form.\n\nThe scary part for opponents? Just a month into this calendar year, Alcaraz already feels he is approaching his US Open level.\n\n\"I could say the level of the US Open is higher than the level I'm playing at right now, but it's pretty close,\" he said.\n\n\"I would say that the level that I was serving, the way that I was doing everything at the US Open, for me, I think was unmatchable.\"\n\nPretty close to unmatchable is an ideal place to be heading into a semifinal.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/rural/2026-01-28/scallop-fishery-ban-extended-queensland/106270080",
    "title": "Scallop fishers throw catch overboard as Queensland trawling ban extended",
    "publish_date": "Tue, 27 Jan 2026 20:44:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "Bundaberg fishmonger Paul Grunske has been importing scallops from Japan for the past four years, despite the famed Hervey Bay scallop habitat being just down the road.\n\nHe is not happy about it, but fishing for the small, sweet saucer scallops prized by celebrity chefs like Matt Moran and \"Fast\" Ed Halmagyi is illegal.\n\nFearing overfishing had depleted 88 per cent of the stock, the state government took the local delicacy off the menu in 2021.\n\nNow, numbers have recovered enough to reopen some northern waters, but southern inshore waters will remain off limits.\n\nThrown overboard\n\nMr Grunske said the state government ban had \"decimated\" the local fishers who trawled the seabed for their catch.\n\nPaul Grunske says the scallop fishing closure has caused millions of dollars in lost revenue. (ABC News: Tayla Larsen)\n\nThey pull in seafood such as prawns and bugs, but any scallops they catch in their nets must be thrown back overboard.\n\n\"It's taken millions of dollars out of Bundaberg's economy and the broader community's economy,\" he said.\n\n\" It's been a complete disaster for scallop fishers. \"\n\nScallop fishing will restart in the northern inshore fishery, but southern inshore waters remain closed. (Supplied: DPI)\n\nWhile scallops can be caught in the north and further offshore, the waters close to shore between Yeppoon and Hervey Bay, known as the southern inshore region, are the main fishery.\n\nAs early as 2016, population surveys in the area showed declining numbers, but an alarming report in 2020, indicating just 12 per cent of the biomass (the total volume of the stock) remained, prompted the state government to take action.\n\nPopulation targets not met\n\nFollowing feedback from fishers, in 2025, the Department of Primary Industries again surveyed the stock, finding the scallop biomass did not meet the 20 per cent benchmark set for reopening the fishery.\n\nThe lifting of the ban in north Queensland will see more local scallops on the menu. (ABC News: Brooke Tindall)\n\nFisheries and Forestry director general Pauline Jacob said a six-week survey caught and measured scallops across 420 sites.\n\n\"There are patches where we get really good scallops, but we're just not seeing it across the full inshore area,\" she said.\n\nShe said the department was investigating whether other environmental impacts, such as flooding, may be affecting the numbers.\n\n\"We will be working very closely with those inshore fishers to keep them doing some survey work,\" she said.\n\nMs Jacob said keeping the fishery closed was to ensure it was managed sustainably.\n\n\"Otherwise, what we will have is a commercial fishing fleet that won't be able to operate, and that's the last thing we want,\" she said.\n\nQueensland Seafood Industry Association chief executive David Bobberman said he would like to see fishers allowed to take small amounts to help with data collection.\n\nNorth Queensland fishers say scallops compliment their catch. (Supplied: Mark Millwood)\n\n\"Scallops can be a bit of a temperamental species in that they can be there one year and gone the next,\" Mr Bobberman said.\n\n\"If we can't catch some scallops and provide scientists within the department data, it'll be quite some time before we can do a proper stock assessment.\"\n\nA toe in the water for north Queensland\n\nFrom March, fishers in the central inshore region between Yeppoon and Townsville will be able to catch scallops for the first time in four years.\n\nMark Millward welcomes the news for north Queensland. (ABC News: Brooke Tindall)\n\nWhile not as abundant as further south, the species is an added source of income for commercial fishers like Mark Millward.\n\nTrawler operators say the population has improved in the southern inshore region. (Supplied: Grunske's by the River Seafood Market and Takeaway)\n\nBased in Townsville, Mr Millward said reopening was an opportunity to show the department fishers would obey catch limits.\n\n\"It's only for a couple of months, and it's a toe in the water, but it's a start for north Queensland,\" he said.\n\nDespite being a smaller industry, he said it would still create local jobs in processing.\n\n\"It'll get scallops back on the menu of restaurants in north Queensland and probably further south,\" he said.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.smh.com.au/business/companies/infini-zeroes-in-on-discovery-in-canadian-uranium-heartland-20260128-p5nxor.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Infini zeroes in on discovery in Canadian uranium heartland",
    "publish_date": "Wed, 28 Jan 2026 13:20:23 +1100",
    "category": "finance",
    "authors": [
      "Andrew Todd"
    ],
    "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Infini zeroes in on discovery in Canadian uranium heartland Brought to you by BULLS N’ BEARS Andrew Todd January 28, 2026 — 1:20pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nInfini Resources has completed an advanced drill-targeting analysis at its expanded Reitenbach Lake uranium project, in Canada’s world-class Athabasca basin, confirming extensions of key conductive trends that align with uranium highs ahead of a maiden drilling campaign next quarter. The company’s airborne electromagnetic (EM) interpretation revealed conductive horizons from the original Reitenbach Lake holdings that extend some 20 kilometres into the company’s newly staked ground, creating a 20km by 5km prospective uranium corridor. Infini Resources’ Reitenbach Lake project in Canada’s world-class Athabasca basin. Combined with existing conductors across the adjacent Reynolds Lake and Reitenbach Lake projects, Infini has now mapped out roughly 80 km of total EM strike length across the broader area. The company believes the conductors consist of graphitic schists and structurally controlled features considered prime real estate for basement-hosted uranium mineralisation, typical of the Athabasca Basin’s unconformity-style systems.\n\nAdvertisement\n\nA desktop review of historical exploration records over the expanded claims identified elevated uranium-in-lake-sediment geochemistry, with multiple zones lining up with the new EM conductors, major shear zones, cross-cutting structures and airborne radiometric highs. ‘This analysis really highlights the size of the opportunity we are dealing with.’ Infini Resources CEO Rohan Bone The overlapping datasets have highlighted several compelling target areas ripe for testing, with priority rankings set to be finalised in the coming quarter. The company says the combined results have boosted the case for a large, coherent uranium system, building directly on recent surface rock-chip assays that have already confirmed high-grade primary uranium at its Titus prospect. Infini Resources chief executive officer Rohan Bone said: “Identifying an additional ~20 x 5 km prospective EM corridor across our recently expanded tenements, and now having approximately 80 kilometres of EM conductors defined across the broader project area, really highlights the size of the opportunity we are dealing with.”\n\nAdvertisement\n\nThe Reynolds Lake and Reitenbach Lake projects, together, cover 1021 square kilometres of contiguous ground on the eastern margin of the Athabasca Basin in northern Saskatchewan, a region highly prospective for unconformity-style uranium deposits. The deposits mirror those behind some of the world’s richest uranium mines, such as Cameco Corporation’s Rabbit Lake and Eagle Point operations, which have collectively produced more than 230 million pounds of uranium from the Athabasca. The basin remains one of the world’s premier uranium powerhouses, supplying about 20 per cent of global output. Uranium forecasts remain strongly bullish, with some analysts forecasting prices as high as US$135 (A$201) per pound, driven by energy-hungry AI- data centres and the growing role of nuclear power as a reliable, carbon-free energy source. With datasets zeroing in on high-priority corridors and maiden drilling approaching, Infini looks primed for its first crack at a proper uranium discovery in the fabled Athabasca basin. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nSharemarket\n\nShares",
    "source": "SMH",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/australian-open-2026-live-updates-swiatek-anisimova-djokovic-sinner-in-star-studded-quarters-aussies-in-doubles-quarters-semis-action-20260127-p5nxf5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open 2026 LIVE updates: Rybakina tests Swiatek; Anisimova, Djokovic, Sinner in star-studded quarters; Aussies in doubles quarters, semis action",
    "publish_date": "Wed, 28 Jan 2026 13:19:11 +1100",
    "category": "sports",
    "authors": [
      "Angus Delaney",
      "Roy Ward"
    ],
    "text": "Novak Djokovic may be the undisputed king of tennis, but he’s also a big fan of other sports. And he’s always there to cheer on Serbian sports stars.\n\nThere’s lots going on at the moment, with the national waterpolo team crowned European champions in Belgrade this week, and basketball team Crvena zvezda taking on Greek Olympiacos in the EuroLeague competition in Athens in February.\n\nNovak Djokovic in action on Rod Laver Arena during the tournament. Credit: Chris Hopkins\n\nZvezda forward, Nigerian Chima Moneke, said he was thrilled he and his team had the support of the tennis GOAT. The Triple Threat Show podcaster said he’d frequently exchanged texts with the tennis great, a huge Zvezda fan.\n\n“He’s amazing. He always texts me after big wins and even after some losses. When we had tough times, he said, ‘We still believe in you guys’,” Moneke said.\n\n“A big shout out to Novak, and see you in Athens, my friend!”\n\nFun fact: Moneke is the son of Nigerian diplomats. He grew up and played basketball in Canberra before heading to the US.\n\nChima Moneke in his playing days in Canberra in 2018. Credit: Sitthixay Ditthavong\n\nThe basketball star said he couldn’t believe it when Djokovic started following him on social media after a victory over Real Madrid. The pair have since exchanged private messages and Moneke invited Djokovic to dinner after what he hoped would be the superb Serb’s 11th AO title.\n\nSpeaking to reporters in Serbian at the Open, Djokovic said he was gripped by basketball fever and would watch the Zvezda-Olympiakos match in Athens, where he now lives.\n\nIn his podcast, Moneke praised Djokovic for helping him through injury.\n\n“When I had an adductor injury, he sent me a three-minute voice message. Yes, I swear. He gave me advice and helped me with my rehabilitation, suggested who to work with and things like that,” Moneke said.",
    "source": "SMH",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-as-wall-street-advances-a-eyes-us70c-20260128-p5nxi8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX loses steam as inflation surprise boosts rate rise chances",
    "publish_date": "Wed, 28 Jan 2026 13:11:42 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX loses steam as inflation surprise boosts rate rise chances Staff reporter Updated January 28, 2026 — 1:11pm ,first published January 28, 2026 — 5:23am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has shed early gains after the country’s latest consumer price data revealed higher than expected inflation, significantly raising the chances of an interest rate hike. The S&P/ASX 200 was flat at 8941.3 in early afternoon trade, with seven of 11 industry sectors in the red. The Australian dollar has broken through the US70¢ barrier to hit a three-year-high. Wall Street is being driven by a raft of company results this week. Bloomberg December’s consumer price index, released by the Australian Bureau of Statistics, shows prices increased a full percentage point last month, pushing the annual inflation rate up from 3.4 per cent to 3.8 per cent. Underlying inflation, which is closely watched by the Reserve Bank, actually stepped down in December, climbing 0.2 per cent. The RBA sits next week and markets are now rating the chance of an interest rate rise at 70 per cent. That figure was 60 per cent before the latest inflation figures were released.\n\nAdvertisement\n\nOn the ASX, energy shares bounced following a rise in oil prices to their highest since October as US President Donald Trump touted a growing US military presence near Iran. Traders are monitoring the fallout from a sweeping winter storm and a weaker dollar which has boosted the appeal of commodities. Related Article Opinion\n\nTrump's White House What if Trump doesn’t chicken out next time? Stephen Bartholomeusz Senior business columnist Woodside Energy jumped 2.1 per cent. The company signalled on Wednesday a decline in oil and gas output this year despite the long-awaited start-up of its $16 billion Scarborough gas field off Western Australia. The Perth-based fossil fuel giant reported its biggest production year ever, delivering the equivalent of 198.9 million barrels of oil in 2025. But it is expecting output to dip to between 170 million to 186 million barrels this year due to a planned maintenance shutdown at its Pluto gas-processing plant. Santos rose 1.4 per cent and Whitehaven added 0.9 per cent\n\nAdvertisement\n\nThe performance of miners was mixed. BHP, which on Tuesday took Commonwealth Bank’s crown as the most valuable stock on the bourse, added 0.8 per cent, while Rio Tinto added 1 per cent and Fortescue retreated 1.1 per cent. Gold miners rose as Northern Star surged 3.4 per cent and Evolution Mining climbed 1.9 per cent. Financial stocks are steady. Commonwealth Bank is up 0.6 per cent, while National Australia Bank and Westpac edged up 0.1 per cent while ANZ Bank slid 0.1 per cent. The Australian dollar broke through the US70¢ barrier this morning as global turmoil continues to batter the US greenback. Geopolitical turmoil has sent the Aussie dollar surging in recent days and hit its highest mark since early 2023. It was trading at US69.88¢ at 12.28pm AEDT. Overnight, Wall Street ticked to a record as stocks zigzagged under the market’s surface following mixed profit reports from UnitedHealth, General Motors and other big companies. The S&P 500 rose 0.4 per cent and edged past its prior all-time high set a couple of weeks ago, even though more stocks fell within the index than rose. The Dow Jones dropped 408 points, or 0.8 per cent, and the Nasdaq composite climbed 0.9 per cent.\n\nAdvertisement\n\nOn Wall Street, UnitedHealth Group tumbled 19.6 per cent despite reporting a profit for the latest quarter that was slightly better than analysts expected. More attention was on the company’s forecast for revenue in the upcoming year, which fell short of Wall Street’s expectations and could be weaker than it was in 2025. Related Article Opinion\n\nRupert Murdoch Will Murdoch get rewarded for his expensive gift to Trump? Elizabeth Knight Business columnist Health care stocks also felt tremendous pressure from a projected rate increase for Medicare Advantage by the US government, which fell well short of what investors had hoped. Humana skidded by 21.1 per cent, Elevance Health dropped 14.3 per cent and CVS Health sank 14.2 per cent. Supporting the US stock market were gains for General Motors, which rose 8.7 per cent, and hospital-operator HCA Healthcare, which rallied 7.1 per cent. Both delivered profits for the end of 2025 that topped Wall Street’s expectations. Each also approved programs to send billions of dollars to their investors by buying back their own stock. The pressure is on companies to deliver strong growth in profits following record-setting runs for their stock prices. Stock prices tend to follow the path of corporate profits over the long term, and earnings need to rise to quiet criticism that stock prices have grown too expensive.\n\nAdvertisement\n\nSeveral of Wall Street’s most influential stocks will deliver their latest earnings reports later this week. They include Meta Platforms, Microsoft and Tesla on Wednesday and Apple on Thursday. Several of those Big Tech stocks were among the strongest forces lifting the S&P 500 on Tuesday, including gains of 2.2 per cent for Microsoft and 1.1 per cent for Apple. Another way stock prices can look less expensive to investors is if interest rates fall. The US Federal Reserve will announce its next move on interest rates on Wednesday, but the widespread expectation is that it will hold its main interest rate steady for now. Inflation remains stubbornly above the Fed’s 2 per cent target, and lower interest rates could worsen increases in prices for US consumers at the same time that they give the economy a boost. Traders expect the Fed to resume its cuts to interest rates later this year. AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/wa-news-live-identity-of-invasion-day-rally-bombmaker-to-be-kept-secret-20260127-p5nxh9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Identity of Invasion Day rally ‘bombmaker’ to be kept secret",
    "publish_date": "Wed, 28 Jan 2026 13:09:21 +1100",
    "category": "finance",
    "authors": [],
    "text": "To education news now and Elite Perth private school St Hilda’s Anglican School for Girls has vowed to erase all identifiable images of its students from its social media platforms over concerns they could be used to create deepfakes.\n\nThe school posted to their website on Tuesday afternoon announcing the change and said that they were taking “bold, future‑focused steps to protect the privacy, dignity, and digital wellbeing of our girls”.\n\nSt Hilda’s will remove identifiable photos of students from its social media platforms. Holly Thompson/ Supplied\n\nThe step is preventative, with the school confirming they were not aware of any student images being used or altered via artificial intelligence.\n\n“With the rise of artificial intelligence, photo manipulation and deepfake technology have become increasingly sophisticated, creating risks for young people that did not exist even five years ago,” the school wrote.\n\n“Around the world, there have been cases where school images were taken from public social media pages, altered using AI, and turned into harmful deepfakes.\n\n“Once a photo is shared publicly, anyone can download it, manipulate it, or distribute it, and the school or family may never know.“\n\nParents will still be able to access photos through a password-protected gallery, while any images posted to social media will be of feature side profiles, silhouettes, backs of heads, distant group shots, creative filters, or approved stock photography.\n\nThe school said this shift tied in with the new social media ban for under-16s.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-mp-colin-boyce-to-move-spill-motion-for-national-party-leadership-liberal-senator-says-the-west-has-been-too-nice-20260128-p5nxig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: MP Colin Boyce to move spill motion for National Party leadership; Liberal senator says the West has ‘probably been too nice’ about Islam",
    "publish_date": "Wed, 28 Jan 2026 13:09:08 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine",
      "Alexander Darling"
    ],
    "text": "The inflation data has forced one of the nation’s big lenders to change its tip for the Reserve Bank’s next move.\n\nEconomists at the ANZ, which had been tipping the RBA to use its meeting next week to keep the cash rate steady at 3.6 per cent, now believe it will instead lift it by a quarter percentage point.\n\nANZ Eamon Gallagher\n\nThey said with the key measure of underlying inflation coming in at 3.35 per cent, and unemployment edging down to 4.1 per cent in December, a lift in the cash rate was now on the cards next Tuesday.\n\n“In the wake of an interest rate increase we would anticipate material softening in leading indicators of activity, such as auction clearance rates, consumer sentiment and business conditions/confidence,” they said in a statement.\n\n“That will weaken the activity case for further rate rises beyond the one we expect. And while price pressures lifted through the second half of 2025, most top-down inflation indicators continue to suggest that a moderation of inflation back into the target range is likely over 2026 and into 2027.”\n\n“Accordingly, we view this as a single ‘insurance’ tightening, not the start of a series of rate hikes.”",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/national/police-have-released-footage-of-a-man-following-alleged-sexual-act-on-train-20260128-p5nxoq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Police have released footage of a man following alleged sexual act on train",
    "publish_date": "Wed, 28 Jan 2026 13:08:58 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/victoria/world-in-pictures-january-28-2026-20260128-p5nxo0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "World in pictures, January 28, 2026",
    "publish_date": "Wed, 28 Jan 2026 12:57:13 +1100",
    "category": "sports",
    "authors": [
      "Danie Sprague"
    ],
    "text": "6 / 8\n\nNew York Waterway ferries move as ice floats on the Hudson River seen from the Edge sky deck at Hudson Yards, Tuesday, Jan. 27, 2026, in New York. Credit:AP Photo/Yuki Iwamura",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/rybakina-takes-first-set-20260128-p5nxoe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rybakina takes first set",
    "publish_date": "Wed, 28 Jan 2026 12:53:33 +1100",
    "category": "finance",
    "authors": [],
    "text": "Rybakina takes first set\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/culture/music/the-russian-brainrot-song-taking-children-by-storm-20260128-p5nxnw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Russian brainrot song taking children by storm",
    "publish_date": "Wed, 28 Jan 2026 12:26:30 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/politics/federal/lift-in-inflation-puts-pressure-on-rba-for-rate-rise-20260128-p5nxjg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lift in inflation puts pressure on RBA for rate rise",
    "publish_date": "Wed, 28 Jan 2026 12:24:59 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "Advertisement\n\nPoliticsFederalInflation Lift in inflation puts pressure on RBA for rate rise Shane Wright January 28, 2026 — 12:24pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA big jump in prices for tourist travel and the end of electricity subsidies has pushed annual inflation to 3.8 per cent but it may not be enough to force the hand of the Reserve Bank. The December consumer price index released by the Australian Bureau of Statistics this morning showed prices increased by a full percentage point last month. Treasurer Jim Chalmers. Alex Ellinghausen It pushed the annual inflation rate up from 3.4 per cent to 3.8 per cent.It was driven by electricity prices which, at an annual rate, grew by 21.5 per cent over the year compared to 19.7 per cent in the 12 months to November. The end of power subsidies in both Queensland and Western Australia contributed to the lift.\n\nAdvertisement\n\nThat’s reflected in the inflation rates of the capital cities. The highest are in Brisbane (at 5.2 per cent) while Perth is the second highest in the nation at 4.4 per cent. Both Darwin and Melbourne have the lowest inflation rates at 3.1 per cent. There was also a large jump in travel and accommodation prices in December as Australians went on holidays. Domestic holiday prices jumped by 8.2 per cent last month, which the bureau attributed to strong demand through the school holidays and the Ashes Test series. International travel costs soared by 24.4 per cent last month due to a sharp jump in airfares.\n\nAdvertisement\n\nWhile overall prices did lift, the bureau noted that once seasonal factors were taken into account, prices increased by a much more modest 0.2 per cent. Underlying inflation, which is closely watched by the Reserve Bank, actually stepped down in December, climbing by 0.2 per cent. That took underlying inflation to 3.3 per cent over the past 12 months, just 0.1 percentage point above the Reserve Bank’s own forecasts for the period. The bank sits next week with markets putting the chance of an interest rate rise at 60 per cent. On the numbers being released, the Australian dollar - which climbed over US70 cents for the first time in three years - lifted on expectations of a rate rise. But as the figures were processed by analysts, the dollar eased below the US70 mark.\n\nAdvertisement\n\nThe figures are the bureau’s recent monthly measure of inflation. The Reserve is closely watching the long-term quarterly movement in inflation. The bureau found that over the December quarter, prices lifted by 0.6 per cent - well down on the 1.3 per cent spike in the September quarter. It was the lowest quarterly result since December 2024. Rent inflation eased slightly to 3.9 per cent from 4 per cent, with the bureau noting that vacancy rates across all capital cities have been stable over the past year. Food inflation lifted to 3.4 per cent, with the weather and demand for Australian beef out of the United States continuing to be major factors. Beef and lamb prices lifted by 10 per cent through the year due to strong overseas demand.\n\nAdvertisement\n\nFruit and vegetable prices lifted by 4 per cent, up from 2.7 per cent in September. The bureau said shortages of cucumbers, zucchinis, capsicums and apples caused by poor weather were key factors for the higher prices. Asked whether he would take responsibility for the rise in inflation, Treasurer Jim Chalmers said, “I take responsibility for doing my job to address this inflation challenge in our economy, to address the productivity challenge in our economy, and also to do what we can to make our economy more resilient in the face of all this global economic uncertainty.“ more to come...",
    "source": "SMH",
    "cluster_id": 10
  },
  {
    "url": "https://www.smh.com.au/goodfood/brisbane-eating-out/is-this-75-stunner-brisbane-s-best-pasta-20260127-p5nx9s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Is this $75 stunner Brisbane’s best pasta?",
    "publish_date": "Wed, 28 Jan 2026 12:23:28 +1100",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nEating outFood Is this $75 stunner Brisbane’s best pasta? South Bank’s Otto restaurant isn’t cheap, but it’s just about always excellent value, and nothing exemplifies that better than this spectacular dish. Matt Shea January 28, 2026 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nOtto Brisbane isn’t cheap. But it is good value. That statement might seem counterintuitive when you can easily walk out of this South Bank restaurant having paid well in excess of $400 for two people. But an experienced diner will likely look down at their itemised bill, shrug and think, “Yep, worth it”. The champagne lobster spaghettini was added to Otto’s menu around 2018-2019 and never left. Nothing on this upmarket Italian’s menu captures its penchant for high-end value like its champagne lobster spaghettini. This thing clocks in at $55 for an entree and $75 for a main, but we’d wager it’s worth every penny. And whether you think of it as expensive perhaps depends on your love of lobster (more on that later). Served with garlic, chilli, white wine, lemon butter and bottarga, something this divine shouldn’t be this simple. But its original appearance on the menu at Otto also signified a changing attitude towards seafood in this city, both in demand and supply.\n\nAdvertisement\n\nRelated Article This ugly-delicious Happy Boy classic is one of Brisbane’s best dishes Head chef Will Cowper introduced the dish as a special back in 2018 or 2019 – he can’t remember exactly when. Restaurant reviews, news and the hottest openings served to your inbox. Sign up “Champagne lobster was first brought to me by Jules [Crocker] from Joto Fresh Fish [in Sydney],” Cowper says. “When I first came to Brisbane, I felt seafood was a bit forgotten about. All the good seafood was caught in Queensland but bypassed Brisbane to go to Sydney or Melbourne. “So I used Jules to send stuff directly to me. Eventually, he put the champagne lobster in front of me.” The champagne lobster spaghettini suits Otto’s peerless waterside location. Courtesy of Otto Brisbane\n\nAdvertisement\n\nThe other timely aspect of the spaghettini? The lobster was bycatch, and Cowper’s invention of the dish signposted a greater industry interest in utilising seafood that would have traditionally been discarded. “Eventually, it got to a point where I said to Jules, ‘I want to put this on permanently. How much can you get?’” Cowper says. “He was, like, ‘It’s not that simple’. But eventually, it was him working with the fishers and saying, ‘we’ll take everything you can get’, and it stayed that way.” These days, Otto’s chefs shift between four and five tonnes of champagne lobster a year, so they order it pre-processed to more easily separate the heads and shells for a stock. The dish is just viscous enough to allow the spaghettini to easily twirl around the fork. Nikki To Otherwise, it’s a relatively simple dish based on a traditional aglio e olio, Cowper sauteing off some chilli and garlic in olive oil, before deglazing the pan with white wine, and adding the stock.\n\nAdvertisement\n\n“Then we add the pasta and the lobster, and then the butter, then some dill and parsley, and we finish it with bottarga. It might surprise some people how fast it comes together in the kitchen.” Expensive pastas are often big and bold, but Cowper’s dish is about getting out of the way of the gentle sweetness of the lobster. It’s refined and delicate, the bottarga providing just the right amount of punch, the lemon butter just viscous enough to allow the spaghettini to easily twirl around the fork and give the dish a luscious mouthfeel. Related Article Exclusive The old King Arthur Cafe is transforming into a Euro-influenced all-day eatery It’s a spectacular piece of cooking, perfectly pitched both on the plate and for Otto’s priceless waterside location. “Rock lobster pastas can often range up to $300, so I think ours is quite reasonably priced,” Cowper says. “And we haven’t really changed that price. It’s always been around that $70 mark for a main course. “Some might not understand that price, but what’s inside the dish is what it’s all about. Everything I do is about getting the best-quality produce for our guests. It’s lobster pasta that’s accessible, and I think it’s a steal.”\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Food\n\nFor subscribers Matt Shea is Food and Culture Editor at Brisbane Times. He is a former editor and editor-at-large at Broadsheet Brisbane, and has written for Escape, Qantas Magazine, the Guardian, Jetstar Magazine and SilverKris, among many others.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/lifestyle/carlos-alcaraz-receives-marriage-proposals-from-the-australian-open-crowd-20260128-p5nxnk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Carlos Alcaraz receives marriage proposals from the Australian Open crowd",
    "publish_date": "Wed, 28 Jan 2026 12:12:26 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/business/companies/pure-damage-control-lululemon-roasted-over-handling-of-see-through-leggings-saga-20260127-p5nxaa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Pure damage control’: Lululemon roasted over handling of see-through leggings saga",
    "publish_date": "Wed, 28 Jan 2026 12:00:42 +1100",
    "category": "finance",
    "authors": [
      "Jessica Yun"
    ],
    "text": "Advertisement\n\nBusinessCompaniesFashion retail ‘Pure damage control’: Lululemon roasted over handling of see-through leggings saga Jessica Yun January 28, 2026 — 12:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nLululemon is facing sustained criticism from customers over its handling of a controversial range of leggings and shorts, which it temporarily stopped selling in the US following complaints they were too sheer, sparking concerns the global company is losing its edge. In early January, the activewear brand released its Get Low range of a set of tights, shorts, and a tank top that it said were “designed for training” and to “naturally flex apart at key tension points”. Lululemon has sustained criticism over its Get Low tights that customers have complained are too sheer. Various Customers were critical on social media about the tights not being “squat proof” and for being so sheer they could see their underwear. “The leggings are absolutely see through when you squat or bend over (in every color way),” said a Reddit user in a post claiming to be an “educator”, which is what the company calls its retail staff.\n\nAdvertisement\n\n“It blows my mind how something makes it on the floor with issues like that,” said another. “How did no one do a back squat before sign off?” Related Article Supermarket wars ‘The missing piece’: Amazon will deliver fresh food for the first time On January 20, the company halted online sales in the US to “better understand guest feedback” before returning the item to its website three days later with a new product description advising customers on how to wear the leggings. Descriptions have also been updated in other markets. “To experience this tight’s best performance during your workout, we recommend sizing up,” the Australian product listing states. “Pair with skin-tone, seamless underwear.”\n\nAdvertisement\n\nLululemon, a US$22.6 billion company headquartered in Canada but listed on the tech-dominated NASDAQ stock exchange, has lost roughly half its market value in the past 12 months. The company stock plummeted 6.5 per cent the day it paused the Get Low line, exacerbated by a scathing attack from Lululemon company founder Chip Wilson, who started the company in 1998 but resigned from the board in 2015 amid public spats with other board directors. “It blows my mind how something makes it on the floor with issues like that. How did no one do a back squat before sign off?” A customer’s complaint about the tights. Pausing sales was “a total operational failure” by the company’s current management, he said. “I’ve believed that lululemon has lost its cool for some time, but it is now evident to me that the Company has completely lost its way as a leader in technical apparel,” he wrote in a LinkedIn post.\n\nAdvertisement\n\n“It is clear that persistent failures like this are born out of this Board’s lack of experience in creative businesses, disinterest in product development and quality, and focus on short-term, self-interested priorities. How could anyone reach a conclusion other than the Board continues to make decisions that are destroying the brand and the stock price?” Related Article Sunday Life If you need new activewear, this brand could be the ‘next Lululemon’ In a statement, a Lululemon company spokesperson said the Get Low collection remains for sale in US stores and online in Australia. “Based on the learnings, we have updated our product education information to incorporate new guidance on fit, sizing, and features to better support guest purchase decisions,” they said. When this masthead went to visit Lululemon’s store in Sydney’s Wynyard, the Get Low collection was not displayed but was available for sale when asked. Many customers queried the product development process, asking if there was adequate testing before the items were approved for sale.\n\nAdvertisement\n\n“What is the point of product development if these issues aren’t spotted before they get on the shelves[?]” commented a user on Reddit. “Don’t brands usually have athletes test prototypes to avoid this kind of thing???” “This issue should have been found in testing right away,” said another. Wilson’s acrimonious departure from the company was partially fuelled by a similar saga in mid-2024 when the company was forced to recall its Breezethrough leggings. Designed for yoga, Pilates and for “hot studio” workouts, those leggings received negative reviews from customers who said they created an unflattering “long butt” effect and a waistband that dug into the stomach or rolled down during movement. Lululemon pulled the entire range three weeks after its launch. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.sbs.com.au/news/article/french-lawmakers-vote-in-favour-of-social-media-ban-for-under-15s/uzt0c40md",
    "title": "French lawmakers vote in favour of social media ban for under-15s",
    "publish_date": "Tue, 27 Jan 2026 20:32:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "French lawmakers have passed a bill that would ban social media use by under-15s, a move championed by President Emmanuel Macron as a way to protect children from excessive screen time.\n\nThe lower house, the National Assembly, adopted the text by a vote of 130 to 21 in a lengthy overnight session from Monday to Tuesday.\n\nIt will now go to the Senate, France's upper house, ahead of becoming law.\n\nMacron, on X, hailed the vote as a \"major step\" to protect French children and teenagers.\n\nThe legislation, which also provides for a ban on mobile phones in high schools, would make France the second country to take such a step following Australia's ban for under-16s in December.\n\nChildren's emotions 'not for sale'\n\nAs social media has grown, so has concern that too much screen time and addictive algorithms are harming child development and contributing to mental health problems.\n\n\"The emotions of our children and teenagers are not for sale or to be manipulated, either by American platforms or Chinese algorithms,\" Macron said in a video broadcast on Saturday.\n\nAuthorities want the measures to be enforced from the start of the 2026 school year, in September, for new accounts.\n\nEnforcement to lie with the EU\n\nFormer prime minister Gabriel Attal, who leads Macron's Renaissance party in the lower house, said he hoped the Senate would pass the bill by mid-February so that the ban could come into force on 1 September.\n\nHe added that \"social media platforms will then have until 31 December to deactivate existing accounts\" that do not comply with the age limit.\n\nWhile backing France's right to impose such a ban, the European Commission on Tuesday said that any enforcement would lie with the EU, provided the bill conforms to the bloc's laws.\n\nCommission spokesperson Thomas Regnier told reporters it would ultimately be up to the EU to ensure that platforms implement adequate age-verification tools to help any ban become a reality.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 24
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-open-alex-de-minaur-defeated-by-carlos-alcaraz/3umqr01y7",
    "title": "De Minaur says he will 'keep on improving' following Australian Open quarter-final exit",
    "publish_date": "Tue, 27 Jan 2026 19:31:14 +0000",
    "category": "sports",
    "authors": [],
    "text": "Deflated by his latest Australian Open exit, Alex de Minaur knows there is only one option if he is to close the gap on the world's best tennis players and contend for a first grand slam title.\n\nDe Minaur was reminded just how far he has to go when a high-octane start to his quarter-final clash with world number one Carlos Alcaraz turned into an all-too-familiar nightmare.\n\nThe 26-year-old was competitive early, raising local fans' hopes of an upset, but was ultimately outclassed in a 7-5 6-2 6-1 defeat at Rod Laver Arena on Tuesday night.\n\n\"You just got to keep on moving. It's the only way,\" de Minaur said.\n\n\"I mean, as tough as it is when you get results like this, you get back up, you get back on the horse, and that's it.\"\n\nDe Minaur has lost his first seven grand slam quarter-final appearances and is the third man in the open era to do so, after Andrey Rublev and Tommy Robredo.\n\nHe first reached the last eight at Melbourne Park a year ago, when he was beaten by Jannik Sinner, who was then on the march to a second straight AO crown.\n\nIn the aftermath, de Minaur went on to reach a career-high ranking of world number six in the world and held his top-10 billing for most of last year.\n\nBut, frustratingly, he remains a level below Alcaraz and Sinner, nursing a combined 0-19 head-to-head record against the two big guns.\n\n'It doesn't feel amazing'\n\nTuesday's defeat was his sixth in as many meetings with Alcaraz.\n\n\"It doesn't feel amazing, I'll tell you that,\" de Minaur said.\n\n\"You try do the right things, you try keep on improving.\n\n\"But when the results don't come or the scoreline doesn't reflect those improvements, then of course you feel quite deflated.\"\n\nAlex de Minaur (left) said he would try to improve following his loss to Carlos Alcaraz (right). Source: AP / Dita Alangkara\n\nThere is no encouragement to be had from the records of Rublev and Robredo. The latter's seventh quarter-final in 2013 was also his last, with the Spaniard now retired.\n\nRublev, 28, is still playing and ranked world number 14, but the Russian has now reached ten quarter-finals without progressing, most recently at the Australian Open two years ago.\n\nDe Minaur wasn't without his moments against Alcaraz.\n\nHe fought back from 3-0 down in the first set to level the score and at one point hit an outrageous backhand winner in mid-air.\n\n\"There was some good parts out there, but overall, I'm playing out of my comfort zone and at times out of my skin,\" de Minaur said.\n\n\"Of course, for me to take that next step, I've got to be comfortable in playing that sort of way for the whole match.\n\n\"That's what it takes, you know, to take it to the next level, especially against these types of guys.\"\n\nAlcaraz, who is still alive in his quest to complete a career grand slam this tournament, said de Minaur presents a difficult challenge.\n\nBut the six-time major winner felt he had the upper hand against the Australian in their latest showdown.\n\n\"When he's playing against the best or the top player, he's trying to be more aggressive, which sometimes he's just out of his comfort zone,\" Alcaraz said.\n\n\"That (why) sometimes we're seeing him miss quite often some quite easy balls.\n\n\"I notice that, and we know how to approach the match, because we are one step forward in that case.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 25
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/is-it-too-late-to-jump-on-the-gold-and-silver-bullet-train/fq738dwef",
    "title": "Is it too late to jump on the gold and silver bullet train?",
    "publish_date": "Tue, 27 Jan 2026 07:43:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-open-prize-pool-heres-how-much-the-winners-will-take-home/p74e5ult6",
    "title": "Australian Open prize pool: Here's how much Alex De Minaur took home",
    "publish_date": "Tue, 27 Jan 2026 06:40:47 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Australian Open increased its prize pool by 16 per cent since last year, sitting at $111.5 million, making it the biggest in the tournament's history.\n\nBoth the men's and women's singles winner will take home $4.15 million, a 19 per cent increase from last year's prize.\n\nDespite the sport being notorious for unequal pay, Tennis Australia's CEO Craig Tiley said he hopes the boost can ensure professional tennis is sustainable for everyone — with even the qualifying round earning players $40,500.\n\nSo how did the Australian players fare? And how does this prize pool compare to not only other tennis competitions, but other professional sports in general?\n\nHow much did Australia's top players earn?\n\nFollowing Tuesday's quarter-final matches, players will continue rounds up until the women's singles final on 31 January and the men's on 1 February.\n\nAustralia's very own Alex de Minaur lost Tuesday's quarter-final against world number one, Spain's Carlos Alcaraz.\n\nDespite falling short, he'll still pocket $750,000 of prize money which is a 14 per cent increase compared to last year.\n\nAfter losing her match against Poland's Iga Świątek in the fourth round on Monday, Australia's Maddison Inglis took home $480,000.\n\nHer biggest prize money yet, Inglis said she'd invest it back into tennis and ideally fund a support crew made up of friends and family.\n\nShe said she'd also love to spend it on a toaster or a kettle, telling the Sydney Morning Herald: \"I love shopping, so I'm sure I'll buy something nice.\"\n\nSource: SBS News\n\nThe Australian Open is the lowest paying of the four major tennis tournaments behind the US Open, Wimbledon and the French Open.\n\nIn 2025, the US Open allocated US$5 million ($7.2 million) to each singles winner. Wimbledon had £4 million ($5.9 million), and the French Open had €2.55 million ($4.3 million).\n\nInequalities in tennis pay\n\nTiley said the improvement to the prize pool shows their commitment to \"supporting tennis players at every level\".\n\nA career in tennis is notorious for huge pay disparities between players.\n\nTop stars can take home millions, while others may only get a couple thousand, all while self-funding travel, accommodation and coaching.\n\nBack in 2022, New Zealand tennis player Kiranpal Pannu spoke publicly about how he earned around US$6,770 ($9,798) in prize money. But his expenses, mostly travelling to and from tournaments, cost US$34,500 ($49,926).\n\nWimbledon men's doubles champion Vasek Pospisil said in 2014: \"The most common struggle for anyone ranked outside of the top 100 is financial, and the stress it causes.\"\n\n\"They're trying to cover travel expenses and needing to make decisions about where to cut costs, and then not being able to travel [to events] the way they would like to ... It's a snowball effect, it makes it even harder for the lower-ranked guys to break through because they just have less resources,\" Pospisil said.\n\nAlcaraz reportedly earned almost US $74.6 million ($108 million) in 2025, making him the highest-paid tennis player in the world. He sits along other greats, yet there are only a few.\n\nThe 100th best player in tennis at the time of reporting is Ignacio Buse, a 21 year-old from the US. His total earnings over his career so far sit at US$463,885 ($671,304).\n\nHowever, the 100th best player in baseball, Kodai Senga, has an annual salary of US$15 million ($21.7 million), as reported by ESPN in 2025.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/australia-visa-cancelled-for-jewish-social-media-influencer-evening-news-bulletin-27-january-2026/327x17nc6",
    "title": "Australia visa cancelled for Jewish social media influencer | Evening News Bulletin 27 January 2026",
    "publish_date": "Tue, 27 Jan 2026 05:22:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nRecord heat in Victoria adds to the firefighting challenge\n\nThe federal government cancels the visa of a Jewish social media influencer\n\nAryna Sabalenka the first woman into the Australian Open semi-finals\n\nIn Victoria, the Country Fire Authority says fire ban conditions will extend into tomorrow, as today's record temperatures above 40 degrees elevates the fire risk.\n\nThe fire ban tomorrow will apply to the Wimmera and the North East regions of the state.\n\n27 alerts remain in place, with concern in particular over the Carlisle River fire in the Otways, which is threatening the small community of Gellibrand and others nearby.\n\nDeputy incident controller Alistair Drayton says the situation remains volatile, and he is urging affected communities to remain on high alert.\n\n\"The risk today is this fire does waken up and become more active again and make a run, particularly with the weather we're anticipating; both from a heat point of view, to raise the fire, but with the south westerly change that we're looking to see come through later this afternoon will also make the fire potentially quite active. Road closures are in place. Please stay informed of your local environment where you are today and make some really good decisions in the cool light of day, not the heat of the moment.\"\n\nIn total, the fires have burnt 430,000 hectares of land.\n\n---\n\nThe federal government has cancelled the visa of Jewish social media influencer Sammy Yahood.\n\nHome Affairs Minister Tony Burke says the decision was made based on an assessment that his posts on social media spread hatred against Muslims.\n\nMr Yahood said he booked a flight three days before the Bondi attack and felt it was \"his calling\" to come on an Australian speaking tour.\n\nThe Australian Jewish Association has condemned the visa ban, saying Mr Yahood was due to speak at major synagogues.\n\nThe influencer says he will now return to Israel, vowing to continue his brand of advocacy.\n\n\"I have been spurred on. The gasoline has been added to the fire. And I'm telling you now, the Australian Government, a tyranny which seems very similar to one that I know from the UK, does not know what they have started peace through strength. Stay tuned, because you have no idea what is going to come from me in the next month, and you are going to want to know.\"\n\n---\n\nThe Northern Territory's children's commissioner has raised the alarm amid rapid changes to law and policies impacting young people's rights in Australia's Top End.\n\nThe Commissioner’s latest annual report says the majority of complaints came from youth detention, with one child reportedly held in a cell for 84 hours without food, medication or sunlight.\n\nThe commissioner, Larrakia woman Shahleena Musk, says these impacts have followed rapid reforms in the N-T, including the lowering the age of criminal responsibility from 12 to 10 years old; and changes that make it harder for young people to get bail.\n\n\"The vast majority are there on remand, that is awaiting the resolution of their charges or trial. So what we're seeing is the overuse of custody in contrast of alternatives that could be based in the community with family; and with services that are going to address the underlying needs. And we're seeing more and more children with unmet disability, mental health and trauma needs. Children being criminalised because of their unmet needs.\"\n\nThe NT government is yet to respond to the report - or requests for comment from SBS.\n\n---\n\nThe search for survivors continues in Indonesia's West Java province - where a landslide has killed at least 17 people.\n\nAuthorities said 73 others are missing, with heavy equipment unable to reach the disaster zone due to bad weather.\n\nMore than 30 houses were buried by the landslide, which 29-year-old Siti Halimah narrowly survived.\n\n\"I heard a pounding noise. I could count hearing heavy trembling noises at least eight times. It felt like an earthquake, almost like the houses were moving. And then I thought it was just an earthquake, then my sister, who lives across the street, said it was a landslide, then when I looked right, all the houses were gone.\"\n\nThe landslide comes two months after cyclone-induced floods and landslides on the island of Sumatra killed 1,200 people, destroyed homes and displaced over a million residents.\n\n---\n\nIn tennis, the world's top-ranked player, Aryna Sabalenka, is the first woman through to the semi-finals at the Australian Open.\n\nIn 38 degree heat at Melbourne Park, Sabalenka has beaten the 29th seed, American Iva Jovic 6-3, 6-0 in the quarter-finals.\n\nJovic, an 18-year-old American, was playing her first-ever major tournament quarter-final.\n\nShe lasted an hour and 29 minutes against Sabalenka, who is looking to regain the Australian Open title she won in 2023 and 2024.\n\nSabalenka will face either the third seed, American Coco Gauff, or the 12th seed, Ukrainian Eva Svitolina, in the semi-finals on Thursday.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/bradman-scores-again-as-baggy-green-fetches-record-price/ks45yznju",
    "title": "Bradman scores again as Baggy Green fetches record price",
    "publish_date": "Tue, 27 Jan 2026 01:52:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nREPORTER: \"So this is the chest?\"\n\nFAMILY MEMBER: \"Yeah, this is the treasure chest... Okay, drum roll.\"\n\nREPORTER: \"Wow. Wow.\"\n\nFor the past 75 years, three generations of the family of former Indian test cricketer Sriranga [[Sree-rung-gah]] Sohini has held on to a very important item in a glass cabinet.\n\nFAMILY: \"So all his stuff is here. And if you can come a little closer you can smell that old smell.”\n\nWhat the family kept was a baggy green cap, which Don Bradman gave to their grandfather during India's first tour of Australia after the country gained independence in 1947.\n\nLee Hames from Lloyds Auctions says Bradman offered the cap as a show of sportsmanship during the Brisbane leg of the tour, when their bowler mistakenly thought he had gotten the Australian legend out.\n\n“He (the bowler) turned to the umpire and they said that's not out, and so he turned out to be the first Indian cricketer not to get Sir Donald Bradman out. They went back and reviewed the footage obviously and they reckoned it was plumb. In true Sir Donald Bradman nature we're told he went into the changing rooms that night, obviously knew that it was important that India weren't too discouraged. He put his arm around the young Indian bowler and put the baggy green on his head. So he used that as inspiration for the Indian cricket team.”\n\nLee Hames has just concluded an online auction of the cap - selling it for $460,000 dollars to an Australian collector who has chosen to remain anonymous.\n\nThe cap will remain in Australia and at some stage, be placed on public display in a prominent Australian museum.\n\nMr Hames says that's the highest price ever paid for a baggy green worn by the Don.\n\nIt's the holy grail when it comes to cricket sporting memorabilia... This one is a very important baggy green. It is the baggy green that Sir Don Bradman was wearing when he achieved his 100th century. It was the baggy green that he wore in his last Test on home soil - and it's been away for 75 years.”\n\nIt's not the first iconic Australian baggy green to go under the hammer.\n\nThe record price for such a cap belongs to Shane Warne, who sold his for just over a million dollars in 2020 to raise money for the Australian Red Cross, money that NSW Red Cross director Poppy Brown said in 2020 was life changing.\n\n“When we have talked to people who are in the evacuation centres and are really struggling, they are so amazed by the support from the community.”\n\nYet, while the money from the Shane Warne and Don Bradman sales are respectable figures - they're still not the most expensive pieces of memorabilia in history.\n\nNew Jersey-based auctioneer Alex McNicoll says a jersey worn by the late great player Diego Maradona in his first ever World Cup match against Belgium in 1982, featuring his signature on the front in black ink, went for $12.4 million [[AUD]].\n\n“As far as a public auction, there's never been a piece like this. And it's hard to say there will be again. This piece really does belong in a museum just because of its significance for soccer history and Maradona's history.”\n\nAnother piece of Diego Maradona history was the football used in the 1986 World Cup quarter final between Argentina and England.\n\nThat point became known as the Hand of God goal because of accusations that Maradona had batted the ball into the net with his fist.\n\n“Maradona, he handled the ball, didn't he? Didn't he?”\n\nThe legend himself confirmed this some time later, saying it was symbolic revenge for Argentina's defeat by the United Kingdom in the 1982 Falklands War.\n\nThe football itself was sold several years ago by Graham Budd Auctions for a healthy sum.\n\nAUCTIONEER: \"It's the hand of god football from the Argentina versus England quarter final... That's two million, thank you very much.”\n\nMeanwhile, in basketball, the sneakers that Michael Jordan wore in game two of the 1998 NBA finals went up for grabs three years ago - becoming the most expensive sneakers ever sold at auction.\n\nSotheby's Head of Streetwear and Modern Collectables, Braham Wachter, says someone bought them as a single lot for 2.2 million dollars.\n\n“And, you know, he won that game. He scored 37 points. They're in remarkable condition with beautiful, big silver signatures. And, you know, they are game worn by him. And so, it's really kind of a spectacular specimen.”\n\nDespite that incredible sum of money, it still fell short of Michael Jordan's jersey from the 1998 NBA basketball finals game one which sold for $15 million dollars last year.\n\nYet even that sale was eclipsed by the auction of a jersey worn by the famous baseball player Babe Ruth during the 1932 World Series - which went for more than $24 million in 2024.\n\nBack home, Lee Hames says expectations were always high for this Sir Don Bradman baggy green, and he is glad it will remain in Australia for cricket fans to appreciate.\n\nHe says people pay good sums of money for such items not just because of the potential for an increase in value, but to feel connected to the history of the sports they love.\n\n“There's nothing more important to Australians in sporting terms than cricket, and there's no-one more important than the Don.”\n\n1947 Newscaster: \"But the crowd needn't worry. Don makes it in a single and the whole ground goes wild.\"",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/australian-open-2026-live-updates-swiatek-anisimova-djokovic-sinner-in-star-studded-quarters-aussies-in-doubles-quarters-semis-action-20260127-p5nxf5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian Open 2026 LIVE updates: Rybakina tests Swiatek; Anisimova, Djokovic, Sinner in star-studded quarters; Aussies in doubles quarters, semis action",
    "publish_date": "Wed, 28 Jan 2026 13:23:54 +1100",
    "category": "sports",
    "authors": [
      "Angus Delaney",
      "Roy Ward"
    ],
    "text": "Novak Djokovic may be the undisputed king of tennis, but he’s also a big fan of other sports. And he’s always there to cheer on Serbian sports stars.\n\nThere’s lots going on at the moment, with the national waterpolo team crowned European champions in Belgrade this week, and basketball team Crvena zvezda taking on Greek Olympiacos in the EuroLeague competition in Athens in February.\n\nNovak Djokovic in action on Rod Laver Arena during the tournament. Credit: Chris Hopkins\n\nZvezda forward, Nigerian Chima Moneke, said he was thrilled he and his team had the support of the tennis GOAT. The Triple Threat Show podcaster said he’d frequently exchanged texts with the tennis great, a huge Zvezda fan.\n\n“He’s amazing. He always texts me after big wins and even after some losses. When we had tough times, he said, ‘We still believe in you guys’,” Moneke said.\n\n“A big shout out to Novak, and see you in Athens, my friend!”\n\nFun fact: Moneke is the son of Nigerian diplomats. He grew up and played basketball in Canberra before heading to the US.\n\nChima Moneke in his playing days in Canberra in 2018. Credit: Sitthixay Ditthavong\n\nThe basketball star said he couldn’t believe it when Djokovic started following him on social media after a victory over Real Madrid. The pair have since exchanged private messages and Moneke invited Djokovic to dinner after what he hoped would be the superb Serb’s 11th AO title.\n\nSpeaking to reporters in Serbian at the Open, Djokovic said he was gripped by basketball fever and would watch the Zvezda-Olympiakos match in Athens, where he now lives.\n\nIn his podcast, Moneke praised Djokovic for helping him through injury.\n\n“When I had an adductor injury, he sent me a three-minute voice message. Yes, I swear. He gave me advice and helped me with my rehabilitation, suggested who to work with and things like that,” Moneke said.",
    "source": "TheAge",
    "cluster_id": 15
  },
  {
    "url": "https://www.theage.com.au/business/companies/infini-zeroes-in-on-discovery-in-canadian-uranium-heartland-20260128-p5nxor.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Infini zeroes in on discovery in Canadian uranium heartland",
    "publish_date": "Wed, 28 Jan 2026 13:20:23 +1100",
    "category": "finance",
    "authors": [
      "Andrew Todd"
    ],
    "text": "Advertisement\n\nSponsored BusinessCompaniesBulls N' Bears Infini zeroes in on discovery in Canadian uranium heartland Brought to you by BULLS N’ BEARS Andrew Todd January 28, 2026 — 1:20pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nInfini Resources has completed an advanced drill-targeting analysis at its expanded Reitenbach Lake uranium project, in Canada’s world-class Athabasca basin, confirming extensions of key conductive trends that align with uranium highs ahead of a maiden drilling campaign next quarter. The company’s airborne electromagnetic (EM) interpretation revealed conductive horizons from the original Reitenbach Lake holdings that extend some 20 kilometres into the company’s newly staked ground, creating a 20km by 5km prospective uranium corridor. Infini Resources’ Reitenbach Lake project in Canada’s world-class Athabasca basin. Combined with existing conductors across the adjacent Reynolds Lake and Reitenbach Lake projects, Infini has now mapped out roughly 80 km of total EM strike length across the broader area. The company believes the conductors consist of graphitic schists and structurally controlled features considered prime real estate for basement-hosted uranium mineralisation, typical of the Athabasca Basin’s unconformity-style systems.\n\nAdvertisement\n\nA desktop review of historical exploration records over the expanded claims identified elevated uranium-in-lake-sediment geochemistry, with multiple zones lining up with the new EM conductors, major shear zones, cross-cutting structures and airborne radiometric highs. ‘This analysis really highlights the size of the opportunity we are dealing with.’ Infini Resources CEO Rohan Bone The overlapping datasets have highlighted several compelling target areas ripe for testing, with priority rankings set to be finalised in the coming quarter. The company says the combined results have boosted the case for a large, coherent uranium system, building directly on recent surface rock-chip assays that have already confirmed high-grade primary uranium at its Titus prospect. Infini Resources chief executive officer Rohan Bone said: “Identifying an additional ~20 x 5 km prospective EM corridor across our recently expanded tenements, and now having approximately 80 kilometres of EM conductors defined across the broader project area, really highlights the size of the opportunity we are dealing with.”\n\nAdvertisement\n\nThe Reynolds Lake and Reitenbach Lake projects, together, cover 1021 square kilometres of contiguous ground on the eastern margin of the Athabasca Basin in northern Saskatchewan, a region highly prospective for unconformity-style uranium deposits. The deposits mirror those behind some of the world’s richest uranium mines, such as Cameco Corporation’s Rabbit Lake and Eagle Point operations, which have collectively produced more than 230 million pounds of uranium from the Athabasca. The basin remains one of the world’s premier uranium powerhouses, supplying about 20 per cent of global output. Uranium forecasts remain strongly bullish, with some analysts forecasting prices as high as US$135 (A$201) per pound, driven by energy-hungry AI- data centres and the growing role of nuclear power as a reliable, carbon-free energy source. With datasets zeroing in on high-priority corridors and maiden drilling approaching, Infini looks primed for its first crack at a proper uranium discovery in the fabled Athabasca basin. Is your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: Bulls N' Bears\n\nSharemarket\n\nShares",
    "source": "TheAge",
    "cluster_id": 14
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-as-wall-street-advances-a-eyes-us70c-20260128-p5nxi8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX loses steam as inflation surprise boosts rate rise chances",
    "publish_date": "Wed, 28 Jan 2026 13:11:42 +1100",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "Advertisement\n\nUpdated BusinessMarketsWorld markets ASX loses steam as inflation surprise boosts rate rise chances Staff reporter Updated January 28, 2026 — 1:11pm ,first published January 28, 2026 — 5:23am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nThe Australian sharemarket has shed early gains after the country’s latest consumer price data revealed higher than expected inflation, significantly raising the chances of an interest rate hike. The S&P/ASX 200 was flat at 8941.3 in early afternoon trade, with seven of 11 industry sectors in the red. The Australian dollar has broken through the US70¢ barrier to hit a three-year-high. Wall Street is being driven by a raft of company results this week. Bloomberg December’s consumer price index, released by the Australian Bureau of Statistics, shows prices increased a full percentage point last month, pushing the annual inflation rate up from 3.4 per cent to 3.8 per cent. Underlying inflation, which is closely watched by the Reserve Bank, actually stepped down in December, climbing 0.2 per cent. The RBA sits next week and markets are now rating the chance of an interest rate rise at 70 per cent. That figure was 60 per cent before the latest inflation figures were released.\n\nAdvertisement\n\nOn the ASX, energy shares bounced following a rise in oil prices to their highest since October as US President Donald Trump touted a growing US military presence near Iran. Traders are monitoring the fallout from a sweeping winter storm and a weaker dollar which has boosted the appeal of commodities. Related Article Opinion\n\nTrump's White House What if Trump doesn’t chicken out next time? Stephen Bartholomeusz Senior business columnist Woodside Energy jumped 2.1 per cent. The company signalled on Wednesday a decline in oil and gas output this year despite the long-awaited start-up of its $16 billion Scarborough gas field off Western Australia. The Perth-based fossil fuel giant reported its biggest production year ever, delivering the equivalent of 198.9 million barrels of oil in 2025. But it is expecting output to dip to between 170 million to 186 million barrels this year due to a planned maintenance shutdown at its Pluto gas-processing plant. Santos rose 1.4 per cent and Whitehaven added 0.9 per cent\n\nAdvertisement\n\nThe performance of miners was mixed. BHP, which on Tuesday took Commonwealth Bank’s crown as the most valuable stock on the bourse, added 0.8 per cent, while Rio Tinto added 1 per cent and Fortescue retreated 1.1 per cent. Gold miners rose as Northern Star surged 3.4 per cent and Evolution Mining climbed 1.9 per cent. Financial stocks are steady. Commonwealth Bank is up 0.6 per cent, while National Australia Bank and Westpac edged up 0.1 per cent while ANZ Bank slid 0.1 per cent. The Australian dollar broke through the US70¢ barrier this morning as global turmoil continues to batter the US greenback. Geopolitical turmoil has sent the Aussie dollar surging in recent days and hit its highest mark since early 2023. It was trading at US69.88¢ at 12.28pm AEDT. Overnight, Wall Street ticked to a record as stocks zigzagged under the market’s surface following mixed profit reports from UnitedHealth, General Motors and other big companies. The S&P 500 rose 0.4 per cent and edged past its prior all-time high set a couple of weeks ago, even though more stocks fell within the index than rose. The Dow Jones dropped 408 points, or 0.8 per cent, and the Nasdaq composite climbed 0.9 per cent.\n\nAdvertisement\n\nOn Wall Street, UnitedHealth Group tumbled 19.6 per cent despite reporting a profit for the latest quarter that was slightly better than analysts expected. More attention was on the company’s forecast for revenue in the upcoming year, which fell short of Wall Street’s expectations and could be weaker than it was in 2025. Related Article Opinion\n\nRupert Murdoch Will Murdoch get rewarded for his expensive gift to Trump? Elizabeth Knight Business columnist Health care stocks also felt tremendous pressure from a projected rate increase for Medicare Advantage by the US government, which fell well short of what investors had hoped. Humana skidded by 21.1 per cent, Elevance Health dropped 14.3 per cent and CVS Health sank 14.2 per cent. Supporting the US stock market were gains for General Motors, which rose 8.7 per cent, and hospital-operator HCA Healthcare, which rallied 7.1 per cent. Both delivered profits for the end of 2025 that topped Wall Street’s expectations. Each also approved programs to send billions of dollars to their investors by buying back their own stock. The pressure is on companies to deliver strong growth in profits following record-setting runs for their stock prices. Stock prices tend to follow the path of corporate profits over the long term, and earnings need to rise to quiet criticism that stock prices have grown too expensive.\n\nAdvertisement\n\nSeveral of Wall Street’s most influential stocks will deliver their latest earnings reports later this week. They include Meta Platforms, Microsoft and Tesla on Wednesday and Apple on Thursday. Several of those Big Tech stocks were among the strongest forces lifting the S&P 500 on Tuesday, including gains of 2.2 per cent for Microsoft and 1.1 per cent for Apple. Another way stock prices can look less expensive to investors is if interest rates fall. The US Federal Reserve will announce its next move on interest rates on Wednesday, but the widespread expectation is that it will hold its main interest rate steady for now. Inflation remains stubbornly above the Fed’s 2 per cent target, and lower interest rates could worsen increases in prices for US consumers at the same time that they give the economy a boost. Traders expect the Fed to resume its cuts to interest rates later this year. AP The Market Recap newsletter is a wrap of the day’s trading. Get it each weekday afternoon.\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share More: World markets\n\nWall Street\n\nShares",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/wa-news-live-identity-of-invasion-day-rally-bombmaker-to-be-kept-secret-20260127-p5nxh9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: Identity of Invasion Day rally ‘bombmaker’ to be kept secret",
    "publish_date": "Wed, 28 Jan 2026 13:09:21 +1100",
    "category": "finance",
    "authors": [],
    "text": "To education news now and Elite Perth private school St Hilda’s Anglican School for Girls has vowed to erase all identifiable images of its students from its social media platforms over concerns they could be used to create deepfakes.\n\nThe school posted to their website on Tuesday afternoon announcing the change and said that they were taking “bold, future‑focused steps to protect the privacy, dignity, and digital wellbeing of our girls”.\n\nSt Hilda’s will remove identifiable photos of students from its social media platforms. Holly Thompson/ Supplied\n\nThe step is preventative, with the school confirming they were not aware of any student images being used or altered via artificial intelligence.\n\n“With the rise of artificial intelligence, photo manipulation and deepfake technology have become increasingly sophisticated, creating risks for young people that did not exist even five years ago,” the school wrote.\n\n“Around the world, there have been cases where school images were taken from public social media pages, altered using AI, and turned into harmful deepfakes.\n\n“Once a photo is shared publicly, anyone can download it, manipulate it, or distribute it, and the school or family may never know.“\n\nParents will still be able to access photos through a password-protected gallery, while any images posted to social media will be of feature side profiles, silhouettes, backs of heads, distant group shots, creative filters, or approved stock photography.\n\nThe school said this shift tied in with the new social media ban for under-16s.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-mp-colin-boyce-to-move-spill-motion-for-national-party-leadership-liberal-senator-says-the-west-has-been-too-nice-20260128-p5nxig.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: MP Colin Boyce to move spill motion for National Party leadership; Liberal senator says the West has ‘probably been too nice’ about Islam",
    "publish_date": "Wed, 28 Jan 2026 13:09:08 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine",
      "Alexander Darling"
    ],
    "text": "The inflation data has forced one of the nation’s big lenders to change its tip for the Reserve Bank’s next move.\n\nEconomists at the ANZ, which had been tipping the RBA to use its meeting next week to keep the cash rate steady at 3.6 per cent, now believe it will instead lift it by a quarter percentage point.\n\nANZ economits say a lift in the cash rate is now on the cards. Eamon Gallagher\n\nThey said with the key measure of underlying inflation coming in at 3.35 per cent, and unemployment edging down to 4.1 per cent in December, a lift in the cash rate was now on the cards next Tuesday.\n\n“In the wake of an interest rate increase we would anticipate material softening in leading indicators of activity, such as auction clearance rates, consumer sentiment and business conditions/confidence,” they said in a statement.\n\n“That will weaken the activity case for further rate rises beyond the one we expect. And while price pressures lifted through the second half of 2025, most top-down inflation indicators continue to suggest that a moderation of inflation back into the target range is likely over 2026 and into 2027.”\n\n“Accordingly, we view this as a single ‘insurance’ tightening, not the start of a series of rate hikes.”",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/national/police-have-released-footage-of-a-man-following-alleged-sexual-act-on-train-20260128-p5nxoq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Police have released footage of a man following alleged sexual act on train",
    "publish_date": "Wed, 28 Jan 2026 13:08:58 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/victoria/world-in-pictures-january-28-2026-20260128-p5nxo0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "World in pictures, January 28, 2026",
    "publish_date": "Wed, 28 Jan 2026 12:57:13 +1100",
    "category": "sports",
    "authors": [
      "Danie Sprague"
    ],
    "text": "6 / 8\n\nNew York Waterway ferries move as ice floats on the Hudson River seen from the Edge sky deck at Hudson Yards, Tuesday, Jan. 27, 2026, in New York. Credit:AP Photo/Yuki Iwamura",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/rybakina-takes-first-set-20260128-p5nxoe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rybakina takes first set",
    "publish_date": "Wed, 28 Jan 2026 12:53:33 +1100",
    "category": "finance",
    "authors": [],
    "text": "Rybakina takes first set\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/culture/music/the-russian-brainrot-song-taking-children-by-storm-20260128-p5nxnw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Russian brainrot song taking children by storm",
    "publish_date": "Wed, 28 Jan 2026 12:26:30 +1100",
    "category": "finance",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/politics/federal/lift-in-inflation-puts-pressure-on-rba-for-rate-rise-20260128-p5nxjg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lift in inflation puts pressure on RBA for rate rise",
    "publish_date": "Wed, 28 Jan 2026 12:24:59 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "Advertisement\n\nPoliticsFederalInflation Lift in inflation puts pressure on RBA for rate rise Shane Wright January 28, 2026 — 12:24pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA big jump in prices for tourist travel and the end of electricity subsidies has pushed annual inflation to 3.8 per cent but it may not be enough to force the hand of the Reserve Bank. The December consumer price index released by the Australian Bureau of Statistics this morning showed prices increased by a full percentage point last month. Treasurer Jim Chalmers. Alex Ellinghausen It pushed the annual inflation rate up from 3.4 per cent to 3.8 per cent.It was driven by electricity prices which, at an annual rate, grew by 21.5 per cent over the year compared to 19.7 per cent in the 12 months to November. The end of power subsidies in both Queensland and Western Australia contributed to the lift.\n\nAdvertisement\n\nThat’s reflected in the inflation rates of the capital cities. The highest are in Brisbane (at 5.2 per cent) while Perth is the second highest in the nation at 4.4 per cent. Both Darwin and Melbourne have the lowest inflation rates at 3.1 per cent. There was also a large jump in travel and accommodation prices in December as Australians went on holidays. Domestic holiday prices jumped by 8.2 per cent last month, which the bureau attributed to strong demand through the school holidays and the Ashes Test series. International travel costs soared by 24.4 per cent last month due to a sharp jump in airfares.\n\nAdvertisement\n\nWhile overall prices did lift, the bureau noted that once seasonal factors were taken into account, prices increased by a much more modest 0.2 per cent. Underlying inflation, which is closely watched by the Reserve Bank, actually stepped down in December, climbing by 0.2 per cent. That took underlying inflation to 3.3 per cent over the past 12 months, just 0.1 percentage point above the Reserve Bank’s own forecasts for the period. The bank sits next week with markets putting the chance of an interest rate rise at 60 per cent. On the numbers being released, the Australian dollar - which climbed over US70 cents for the first time in three years - lifted on expectations of a rate rise. But as the figures were processed by analysts, the dollar eased below the US70 mark.\n\nAdvertisement\n\nThe figures are the bureau’s recent monthly measure of inflation. The Reserve is closely watching the long-term quarterly movement in inflation. The bureau found that over the December quarter, prices lifted by 0.6 per cent - well down on the 1.3 per cent spike in the September quarter. It was the lowest quarterly result since December 2024. Rent inflation eased slightly to 3.9 per cent from 4 per cent, with the bureau noting that vacancy rates across all capital cities have been stable over the past year. Food inflation lifted to 3.4 per cent, with the weather and demand for Australian beef out of the United States continuing to be major factors. Beef and lamb prices lifted by 10 per cent through the year due to strong overseas demand.\n\nAdvertisement\n\nFruit and vegetable prices lifted by 4 per cent, up from 2.7 per cent in September. The bureau said shortages of cucumbers, zucchinis, capsicums and apples caused by poor weather were key factors for the higher prices. Asked whether he would take responsibility for the rise in inflation, Treasurer Jim Chalmers said, “I take responsibility for doing my job to address this inflation challenge in our economy, to address the productivity challenge in our economy, and also to do what we can to make our economy more resilient in the face of all this global economic uncertainty.“ more to come...",
    "source": "TheAge",
    "cluster_id": 10
  },
  {
    "url": "https://www.theage.com.au/goodfood/brisbane-eating-out/is-this-75-stunner-brisbane-s-best-pasta-20260127-p5nx9s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Is this $75 stunner Brisbane’s best pasta?",
    "publish_date": "Wed, 28 Jan 2026 12:23:28 +1100",
    "category": "finance",
    "authors": [
      "Matt Shea"
    ],
    "text": "Advertisement\n\nEating outFood Is this $75 stunner Brisbane’s best pasta? South Bank’s Otto restaurant isn’t cheap, but it’s just about always excellent value, and nothing exemplifies that better than this spectacular dish. Matt Shea January 28, 2026 Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nOtto Brisbane isn’t cheap. But it is good value. That statement might seem counterintuitive when you can easily walk out of this South Bank restaurant having paid well in excess of $400 for two people. But an experienced diner will likely look down at their itemised bill, shrug and think, “Yep, worth it”. The champagne lobster spaghettini was added to Otto’s menu around 2018-2019 and never left. Nothing on this upmarket Italian’s menu captures its penchant for high-end value like its champagne lobster spaghettini. This thing clocks in at $55 for an entree and $75 for a main, but we’d wager it’s worth every penny. And whether you think of it as expensive perhaps depends on your love of lobster (more on that later). Served with garlic, chilli, white wine, lemon butter and bottarga, something this divine shouldn’t be this simple. But its original appearance on the menu at Otto also signified a changing attitude towards seafood in this city, both in demand and supply.\n\nAdvertisement\n\nRelated Article This ugly-delicious Happy Boy classic is one of Brisbane’s best dishes Head chef Will Cowper introduced the dish as a special back in 2018 or 2019 – he can’t remember exactly when. Restaurant reviews, news and the hottest openings served to your inbox. Sign up “Champagne lobster was first brought to me by Jules [Crocker] from Joto Fresh Fish [in Sydney],” Cowper says. “When I first came to Brisbane, I felt seafood was a bit forgotten about. All the good seafood was caught in Queensland but bypassed Brisbane to go to Sydney or Melbourne. “So I used Jules to send stuff directly to me. Eventually, he put the champagne lobster in front of me.” The champagne lobster spaghettini suits Otto’s peerless waterside location. Courtesy of Otto Brisbane\n\nAdvertisement\n\nThe other timely aspect of the spaghettini? The lobster was bycatch, and Cowper’s invention of the dish signposted a greater industry interest in utilising seafood that would have traditionally been discarded. “Eventually, it got to a point where I said to Jules, ‘I want to put this on permanently. How much can you get?’” Cowper says. “He was, like, ‘It’s not that simple’. But eventually, it was him working with the fishers and saying, ‘we’ll take everything you can get’, and it stayed that way.” These days, Otto’s chefs shift between four and five tonnes of champagne lobster a year, so they order it pre-processed to more easily separate the heads and shells for a stock. The dish is just viscous enough to allow the spaghettini to easily twirl around the fork. Nikki To Otherwise, it’s a relatively simple dish based on a traditional aglio e olio, Cowper sauteing off some chilli and garlic in olive oil, before deglazing the pan with white wine, and adding the stock.\n\nAdvertisement\n\n“Then we add the pasta and the lobster, and then the butter, then some dill and parsley, and we finish it with bottarga. It might surprise some people how fast it comes together in the kitchen.” Expensive pastas are often big and bold, but Cowper’s dish is about getting out of the way of the gentle sweetness of the lobster. It’s refined and delicate, the bottarga providing just the right amount of punch, the lemon butter just viscous enough to allow the spaghettini to easily twirl around the fork and give the dish a luscious mouthfeel. Related Article Exclusive The old King Arthur Cafe is transforming into a Euro-influenced all-day eatery It’s a spectacular piece of cooking, perfectly pitched both on the plate and for Otto’s priceless waterside location. “Rock lobster pastas can often range up to $300, so I think ours is quite reasonably priced,” Cowper says. “And we haven’t really changed that price. It’s always been around that $70 mark for a main course. “Some might not understand that price, but what’s inside the dish is what it’s all about. Everything I do is about getting the best-quality produce for our guests. It’s lobster pasta that’s accessible, and I think it’s a steal.”\n\nSave You have reached your maximum number of saved items. Remove items from your saved list to add more. Share License this article More: Food\n\nFor subscribers Matt Shea is Food and Culture Editor at Brisbane Times. He is a former editor and editor-at-large at Broadsheet Brisbane, and has written for Escape, Qantas Magazine, the Guardian, Jetstar Magazine and SilverKris, among many others.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/lifestyle/carlos-alcaraz-receives-marriage-proposals-from-the-australian-open-crowd-20260128-p5nxnk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Carlos Alcaraz receives marriage proposals from the Australian Open crowd",
    "publish_date": "Wed, 28 Jan 2026 12:12:26 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/business/companies/pure-damage-control-lululemon-roasted-over-handling-of-see-through-leggings-saga-20260127-p5nxaa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Pure damage control’: Lululemon roasted over handling of see-through leggings saga",
    "publish_date": "Wed, 28 Jan 2026 12:00:42 +1100",
    "category": "finance",
    "authors": [
      "Jessica Yun"
    ],
    "text": "Advertisement\n\nBusinessCompaniesFashion retail ‘Pure damage control’: Lululemon roasted over handling of see-through leggings saga Jessica Yun January 28, 2026 — 12:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nLululemon is facing sustained criticism from customers over its handling of a controversial range of leggings and shorts, which it temporarily stopped selling in the US following complaints they were too sheer, sparking concerns the global company is losing its edge. In early January, the activewear brand released its Get Low range of a set of tights, shorts, and a tank top that it said were “designed for training” and to “naturally flex apart at key tension points”. Lululemon has sustained criticism over its Get Low tights that customers have complained are too sheer. Various Customers were critical on social media about the tights not being “squat proof” and for being so sheer they could see their underwear. “The leggings are absolutely see through when you squat or bend over (in every color way),” said a Reddit user in a post claiming to be an “educator”, which is what the company calls its retail staff.\n\nAdvertisement\n\n“It blows my mind how something makes it on the floor with issues like that,” said another. “How did no one do a back squat before sign off?” Related Article Supermarket wars ‘The missing piece’: Amazon will deliver fresh food for the first time On January 20, the company halted online sales in the US to “better understand guest feedback” before returning the item to its website three days later with a new product description advising customers on how to wear the leggings. Descriptions have also been updated in other markets. “To experience this tight’s best performance during your workout, we recommend sizing up,” the Australian product listing states. “Pair with skin-tone, seamless underwear.”\n\nAdvertisement\n\nLululemon, a US$22.6 billion company headquartered in Canada but listed on the tech-dominated NASDAQ stock exchange, has lost roughly half its market value in the past 12 months. The company stock plummeted 6.5 per cent the day it paused the Get Low line, exacerbated by a scathing attack from Lululemon company founder Chip Wilson, who started the company in 1998 but resigned from the board in 2015 amid public spats with other board directors. “It blows my mind how something makes it on the floor with issues like that. How did no one do a back squat before sign off?” A customer’s complaint about the tights. Pausing sales was “a total operational failure” by the company’s current management, he said. “I’ve believed that lululemon has lost its cool for some time, but it is now evident to me that the Company has completely lost its way as a leader in technical apparel,” he wrote in a LinkedIn post.\n\nAdvertisement\n\n“It is clear that persistent failures like this are born out of this Board’s lack of experience in creative businesses, disinterest in product development and quality, and focus on short-term, self-interested priorities. How could anyone reach a conclusion other than the Board continues to make decisions that are destroying the brand and the stock price?” Related Article Sunday Life If you need new activewear, this brand could be the ‘next Lululemon’ In a statement, a Lululemon company spokesperson said the Get Low collection remains for sale in US stores and online in Australia. “Based on the learnings, we have updated our product education information to incorporate new guidance on fit, sizing, and features to better support guest purchase decisions,” they said. When this masthead went to visit Lululemon’s store in Sydney’s Wynyard, the Get Low collection was not displayed but was available for sale when asked. Many customers queried the product development process, asking if there was adequate testing before the items were approved for sale.\n\nAdvertisement\n\n“What is the point of product development if these issues aren’t spotted before they get on the shelves[?]” commented a user on Reddit. “Don’t brands usually have athletes test prototypes to avoid this kind of thing???” “This issue should have been found in testing right away,” said another. Wilson’s acrimonious departure from the company was partially fuelled by a similar saga in mid-2024 when the company was forced to recall its Breezethrough leggings. Designed for yoga, Pilates and for “hot studio” workouts, those leggings received negative reviews from customers who said they created an unflattering “long butt” effect and a waistband that dug into the stomach or rolled down during movement. Lululemon pulled the entire range three weeks after its launch. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
    "source": "TheAge",
    "cluster_id": 23
  }
]