[
    {
        "url": "https://www.9news.com.au/national/australia-post-stamp-price-hike-green-lit-by-consumer-watchdog-accc-prices-to-rise-from-july/29485e45-def3-4984-a40a-4f51d2dfa768",
        "title": "Stamp price hikes coming next month after watchdog decision",
        "publish_date": "Mon, 23 Jun 2025 00:53:56 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "Australia Post stamp price hikes of up to 60c per letter can be expected from next month after the national consumer watchdog announced it would not oppose the changes.\n\nThe Australian Competition and Consumer Commission (ACCC) today said it will not object to Australia Post's 13.3 per cent price increase, which is now slated to take effect from July 17.\n\nUnder the new price system, basic postage rates will rise from $1.50 to $1.70 for small letters, from $3 to $3.40 for ordinary large letters (weighing up to 125g) and $4.50 to $5.10 for the largest letters (up to 250g).\n\nThe cost of a stamp is going up. (Australia Post)\n\nThe price of concession stamps and seasonal greeting cards won't change.\n\n\"We understand that these price increases will mean extra costs for consumers. However, our decision to not object to Australia Post's proposed price increase is based on evidence that the costs to Australia Post of providing the letter service are greater than the revenue it produces,\" ACCC Commissioner Anna Brakey said.\n\nBrakey said Australia Post has incurred \"significant losses\" on its letter services over the past few years.\n\nOn average, the national postal service only delivers around two letters per household each week.\n\nLetter volumes are also expected to plummet by another 10.6 per cent until 2028.\n\nThe ACCC has found it unlikely that Australia Post will recover its letter revenue, even with the proposed price increase.\n\nAustralia Post makes a loss on its letter services. (Getty)\n\n\"Our final decision recommends Australia Post examine ways to alleviate affordability issues for businesses, including those subject to requirements to send physical mail,\" Brakey added.\n\n\"Further we made recommendations to address a number of other concerns expressed by stakeholders during consultation.\n\n\"We are especially mindful of the impact price changes can have on vulnerable Australians, and so our decision paper recommends that Australia Post increases the number of concession stamps per customer, which is currently capped at 50 per year.\"\n\nBrakey noted the price increase of $1.70 for a single postage stamp is still below the median price of $1.93 for private postal operators.\n\nAustralia Post first proposed the price hike in November last year.\n\nWhile the consumer watchdog did not have the authority to approve the proposed increases, it can object to the plan.\n\nUnless rejected by the federal minister for communications, stamp prices are expected to increase from July 17.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/us-iran-conflict-fears-oil-prices-could-surge-us/06fc20e6-bb5b-434b-82b2-952c1e0353d8",
        "title": "Fears oil prices could surge in US after Iran strikes",
        "publish_date": "Mon, 23 Jun 2025 00:25:48 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "The American economy faces the unwelcome prospect of reignited inflation after the US launched strikes on three nuclear facilities in Iran .\n\nHigh oil and petrol prices are a near certainty, experts say. The big question now: how long will the fossil fuels price spike last?\n\nOil prices are expected to rise by about $US5 ($7.72) a barrel when markets open on Sunday night local time, according to experts.\n\nAn oil tanker is loaded at Saudi Aramco's Ras Tanura oil refinery and oil terminal in Saudi Arabia. (Ahmed Jadallah/Reuters/File via CNN)\n\n\"We are looking at $US80 oil on the open,\" said Andy Lipow of Lipow Oil Associates.\n\nUS oil hasn't closed above $US80 a barrel since January and has largely hovered between $US60 and $US75 a barrel since August 2024.\n\nRelatively tame oil prices have lowered petrol prices to below $US3 a gallon (about $1.22 a litre) in many parts of the country, a major source of price relief for inflation-weary consumers.\n\nIt's unclear if any major spike in oil prices will be sustained for a long period. Oil prices have risen about 10 per cent since Israel's surprise attack on June 13 and then fell on Friday after US President Donald Trump announced a two-week deadline on whether to strike Iran.\n\nOil tankers have in the past been attacked in the Strait of Hormuz. (AAP)\n\n\"One shouldn't necessarily assume that just because the price of oil goes up, it's going to stay there. It doesn't,\" said Joe Brusuelas, chief economist for the accounting firm RSM.\n\nThe direction oil prices take is likely to depend on whether Iran's parliament decides to block the Strait of Hormuz, a key trade route that accounts for about 20 per cent of the world's crude oil.\n\nOn Sunday, Iran's Foreign Minister Abbas Araghchi said his country had \"a variety of options\" when deciding on how to respond to the US attacks; and a prominent adviser to Iran's supreme leader has already called for the closure of the Strait of Hormuz.\n\nThis satellite image provided by Maxar Technologies shows the Fordow enrichment facility in Iran after the US strikes. (Maxar Technologies)\n\nBob McNally, president of consulting firm Rapidan Energy Group and former energy adviser to president George W Bush, said that should Iran cut off the world's oil supply by closing the strait, it would risk more military force from the US and its allies.\n\nIran could also attack infrastructure in the Persian Gulf that treated and exported oil and gas.\n\n\"It's possible they will decide the only thing that can dissuade President Trump is the fear of an oil price spike,\" he said.\n\n\"They have to actually create that fear.\"\n\nAppearing on Fox News, Secretary of State Marco Rubio called on China to prevent Iran from closing the Strait of Hormuz, adding that closing it would do more damage to other economies than the US economy. China buys a third of all oil that comes from the Persian Gulf, while the US buys less than 3 per cent.\n\nMan kicked out over $200 sets Queensland hostel fire that kills 15 View Gallery\n\n\"I encourage the Chinese government in Beijing to call them about that, because they heavily depend on the Strait of Hormuz for their oil,\" Rubio said.\n\nRubio added that closing the strait would hurt other countries' economies more than the US economy.\n\nMeanwhile, American consumers may soon feel a price shock at the pump.\n\n\"It takes five days or so for stations to pass along the prices they see in one day. If oil markets do surge today and then tomorrow, it could start showing up at the pump in a matter of hours,\" said Patrick De Haan, vice president of petroleum analysis at GasBuddy, a fuel tracking platform.\n\nAccording to Lipow, should the Strait of Hormuz be affected, the price of oil could rise to $US100 ($154.50) a barrel, which would raise petrol and diesel prices by about US75 cents a gallon (about 29c a litre) from recent levels.\n\nMeanwhile, US trade policies combined with the Israel-Iran conflict \"strongly suggest inflation will be moving faster and higher over the next 90 days,\" according to Brusuelas. Many mainstream economists argue that the low inflation of the spring represents a calm before the summer storm, when they expect prices to rise because of Trump's tariffs.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/melanoma-treatment-breakthrough-revolutionary-survival-rates-late-stage-cancer-clinical-trials/34aca3e5-5b6e-4c61-b09d-3043642424b5",
        "title": "Revolutionary late-stage melanoma treatment sees survival rates surge",
        "publish_date": "Sat, 21 Jun 2025 09:40:56 +0000",
        "category": "lifestyle",
        "authors": [
            "Jun"
        ],
        "text": "A revolution in the treatment of late-stage melanoma has been reached, with clinical trial results seeing surging survival rates.\n\nDoctors are confident the new therapy approach, which will be subsidised by the Pharmaceutical Benefits Scheme (PBS), will overhaul the treatment of many types of deadly cancers.\n\nA tumour the size of a golf ball saw death come knocking for Matthew Croxford.\n\nA revolution in the treatment of late-stage melanoma has been reached with clinical trial results seeing surging survival rates (Nine)\n\n\"You think - is this it?\" the 52-year-old father-of-two told 9News.\n\n\"And I had a lot of things to still achieve in my life.\"\n\nCroxford was offered to take part in an Australian and Netherlands-driven trial.\n\nThe new therapy has flipped the cancer paradigm on its head, by giving the body the best opportunity to activate its own cancer-fighting defences.\n\n\"It's like the sniffer dogs that find the fruit and veg and drugs at the airport, they're trained against what they need to find,\" The Melanoma Institute's Professor Georgina Long said.\n\n\"By giving immunotherapy before surgery, we train our immune system better against the cancer,\" she said.\n\nA new therapy has flipped the cancer paradigm on its head by giving the body the best opportunity to activate its own cancer-fighting defences. (Nine)\n\nOf the 423 patients with Stage 3 melanoma, one group received usual treatment with surgery first, then a single immunotherapy drug.\n\nThat order was then flipped for the other group, who were given two immunotherapy drugs first to shrink the tumour before surgery.\n\n\"Their chance of the melanoma coming back is next to zero - it's less than five per cent,\" Long said.\n\nSuch revolutionary results have seen the treatment approved to be funded by the PBS - a world first.\n\nMatthew Croxford was offered to take part in an Australian and Netherlands-driven trial. (Nine)\n\nAustralia has the highest rates of melanoma in the world, with one person diagnosed every 30 minutes and a life lost every six hours because of the disease.\n\nAdvances in treatment like this shift a diagnosis that has often been a death sentence to promising odds of survival.\n\n\"I'm effectively cancer-free, I have no side effects whatsoever, and I'm incredibly fortunate,\" Croxford said.\n\n\"It's like the sniffer dogs that find the fruit and veg and drugs at the airport, they're trained against what they need to find,\" The Melanoma Institute's Professor Georgina Long said. (Nine)\n\nThe radical overhaul of traditional treatment is now being explored for other cancers, including lung, triple-negative breast cancer, kidney, head and neck cancers.\n\nThis new treatment for Stage 3 melanoma patients is to be listed on the PBS within months.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/this-30second-fitness-test-can-indicate-how-long-youll-live/7040715f-e06d-4301-8f56-3dc3126380d2",
        "title": "This 30-second fitness test could indicate how long you'll live",
        "publish_date": "Fri, 20 Jun 2025 21:54:34 +0000",
        "category": "lifestyle",
        "authors": [
            "Jun"
        ],
        "text": "A﻿ quick 30-second fitness test can be an indicator of how long you'll live, according to a new study linking mobility and mortality.\n\nThe study from the European Journal of Preventive Cardiology looked at how well men and women could go from a standing position to sitting on the floor before standing back up again, without using their hands, knees, other people or furniture.\n\nThe exercise, called the Sitting-Rising test, scored 4282 men and women between 46 and 75, giving them a final score between 0 to 10 based on their ability to sit and stand.\n\nA﻿ quick 30-second fitness test can be an indicator of how long you'll live, according to a new study linking mobility and mortality. (Getty)\n\nThose with lower scores were found to have higher mortality rates.\n\nMiddle-aged and older people who needed no support to sit or stand were six times less likely to die of heart disease and cardiovascular conditions over the next decade compared to people who wobbled on the way up or down, and had difficulty completing the task.\n\nTest yourself with a partner\n\nAuthor of the study ﻿Claudio Gil Araújo warned not to do this test alone. ﻿\n\nAnyone with a disability, like a hip or spine injury, or anyone with serious joint problems, shouldn't do the test, as it can cause unnecessary pain. ﻿\n\nGet another person to watch you and score your sitting and standing movements by following the Sitting-Rising Test (SRT) system:\n\nPlace a cushion under you to avoid injuries if you fall.\n\nThe test begins with 5 points for the sitting action and 5 points for the rising action, totalling 10 points.\n\nStart with 5 points for the sitting action. Try to lower yourself by crossing one foot in front of the other, and lower yourself.\n\nOne point is subtracted for each support used, such as a hand, forearm or knee.\n\nIf one hand is placed on the knee for support, it counts as a support; deduct one point.\n\nHalf a point (0.5) is subtracted if the action is as unsteady, indicating a partial loss of balance.\n\nA score of 0 is given if the person is not able to sit from the floor without external assistance (like using a table or wall to sit and stand, or with another person's help).\n\nOnce on the floor, begin the standing action. Start with another 5 points.\n\nScore the standing action in the same way, deduct a point for using a support and half a point (0.5) for a wobble.\n\nScore a 0 if they are unable to stand without external help. ﻿\n\nThe final score is obtained by adding the sitting and rising partial scores, resulting in a total score ranging from 0 to 10.\n\nThe test is supposed to measure a range of health aspects, such as muscular health, balance, flexibility and body composition.\n\nREAD MORE: Trump makes Iran attack deadline public\n\nThe test is supposed to measure a range of health aspects, such as muscular health, balance, flexibility and body composition. (Getty)\n\nWhat does my score mean? ﻿\n\nBased on the study, your SRT score provides an indication of your non-aerobic physical fitness. This is linked to your risk of natural death and death caused by cardiovascular disease/illness.\n\nSRT Score of 10 (Perfect Score) :\n\nA perfect score indicates excellent non-aerobic fitness, including muscle strength, flexibility and balance.\n\nA score of 10 is associated with the lowest risk of natural mortality, with a death rate of 3.7 per cent.\n\nThose with a perfect score had a cardiovascular death rate of 0.9 per cent.\n\nSurvival rates in this group after a decade were at 97 per cent.\n\nHigher scores are also related to easier performance of daily activities, increased participation in physical activity, exercise, and sports, and potentially a better overall quality of life\n\nSRT Score of 8 :\n\nA score of 8 typically means you used only one hand or knee for support to sit and rise from the floor\n\nThe natural causes death rate for this group was 11.1 per cent, which is triple the rate of those who scored a perfect 10.\n\nSurvival rates after a decade were at 88 per cent for this group.\n\nSRT Scores of 4.5-7.5 :\n\nA score between 4.5 and 7.5 was associated with an increased risk of premature death\n\nPeople in this group had a 2.23 times increased risk of natural death compared to those with a score of 10\n\nPeople in this group had a 3.25 times increased risk of cardiovascular deaths compared to those with a score of 10\n\nThe death rate for natural causes in this group was 20.4 per cent.\n\nLower SRT scores meant a higher risk of cardiovascular deaths (Getty)\n\nSRT Scores of 0-4 (Lowest Scores) :\n\nScores between 0 to 4 indicate poor non-aerobic fitness.\n\nThese scores were associated with a significantly higher risk of natural and cardiovascular deaths.\n\nPeople in this group had a 3.48 times higher risk of natural death compared to those with a score of 10.\n\nPeople in this group had a 6.05 times higher risk of cardiovascular death compared to those with a score of 10.\n\nThe death rate for natural causes was 42.1 per cent.\n\nSurvival rates in this group after a decade were 73.\n\nThese scores often present with an unhealthy combination of excess body fat, dynapenia (muscle weakness), reduced body flexibility, and poor static balance. This could increase the risk of falls and limit daily activities and exercise, adversely impacting survival\n\nA Rising Score of 0 :\n\nSpecifically indicates an inability to rise alone from the floor . .\n\nNearly half (49.5%) of the participants with this score died during the follow-up period of 10 years.\n\nPeople with this score showed a five to six times higher risk of natural deaths and cardiovascular deaths compared to those with a rising score of 5.\n\nA higher SRT score reflects better physical fitness and is linked to a significantly lower risk of death from natural and cardiovascular causes.\n\nLower scores indicate poorer non-aerobic fitness and a substantially elevated mortality risk.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/author-holden-sheppard-king-of-dirt-novel/105440856",
        "title": "Gay WA author pens 'sliding doors version' of his life if he hadn't come out",
        "publish_date": "Mon, 23 Jun 2025 02:07:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "When he was writing young adult novels, West Australian author Holden Sheppard hid himself in his fiction, splitting his personality and past across different characters.\n\nIt was an act of self-protection, he tells ABC Arts.\n\n\"It was like the sniper couldn't get me because he couldn't work out which one was me.\"\n\nBut Sheppard isn't hiding any more.\n\nHis new book, King of Dirt, his third — and first for adults — features a narrator that's unapologetically based on himself.\n\n'Sliding doors version' of the author\n\nLike Sheppard, King of Dirt's protagonist Jack Brollo is an Italian-Australian gay man who grew up in the town of Geraldton. Both have worked construction jobs, love the Collingwood Magpies and a bourbon, and drive a hotted-up Holden SS ute they call 'Phantom'.\n\nSheppard says \"the world has kind of told me to be a certain way\" — something his writing has pushed back on. (Supplied)\n\nYet the author says Jack — who we first meet as a self-destructive loner prone to fighting and binge-drinking — is a \"sliding doors version\" of himself, a vision of how he could have turned out without the \"love and support\" of his family.\n\n\"If I hadn't come to terms with my sexuality when I was about 20, had stayed in the closet, kept working in Geraldton as a labourer with my dad, and had stayed with women instead of hooking up with guys, then Jack is probably where I would have ended up in my mid-30s,\" Sheppard explains.\n\n\"But he's a bit tougher than me,\" he laughs. \"I think he might beat me in a fight if it came to it. I'm pretty tough, but he's a bit more of a brawler.\"\n\nAn emotionally charged homecoming\n\nIn King of Dirt, Jack is estranged from his family, who rejected him when he was outed as gay in his late teens.\n\nVowing to keep \"hundreds of kilometres between me and Gerro\", he spends years working in short-term remote construction jobs. Then, one day, Rocco — Jack's second cousin and his former best mate — sends him a wedding invitation, bringing him back to his home town.\n\nThere, he confronts the ghosts of his past, including Brick, an old basketball teammate who he was once madly in love with.\n\nListen: ABC Radio National's The Bookshelf Photo shows man with shaved head, beard and moustache sits in a football locked room with arms crossed Kate Evans and Cassie McCullagh discuss Holden Sheppard's King of Dirt, a vibrant gay coming-of-age story set in Geraldton.\n\nBrick is now working as a personal trainer and brings Jack into his world, helping to build his confidence and improve his mental health at the gym.\n\nSheppard says he is irked by how gym culture is often depicted negatively.\n\n\"The gym is something I found in my 20s, and I loved it so much.\n\n\"A lot of people's perception of the gym is rooted in high school locker rooms and how much the jocks were bullies. But gyms are not like that; they're actually super positive. If you're lifting for the first time, you will find nothing but encouragement.\"\n\nEmbracing 'bogan'\n\nSheppard describes The King of Dirt as \"a gay bogan love story\" but he was initially reluctant to embrace the bogan tag.\n\n\"The funny thing is I never thought of myself as a bogan when I was in Geraldton at all. I just thought I was a normal Aussie person.\"\n\nIn King of Dirt, Sheppard returns to the protagonist of his 2019 novel, Invisible Boys, which has been adapted into a six-part series for Stan. (Supplied)\n\nWhile studying literature at university, he was amazed to hear his lecturer describe Kath and Kim as a satire of bogan life.\n\n\"I just thought it was a funny show. I know all these people; that's the culture that I've grown up around,\" he says.\n\nAt university, he initially felt isolated from his artier classmates and wanted to quit.\n\nAfter a summer spent driving an earthmover for his father, he decided to return to university but vowed not to change for anyone.\n\n\"It was just embracing what I actually like, as opposed to what I thought I had to become to be a writer,\" he says. \"I wanted to be a writer but I also wanted to be myself.\"\n\nSheppard even featured as a bogan on ABC TV's You Can't Ask That.\n\n\"Embracing the bogan title has been actually really fun,\" he says.\n\n'A shame not many straight men will pick it up'\n\nSheppard says the transition from writing young adult fiction to adult literature has been freeing, allowing him to fully explore Jack's journey from repression to embracing his sexuality with frank sex scenes.\n\nGrowing up gay in a regional town Photo shows A teenage boy wearing a full-brimmed hat and a teenage boy with blue hair stand on a beach. Invisible Boys is an exploration of the hostile forces confronting four gay teenage boys in a small Australian town, and the very real question of whether they can survive them.\n\n\"There's so much gatekeeping in the young adult space, and frankly, I f***ing hated it,\" he says.\n\n\"It frustrated me a lot to have people [asking]: 'Is this appropriate?' You just want to scream. It's totally fine when it's a boy and a girl but, because it was two boys, it was not appropriate.\n\n\"Hearing that kind of language around your own teenage trauma is incredibly infuriating.\"\n\nSheppard says he didn't want to tone down the sex for straight readers.\n\nIt's a decision that's been vindicated by the positive feedback he's already received from straight men on King of Dirt.\n\nHe says some straight male readers have told him they think it's a shame many of their peers won't read it \"because it's a gay book\". These readers have enjoyed the coming-of-age element of the tale, particularly Jack's struggles with mental ill health, anger and suicide ideation.\n\n\"They could relate to being isolated, or being alienated from people you love. It's about family estrangement and male loneliness, which a lot of us go through, especially once we hit our 30s, whether you're gay, straight or bi,\" Sheppard says.\n\n\"There's a lot in there that straight men can relate to because it's really just about a bloke facing his demons and his past.\"\n\nKing of Dirt is published by Hardie Grant.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/minjee-lee-overcomes-tyranny-of-family-distance-to-win-major/105448314",
        "title": "The family message that stood out as Minjee Lee created golf history",
        "publish_date": "Mon, 23 Jun 2025 01:48:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "The tyranny of distance is something golfers know well.\n\nAs they stand on that tee and look out towards the flag — if they can see it at all — it is only distance that stands between them and their goal.\n\nIt's a stupidly simple game, really.\n\nIn the words of the great and fictional golfer Chubbs Peterson, the charmingly sincere nature of golf is to simply \"send the ball home\".\n\nMinjee Lee knows how to overcome distance, both figuratively and literally. The concept of home, though? That's a little more complicated.\n\nIn rubber-stamping herself as one of Australia's greatest golfers by claiming her third major at the Women's PGA Championship, one comment stood out as Lee paid tribute to her over-achieving family.\n\nMin Woo Lee in action at the Travelers Championship, 2,300km away from his sister's major victory. (Getty Images: Alex Goodlett)\n\n\"Wherever Min is, he's supporting me out there,\" Lee said of little brother and rising golfing star Min Woo Lee.\n\nSuch is the complicated and stacked nature of the men's and women's golfing calendar, these kind of achievements — so epic and history-making that it feels they should be played out surrounded by family — are instead completed not knowing exactly where in the world your only sibling is as you achieve them.\n\nFor what it's worth, Min Woo was in the final round of the Travelers Championship in Cromwell, Connecticut, 2,300km away.\n\nThe same country. But a world away from the champagne showers and unbridled joy of his big sister's big moment.\n\nHaving just crawled towards a 63rd-placed finish, and with a microphone in his face and a sponsorship banner behind him, Min Woo sent the most sincere and warm message he possibly could from the most corporate and staged of settings.\n\nMin Woo Lee smiles after he says \"love you\" in a message to sister Minjee Lee. (Supplied: LGPA)\n\n\"I'm so proud of you,\" he said, having been prompted by the broadcasters to send the message.\n\n\"The last couple of years have been tough and I'm glad to see you back in the winner's circle.\n\n\"I'm proud of you and … ah … love you.\"\n\nOn the final two words, Min Woo's face beamed.\n\nNo doubt the private calls and texts and group chats had lit up with the more candid and fervent messages of inside jokes and gentle ribbing that can only come through that love language that we all have with our closest families and friends.\n\nBut in those two words, Min Woo's warmth towards his sister broke through the corporate barriers, a glimpse of home on a golf tour that so often lacks a true understanding of the concept, with an endless schedule and the constant battle to stay high enough in the rankings to make it all worth it.\n\nMinjee Lee reacts after being shown the video from her brother. (Supplied: NBC)\n\n\"That's so sweet,\" Minjee said when shown the video.\n\n\"We don't get to see each other too much, I feel like I see him more on social media than anything.\n\n\"I do miss him on the road. Just seeing that makes me a little bit emotional.\n\n\"It's just really nice to know that you have your family supporting you no matter where you are in the world, even if you're miles apart.\"\n\nThis is a tour of close calls, of heartbreak, and of missed opportunities, all of which Minjee has gone through since her previous major victory in 2022, with a capitulation in last year's US Open appearing to dent her growing confidence.\n\nAnd through it all, Min Woo has been there for her, even if via that tyranny of distance.\n\nLoading YouTube content\n\n\"This will be Minjee's year,\" Min Woo told the ABC'S Australian Story in March last year.\n\n\"She'll get there, she'll get there.\"\n\nHe turned to his sister during the interview.\n\n\"Not you think you can,\" he said.\n\n\"You will.\"\n\nWith putter in hand, home is a tangible thing. Home is in the hole, then off to the next tee to find home again.\n\nOff the course, though, it's a concept that is much harder to pinpoint for those on the tour, one that differs from that which you and I understand, of our own bed at night, our place on the couch, a hot meal surrounded by our loved ones.\n\nHome is the next hotel at the next event. Home is in the clubhouse weighing up if all of this is worth it.\n\nBut home is also a message from your brother 2,300km away. Home is those final two words of that message and the beaming smile that comes with it.\n\nAnd home is living in the knowledge that even if you don't \"get there\", you'll always have a sibling who believes that you can.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/bendigo-playground-demolished-surprising-strathdale-residents/105407508",
        "title": "Residents furious over surprise playground demolition",
        "publish_date": "Mon, 23 Jun 2025 01:30:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "When eight-year-old Viv was told her local playground had been ripped out without notice, she burst into tears.\n\nViv said she had a small backyard at home and loved visiting the park with her family.\n\n\"I'm annoyed because I just got to touching the ground on the monkey bars and they've just taken it away,\" she said.\n\nHer grandmother Janine Welton is \"appalled\" that she and other neighbours were not notified the playground in the Bendigo suburb of Strathdale was being removed.\n\n\"It was gone before we even knew it was going,\" Ms Welton said.\n\n\"I'm really disappointed.\"\n\nViv, 8, says she spent hours mastering the monkey bars at her local playground. (Supplied: Janine Welton)\n\nThe playground in Sherpa Court was one of 28 earmarked for removal by the Greater Bendigo City Council in a 2019 public space plan.\n\nIts implementation, in some cases years down the track, has left residents shocked.\n\nAileen Smith lives next door to the Sherpa Court play space and was only alerted to its removal by the sound of an angle grinder from over her fence.\n\nShe said the loss had upset the whole neighbourhood.\n\n\"It's not just a park, people have got a connection to this space and it's an extension of our own homes,\" she said.\n\nThe council said in a statement the playground had \"limited access, poor visibility, surveillance and safety\", and was located 260 metres from another play space.\n\nGreater Bendigo Mayor Andrea Metcalf acknowledged residents were not notified and apologised.\n\n\"Residents should be informed when things are going to happen in their areas,\" she said.\n\nThe council said there were \"no immediate plans\" for the future of the site.\n\nJanine and Viv are furious the council did not tell them the playground was being removed. (ABC Central Victoria: Sarah Lawrence)\n\nPlaygrounds, parks to go in Greater Bendigo\n\nThrough the 2019 public space plan, 28 play spaces across Greater Bendigo were expected to be decommissioned.\n\nSome are already gone, and 26 new playgrounds have been proposed over 20 years, according to council documents.\n\nGreater Bendigo City Council director Brian Westley said the plan considered the equitable distribution and proximity of play spaces.\n\n\"In the past four years, there has been an investment of $7 million in new and renewed play spaces across the municipality,\" he said.\n\nThe plan has also led to two small parks being listed for possible sale by the council, after being deemed \"potentially surplus\" land.\n\nKennington resident Hunter Gill said he was suspicious a reserve near him would be sold off by council after a sandpit and cricket nets were removed a few years ago, also without warning.\n\nHe was among dozens of residents who signed a petition calling for the space to be retained, and hoped a playground would be reinstated.\n\nKay Hamilton (front) fears the Greater Bendigo Council will remove a park out the front of her house. (ABC Central Victoria: Sarah Lawrence)\n\nMeanwhile, in Spring Gully, Kay Hamilton was worried the council would sell off her local reserve for a townhouse development.\n\nShe said she saw regular foot traffic through the reserve, which is also a community gathering place, including for the neighbourhood Christmas party.\n\n\"The trees provide pockets of shade through the summer, two of them have public seats under them and the flatness of the site enables activities for the young and the old,\" Ms Hamilton said.\n\nC Metcalf said council would consider community feedback on the potential sale of surplus land before making a decision.\n\nMs Welton said the removal of playgrounds flew in the face of Greater Bendigo's history as Australia's first Child Friendly City, a title awarded by UNICEF in 2007.\n\nWhile it is no longer part of that program, Greater Bendigo is a signatory of the Victorian Child Friendly Cities and Communities Charter.\n\nGreen space a mental health boost\n\nRMIT urban planner Thami Croeser described the removal of playgrounds and green space as \"concerning\".\n\nThami Croeser says green spaces should be seen as essential infrastructure for communities. (ABC News: Danielle Bonica)\n\nDr Croeser said having a park within walking distance could improve cardiovascular health, while green spaces helped people process stress.\n\n\"It helps our mental health and also the sociability factor. It's on those park benches where we see our neighbours and form our communities,\" he said.\n\n\" They play a really important social role. \"\n\nDr Croeser said it was generally rare to have enough green space in urban areas and highlighted the environmental benefits, from creating pockets of cool to absorbing excess stormwater during a flood.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/savannahlander-tourist-train-in-limbo-waiting-repairs/105442520",
        "title": "Major repairs needed to keep 'iconic' outback tourist train on track",
        "publish_date": "Mon, 23 Jun 2025 01:25:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "The operator of an \"iconic\" outback tourist train says its future depends on the Queensland government's willingness to repair a series of damaged rail bridges.\n\nThe Savannahlander takes tourists from Cairns through tropical rainforest to the Gulf Savannah and the old mining towns of Einasleigh and Forsayth, about 250 kilometres from the coast.\n\nOver the course of the four-day return trip passengers take in attractions such as Chillagoe caves, the Undara lava tubes and Cobbold Gorge and stay overnight in local accommodation.\n\nBut severe damage from floods and bushfires over the last three years have rendered the first and last sections of the journey accessible only by road.\n\nCobbold Gorge is one of the major attractions for tourists wanting to ride the Savannahlander. (ABC News)\n\nSimon Terry, the owner of Cobbold Gorge and the Goldfields Hotel in Forsayth, described the line as \"one of the most iconic rail journeys in Australia\".\n\nBut Forsayth station has not welcomed any passengers since the end of 2023, when an old wooden rail bridge was destroyed.\n\nMr Terry said the tiny towns depended on visitors to help \"dollars flow through\".\n\n\"The train has always been a great backstop for tourism in the region and to just wipe it off the itinerary is devastating,\" he said.\n\nThe beginning and end points of the Savannahlander route are closed. (Supplied: Queensland Rail)\n\n'Wrong side of $100m'\n\nThe Savannahlander is run by Cairns Kuranda Steam, whose operations manager Michael Lee is seeking Queensland Rail's commitment to a 10-year plan to repair the the 425km line.\n\nMike Lee wants Queensland Rail to commit to repairs. (Supplied)\n\nA decision on funding is yet to be made but Transport Minister Brent Mickelberg put the cost of repairs at $152 million.\n\nBut Queensland Rail estimated the cost could be as much as $300m over a decade.\n\n\"I would like to see some independent evaluation of what the costs are to repair the bridges, but it is the wrong side of $100 million, let's just say that, for a total package for the whole line,\" Mr Lee said.\n\nDamage to a section of rail between Kuranda and Koah has led to the Savannahlander beginning its journey at Mareeba instead of Cairns.\n\nForsayth station has not had a train arrive since 2023. (ABC Far North: Holly Richardson)\n\nWith its Cairns base cut off, Savannahlander operators had to set up a temporary maintenance workshop inland at Mount Surprise, where extensive maintenance is more difficult and expensive.\n\nThe Savannahlander operating contract is up for extension at the end of this year and negotiations for a new deal between Cairns Kuranda and Queensland Rail are underway.\n\n\"I would be quite prepared to keep this service running for another 12 months, even if we had to remain isolated from Cairns, because I do understand there's a lot of expense involved in the bridges between Kuranda and Koah,\" Mr Lee said.\n\n\" But it's not a long-term sustainable thing as far as maintenance of the rail motors go. \"\n\nThe Savannahlander engine needed to be hauled up the Kuranda Range by truck to operate from Mareeba. (Supplied: Cairns Kuranda Steam)\n\n'State of limbo'\n\nSavannahlander driver Wil Kemp said he felt like he was \"in a state of limbo\".\n\nHe said the Savannahlander generated employment and helped keep families in the small towns it passed through.\n\n\"If you just look at [the cost of repairs] on paper, it probably doesn't make sense,\" Mr Kemp said.\n\n\" But when you see the communities out here and you get a bit of a sense of how much this train means to them, it does start to make sense. \"\n\nThe Savannahlander used to travel through the scenic Kuranda range. (Supplied: Cairns Kuranda Steam)\n\nMr Terry said having sections of the line closed made it difficult to develop tourism packages.\n\nMr Lee said he would like to see repairs to the Copperfield River bridge prioritised to allow the train to cross the spectacular Newcastle Range and get to within 15 minutes of Forsayth.\n\nTourist numbers have dropped slightly and coaches have replaced the train for parts of the journey.\n\n\"One thing we have received, though, is some positive feedback from some people that you might say almost reluctantly did the trip despite the road transport legs,\" Mr Lee said.\n\nQueensland Rail says it spends millions maintaining the line every year. (Supplied: Cairns Kuranda Steam)\n\nThe Savannahlander, now in its 30th year, is the only train that operates between Kuranda and Forsayth.\n\n\"However, Queensland Rail continues to support their operations with a $4.5-million investment in the maintenance of the Mareeba to Forsayth section each year,\" Queensland Rail regional network head Scott Cornish said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/shitty-titty-committee-breast-cancer-support-group-busselton/105440982",
        "title": "Meet the women on a 'slightly unhinged' cancer support mission",
        "publish_date": "Mon, 23 Jun 2025 01:16:22 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When Carol Smith was diagnosed with breast cancer in 2018, she found solace in her connection online with a woman going through the same treatment.\n\nAs well as shock, confusion and a search for answers, the diagnosis and new friendship set off a chain of events that led to a \"slightly unhinged\" development — she joined the \"Shitty Titty Committee\" in her now home city of Busselton, Western Australia, a movement to make sure women don't struggle alone.\n\nMs Smith was 36 when she discovered a lump on her left breast.\n\n\"When they sat me down and said, 'You have breast cancer,' my reaction was just shock,\" she said.\n\n\"I was just completely numb.\n\n\" I would sit up at night on groups looking for advice about what to do because I didn't know anyone who had breast cancer. \"\n\nWithin two weeks, she had her first round of chemotherapy.\n\nCarol Smith has thrown herself into fundraising since she was diagnosed with cancer seven years ago. (Supplied: Carol Smith)\n\nShe turned to the internet to find advice and support from women experiencing the same thing.\n\n\"I had a lot of friends around me [but] just being able to reassure yourself that this symptom is normal, that this medication is meant to make you feel the way you're feeling, and anything like that that non-cancer people wouldn't be able to understand.\"\n\nMs Smith says she relied on strangers on the internet after her breast cancer diagnosis in 2018. (ABC South West WA: Jacqueline Lynch)\n\nMs Smith threw herself into fundraising after her successful treatment.\n\nOn the fifth anniversary of her diagnosis in 2023 she held the first Big Boobie Ball in Busselton, which brought local breast cancer survivors and patients together.\n\nFrom there, the Shitty Titty Committee was formed.\n\nThe support group has grown its membership to about 17 women around the Busselton area.\n\nThe Shitty Titty Committee now has more than a dozen members. (Supplied: Carol Smith)\n\nThe Shitty Titty Committee\n\nKate Grainger gave the group its \"slightly unhinged\" name in 2024.\n\nMs Grainger's breast cancer journey began in 2023 when she travelled from WA's Pilbara region to Busselton Hospital to give birth to her son.\n\nThere, the expecting mother was given a life-changing diagnosis.\n\n\"There was literally cancer coming out of my breast at a very high rate and it had metastasised to my lymph node and it was a grade 3 cancer,\" she said.\n\nKate Grainger had months of cancer treatment, including surgery and chemotherapy. (Supplied: Addie Hockney)\n\n\"They said, 'You're baby is being born tomorrow' … I started chemo when he was nine days old,\" she said.\n\nShe was 1,400 kilometres from home and staying in an Airbnb.\n\nBut she was overwhelmed by the support of her new community, including another cancer patient who set up a \"meal train\" of food deliveries.\n\n\"It was just like giving my heart a hug because I knew I couldn't get up and make my family a meal and I couldn't carry my baby and couldn't hold my two or four-year-old,\" she said.\n\n\"I was very unwell for a very long time.\"\n\nKate Grainger came to Busselton with her family to have a baby but stayed for cancer treatment. (Supplied: Addie Hockney)\n\nNo-one should go through cancer alone\n\nMs Grainger, now 33, had a clear scan in October after long treatment.\n\nShe said she had turned her attention to helping others via the committee.\n\n\"I went to my oncologist a couple of months ago and there was this gorgeous woman sitting in the chair having her chemo infusion … she said, 'What's this Shitty Titty Committee?' and I said, 'Oh, it's just a group of us locals who have had the c-bomb dropped on us and we're just stumbling through it together,'\" she said.\n\n\" I said, 'Would you like to be part of the Shitty Titty Committee? And she said, 'Absolutely.' \"\n\nKate Grainger and Carol Smith are sharing their breast cancer stories to raise awareness and help others (ABC South West WA : Jacqueline Lynch)\n\nDozens diagnosed every day\n\nThe Cancer Council estimates about 38 people are diagnosed with breast cancer every day in Western Australia.\n\nCancer Council WA supportive care director Melanie Marsh said she was pleased to see country people come together during a \"scary\" time in their lives.\n\n\"It is great to keep the sense of humour in something that can be quite dark for some people [and] it does get the message out there,\" she said.\n\n\"These support groups in regional areas are just fabulous to be able to bring that face-to-face support for people who need it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/telstra-tower-upgrades-safety-issue-outage-in-dalby/105441552",
        "title": "Telstra tower upgrades leave locals unable to make a call for a week",
        "publish_date": "Mon, 23 Jun 2025 00:34:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "A mobile outage caused by 5G upgrades to a Telstra base tower has left many in the Western Downs hub of Dalby in Queensland unable to make or receive calls, texts, or access the internet.\n\nLocals have called it a safety issue, while businesses and medical carers have been at a standstill.\n\nThe town with a population of more than 13,000 people was warned of the disruption last Wednesday via text.\n\nTelstra customers were sent a text warning of impacts to mobile coverage in Dalby. (Supplied)\n\nResidents like Craig Tobin say the outage, expected to last for up to two weeks, is a \"disgrace\".\n\n\"I drove out of Dalby last night until I got signal because my family in Brisbane, elderly parents, didn't know why I didn't have reception for days,\" he said.\n\n\"I can't believe people are saying: 'Ah well, we just don't have phones for up to two weeks.'\n\n\" It's just not good enough. \"\n\nTelstra's regional general manager, May Boisen, said connections like NBN, satellite internet or landline, and calls through wi-fi — as well as other telco providers — have been unaffected.\n\nBut the impact on locals has been significant.\n\n\"I have three Telstra devices; I have no signal on all of them,\" Mr Tobin said.\n\n\"I've been using my Telstra hotspot at home for my wi-fi … I'm not hooked into the NBN yet, as I moved into my house four weeks ago and am waiting for it to be put on.\"\n\nTelstra says NBN, satellite, and landline services, including wi-fi calling, have not been impacted by the tower upgrades. (Supplied: Southern Queensland Country Tourism)\n\nDalby Chamber of Commerce's Anna Story said it was a \"massive\" safety issue and was impacting businesses.\n\n\"EFTPOS is down … and some ATMs are out as well,\" Ms Story said.\n\nAged care facility BlueCare said staff were unable to give or receive calls from clients, and carers were unable to access client details.\n\n\"Clients' safety is impacted as we are unable to call them or their family members to see if they are OK,\" a spokesperson said.\n\n\"Staff are at risk if something happens to them and they can't call for help.\n\n\" Mental health on both clients and staff and undue stress is being caused. \"\n\nThe care provider had purchased an Optus service to work around the problem.\n\nBusinesses in Dalby have vented their frustration of not having access to mobile coverage. (ABC Southern Queensland: Kemii Maguire)\n\nSmaller businesses have also vented their frustrations.\n\n\"I'm so cranky,\" hairdresser Mel Drier said.\n\n\"It's been a real mess around for me and has severely impacted my business.\n\n\"I had a client who cancelled, but I didn't know that because I had no service … I'm having to write down names and numbers and wait until I get home to contact my clients later at night.\"\n\nMany businesses are using cash only, including a medical practice and a local cab company.\n\nUpgrade necessary, says Telstra\n\nDemand on the network was growing by 30 per cent year-on-year, according to Telstra.\n\nMs Boisen said the lengthy upgrades and outages were a necessity.\n\n\"For those that are technically minded, it's actually like a six-sectored mobile base station, which is a big base station,\" she said.\n\n\"This is when it's really important to have that second type of connection … such as NBN, satellite, or landline,\" Ms Boisen said.\n\n\"I'll give you an example. My husband is a diabetic. I don't need the landline, but I have it because mobiles will go down, and we do need to repair mobile base stations.\n\n\"If we misunderstood what our customers were wanting to use our network for, then we wouldn't be upgrading our network.\"\n\n\" We understand people are using the mobile network, that's why we're doing this massive upgrade on the tower in Dalby. \"\n\nTriple-0 calls are diverted through other providers' mobile towers, even when called from a Telstra phone.\n\nAny calls that have not connected through will be investigated by Telstra.\n\nServices are scheduled to come back online progressively by Monday.\n\nFull mobile coverage is expected to be impacted until June 30.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/acdc-australian-tour-2025-power-up-amyl-sniffers-dates-tickets/105448332",
        "title": "AC/DC announce first Australian shows in a decade",
        "publish_date": "Mon, 23 Jun 2025 00:15:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "There'd been rumblings, and now the thunder's struck.\n\nAC/DC, one of our nation's biggest music exports, are returning home for their first Australian shows since 2015.\n\nFronted by iconic guitarist Angus Young and vocalist Brian Johnson, the Australian rock legends will play stadiums in Melbourne (November 12), Sydney (November 21), Adelaide (November 30), Perth (December 4) and Brisbane (December 14).\n\nLoading Instagram content\n\nThe Power Up tour kicked off in Europe last year, where it shifted more than 2 million tickets in 24 hours. It has continued through the US from April, and this month the band will play additional European shows before returning to Australia in November.\n\nWith more than 200 million worldwide album sales, multiple Grammy and ARIA awards, and Rock Hall of Fame status, AC/DC have earned their reputation as Australia's biggest rock band. (Supplied: Christie Goodwin)\n\nThe box office demand for these shows will be intense. AC/DC's past two homecoming tours tallied about 1 million ticket sales, but hopefully with the large gaps between dates, there will be additional shows announced to supply blockbuster demand.\n\nLate 2025 is shaping up to be busy (and costly) for rock fans, with reunited Britpop icons Oasis and Metallica also bringing huge shows to the country from October.\n\nAngus Young on grief, guitar and getting AC/DC back together for a 17th album The rock'n'roll icon speaks to Double J about what it means to be AC/DC in 2020.\n\nThe tour shares its name with the band's 17th studio album, Power Up, which topped the charts upon its release in 2020, making AC/DC the first band to have an Australian number one record in five consecutive decades.\n\nSupporting AC/DC at all dates will be Melbourne/Naarm pub-punks Amyl & The Sniffers.\n\nThe ARIA award-winning group's international profile has exploded in recent years — including a buzzed-about performance at Coachella festival and a slot on US late night TV — thanks to a fun, ferocious live show centred around charismatic ringleader Amy Taylor.\n\nLoading Instagram content\n\nBack In Black, Highway To Hell, Let There Be Rock, TNT, Dirty Deeds Done Dirt Cheap: you can expect to hear plenty of hits from many classic albums at AC/DC's forthcoming dates.\n\nThe band — Johnson, Young, his nephew Stevie Young on guitar, drummer Matt Laug, and bass player Chris Chaney — have been performing a career-spanning set list on the road.\n\nThese dates will be the group's first on home turf since the deaths in 2017 of Malcolm Young, rhythm guitarist, and George Young, influential producer of AC/DC's first five records, and since the childhood home of AC/DC's founding members was mistakenly demolished.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/ngaanyatjarra-council-perth-cbd-base-worries-remote-residents/105409414",
        "title": "Land council's Perth CBD base raises concerns in outback community",
        "publish_date": "Mon, 23 Jun 2025 00:17:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Traditional owners in a far-flung corner of the West Australian desert are concerned the decisions made by a city-based land council could put their country at risk.\n\nPintupi man Winston Green is an anthropologist and plumber who has spent much of his life in the small community of Tjukurla, 350 kilometres west of Uluru and 1,800km north-east of Perth.\n\nHe said many of his family members, including senior Ngaanyatjarra woman Lizzie Marrkilyi Ellis and senior Pintupi man Simon Butler, were particularly concerned about proposed development in the north-western part of their country.\n\n\"I don't believe in mining our sacred land,\" Dr Ellis said.\n\nLizzie Marrkilyi Ellis is a celebrated linguist, who worries about her community of Tjukurla. (ABC Goldfields: Andrew Chounding)\n\nViridian Energie has applied for a petroleum exploration permit over a 6,250-square-kilometre block of the Ngaanyatjarra Lands, which cover thousands of kilometres of Australia's Western Desert.\n\nBut Mr Green said locals had raised concerns about the Ngaanyatjarra Council, which represents communities scattered across an area the size of Victoria, negotiating on their behalf.\n\nHe pointed to the recent situation in Jameson, 330km south, where BHP — Australia's richest mining company — suspended operations at the half-built West Musgrave nickel and copper mine.\n\nAlthough the decision was driven by the plummeting price of nickel, Mr Green said it was a terrible blow to the community, where incomes were low and job prospects were few.\n\n\"From before and after [the mining agreement was in place], if you were to take a photograph and ask yourself 'what has improved?' I'd say not a lot has improved.\"\n\nIn 2023, the Ngaanyatjarra Council shifted its head office from Alice Springs to a high-rise building in St Georges Terrace in Perth's CBD.\n\nMr Green said it left them increasingly disconnected from the communities they represented.\n\n\"They are within almost a stone's throw from the mining giants of the country,\" he said.\n\nHe questioned whether funds from mining agreements would reach remote Ngaanyatjarra communities, or if they would be sunk into administration costs in the city.\n\nHe also questioned why the independent \"non-member director\" positions on the council's board were vacant.\n\nThe Ngaanyatjarra Council said while these directors were an option, they were not required.\n\nThe Ngaanyatjarra Council is based on level 12 of a high-rise building in Perth. (ABC Esperance: Hayden Smith)\n\n'They haven't really helped'\n\nLeigh Nelson, general manager of communities at the Ngaanyatjarra Council, said he understood why community members had questions about the head office's CBD location.\n\nBut he defended the move, saying it better positioned council staff to speak with government agencies, like the federal government's National Indigenous Australians Agency (NIAA), which also had offices nearby.\n\nHe said it was \"not unusual\" for an Aboriginal corporation to have a CBD base.\n\nWhile he said he could not disclose how much it paid in rent, he said it was \"extremely reasonable\".\n\nHe also pointed out it had regional offices and staff throughout the Ngaanyatjarra Lands and Alice Springs.\n\nThe Ngaanyatjarra Lands span a vast area of the Western Desert. (ABC Esperance: Emily Smith)\n\nBut Mr Green and Dr Ellis believed the council should be more accessible, with residents in smaller communities like Tjukurla feeling increasingly forgotten.\n\n\"The Ngaanyatjarra Council, they haven't really helped Tjukurla community and the people advance that much,\" Dr Ellis said.\n\n\"They put all their focus on the other communities.\"\n\nWith native title negotiations conducted as a \"cultural bloc\", the Tjukurla residents fear their interests are being dominated by those of larger communities.\n\nMr Green said many people in Tjukurla were far more connected to the north-eastern part of the region than those in Warburton.\n\nHe said it was important council appreciated those differences when it dealt with resource companies.\n\nCouncil sign-off required\n\nViridian Energie has lodged an application with the WA government to explore for \"gold hydrogen\" and helium north-west of Tjukurla.\n\nDirector John Heugh said before moving forward, it would need to negotiate a cultural heritage agreement with the Ngaanyatjarra Council.\n\nHe said if traditional owners did not want development on their country, the company would not proceed.\n\nBut he said it was bound to honour the land council's decision, not that of individual communities.\n\nViridian Energie has applied for a petroleum exploration permit over a 6,250-square-kilometre block. (Google Earth)\n\n\"[The Ngaanyatjarra Council] are the legitimate representatives of all the people who live there,\" he said.\n\n\" If they say they don't want any resource exploration and development out that way … we'll withdraw the application. \"\n\nQuestions over half-built mine\n\nMr Green also questioned whether the community had sufficiently benefited from the West Musgrave nickel and copper mine, which has been suspended until at least 2027.\n\nRalph Addis, the Ngaanyatjarra Council's executive director of strategy, said the mining agreement had been designed to deliver most benefits once production began and royalty money started flowing.\n\n\"No-one foresaw that the nickel market was going to go south as dramatically as it did,\" he said.\n\n\" So people are feeling pretty disappointed about that. \"\n\nMr Addis said BHP had contributed towards playgroup facility upgrades and purchasing white goods, through about $3.2 million of social investment funding over the past three years.\n\nHe said a \"significant\" pre-production payment went to traditional owners via the council.\n\nMr Green worries about decisions made by the Ngaanyatjarra Council for his community. (Supplied)\n\n\"If we had your standard-variety mining agreement in this circumstance, we'd be in an even worse spot than we are,\" Mr Addis said.\n\n\"So I actually think that [traditional owners], with the council support, negotiated a very solid and very modern mining agreement for the BHP mine.\n\n\" But ultimately, the big benefits really do only flow once you go into production. \"\n\nA BHP spokesperson said it was aware the suspension had been challenging for many Ngaanyatjarra people.\n\nIt is understood BHP is working with the council to review the funding distribution structure.\n\nNew board push\n\nMr Green and Dr Ellis said they were investigating whether they could push for another governance structure, to give them more control over their land and community.\n\nMr Green is investigating whether another governance structure could give his community more control. (Supplied)\n\n\"So that the mining company can hear our voices, the people that's from the land,\" Dr Ellis said.\n\n\"Not from the council side.\"\n\nIt is understood any change would require sign-off from the Ngaanyatjarra Council and the prescribed body corporate Yarnangu Ngaanyatjarraku Parna.\n\nMr Addis said negotiations around the Viridian Energie permit were only in the early stages.\n\n\"But if … there's a gap in understanding of the current state, then that's absolutely something we'd take on board.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/east-coast-investors-government-buy-up-broome-real-estate/105437284",
        "title": "Investors and government housing dominate Broome real estate",
        "publish_date": "Sun, 22 Jun 2025 22:59:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Locals in Western Australia's north are finding themselves priced out of Broome's property market, as east coast investors snap up homes without even seeing them and government-owned employee housing floods the market.\n\nInvestors make up around 50 per cent of property buyers in the remote tourist town, according to local real estate agent Tony Hutchison.\n\nHe said this shift had contributed to local buyers being unable to afford properties in their hometown.\n\nTony Hutchinson says about 50 per cent of property buyers in Broome are investors. (ABC Kimberley: Ben Collins)\n\n\"It's something locals have to compete with … there's more demand and fewer properties available for our local folk,\" Mr Hutchinson said.\n\n\"[Investors] may have sold an investment property in Sydney and Melbourne, and could probably afford to buy two properties up here with that sort of money.\"\n\nMr Hutchinson said some investors bought properties over the phone, without plans to step foot in them.\n\n\"It's just an investment at the end of a computer,\" he said.\n\n\"It's a tricky one because how do you control something like that? It's not like they're foreign buyers; they're all Australian.\n\n\"There's no legislation that restricts it.\"\n\nDouble-edged sword\n\nMedian property prices in Broome have gone up by 13.7 per cent in the past 12 months, according to the Real Estate Institute of WA (REIWA).\n\nAs of May 2025, the median rent in Broome is $1,050.\n\nREIWA president Suzanne Brown said interstate investors often bought homes \"sight unseen\". (ABC News: Keane Bourke)\n\nREIWA president Suzanne Brown said it was a \"double-edged sword\" because while investors added more competition, they also encouraged supply, which helped keep \"rents reasonable\".\n\n\"It is good that we have investors because it helps keep supply high, but eventually tenants want their own home and are competing with investors,\" she said.\n\n\"Interstate investors are definitely not interested in the lifestyle that obviously the locals of the region are.\n\n\"It's more about the yield — it's a very attractive rental market for people to invest in.\"\n\nEmployer-provided housing\n\nIn remote towns like Broome, Government Regional Officer Housing (GROH) properties make up a sizeable proportion of the market.\n\n\"In areas where GROH is a negligible proportion of the overall housing mix, the risk of crowding out private rentals is small,\" the Kimberley Development Commission's latest housing report said.\n\n\"But that risk increases in a place like the Kimberley, where GROH and other employer-provided housing is a far higher proportion of the market.\"\n\nGROH properties make up a far greater share of the Broome market than in other regions, according to the Kimberley Development Commission. (ABC Kimberley: Vanessa Mills)\n\nAs of May 31, there were 531 GROH properties in the Shire of Broome.\n\nA Department of Communities spokesperson said the GROH program ensured communities had access to key services by providing employee housing.\n\n\"The 2025–26 state budget includes nearly $104 million in funding to deliver over 100 more GROH homes across the state,\" they said.\n\n\"The investment doubles the current number of GROH homes to be built in Western Australia.\"\n\nWithout suitable housing, employees may be less incentivised to work in places like Broome, amid soaring demand for essential workers.\n\nInvestors inevitable\n\nBroome shire president Chris Mitchell said locals and businesses were competing with the state government for rental properties.\n\nShire president Chris Mitchell says investors are an inevitable competitor in the Broome property market. (ABC Kimberley: Andy Seabourne)\n\n\"[The state government] has probably got around 80 per cent of our private rental market, which really makes it hard when they will pay a bit more to make sure they get the property,\" he said.\n\nMr Mitchell also said investors were an inevitable competitor in the Broome housing market.\n\n\"If someone's buying one for investment, we'd really prefer them renting out to a local family rather than trying to fill it up as an Airbnb,\" he said.\n\n\"Realistically, houses in residential areas are for residential living.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/rheban-farm-john-kelly-rural-investment-tasmania/105421058",
        "title": "'Investing for the lifestyle and beauty': Tasmanians lead rural investment",
        "publish_date": "Sun, 22 Jun 2025 21:45:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Rheban Farm, a spectacular slice of Tasmania's east coast with 10 kilometres of private beaches, has just sold for about $15 million.\n\nIt is one of three major rural properties in the region to change hands in recent months. And, in a promising sign for the local market, all three sales have been to Tasmanians.\n\n\"The stand-out for us is that it's Tasmanians buying Tasmanian,\" Elders state rural property manager Lachie Dornauf said.\n\n\" These buyers are investing for the lifestyle and beauty, not just the agriculture. \"\n\nRheban Farm includes a 10 kilometre stretch of coastline. (ABC News: Maren Preuss)\n\nThe new owner of Rheban is Hobart City Councillor and former State Cinema owner, John Kelly. For him, the connection to the farm runs deep.\n\n\"Five generations ago, my great-great-grandfather came from Dublin as a convict,\" Mr Kelly said.\n\n\"He served time on Maria Island, just five kilometres across the water from here, working a farm at Long Point. He spent about three or four years there.\"\n\nNow Mr Kelly owns the land across the picturesque waterway from where his ancestor once toiled.\n\n\"To be here with Mercury Passage, Maria Island as the backdrop, heritage buildings, honestly, it doesn't get much better,\" he said.\n\nJohn Kelly says the options for Rheban Farm \"are incredible\". (ABC News: Maren Preuss)\n\n\"Can you possibly imagine him looking over here one day when he's working in the fields, thinking that my great-great-great grandson will have a farm over there? I mean, the synergy of it's quite remarkable really.\"\n\nMr Kelly, while admitting he was \"no farmer\" is keen to re-introduce some livestock on the property.\n\nHe said he was also keen to rejuvenate the land and look at regenerative agriculture, as well as agritourism projects.\n\nRheban Farm includes a number of heritage buildings. (ABC News: Maren Preuss)\n\nBut it's early days — Mr Kelly only took over the property a month ago.\n\n\"I want to kick the dirt, smell the breeze and look at my options because the options are incredible.\n\n\"There's work to be done, but the bones of the property and the buildings — there's a lot of old heritage buildings on here as well. It's just fantastic,\" he said.\n\nMedian farmland prices in Tasmania have been increasing. (ABC News: Maren Preuss)\n\nWhile Rheban is a lifestyle property, Tasmania is still a serious player in productive agriculture.\n\nMedian farmland values in the state have climbed to $23,202 per hectare, and to $27,019 in the state's north-west, according to Bendigo Bank Agribusiness.\n\nBut those strong figures are largely driven by smaller rural parcels under 40 hectares, which attract premium prices. Larger properties are taking longer to sell, and their values have dipped slightly since the highs of 2022.\n\nJohn Kelly took over Rheban Farm a month ago. (ABC News: Maren Preuss)\n\n\"Things have levelled out,\" Mr Dornauf said.\n\n\"But what's growing is national interest. Inquiries from interstate buyers, particularly from South Australia and Victoria, are up 34 per cent in the past year. That reflects how tough the seasons have been over there.\"\n\nMr Dornauf said some of those buyers were syndicates, aiming to spread risk across diverse operations. Water security and climate stability make Tasmania an appealing hedge.\n\n\"When farmers invest interstate, they want to de-risk. Tasmania's water supply helps ensure more consistent returns, whether it's cropping or grazing,\" he said.\n\nOne of the buildings on Rheban Farm on Tasmania's east coast. (ABC News: Maren Preuss)\n\nStill, even the best farms are taking longer to sell.\n\n\"There's a bit of hesitation,\" Bendigo Bank's Tony Anderson said.\n\n\" Buyers are waiting to see if conditions improve, so days on market are increasing across most property types. \"\n\nWith demand for dairy land rising above others, the next big parcel of land that may sell soon is in Tasmania's north-east.\n\nThe sprawling 22,000-hectare property Rushy Lagoon on the state's north-eastern tip has been on the market for 12 months.\n\nIt's believed prospective buyers are conducting due diligence on the land, which has a dairy as well as sheep and beef operations and irrigation.\n\nAll eyes will be on the price it fetches.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/minjee-lee-wins-women-s-pga-championship-third-career-golf-major/105447964",
        "title": "'Sacrificed so much': Minjee's heartfelt tribute to family after major victory",
        "publish_date": "Sun, 22 Jun 2025 21:36:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian Minjee Lee has won the third golf major of her career, claiming the Women's PGA Championship by three shots in Texas.\n\nAfter struggling early with four bogeys through 10 holes, Lee made two clutch birdies on the back nine to finish two-over for the round, and four-under for the tournament.\n\nAmerican Auston Kim, 24, and Thailand's Chanettee Wannasaen, 21, were excellent on Sunday, shooting rounds of four-under 68 and holding the clubhouse lead at one-under.\n\nBut Lee held her nerve on the back nine to win the third major of her career, following the Evian Championship in 2021 and US Open in 2022.\n\nLee becomes the fourth Australian, after Jan Stephenson (three majors), Karrie Webb (seven majors) and Peter Thomson (five majors), to win three or more golf majors in a career.\n\nThe West Australian also joins Yani Tseng, Anna Nordqvist, In Gee Chun and Lydia Ko as the only active players with three or more major titles.\n\n\"A lot of patience out there today,\" Lee said after accepting the winner's trophy.\n\n\"I just felt like some shots were going my way, and some shots weren't. But I knew there were some opportunities coming down the stretch to make some birdies.\n\nMinjee Lee and her caddie Michael Paterson worked well on the greens during the back-nine on Sunday. (AP: LM Otero)\n\n\"I saw every single leaderboard, and I knew exactly where I was. I'd check the scores, then I'd just come back to each shot and try to execute it the best I could.\"\n\nIn tough and windy conditions at Fields Ranch in Frisco, Texas, Lee started the round with a four-shot lead.\n\nAfter a par on the opening hole, that lead became five shots, but there was plenty of work still to do.\n\nLee had three bogeys through eight holes, but was able to finish the front nine on a positive note with her first birdie of the day.\n\nShe gave that shot back on the 10th with a bogey, with her lead down to two shots.\n\nBut a terrific par-saving putt on 13, followed by birdies at the 14th and 15th settled the nerves and set up the win.\n\nA bogey at 16 left Lee with a three-shot lead with two holes to play.\n\nLee was faultless on the par-three 17th, hitting her tee shot to the middle of the green and completing the two-putt for par.\n\nThe family message that stood out as Minjee Lee created golf history Photo shows GettyImages-2220804928 As Minjee Lee won her historic third major, a mention of her golfing brother highlighted the tyranny of distance between the two Australian stars.\n\nLee then ripped a perfect drive down the 18th fairway, relieving any jitters she may have had on the final hole.\n\nLee hit her approach over the green, then scrambled with the putter to save par.\n\nThe sister of PGA Tour star Min Woo Lee paid a heartfelt tribute to her family after pocketing the monster winning and enhancing her status as Australian sport's highest-earning women's athlete.\n\n\"At this point in your career, I mean, my parents have sacrificed so much for me to be here,\" Lee said with her mother and career-long coach greenside.\n\n\"I can't say more things than I've already. It's just extra special that I could win in front of them and obviously wherever Min is, he's supporting me out there.\n\n\"He's a social media nut so he's all on top of that, so it is really cool.\n\n\"And obviously my dad's back in Oz — I don't know what time it is there — but he's tuning in and they've always got my back, so it's really nice and it's great support and unconditional.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/england-v-india-test-cricket-harry-brook-out-for-99/105447976",
        "title": "Heartbreak for England's batting hero as Bumrah joins elite bowling company",
        "publish_date": "Sun, 22 Jun 2025 21:23:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "India led England by 96 runs on the second innings after three riveting days of their test series opener at Headingley overnight.\n\nIndia bowled out the host for 465 at tea to eke out a six-run first-innings lead, and was 2-90 in its second innings when rain stopped play a half-hour early.\n\nOpener Lokesh Rahul was 47 not out with captain Shubman Gill beside him on 6.\n\nHarry Brook led England's batting spree on the day, riding his luck from 0 to 99 until he was out hooking straight to the fielder at deep backward square leg.\n\nHarry Brook puts his hand to his head in despair as Prasidh Krishna celebrates the wicket. (Getty Images: Visionhaus)\n\nBrook was in control of partnerships of 51 with Ben Stokes, 73 with Jamie Smith, and 49 with Chris Woakes. But when he was out at 7-398 England trailed by 73 runs and India would have expected to wrap up the tail with the new ball only five overs old.\n\nBut fast bowling all-rounder Woakes and number nine batter Brydon Carse smashed 55 runs off 44 balls and India needed to give star pacer Jasprit Bumrah a back-breaking fifth spell to mop up.\n\nBumrah took the final two wickets for 5-83, his 12th five-for away from home, tying Kapil Dev's India record.\n\n\"The game is in the balance,\" Bumrah said.\n\n\"We have to bat well. The wicket is a little bit two-paced so it will be an interesting game to come.\"\n\nOllie Pope's unbeaten 100 underpinned England's reply on Saturday but he added only six runs on Sunday before he tried to cut a nothing ball from Prasidh Krishna.\n\nStokes came in and Brook allowed the captain to settle by counterattacking India on his county home ground. Brook charged at Bumrah and Mohammed Siraj for boundaries, drove Krishna on the up, and even pulled off a Rishabh Pant-type falling ramp shot for four that Pant smiled at.\n\nBrook had the most trouble with Ravindra Jadeja's spin. Jadeja was getting the ball to fizz so well that he got Brook's outside edge on 46 but Pant dropped a tough chance at the stumps.\n\nBrook was soon celebrating his 20th fifty-plus score in his 26th test.\n\nStokes was at the crease for nearly an hour for 20 when he feathered Siraj behind.\n\nSmith lasted until just after lunch when he attempted a second six in the last over before the new ball became available. He fell into Krishna's short ball trap, caught deep by Jadeja who, just before he stepped over the boundary, relayed the ball to Sai Sudharsan. Smith made 40 off 52.\n\nWhen Brook was dropped on 82 by slip fielder Yashasvi Jaiswal off Bumrah, it was Jaiswal's second drop of a Bumrah delivery and India's fourth, its most in a test match in five years.\n\nBumrah took up his station on the boundary each time with a smile.\n\n\"I like to enjoy my time on the field so I always smile,\" he said.\n\n\"Nobody is dropping catches purposely and sometimes the cold makes it difficult to catch. I try not to let if affect me and move forwards quickly.\"\n\nAfter 11 boundaries and two sixes by Brook, the crowd anticipated his first Headingley test century until he pulled Krishna straight to Shardul Thakur on the boundary. Brook hung his head back in disbelief.\n\nAs unlucky as Brook was on 99, he was lucky to have scored one run. Before he got off the mark, he was caught in Saturday's last over but Bumrah overstepped. Then he was dropped on 46 and 82.\n\nCan't get enough cricket from Grandstand? Tune in for the latest cricket news, interviews and analysis from the ABC team in the Grandstand Cricket Podcast.\n\nWoakes and Carse prevented India from gaining a sizeable lead by feasting on Siraj and Krishna. Carse was bowled by Siraj on 22 off 23 balls in his first home test. Woakes was bowled by Bumrah on 38, his best test score in a year.\n\nBumrah's 14th five-for in his 46th test put him in the company of Imran Khan, Richard Hadlee, Ian Botham, Dale Steyn, Dennis Lillee and Waqar Younis.\n\nBumrah finally had support from Siraj and Krishna, who took the other five wickets, but they and Thakur were expensive. England on Sunday scored at 4.9 an over.\n\nWhen India started batting, conditions were turning. Gloom forced on the stadium lights and the wind picked up. Rain came as expected.\n\nAfter Jaiswal, the first-innings century-maker, was nipped out by Carse for 4, Rahul and Sudharsan impressively handled the tricky conditions for more than 17 overs.\n\nSudharsan was dropped on 24 by Ben Duckett at backward point, but the damage was minimal as he reached 30 when Stokes got him for the second time in the match.\n\n\"The way Rahul played tonight, getting him out tomorrow is going to be crucial,\" Pope said.\n\n\"We back ourselves to chase a steady score.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/asbestos-yallourn-power-station-call-for-worker-support/105267744",
        "title": "Calls for help as power workers continue to die from asbestos exposure",
        "publish_date": "Sun, 22 Jun 2025 21:21:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "Like many men of his generation, Mick Tomkins does not like to make a fuss.\n\nThe 73-year-old enjoys meeting up with a group of mates to swim at the nearby Traralgon pool most mornings, before a coffee and a chat about the footy.\n\nBut, like many men of his generation, Mr Tomkins is also living with the insidious legacy of being a power station worker in the 1970s, after being diagnosed with terminal mesothelioma last year.\n\n\"It was a bit of a shock,\" he said.\n\nMr Tomkins was just 20 years old when he first took on a role as a subcontractor, helping build the new W station at Yallourn.\n\nFor the young sheet metal worker, it was the prospect of high-paying work that would support his family.\n\n\"That construction was an area I really didn't want to go into, but I had a wife and a couple of kids, so I had to get work and they paid very well out there,\" he said.\n\nMick and Pauline Tomkins married in 1971. The following year, Mick started work at the Yallourn Power Station. (Supplied: Mick and Pauline Tomkins)\n\nThe power industry was booming, with Mr Tomkins joining around 1,000 other contractors onsite at the time.\n\nWhat workers did not realise was that their job exposed them to asbestos on a daily basis.\n\n\"The laggers would go in and put the insulation on the pipes, and we would come in and coat them with sheet metal,\" he said.\n\n\"Most of that insulation was fibreglass, but then we had sectional asbestos over the pipes.\n\n\" You had a lot of asbestos dust … we would bring our overalls home, covered in white. \"\n\nIt would not be until 50 years later that Mr Tomkins and his family would discover the damage caused by this exposure.\n\nThe old Yallourn Power Station circa 1964. (Supplied: GARDS Vic)\n\nDeadly dust\n\nIn 2003, after a series of court cases, asbestos was banned in Australia.\n\nMore than a decade ago, Mr Tomkins and his family started to monitor his condition by getting regular lung compression testing.\n\nThen, about three years ago, Mr Tomkins said he started to develop a cough that would not go away.\n\nHe would soon not be able to walk to the front gate.\n\nA CT scan and a biopsy would later confirm Mr Tomkins had mesothelioma.\n\nMick and his daughter, Brownyn, in 1974. (Supplied: Mick and Pauline Tomkins)\n\nFor the stoic father and grandfather, the news, while devastating, was not unexpected.\n\n\"I didn't panic. In some ways, in the end, I'd sort of half expected it because of the cough,\" he said.\n\n\" It was a bit of a shock, but it would be more of a shock if I was 35 years old. \"\n\nFor Pauline Tomkins, Mr Tomkins' wife of 54 years, and their family, it was confirmation of the worst kind.\n\n\"We just all went quiet, and I just kept looking at the floor,\" she said.\n\n\"It was always in the back of my mind, but the trouble is when it is said to you.\"\n\nWorkers remove asbestos from one of the turbines at the old Hazelwood Power Station. The pile of broken-off asbestos sits to the bottom left of the photo in November 1965. (Supplied: GARDS Vic)\n\nToxic legacy\n\nA 2009 study by Monash University found that former power workers in the Latrobe Valley were contracting mesothelioma at a rate seven times the national average.\n\nThe proliferation of asbestos among Latrobe Valley workers prompted an apology from the then Victorian premier John Brumby at a regional sitting of the 56th parliament at Monash University's Gippsland Campus on October 15, 2008.\n\n\"On behalf of the Victorian government and the community, I want to say sorry and to express our regret for the pain and the suffering felt by some former power industry workers and their families where that was caused by asbestos exposure at the former SECV … It is unacceptable that any person, through the course of their work, is exposed to what we now know is a deadly substance,\" Mr Brumby said.\n\nVicki Hamilton says more needs to be done to help the high number of former power station workers exposed to asbestos. (ABC Gippsland: Danielle Pope)\n\nFor Vicki Hamilton, the CEO and secretary of the Asbestos Council of Victoria (better known as GARDS), the ongoing legacy of illness for the Latrobe Valley hits close to home.\n\nMs Hamilton lost both her father and grandfather to asbestos-related disease, and said despite the high profile nature of asbestos cases, many people mistakenly believed the challenges were behind them.\n\n\"I get a couple of calls a month at least from people who know that they're sick and they are going to see a doctor,\" she said.\n\nMs Hamilton said 140,000 workers were exposed to asbestos between the 1920s and the 1980s.\n\n\"That affected a whole community, and every person, every second or third person in the Latrobe Valley knows somebody who has an asbestos-related disease,\" she said.\n\n\" We might have banned it 20 years ago, but we've got 6.5 million tonnes in the community still there and it's all well past its use-by date. \"\n\nA wall-hanging inside GARDS Vic shows the names of members who have died from asbestos-related diseases. (ABC Gippsland: Danielle Pope)\n\nThe Asbestos Council formed part of a state government task force established in 2019 to review how asbestos was managed in the Latrobe Valley.\n\nIn 2022, the task force made 21 recommendations to minimise the risk and harms of asbestos exposure.\n\nThe recommendations included establishing a statewide centre to manage all asbestos queries, developing targeted awareness campaigns, and mandating training for the handling and removal of asbestos.\n\nHowever, no recommendations had been implemented when the work of the task force culminated in March 2023.\n\nMs Hamilton said more needed to be done as workers continued to come forward with diagnoses.\n\n\"There used to be three support groups in Victoria, but there is just us and I'm battling to get funding,\" she said.\n\n\"I'm very lucky, the state government just helped to fund me for part of my money because, without that, we would have been looking at closing within 12 months because that's about the only money we have left.\"\n\nA Victorian government spokesperson said the government was working to prevent or minimise risks associated with asbestos.\n\n\"Actions underway to address the harmful legacy of asbestos and prevent asbestos-related diseases in Victoria include raising awareness of asbestos risks, prioritising and coordinating the removal of asbestos from Victorian government buildings, establishing convenient disposal points and strengthening compliance and enforcement,\" the spokesperson said.\n\nAfter receiving his diagnosis, Mick Tomkins and his family went on a bucket list holiday to the Kimberley. (Supplied: Mick and Pauline Tomkins)\n\nLiving each day\n\nWith legal help, Mr Tomkins was able to make a claim for compensation against his former employer's insurance company.\n\nNow, he and his family are taking each day as it comes.\n\nMick and Pauline Tomkins, with their son-in-law Jason, daughter Chelsea, and two of their grandchildren Finn and Lucy. (Supplied: Tammie Pittwood)\n\nMr Tomkins is balancing his life with treatment, and so far has found success with immunotherapy to keep his cancer under control.\n\n\"We just take each day now as we go and just do what the doctors say,\" Mr Tomkins said.\n\n\"I don't look like I'm dying, do I?\n\n\"I've had a life, but you know I'd like to still have a longer life actually.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/asx-markets-business-news-live-updates/105447916",
        "title": "Live: Global markets on edge after Iran attack as oil rises",
        "publish_date": "Sun, 22 Jun 2025 21:16:17 +0000",
        "category": "finance",
        "authors": [
            "Stephanie Chalmers",
            "Stephen Letts",
            "Michael Janda",
            "Daniel Ziffer"
        ],
        "text": "Global markets remain on edge about whether Iran will disrupt the flow of oil and gas through the crucial Strait of Hormuz in the wake of the US bombing.\n\nThe price of Brent crude oil is currently up 2.7 per cent, while the ASX and Asian stock markets are falling.\n\nMST Financial senior energy analyst Saul Kavonic joined business reporter Emilia Terzon on ABC News Channel.\n\nHe described the Middle East as \"the most important source of oil and also gas in the world\", noting the Strait of Hormuz is where about 20 per cent of the world's oil and liquefied natural gas supplies transit through to reach global markets.\n\n\"We've never actually seen that level of supply disruption ever occur.\n\n\"Many of us might remember when we saw the energy prices spike in 2022 turn in the wake of the Ukraine war, and for those who are old enough to remember the big oil price shocks in the Iranian revolution in the late 70s and into the 80s.\n\n\"What we're talking about here, if Iran actually carries out what they threaten to do, would be three times the size of the shocks that we've seen in the past.\n\n\"It could drive petrol at the pump to 50 per cent or even double current prices for a period of time and so that's what's got oil prices on edge here.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/carlos-alcaraz-beats-jiri-lehecka-queens-club-wimbledon-warm-up/105447918",
        "title": "Alcaraz makes Wimbledon statement with Queen's Club triumph",
        "publish_date": "Sun, 22 Jun 2025 21:01:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "Top seed Carlos Alcaraz edged powerful Czech Jiri Lehecka 7-5, 6-7 (5), 6-2 to claim his second Queen's Club title and send out a powerful statement ahead of his Wimbledon defence on Sunday.\n\nSpaniard Alcaraz, who triumphed at Queen's a few weeks before claiming his first Wimbledon title in 2023, extended his winning streak to 18 matches but was pushed hard by Lehecka, who underlined his own credentials as a rising force.\n\nAlcaraz, 22, pounced at 5-5 to break the Lehecka serve and duly bagged the opening set in 45 minutes.\n\nLehecka, bidding to become the first Czech to win the Queen's title since Ivan Lendl in 1990, continued going toe-to-toe with the five-time grand slam champion and edged the second-set tie-break with some clinical tennis.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nAlcaraz had more in his locker, though, and forged 4-1 ahead in the decider as Lehecka's level finally began to drop on a breezy Andy Murray Arena in west London.\n\nHe then broke the 23-year-old Lehecka's serve again to complete victory, letting out a roar of delight as Lehecka struck a backhand into the net.\n\nWhile Alcaraz will be seeded number two at Wimbledon behind Jannik Sinner as he bids for a hat-trick of titles there, he will arrive in red-hot form and as the overwhelming favourite.\n\nHe has won 27 of his 28 matches since April, his lone loss coming against Holger Rune in the Barcelona final, and Sunday's win was his fifth title this year.\n\n\"This is really special this trophy and this tournament for me,\" Alcaraz said on court as he clutched the huge piece of silverware.\n\n\"Jiri had an incredible week and his level is very high and it's a nightmare to play against you.\"\n\nLehecka, whose ball-striking and physique are not dissimilar to Lendl's, beat home favourite Jack Draper in the semifinals on Saturday and began full of confidence against Alcaraz whom he defeated at the start of the year in Doha.\n\nWith serve dominating on the slick lawn, there was nothing between the players until Lehecka made a couple of errors at 5-5 and Alcaraz needed no second invitation to take the set.\n\nWomen in Sport Spotlight We put the spotlight on women making a big impact on and off the field in the sporting world — from the grassroots through to the elite level.\n\nThe second set followed a similar pattern, but it was Lehecka who raised his game in the tiebreak to get a mini-break ahead.\n\nAlcaraz replied to win a sensational point at 3-4, sprinting to retrieve a drop shot and then back to chase down a lob.\n\nBut Lehecka did not flinch and banged down an ace. Alcaraz double-faulted at 5-5 and then Lehecka levelled the final.\n\nLehecka was unable to carry that momentum and Alcaraz quickly re-established control and surged to victory.\n\n\"The goal this week was just to compete and have a few matches on the grass and this final was a gift for me,\" Alcaraz said.\n\n\"I just enjoyed the moment and the final, I felt like I was in control most of the time.\"\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/kingston-sewerage-project-top-priority-with-health-concerns/105438294",
        "title": "Sewerage project prioritised after health concerns",
        "publish_date": "Sun, 22 Jun 2025 20:52:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "A South Australian council hopes a project worth up to $25 million to connect sewerage to 651 properties will attract more people to live in the area while addressing concerns about water potentially being contaminated with faeces.\n\nKingston South East has been moved to the top of the list for state government funding for an expanded sewerage system after advice from SA Health to the Kingston District Council about risks to public health and the environment from water being contaminated via aging and non-compliant septic systems.\n\nSome people use bores near neighbours' septic tanks for water in their houses and gardens that can then get contaminated with faeces, council chief executive Ian Hart said.\n\n\"There is an issue with potential groundwater contamination that could be even occurring now and there could be waterway impacts in the environment as well,\" Mr Hart said.\n\n\"The proximity of bores to people's drinking supply and other domestic supply is a real issue in Kingston.\"\n\nIan Hart says the project will boost the town's population. (ABC South East SA: Eugene Boisvert)\n\nResidents to contribute to costs\n\nIf the project goes ahead, property owners where the new Community Wastewater Management System (CWMS) would be connected in the suburbs of Rosetown, Wyomi and Pinks Beach would have to pay a quarter of the cost of the new system, which the council estimates at $1,000 per property per year over 10 years.\n\nThe other three quarters of the money for the new sewerage system would come from the state government via a grant scheme administered by the Local Government Association of South Australia.\n\nPeople would have to pay extra for their block to be connected to the new system.\n\nResident Mark Lively estimated it could cost $23,000 to $28,000 per property, despite many of them already having functional septic systems.\n\n\"This CWMS is basically just being done so the council can get 20 or 30 properties added onto their rate base,\" he said.\n\nKingston resident Mark Lively has been active on social media opposing the new system. (Supplied)\n\nBenefits for development\n\nAbout 270 of the blocks affected are vacant.\n\nPeople who want to build a house on them now have to install holding tanks for their wastewater.\n\nLes Gullickson and his wife, Sharon, are building a house in Kingston that they hope to retire to.\n\nSeptic tanks and holding tanks have to be emptied regularly. (ABC News: Angelique Donnellan)\n\nThey found out about the cost of emptying holding tanks after starting their build.\n\n\"If they don't go ahead with the full sewerage and stuff like that, I think we'll be moving out of Kingston because we can't afford to [live here],\" Mr Gullickson said.\n\n\"If we have to pump it every two weeks, that's a rough estimate of $600 a month.\n\n\"Times that by 12 months in a year, that's quite a few dollars more than what a sewerage system would cost to run, and if we had known that we had to do this, I may not have gone ahead with the build.\"\n\nHelp for housing shortage\n\nMr Hart said the estimated costs were only \"indicative\" until more detailed plans for the system could be drawn up.\n\nHe said properties connected to the sewerage system would increase in value.\n\n\"This project will enable them to build with confidence, and that will help Kingston because it means our town will grow and it means there will be more housing available,\" he said.\n\n\"We know there is a housing shortage, and it will be good for our community.\"\n\nIan Hart says properties connected to the sewerage system will increase in value. (ABC South East SA: Sam Bradbrook)\n\nConsultation sessions on the project will be held this week, with a decision expected in the coming months.\n\nWork would start in mid-2026 and finish a year later.\n\nThe project will not include adding piped drinking water to Rosetown, Wyomi or Pinks Beach.\n\nResidential property owners in the Kingston District Council are facing a 9 per cent rate increase this year, with the council also having to deal with multi-million-dollar projects to fix the Kingston jetty and the Maria Creek boat ramp, as well as ongoing costs related to the Cape Jaffa marina.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-23/royal-darwin-hospital-baby-death-negligence-lexie-nowland-court/105435464",
        "title": "Mother whose baby died after nine-hour wait for help sues Darwin hospital",
        "publish_date": "Sun, 22 Jun 2025 20:34:51 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "The mother of a seven-month-old baby who died at Royal Darwin Hospital (RDH) after waiting more than nine hours to be seen by a doctor is suing the hospital for negligence.\n\nLexie Mae Nowland died from a cardiac arrest at RDH in March 2022 after returning to the Northern Territory from Melbourne, where she received multiple heart surgeries at the Royal Children's Hospital.\n\nHer mother, Melissa Nowland, is now suing the NT government in the Supreme Court on behalf of herself, Lexie's father and her two sisters, for damages for psychiatric injury as well as compensation and burial costs.\n\nA writ released by the court states Lexie was transferred to RDH for ongoing inpatient management for her congenital heart condition in January 2022, and was discharged four days later to be treated as an outpatient.\n\nMelissa Nowland says hospital staff should have advised her to attend the emergency department before the seven-month-old suffered a fatal cardiac arrest. (ABC News: Che Chorley)\n\nOn March 22, she was readmitted for a transition from a nasojejunal feeding tube to a nasogastric tube, before attending the emergency department with symptoms including vomiting, fever and agitation.\n\nLexie was again discharged on March 27, with a review scheduled for the following morning, but Ms Nowland became concerned during the night and rang the hospital.\n\nShe was advised to attend the review and arrived at about 7:30am.\n\n\"The deceased did not undergo clinical review by a paediatric consultant until approximately 1700 hours,\" the writ reads.\n\nAbout 10 minutes later, the writ says Lexie suffered a cardiac arrest and was resuscitated, but she again went into cardiac arrest two hours later and was pronounced dead at 7:25pm.\n\nMs Nowland claims Lexie's treatment \"fell below a reasonable standard of care\" through RDH's failure to \"properly assess, treat and manage\" her condition and to treat her for \"suspected sepsis, dehydration/fluid and electrolyte disturbance\".\n\nLexie died at Royal Darwin Hospital on March 28, almost 12 hours after she arrived on the ward. (ABC News: Michael Franchi)\n\nShe also claims the hospital \"failed to appreciate\" Lexie was a \"high-risk patient with complex needs\" and was \"at risk of acute deterioration\".\n\nShe says RDH also failed to advise her to attend the emergency department on the morning of Lexie's death and failed \"to recognise the parental concern in respect of [her] condition\".\n\n\"The defendant's negligence caused or materially contributed to the deceased's death,\" the document reads.\n\n\"By reason of the defendant's negligence, the plaintiff has suffered nervous shock and has and will continue to suffer injury, loss and damage, including psychiatric injury.\"\n\nThe NT government is yet to file a response to the claim.\n\nThe case is set to return to court for a directions hearing on July 2.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/parramatta-hookers-dangerous-lifting-tackle-20250623-p5m9ke.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Parramatta hooker's dangerous lifting tackle",
        "publish_date": "Mon, 23 Jun 2025 12:09:14 +1000",
        "category": "sports",
        "authors": [],
        "text": "Parramatta hooker's dangerous lifting tackle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/penisini-binned-for-dangerous-lifting-tackle-20250623-p5m9kf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Penisini binned for dangerous lifting tackle",
        "publish_date": "Mon, 23 Jun 2025 12:09:13 +1000",
        "category": "sports",
        "authors": [],
        "text": "Penisini binned for dangerous lifting tackle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/gallen-wants-burton-in-blues-consideration-20250623-p5m9k9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gallen wants Burton in Blues consideration",
        "publish_date": "Mon, 23 Jun 2025 11:59:23 +1000",
        "category": "finance",
        "authors": [],
        "text": "Gallen wants Burton in Blues consideration\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/there-used-to-be-five-big-risks-to-the-australian-budget-that-s-grown-20250620-p5m92j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "There used to be five big risks to the Australian budget. That’s grown",
        "publish_date": "Mon, 23 Jun 2025 11:59:05 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "Loading\n\nSave Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nChalmers and Wright also spoke at length about housing, US commentator Ezra Klein’s influential new book Abundance and how the left is shifting to reclaim part of economics it has long disdained.\n\n“We want good things to happen, we’ve got to stop strangling good things from happening,” Chalmers said. “I think that’s very, very compelling for us.”\n\nCut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/pre-war-cottage-snapped-up-for-just-over-a-million-in-three-minute-auction-20250623-p5m9gp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pre-war cottage snapped up for just over a million in three-minute auction",
        "publish_date": "Mon, 23 Jun 2025 11:57:51 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A termite-riddled cottage in Coorparoo with a rusty bathroom frozen in time sold for $1,096,000 in 180 seconds on Saturday, after four buyers battled it out for a fixer-upper they can’t knock down.\n\nDespite its decaying charm and strict pre-war heritage protections, the three-bedroom, one-bathroom home at 482 Cavendish Road sparked a blink-and-you’ll-miss-it bidding war, with a young couple ultimately paying well over the undisclosed reserve to secure the prize.\n\nBidding for the home started at $850,000 and rapidly rose in $25,000 increments until $1 million, before settling into a flurry of $10,000 and $5000 bids between two buyers who went head-to-head until the hammer fell.\n\n“It does need a lot of work. There’s termite damage everywhere you look,” the selling agent said. Credit: Domain\n\nPerched on a level 627-square-metre block in a tightly held pocket of the suburb, the property offered a rare affordable foothold in a high-demand market, with the young buyers planning to move in and take on a slow-burn renovation to bring the tired home back to life.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/couple-on-their-way-to-be-married-just-miss-out-on-4m-tennyson-point-home-20250623-p5m9go.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Couple on their way to be married just miss out on $4m Tennyson Point home",
        "publish_date": "Mon, 23 Jun 2025 11:56:36 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A couple on their way to the registry to get married first stopped to bid on a Tennyson Point house, which sold for $4,051,000 under the hammer.\n\nSix registered, and all six competed for the four-bedroom home with swimming pool at 71 Champion Road. Belle Property Hunters Hill selling agent Michael Gallina had guided the property at $3.4 million.\n\nBidding opened at $3.42 million and big bids were placed until the price went past the $3.8 million reserve. There is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.\n\nMany neighbours gathered to watch the auctions, Gallina said. Gasps were heard in the crowd because of the competitive spirit shown by the bidders, he said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/the-alarm-bells-should-be-ringing-louder-in-markets-20250623-p5m9h0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The alarm bells should be ringing louder in markets",
        "publish_date": "Mon, 23 Jun 2025 11:56:18 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The surge in oil prices clearly has the potential to go much higher. So far, as appears to be the case with equities and bonds, there seems to be an assumption within the administration and among investors that America’s entry to the conflict and its bombing of Iran’s nuclear facilities represents a conclusion, at least of America’s involvement, rather than a beginning. With Tehran saying that the bombings will trigger “everlasting consequences”, however, that would be a premature assumption. The Strait of Hormuz is a crucial shipping lane for the global economy. Credit: Getty Iran could respond with its own strikes on US targets in the region. It could also do what it has sometimes threatened, but never done, and close the Strait of Hormuz, the vital shipping lane from the Persian Gulf for nearly a third of the world’s oil and 20 per cent of its LNG, either by mining it or by targeting tankers. That would send the oil price soaring above $US100 a barrel, with particular implications for China and Europe.\n\nWhere the US is energy self-sufficient, China and Europe rely on the Middle East for oil and oil-derived products. Europe, after ending its dependence on Russian gas after Russia invaded Ukraine, is now heavily dependent on LNG. China buys about a third of the oil that transits through the Persian Gulf and is the dominant customer for Iranian oil. Israel and the US have, so far, left Iran’s oil export infrastructure, centred on its Kharg Island facility in the gulf, untouched. Loading An escalation in the conflict and disruption, or even a more direct threat of disruption to oil and LNG supplies, would boost inflation rates around the world. Already, the price of jet fuel has jumped nearly 50 per cent, which will eventually flow through to air fares. Energy shocks – and developments in the Middle East could easily produce a full-blown one – have historically had very material and long-lasting effects on advanced economies and their markets, although the global economy, and the US in particular, is much less reliant on oil today than it has been in the past.\n\nIt’s also the case that a spike in the oil price would trigger a frenzy of drilling in the US – shale oil producers respond quickly to prices – which has become a net exporter of energy this decade, and would probably also see increased Russian production. If sustained, it would also accelerate the shift away from fossil fuels towards cleaner energy sources, a safety valve that didn’t exist in the 1970s during the Arab oil embargo after the Yom Kippur War, when an Egyptian-led coalition of Arab states attacked Israel. That embargo ignited a dramatic increase in oil prices and years of stagflation (high levels of inflation with low levels of growth) in the major developed economies. Markets are full of risk, largely created by decisions made within the Trump White House. Credit: AP There’s another potential source of stagflation that the major markets also appear to be discounting – Trump’s trade war on the rest of the world.\n\nThere’s already a range of tariffs in place – the 10 per cent universal baseline tariff and higher tariffs on some commodities and products – but the most threatening tariffs, the so-called “reciprocal” tariffs, won’t be unveiled until July 9. With the average US tariff rate already multiples of what it was before Trump’s “liberation day” in April, the addition of extra country-specific rates could have a destructive impact on not just the US economy, where they would cause spikes in prices and supply shortages, but on the global economy. In what is still, despite Trump’s efforts, a global economy, geopolitics ought to matter for investors and markets. The equity and bond markets have so far shrugged off that threat, believing that Trump will bluff and bluster but ultimately back off. The administration’s bombing of Iran, however, may cause investors to question whether their conviction that “Trump Always Chickens Out” – the “TACO” trade – is soundly based. There’s also the fate of the One Big Beautiful Bill that Republicans have been fighting over, a budget bill that would blow out America’s already bloated government debt and deficits. Fiscal hawks within the party have been fighting a rearguard action to try to reduce the level of spending in the bill.\n\nThe divisions within the Republicans and relationships with the White House might be exacerbated by Trump’s decision to plunge America into the fight between Israel and Iran. The isolationists within the party – and they are a significant faction – aren’t happy and are saying so, loudly. Loading For the share and bond markets, the uncertainties generated by the conflict in the Middle East, the looming reciprocal tariff announcements, the fate of the US budget bill, the rifts appearing within the congressional Republicans and the Federal Reserve Board’s response to all those issues ought to provide reasons for caution. The Fed isn’t going to give the markets the rate cuts they have been pricing in until it has a firmer grasp of the impact of the developments in the Middle East on oil and, therefore, gasoline prices and a clearer understanding of the effects of Trump’s tariffs. In what is still, despite Trump’s efforts, a global economy, geopolitics ought to matter for investors and markets.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/unflinching-insight-into-psychotic-illness-a-remarkable-immersive-theatre-event-20250623-p5m9jd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Unflinching insight into psychotic illness a remarkable immersive theatre event",
        "publish_date": "Mon, 23 Jun 2025 11:48:04 +1000",
        "category": "entertainment",
        "authors": [
            "Chris Hook"
        ],
        "text": "IMMERSIVE THEATRE\n\nThe Door in Question ★★★★\n\nMetro West Footscray, Until June 29\n\nPsychotic disorders such as schizophrenia are still a source of fear, confusion and stigma. Troy Rainbow’s remarkable mixed-reality immersive theatre event, The Door in Question, fights against them by opening a portal into altered perception, utilising the latest VR and interactive AI technology.\n\nThe Door In Question is an immersive theatre experience using VR. Credit: Lauren Marr\n\nThis is a solo trip into the labyrinth of the disordered mind. And if that sounds risky, the project is so sensitively realised that it feels unique in humanising (without remotely romanticising) what psychosis is like, inside and out.\n\nIt helps that the artist has skin in the game. Rainbow’s mother was diagnosed with schizophrenia – a deeply personal experience and an inspiration for the world you’ll enter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/bbc-presenter-corrects-pregnant-people-to-women-20250623-p5m9hv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "BBC presenter corrects ‘pregnant people’ to ‘women’",
        "publish_date": "Mon, 23 Jun 2025 11:40:42 +1000",
        "category": "finance",
        "authors": [
            "Craig Simpson"
        ],
        "text": "London: A BBC News presenter appeared to reject gender-neutral language during a live broadcast.\n\nMartine Croxall was reading a report about advice for vulnerable people during heatwaves when she used the term “pregnant people”. Immediately afterwards, she added “women”, with emphasis and a slight roll of her eyes.\n\nIt is understood that the gender-neutral wording was a direct quote from the heat-related study being reported on and was not the wording of the BBC.\n\nThe apparent correction, during a broadcast on Saturday lunchtime (London time), was endorsed by Harry Potter author and gender campaigner J.K. Rowling, who posted a clip of the incident on X and wrote: “I have a new favourite BBC presenter.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/hazlewood-and-lyon-respond-to-stinging-johnson-comments-calling-for-change-20250623-p5m9ff.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hazlewood and Lyon respond to stinging Johnson comments calling for change",
        "publish_date": "Mon, 23 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Bridgetown: Josh Hazlewood has defended his preparations heading into the World Test Championship final as Nathan Lyon declared no Test stars were hanging around for an Ashes swansong after their former teammate Mitchell Johnson questioned the Australian attack.\n\nJohnson, Australia’s sixth-leading wicket taker in Tests, played alongside Hazlewood and Lyon during the side’s last victorious tour of the West Indies in 2015.\n\nFollowing Australia’s five-wicket defeat to South Africa in the WTC final, Johnson used his column in the West Australian newspaper to publicly question some of Australia’s bowlers and senior players.\n\n“We’ve seen concerns about Hazlewood’s fitness in recent years, and his decision to prioritise returning to the delayed Indian Premier League over his national team preparations raised eyebrows,” Johnson wrote in the West Australian. “Lyon didn’t look his best on day three either.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-what-will-iran-do-next/kqiwhfs52",
        "title": "INTERVIEW: What will Iran do next?",
        "publish_date": "Mon, 23 Jun 2025 00:53:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/calls-for-teachers-to-educate-themselves-on-australian-history/g8l0254u6",
        "title": "'Cop-out': Calls for teachers to educate themselves on Australian history",
        "publish_date": "Sun, 22 Jun 2025 19:40:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Aunty Jackie Huggins was at primary school in Brisbane in 1960s when a teacher singled her out in a moment that would radically change her perspective.\n\n\n\n\n\nThe Bidjara and Birri Gubba Juru girl was the only Aboriginal student in her year three class when a fresh-faced young teacher told them to get to their feet if they were Australian.\n\n\n\n\n\nSpeaking on NITV’s The Point, Aunty Jackie recalled her confusion when he had asked everyone except her to sit down and declared to the class that she was the \"real Australian\" in the room.\n\n\n\n\n\n\"He based his whole class lesson around the fact that I was Aboriginal, and that I was here for a very long time, and we were the first peoples of this country, and it made me feel so proud,\" Aunty Jackie said.\n\n\n\n\n\n\"I've always thought about that lesson and those lessons from teachers who have that incredible power to really affirm their children in the classroom, even if you are so different from the rest.\"\n\n\n\nThis formative classroom experience proved to be the exception rather than the rule and Aunty Jackie overcame bigotry and low expectations on the road to becoming an accomplished author and academic.\n\n\n\n\n\n\"I always say to teachers: 'You know, you have that power to really make or break a child's life in terms of their own identity',\" she said.\n\n\n\n\n\nToday, the data is clear that education is fundamental to improving outcomes for First Nations people, yet Indigenous students continue to lag behind the broader population.\n\n\n\nREAD MORE Closing the Gap success stories are being written by Aboriginal and Torres Strait Islander peoples: PM\n\nThe national agreement on Closing the Gap was launched in 2008 with the commitment to reduce disadvantage among Indigenous Australians in health, life expectancy, employment, and education by 2031.\n\n\n\n\n\nAccording to the latest report, only one of the five education-related targets is considered to be on track.\n\n\n\n\n\nCharles Darwin University education researcher Dr Tracy Woodroffe said it’s important to maintain a broader perspective on our national approach to education.\n\n\n\n\n\n\"The Australian education system is meant to cater for all Australians,\" she said.\n\n\n\n\n\n\"Instead of us thinking about Aboriginal people — us as people failing — we need to look at what's the responsibility of the system itself and to not position ourselves as helpless in the process, but think of how we change a system and how we change what teachers learn and how they operate within a classroom.\"\n\n\n\nTeacher Jaimee Leigh Wiley shares a story with her class at Cherbourg State School in Queensland. Credit: The Point Less than 2 per cent of registered teachers in Australia are Indigenous and Woodroffe said an \"infiltration\" of First Nations teachers and perspectives will help to transform the system from within.\n\n\n\n\n\n\"If more students had that positive experience of schooling, perhaps also then they might decide to be teachers themselves to teach the next generation the way that they wanted to be taught,\" she said.\n\n\n\n\n\n\"For that to happen, though, they need teachers to engage them in the first place and to be able to work in a way that helps the students feel like they belong within that school.\"\n\n\n\nREAD MORE Belinda teaches Indigenous history in primary schools. She says it has helped reduce racism\n\nDespite Aboriginal and Torres Strait Islander Histories and Cultures having been part of the national curriculum since 2012, the majority of non-Indigenous teachers over 35 say they 'lack confidence' in this area.\n\n\n\n\n\n\"I think it's a little bit of a cop-out,\" Woodroffe said.\n\n\n\n\n\n\"It's easy to say, ‘I don't want to offend anyone. I don't know about that. I might get it wrong.’\n\n\n\n\n\n\"But we're adults, and if we are setting out on this path to be educators, we should be educated and understand how to find the answer to something that we don't know.\"\n\n\n\nJackie Huggins (left) attended school in Inala in Brisbane in the 1960s. Credit: Jackie Huggins' book ‘Auntie Rita’ Aunty Jackie agreed that there is still a long way to go, but she has seen enormous change in her lifetime.\n\n\n\n\n\n\"Who would've ever thought a little shy Black girl like me is now a professor?\" she said with a chuckle.\n\n\n\n\n\n\"I've always said to younger people, you've got to have an education because that is about your liberation in this country.\n\n\n\n\n\n\"That is the way we can fight to close the gap.\"\n\n\n\n\n\nThe Point airs Tuesdays at 7.30pm on NITV, and is available after the broadcast on SBS On Demand .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/australia-calls-for-dialogue-and-diplomacy-as-us-strikes-iran/m1gjx86d0",
        "title": "Australia calls for \"dialogue and diplomacy\" as US strikes Iran",
        "publish_date": "Sun, 22 Jun 2025 09:12:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-the-new-dinosaur-found-in-a-forgotten-museum-drawer/lpdd25lbw",
        "title": "INTERVIEW: The new dinosaur found in a forgotten museum drawer",
        "publish_date": "Sat, 21 Jun 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-a-milestone-for-the-australian-hotline-helping-those-affected-by-overseas-conflicts/ec09qp8dl",
        "title": "INTERVIEW: A milestone for the Australian hotline helping those affected by overseas conflicts",
        "publish_date": "Sat, 21 Jun 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/amy-thought-she-had-a-secure-job-as-an-international-student-she-was-wrong/8uzhbdash",
        "title": "Amy thought she had a secure job as an international student - she was wrong",
        "publish_date": "Sat, 21 Jun 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nBack in 2023, international student Amy - not her real name - thought she had found a secure job in Darwin.\n\n\n\n\n\nThe then 30-year-old was hired as a student service officer, by vocational education provider International House Sydney, where she was studying for an Advanced Diploma in Program Management.\n\n\n\n\n\nAnd unlike cash-in-hand casual jobs that many international students and new migrants often take, Amy felt secure with the position.\n\n\n\n\n\n\"It was a part-time permanent job, because I was on a student visa, so I could only work part-time, but it was a permanent contract.\"\n\n\n\n\n\nBut in January 2025 the company went into liquidation.\n\n\n\n\n\nAmy's Australian colleagues were able to access the Australian government's Fair Entitlements Guarantee, or FEG.\n\n\n\n\n\nThe Guarantee allows people to claim back wages, redundancy payments and other entitlements after a company closes.\n\n\n\n\n\nBut because Amy was an international student, she wasn't eligible for the scheme meaning that until today, she still hasn't been paid some wages or other entitlements after the company closed.\n\n\n\n\n\n\"So I thought that I would be more protected if I had a permanent contract. But then, when this happened, I realised that as an migrant, I do not have the same rights. I cannot access the same, yes, the same safety net as an Australian or a (permanent) resident.\"\n\n\n\n\n\nAccording to International House Sydney's liquidator, PKF Melbourne, the education provider had been trading at a loss from at least June 2022.\n\n\n\n\n\nBy the time it went into administration, it had around 3,800 students and 318 staff.\n\n\n\n\n\nAmy says they were informed by the liquidator that if funds remained after the liquidation, staff who couldn't access the FEG would be prioritised for repayment.\n\n\n\n\n\nSBS News have put questions about follow-up payments with migrant staff to PKF Melbourne, but they didn't reply specifically to the question.\n\n\n\n\n\nIt's an issue facing many small and medium-size education providers after the federal government tightened international student enrolments last year.\n\n\n\n\n\nFelix Pirie is the chief executive of Independent Tertiary Education Council Australia.\n\n\n\n\n\n\"We saw a big downturn for students to apply, to come or even consider lodging an application to come to Australia to undertake skills training courses but also English language programs.\"\n\n\n\n\n\nAccording to a report by the ITECA, in 2021 there are around 162,000 students enrolling in independent higher education providers with over half of them international students.\n\n\n\n\n\nMr Pirie says the increased fees for visa applications and the slowdown of visa process hit his sector most.\n\n\n\n\n\n\"The outcome of these things is that independent providers are the ones singled out at the end of the day, or they are the one that certainly feels the biggest impacts, and it's the people they employ. So they employ significant workforce, and when their business start to suffer, those people lose their jobs.\"\n\n\n\n\n\nIf an international student finds their education provider goes into administration, they have the right to access the government's Tuition Protection Service.\n\n\n\n\n\nThis helps students find alternative course options and get a full refund from the provider.\n\n\n\n\n\nMatt Kunkel is the Chief Executive Officer of Migrant Workers Centre in Victoria.\n\n\n\n\n\nHe says many international students are also employed in the sector.\n\n\n\n\n\n\"What the other impact on this is for many migrant workers is that once they complete their education in Australia, many of them are moving into the education sector themselves, and in particular the international education sector. So for those workers who have come to build a life, to get an education and build a life in Australia, these international caps are putting pressure on jobs in the sector.\"\n\n\n\n\n\nIn 2019, the then Coalition government released the final report from the government's Migrant Workers' Taskforce, which recommended an expansion of the FEG to all migrant workers.\n\n\n\n\n\nThe Migrant Workers' Taskforce was established in 2016 to tackle migrant worker exploitation but since the 2019 report - the FEG has yet to be expanded.\n\n\n\n\n\nIn 2025 the Albanese Labor government announced a consultation process looking into reforms to the FEG, after some businesses were found to have misused the scheme.\n\n\n\n\n\nMr Kunkel says the federal government needs to allow international students and migrant workers to access the FEG as soon as possible.\n\n\n\n\n\n\"Our visa system is built around this idea that international students are here just to study. But the reality is that many of those international students are here working and studying in Australia, and we need a visa system that allows those workers who are coming, those international students who are coming to Australia to be able to live a dignified life as they study and get that education.\"\n\n\n\n\n\nSeri Feldman-Gubbay is a senior solicitor at Redfern Legal Centre.\n\n\n\n\n\nShe also agrees that there's a gap between the safety net for local workers and international students.\n\n\n\n\n\n\"I think that the biggest thing is that a lot of Australian employing businesses rely on the fact that international students will be unfamiliar with the legal system and the rules in Australia. And so there will be, I guess, a false sense of confidence that is this employer is going to do right by me, when, in actual fact, a lot of employers take advantage of that lack of knowledge to then do the wrong thing and leave people in a really bad position.\"\n\n\n\n\n\nAnd without the FEG scheme, Ms Feldman-Gubbay says for employees like Amy taking claims to court is one option.\n\n\n\n\n\nAmy wants to see a change.\n\n\n\n\n\n\"I don't think I will ever be compensated, because I doubt there's money to be found, but I would really hope that in the future, nobody else has to go through this situation, or also for there to at least be something that is more talked about. I have not heard about this until it happened to me. I think that every migrant should know that this is something that could happen to them.\"\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/parramatta-hookers-dangerous-lifting-tackle-20250623-p5m9ke.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Parramatta hooker's dangerous lifting tackle",
        "publish_date": "Mon, 23 Jun 2025 12:09:14 +1000",
        "category": "sports",
        "authors": [],
        "text": "Parramatta hooker's dangerous lifting tackle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/penisini-binned-for-dangerous-lifting-tackle-20250623-p5m9kf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Penisini binned for dangerous lifting tackle",
        "publish_date": "Mon, 23 Jun 2025 12:09:13 +1000",
        "category": "sports",
        "authors": [],
        "text": "Penisini binned for dangerous lifting tackle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/gallen-wants-burton-in-blues-consideration-20250623-p5m9k9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gallen wants Burton in Blues consideration",
        "publish_date": "Mon, 23 Jun 2025 11:59:23 +1000",
        "category": "finance",
        "authors": [],
        "text": "Gallen wants Burton in Blues consideration\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/there-used-to-be-five-big-risks-to-the-australian-budget-that-s-grown-20250620-p5m92j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "There used to be five big risks to the Australian budget. That’s grown",
        "publish_date": "Mon, 23 Jun 2025 11:59:05 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "Loading\n\nSave Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nChalmers and Wright also spoke at length about housing, US commentator Ezra Klein’s influential new book Abundance and how the left is shifting to reclaim part of economics it has long disdained.\n\n“We want good things to happen, we’ve got to stop strangling good things from happening,” Chalmers said. “I think that’s very, very compelling for us.”\n\nCut through the noise of federal politics with news, views and expert analysis. Subscribers can sign up to our weekly Inside Politics newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/pre-war-cottage-snapped-up-for-just-over-a-million-in-three-minute-auction-20250623-p5m9gp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pre-war cottage snapped up for just over a million in three-minute auction",
        "publish_date": "Mon, 23 Jun 2025 11:57:51 +1000",
        "category": "finance",
        "authors": [
            "Sarah Webb"
        ],
        "text": "A termite-riddled cottage in Coorparoo with a rusty bathroom frozen in time sold for $1,096,000 in 180 seconds on Saturday, after four buyers battled it out for a fixer-upper they can’t knock down.\n\nDespite its decaying charm and strict pre-war heritage protections, the three-bedroom, one-bathroom home at 482 Cavendish Road sparked a blink-and-you’ll-miss-it bidding war, with a young couple ultimately paying well over the undisclosed reserve to secure the prize.\n\nBidding for the home started at $850,000 and rapidly rose in $25,000 increments until $1 million, before settling into a flurry of $10,000 and $5000 bids between two buyers who went head-to-head until the hammer fell.\n\n“It does need a lot of work. There’s termite damage everywhere you look,” the selling agent said. Credit: Domain\n\nPerched on a level 627-square-metre block in a tightly held pocket of the suburb, the property offered a rare affordable foothold in a high-demand market, with the young buyers planning to move in and take on a slow-burn renovation to bring the tired home back to life.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/couple-on-their-way-to-be-married-just-miss-out-on-4m-tennyson-point-home-20250623-p5m9go.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Couple on their way to be married just miss out on $4m Tennyson Point home",
        "publish_date": "Mon, 23 Jun 2025 11:56:36 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A couple on their way to the registry to get married first stopped to bid on a Tennyson Point house, which sold for $4,051,000 under the hammer.\n\nSix registered, and all six competed for the four-bedroom home with swimming pool at 71 Champion Road. Belle Property Hunters Hill selling agent Michael Gallina had guided the property at $3.4 million.\n\nBidding opened at $3.42 million and big bids were placed until the price went past the $3.8 million reserve. There is no legal requirement for a vendor’s reserve to be in line with their property’s price guide.\n\nMany neighbours gathered to watch the auctions, Gallina said. Gasps were heard in the crowd because of the competitive spirit shown by the bidders, he said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/the-alarm-bells-should-be-ringing-louder-in-markets-20250623-p5m9h0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The alarm bells should be ringing louder in markets",
        "publish_date": "Mon, 23 Jun 2025 11:56:18 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The surge in oil prices clearly has the potential to go much higher. So far, as appears to be the case with equities and bonds, there seems to be an assumption within the administration and among investors that America’s entry to the conflict and its bombing of Iran’s nuclear facilities represents a conclusion, at least of America’s involvement, rather than a beginning. With Tehran saying that the bombings will trigger “everlasting consequences”, however, that would be a premature assumption. The Strait of Hormuz is a crucial shipping lane for the global economy. Credit: Getty Iran could respond with its own strikes on US targets in the region. It could also do what it has sometimes threatened, but never done, and close the Strait of Hormuz, the vital shipping lane from the Persian Gulf for nearly a third of the world’s oil and 20 per cent of its LNG, either by mining it or by targeting tankers. That would send the oil price soaring above $US100 a barrel, with particular implications for China and Europe.\n\nWhere the US is energy self-sufficient, China and Europe rely on the Middle East for oil and oil-derived products. Europe, after ending its dependence on Russian gas after Russia invaded Ukraine, is now heavily dependent on LNG. China buys about a third of the oil that transits through the Persian Gulf and is the dominant customer for Iranian oil. Israel and the US have, so far, left Iran’s oil export infrastructure, centred on its Kharg Island facility in the gulf, untouched. Loading An escalation in the conflict and disruption, or even a more direct threat of disruption to oil and LNG supplies, would boost inflation rates around the world. Already, the price of jet fuel has jumped nearly 50 per cent, which will eventually flow through to air fares. Energy shocks – and developments in the Middle East could easily produce a full-blown one – have historically had very material and long-lasting effects on advanced economies and their markets, although the global economy, and the US in particular, is much less reliant on oil today than it has been in the past.\n\nIt’s also the case that a spike in the oil price would trigger a frenzy of drilling in the US – shale oil producers respond quickly to prices – which has become a net exporter of energy this decade, and would probably also see increased Russian production. If sustained, it would also accelerate the shift away from fossil fuels towards cleaner energy sources, a safety valve that didn’t exist in the 1970s during the Arab oil embargo after the Yom Kippur War, when an Egyptian-led coalition of Arab states attacked Israel. That embargo ignited a dramatic increase in oil prices and years of stagflation (high levels of inflation with low levels of growth) in the major developed economies. Markets are full of risk, largely created by decisions made within the Trump White House. Credit: AP There’s another potential source of stagflation that the major markets also appear to be discounting – Trump’s trade war on the rest of the world.\n\nThere’s already a range of tariffs in place – the 10 per cent universal baseline tariff and higher tariffs on some commodities and products – but the most threatening tariffs, the so-called “reciprocal” tariffs, won’t be unveiled until July 9. With the average US tariff rate already multiples of what it was before Trump’s “liberation day” in April, the addition of extra country-specific rates could have a destructive impact on not just the US economy, where they would cause spikes in prices and supply shortages, but on the global economy. In what is still, despite Trump’s efforts, a global economy, geopolitics ought to matter for investors and markets. The equity and bond markets have so far shrugged off that threat, believing that Trump will bluff and bluster but ultimately back off. The administration’s bombing of Iran, however, may cause investors to question whether their conviction that “Trump Always Chickens Out” – the “TACO” trade – is soundly based. There’s also the fate of the One Big Beautiful Bill that Republicans have been fighting over, a budget bill that would blow out America’s already bloated government debt and deficits. Fiscal hawks within the party have been fighting a rearguard action to try to reduce the level of spending in the bill.\n\nThe divisions within the Republicans and relationships with the White House might be exacerbated by Trump’s decision to plunge America into the fight between Israel and Iran. The isolationists within the party – and they are a significant faction – aren’t happy and are saying so, loudly. Loading For the share and bond markets, the uncertainties generated by the conflict in the Middle East, the looming reciprocal tariff announcements, the fate of the US budget bill, the rifts appearing within the congressional Republicans and the Federal Reserve Board’s response to all those issues ought to provide reasons for caution. The Fed isn’t going to give the markets the rate cuts they have been pricing in until it has a firmer grasp of the impact of the developments in the Middle East on oil and, therefore, gasoline prices and a clearer understanding of the effects of Trump’s tariffs. In what is still, despite Trump’s efforts, a global economy, geopolitics ought to matter for investors and markets.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/unflinching-insight-into-psychotic-illness-a-remarkable-immersive-theatre-event-20250623-p5m9jd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Unflinching insight into psychotic illness a remarkable immersive theatre event",
        "publish_date": "Mon, 23 Jun 2025 11:48:04 +1000",
        "category": "entertainment",
        "authors": [
            "Chris Hook"
        ],
        "text": "IMMERSIVE THEATRE\n\nThe Door in Question ★★★★\n\nMetro West Footscray, Until June 29\n\nPsychotic disorders such as schizophrenia are still a source of fear, confusion and stigma. Troy Rainbow’s remarkable mixed-reality immersive theatre event, The Door in Question, fights against them by opening a portal into altered perception, utilising the latest VR and interactive AI technology.\n\nThe Door In Question is an immersive theatre experience using VR. Credit: Lauren Marr\n\nThis is a solo trip into the labyrinth of the disordered mind. And if that sounds risky, the project is so sensitively realised that it feels unique in humanising (without remotely romanticising) what psychosis is like, inside and out.\n\nIt helps that the artist has skin in the game. Rainbow’s mother was diagnosed with schizophrenia – a deeply personal experience and an inspiration for the world you’ll enter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/bbc-presenter-corrects-pregnant-people-to-women-20250623-p5m9hv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "BBC presenter corrects ‘pregnant people’ to ‘women’",
        "publish_date": "Mon, 23 Jun 2025 11:40:42 +1000",
        "category": "finance",
        "authors": [
            "Craig Simpson"
        ],
        "text": "London: A BBC News presenter appeared to reject gender-neutral language during a live broadcast.\n\nMartine Croxall was reading a report about advice for vulnerable people during heatwaves when she used the term “pregnant people”. Immediately afterwards, she added “women”, with emphasis and a slight roll of her eyes.\n\nIt is understood that the gender-neutral wording was a direct quote from the heat-related study being reported on and was not the wording of the BBC.\n\nThe apparent correction, during a broadcast on Saturday lunchtime (London time), was endorsed by Harry Potter author and gender campaigner J.K. Rowling, who posted a clip of the incident on X and wrote: “I have a new favourite BBC presenter.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/hazlewood-and-lyon-respond-to-stinging-johnson-comments-calling-for-change-20250623-p5m9ff.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hazlewood and Lyon respond to stinging Johnson comments calling for change",
        "publish_date": "Mon, 23 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Tom Decent"
        ],
        "text": "Bridgetown: Josh Hazlewood has defended his preparations heading into the World Test Championship final as Nathan Lyon declared no Test stars were hanging around for an Ashes swansong after their former teammate Mitchell Johnson questioned the Australian attack.\n\nJohnson, Australia’s sixth-leading wicket taker in Tests, played alongside Hazlewood and Lyon during the side’s last victorious tour of the West Indies in 2015.\n\nFollowing Australia’s five-wicket defeat to South Africa in the WTC final, Johnson used his column in the West Australian newspaper to publicly question some of Australia’s bowlers and senior players.\n\n“We’ve seen concerns about Hazlewood’s fitness in recent years, and his decision to prioritise returning to the delayed Indian Premier League over his national team preparations raised eyebrows,” Johnson wrote in the West Australian. “Lyon didn’t look his best on day three either.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/healys-path-world-cup-set-020200494.html",
        "title": "Healy's path to World Cup set, will play into summer",
        "publish_date": "2025-06-23T02:02:00Z",
        "category": "sports",
        "authors": [
            "Scott Bailey"
        ],
        "text": "Alyssa Healy has ruled out making this year's ODI World Cup a farewell party, revealing recent injuries could persuade her to push back any retirement plans.\n\nHealy's path back to cricket will be confirmed on Tuesday, with the wicketkeeper to be named as part of an Australia A squad to face India A in Queensland in August.\n\nThe matches will mark the Australian captain's first since the Ashes success at the start of the year, when she missed games with a stress fracture in her foot and did not keep wicket in others.\n\nA stress fracture forced Healy (c) to miss international matches last summer. (Mark Evans/AAP PHOTOS)\n\nHealy has endured a difficult year fitness-wise, also missing the finals of last year's T20 World Cup with the foot injury and having a knee issue end her WBBL season early.\n\nADVERTISEMENT\n\nThe 35-year-old then sat out ODIs in New Zealand and the WPL in India as a result of her injuries, but said she has been fit and able to play since March.\n\nHealy often jokes she has decided to retire from cricket five or six times before opting against it, and revealed earlier this year she had an ideal exit scenario.\n\nBut that will not be after the October-November World Cup, with a hunger for cricket while injured meaning her yet-to-be-revealed plans could be pushed back.\n\n\"It's probably shifted a little bit,\" Healy told AAP.\n\n\"It's made me realise that I still want to do a little bit more than maybe what I thought.\n\n\"At the same time, sometimes there's stuff in life that are a little bit more important than pulling on the green and gold. So it's just a constant reassess.\n\nADVERTISEMENT\n\n\"But at the moment I definitely want to play a home summer. I want to bring the World Cup home, but also to play against India (in February-March).\"\n\nTuesday marks 100 days until Australia's opening World Cup clash against New Zealand, with the India tournament presenting a real challenge for the defending champions.\n\nAustralia are gunning to be the first side to win back-to-back in the tournament in almost 40 years, with the team having faced a large large transition since 2022.\n\nThe Australian team has undergone significant change since Meg Lanning led them to victory in 2022. (John Davidson/AAP PHOTOS)\n\nForming a pathway to the ODI World Cup was part of Healy's pitch when she took over the captaincy when Meg Lanning retired in 2023.\n\n\"That was one of my goals, putting a timeline on it and saying this is where I could take this group, even not knowing what I was going to do personally,\" Healy said.\n\nADVERTISEMENT\n\n\"It definitely was a big focus of mine, to get the group to a place to compete at this World Cup, and win the trophy.\n\n\"It's not so much about the captaincy (driving me), or ticking one more box.\n\n\"It's just that I want to win a World Cup for Australia, and no one has gone back-to-back, which is a real motivator.\"\n\nHealy has not kept wicket in a match since January, but is confident the three Australia A series and subsequent ODIs in India will have her fit for up to nine World Cup matches in 32 days.\n\nHealy aims to be back in her usual wicketkeeping role for the World Cup. (Linda Higginson/AAP PHOTOS)\n\n\"According to science, the ODI World Cups is one of the heaviest loads that we go through as cricketers,\" Healy said\n\n\"My aim is to play every game of that World Cup. So to make sure I can do that's important.\"",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/daltons-stellar-sports-career-dimmed-020120736.html",
        "title": "Dalton's stellar sports career dimmed by back injury",
        "publish_date": "2025-06-23T02:01:20Z",
        "category": "sports",
        "authors": [
            "Melissa Woods"
        ],
        "text": "With a sporting career inspired by Cathy Freeman, fellow Olympic gold medallist and multi-sports star Chloe Dalton has been forced to retire due a back injury.\n\nPart of the champion women's sevens rugby team at the 2016 Rio Games, Dalton also played AFLW for both Carlton and GWS over seven seasons, running out for 32 games.\n\nDemonstrating her versatility and skill, she also played in the WNBL before switching her focus to rugby sevens.\n\nChloe Dalton (C) enjoys the spoils of fulfilling a childhood dream in winning an Olympic gold medal. (Dean Lewins/AAP PHOTOS)\n\nRequiring back surgery after an injury ended her 2024 season with the Giants, Dalton said she's failed to recover sufficiently to resume her career.\n\n\"Retired. After a second back surgery nine months ago, my body hasn't bounced back to the point where I can play footy again,\" the 31-year-old posted on social media.\n\nADVERTISEMENT\n\n\"It's been a tricky process trying to come to terms with the fact that my sporting career has finished through injury.\"\n\nDalton posted a series of photos and told the story of her sporting journey; how she was determined to win an Olympic gold medal after watching Freeman's triumph at the Sydney Games.\n\nWhen realising she wasn't good enough to make the Australian basketball team she set her sights on sevens.\n\n\"I went onto Google and typed in lists of Olympic sports,\" Dalton wrote.\n\n\"Rugby sevens would be in the Olympics for the first time in 2016. I had just 2.5 years to learn how to play rugby and secure myself a ticket on that plane to Rio.\n\n\"... That seven year old girl got to stand on the podium and have her very own Olympic gold medal put around her neck.\"\n\nDalton said that she then saw AFLW on television and, although she didn't know the rules, wanted to play.\n\nADVERTISEMENT\n\nJoining the Blues in 2018, she was part of Carlton's grand final team a year later.\n\nShe decided to switch back to sevens to compete at the Tokyo Olympics but shattered her cheekbone four weeks out from the Games.\n\nAfter launching The Female Athlete Project, which is a platform to highlight the sporting achievements of women, she then resumed her AFLW career with GWS but injuries restricted her to just 16 games across four seasons.\n\nAfter announcing her retirement the Giants congratulated Dalton her achievements and contribution.\n\n\"Chloe's impact both on and off the field for the Giants has been profound and she'll leave a lasting legacy with her teammates, coaches and staff,\" GWS women's football boss Alison Zell said.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-ace-minjee-lee-wins-214518389.html",
        "title": "'Pretty amazing': how Minjee Lee entered golf folklore",
        "publish_date": "2025-06-23T02:00:16Z",
        "category": "sports",
        "authors": [
            "Darren Walton"
        ],
        "text": "Greatness now already assured, Minjee Lee is eyeing golf's fabled grand slam after surpassing revered compatriot Greg Norman as a three-time major champion.\n\nLee held her nerve to win the mega-money PGA Championship and cement her place in Australian sporting immortality with a steely final round in hot and windy Texas.\n\nLee had her four-shot overnight lead slashed in half early on championship Sunday before hanging on, then surging gamely for a three-stroke triumph in more extremely trying conditions at PGA Frisco's Fields Ranch East course.\n\nThe 29-year-old bogeyed three of the first six holes in an understandably anxious start before steadying to close with a sufficiently sound two-over-par 74 on Monday (AEST).\n\nADVERTISEMENT\n\n\"It feels pretty amazing. I feel like I really deserve this one and I put a lot of hard work into it,\" Lee said after joining Karrie Webb, Jan Stephenson and 2019 winner and Perth stablemate Hannah Green as the fourth Australian to win the PGA Championship. \"It's just really special. It's just such a great privilege to be able to have my name up with them as well.\"\n\nLee finished with a 72-hole four-under 284 total to deny fast-finishing pair Auston Kim (68) of the USA and Thai Chanettee Wannasaen (68) improbable comeback victories at the third women's major of the year.\n\nWinning is better with friends! 🍾\n\n\n\nMinjee Lee's winning celebration 🏆#KPMGWomensPGA pic.twitter.com/GPT7S5VC6Z — KPMG Women's PGA Championship (@KPMGWomensPGA) June 22, 2025\n\n\"Just stick to my game plan. It's a battle against myself pretty much, especially with how tough the conditions were this whole week,\" the fomer world No.2 said of her final-round approach.\n\n\"Not just today. It's just amplified today because it's a major Sunday, but yeah, just be patient, take every shot as it comes.\n\nADVERTISEMENT\n\n\"I pretty much saw every single leaderboard and I knew exactly where I was, pretty much all of today, so I checked the scores and then I just came back to each shot and tried to execute it the best that I could and I played within myself.\"\n\nSunday's victory snapped a 19-month winless run, the longest drought of her decorated career, and secured Australian women's sport's highest earner another monster cheque of $US1.8 million ($A2.8 million).\n\nIn adding to her 2021 Evian Championship triumph and 2022 US Open success, Lee completed the third leg of women's golf's grand slam to edge ever closer to a place in the sport's Hall of Fame.\n\nWinning the only two majors to elude her, the British Open and Chevron Championship, remains her \"ultimate goal\".\n\nMinjee Lee and her caddie Michael Paterson teamed up well throughout the event in Texas. (AP PHOTO)\n\n\"I really wanted to be in the Hall of Fame,\" Lee said.\n\nADVERTISEMENT\n\n\"That's why I started golf, and that's why I wanted to be on the LPGA Tour to win a bunch of tournaments and try and get into it.\"\n\nJust as significantly, Lee joined Webb and Stephenson as only the third Australian golfer in history to win three different major championships.\n\nLee also eclipsed Norman and David Graham on Australia's all-time majors winning list.\n\nLee now only trails seven-times major champion Webb and five-times British Open winner Peter Thomson.\n\nPerhaps most gratifying of all, the Perth prodigy also buried the demons from last year's spectacular final-round crash at the US Open.\n\nLee opened up a three-stroke back-nine lead, only to collapse down the stretch to finish tied for ninth at Lancaster Country Club.\n\nThe sister of PGA Tour star Min Woo Lee paid a heartfelt tribute to her family after enhancing her status as Australian sport's highest-earning women's athlete.\n\nADVERTISEMENT\n\n\"At this point in your career, I mean, my parents have sacrificed so much for me to be here,\" Lee said with her mother and career-long coach green-side.\n\nLee was soaked in champagne on the 18th hole after her victory. (AP PHOTO)\n\n\"I can't say more things than I've already. It's just extra special that I could win in front of them and obviously wherever Min is, he's supporting me out there.\n\n\"He's a social media nut so he's all on top of that, so it is really cool.\n\n\"And obviously my dad's back in Oz - I don't know what time it is there - but he's tuning in and they've always got my back, so it's really nice and it's great support and unconditional.\"",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/wasnt-ideal-lomax-opens-origin-020000792.html",
        "title": "'Wasn't ideal': Lomax opens up on Origin goalkicking",
        "publish_date": "2025-06-23T02:00:00Z",
        "category": "sports",
        "authors": [
            "Jasper Bruce"
        ],
        "text": "Zac Lomax concedes his goal-kicking \"wasn't ideal\" in the second State of Origin game but has vowed not to board any emotional rollercoaster triggered by NSW's tight loss.\n\nNSW scored five tries to Queensland's four in Wednesday night's game but went down 26-24 as Lomax landed only two of five attempts at goal in wet and wild conditions.\n\nNathan Cleary's groin injury left goal-kicking duties to Lomax at the 11th hour and the right winger could have pushed the Blues to an unassailable 2-0 series lead off his boot.\n\nInstead, the result moves the series to a game three decider in Sydney on July 9, and denies NSW the chance for a first series clean sweep since 2000.\n\nZac Lomax was airborne in game one, scoring two tries as NSW won in Brisbane. (Darren England/AAP PHOTOS)\n\nLomax said it was important not to become weighed down after the defeat.\n\nADVERTISEMENT\n\n\"Week in week out, it's a rollercoaster of emotions. I guess like the first game, everyone was singing NSW's praises and game two, we lost. That's the way it goes,\" he said.\n\n\"That's why you can't buy into it too much.\"\n\nParramatta winger Lomax said it could be easy to fall into thinking it was he alone who cost NSW the game.\n\nIn reality, the Blues conceded eight unanswered penalties and completed at only 58 per cent as they fell 26-6 down at halftime.\n\nWhile critics may have pinned the loss on his kicking, Lomax said: \"It's easy to look at it that way because it (the margin) is two points and a goal is two points. For me, I pride myself on being a good goalkicker as well.\n\n\"It was not ideal. But as I said, it gives you guys (the media) something to talk about and the lead-in into game three.\n\nADVERTISEMENT\n\n\"The thing is, I probably couldn't have struck them any better. They just sat out there.\n\n\"We were on the receiving end of it (defeat) but that's the way that footy goes. The best thing is we get another game, game three, and we'll be up for it.\"\n\nLomax, seen practising in Perth, conceded his game two kicking was 'not ideal'. (Dan Himbrechts/AAP PHOTOS)\n\nBefore then, Lomax is predicting a harsh reception playing before St George Illawarra's home crowd for the first time since his highly-publicised exit from the club.\n\nLomax surprised the NRL world last year by requesting a release from his Dragons deal amid career-best form that eventually yielded Australian and NSW debuts.\n\nAfter weeks of build-up the Dragons relented to Lomax's request and paved the way for him to sign at Parramatta, where he has continued to excel on the wing.\n\nA Dragon for 114 games, Lomax expects some rough treatment when he runs out at Wollongong in the Eels' blue-and-gold strip on Saturday evening.\n\nADVERTISEMENT\n\n\"I'm sure I won't get a real nice reception there but that's the way that it goes,\" he said after Parramatta's 36-20 defeat of Gold Coast.\n\n\"You completely try and take the emotion out of it because emotion can affect your game positively and negatively\n\n\"For us it's learning what we did well tonight (against Gold Coast), learning things we can improve on.\"",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/feeds-us-broncos-surge-fifth-020000676.html",
        "title": "'It feeds us': Broncos' surge to fifth fired by critics",
        "publish_date": "2025-06-23T02:00:00Z",
        "category": "sports",
        "authors": [
            "Joel Gould"
        ],
        "text": "'It feeds us': Broncos' surge to fifth fired by critics\n\nBrisbane have surged to fifth on the NRL ladder and star centre Kotoni Staggs says \"outside noise\" about the club has bound the players closer.\n\nThe Broncos were behind 28-12 against Cronulla in the 54th minute on Sunday at Suncorp Stadium but fought back to win 34-28.\n\nTheir victory was full of character and resilience after a month ago they had slipped to 11th following six losses in seven games.\n\nThe Broncos were written off at that point but a 44-14 win over Gold Coast, a bye and the win over the Sharks have put their finals hopes back on track.\n\nStaggs said Brisbane's self-belief allowed them to reverse a large deficit and overcome Cronulla. (Jono Searle/AAP PHOTOS)\n\n\"I put it down to a lot of outside noise that said we couldn't do it, wouldn't make the top eight and weren't a finals team,\" Staggs said.\n\nADVERTISEMENT\n\n\"We just flipped it all back onto them. We are fighting for one another. It was a good comeback. The more they hate on us, it feeds us.\"\n\nStaggs, 26, inked a new three-year deal last week and said he was glad to have his future settled.\n\n\"I didn't want to leave. When I knew I was coming off contract I did have a look around, but I went back to my family and partner and said this is where I belong,\" Staggs said.\n\n\"I have been here for eight years and this is home for me. I have loved every minute of it and the bunch of boys I have made friends with are for life. I just couldn't leave.\n\n\"The club itself and the fans are a big part of it as well. I am happy it is all done and I am happy for three more years.\"\n\nBrisbane host the fourth-placed Warriors on Saturday and must win if they are to make a realistic push for the vital top four themselves.\n\nADVERTISEMENT\n\nThe Warriors, on 24 points, are six points ahead of the Broncos but still within reach. Brisbane are seeking three wins in a row for just the second time this season.\n\nIf they replicate the final 26 minutes against the Sharks when they play the Warriors, the Broncos will be in a good position.\n\n\"The second half, we went out and just knew we had to stick to the game plan,\" Staggs said.\n\n\"They scored that early try in the second half and we looked at each other on the tryline and we just said, 'The only way we can get out of this is on our own'.\n\n\"We all went back to doing what we do best. We jumped on each other's back and found a way out and it was a good win.\"",
        "source": "Yahoo"
    }
]