[
    {
        "url": "https://www.9news.com.au/national/tasmania-government-to-ban-greyhound-racing-state-funding-to-be-phased-out-by-2029/bd9df67c-b64e-4b38-bc52-c0c9fcc96320",
        "title": "Tasmanian government pulls the plug on greyhound racing",
        "publish_date": "Sat, 09 Aug 2025 23:52:47 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "The Tasmanian government will pull the plug on greyhound racing in the state by 2029, making it the first Australian state to phase out the competitive betting industry.\n\nNewly-reinstated Premier Jeremy Rockliff announced today his government would cease funding for greyhound racing in the state in four years' time, which will effectively wipe out the industry in Tasmania.\n\n\"I'm concerned about the future of the industry and continue to be concerned about animal welfare,\" Rockliff said.\n\nThe Tasmanian government will phase out funding for greyhound racing by 2029. (Getty)\n\n\"It's time to draw a line in the sand and ensure an orderly exit from greyhound racing in Tasmania.\"\n\nThe Tasmanian government said it would cut public funding by June 30, 2029.\n\nIt will be the second jurisdiction in Australia – and the first state – to cut government funding for greyhound racing after the ACT banned it in 2018.\n\nRockliff acknowledged the announcement would make some industry members \"extremely disappointed\" but said the decision was made as greyhound racing no longer aligns with community values.\n\n\"As we deliver a measured and sensible phase-out of greyhound racing, I want to be crystal clear on my support for the broader racing industry, its participants, and our regional communities,\" he said.\n\nREAD MORE: ﻿ Six men on the run after teenager allegedly slashed with machete in Melbourne\n\nPremier of Tasmania Jeremy Rockliff said the announcement would likely disappoint the industry. (Alex Ellinghausen)\n\n\"I know there are many participants in the industry who care deeply for their animals who will be extremely disappointed by this policy decision.\n\n\"But the reality is the greyhound industry is at the crossroads, is in decline and it is increasingly clear it does not align with community expectations.\"\n\nA parliamentary committee will oversee the transition until 2029.\n\nGreyhound racing in Tasmania is almost 100 per cent dependent on state funding, according to the Australian Financial Review.\n\nIt was reported the state was spending more than twice the national average to keep the greyhound racing industry afloat, with $7.5 million in funding alone in 2024-25.\n\nAnimal advocacy groups have called for a national ban on greyhound racing in Australia.\n\nGreyhound racing was also banned in New Zealand last year.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/city2surf-sydney-2025-in-photos/8b6267f9-3155-4a2a-87ba-a396535e9753",
        "title": "Tens of thousands of runners brave rainy Sydney for wettest City2Surf in years",
        "publish_date": "Sun, 10 Aug 2025 00:20:27 +0000",
        "category": "finance",
        "authors": [
            "August"
        ],
        "text": "1 of 21 Attribution: Oscar Colman\n\nAround 90,000 people took to the rainy streets of Sydney today for the 2025 City2Surf.\n\nThe sold-out event was a sea of colour (and rain) as the early birds made the 14km trek from the city's CBD to the iconic Bondi Beach.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/hong-kong-stablecoin-regulations-china-cryptocurrency/dbb8d467-f23b-44e1-90a3-2a87dd2ccc5b",
        "title": "China eyeing off huge $43 trillion system you've probably never heard of",
        "publish_date": "Sat, 09 Aug 2025 21:32:38 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "If some of the less trustworthy corners of the internet were to be believed, China took a fairly drastic step against cryptocurrencies last weekend by banning them.\n\nAs it turns out, that was fake – or at the very least old – news; Beijing did put a ban on trading and mining crypto, but that was handed down on September 24, 2021, a lazy 1409 days earlier.\n\nBut if you zoomed out just slightly from the Chinese mainland, then there was a genuine development.\n\nChina didn't ban cryptocurrency last weekend. (AP Photo/Ng Han Guan)\n\nOn August 1, new regulations in Hong Kong came into effect, allowing companies to apply for a licence to issue stablecoins.\n\nUnlike more typical cryptocurrencies like Bitcoin, whose value fluctuates wildly, the value of stablecoins is pegged to that of currencies or commodities, removing the volatility that deters some investors.\n\nThey don't just account for pocket change, either.\n\nAccording to ANZ, stablecoin transactions were worth $US27.6 trillion ($42.5 trillion) last year alone.\n\nThat's more than all transactions made using Visa and Mastercard combined, and about 15 times the value of the entire Australian economy.\n\nHong Kong isn't the only jurisdiction to regulate stablecoins recently.\n\nUS President Donald Trump signed the GENIUS Act (officially the Guiding and Establishing National Innovation for US Stablecoins Act) on July 18, one of three major bills to clear the House during what was touted as \"crypto week\".\n\nUnlike volatile cryptocurrencies like Bitcoin, stablecoins' value is intended to be more reliable. (AP Photo/Kin Cheung)\n\n\"The regulations in the US and Hong Kong have attracted significant market attention,\" ANZ chief greater China economist Raymond Yeung wrote.\n\n\"Companies involved in issuing and trading stablecoins have seen their stock prices rally massively.\"\n\nIn Australia, meanwhile, the RBA has ruled out the idea of a central bank digital currency for now, but announced the start of a trial of tokenised currencies﻿, including stablecoins, in July.\n\nNot that everyone thinks they're a good idea.\n\nLaw professor and prominent crypto critic Hilary Allen compared the GENIUS Act to the pre-regulated financial era that led to the Great Depression.\n\nDonald Trump signed the GENIUS Act to regulate stablecoins last month. (AP Photo/Evan Vucci)\n\n\"It won't just be crypto taking advantage, it'll be everybody,\" Allen told CNN last month.\n\n\"And then we get to unregulated markets for all kinds of investments, which is where we were in the 1920s, and we saw how that ended.\"﻿\n\nThe Hong Kong regulations come as some Chinese tech giants, including e-commerce behemoth JD.com and the Alibaba-linked Ant Group, have reportedly pushed Beijing to allow stablecoins linked to the yuan to counter the surge of US dollar-backed crypto.\n\nMore than a few commentators and analysts have talked of Hong Kong acting as a testing ground for the mainland.\n\n\"The emergence of stablecoins in the 2020s gave hope to the internationalisation of the (yuan), and the passing of Hong Kong's stablecoins ordinance was viewed as a further step in that direction,\" Yeung said.\n\nAt the same time, it's no secret China wants to get away from the reliance on the US dollar in international transactions, and promote the yuan in its place.\n\nSo could a yuan-backed stablecoin offer a way to do just that?\n\nREAD MORE: Where your dog sits in the car could cost you thousands in fines ﻿\n\nChina wants to decouple from the US dollar and promote its own currency in its place. (Chinatopix via AP)\n\nAccording to Yeung, even if Beijing does allow them, a stablecoin on its own won't drive dedollarisation – it'll come down to a host of other factors.\n\n\"Some observers think it could help,\" he wrote.\n\n\"But it's likely any currency diversification will depend on the popularity of the yuan, rather than any one technology…\n\n\"Should China want to allocate less foreign reserve to $US, then stablecoins backed by other currencies are the alternative, not the yuan-backed stablecoin.\n\n\"The issuance of yuan-backed stablecoin requires sufficient high-quality liquid assets.\n\n\"This could be limited by the issuers' access to renminbi deposits, offshore China sovereign and sub-sovereign bonds and their access to the onshore bond market.\n\n\"Stablecoin issuance, and their reserve funds, will increase demand for these assets.\n\n\"But ultimately, the success of renminbi internationalisation will drive yuan-backed stablecoins — not the other way round.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/new-zealand-travel-fee-australian-tourists-to-nz-will-have-to-pay-a-new-cost-when-entering-the-country/fdadd35b-7f66-42ce-9e35-482b05c15475",
        "title": "Australians set to face new fees when travelling to New Zealand",
        "publish_date": "Fri, 08 Aug 2025 12:53:12 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Tourists visiting New Zealand are soon to be slugged with new travel fees.\n\nAll overseas travellers will be charged between $18 and $36 to visit some of New Zealand's most beautiful natural wonders.\n\nThat's places like Milford Sound, Mount Cook, as well as Cathedral Cove and Tongariro Crossing, one of the most popular hiking tracks in the country.\n\nREAD MORE: Shocking new details we can report about killer mushroom cook\n\nAll overseas travellers will now be hit with a fee between $18 and $36 to visit some of New Zealand's most beautiful natural wonders. (9News)\n\nThe New Zealand government says this will raise tens of millions of dollars to go towards conservation efforts and creating new jobs.\n\nThe fee doesn't kick in until 2027.\n\nPrime Minister Anthony Albanese is set to meet with his NZ counterpart this weekend, with trade top of the agenda.\n\nPrime Minister Anthony Albanese is set to meet with his NZ counterpart, Christopher Luxon, this weekend (9News)\n\nAlbanese will be arriving in Queenstown on Saturday and he's going to be given a traditional welcome before official meetings kick off with Prime Minister Christopher Luxon.\n\nThe pair are due to discuss increasing trade ties, as well as more co-operation on defence.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/user-generated-content-what-is-ugc-how-brands-use-it-everything-to-know-explained/63c50d19-63d2-4699-b2ce-075ffba46e1c",
        "title": "Ashlee can make an extra $6000 a month with this simple side hustle",
        "publish_date": "Fri, 08 Aug 2025 21:11:34 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Three little letters helped Ashlee Sullens ﻿boost her monthly income by thousands of dollars.\n\nThe 29-year-old from NSW﻿ discovered user-generated content or UGC two years ago and has since worked with brands like Dove, Olay, MCoBeauty and AfterPay.\n\nNow she can earn up to $6000 a month through the social media side hustle without even leaving the house.\n\nREAD MORE: Netanyahu says Israel plans to take over Gaza\n\nAshlee Sullens is one of thousands of Aussies making bank from a growing social media side hustle. (Supplied/Ashlee Sullens)\n\nBut what exactly is ﻿UGC, how does it work, and can everyday Aussies really make money doing it?\n\nHere's everything you need to know.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nWhat is UGC and how does it work?\n\nUGC is digital ﻿content created by everyday people and/or influencers to promote products or services for brands.\n\nUGC can be used to promote everything from skincare, to restaurants, ﻿the latest tech products, and online services.\n\nBrands typically provide free products or services to UGC creators in exchange for them making content about it.\n\nSome brands also pay creators a fee to create content or to use ﻿it for advertising.\n\nCommon examples of UGC include:\n\n﻿unboxings\n\nproduct reviews\n\nskincare routines\n\nrecipe hacks\n\nREAD MORE: Grim data reveals how a global superpower is on the brink of disaster\n\nThe UGC Sullens creates is predominantly beauty, wellness and lifestyle content. (TikTok/@ugc.ashlee)\n\nWhat sets UGC apart from traditional branded content﻿ is that it's usually shot \"on a phone, in real homes, by real users\".\n\n\"UGC is relatable, cost-effective and often performs better than polished brand ads because it feels like a recommendation, not a sales pitch,\" said Felicity Grey, founder and managing director at Theory Crew﻿, a social media marketing and PR agency.\n\nIt can also help everyday Aussies make extra cash on the side.﻿\n\nSullens first noticed UGC on her social media feeds in 2023 and decided to give it a go.\n\nUsing her background in social media marketing, she started by filming videos about \"random products\" she had lying around the house on her iPhone.\n\n\"Before I knew it, I had brands reaching out to work together,\" she told 9news.com.au.\n\nThe ﻿brand deals started small but were a great boost to her part-time income.\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\nTwo years on, she's working for herself full-time and can earn anywhere between $2000 and $6000 per month making UGC.\n\nThere are challenges, like when one brand \"ghosted\" her without payment after she made content for it, but Sullens said the perks outweigh the pitfalls.﻿\n\n\"I love the flexibility and time freedom the most,\" she said.\n\nWhat role does UGC play in social media?\n\nMost of the estimated 20 million Aussies﻿ who use social media have seen a UGC ad, though they may not have realised it.\n\nUnlike traditional brand﻿ ads, UGC is designed to feel authentic and relatable.﻿\n\nThat's because it's created by everyday people rather than a marketing team.\n\n\"As audiences crave more real and relatable content and become better at spotting overly polished ads, the shift towards authenticity has become impossible to ignore,\" Grey said.\n\n\"And we know UGC ads consistently outperform branded ones.\"﻿\n\nREAD MORE: How to maximise public holidays and make the most of your annual leave in 2025\n\nFelicity Grey is the founder and managing director at Theory Crew, a social media marketing and PR agency. (Theory Crew)\n\nHow did UGC become popular?\n\nUGC may seem like a new trend but it has been slowly growing for over a decade.\n\nIt started with ﻿bloggers and early influencers promoting products to online audiences in the 2010s and has only grown with the rise of platforms like TikTok.\n\nNow brands are leaning into the trend and making UGC a key part of their marketing strategy, paying everyday people to promote their products and fuelling the UGC boom.\n\nThat's largely because traditional advertising isn't as effective as it used to be.\n\nUp to 70 per cent of consumers avoid advertising and prefer to ﻿hear from experts or everyday people rather than influencers or celebrities, as evidenced by the recent Sydney Sweeney American Eagle ad controversy.\n\nUGC – which is made almost exclusively by \"normal\" people – checks that box.\n\n\"UGC helps bring products to life in a way traditional advertising often can't,\" Grey said.\n\nTheory Crew built RISER, a mass influencer sampling platform﻿, specifically to meet the demand for UGC.\n\nAnd she predicts the UGC boom will only get bigger and more lucrative in the years ahead.﻿\n\nWhat is the difference between UGC creator and influencer?\n\nWhere ﻿influencers build a personal brand to attract engaged followers, UGC creators focus on making relatable content for brands.\n\nTheir photos and videos are designed to feel more natural and they don't need a ﻿large following to work with big-name brands.﻿\n\nFrom a brand perspective, working with UGC creators typically costs less than working with influencers.\n\nBut that doesn't mean they're not making money; Sullens says she earns thousands of dollars every month from UGC.\n\nSullens can make up to $6000 a month creating UGC about things like skincare and beauty products. (Supplied/Ashlee Sullens)\n\n\"Everyday people are turning their creativity into careers, getting paid to produce content from their own homes,\" Grey said.\n\n\"You don't need a huge following, just a camera, a spark of creativity, and a willingness to show up authentically on screen.\"﻿\n\nHow do you become a UGC creator?\n\nGetting started as a UGC creator is fairly simple, according to both Sullens and Grey.\n\n\"Shoot content in natural light, use your own voice, and focus on being helpful or entertaining,\" Grey advised.\n\n\"You don't need a massive audience, just a clear idea of what makes a good piece of content. And don't be afraid to put yourself out there.\"\n\nYou don't need to invest in any fancy tech either.﻿\n\nSullens began with an iPhone and didn't pay for a tripod, microphone or editing software until she was already making money from UGC.\n\nREAD MORE: Trump calls on Intel CEO to resign for alleged ties to China\n\nSullens said Aussies don't need to invest in fancy tech to start making UGC. (Supplied/Ashlee Sullens)\n\nShe advises beginners to research what makes good UGC, focus on video quality over quantity, and get comfortable with being on-camera.﻿\n\nAnd remember that, like most side hustles, UGC ﻿isn't a \"get rich quick\" scheme that guarantees overnight success.\n\n﻿\"As much as UGC is glamourised and seems like a super easy way to make money – which is partly true – it also takes a lot of work behind the scenes,\" she said.\n\n\"There's a lot around consumer psychology, branding, marketing and scripting that goes into each video.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/wagin-considers-two-cat-limit-to-deal-with-strays/105590206",
        "title": "WA country town seeking two-cat limit per household",
        "publish_date": "Sun, 10 Aug 2025 02:02:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "The West Australian town of Wagin has a cat problem.\n\nLike many other towns and cities, it is dealing with a flood of feral and stray felines each year.\n\nThe Wheatbelt town has transferred more than 300 cats in three years to a rescue centre in Perth, about 230 kilometres away, with 80 of those this year alone.\n\nThe council now wants to limit the number of cats residents can own to two in a bid to reduce cat numbers.\n\nShire President Phillip Blight said rangers were spending more time than they should managing the problem.\n\nThe Shire of Wagin hopes to curb cat numbers and prevent them needing to be rehomed. (ABC News: Robert Koenig-Luck)\n\n\"There's an extraordinary amount of additional work looking after cats,\" he said.\n\n\"Most of them are not microchipped so you can't easily find the owners of these cats, so a lot of them then don't get claimed and they end up being moved on to Cat Haven.\"\n\nMichelle Muller has been running the Wagin Cat Rescue with her husband Larry Stanbridge, a local ranger, for about four years and believes owners need to take more responsibility.\n\nLarry Stanbridge is a local ranger and also runs the Wagin Cat Rescue with his wife. (Supplied: Michelle Muller)\n\n\"The lack of understanding that cats need to be sterilised, they need to be microchipped, they need to be registered to the shire,\" she said.\n\n\"Not having your cat sterilised is the biggest issue, because they just continue to breed and we had one household alone had over 40 cats that got out.\"\n\nChallenges with containment\n\nSupport for containment laws among local governments in the state is strong, with at least 80 in favour of permanent containment for pet cats, according to a WA Feral Cat Working Group survey released last month.\n\nBut attempts to introduce stricter local laws have fallen foul of state parliament, which has oversight of the regulation local governments attempt to introduce.\n\nOf the 26 councils that have tried to introduce containment laws under the WA Cat Act, only the shires of Northam, Narrogin and Christmas Island have been successful.\n\nThe Shire of Pingelly's cat containment policy, known as the Save the Numbats Local Law, is waiting to go before the recently reformed joint standing committee after its first attempt was knocked back last year.\n\nThe City of Bayswater's cat containment laws have been recommended for disallowance by the committee and are listed for the Legislative Council in September.\n\nThe Wagin Shire has chosen not to go down that path, at least for now.\n\n\"If we were to expand that out further, as many other shires have tried to do, they run up against some state government resistance to changes to cat local laws,\" Mr Blight said.\n\n\"We may well go further and look at the containment part of it down the track; it will largely be dependent on if those other councils succeed or if they have not.\"\n\nPhillip Blight says household limits on cats is a first step. (Supplied)\n\nThe battle with ferals\n\nVeterinarian Kate Clayton, who owns clinics in the nearby towns of Kojonup and Katanning, said feral cats were the real problem.\n\n\"The feline AIDS virus and the feline leukaemia virus are endemic in the feral population, and those retroviruses do not have any cure and they can be life-threatening,\" she said.\n\n\"Owned cats, if they're outside and they come in contact with a feral cat that is infected, they can become infected themselves.\"\n\nEdiegarrup Reserve is a former farming property undergoing restoration, sitting between Fitzgerald and Stirling national parks. (Supplied: Greenman Media)\n\nFurther south, 145 feral cats have been culled in the past five years as part of a fauna recovery project in an area surrounding the Fitzgerald River and Stirling Range national parks.\n\nThe culling of 3,500 foxes, feral cats and rabbits through baiting, trapping and shooting across 50,000 hectares involved 2,000 volunteers, 20 private landowners, a conservation group and a state agency.\n\nJeff Pinder says the Bush Heritage project to remove feral animals was highly collaborative. (Supplied: Nic Duncan)\n\nProject officer Jeff Pinder said the collaborative approach was needed, especially when dealing with varying landscapes.\n\n\"As much as we could remove a number, we were being reinvaded by additional animals from outside, and that emphasises the importance of creating a buffer around key reserves so that you can try and add that extra layer of protection,\" he said.\n\nCamera footage in the final year of the project showing a chuditch, a threatened species also known as a western quoll, was positive news for the project.\n\nA chuditch has been sighted at Monjebup Reserve. (Supplied: Bush Heritage Australia)\n\n\"We can't hang our hat on that and say, 'Yes, we've created a new population', but it does show a level of survivorship,\" Mr Pinder said.\n\n\"There was another sighting as well in Corackerup Nature Reserve, so there's a suggestion that animal may be coming back into our landscape.\n\n\"It's a sort of watch this space and hopefully through our management efforts we continue to see chuditch in our reserves.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/rural/2025-08-10/great-australian-cattle-drive-queensland-raises-money-food/105609272",
        "title": "Epic trek drives 1,670 head of cattle over 770km for a good cause",
        "publish_date": "Sun, 10 Aug 2025 01:21:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "As the last of the day's light retreats across the paddock, boss drover Billy Prow is checking the cattle one last time before joining his comrades around the campfire.\n\nLike the weary cattlemen of days gone by, his time stewarding this mob across the stock routes of outback Queensland is coming to an end.\n\nBut the scene on the outskirts of Roma, 470 kilometres north-west of Brisbane, is not from a history book — it's a modern depiction of the generosity of the bush.\n\nAn epic 770-kilometre trek, the Great Australian Charity Cattle Drive has something special in common with the droves of old — it is about making sure people get fed.\n\nHead drover Billy Prow finishes work on the last night of the charity cattle drive. (ABC Rural: Brandon Long)\n\nA 'crazy' idea\n\nAnthony 'Bim' Struss's connection to the cattle industry spans generations.\n\nHe previously served as the president of farm lobby AgForce's cattle board, and runs his own property, Havelock, with wife Susan.\n\nBim Struss says the drive showcases the importance of Australia's beef industry. (ABC Rural: Maddelin McCosker)\n\nIn 2021, he joined the board of BeefBank, a Brisbane-based not-for-profit that distributes meat to food charities struggling to access protein.\n\n\"The BeefBank chairman Andrew Rogers mentioned to me one day an event where we could put a few cattle together, drive them down the road and sell them and we could take the profits from that,\" Mr Struss said.\n\n\"I told him he was crazy at that point and I still think that Andrew is crazy.\n\n\"It has been a lot bigger event than that.\"\n\nThe drive travelled along Queensland's stock route network. (Supplied: Queensland government)\n\nIt took three years to pull the event together, but when the drovers finally set out from Longreach in May, Queensland Governor Jeannette Young and her husband Graeme Nimmo were there to send them off.\n\n\"What a great couple they are, just full of laughter, full of fun,\" Mr Struss said.\n\n\"I'll never forget Her Excellency said that she was always taught never to swing on a gate but [she said], 'Bim, I'm going to swing on the gate today and I'm the boss so I'm going to do it.'\n\n\"Everyone saw her swing, it was on national TV.\n\n\"It was a tremendous start for us.\"\n\nThe Queensland stock route network is mainly used for moving stock, pasture for emergency agistment, and long-term grazing. (ABC Rural: Brandon Long)\n\nWhat followed was three months of long days and some cold nights herding 1,670 head of donated cattle, volunteers and participants along historic stock routes.\n\nA route well-travelled\n\nStock routes were once the circulatory system of the livestock industry, a network of arteries and veins connecting station to saleyard and pumping cattle to consumer.\n\nLoading...\n\nFollowing river systems, Indigenous trade routes and trails, drovers walked cattle to market in the days before trucks and trains.\n\nSome routes eventually became roads while others fell into disuse as transport improved, but many remain, providing pasture in times of need and safe passage for migrating wildlife.\n\nHead drover Billy Prow has been moving stock along these paths for three decades.\n\nBoss drover Billy Prow is a legend of the livestock industry. (ABC Rural: Brandon Long)\n\n\"I would have done that route [Longreach to Roma] numerous times, I don't know how many times but done it quite a fair bit,\" he said.\n\n\"Some years were flat out, and then other years I've had a couple of quieter years compared to some blokes around.\n\n\"It's all about the stock routes to me ... hopefully they keep maintained so travelling stock will always get through.\"\n\nAbout 1,670 head of cattle travelled 770 kilometres from Longreach to Roma over three months. (ABC Rural: Brandon Long)\n\nParticipants were provided a horse, meals and transfers to the nearest town — a \"bit different\" to the drives Mr Prow was used to.\n\n\"I've never had that many people around me before around the mob of cattle,\" he said.\n\n\"They've been pretty good ... they always try to listen to what you're trying to say. They don't get in the middle of them [the cattle] too much.\"\n\nCountry musician James Blundell makes an appearance at the camp. (ABC Rural: Brandon Long)\n\nAffectionately called the \"tourists\" around camp, there were plenty of authentic droving moments for volunteers along the way, such as bad weather and the herd spooking.\n\n\"A few wet days back there and they've only had the one rush, so that's not too bad with a mob of travelling cattle,\" Mr Prow said.\n\nFor \"tourist\" Dean Nalder, the event was a chance to get back in the saddle for the first time in 20 years.\n\n\"I grew up in the bush and we had horses on the farm when I was a kid,\" he said.\n\n\"A lot of people back home in Perth were horrified that I was doing such a thing.\n\n\"But I've been pleasantly surprised. I've got a great horse, he was quiet, the cattle are fat and happy, so it was just a quiet ride.\"\n\nDean Nalder, who grew up on a farm in Western Australia, joined the drive for the final leg. (ABC Rural: Brandon Long)\n\nGiven a unique opportunity to work alongside Mr Prow, he felt like an apprentice watching a master ply his trade.\n\n\"We admired what he could do with his dogs and the horses and his awareness of the cattle,\" Mr Nalder said.\n\n\"We could walk up amongst the cattle on horseback and they were quite comfortable with us being there, it was just really fantastic.\n\n\"I would do it just for the adventure, but the fact that it helps people at the same time is what, for me, takes it over the top and makes it something quite special.\"\n\nDrovers move the last of the cattle into a pen before the sun sets. (ABC Rural: Brandon Long)\n\nDroving the distance\n\nJaide Donnellan, 16, has only been riding horses for three years, but was part of the droving team that brought the cattle into Longreach from Muttaburra.\n\n\"I never thought I'd ever go droving. I've always kind of wanted to do station work, but I gave this a go and I really love it,\" she said.\n\n\"The kids made it fun ... I learned a bit from them too, how young they are and how they can ride so easily because they've been doing it their whole life.\n\n\"It's pretty amazing to watch.\"\n\nDrovers Ally Southern (left) and Jaide Donnellan were part of the 770 kilometre journey. (ABC Rural: Brandon Long)\n\nMo Bassett spent seven weeks volunteering on the drive.\n\n\"We just had to do our job, help move gear along to the next spot. That was our job and we did it. I loved it,\" he said.\n\n\" There were people from all walks of life. I can't remember half their names now, but they were such lovely people. \"\n\nAs the cattle settled into their pens at the Roma saleyards, the final count of how much money was raised along the way is still being tallied.\n\nThe animals will either go back to the feedlots and pastures they came from, or be sold to meatworks, eventually making their way onto dinner tables around the country.\n\nMo Bassett, who was born and bred in the Roma area, volunteered on the drive for seven weeks. (ABC Rural: Brandon Long)\n\nWhatever the total raised turns out to be, the collaborative effort is enough to make even stoic cattlemen like Mr Struss a little sentimental.\n\n\"It's actually quite heartwarming to be honest — the ability for those people to get together and work together with a common cause,\" he said.\n\n\"Sometimes it's just that one or two meals that gives that person the dignity to get up and get going again.\n\n\"I think it's important that we all understand that we have a responsibility to look after these people.\n\n\"The whole thing has been an extraordinary adventure for us all.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/if-the-rba-cuts-rates-expect-property-prices-to-rise-again/105632180",
        "title": "The RBA is tipped to cut rates but borrowers might have to wait longer",
        "publish_date": "Sun, 10 Aug 2025 00:48:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "The RBA Board is meeting this week (on Monday and Tuesday) to discuss interest rates.\n\nIt surprised markets last month by keeping rates on hold, but analysts think we will see a rate cut this week.\n\nRate cuts feed into higher house prices, so what should we expect?\n\nHome price climb continues despite interest rate pause Photo shows A drone shot of rows of houses in Shell Cove, Wollongong's south. Australian property prices have scaled new record highs as demand for housing offsets buyer concerns about the Reserve Bank's shock call to hold interest rates steady.\n\nThe Commonwealth Bank's chief economist, Luke Yeaman (a former deputy secretary of the Commonwealth Treasury), and associate economist Lucinda Jerogin, updated their forecasts recently.\n\nThe CBA is Australia's largest home lender, so it has a clear interest in having accurate house price forecasts.\n\nThey said by the end of this year, home price rises would be higher than they were previously thinking, but next year prices will probably rise by less than they were previously thinking.\n\n\"We now expect growth of 6 per cent in 2025 (previously 4 per cent) and 4 per cent in 2026 (previously 5 per cent),\" they wrote. \"The upward revision this year reflects current market momentum, a still sound labour market and strong real household disposable incomes. \"However, given our forecast for a relatively shallow interest rate cycle, easing population growth and continued headwinds in the construction sector, this home price upswing is still expected to be relatively modest and taper out in 2026.\"\n\nTheir forecast is conditional on the RBA cutting rates by 25 basis points this week, and by another 25bp in November.\n\nIf the RBA cuts rates again after that, in early 2026, it could see a stronger rise in property prices than they're forecasting.\n\nThey say Australia's housing affordability woes are far from over, in this situation.\n\n\"There is little cause for celebration,\" they say.\n\nWhat home price growth can we expect this rate-cutting cycle?\n\nYeaman and Jerogin say interest rates are the dominant driver of property prices in the short run (when the supply of housing is fixed).\n\nThey say their statistical models suggest 100 basis points of interest rate cuts could see home prices (as measured by the Cotality National Hedonic Home Value Index) rise by 9 per cent.\n\nThe RBA has already cut rates by 50bp this year (in February and May combined), and a rate cut this week (25bp), followed by another rate cut in November (25bp), would bring the total to 100bp.\n\nInflation eases further in June quarter Photo shows Cost of living image of old hand holding cash with bills, calculator, glasses and cup of tea The \"trimmed mean\" measure of inflation — the Reserve Bank's preferred measure of underlying inflation — has also declined.\n\nHowever, they say if the RBA cuts rates again in early 2026, by another 25bp, that would lift the expected interest rate impact on home prices from 9 per cent to 11.5 per cent.\n\nThey say the expected increase in property prices will not be good for housing affordability.\n\nThat figure of 6 per cent annual price growth is also a national figure.\n\nDwelling prices are forecast to grow at very different rates across Australia's major cities in 2025.\n\nThey're forecasting annual growth of 13 per cent for Darwin, 8 per cent for Brisbane, 7 per cent for Perth, and 6 per cent for Adelaide and Canberra.\n\nBut next year, those rates of growth are forecast to be much lower (at this stage).\n\nAre the long-run drivers of interest rates stabilising?\n\nYeaman and Jerogin say the long-run drivers of interest rates appear to be stabilising.\n\nThey say real household disposable income is recovering strongly back towards trend levels.\n\nPopulation growth is expected to continue easing through 2025 and 2026, which will take pressure off housing demand and prices.\n\nHas high immigration fallen out of favour in Australia? Photo shows The corner of a piece of paper which reads 'Australian Government, Department of Home Affairs'. Some of the harshest criticism of high immigration is coming from people who work for the exact organisations that have supported high immigration for decades.\n\nThey expect a modest pick-up in new construction activity. (As interest rates come down, you typically see a lift in building approvals, feeding into higher completions.)\n\nThey say \"household size\" has also increased again, after collapsing during the pandemic, as cost-of-living pressures, falling housing affordability and higher rents have led to more people living together under the same roof (which helps to reduce demand for housing).\n\n\"The combination of lower population growth and rising construction activity should see the flow of housing supply and demand move closer to balance by the end of 2026,\" they say.\n\n\"Estimates from the National Housing Supply and Affordability Council suggest underlying housing demand will exceed underlying supply over 2025 and 2026, but the gap is closing.\n\n\"This should take some pressure off house prices,\" they say.\n\nHowever, they say housing affordability will remain a \"significant challenge\" for home buyers, especially first home buyers.\n\nWhat does it mean for first home hopefuls?\n\nThey say over the long term, home price growth should broadly match growth in household incomes.\n\nBut in contemporary Australia, home price growth has consistently exceeded income growth.\n\nSince 1990, real home prices have grown by 3.3 per cent a year, while real household disposable income has only grown by 2.9 per cent. That makes a big difference over 35 years.\n\nOver that period, they say a structural shift towards lower interest rates and easier access to credit have allowed price-to-income ratios to rise.\n\nStrong population growth, coupled with relatively unresponsive supply, has also contributed to higher property prices.\n\n\"This has made Australia's housing market one of the least affordable in the world,\" they say. \"The ratio of real median house prices to real household disposable income is 7.9, according to Cotality. \"And Sydney and Melbourne rank among the least affordable global cities.\n\nThey say, according to the National Housing Supply and Affordability Council, affordability deteriorated in 2024, with 50 per cent of median household income needed to meet repayments for the average mortgage.\n\nHousing debt servicing costs as a percentage of disposable income also surged to record levels last year.\n\nWhy mega landlords 'can't lose' Photo shows A drone shot of rows of houses in Shell Cove, Wollongong's south. Despite the surge in interest rates and a jump in loss-making rentals, few landlords are selling up. Experts say it's because negative gearing and the capital gains tax discount protect their investments.\n\n\"The rate of decline in affordability has slowed since 2023, as real household disposable incomes picked up and financing costs have eased,\" they say.\n\n\"While this trend is expected to continue in coming years, there is little cause for celebration.\n\n\"Our calculation of housing affordability, based on the percentage of pre-tax income directed towards the mortgage for a dual average full-time income household buying a median priced dwelling, suggests unaffordability peaked … in November 2024.\n\n\"Affordability is estimated to improve over the next two years, even as dwelling prices rise.\n\n\"Notwithstanding, housing affordability will remain stretched in a historical sense, particularly relative to pandemic lows.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/tasmanian-mlc-ruth-forrest-to-be-treasurer-in-labor-government/105633726",
        "title": "Labor names respected MLC as pick for treasurer in bid for government",
        "publish_date": "Sun, 10 Aug 2025 00:27:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tasmanian Labor will appoint independent upper house MLC Ruth Forrest as treasurer — if the party is able to form minority government when parliament resumes.\n\nLabor has confirmed a no-confidence motion will be moved once parliament resumes on August 19.\n\nRuth Forrest has been the independent Member of the Legislative Council (MLC) for the seat of Murchison since 2005.\n\nAs the most recent chair of the Joint Standing Committee on Public Accounts, she has led a committee tasked with investigating the bungled delivery of the Spirit of Tasmania vessels.\n\n\"Ms Forrest has a tremendous understanding of the enormity of the task at hand, and the ins-and-outs of the position Tasmania's budget finds itself in,\" Mr Winter said.\n\n\"Ms Forrest has championed the need for budget repair for many years now, and I am pleased she has accepted my invitation to take up the role should the House of Assembly crossbench decide to support a Labor government.\"\n\nIn June, the state's treasury department found Tasmania was headed for $13 billion of debt by 2028.\n\nBoth major parties are working to earn support from the crossbench, after failing to secure a majority at the July snap election.\n\nDean Winter has been courting Tasmania's lower house independents as his party attempts to form minority government. (ABC News: Ebony ten Broeke)\n\nMs Forrest to help in 'turning the ship around'\n\nMs Forrest has welcomed the opportunity to play an active role in addressing what she described as \"Tasmania's fiscal mess\".\n\n\"It has been a core area of my focus for a number of years now and I welcome the opportunity to play an active role in turning the ship around,\" Ms Forrest said.\n\n\"Should the opportunity to become treasurer become a reality, I will maintain my independence as a member of parliament and, of course, maintain the important rules related to cabinet solidarity, cabinet confidence and collective decision-making.\"\n\nMs Forrest would replace shadow treasurer Josh Willie.\n\nMr Willie described Tasmania as being \"at the crossroads\". (ABC News: Luke Bowden)\n\n\"I will always make decisions in the best interests of Tasmanians,\" Mr Willie said.\n\n\" Drawing on the experience of Ruth Forrest MLC as a parliamentarian and the respect she holds in the community will contribute to the solutions we, as Tasmanians, need to find together. \"\n\nMr Willie said Tasmania was \"at the crossroads\", and \"many difficult decisions\" were required to address Tasmania's budget problems.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/west-coast-rebuild-plans-from-peter-bell/105632738",
        "title": "Dockers great shares ideas on how AFL's worst performing team can rebuild",
        "publish_date": "Sun, 10 Aug 2025 00:12:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "West Coast should consider spending beyond the club's salary soft-cap — and pay the associated tax — to fast-track its rebuild, according to former Fremantle captain Peter Bell.\n\nThe Eagles are on the cusp of becoming the worst performing team over a four-season period in the history of the V/AFL.\n\nIf West Coast loses to Adelaide on Sunday afternoon, it will be the club's 78th defeat in the past four years, eclipsing the 77 losses suffered by North Melbourne between 2021 and 2024.\n\nIf they fail to win another game this season, West Coast will also become the club with the most losses in a single season, with the caveat of longer seasons now than in decades past.\n\nPeter Bell served as the Dockers general manager of football for four years, and played 163 games for the club. (Supplied)\n\n'Whopping bank balance'\n\nThe soft-cap rules mean AFL clubs can spend $7.67 million on their men’s program in 2025, with that amount increasing by $750,000 in 2026, and a further $350,000 in 2027.\n\nHarley Reid touted as future AFL great Photo shows Harley Reid Luke Shuey believes Harley Reid will become an AFL great, as the midfielder grapples with scrutiny over how he approaches the game.\n\nIf club’s spend more than that limit, they are hit with a tax, which varies depending on how far over the limit they are.\n\n\"They're one of the clubs that actually could (pay the tax) no problems at all,\" Bell, who won two premierships with North Melbourne, said on ABC Perth's Sports Talk program.\n\n\"They've got a whopping bank balance that is just sitting there, so should they on a short-term basis, say 'we're going to try and improve our number of development coaches to players ratio, and we're going to go over the soft cap. We're going to write out the cheque'.\n\n\"Because that's going to, if they choose the coaches right, that has to expedite the development process.\"\n\nLook further afield\n\nBell said the club should also commit to filling its entire list of players, including Category B players, for a decade, in the hope it finds some decent performers from outside the AFL pathway.\n\n\"Go to Ireland if there's not enough (talent) within your own academy,\" he said.\n\n\"It's a numbers game. You might waste 10 picks, but one of them might be a good player.\"\n\nMark Keane is one of 12 Irish-born AFL players competing in the 2025 season. (AAP Image/Matt Turner)\n\nSeveral AFL clubs have had success recruiting from Ireland, with former Geelong star Zach Tuohy a recent example.\n\nThere are currently 12 Irish players in the AFL, including Adelaide's Mark Keane and Brisbane's Connor McKenna.\n\nMore brutal list management\n\nBell said West Coast need to be ruthless when assessing whether players on the list have a future at the club, to create space for recruitment.\n\n\"Even if they're contracted, you've got total player payments [salary cap] space and you're a wealthy club,\" he said.\n\n\"If a player's got a two year contract, but you've made up your mind after one they're not part of our long-term plans, not going to play 100 games, pay them out, move them on, get another pick.\"\n\nJayden Hunt has played 58 games for the Eagles since joining from Melbourne, but hasn't got a contract for 2026. (AAP/Richard Wainwright)\n\nWest Coast coach Andrew McQualter has flagged he wants to bring in experienced players to fill the mid-20 age bracket, an area the club is struggling in.\n\nBell said the Eagles should do that through drafting and not trading.\n\n\"You need your high-end draft picks to go to the draft. Nail your picks, get them right, and develop them,\" he said.\n\n\"If you want to bring some experience in, have a look at players you can bring in as delisted free-agents, free-agents, or at worst maybe a pick slide with one of your own picks.\n\n\"Players will move for opportunity, but some of the teams up the top may need to shed some total player payment.\n\n\"So can we attract a player that's not getting an opportunity, that's a big contract, which West Coast can afford, can we get that player and can we get another draft pick?\"\n\nWho should they bring over?\n\nExamples of players the Eagles could target include Deven Robertson and Brandon Starcevich at Brisbane, Adelaide's Luke Peddler, or Elijah Tsatas from Essendon.\n\nDeven Robertson has been linked with a return to Western Australia after managing just 46 games in almost six seasons at Brisbane. (AAP Image/Matt Turner)\n\n\"It does come down to how much you have to pay to prise non-Western Australians to come here,\" he said.\n\n\"Players will move if they see the opportunity at a club.\"\n\nHave something to share with the ABC's WA newsroom? Photo shows Perth City and Claisebrook Cove Whether it's an image, video, story, or tip-off, you can send it to the ABC's West Australian newsroom here.\n\nLoading...\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/free-diver-tara-rawson-sets-australian-record/105630530",
        "title": "WA free diver pushes boundaries to set new Australian record",
        "publish_date": "Sun, 10 Aug 2025 00:07:21 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tara Rawson was captivated when she first saw someone free diving at the Rowley Shoals, 260 kilometres west of Broome, off Western Australia's northern coast.\n\nNow the dietician and yoga teacher has left the Kimberley so she can travel and train at dive sites around the world, and is working remotely from a temporary base in Egypt.\n\nThe 31-year-old is pushing her boundaries and recently made the deepest free dive for an Australian female — a staggering 82 metres.\n\nAnd all on just one breath.\n\n\"You need to be able to relax to dive at such depths,\" the former Broome resident said from Indonesia, where she was competing.\n\nFree diving plays a role in improving mental health for some competitors. (Supplied: Gus Kreivenas)\n\n\"If you're holding tension, you're using more oxygen and you're more likely to have issues.\"\n\nMs Rawson was underwater for two minutes and 45 seconds to complete the 82-metre dive, wearing fins.\n\nIn free immersion dives, with no fin assistance, she can be underwater for over three minutes.\n\nMs Rawson said she loved being able to spend more time underwater.\n\n\"Free diving has really helped me connect with the ocean … I can have more time underwater watching,\" she said.\n\n\"It's such a cool experience.\"\n\nThe former Kimberley resident had her first taste of free diving on a scuba diving trip to the Rowley Shoals.\n\nTara Rawson says free diving has opened up a world of possibilities for her. (Supplied: Tao Hoogland)\n\nMs Rawson was captivated by a staff member from the charter boat who was free diving near the seabed.\n\n\"She just looked so majestic … so peaceful and graceful as she was cruising around,\" she said.\n\n\"I was in awe of her.\"\n\nShe set about learning to free dive herself.\n\n\"I really trust in my physical abilities and trust that the set-up is a safe place to dive,\" Ms Rawson said.\n\n\"It allows the whole [body] system to soften and it becomes quite an enjoyable experience.\"\n\nSlow training techniques\n\nMs Rawson set up the Kimberley Free Diving Club in 2022 with Broome dive enthusiast Graham Makereth.\n\nTara Rawson made her first steps into free diving in the Kimberley, in Western Australia's north. (Supplied: Tao Hoogland)\n\nIt has attracted interest from spearfishers and snorkellers, and has about 140 members.\n\n\"It has some special challenges, but we have this wonderful deep trench [off Broome] that's been carved by the current,\" Mr Makereth said.\n\n\"It's a fantastic place to free dive.\"\n\nHe said the purpose of the club was to safely introduce people to free diving off Broome, using local knowledge of big tides — and sharks.\n\n\"We have to be careful with bull sharks and tiger sharks, but all the other sharks, which we regularly see, are just part of being in the water,\" Mr Makereth said.\n\nBroome dive enthusiast Graham Makereth set up the Kimberley Free Diving Club with Tara Rawson in 2022. (Supplied: Graham Makereth)\n\nMr Makereth, who is a trained free-diving instructor with many years' experience, said a \"dive response\" slowed the heart and increased blood flow to the brain.\n\n\"You learn techniques to keep the air in the mouth and then use that air to equalise with,\" he said.\n\nSessions at the local swimming pool are part of the deliberately slow process of learning how to free dive.\n\n\"You have to acclimatise very slowly … you've got to own a depth,\" Mr Makereth said.\n\n\" You want to get very comfortable at a depth before you progress beyond it. \"\n\nAussie record holder\n\nMs Rawson holds three Australian national records in separate disciplines of free diving.\n\nThe records were ratified following the Manado Depth Competition in Indonesia in August and the International Association for the Development of Apnea (AIDA) Asian Freediving Cup in the Philippines in June.\n\nMs Rawson's dive of 82 metres in June secured the top spot for an Australian female in the Constant Weight with fins (CWT) discipline.\n\nShe also holds first place in Constant Weight with bi-fins (CWTB) with a dive of 81 metres, and in the Free Immersion (FIM) category for a 79-metre dive.\n\n\"I love the world free diving has opened up for me,\" Ms Rawson said.\n\nShe intends to rest in Bali before returning to her base in Egypt — another location popular for free divers — to contemplate her next free diving record attempt.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/maya-joint-wins-second-round-at-cincinnati-open/105633668",
        "title": "Joint leads Aussie charge at Cincinnati Open",
        "publish_date": "Sun, 10 Aug 2025 00:01:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Rising Australian tennis star Maya Joint has fought her way into the third round of the Cincinnati Open.\n\nThe 19-year-old overcame a mid-match wobble to defeat 18th-seeded Beatriz Haddad Maia 6-4, 4-6, 6-4.\n\nJoint proved much more effective on her first serve, landing 70 per cent compared with just 55 per cent for her Brazilian opponent.\n\nMboko slays final giant in Montreal Photo shows Victoria Mboko lifts the Canadian Open trophy as Naomi Osaka bows her head next to her. Canadian teenager Victoria Mboko delights crowds in Montreal and Toronto with her Canadian Open final win over four-time grand slam winner Naomi Osaka.\n\nIn a match that featured a swag of break-point opportunities, Joint had a slight advantage, converting seven of the 19 chances she set up.\n\nVictory for Joint on the Cincinnati hard courts set up a third-round meeting with 12th-seeded Russian Ekaterina Alexandrova.\n\nJoint reached a career-high singles ranking of number 37 last month.\n\nLooking to join her in the third round in Cincinnati are fellow Australians Daria Kasatkina, Kimberly Birrell and Ajla Tomljanović.\n\nKasatkina, seeded 15th in Cincinnati, is favoured to advance when she takes on Italy's Lucia Bronzetti.\n\nBirrell faces a daunting challenge against US fourth seed Jessica Pegula, who reached the US Open final last year.\n\nTomljanović will also have her hands full when she takes on Denmark's Clara Tauson, who beat major winners Iga Świątek and Madison Keys on her way to the Canadian Open semifinals.\n\nŚwiątek bounced back from her shock loss to Tauson in Montreal by beating Russia's Anastasia Potapova 6-1, 6-4 in the second round in Cincinnati.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/when-will-tasmanians-know-who-will-govern-july-2025-election/105632474",
        "title": "Tasmania reappointed its premier last week but a new bid to replace the government is imminent",
        "publish_date": "Sat, 09 Aug 2025 23:57:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's been a wild two months in Tasmanian politics.\n\nPremier Jeremy Rockliff was brought down by a no-confidence motion in June, but his unwillingness to step aside and Labor's refusal to govern with the support of the Greens sent the state to an early election.\n\nIt was an election held more than two and a half years earlier than expected.\n\nAfter a lacklustre election campaign, Tasmanians voted for who they wanted to take the state forward.\n\nThe only catch? The make-up of the new parliament is essentially identical to the one elected last year, with the Liberals on 14 seats and Labor on 10 seats, both well short of a majority.\n\nMr Rockliff was re-commissioned as premier by Governor Barbara Baker on Wednesday, but it really only guaranteed him two more weeks in the top job.\n\nOn August 19, it will be déjà vu all over again, when Mr Rockliff faces a motion of no-confidence moved by Labor.\n\nCan Labor form government?\n\nIs Labor really trying to form a government with just 10 of the required 18 seats?\n\nThey sure are.\n\nGreens say Winter has to negotiate if he wants to be premier Photo shows Tasmanian Labor leader Dean Winter Labor's Dean Winter is still vying for power, but continues refusing discussions with the Greens.\n\nLabor received a statewide first preference vote of just 25.9 per cent, a drop of 3.1 per cent.\n\nAnd its leader Dean Winter received less than a quota in his own right, elected fifth [out of seven seats] to the southern seat of Franklin.\n\nBut that hasn't been enough to stop the party from dreaming of being in government for the first time since 2014.\n\nBecause the Liberals haven't signed supply and confidence deals with enough crossbenchers to lock in support on the floor of the lower house, Mr Winter has started aggressively courting the independents himself.\n\nDean Winter received less than a quota in his own right in the recent state election. (ABC News: Luke Bowden)\n\nHe argues Tasmania is better off under a Labor government.\n\nHe says Labor has a plan to restore the state's budget, rather than a Liberal government that until extremely recently had not even hinted there was a problem, despite Treasury's pre-election financial outlook predicting net debt would rise to almost $13 billion by 2027–28.\n\nAre enough crossbenchers going to support Labor?\n\nIn short, we don't know.\n\nThe Greens, who supported the no-confidence motion in Mr Rockliff in June, said publicly they'd prefer to work with Labor than the Liberals.\n\nBut they've been largely frozen out by a Labor Party that keeps insisting it won't do deals with the Greens.\n\nThat lack of communication means there remains uncertainty about how the five elected Greens MPs will vote.\n\n\"There is no reason for him to think that we will just roll over and give him our support without a proper conversation,\" Greens leader Rosalie Woodruff said.\n\n\"We have to do our job of fighting for the people that put us in parliament and voted for us. They want change from business as usual.\"\n\nDr Woodruff's party has said it remained willing to work with Labor. (ABC News: Jake Grant)\n\nIf the Greens are on board, Labor needs three more of the remaining six crossbenchers to agree in order to form government.\n\nIndependent MP Craig Garland has previously said he would vote for a no-confidence motion in the re-elected premier, blasting the Liberals' \"arrogant\" approach over the Marinus Link undersea power cable project, but said late this week that the door wasn't completely shut on the Liberals.\n\n\"The Liberal Party may stand up. They may come to the table and say we got this wrong, we're willing to compromise, we're willing to sit down and make these concessions, and if that's the case, I'll support them,\" he said.\n\n\"If Labor want to do it, I'll support them.\"\n\nLoading...\n\nThe four other independents – Kristie Johnston, David O'Byrne, Peter George and George Razay — as well as incoming Shooters, Fishers and Farmers MP Carlo Di Falco have all yet to make up their minds.\n\nLots of the crossbenchers are calling for the major parties to compromise on policies, something they've so far flatly refused to do.\n\nCould there be another election?\n\nEvery member of the lower house knows this parliament needs to last for the long term.\n\nLoading...\n\nSo the motion, likely to be moved by Labor, will do two things:\n\nFirst, it will move no-confidence in Mr Rockliff's government.\n\nSecondly, it will move confidence in a Labor government.\n\nIt's a bid to replace the government, not to send the state to another election.\n\nWhich party is winning over the crossbenchers?\n\nThe Liberals made some big changes this week as they try to neutralise one of the key issues for the crossbench: the state of the budget.\n\nAbetz is treasurer in Tasmanian cabinet shuffle Photo shows Two men in suits outside a sandstone building. Eric Abetz takes over as treasurer, while Bridget Archer is given the health portfolio, as Jeremy Rockliff reveals his cabinet picks for Tasmania's next government.\n\nDeputy Premier Guy Barnett has been moved on from the treasury portfolio and replaced by former federal minister Eric Abetz.\n\nMr Abetz's first act was to announce a new multi-partisan budget panel, which will consult with all MPs and stakeholders about their plans to put the budget back in the black, and rein in the debt.\n\nAnd while Mr Rockliff and Mr Barnett insisted the budget was \"on a sensible pathway to surplus\" and the debt at sustainable levels, Mr Abetz was much more circumspect.\n\nHis press conference on Friday was littered with phrases such as \"budget repair\" and bringing \"the budget back into shape\".\n\n\"Clearly the situation does require rectifying … I think all of us understand and realise that there is a budget imperative that needs to be addressed and that will be my challenge,\" Mr Abetz said.\n\nLabor met with the five independents on Thursday, and is pointing towards policies it has in common with most crossbenchers, spruiking its new suite of policies to include integrity in politics, including replacing the Integrity Commission with a new anti-corruption commission, and strengthening right-to-information laws.\n\nThe party intends to release its plans on other policy areas in coming days.\n\nIt's likely we won't know which party has convinced enough crossbenchers to side with it until state parliament resumes on August 19.\n\nAnd the nation again watches closely as parliamentarians debate who should lead the state going forward.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/when-does-the-rba-meeting-reserve-bank-interest-rates/105533028",
        "title": "Inflation figures point to a rate cut. But how long until borrowers see savings?",
        "publish_date": "Sat, 09 Aug 2025 22:47:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Reserve Bank of Australia (RBA) shocked many in the finance sector when it voted against cutting the cash rate last month.\n\nThe news came as a blow to people paying off home loans, who hoped a rate cut would reduce their mortgage bills.\n\nMany are now looking towards the next meeting with anticipation.\n\nHere's what you need to know before the next RBA's next monetary policy meeting.\n\nWhen does the RBA meet next?\n\nTomorrow.\n\nBut it's a two-day meeting, so we won't hear about the decision until Tuesday afternoon.\n\nWe're expecting an announcement at 2.30pm AEST on Tuesday, August 12.\n\nWill there be a rate cut?\n\nWe can't say for sure.\n\nHowever, many people are banking on one after the Australian Bureau of Statistics (ABS) published the quarterly inflation figures at the end of July.\n\nRate cut 'seems a done deal' amid falling inflation Photo shows Cost of living image of old hand holding cash with bills, calculator, glasses and cup of tea The \"trimmed mean\" measure of inflation — the Reserve Bank's preferred measure of underlying inflation — has also declined.\n\nThose figures showed inflation was now well and truly within the RBA's preferred range of between 2 and 3 per cent.\n\nWithin the inflation data, there were two main figures people were paying attention to:\n\nHeadline inflation: 2.1 per cent\n\n2.1 per cent Trimmed mean: 2.7 per cent\n\nThe trimmed mean is also called \"underlying inflation\".\n\nThe trimmed mean is the statistic the RBA had previously said it was focusing on to measure inflation, which meant a lot of people were watching for that figure in particular.\n\nOn the graph below, you can see headline inflation — the red line — has been within the RBA's target range for longer than the trimmed mean.\n\nHeadline inflation reached that range in September last year.\n\nBut the trimmed mean — the blue line — only reached that range in March, when it hit 2.9 per cent.\n\nWhat is the cash rate target?\n\nCurrently, the cash rate target is 3.85 per cent.\n\nThis figure is often referred to as \"the interest rate\" in conversation, but it's not the rate people with mortgages pay.\n\n\"The cash rate is the interest rate that banks pay to borrow funds from other banks in the money market overnight,\" the RBA's website says.\n\n\"It influences all other interest rates, including mortgage and deposit rates.\"\n\nThat's why, if you're paying interest on a loan, your interest rate is probably higher than 3.85 per cent.\n\nWhen the RBA changes the cash rate target, interest rates for mortgages don't automatically change — the individual banks decide that.\n\nWhy didn't the RBA cut rates last time?\n\nThe RBA said it was waiting on more data.\n\nMany people expected the RBA to cut rates at the July meeting off the back of monthly inflation data from the ABS.\n\nThe RBA has repeatedly said it wants Australia's inflation to get down to 2 to 3 per cent — and that monthly data was within that range.\n\nHowever, that was monthly data, not quarterly data, which takes in three months at a time.\n\nAnd it's this quarterly data that's regarded as Australia's key inflation measure.\n\nAt the time of the July meeting, the most recent batch of quarterly data had come out in April — and the RBA wanted to wait until the next drop of inflation figures at the end July.\n\nNow those figures are out.\n\nAnd they look promising for people hoping for a rate cut.\n\nWe'll find out what's happening with rates on Tuesday afternoon. (ABC News: Dannielle Maguire)\n\nWhen will interest rates go down?\n\nNo one can say for sure.\n\nIf the RBA does cut the cash rate target, that doesn't mean mortgage interest rates will automatically go down.\n\nIt'll be up to the banks to decide if they'll pass that cut on to customers.\n\nSo if you have a mortgage, you'll have to wait to hear from your lending institution about whether your rates are changing.\n\nWe typically hear from the major banks within a few hours of the RBA's decision, though, so you probably won't have to wait very long.\n\nHowever, there is often a lag between banks announcing they'll cut their interest rates and that cut taking effect.\n\nThey usually keep charging the higher rate for a week or two before the rate goes down — meaning it could be about a fortnight before people paying off a loan start to see any savings on their bills.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/australia-before-and-after-school-care-desert/105582936",
        "title": "These are Australia's best and worst regions to access out-of-school care",
        "publish_date": "Sat, 09 Aug 2025 22:27:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "For many Australian parents the 9am to 3pm school day doesn't line up with their working day.\n\nBut in large parts of the country accessing a spot at before and after-school care is not an option.\n\nA recent study by Sydney Policy Lab at the University of Sydney has found shortages of before- and after-school places, also known as outside school hours care (OSHC), across Australia.\n\n\"Nationally, only about one in five students have a place available to them in before and after-school care on any given school day,\" Sydney Policy Lab's Max Hall said.\n\nMax Hall and Dr Kate Harrison Brennan from the Sydney Policy Lab, University of Sydney. (ABC News: Andrew Whitington)\n\nThe lab's director Kate Harrison Brennan said there were concerns the service shortage was impacting some parents' ability to work the hours they need.\n\n\"They're having to plead — often personally in their workplaces — to use flexible arrangements, asking grandparents if they could step into the breach,\" Dr Harrison Brennan said.\n\nMapping the black spots\n\nTo help illustrate the scale of the issue, the Sydney Policy Lab has mapped the number of OSHC services across the country.\n\nThe darker region are where there are fewer places per student.\n\nZoom into the capital cities, and blue regions start to appear.\n\nThese blue areas show where there are more OSHC options per student.\n\nThey are concentrated mostly in the inner-suburbs of the east coast and southern capitals.\n\nBut even in some big cities it can be a struggle.\n\nIn Perth there are OSHC places for only 17 per cent of primary school students.\n\nAnd in the region that takes in Broken Hill and far-west New South Wales, 13 primary schools share just three registered OSHC services.\n\nIn that area there are only 158 approved places for more than 1,600 school students, which means fewer than 10 per cent of students are able to receive care.\n\nPerth has the lowest rate of after-school care places per student out of all capital cities. (Supplied: Max Hall/Sydney Policy Lab)\n\nThat is compared with Leichhardt in Sydney's inner west — which has the highest number of OSHC services per student in the country — with places for 45 per cent of primary school students.\n\nComparing states and territories, the ACT is the easiest place to find a spot with places available for one in three students.\n\nWestern Australia is lagging behind with spots for only about 16 per cent of primary school students.\n\nThe cost of care shortages\n\nDr Samantha Goss reduced her working hours due to a lack of OSHC options. (ABC News: Simon Farrell)\n\nSamantha Goss is a general practitioner in Tasmania who struggled to access OSHC for her son.\n\n\"It meant that I couldn't work a longer day and I had to be back at the school at 2:50pm for school pick-up,\" Dr Goss said.\n\nFor Dr Goss, that equated to being unavailable for up to 12 appointments with patients per day.\n\nWhile she eventually found care for her son, her problem is a common one.\n\n\"It has a flow-on effect to the economy, particularly when we're talking about women in the workforce,\" Dr Goss said.\n\nHow helping women into the workforce is worth millions to the economy Photo shows Woman with dark hair smiles into the camera A report finds one charity helping women into the workforce has generated $86 million in net direct economic benefits over the past 20 years.\n\nLast year, the Productivity Commission found about two million parents with children aged under 15 years old — the large majority of them mothers — were either not in the labour force or were working part time in 2022–23.\n\nOf this group, just more than half reported that caring for children was the main barrier faced.\n\nThe Productivity Commission recommended state and territory governments should facilitate the provision of outside hours care in all public schools, where there is sustainable demand.\n\n\"We're seeing a lack of coordination and a lack of understanding really at a government level, both federal and state, of the significance of this,\" Dr Harrison Brennan said.\n\n\"When there is really high quality, reliable before- and after-school care, parents are able to make different decisions about workforce participation.\"\n\nLess screen time, more old-school fun\n\nLoading...\n\nAt Lansdowne Crescent Primary School in West Hobart, Tasmania, the school hall has been converted into a home away from home.\n\nAt after-school care here, there's a relaxed vibe where children get a say in what they do.\n\nFor Theodore, it's all about making cubbies with his friends, while Edwin is into making Lego, and Stella likes doing handstands.\n\nAfter-school care at is provided for students of different ages at Landsdowne Crescent Primary School. (ABC News: Maren Preuss)\n\nThe OSHC service at this school is run by childcare not-for-profit Lady Gowrie Tasmania.\n\nLady Gowrie's Pedagogy and Practice Manager, Shannon Gall, said the service offers students time away from screens and more old-school fun.\n\n\"Gone are the days of the neighbourhood kids all meeting together in the street after school,\" Ms Gall said.\n\n\"We're all a bit more isolated, so it really is a lovely chance for them.\"\n\nShannon Gall says the service gives students a chance to play in a safe environment. (ABC News: Maren Preuss)\n\nOn-site services the gold standard\n\nAccording to the research, the gold standard for after-school care was an on-site service at a primary school, Sydney Policy Lab's Max Hall said.\n\n\"A child experiences their entire school day, whether they're in the classroom or in the playground, seamlessly,\" Mr Hall said.\n\nThere are calls from the sector for state and federal governments to improve access to existing school buildings for the services, while ensuring they meet child safety standards.\n\nThe gold standard for OSHC is an on-site services at a primary school, researchers say. (ABC News: Maren Preuss)\n\nOffer free child care for families earning under $80,000, says PC review Photo shows Toddlers play around a table. A mother is with her child, and a woman dressed in purple monitors. Nearly all families would benefit from a lift to childcare subsidies recommended by the Productivity Commission, with free care for low-income families.\n\nPsychologist and academic at University of Sydney, Associate Professor Milton, said schools could also consider extending volunteering opportunities, ensuring they fit with Australia's safety standards.\n\n\"The sector is calling for OSHC-specific infrastructure investment, smarter use of school facilities, and nationally consistent, long-term workforce reforms,\" she said.\n\n\"In OSHC, that means highly trained staff overseeing structured volunteering, so community members can contribute their skills within safe, well-regulated programs,\" she said.\n\n\"We need real investment in secure, high-quality jobs with adequate child-to-staff ratios, better pay, nationally consistent training standards, and stronger support for inclusion and safety.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/great-ocean-road-regional-tourism-glenelg-shire-council/105621254",
        "title": "Glenelg gives up bid to be part of global Great Ocean Road tourism brand",
        "publish_date": "Sat, 09 Aug 2025 22:26:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "A regional Victorian council boasting beaches, whales and a UNESCO World Heritage listing is ending its decade-long campaign to be considered part of the Great Ocean Road.\n\nDespite not being on the road itself, Glenelg Shire in the south-western corner of the state is part of the Great Ocean Road tourism region, as defined by the federal government.\n\nA Glenelg Shire Council representative has been on the Great Ocean Road Regional Tourism (GORRT) board since 2015.\n\nThe council cited a lack of support from state and federal governments as the reason behind its decision to withdraw from the GORRT visitor economy partnership.\n\nCasterton in Glenelg Shire is famous for its kelpie muster. (Supplied: Lauren Doolan/GORRT)\n\n\"We are regularly omitted from marketing, tourism campaigns and strategies such as the Great Ocean Road Action Plan and, most recently, the Great Ocean Road Regional Trail Strategy, which concludes at Port Fairy, therefore excluding the Great South West Walk,\" a statement on the council's website read.\n\n\"Although GORRT have been strong in their advocacy and attempts to link the Glenelg Shire to the Great Ocean Road, the Glenelg Shire is simply not officially recognised by our state and federal partners as being part of the Great Ocean Road.\"\n\nThe Victorian government manages both projects cited by the council.\n\nA government spokesperson said in a statement that GORRT was the recognised peak body for tourism in the region.\n\n\"We will continue to work with Glenelg Shire to encourage visitors to visit South West Victoria and experience the best of the Great Ocean Road,\" the spokesperson said.\n\nThe Great Ocean Road is the most popular regional Victorian destination for international tourists. (Supplied: Tourism Australia)\n\n'Not part of the conversation'\n\nFour of the six regional Victorian local government areas most visited by international tourists from March 2023 to March 2025 were along the Great Ocean Road touring route from Melbourne.\n\nGlenelg Shire came in 21st, according to the latest data on the Tourism Research Australia website.\n\nPortland accommodation provider Nicole Carr says the town's association with the Great Ocean Road brings in tourists.\n\n\"Nobody's going to google Glenelg Shire,\" she said.\n\nAccommodation provider Nicole Carr is concerned the shire will lose significant tourist revenue. (Supplied)\n\nShe is disappointed businesses were not consulted before the council made the decision, particularly as Tourism Australia has this week launched its new global campaign.\n\nThe television commercial asking international visitors to \"Come and say G'day\" features just one Victorian location: the Great Ocean Road.\n\n\"If we're not part of that conversation, we're not tapping into this industry,\" Ms Carr said.\n\n\" I don't know how we can do it alone. \"\n\nGlenelg Shire Council did not respond to the ABC's questions regarding business consultation.\n\nThe Great Ocean Road is the only Victorian destination featured in Tourism Australia's new television advertisement. (Supplied: Tourism Australia)\n\n'Not bang for buck'\n\nThe Glenelg council paid a fee of $100,000 last financial year for its GORRT membership, which gives local businesses free access to marketing on a range of tourism websites.\n\nThe tourism board changed its fee to a tiered structure after a review, meaning Glenelg Shire would have paid $80,000 if it had chosen to renew its membership this year.\n\nMayor Karen Stephens said the investment was not returning the desired results.\n\n\"We as a council believe that investment into the Great Ocean Road tourism is not getting us bang for our buck,\" she said.\n\n\"$100,000 a year — we reckon we could do a lot with that.\"\n\nMayor Karen Stephens says Glenelg Shire Council is developing its own localised tourism strategy. (ABC South East SA: Grace Whiteside)\n\nIt is not the first time a local government has baulked at the cost of GORRT membership.\n\nIn March, Colac-Otway Shire Council voted to reduce its payment from $100,000 to $80,000, but backflipped in June after GORRT warned it may withdraw services.\n\nColac-Otway Shire is undertaking a formal review of its membership, which is set to be completed by March.\n\nConnecting the region\n\nGORRT general manager Liz Price said in a statement the board was \"disappointed but respected the Glenelg Shire's decision\".\n\n\"GORRT has consistently raised concerns about the differences in scope of a range of state government plans and initiatives and continues to advocate for the inclusion of the whole of the tourism region,\" she said.\n\nLiz Price says the state government contributes $590,000 to GORRT each year. (Supplied)\n\n\"This includes not just the western end of the region but also our northern towns.\"\n\nMs Price said businesses within the shire could still directly partner with the board for marketing packages from $385.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/driving-key-to-independence-for-older-people-in-regional-qld/105413446",
        "title": "Having a driver's licence gives older Aussies purpose and independence",
        "publish_date": "Sat, 09 Aug 2025 21:57:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Most mornings start the same for Graham Brennan.\n\nHe's up and out the door early, cruising the tame streets of the outback Queensland town he calls home.\n\nAt 92, it's this routine that keeps the nonagenarian feeling decades younger.\n\n\"I can't quite believe it myself, I feel about 50 or 60,\" he quips.\n\n\"I love being independent and doing what I want to do, when I want to do, how I want to do it.\"\n\nStaying in the driver's seat\n\nGraham Brennan still cherishes his car and licence, which allow him to go about his day as he pleases. (ABC News: Meghan Dansie/Sharon Gordon)\n\nMr Brennan lives in the remote mining city of Mount Isa, almost 2,000 kilometres from Queensland's capital.\n\nWithout public transport, options for getting around are limited for ageing locals.\n\nIf he didn't have a licence, the 92-year-old would have to walk long distances in temperatures that hover above 30 degrees Celsius for much of the year.\n\nAfter a stint in a car repair shop thanks to a busted gasket, Mr Brennan was given a taste of the alternative.\n\nLiving in regional Queensland, Graham Brennan can't imagine life without his licence. (ABC North West Qld: Meghan Dansie)\n\n\"There's no bus, there's a fairly long walk so sometimes I will get a cab home because it's a long way back and it's uphill,\" Mr Brennan says.\n\n\"I was shaking all over when I got the call to say it was done.\n\n\" That was just earth-shaking really, I was so glad. \"\n\n'Capability rather than age'\n\nIn Queensland, there is no upper age limit for a licence, but stringent annual health checks help keep ageing drivers and the broader public safe.\n\nDrivers aged 75 and over must attend a licence medical check every 12 months and always carry a medical certificate.\n\nMr Brennan's GP, Michael Mbaogu, conducts assessments like these every day.\n\nIn Queensland, drivers 75 years and above who want to stay on the roads must pass an annual check. (ABC News: Emily Dobson/Sharon Gordon)\n\n\"A lot is riding on the back of these licences [in regional Queensland],\" Dr Mbaogu says.\n\n\"If you're unable to drive, then you cannot go where you want.\n\n\"In a place like this, they need a vehicle to get around.\n\n\" I wouldn't go as far as saying it's the secret to a long life, but it makes a lot of difference. \"\n\nThere's a delicate balance between public safety and maintaining patient wellbeing and quality of life.\n\nMichael Mbaogu says Graham Brennan would be one of the older drivers he has assessed. (ABC North West Qld: Emily Dobson)\n\n\"It's not just about cognitive impairment … we can refer to specialists to check hearing, eyesight, blood pressure,\" Dr Mbaogu says.\n\n\"If we're not sure, we will send them for a practical driving assessment, and if they're not fit to operate a motor vehicle, they will not get a certificate.\"\n\nThere are speed limits on the roads — but should there be age limits? Photo shows A graphic of a speed limit for a 90kph zone. Driving in later life can bring its own challenges, but rules around older road users vary widely across the country.\n\nAdvocacy group Council on the Ageing Queensland chief executive Darren Young said it was important to use capability as the barometer, rather than age.\n\n\"Losing a licence is a big fear for people across regional Queensland. It can have really drastic effects,\" Mr Young says.\n\n\"Not being able to see friends or relying on neighbours to go to the shops.\n\n\"Some people even stop eating as regularly or they don't get the medication they want.\"\n\nThe Sunshine State has an ageing population. By 2050, government data estimates almost 25 per cent of Queenslanders will be aged 65 and over.\n\nDarren Young wants to see legacy planning to provide more options for the ageing population. (ABC News: Michael Lloyd)\n\nUnlike the major cities, transport options are limited across much of regional Queensland, so Mr Young hopes to see a statewide approach to the growing issue.\n\n\"Every community is different and will need a different solution to address their transport needs, so we should start that now and start planning and preparing for that future,\" he says.\n\nCommunity connection\n\nGraham Brennan helps to serve people decades his junior and says the connection keeps him young. (ABC News: Abbey Halter/Sharon Gordon)\n\nWith a clean bill of health, Mr Brennan has been given the green light for the next 12 months.\n\nA long-time volunteer, he uses his freedom to give back to his community, lending a hand at the local Meals on Wheels for the past 20 years.\n\nIt gives the 92-year-old a sense of purpose three days a week.\n\n\"It's been a wonderful way to help people and serve meals. You meet such wonderful friends and people,\" he says.\n\n\"It's a big family here, I love it.\"\n\nHow old is too old to drive? A new online test might help decide Photo shows an elderly driver behind the wheel Deciding what age is too old to drive is an emotionally charged issue for many families, but it's hoped a new online test will revolutionise the process.\n\nA licence holder for more than 75 years, Mr Brennan has managed decades on the road without a mark against his record.\n\nBut he's realistic about how long it will last and is making the most of it while he can.\n\n\"I just obey the rules of the road and take it easy,\" Mr Brennan says.\n\n\"As long as I can hold out and keep driving for Meals on Wheels and life is good to me health-wise, I'll be right.\"\n\nThis story is part of a five-part series exploring how regional Queenslanders are ageing well outside the capital city.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/darts-world-champion-luke-littler-wins-australian-masters/105633578",
        "title": "Teenage world champ Littler triumphs at Australian Darts Masters",
        "publish_date": "Sat, 09 Aug 2025 21:56:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "Teenage world champion Luke Littler has demonstrated his phenomenal talent by winning the star-studded Australian Darts Masters in Wollongong.\n\nA year after being humbled in the final of the biggest invitation event to be played in Australia, the 18-year-old from England made no mistake this time.\n\nHe won all three of his matches convincingly on Saturday night to lift yet another big title.\n\nLittler also crushed Damon Heta's homecoming dream as he defeated Australia's top player — the world number 10 — in the quarterfinals.\n\nAfter beating Heta 6-3 in the last eight and Stephen Bunting 7-4 in the semis, Littler outplayed Belgian Mike De Decker to win the final 8-4.\n\nIn 2024, Littler had lost in the showdown 8-1 to former world champion Gerwyn Price, so was determined to put on a show for his Australian fans on his second visit.\n\n\"It feels very good. It's another one I can tick off,\" Littler said after winning a World Series event for the first time in six attempts this year.\n\n\"I played very well tonight. I didn't play so well last night in the first round but tonight is when it really matters.\n\n\"It's not gone to plan this year in the World Series but there are plenty of opportunities to win and I've finally picked one up.\"\n\nLittler is chasing a trans-Tasman double when he moves on to the New Zealand Darts Masters.\n\n\"A few days off and then Auckland, I can't wait,\" he said of next weekend's event.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/high-tech-wind-turbine-prototype-trial-in-adelaide/105619294",
        "title": "Wind turbine trial sparks hope as small-scale power source",
        "publish_date": "Sat, 09 Aug 2025 21:53:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "On a major construction project south of Adelaide, testing has been underway on a new renewable wind energy source.\n\nA small Australian-first vertical axis wind turbine has helped power a building site for crews working on the duplication of Main South Road between Aldinga and Sellicks beaches.\n\nThe developers of the turbine — which is just a fraction of the size of the wind turbines that dominate rural landscapes across Australia — could become part of the country's renewable energy mix, providing power to businesses and potentially homes.\n\nFlinders University has been working on the project for several years with company VAWT-X Energy.\n\nDr Amir Zanj says the team has overcome challenges \"but yet a lot remains\". (ABC News: Brant Cumming)\n\nMechanical and aerospace engineer Dr Amir Zanj said the recent three-month trial had been positive, but that a lot more work and financial investment would be required.\n\n\"Without this technology being fully completed, still in the prototype level, we've received several requests from wineries … small manufacturers, small businesses and farmers,\" Dr Zanj said.\n\nThe project has been funded with support from both federal and state governments, as well as a private investor.\n\n\"Without all these elements around the table, making something of this scale would be impossible,\" Dr Zanj said.\n\nThose behind the project hope the turbine could become part of the country's renewable energy mix. (ABC News: Brant Cumming)\n\nThe 6-kilowatt wind turbine was used to power CPB Contractors's construction site, and project manager Andrew Coonan said that there were advantages to having an energy source that can potentially run all day.\n\n\"Obviously the sun doesn't shine 24 hours of the day … so we really see this as integrating into the mix of energy sources,\" Mr Coonan said.\n\n\"Our compounds typically are powered by fossil fuels and having to tap into the [electricity] network, so having the ability to use wind power, solar power, sometimes there's bio-fuel generators that can be used as well.\n\n\"Having a real mix in there, means we can get away from fossil fuels for our projects.\"\n\nAndrew Coonan says the turbine could become part of the mix of energy sources used. (ABC News: Brant Cumming)\n\nAim for commercial version to be ready next year\n\nVAWT-X Energy managing director Gary Andrews said it had taken several years to create the current prototype, but he hoped he would have a product ready for manufacture within 12 months.\n\n\"The aim is to learn from it to see what faults there are and find solutions to fix those and have a commercial version by early next year,\" Mr Andrews said.\n\n\"Solar only operates during the day, so if you want to go off-grid, ideally, you want to be able to have the potential to be able to generate electricity 24/7.\n\n\"So if you have solar and a wind turbine, then you're potentially getting electricity day and night.\"\n\nGary Andrews hopes to start manufacturing the turbines within a year. (ABC News: Brant Cumming)\n\nMr Andrews said he hoped to be able to manufacture locally in South Australia and wants to keep the cost to around $36,000, plus installation.\n\n\"We hope that this will be adopted across Australia and elsewhere in the world as a form of distributed renewable energy,\" Mr Andrews said.\n\nThe project has been given support from federal and South Australian governments, including a $300,000 grant from the Department of State Development.\n\nMinister for Climate, Environment and Water, Susan Close, said the vertical axis wind turbine was an \"exciting development\".\n\n\"This wind turbine is able to capture more energy from low wind, which means is more useful for longer,\" she said.\n\n\"You would expect that the state that is the most switched on in Australia for wind and solar would see the most innovation, and that's exactly what's happening.\"\n\nSusan Close says the turbine is an \"exciting development\". (ABC News: Carl Saville)\n\nSmall-scale turbines could fill the niche\n\nDavid Burton, from Monash University's Department of Mechanical and Aerospace Engineering, said large wind farms that use horizontal axis wind turbines have dominated the global wind energy market.\n\nMr Burton said they had been found to be more commercially viable than vertical axis options like the VAWT-X prototype.\n\n\"As a general rule, horizontal axis turbines are significantly more efficient than vertical axis wind turbines … so primarily that's the challenge,\" he said.\n\n\"There's quite a large number of manufacturers who have delved into that [vertical] technology, previously … it's not a new thing.\n\n\" The advantage of a vertical axis wind turbine is that it doesn't need to face the wind so it tends to perform the same, regardless of the wind direction. \"\n\nBut Mr Burton said smaller scale turbines could potentially be the best way for the vertical technology to find its niche.\n\n\"If I was to look at a place for vertical axis wind then it's in the area that they're targeting, that sort of application seems to be the most logical,\" he said.\n\n\"That seems to be where the technology is most likely to succeed, at least at this stage.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/major-league-baseball-jen-pawol-female-umpire/105633546",
        "title": "Female umpire makes MLB history by working regular-season game",
        "publish_date": "Sat, 09 Aug 2025 21:35:46 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jen Pawol has made history as the first woman to umpire a Major League Baseball (MLB) regular-season game.\n\nPawol was the first-base umpire in the opening game of the double-header between the Braves and Marlins in Atlanta.\n\nThere was much anticipation for her historic debut, with a crowd of photographers gathered while waiting for the umpires to walk onto the field from their entry ramp near the Marlins dugout.\n\nPawol was set to work third base in the second game of the double-header.\n\nThe 48-year-old described being \"overcome with emotion\" when she was informed by the league about MLB debut.\n\n\"It was super emotional to finally be living that phone call that I'd been hoping for and working towards for quite a while, and I just felt super full,\" Pawol said.\n\nJen Pawol was the first-base umpire in the opening game of the double-header between the Braves and Marlins. (Getty Images: Brett Davis)\n\nPawol has been working in the minor leagues since she was assigned to the Gulf Coast League in 2016.\n\nShe worked the Triple-A championship game in 2023, as well as spring training fixtures in 2024 and this year.\n\nPawol, who is from New Jersey, had only a few days to prepare for the double-header.\n\nShe was a three-time all-conference softball selection pick at Hofstra University in New York and worked as an NCAA softball umpire from 2010-16.\n\nPawol is one of 17 current Triple-A call-up umpires eligible to substitute in MLB games.\n\nHer rise to make MLB history came 28 years after the NBA gender barrier for game officials was broken and 10 years after the NFL hired its first full-time female official.\n\nThe men's football World Cup first hired a female referee three years ago. The NHL has not had any women as on-ice officials.\n\nAP/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-10/act-unexpected-cancer-costs-force-patients-to-rely-on-charity/105632142",
        "title": "Unexpected cancer costs left Jenna unable to afford groceries and petrol",
        "publish_date": "Sat, 09 Aug 2025 21:25:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "A breast cancer diagnosis on the cusp of her 40th birthday knocked Jenna Macdonald-Golden's life profoundly off course.\n\nWithin a month, she had a double mastectomy and later began chemotherapy.\n\nJenna Macdonald-Golden receiving chemotherapy. (Supplied: Jenna Macdonald-Golden )\n\nHer relationship broke down, leaving her as a full-time single mother to two children with no family support in Canberra.\n\n\"The second that I found [the cancer], my world changed,\" Ms Macdonald-Golden said.\n\n\"Everyone vanished, it became too hard.\n\n\"Trying to shield [my kids] as much as I could while surviving was a journey.\"\n\nFinancially, the situation was grim, and she was forced to put her mortgage on hold.\n\n\"Even though I had all the private [health] coverage, I ended up going public because I basically was told I had two weeks to come up with $17,000 for surgery,\" she said.\n\n\" No single mum can have that out of their back pocket. \"\n\nJenna Macdonald-Golden says as a single mother she couldn't pull $17,000 out of her back pocket with two weeks notice. (ABC News: Callum Flinn)\n\nThat was only the start of a series of unexpected cancer-related expenses, including medication and physical therapies.\n\n\"It doesn't matter how good your coverage is, it doesn't cover everything,\" she said.\n\n\"And they don't tell you that until afterwards, and you get the bills and they start rolling in.\n\n\"Whilst my chemo has finished, there are still ongoing costs, there are still days where I can't do much.\n\n\"I don't have leave up my sleeve at work so I'll just have to take a day off and not get paid for it.\"\n\nCharity demand booming\n\nJenna Macdonald-Golden received assistance from charity Rise Above when the cost of cancer treatment left her in a difficult financial position. (ABC News: Callum Flinn)\n\nMs Macdonald-Golden turned to local charity Rise Above Capital Region Cancer Relief, which offers financial relief for cancer patients in the Canberra and Queanbeyan region.\n\nThe organisation provided her with fuel and grocery vouchers to help cover daily living costs.\n\n\"Which to some people might not seem like much, but when you're not able to cook and you've got kids at home, you can go buy frozen meals or even ingredients for your friends to make your food, and pay for fuel to get to your appointments,\" she said.\n\nThe charity also helps patients with the cost of medication, supplements, fertility preservation and exercise programs.\n\nRise Above's Belinda Barnier says the group supported 20 per cent more patients in 2024 compared to the previous year. (ABC News: Callum Flinn)\n\nRise Above's Belinda Barnier said the organisation was experiencing a surge in demand, with more than 770 patients on its books.\n\n\"We've grown by more than 20 per cent in the number of patients just in the last 12 months,\" Ms Barnier said.\n\n\"I believe that's reflective of the financial strain that people are under.\n\n\"When you have chemotherapy, or surgery, or radiotherapy, your life is in upheaval and often things as simple as your groceries, your petrol bill and your pharmacy bill, you don't have the cash to pay for those things.\n\n\"Most families are living pay cheque to pay cheque as it is.\"\n\n'I fell through the cracks'\n\nFelicity Tait says being diagnosed with Hodgkin lymphoma put her life on hold completely. (ABC News: Callum Flinn)\n\nFor Felicity Tait, the sign something was terribly wrong came when she embarked on her dream overseas holiday.\n\nThe then-27-year-old started experiencing rapid weight loss, torrential night sweats, rashes and excruciating pain.\n\nAfter a tour of European hospital rooms, she returned home to Canberra where she was eventually diagnosed with Hodgkin lymphoma.\n\n\"My life completely went on hold,\" Ms Tait said.\n\n\"I was no longer able to work … and I had to move back in with my family to get additional assistance because I just couldn't do basic day-to-day tasks.\n\n\"As a side effect of the chemo, I cognitively declined during that period — I couldn't tell you the steps to make a basic cup of tea on certain days.\"\n\nThe costs started to mount.\n\nFelicity Tait on her last day receiving chemotherapy. (Supplied: Felicity Tait)\n\n\"Being 27 and female, I fell through the cracks,\" Ms Tait said.\n\n\"Even though I was a young person, a charity that supports young people actually cuts out at 25.\n\n\"I was female, but I didn't have a female-specific type of cancer, and because of that I couldn't access other support that I saw peers at the cancer centre getting.\"\n\nRise Above stepped in and provided her assistance with medication, groceries and fuel, as well as access to the University of Canberra's Wellness Clinic.\n\nMs Tate has just hit her five-year no evidence of disease milestone, and said she remained grateful for the charity's support in the darkest times.\n\n\"We all know somebody who has had cancer, but I think most people think it's never going to happen to them,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/11-charges-13-400-in-fines-after-nrl-s-wild-night-of-fights-and-high-shots-20250810-p5mlqu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "11 charges, $13,400 in fines after NRL’s wild night of fights and high shots",
        "publish_date": "Sun, 10 Aug 2025 12:26:20 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "The NRL has handed out 11 charges and $13,400 in fines from a wild Saturday of fixtures that included five sin-binnings and set the finals race alight.\n\nEight charges alone came out of the Roosters fiery 64-12 drubbing of the Dolphins, with Spencer Leniu, Naufahu Whyte, Francis Molo and Tawha Aublix all issued contrary conduct charges for the ninth minute melee that saw them all sin-binned.\n\nLeniu has also been served the same contrary conduct charge for rushing in to hit Aublix in the back a minute earlier. The Roosters firebrand’s fine for both incidents was bumped up to $1800 with an early guilty plea, with the rest of the sin-binned trio facing $1000 fines.\n\nDolphins lock Kurt Donoghoe is also facing separate $1800 and $3000 fines for his part in the explosive opening to the contest, which included a high shot on Billy Smith and shoulder charge on Leniu. Donoghoe’s fine for hitting Leniu would become a two-game suspension if he unsuccessfully contested the charge at the judiciary.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/we-all-love-him-milestone-blue-happy-that-club-backed-voss-20250810-p5mlq3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘We all love him’: Milestone Blue happy that club backed Voss",
        "publish_date": "Sun, 10 Aug 2025 11:39:14 +1000",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "George Hewett did not get the desired result in his 200th game on Saturday night, but at least he felt reassured heading into the milestone match about the immediate future of his coach.\n\nThe rugged Carlton midfielder said the club’s public backing of Michael Voss last week was what the “boys needed” to hear as they finished off the season.\n\nBlues midfielder George Hewett was happy with the way the club backed coach Michael Voss. Credit: Getty Images\n\n“I think the club did it really well,” Hewett said after Carlton’s 19-point loss to Gold Coast at Marvel Stadium.\n\n“They just said it, put it to bed, and we all love him, so we were absolutely delighted to hear it as well.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-big-move-lloyd-urges-sydney-to-make-20250810-p5mlqq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The big move Lloyd urges Sydney to make",
        "publish_date": "Sun, 10 Aug 2025 11:34:22 +1000",
        "category": "finance",
        "authors": [],
        "text": "The big move Lloyd urges Sydney to make\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/winners-and-grinners-cross-the-city2surf-finish-line-20250810-p5mloy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Winners and grinners cross the City2Surf finish line",
        "publish_date": "Sun, 10 Aug 2025 11:32:44 +1000",
        "category": "sports",
        "authors": [
            "Nigel Gladstone"
        ],
        "text": "Gloomy weather didn’t deter about 90,000 runners, walkers and costumed joggers who signed up to pound the pavement from Hyde Park to Bondi Beach, for the 55th annual City2Surf on Sunday morning.\n\nThe world’s largest fun run has raised $59 million since 2008, when the fundraising tally was first recorded, and more than $3.5 million was donated to support almost 600 charities this year.\n\nThe first wave of 2025 City2Surf runners heading east on William St in unusually wet conditions. Credit: Oscar Colman\n\nIsaac Heyne, a 25-year-old from Adelaide, won the men’s race for the second year in a row, cutting 17 seconds from his winning time last year, but still 30 seconds shy of the race record time, set in 1991 by Steve Moneghetti. Heyne finished the 14km course in 40 minutes, 33 seconds, almost a minute ahead of the Australian 10km record holder, Samuel Clifford, on his City2Surf debut.\n\nThomas Do Canto was nine seconds behind in third, after being the runner-up in both 2016 and 2017 and placing third last year.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/jess-mauboy-honoured-at-indigenous-music-awards-20250809-p5mln1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jess Mauboy honoured at Indigenous Music Awards",
        "publish_date": "Sun, 10 Aug 2025 11:18:44 +1000",
        "category": "entertainment",
        "authors": [
            "Gemma Grant"
        ],
        "text": "The Darwin Amphitheatre was brimming with talent on Saturday for an awards night showcasing some of Australia’s brightest First Nations artists.\n\nEmily Wurramara won Artist of the Year at the National Indigenous Music Awards. Credit: Leicolhn McKellar\n\nUnder a full moon and with dry season in full swing, the 21st National Indigenous Music Awards (NIMAs) attracted a large crowd. Part of the wider Darwin Festival, the awards night is among dozens of artistic events in Australia’s top end in August.\n\nEarly in the evening, Emily Wurramara said it was special to receive her first NIMA, collecting the award for film clip of the year for her track Lordy Lordy. But the Warnindhilyagwa singer-songwriter soon claimed her second trophy, besting a talented nomination pool that included Jessica Mauboy and King Stingray to be being crowned artist of the year.\n\n“I’ve been doing this since I was 14 years old, and I’ve had a lot of people tell me that I can’t do what I’ve done. And I went and did it,” Wurramara said. “We are out here in spaces, killing it. We’re smashing it in the industry.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/freo-forward-shushes-the-crowd-after-kicking-a-big-goal-20250810-p5mlq6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Freo forward shushes the crowd after kicking a big goal",
        "publish_date": "Sun, 10 Aug 2025 10:13:37 +1000",
        "category": "sports",
        "authors": [],
        "text": "Freo forward shushes the crowd after kicking a big goal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/freo-hail-skipper-s-heroics-in-thrilling-win-over-port-20250810-p5mlq1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Freo hail skipper’s heroics in thrilling win over Port",
        "publish_date": "Sun, 10 Aug 2025 10:03:11 +1000",
        "category": "sports",
        "authors": [
            "Steve Larkin"
        ],
        "text": "Fremantle have staged a dramatic last-term comeback to pip Port Adelaide by six points and climb into the AFL’s coveted top four.\n\nDockers skipper Alex Pearce took a soaring pack mark and goaled with less than a minute remaining, giving his side a precious 13.14 (92) to 13.8 (86) victory.\n\nAlex Pearce of the Dockers celebrates a goal. Credit: Getty Images\n\nFreo were 14 points down early in the last quarter but booted four of the last five goals.\n\nThe Dockers jump from sixth to fourth ahead of games against Brisbane (home) and Western Bulldogs (away) in the run to the finals.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/choose-your-words-carefully-you-may-have-to-eat-them-20250808-p5mld0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Choose your words carefully - you may have to eat them",
        "publish_date": "Sun, 10 Aug 2025 10:00:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Melissa Coburn"
        ],
        "text": "In a gathering of old school friends, one told me I had called her “flighty” in year 8 during a (short-lived) period of disaffection in our friendship. In the scheme of things, “flighty” is no terrible insult but coming from a best friend it must have affected her enough to make a mark for decades.\n\nThe encounter hovered in our memories until it tentatively arose for discussion in adulthood. Credit: Getty Images\n\nI have no memory of having made that pronouncement on my friend but that is not surprising; we tend to remember more what is said to us than what we say. I, in turn, remember a friend being called “nanny goat” by an unpredictable and unreasonable classmate. Again, the insult was tame but its intentional disrespect was alarming. The gloomy reality of having to tolerate this turbulent character for three more school years led my friend and I to conclude that saying nothing was the most practical response. Nevertheless, the encounter hovered in our memories until it tentatively arose for discussion in adulthood.\n\nWords are powerful. Once uttered, they can linger for years, lodged in some part of the heart or mind of a recipient, sending out signals like a grumbling volcano.\n\nIf they are harsh words they may cause a pain that aches with a constant freshness, like a shard of oyster shell in the toe. The hurt delivered can cause a ripple of changes in the afflicted, leading to the establishment of strong lines of defence aimed at protecting the individual against future blows. Charm, distance, humour and avoidance mechanisms might be utilised to protect the individual from being in a vulnerable situation again, even at the price of not living life to the full.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/8-meals-inside-the-hidden-world-of-facebook-marketplace-food-sellers-20250716-p5mf9z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "$8 meals? Inside the hidden world of Facebook Marketplace food sellers",
        "publish_date": "Sun, 10 Aug 2025 09:30:00 +1000",
        "category": "finance",
        "authors": [
            "Kayla Olaya"
        ],
        "text": "In a steamy kitchen in western Sydney, sisters Sanjana and Shivangi Munial prepare to sell the day’s homemade orders on quite the unconventional food-selling platform: Facebook Marketplace.\n\nThere, a rotating menu of north Indian curries starting at $8 is advertised. The sisters, who arrived in Australia less than three years ago from India, work full-time selling food on social media.\n\nSanjana and Shivangi Munial preparing to sell north Indian food on Facebook Marketplace from their South Wentworthville home. Credit: Sitthixay Ditthavong\n\nIn the South Wentworthville kitchen, curries are being ladled into plastic containers, ranging from paneer bhurji (Indian cottage cheese with spices) to dal makhni (lentils) and butter chicken, ready to go out.\n\nWhen asked about the level of hygiene in the kitchen, Shivangi said: “We are always using gloves, [have an] apron on, and a cap as well, because we eat the same food... we can’t compromise our health. That’s why we are not compromising other [people’s] health.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/near-misses-and-lucky-saves-the-view-from-sydney-s-tram-drivers-cabins-20250810-p5mlpb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Near misses and lucky saves: The view from Sydney’s tram drivers’ cabins",
        "publish_date": "Sun, 10 Aug 2025 09:25:49 +1000",
        "category": "finance",
        "authors": [
            "Kathryn Wicks"
        ],
        "text": "They’re the split seconds between a nasty accident and just evading one. CCTV from NSW’s light rail driver cabins shows dozens of near misses as delivery riders, pedestrians and motorists take on 85-tonne carriages cruising along our cities’ streets.\n\nMotorists in the Parramatta district – where the light rail connecting Westmead to Carlingford opened last December – have had more near misses with trams in the past year than those in the Sydney CBD and Newcastle.\n\nFootage released on Sunday by Transport Minister John Graham shows absent-minded or distracted pedestrians stepping in front of trams or trying to rush their crossing; a near-miss with a person on a mobility scooter and a food delivery rider negotiating a footpath full of seating and pedestrians, oblivious to the tram just behind them.\n\nOne pedestrian at Central is saved by another grabbing his backpack and returning him to the footpath.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/libertarian-mp-calls-for-victoria-to-overhaul-self-defence-laws-20250810-p5mlph.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Libertarian MP calls for Victoria to overhaul self-defence laws",
        "publish_date": "Sun, 10 Aug 2025 08:13:24 +1000",
        "category": "finance",
        "authors": [],
        "text": "Libertarian MP calls for Victoria to overhaul self-defence laws\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/wrexham-stunned-by-96th-minute-winner-20250810-p5mlpi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wrexham stunned by 96th-minute winner",
        "publish_date": "Sun, 10 Aug 2025 08:13:22 +1000",
        "category": "sports",
        "authors": [],
        "text": "Wrexham stunned by 96th-minute winner\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/weather/national-weather-forecast-for-sunday-august-10-20250810-p5mlpd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "National weather forecast for Sunday August 10",
        "publish_date": "Sun, 10 Aug 2025 07:44:22 +1000",
        "category": "finance",
        "authors": [],
        "text": "National weather forecast for Sunday August 10\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-an-interest-rate-cut-could-impact-you/yw8yz2gn0",
        "title": "'Lifting the gloom' or 'double-edge sword': How an interest rate shift could impact you",
        "publish_date": "Sun, 10 Aug 2025 01:16:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Reserve Bank of Australia (RBA) is widely expected to cut the cash rate when it meets on 12 August.\n\n\n\n\n\nEconomists are predicting a drop of 0.25 percentage points from 3.85 to 3.6 per cent., following the RBA’s surprise decision in July to hold rates steady despite easing inflation.\n\n\n\n\n\nIf announced, a cut could help lift consumer sentiment amid global uncertainty, but some experts are warning that the benefits are a 'double-edged sword'.\n\n\n\nHow likely is a rate cut?\n\nEconomists say two factors are likely to influence the RBA's decision: easing inflation and growing unemployment.\n\n\n\nRising unemployment levels could be a sign that the RBA will cut interest rates on Tuesday Source: AAP / Joel Carrett The Australian Bureau of Statistic's (ABS) June quarter Consumer Price Index figures showed annual inflation easing from 2.4 to 2.1 per cent.\n\n\n\n\n\nJune labour figures from the ABS also show unemployment has risen to its highest level since November 2021 at 4.2 per cent.\n\n\n\n\n\n\"When you put rising unemployment, overlay that with disinflationary trends, and then you look at the GDP report which painted a really tepid picture of growth for the Australian economy , it really does warrant further interest rate cuts,\" IG market analyst Tony Sycamore said.\n\n\n\n\n\nHowever, Sally Tindall from financial comparison site Canstar says that while a cut is \"highly likely\", it’s important to remember that \"nothing is guaranteed until the RBA actually does make that decision at 2.30pm on Tuesday\".\n\n\n\nWho benefits from an interest rate cut?\n\nTindall said mortgage holders can expect to see the biggest benefits.\n\n\n\n\n\n\"The winners are mortgage customers, particularly those who use the market to their advantage by going and haggling with their bank or refinancing,\" she said.\n\n\n\n\n\nPeople thinking of buying a home may also have more borrowing power. Households that earn $150,000 before tax may be able to access more than $17,000 extra.\n\n\n\n\n\nTindall urged caution because rate cuts can sometimes be a \"double-edged sword\" as it can lead to an increase in house prices.\n\n\n\nWhy could an interest rate cut mean higher house prices?\n\nMore buyers on the market squeezes an already short supply of houses.\n\n\n\n\n\n\"It brings buyers to the market, buyers have deeper pockets and they can spend more on a home,\" Domain’s Nicola Powell says.\n\n\n\n\n\nA report from the Commonwealth Bank of Australia (CBA) found the RBA’s February reduction in the cash rate saw housing prices increase by 3.1 per cent.\n\n\n\n\n\nIt forecasts that RBA rate cuts in August and November would lead to house prices rising by 6 per cent in 2025 and 4 per cent in 2026.\n\n\n\nWhere will housing prices be affected?\n\nCapital cities tend to see bigger shifts, with Sydney and Melbourne more sensitive to interest rates changes.\n\n\n\n\n\nThe CBA also forecasts that an interest rate cut could lead to house price increases of 8 per cent in Brisbane, 7 per cent in Perth and 6 per cent in Adelaide.\n\n\n\nSource: SBS News\n\n\n\nBut Canstar’s Tindall says this is not a reason why the RBA shouldn’t reduce the cash rate.\n\n\n\n\n\n\"What will help cool the situation is increased stock, and I think that still needs further intervention from the government,\" she said.\n\n\n\nWhat about people who don't own a home?\n\nTindall says renters may also be hit with higher costs.\n\n\n\n\n\n\"Rents are rising at four-and-a-half per cent every year, which is a difficult hurdle for many households to clear, and unfortunately it's still going to be tough times ahead for renters.\"\n\n\n\nAn RBA interest rate cut could make renting less affordable Source: AAP / Lukas Coch Sycamore from IG Markets says a common knock-on effect of higher house prices is that landlords may be encouraged to put up rent.\n\n\n\n\n\n\"And that’s not really something we need at this point in time.\"\n\n\n\nSo is an interest rate cut a good or a bad thing?\n\nSycamore says an interest rate cut would be a symbol of growing optimism in the Australian market.\n\n\n\n\n\n\"There is real benefit in terms of just lifting the gloom which has really been lingering over the Australian economy since COVID, because that's when the cost of living crisis really came to the forefront,\" he said.\n\n\n\n\n\nTindall says it is a good time to re-examine your finances to make sure you’re getting the best deal for your circumstances, especially since interest rate cuts are not always passed on by banks.\n\n\n\n\n\n“What ultimately matters is the rate you’re currently on.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-jolly-duong-on-pursuing-the-dream-of-being-a-paralympian/vvqoshg17",
        "title": "INTERVIEW: Jolly Duong on pursuing the dream of being a Paralympian",
        "publish_date": "Sat, 9 Aug 2025 22:00:00 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nThe second-generation Vietnamese-Australian has been adjusting to a new set of challenges, 18 months after a bike accident left him with a spinal cord injury.\n\n\n\n\n\nParasports provided an outlet to make the transition - and now he is among 346 chosen to advance to the next stage of a national talent program to find and support the athletes who will represent Australia at the Brisbane Olympics and Paralympics in 2032.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australias-youngest-federal-politician-charlotte-walker-interview/8l32bum9s",
        "title": "Australia's youngest federal politician: Charlotte Walker Interview",
        "publish_date": "Sat, 9 Aug 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/global-fertility-rates-are-dropping-it-could-spell-disaster-in-the-future/durg3suwi",
        "title": "Global fertility rates are dropping: it could spell disaster in the future",
        "publish_date": "Fri, 8 Aug 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/the-biggest-rodeo-in-the-southern-hemisphere/at6m27csu",
        "title": "The biggest rodeo in the southern hemisphere",
        "publish_date": "Fri, 8 Aug 2025 09:51:28 +0000",
        "category": "sports",
        "authors": [],
        "text": "The biggest rodeo in the southern hemisphere\n\nPublished 8 August 2025, 8:34 am\n\nThe 2025 Mount Isa Mines Rodeo kicked off in Queensland today. The event, which runs over three days, is seen as a terrific way to highlight what the city has to offer. Queensland Correspondent Jesmine Cheong filed this report.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/australia-stands-strong-on-global-plastic-pollution-treaty/wnhn9oqub",
        "title": "Australia stands strong on global plastic pollution treaty",
        "publish_date": "Fri, 8 Aug 2025 09:45:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia stands strong on global plastic pollution treaty\n\nPublished 8 August 2025, 8:34 am\n\nAustralia says it will hold firm on its support for a global treaty to curb plastic pollution, in the face of pressure from the United States to reject the terms of the pact. A UN meeting this week has been aimed at breaking a deadlock in efforts to broker the agreement.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/is-the-rba-about-to-cut-rates-as-consumers-become-more-confident/urwgzkovr",
        "title": "Is the RBA about to cut rates as consumers become more confident?",
        "publish_date": "Fri, 8 Aug 2025 08:32:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/11-charges-13-400-in-fines-after-nrl-s-wild-night-of-fights-and-high-shots-20250810-p5mlqu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "11 charges, $13,400 in fines after NRL’s wild night of fights and high shots",
        "publish_date": "Sun, 10 Aug 2025 12:26:20 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "The NRL has handed out 11 charges and $13,400 in fines from a wild Saturday of fixtures that included five sin-binnings and set the finals race alight.\n\nEight charges alone came out of the Roosters fiery 64-12 drubbing of the Dolphins, with Spencer Leniu, Naufahu Whyte, Francis Molo and Tawha Aublix all issued contrary conduct charges for the ninth minute melee that saw them all sin-binned.\n\nLeniu has also been served the same contrary conduct charge for rushing in to hit Aublix in the back a minute earlier. The Roosters firebrand’s fine for both incidents was bumped up to $1800 with an early guilty plea, with the rest of the sin-binned trio facing $1000 fines.\n\nDolphins lock Kurt Donoghoe is also facing separate $1800 and $3000 fines for his part in the explosive opening to the contest, which included a high shot on Billy Smith and shoulder charge on Leniu. Donoghoe’s fine for hitting Leniu would become a two-game suspension if he unsuccessfully contested the charge at the judiciary.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/we-all-love-him-milestone-blue-happy-that-club-backed-voss-20250810-p5mlq3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘We all love him’: Milestone Blue happy that club backed Voss",
        "publish_date": "Sun, 10 Aug 2025 11:39:14 +1000",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "George Hewett did not get the desired result in his 200th game on Saturday night, but at least he felt reassured heading into the milestone match about the immediate future of his coach.\n\nThe rugged Carlton midfielder said the club’s public backing of Michael Voss last week was what the “boys needed” to hear as they finished off the season.\n\nBlues midfielder George Hewett was happy with the way the club backed coach Michael Voss. Credit: Getty Images\n\n“I think the club did it really well,” Hewett said after Carlton’s 19-point loss to Gold Coast at Marvel Stadium.\n\n“They just said it, put it to bed, and we all love him, so we were absolutely delighted to hear it as well.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-big-move-lloyd-urges-sydney-to-make-20250810-p5mlqq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The big move Lloyd urges Sydney to make",
        "publish_date": "Sun, 10 Aug 2025 11:34:22 +1000",
        "category": "finance",
        "authors": [],
        "text": "The big move Lloyd urges Sydney to make\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/winners-and-grinners-cross-the-city2surf-finish-line-20250810-p5mloy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Winners and grinners cross the City2Surf finish line",
        "publish_date": "Sun, 10 Aug 2025 11:32:44 +1000",
        "category": "sports",
        "authors": [
            "Nigel Gladstone"
        ],
        "text": "Gloomy weather didn’t deter about 90,000 runners, walkers and costumed joggers who signed up to pound the pavement from Hyde Park to Bondi Beach, for the 55th annual City2Surf on Sunday morning.\n\nThe world’s largest fun run has raised $59 million since 2008, when the fundraising tally was first recorded, and more than $3.5 million was donated to support almost 600 charities this year.\n\nThe first wave of 2025 City2Surf runners heading east on William St in unusually wet conditions. Credit: Oscar Colman\n\nIsaac Heyne, a 25-year-old from Adelaide, won the men’s race for the second year in a row, cutting 17 seconds from his winning time last year, but still 30 seconds shy of the race record time, set in 1991 by Steve Moneghetti. Heyne finished the 14km course in 40 minutes, 33 seconds, almost a minute ahead of the Australian 10km record holder, Samuel Clifford, on his City2Surf debut.\n\nThomas Do Canto was nine seconds behind in third, after being the runner-up in both 2016 and 2017 and placing third last year.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/jess-mauboy-honoured-at-indigenous-music-awards-20250809-p5mln1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Jess Mauboy honoured at Indigenous Music Awards",
        "publish_date": "Sun, 10 Aug 2025 11:18:44 +1000",
        "category": "entertainment",
        "authors": [
            "Gemma Grant"
        ],
        "text": "The Darwin Amphitheatre was brimming with talent on Saturday for an awards night showcasing some of Australia’s brightest First Nations artists.\n\nEmily Wurramara won Artist of the Year at the National Indigenous Music Awards. Credit: Leicolhn McKellar\n\nUnder a full moon and with dry season in full swing, the 21st National Indigenous Music Awards (NIMAs) attracted a large crowd. Part of the wider Darwin Festival, the awards night is among dozens of artistic events in Australia’s top end in August.\n\nEarly in the evening, Emily Wurramara said it was special to receive her first NIMA, collecting the award for film clip of the year for her track Lordy Lordy. But the Warnindhilyagwa singer-songwriter soon claimed her second trophy, besting a talented nomination pool that included Jessica Mauboy and King Stingray to be being crowned artist of the year.\n\n“I’ve been doing this since I was 14 years old, and I’ve had a lot of people tell me that I can’t do what I’ve done. And I went and did it,” Wurramara said. “We are out here in spaces, killing it. We’re smashing it in the industry.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/freo-forward-shushes-the-crowd-after-kicking-a-big-goal-20250810-p5mlq6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Freo forward shushes the crowd after kicking a big goal",
        "publish_date": "Sun, 10 Aug 2025 10:13:37 +1000",
        "category": "sports",
        "authors": [],
        "text": "Freo forward shushes the crowd after kicking a big goal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/freo-hail-skipper-s-heroics-in-thrilling-win-over-port-20250810-p5mlq1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Freo hail skipper’s heroics in thrilling win over Port",
        "publish_date": "Sun, 10 Aug 2025 10:03:11 +1000",
        "category": "sports",
        "authors": [
            "Steve Larkin"
        ],
        "text": "Fremantle have staged a dramatic last-term comeback to pip Port Adelaide by six points and climb into the AFL’s coveted top four.\n\nDockers skipper Alex Pearce took a soaring pack mark and goaled with less than a minute remaining, giving his side a precious 13.14 (92) to 13.8 (86) victory.\n\nAlex Pearce of the Dockers celebrates a goal. Credit: Getty Images\n\nFreo were 14 points down early in the last quarter but booted four of the last five goals.\n\nThe Dockers jump from sixth to fourth ahead of games against Brisbane (home) and Western Bulldogs (away) in the run to the finals.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/choose-your-words-carefully-you-may-have-to-eat-them-20250808-p5mld0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Choose your words carefully - you may have to eat them",
        "publish_date": "Sun, 10 Aug 2025 10:00:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Melissa Coburn"
        ],
        "text": "In a gathering of old school friends, one told me I had called her “flighty” in year 8 during a (short-lived) period of disaffection in our friendship. In the scheme of things, “flighty” is no terrible insult but coming from a best friend it must have affected her enough to make a mark for decades.\n\nThe encounter hovered in our memories until it tentatively arose for discussion in adulthood. Credit: Getty Images\n\nI have no memory of having made that pronouncement on my friend but that is not surprising; we tend to remember more what is said to us than what we say. I, in turn, remember a friend being called “nanny goat” by an unpredictable and unreasonable classmate. Again, the insult was tame but its intentional disrespect was alarming. The gloomy reality of having to tolerate this turbulent character for three more school years led my friend and I to conclude that saying nothing was the most practical response. Nevertheless, the encounter hovered in our memories until it tentatively arose for discussion in adulthood.\n\nWords are powerful. Once uttered, they can linger for years, lodged in some part of the heart or mind of a recipient, sending out signals like a grumbling volcano.\n\nIf they are harsh words they may cause a pain that aches with a constant freshness, like a shard of oyster shell in the toe. The hurt delivered can cause a ripple of changes in the afflicted, leading to the establishment of strong lines of defence aimed at protecting the individual against future blows. Charm, distance, humour and avoidance mechanisms might be utilised to protect the individual from being in a vulnerable situation again, even at the price of not living life to the full.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/8-meals-inside-the-hidden-world-of-facebook-marketplace-food-sellers-20250716-p5mf9z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "$8 meals? Inside the hidden world of Facebook Marketplace food sellers",
        "publish_date": "Sun, 10 Aug 2025 09:30:00 +1000",
        "category": "finance",
        "authors": [
            "Kayla Olaya"
        ],
        "text": "In a steamy kitchen in western Sydney, sisters Sanjana and Shivangi Munial prepare to sell the day’s homemade orders on quite the unconventional food-selling platform: Facebook Marketplace.\n\nThere, a rotating menu of north Indian curries starting at $8 is advertised. The sisters, who arrived in Australia less than three years ago from India, work full-time selling food on social media.\n\nSanjana and Shivangi Munial preparing to sell north Indian food on Facebook Marketplace from their South Wentworthville home. Credit: Sitthixay Ditthavong\n\nIn the South Wentworthville kitchen, curries are being ladled into plastic containers, ranging from paneer bhurji (Indian cottage cheese with spices) to dal makhni (lentils) and butter chicken, ready to go out.\n\nWhen asked about the level of hygiene in the kitchen, Shivangi said: “We are always using gloves, [have an] apron on, and a cap as well, because we eat the same food... we can’t compromise our health. That’s why we are not compromising other [people’s] health.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/near-misses-and-lucky-saves-the-view-from-sydney-s-tram-drivers-cabins-20250810-p5mlpb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Near misses and lucky saves: The view from Sydney’s tram drivers’ cabins",
        "publish_date": "Sun, 10 Aug 2025 09:25:49 +1000",
        "category": "finance",
        "authors": [
            "Kathryn Wicks"
        ],
        "text": "They’re the split seconds between a nasty accident and just evading one. CCTV from NSW’s light rail driver cabins shows dozens of near misses as delivery riders, pedestrians and motorists take on 85-tonne carriages cruising along our cities’ streets.\n\nMotorists in the Parramatta district – where the light rail connecting Westmead to Carlingford opened last December – have had more near misses with trams in the past year than those in the Sydney CBD and Newcastle.\n\nFootage released on Sunday by Transport Minister John Graham shows absent-minded or distracted pedestrians stepping in front of trams or trying to rush their crossing; a near-miss with a person on a mobility scooter and a food delivery rider negotiating a footpath full of seating and pedestrians, oblivious to the tram just behind them.\n\nOne pedestrian at Central is saved by another grabbing his backpack and returning him to the footpath.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/take-the-age-quiz-20230608-p5df2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Take The Age quiz",
        "publish_date": "Sun, 10 Aug 2025 08:42:35 +1000",
        "category": "finance",
        "authors": [],
        "text": "WHERE AM I?\n\nWhere is this historic building located? Credit: Eamon Gallagher\n\nDesigned by Harry Norris, this striking pink building is inspired by Chicago-style commercial gothic architecture. It was the flagship store for George Coles’ retail empire, then turned into a department store in 1986 and is reopening as a beauty emporium. Where is it located? Check next week’s quiz for the answer.\n\nLast week’s WHERE AM I? Standing by Tunnerminnerwait and Maulboyheenner is located near the corner of Victoria and Franklin streets in Melbourne CBD.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/libertarian-mp-calls-for-victoria-to-overhaul-self-defence-laws-20250810-p5mlph.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Libertarian MP calls for Victoria to overhaul self-defence laws",
        "publish_date": "Sun, 10 Aug 2025 08:13:24 +1000",
        "category": "finance",
        "authors": [],
        "text": "Libertarian MP calls for Victoria to overhaul self-defence laws\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/wrexham-stunned-by-96th-minute-winner-20250810-p5mlpi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wrexham stunned by 96th-minute winner",
        "publish_date": "Sun, 10 Aug 2025 08:13:22 +1000",
        "category": "sports",
        "authors": [],
        "text": "Wrexham stunned by 96th-minute winner\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/weather/national-weather-forecast-for-sunday-august-10-20250810-p5mlpd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "National weather forecast for Sunday August 10",
        "publish_date": "Sun, 10 Aug 2025 07:44:22 +1000",
        "category": "finance",
        "authors": [],
        "text": "National weather forecast for Sunday August 10\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/sydney-sets-record-ahead-major-224006176.html",
        "title": "City soaked as thousands hit the streets",
        "publish_date": "2025-08-10T02:03:00Z",
        "category": "sports",
        "authors": [
            "Blair Jackson"
        ],
        "text": "Sydney is forecast to receive up to 10mm of rain on Sunday. Picture: Willy Weather\n\nRunners in Sydney’s City2Surf have faced wet conditions as competitors come across the finish line at Bondi.\n\nThere was plenty of rain on the radar shortly before 8am on Sunday as the first groups of runners began the 14km course.\n\nThere would have been some regretful sighs as people laced up in the early hours; areas of Sydney received about 6mm of rain between 4.30am and 7am.\n\nFemale winner Bronte Oates, 20 of Sydney, came across the line in 45:51, behind male winner Isaac Heyne who clocked 40:33. Heyne, 25 years old from Adelaide, won the men’s division for the second year in a row.\n\nThe weather turned toward the end of the race. Picture: NewsWire / Monique Harmer\n\nVideos posted online show pouring rain, with runners trudging away from the finish line, medals around their necks, drenched from the showers.\n\nADVERTISEMENT\n\nSome competitors found time and co-ordination to post videos as they ran, with further videos showing a sea of sneakers stomping through puddles.\n\nThe Bureau of Meteorology rain gauge in the city at Millers Point recorded 8.2mm of rain from 9am to 11am, while the Canterbury gauge showed 9.4mm in the same period.\n\nWinds gusts are getting up to 30km/h in the late morning.\n\nIsaac Heyne, centre, won the men’s division. Picture: NewsWire / Monique Harmer\n\nBronte Oates, centre, won the women’s division. Picture: NewsWire / Monique Harmer\n\nSydney’s City2Surf is billed as the world’s largest fun run, and has raised $59m since 2008. About $3.5m has been raised for 600 charities this year.\n\nRoads shut because of the event are reopening from 11.30am, and most roads in Bondi and Bondi Junction are expected to be reopen by 4pm.\n\nSunday’s patchy weather comes after forecasts a massive cloud bank - estimated to be roughly the size of Western Australia - would soak millions of Aussies throughout the weekend.\n\nADVERTISEMENT\n\nIt would be only the latest drenching for Sydneysiders, with the city recording its wettest August in almost a decade, according to Weatherzone.\n\nSydney is forecast to receive up to 10mm of rain on Sunday. Picture: Willy Weather\n\nElsewhere in NSW, flood waters are easing in the northwestern slopes of New England. Major flooding at Wee Waa continues to fall, after the Naomi River peaked on Thursday night.\n\nBut the river is causing minor flooding to the west at Bugilbone and is forecast to rise Sunday night into Monday.\n\nThe Namoi River at Goangra was at 5.57m and rising on Saturday, the Bureau of Meteorology says. The river may exceed the moderate flood level (6.7m) on Wednesday and could reach 7.50m on Friday.\n\nElsewhere, there are frost warnings in place Sunday for much of regional Victoria. People in parts of the Northern Country, North Central, North East, Central, West and South Gippsland and East Gippsland should be wary of frost.",
        "source": "Yahoo"
    }
]