[
  {
    "url": "https://www.9news.com.au/national/optus-australia-aic/428db1f0-25d0-4b91-a755-2956ba853e67",
    "title": "Optus sued over major data breach",
    "publish_date": "Fri, 08 Aug 2025 01:49:40 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "M﻿ajor Australian telco Optus could face tens of millions of dollars in fines after the Australian Information Commissioner (AIC) commenced legal action against them in the Federal Court.\n\nThe data breach occurred after a 2022 cyberattack, which involved unauthorised access to the personal information of millions of current, former and prospective customers of Optus, and the subsequent release of some of this information on the dark web.\n\nSome of the information leaked included names, date of birth, phone numbers and passport numbers.\n\nREAD MORE: ﻿ New details we can report about killer mushroom cook after secrecy bid fails\n\nOptus fell victim to a massive cyberattack in 2022. (Today)\n\nThe AIC alleges that from on or around 17 October 2019 to 20 September 2022, Optus seriously interfered with the privacy of approximately 9.5 million Australians by failing to take reasonable steps to protect their personal information from misuse.\n\n\"Organisations hold personal information within legal requirements and based upon trust,\" the AIC Elizabeth Tydd said.\n\n\"The Australian community should have confidence that organisations will act accordingly, and if they don't the OAIC as regulator will act to secure those rights.\"\n\nOptus may now face heavy fines, with the Federal Court able to impose a civil penalty of up to $2.22 million for every breach, with 9.5 million breaches alleged by the AIC.\n\nA spokesperson for Optus told 9News.com.au the company was reviewing and considering the matter and would respond to the claims made by the AIC.\n\n﻿\"Optus apologises again to our customers and the broader community that the 2022 cyber-attack occurred,\" they said.\n\n\"We strive every day to protect our customers' information and have been working hard to minimise any impact the cyber-attack may have had.\n\n\"As the matter is now before the Australian Courts, Optus will not be commenting further at this time.\"",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/finance/rba-hotly-tipped-to-cut-interest-rates-at-august-meeting/7385dced-c9ed-41b2-b2ef-f629db940628",
    "title": "'No excuses': Mortgage holders should expect interest rate relief: survey",
    "publish_date": "Thu, 07 Aug 2025 23:29:27 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "A﻿n avalanche of expert opinion is tipping the Reserve Bank of Australia to slash interest rates at its meeting next week.\n\nThe results of a new Finder survey found 91 per cent of the 34 economists ﻿and experts canvassed believed the central bank will authorise a 25-basis-point cut which would bring the official cash rate down to 3.60 per cent.\n\nIf banks pass this on in full, a homeowner with a $500,000 mortgage will save $2884 per year compared with what they were paying at the start of the year before the RBA started cutting the cash rate.\n\nMortgage holders across Australia are widely anticipating a cut to interest rates when the RBA meets next week. (Angus Gray) (Nine)\n\nA widely-anticipated reduction failed to materialise last month, when the cash rate remained on hold at 3.85 per cent, stunning mortgage owners.﻿\n\nBut the experts say the RBA board has no excuses not to make a cut when it wraps up the two-day meeting next Tuesday.\n\nThey point out there are no more barriers to a reduction, with falling inflation and a softening labour market.\n\nOne of the few dissenting voices was Stella Huangfu, of the University of Sydney, who is expecting a hold.﻿\n\nShe says annual CPI inflation is still within the upper band of the RBA's target range at 2.7 per cent.\n\nAlso, following two rate cuts, central bankers may want to pause and assess the economic situation, she says.﻿\n\nHead of consumer research at Finder Graham Cooke says banks will be under pressure to pass on in full any cash rate cut.\n\n\"If the RBA doesn't cut next week, they are risking an all-out attack on their legitimacy in the eyes of many homeowners,\" he said.\n\nMortgage holders paying more than 5.5 per cent on their home loans after any reduction, were probably forking out too much, says Cooke.\n\nLooking ahead, four in five panellists expect the RBA to hold the cash rate next month.\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/japan-population-shrinking-crisis-deaths-overtake-births/827cb4b6-b733-4ebf-8f8a-811980ee75ea",
    "title": "One of Australia's biggest trading partners lost close to a million people last year",
    "publish_date": "Thu, 07 Aug 2025 21:57:47 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Japan's precipitous population decline shows no sign of slowing, with the nation shrinking by more than 900,000 people last year – the biggest annual drop on record, according to government data.\n\nThe data , released by the Ministry of Internal Affairs and Communications, showed that the number of Japanese nationals fell by 908,574 in 2024, bringing the total population to 120 million.\n\nSince peaking at 126.6 million in 2009, the population has declined for 16 consecutive years, diminished by various factors like a struggling economy and deep-seated gender norms.\n\nJapan's population has been declining for a number of years. (AP)\n\nWith the population of Japanese nationals set to continue plummeting for decades yet, the country will feel the blow to its pension and health care systems, and other social infrastructure that is difficult to maintain with a shrinking workforce.\n\nThe government has been trying to fight the decline for more than a decade, with efforts accelerating in recent years as the full scale of the crisis became clear – doing everything from offering childbirth and housing subsidies to encouraging fathers to take paternity leave.\n\nBut each year, fewer babies are born, and more deaths are recorded – a vicious cycle and a symptom of a population skewing older and older. The proportion of elderly is too high – accounting for nearly 30 per cent of the entire population, according to the new data – while the proportion of younger adults, of child-bearing and working age, is continually shrinking.\n\nLast year was no exception. The number of births recorded, at just 687,689, was the lowest among records going back to 1968 – while the number of deaths, at nearly 1.6 million, was the highest on record.\n\nDespite offering childbirth subsidies, Japan's government is struggling to move a stubborn birth rate. (CNN)\n\nThe working-age population, defined as between 15 to 64, made up only 59 per cent of the population in Japan last year – far lower than the global average of 65%, according to the Organisation for Economic Co-operation and Development (OECD).\n\nThis decline has been decades in the making, thanks to Japan's consistently low fertility rate since the 1970s. Because of this, sociologists and demographers say, there's no quick fix – and it's not reversible.\n\nEven if Japan manages to boost its fertility rate dramatically and immediately – which is a big \"if\" – its population is bound to keep decreasing for at least several more decades until the skewed young-old ratio balances out, and the babies being born now reach childbearing age themselves.\n\nAre immigrants the answer?\n\nExperts have pointed to Japan's high cost of living, stagnant economy and wages, limited space, and demanding work culture as reasons fewer people are opting to date, marry or have children.\n\nFor women, economic costs are not the only turn-off. Japan remains a highly patriarchal society in which married women are often expected to take the caregiver role, despite government efforts to get husbands more involved. Single parents are far less common in Japan than in many Western countries.\n\nMany of these issues are also plaguing other East Asian nations with their own population woes, including China and South Korea.\n\nThe answer to Japan's population problem could be an increase in immigration into the country. (Getty Images/iStockphoto)\n\nOne possible solution, experts have pointed out, would be to plug the gap by welcoming more immigrants – a controversial topic in Japan, a largely conservative country that perceives itself as ethnically homogenous.\n\nForeign residents and Japanese nationals of mixed ethnicity have long complained of xenophobia, racism and discrimination.\n\nBut the government has leaned into this option, launching a new digital nomad visa and crafting a new plan to upskill foreign workers. And there are signs it may be taking effect; the number of foreign residents in Japan increased by more than 10 per cent last year to a record high of 3.6 million people, according to the new data.\n\nAccording to government models, which were most recently revised in 2023, Japan's population will fall by 30 per cent by 2070 – but by then, \"the pace of population decline is expected to slow down slightly, mainly due to the increase in international migration.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/finance/anz-surprise-interest-rate-hike/9f2eab99-565e-4fba-8e3e-c8305581fc2b",
    "title": "Big four bank's shock rate hike ahead of expected RBA cut",
    "publish_date": "Thu, 07 Aug 2025 03:41:23 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "L﻿ess than a week before the Reserve Bank is expected to hand down its third cut of the year, ANZ has hit customers with a surprise interest rate hike.\n\nThe big four bank has increased its variable home loan rate rate from 5.59 to 5.75 per cent, a rise of 0.16 percentage points.\n\nThe hike only applies to new customers though, with existing borrowers unaffected.\n\nANZ has handed down a surprise interest rate hike. (Peter Rae)\n\n\"﻿ANZ's hike to its lowest variable rate is a reminder some banks are still looking to protect margins,\" Canstar data insights director Sally Tindall said.\n\n\"It's an unusual move just days out from a board meeting that could deliver a cut, but it shows how some banks don't follow the tide.\n\n\"Let's just hope it's not contagious.\"\n\nANZ previously had the lowest variable rate from the big four, but has now lost that to Commonwealth Bank and Westpac﻿, which both offer home loans from 5.59 per cent.\n\nThe RBA is widely expected to cut the official cash rate next week. (AP/Mark Baker)\n\nEconomists and traders are almost uniformly expecting a rate cut to be handed down by the RBA on Tuesday, following the surprise hold last month.\n\nThe market is even pricing in a roughly fifty-fifty chance of a supersized 50-basis-point cut which would bring the official cash rate down to 3.35 per cent.\n\n﻿In a sign of how likely most banks see a cut, NAB, in stark contrast to ANZ, announced it was cutting its fixed mortgage rates by a quarter of a per cent.\n\nAccording to Canstar, close to 20 lenders have cut their fixed-rate offerings ahead of next week's RBA meeting.﻿\n\n\"NAB has come out swinging ahead of the RBA meeting, cutting fixed rates by up to 0.25 percentage points and undercutting its big bank rivals on a range of terms,\" Tindall said.\n\n\"Its two‑year rate at 5.19 per cent now sets the pace among the big four.\n\n\"While fixed rates aren't the flavour of the month for most borrowers, cuts like these are a sign the banks are bracing for the RBA to move again – most likely on Tuesday.\"\n\nThe RBA's monetary policy board will begin its next meeting on Monday, with a decision to be announced the day after.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/finance/trump-tariffs/442642d5-d80f-4c56-af0d-070d5d714f3b",
    "title": "Trump's historic new tariffs are now in effect. Here's what you need to know",
    "publish_date": "Thu, 07 Aug 2025 04:27:06 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "US President Donald Trump has enacted a new wave of tariffs on dozens of America's trading partners, marking a substantial escalation in ongoing trade tensions that could constitute the biggest change to the global economy in nearly a century.\n\nThe historic new trade policy follows months of false starts to Trump's so-called \"reciprocal\" tariff rollout and countless bilateral trade negotiations, a handful of which resulted in agreements that fended off even higher tariffs.\n\nTrump and his economic advisers have celebrated the considerably higher tariffs that have already gone into effect, correctly noting that they have raised more than $100 billion in tax revenue without leading to catastrophic inflation or a recession, as some economists had feared.\n\nThe president is moving forward with new, significantly more aggressive tariffs that economists fear could exacerbate budding economic problems, including rising inflation and slowing job growth, that are just now becoming more apparent.\n\nHere's what to know about the tariffs:\n\nBefore today, virtually every country's goods were subject to a minimum 10 per cent tariff. Now rates vary substantially from country to country.\n\nThe highest rates imposed are on goods from Brazil (50 per cent) , Laos (40 per cent), Myanmar (40 per cent), Switzerland (39 per cent), Iraq (35 per cent) and Serbia (35 per cent).\n\nAn additional 21 countries also face levies greater than 15 per cent.\n\nThat includes several countries the US relies heavily on for a variety of goods, such as Vietnam (20 per cent), India (25 per cent), Taiwan (20 per cent) and Thailand (19 per cent).\n\nGoods from India could also be subject to an additional 25 per cent tariff stacked on top of that because of an executive order Trump signed yesterday that seeks to penalise India for purchasing oil from Russia.\n\nThat second tariff is slated to take effect on August 27.\n\nThirty-nine countries' goods, as well as members of the European Union, are subject to 15 per cent tariffs, according to a list the White House published last week.\n\nBesides Canada and Mexico, all other countries the US imports goods from will continue to face a minimum 10 per cent tariff, albeit with a few exemptions.\n\nGoods from Mexico and Canada are exempt from tariffs if they're compliant with the US-Mexico-Canada free-trade agreement.\n\nIf not, goods from Mexico are subject to 25 per cent tariffs, while goods from Canada are subject to 35 per cent tariffs, up from 25 per cent previously.\n\nWhat's the deal with the trade deals?\n\nIn most cases, they're not exactly trade deals , per se, but rather rough sketches of ones that could take months, or even years, to finalise — assuming they don't fall apart.\n\nOver the past five months, Trump announced eight trade agreements.\n\nOf those, only two — with the United Kingdom and China — have been formalised.\n\nThe agreement with China, which significantly lowered tariff rates both countries imposed on one another's goods, expires on August 12. If both countries fail to act, rates could spike again.\n\nMost agreements Trump announced involve trading partners committing to purchasing more American products, like oil, cars, Boeing airplanes, defence equipment and agricultural goods.\n\nThey also involve hundreds of billions of dollars worth of investments in American businesses.\n\nBut it's unclear if the United States and other trading partners involved in agreements are on the same page about many of the proposed terms.\n\nFor instance, Japan's Prime Minister Shigeru Ishiba and a lead Japanese trade negotiator, Ryosei Akazawa, both recently said many key details are still being worked out and are telling a vastly different story from Trump, who earlier this week said the country agreed to buy Ford F-150s.\n\nAre any goods exempt from the new tariffs?\n\nYes, plenty.\n\nOne notable exemption is smartphones, which aren't subject to any of the new rates. Additionally, goods for which Trump imposed separate sectoral tariffs or ordered investigations that could result in higher rates won't be stacked on top of country-specific \"reciprocal\" tariffs.\n\nFor the time being, that means pharmaceuticals, for instance, could be imported from countries duty-free. However, Trump is warning they could soon face significantly higher rates. This would impact Australia .\n\nThe EU sought to pre-empt those tariffs by negotiating a 15% tax on pharma exports to the US as part of the agreement announced with Trump. Other countries involved in trade agreements similarly are getting more favourable rates on certain sectoral tariffs.\n\nThere's also a partial exemption for certain goods manufactured abroad where at least 20 per cent of their value comes from American materials and labour.\n\nWhen are these tariffs effective?\n\nTechnically they're already in effect, but there's a caveat.\n\nThe executive order Trump signed last week essentially states that most goods that were loaded on ships and in transit to the US before 12:01 am on Thursday will face whatever the prior tariff rates were until October 5.\n\nThis isn't the end\n\nIn addition to pharma tariffs, Trump has threatened to impose across-the-board tariffs on semiconductors and lumber. At an Oval Office event on Wednesday, for example, Trump said he would soon place a 100 per cent tariff on chips and semiconductors , although he didn't give a timeline.\n\nAnd while the tariffs Trump just enacted could ultimately be rendered illegal, pending an ongoing court challenge, the president has plenty of levers he can pull to keep pushing his agenda for higher tariffs.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/australia-weather-rain-sydney/491d6ea7-3df6-428d-a3fc-bfac027b486b",
    "title": "Millions brace for second imminent winter deluge",
    "publish_date": "Wed, 06 Aug 2025 22:42:01 +0000",
    "category": "sports",
    "authors": [
      "Aug"
    ],
    "text": "The east coast of Australia is being told to brace for more rain, just a week after massive rainfalls caused flooding in parts of New South Wales .\n\nSydney could see 30mm of rain over the weekend, having an impact on the City2Surf race on Sunday.\n\nThe race, which could see 100,000 people running through the streets of Sydney, may also be met by 10mm of rain according to Weatherzone .\n\nThe east coast of Australia is set to cop another drenching this weekend. (Weatherzone)\n\nThe rain is expected to be less intense than last weekend, when over 100mm of rain fell on parts of the state's Hunter Valley.\n\nOne woman is believed to have died after being swept away in floodwaters near Cessnock.\n\nParts of Queensland are also set to be hit by heavy rainfall, with the area between Hervey Bay and Rockhampton in the firing line for massive falls.\n\nThe weather conditions are being caused by a northwest cloudband, where warm and humid tropical air from the Indian Ocean passes over Australia.\n\nIt is combining with moisture from the Coral Sea, resulting in parts of the east coast being forced to brace for more wet weather.\n\nThe extended cloud coverage over large parts of the country will also cause cooler temperatures away from the coast.\n\nVictoria looks set to be spared from much of the rain, with significant rainfall not expected to reach Melbourne until next Tuesday.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/stacey-mcewan-a-forbidden-alchemy-queensland-teacher-turned-bestselling-author/03321df7-3fc9-4399-8605-f0b5b606a24c",
    "title": "From BookTok to New York Times bestseller: How Aussie teacher defied the odds",
    "publish_date": "Thu, 07 Aug 2025 01:58:05 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Months before thousands of Queensland teachers﻿ walked off the job over pay and safety, primary school teacher Stacey McEwan was given an ultimatum.\n\nShe'd spent the last few years working part-time while pursuing a writing career that had landed her on bestseller lists around the world.\n\n﻿Passionate about education as well as authoring, she worked hard to juggle both careers. That ended in early 2025.﻿\n\nOnce a primary school teacher, now you can find Stacey McEwan's name on bestseller lists around the world. (Stacey McEwan/Facebook)\n\n﻿﻿\"Due to the critical teacher shortage , I was told 'you either need to come back to teaching full time or you need to quit,'\" McEwan told 9news.com.au.\n\n\"So I quit the department altogether, and just went full throttle on authoring.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nFortunately, her latest release A Forbidden Alchemy released to rave reviews in July and even earned a spot on the New York Times bestseller list.\n\nBut McEwan is painfully aware that her success (and income) as an author is not guaranteed, even with one of the most powerful online communities behind her.\n\nAussie teacher to bestselling novellist\n\nBorn and raised on the Gold Coast, McEwan spent 11 years ﻿in the classroom.\n\nShe wrote fantasy novels on the side and tried getting a ﻿few published but was rejected again and again.\n\n\"I didn't really know what I was doing﻿,\" she admitted.\n\nMcEwan spent years writing books and being rejected by publishers before her debut novel was picked up/ (Instagram/@staceymcewanbooks)\n\nThe Australian publishing industry is highly competitive and the odds of a debut author﻿'s unsolicited submission actually being purchased for publication are low.\n\nKnowing that, McEwan focused on teaching until the COVID-19 pandemic hit.\n\nLike millions of Aussies, she downloaded TikTok as a way to pass the time during lockdown and was immediately sucked into BookTok, the app's reading community.\n\nThere she racked up thousands of followers \"almost overnight\".\n\nIt was her husband﻿ who suggested she leverage that budding internet fame to self-publish her first novel, a fantasy book she'd already written.﻿\n\nInstead, ﻿British-based publisher Angry Robot﻿ \"swept in\" and offered to buy it.\n\nThe power of TikTok and timing\n\nMcEwan planned to self-publish her first novel, Ledge, until a publisher \"swept in\" and offered her a book deal. (Stacey McEwan/Facebook)\n\nMcEwan signed her first book deal and published her debut fantasy novel, Ledge , in 2021. Two sequels followed in 2023 and 2024.\n\nThe Aussie mum of two admits she owes a lot of her initial success to TikTok and timing.\n\n﻿\"I'm not too proud to say that if I hadn't have put my idiot face online, that this wouldn't be happening right now,\" she said.﻿\n\nThere's no doubt the Angry Robot book deal was influenced by her BookTok popularity and the fact that she was pushing a romantasy (romance and fantasy) novel right as the genre was exploding.\n\nAustralians spent more than $50 million on romance novels in 2024 and romance book sales have more than doubled in the last five years.\n\nAnd romantasy is its hottest subgenre right now.\n\n\"It was really just a case of perfect timing,\" McEwan said.\n\nHer first three novels became bestsellers, boosting her social profile even more.\n\nBut in the age of online hate mobs and celebrity 'cancellations', being a big deal on social media doesn't always have a happy ending.\n\n﻿ Social media's a double-edged sword﻿\n\nAll it takes is one move – legitimate, or perceived – for an author to get 'cancelled' these days.\n\nIt can make the career feel precarious, especially for breakout authors like McEwan who owe so much of their fame to online popularity.﻿\n\nMcEwan signed her first book deal during the pandemic and is now a bestselling author. (Instagram/@staceymcewanbooks)\n\n﻿\"Being of any kind of public figure on social media feels a lot like putting your head on a chopping block and just hoping that no one swings the blade,\" she said.\n\n\"It's the wild, wild west out there and one certainly does have to be careful.\"\n\nIt's up to most authors to run their own ﻿social media accounts, promoting their books and interacting with fans while also making sure they don't say or do the wrong thing.\n\nBecause being 'cancelled'﻿ can tank book sales and slash an author's income in an instant and most don't have huge advances or established fortunes to fall back on.\n\n\"I got an advance for [my first book], but it was a small amount and it certainly wasn't anything that was going to set me up for the future,\" McEwan said.\n\n\"I really had to rely on how well the book was going to sell.\"\n\nBack then she had her teaching career to fall back on but that's gone now.\n\nNo backup plan﻿\n\nWhile she was still teaching part-time, ﻿McEwan landed a global deal with publishing powerhouse Simon & Schuster for her next duology.\n\nThe advance alone was enough to finance her for a year, so she took ﻿unpaid leave from teaching to write A Forbidden Alchemy.\n\nThe novel follows Nina Harrow and Patrick Colson, childhood friends who find themselves on opposite sides of a war fuelled by class inequality.\n\n\"I like the idea of the lower classes questioning why it is that they must remain so,\" McEwan said.﻿\n\nMcEwan took ﻿unpaid leave from teaching to write A Forbidden Alchemy. (Simon & Schuster)\n\nMonths before it hit shelves, McEwan was told she had to go back to teaching full-time or quit altogether.﻿\n\nShe chose the latter and so far, it's been the right choice.\n\nMcEwan just returned from the ﻿very successful US leg of her A Forbidden Alchemy book tour and you can walk into bookstores all over Australia and find her name staring back at you from the 'bestseller' shelves.﻿\n\n\"I have a lot of people that I went to school with, that I used to work with, past teachers, students, [and] employers going, 'what's happening?'\" McEwan said.\n\n\"'Is this you, or is this just someone with your name?' ... those reactions only fuel me.\"",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/world/zara-adverts-banned-in-uk-for-unhealthily-thin-models/3f974a7e-ac92-414c-96a4-8c33bfceba64",
    "title": "Zara adverts banned over models who looked 'unhealthily thin'",
    "publish_date": "Thu, 07 Aug 2025 00:21:30 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "T﻿he UK advertising watchdog has banned two ads by fashion giant Zara for featuring models who looked \"unhealthily thin\".\n\nThe use of shadows and a slick back bun hairstyle in one ad for a short dress gave the model a \"gaunt\" appearance, said the Advertising Standards Authority (ASA).\n\nThe shadowing also made the model's legs appear \"noticeably thin\".﻿\n\nThe UK advertising watchdog has banned images from two Zara adverts. (Zara) (Supplied)\n\nIn the other advert﻿, a model wearing an oversized pocket shirt﻿ revealed the model's \"protruding\" collarbones, the regulator said.\n\nThe regulator described the adverts, shown on the retailer's website and app, as \"irresponsible\", and instructed Zara they must not appear again. ﻿\n\nZara has pulled the images highlighted by the ASA inquiry. It said it had not received any complaints about them.\n\nThe company also said both models in the images had medical documents proving they were in good health when the photos were taken.\n\nNone of the images had been altered except for \"very minor lighting and colouring edits\", Zara said.﻿\n\nZara says none of the images in the ads had been altered except for minor edits. (Photo by Dominic Lorrimer/Fairfax Media) (Fairfax Media)\n\nThe Spanish﻿ retail giant said it followed guidelines from a government backed inquiry into the health of models.\n\nThe ASA investigated two other Zara adverts but neither were banned.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.9news.com.au/technology/briana-went-to-an-online-meeting-her-team-mate-sent-his-robot/f92ecdf1-df61-4e5e-ba23-374f17bfe862",
    "title": "Briana went to an online meeting. Her team mate sent an AI assistant",
    "publish_date": "Wed, 06 Aug 2025 22:29:08 +0000",
    "category": "finance",
    "authors": [
      "Aug"
    ],
    "text": "Recently, something odd happened to Briana Blackett. She was attending a meeting to give a colleague some content feedback, which isn't unusual in her volunteer work as a disability advocate.\n\nBut what unfolded after she logged onto Zoom made the journalist question professional etiquette and how artificial intelligence could change the future of work.\n\n\"You could see my face on screen, you could see the project manager's face on screen. But in place of the producer, we had an AI note taker. We started the meeting talking to the robot, saying, 'Here are some messages we'd like you to send back to your human' and 'human, if you're listening, please jump on now because these are things we need to have a nuanced discussion about',\" said Blackett, Future Women's Head of Content.\n\nBrianna Blackett's experience has left her questioning how AI tools should be used in the office. (Supplied)\n\nAfter about ten minutes instructing the notetaker like a junior staff member reporting back to its boss, they texted the producer to ask if he was coming. He appeared within seconds and they got on with the meeting - but the interaction left Blackett confused.\n\n\"I thought, 'Oh wow, is this the done thing now?' And if so, this is not good. You need to communicate in advance. It prompted me to think, in what scenario is it okay to send a robot? What's the process you should be undertaking in order to clear that with everyone? What's the AI etiquette here?\n\n\"Perhaps we need to start setting up some kind of etiquette process in how we decide when it's okay to send a robot.\"\n\nUniversity of Technology Sydney (UTS) Business School Associate Professor Robyn Johns can already see artificial intelligence changing the unwritten rules for workplaces.\n\nHowever, she believes we need to be mindful about how and when we're adopting new processes.\n\n\"Just because the tools are available doesn't mean you should automatically use them. We need to start considering whether it's appropriate in all circumstances,\" said Associate Professor Johns.\n\n\"Things like digital notetakers or recording meetings, you should be giving people a heads up. They certainly change expectations about how we engage in those meetings.\"\n\nIn July, a global survey of more than 3000 cyber security professionals found that while 81 percent believe employees in their organisation use AI, only 28 percent have a formal, comprehensive policy in place.\n\nIt is this lack of policy - which could speak to a lack of forethought - that worries Associate Professor Johns.\n\n\"AI can either reinforce or potentially erode trust within an organisation. [It's] about the transparency associated with how we utilise or implement these types of tools. Having consultations and discussions around how it's going to be used. Seek clarity around [how your staff feel] because it might be that some people perceive it as a control mechanism rather than a productivity enhancer.\"\n\nFor Blackett, a 'proud Gen Xer' who can clearly recall how email transformed professional etiquette decades ago, human communication is key to ensuring we reap the benefits of AI while not leaving others out in the cold.\n\n\"This is the latest technological advance, but there is also going to need to be some social construction around it.\n\n\"Perhaps we need to start setting up some kind of etiquette process in how we decide when it's okay to send a robot. Sending it to a client requiring a complex and nuanced discussion... probably isn't ideal.\"",
    "source": "9News",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-08/victoria-mboko-beats-naomi-osaka-montreal-canadian-open/105628234",
    "title": "18yo Canadian keeps idol Osaka from first WTA trophy in over four years",
    "publish_date": "Fri, 08 Aug 2025 02:18:34 +0000",
    "category": "sports",
    "authors": [],
    "text": "Canadian teenager Victoria Mboko has staged a stunning comeback to defeat four-time grand slam champion Naomi Osaka to claim her maiden WTA title at the Canadian Open.\n\nThe 18-year-old came back after losing the opening set to the Japanese former world number one, who had established a 3-0 lead as Mboko struggled with costly service errors.\n\nBut the home favourite found her rhythm in the second set, breaking serve to establish a 5-2 lead. Osaka struggled to catch up, and her poor returns allowed Mboko to level the match and force a decider.\n\nThe decisive moment came in the third set, when Mboko took a 3-1 lead after saving four break points in a pivotal fourth game that gave her a firm grip on the match as she went on to claim the title with a 2-6, 6-4, 6-1 win after 2 hours and 4 minutes of play.\n\n\"I want to thank Naomi for an incredible match. I've always looked up to her when I was really little. It's always great to play with such an amazing player like you,\" Mboko said.\n\nMboko said she \"couldn't be more grateful\" to the raucous Canadian fans who got behind her, with the impact even being felt in the men's final in Toronto, where play between Ben Shelton and Karen Khachanov was stopped as news of her win filtered through the increasingly jubilant crowd.\n\n\"What's going on?\" Shelton was seen saying, before approaching umpire Fergus Murphy, who told him the news.\n\nMboko was ranked 85th in the world before the final but will now jump all the way to a career-high 25, one spot behind Osaka in 24th.\n\nRemarkably, Osaka was the fourth major champion Mboko beat in Montreal, with victories over 2020 Australian Open winner Sofia Kenin, 2025 French and 2023 US Open winner Coco Gauff, and 2022 Wimbledon champ Elena Rybakina.\n\nFor Osaka, who was attempting to revive her career after an inconsistent period following her return from maternity leave last year, the defeat brought her groundbreaking tournament to an end.\n\nThis loss also extended Osaka's title drought at the top level.\n\nAlthough she won a WTA 125 clay-court tournament in May, the WTA Tour only includes 250 tournaments and above, meaning her last triumph came at the 2021 Australian Open.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-08/national-lamb-record-reaches-new-heights-and-may-keep-going/105628420",
    "title": "National lamb price reaches new record, but could go higher",
    "publish_date": "Fri, 08 Aug 2025 02:16:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "\"Spirited bidding\" has pushed the national lamb price to a new record at a regional New South Wales saleyard today.\n\nA pen of 55 second-cross lambs sold to $479.50/head at Griffith, but agents say this still may not be the top of the market.\n\nThe lamb price has been slowly climbing, with records nearly a weekly occurrence at saleyards across the country since late May.\n\n\"You don't sell the lambs to get the records, but they did deserve it. They were amazing lambs,\" agent Wayne Spencer said.\n\n\"They weighed an average of 92 kilos liveweight, so that's an estimated dress weight of somewhere around 43 kilos.\"\n\nThey were purchased for export by processor Thomas Foods International.\n\nDroughts in parts of southern NSW, Victoria and South Australia have been impacting supply and weight of the lambs in a time of high demand.\n\n\" The lamb job just keeps getting better and better, just as those numbers drop away .… but these lambs coming in today, they're massive big lambs. \"\n\nMr Spencer said the lambs, bred by Mark Tabain, drew keen interest from the opening bid.\n\n\"It was very spirited bidding,\" he said.\n\n\"Mark was over the moon, he's a fella who doesn't like the limelight much but he does an amazing job with his lambs year in, year out.\"\n\nThe industry is now asking where the top of the market could be, as consumers brace for possible price rises for the final product.\n\nAgents from Dubbo held the national record for a few days, after topping at $477.20/head earlier this week.\n\nMr Spencer said he would not be surprised if next week brought another record price.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-08/residential-care-death-whisletblowers-budget-estimates/105627474",
    "title": "Whistleblowers allege kids told to stay quiet about residential care suicide",
    "publish_date": "Fri, 08 Aug 2025 02:04:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "WARNING: This story contains content that readers may find distressing.\n\nWhistleblowers have alleged that children were urged \"not to say anything\" about a boy's suicide in a residential care home, a Queensland opposition MP has told budget estimates.\n\nOn Thursday, the ABC revealed that a 15-year-old Aboriginal boy, who was under a child protection order, died by suicide the weekend prior in the Ipswich home, south-west of Brisbane.\n\nChildren living in the facility found the boy's body in the \"very distressing\" incident, sources told the ABC.\n\nAboriginal boy dies by suicide in residential care home Photo shows Side view of unidentified youth. The death has prompted calls from advocates for Queensland's child protection inquiry to investigate.\n\nShadow Child Safety Minister Corrine McMillan told estimates that she understood children who witnessed the tragic event were told not to speak about what occurred.\n\nShe asked Child Safety Minister Amanda Camm whether this was acceptable.\n\nMs Camm said the Child Protection Act prevented her or the child safety department from commenting on any specific cases relating to a child in care.\n\n\"More broadly, what I can speak to is the death of a child is a tragedy in any circumstances,\" she said.\n\n\"And that if a child is known to child safety in the 12 months prior to their death, a child death review process is undertaken by a specialist internal team in my department.\n\n\"This review is then considered by the independent child death review board.\"\n\nEarlier, Ms Camm told estimates that 22 per cent of Queensland children in residential care had attempted suicide, and 44 per cent had self-harmed \"now or in the past\".\n\nA 'lack of accountability and action'\n\nAustralia's National Children's Commissioner Anne Hollonds told the ABC the boy's death was a \"horrific tragedy\".\n\n\"Condolences to the boy's family,\" she said.\n\n\"[This incident] is a further demonstration of the lack of accountability for child safety and wellbeing in this country.\"\n\nMs Hollonds said any children coming into out-of-home care would have \"multiple levels of trauma\".\n\nMs Hollonds says there is a lack of accountability and action. (ABC News: Billy Cooper)\n\nShe said these cases should be prioritised, and \"knowing what to do\" was not the problem.\n\n\"Because of these decades of evidence-based recommendations from commissions and inquiries, we know what to do … the problem is the lack of accountability and action,\" she said.\n\n\"I still hear stories about kids in out-of-home care not getting the mental health care they need.\"\n\nLoading...\n\nGenevieve Sinclair, the CEO of Youth Empowered Towards Independence (YETI), said the system \"requires immediate repair\".\n\n'This is such a deeply sad thing to happen for a family,\" she told the ABC.\n\n\"Children in residential care are experiencing some of the worst health outcomes of any children in the state.\"\n\nYETI chief executive Genevieve Sinclair says urgent work needs to be done to fix the system. (ABC Far North: Brendan Mounter)\n\nMs Sinclair said she was \"hopeful\" that the commission of inquiry into Queensland's child safety system could consider tragedies like this as part of their work.\n\n\"When a young person dies like this, we all need to reflect deeply on what possibly we could have done better and work our hardest to ensure it doesn't happen again,\" she said.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-08/dolphins-roosters-isaiya-katoa-james-tedesco/105627438",
    "title": "Champions of past and future collide in Lang Park Dally M showdown",
    "publish_date": "Fri, 08 Aug 2025 00:43:11 +0000",
    "category": "sports",
    "authors": [],
    "text": "With six points on offer in every game and anonymous judges, the Dally M race has become murkier and harder to predict than ever before.\n\nBut with five rounds remaining, the Dolphins-Roosters match at Lang Park on Saturday should double as the opening salvo of the final run for this year's version of rugby league's ultimate individual prize.\n\nRelying on the votes to reliably make sense is an easy way to get your heart broken, and given the judges are now anonymous, it's a game of shadows even before it goes behind closed doors.\n\nBut anything less than a race to the finish between Phins halfback Isaiya Katoa and Tricolours fullback James Tedesco simply won't match up with the reality that has unfolded before us in 2025.\n\nCanberra's top contender is Joseph Tapine, but a prop has to practically walk on water to win an award like this, while Canterbury has experienced a season which has been a triumph of the many rather than one built on the excellence of the few.\n\nDespite its dynasty, Penrith is yet to win the big Dally M prize and its slow first half of the year just about ensures that streak will continue.\n\nNew Zealand's Luke Metcalf led at the halfway point of the season but has since succumbed to a knee injury.\n\nMetcalf led the Dally M voting at the halfway point of the season but has since suffered a season-ending knee injury. (AAP: Dave Hunt)\n\nCronulla's Will Kennedy was second, but that form has been harder for him to come by in the months since, and while teammate Blayke Brailey has shined recently, his run has surely come too late.\n\nTerrell May was four points off Metcalf's lead, but the Tigers lengthy losing run will count against him, and outside the top eight there are no other contenders.\n\nPayne Haas rounded out the top five, but Origin representation and a few missed games here and there are enough to cross him out, and Brisbane's losing streak in the middle of the year won't help matters either.\n\nMelbourne's Cameron Munster is an outside chance, but the presence of Jahrome Hughes, Ryan Papenhuyzen and Harry Grant through much of the season can always drag points away.\n\nThat leaves Katoa and Tedesco, two men at opposite ends of time — a young prince and an old master, the first son of tomorrow and one of the last heroes of a past age.\n\nAt 21, Katoa would be the youngest Dally M winner in 40 years. At 32, Tedesco would join Cameron Smith, Cooper Cronk and Johnathan Thurston in winning the medal again at an age when most players are slowing down.\n\nThey're coming at the prize from different directions and in different ways. Katoa was equal fifth when voting went dark, fresh off a six-point haul in the Dolphins 44-6 win over Canterbury in Round 12.\n\nKatoa has been at the centre of an almigthy Dolphins attacking revival. (AAP: NRL Photos)\n\nMetcalf's lead wouldn't have lasted much longer because the competition's youngest club started rewriting its own history by the week, with Katoa at the heart of it.\n\nThey set a record for their biggest ever win in Round 13, then broke it in their very next game.\n\nIn a month, the Dolphins broke 50 points more times than the Gold Coast Titans have in their entire existence, and while the points have slowed a little, the beautiful football has not.\n\nInjuries have torn apart their forward pack and are now spreading into their backline, but they are not shambling to the finish line as the parts fall away, they are speeding up to a point where their first-ever finals berth feels possible, and so much of that possibility has flowed from Katoa.\n\nHis play is not singular, and it's a measure of how well-drilled and adaptable the Dolphins have become that they've sustained their level of play despite the many players they've lost along the way.\n\nKatoa is a creator and he is surrounded by finishers like Hamiso Tabuai-Fidow and Herbie Farnworth, or players with a bit of both in them like halves partner Kodi Nikorima and Swiss army knife Jake Averillo.\n\nThe Phins middle has been ripped apart by injury, but their back row depth has proven to be outstanding with Kurt Donoghoe, Oryn Keeley and Connelly Lemuelu thriving both on the ball and off it.\n\nThere's a lot of heroes at Redcliffe but the Dally M is an award for playmakers — aside from Jason Taumalolo and Cameron Smith, every winner for the past 20 years has been a half or a fullback.\n\nKatoa is the ringmaster of the Phins attacking circus, drawing the eye and directing it where he will, and that means the votes will flow like a river.\n\nHe is second in the league for try assists, first in line break involvements, and first, by a huge margin, for line engagements.\n\nHis trademarks — like when he looks inside to play out or when he controls the tempo of his running as he goes to line, mixing fast and slow and always equalling out to smooth — speak to his enormous sophistication as a footballer, especially for someone so young.\n\nListen to how other players, former and current, talk about him. The tired old buzzwords — brilliant, unbelievable, freakish, a natural, a 10-year Origin player — don't do the job because Katoa demands greater detail. You have to pop the hood.\n\n\"I think of the boys working in and around him, and the rewards they're getting off his style of play,\" Shaun Johnson said on Fox League after one Dolphins win.\n\n\"He's direct, he's running the footy and he's playing at various speeds. Every element we see in the footage looks different; there's not one repetitive movement.\n\n\"He's got such a variety in his tool kit, but none of it is low percentage. For a 21-year-old, 50 games experience, that's what's got me scratching my head.\n\n\"The way he's balancing his game and executing — he's not overplaying. This was an 80-minute masterclass, and he was at the centre of it.\"\n\nThe six types of Dally M winners Photo shows A man poses in front of a statue of the Dally M medal This week is the final round for NRL players to accumulate Dally M votes. Here are the six types of stars who can win the award.\n\nThe battle between his kicking game and Tedesco's positional play is where they'll cross paths the most on Saturday, and Tedesco knows what's coming because he's an unabashed fan of Katoa.\n\n\"I love watching him. Some of his ball-playing, we talk about it at training, it's unbelievable,\" Tedesco said on the Freddy and the Eighth podcast earlier this year.\n\n\"We'll come in on a Monday and say, 'See that Katoa, see that try he set up?'\n\n\"It's so impressive for a young kid. Playing against him, if you slide off, he'll show and go, or play short, (but if you come up) he goes out the back.\n\n\"I was talking to Cooper (Cronk) about him and he was so impressed. He's a real student of the game who loves watching and learning.\"\n\nTedesco was just three points off the lead when voting was silenced and his football since has been a continuation of a great regeneration, a return to his best in defiance of what has come before.\n\nWhat's happening in 2025 is far from a last gasp. It's a continuation of what happened last year, when Tedesco lost out on the Dally M to Hughes by a solitary point.\n\nTedesco has continued the footballing revival which began last year. (Getty Images: Cameron Spencer)\n\nThe Melbourne man taking the medal was the right call, but Tedesco's return to true excellence after a slower 2023 season was something to behold.\n\nHe finished on a career high for tries, and set a new career high for linebreaks and try assists. He led the league in tackle busts for the fifth time in seven seasons, and was just 128 yards shy of setting a new career best mark for run metres.\n\nTedesco's raw attacking numbers are down for 2025 because the Roosters had to retool, and there are less tries and assists to go around.\n\nThe 2024 edition of Trent Robinson's side scored the sixth most tries of any team in premiership history, a level of attack that was not sustainable with the departure of Luke Keary, Joseph Manu, Joseph-Aukuso Suaalii and the long-term injury to Sam Walker.\n\nTedesco has adjusted his approach in accordance with what his team needs. (Getty Images: Hannah Peters)\n\nThey had to find a way to retool and they have, and Tedesco has done it with them. He is running the ball more often later in the tackle count, acting more as a yardage weapon who provides attacking shape than out-and-out playmaker.\n\nIt gives the Roosters' youngsters a strong platform to build from. The style is tougher and better suited to younger legs, but Tedesco is thriving in it.\n\nAt the time of writing, he leads all fullbacks in tackle busts, total runs and run metres, and continues to find the attacking touch when called upon.\n\nAfter losing his Australia and New South Wales jerseys, Tedesco was meant to be over the hill, but he's steadily dragged himself back the way he came, past the generation of fullbacks who came after and were supposed to replace him, until he's back at the top again.\n\nIt's a tremendous feat of evolution and adaption at an age where change can be the hardest thing of all, and another Dally M would be the capstone on the second part of his career.\n\nLike Smith or Thurston or Cronk proved before him, once a player hits the top, there's nowhere else to go, and we can grow accustomed to even the greatest wonders. Sometimes, we all need a reminder of what a truly great career looks like.\n\nFor Katoa, the stakes are simpler. A Dally M win would be physical proof of what all know to already be true — that the future has arrived and his time has come.\n\nThere's no way of knowing which is in the lead, but both men still have time to secure the medal, or have it slip from their grasp, which brings us back to Lang Park on Saturday night.\n\nA Dolphins win will leave the Roosters two wins out of the eight with four games remaining, which is getting perilously close to the state of mind where the phrase \"mathematically possible\" is invoked as proof your finals dreams are still alive.\n\nBrisbane's loss on Thursday night also opens the door for the Phins to finish as high as sixth, which would mean a home final, and that could prove an invaluable gift given Lang Park is where the light shines out of them.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nA Roosters win would throw the race for eighth spot wide open. The Tricolours have a tough run home, and consistency has not always been their strong suit as a unit this year, but their unpredictability and attacking class make them dangerous against anyone.\n\nThis game is bigger than Katoa and Tedesco because it's a hinge on which two seasons can swing. Both men would likely be happy to trade the medal for a finals berth, but given no team from a non-finals side has won the Dally M since 2014, whoever gets it done at the Cauldron likely won't have to choose.\n\nTedesco does not need a second Dally M to affirm his greatness, and Katoa doesn't need a first to confirm he's on the way to it.\n\nThis season should be remembered as a banner one for both of them, but hardware can last in a way memory doesn't. A Katoa win, in this match and otherwise, would be a warning of what's to come, while a Tedesco victory would be a reminder of what has already been.\n\nThat makes Saturday evening a point in history where two legacies collide, one just beginning with a future that stretches into the promised land, and the other with a long tail that has no end in sight.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-08/cattle-pioneer-kathy-lovelock-heart-surgery-cow-tissue-valves/105619224",
    "title": "Cattle pioneer saved by cow tissue heart valves in twist of fate",
    "publish_date": "Thu, 07 Aug 2025 23:29:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "West Australian cattle pioneer Kathy Lovelock is known by the affectionate nickname \"the Brahman lady\".\n\nBut the moniker took on a deeper significance a decade ago, when she had parts of her heart replaced with valves made from cattle tissue, in an effort to treat the effects of Q fever.\n\nMs Lovelock, 80, has devoted most of her life to the cattle industry and has been instrumental in developing the Brahman breed across WA's Kimberley and Pilbara regions.\n\nTogether with her husband, David Lovelock, she founded Canterbury Brahman Stud in 1972 at New Norcia, a town about 130 kilometres north of Perth.\n\nIn 2015, they both underwent open-heart surgery to address complications from Q fever infections they had contracted many years before.\n\nThe disease had caused blockages in their heart valves and, in a twist of fate, cow tissue played an essential role in their treatment.\n\nKathy Lovelock is urging members of the industry to get tested for Q fever. (ABC News: Tahlia Davis)\n\nFull circle moment\n\nReplacement aortic valves are usually sourced from pig heart tissue, but Ms Lovelock is allergic to pigs, so she and her surgeon were left with no choice but to find an alternative.\n\nMs Lovelock said she believed it was tissue from Brahman cattle that saved her life.\n\n\"[The surgeon] actually went to California to source a bovine aortic valve, and informed us the tissue for that valve came from cattle in Brisbane,\" she said.\n\n\"The way we look at it is Queensland is dominated by Brahman cattle, so if they came from Brisbane or Queensland, it had to be Brahman tissue.\n\n\"There's a fair chance, in our opinion.\"\n\nKathy and David Lovelock contracted Q fever in 1995 while visiting sheep and goat sheds in Malaysia. (ABC News: Tahlia Davis)\n\nMs Lovelock insisted it was pure coincidence that the cattle she had dedicated her life to breeding ultimately saved it.\n\nAlthough not allergic to pigs, Mr Lovelock also received replacement aortic valves made using bovine tissue from Queensland cattle.\n\nThey understood that aortic valves sourced from cattle heart tissue would last longer than the pig equivalent.\n\nQ fever undiagnosed for years\n\nMs Lovelock said she and her husband contracted Q fever in 1995 while visiting sheep and goat sheds in Sabah, a state of East Malaysia on the island of Borneo.\n\n\"I went down with a bang within days of being exposed,\" she said.\n\n\"They thought I had dengue fever because there was no diagnosis for Q fever at the time.\"\n\nHer symptoms included lethargy, a fever and headaches; she said it was like a serious case of the flu.\n\nThe cause was not identified as Q fever until 2007.\n\nKathy Lovelock has been instrumental in developing the Brahman breed across WA's north. (ABC News: Tahlia Davis)\n\nNearly 20 years after contracting the disease and 10 years after undergoing open-heart surgery, Ms Lovelock is again facing challenges.\n\nShe said her immune system was compromised and her heart valves were \"playing up\".\n\nHaving another operation to replace her heart valves is not an option, so she is instead focused on managing her symptoms.\n\nMr Lovelock, on the other hand, is doing \"fine\" — a contrast Ms Lovelock attributes to taking antibiotics she was allergic to.\n\nWord of warning\n\nQ fever spreads when people inhale air or dust contaminated with Coxiella burnetii bacteria from the faeces or birth products of infected animals, and is usually associated with the livestock industry.\n\nMs Lovelock is now urging others in the industry to get tested for Q fever and to get vaccinated if they have not been infected.\n\nIn July, Ms Lovelock was inducted into the Royal Agricultural Society of WA Hall of Fame for her dedication to and impact on the West Australian cattle industry.\n\nShe said it came as a total surprise.\n\n\"It's great to have that recognition,\" Ms Lovelock said.\n\nKathy Lovelock is inducted into the Royal Agricultural Society of WA Hall of Fame. (Supplied: Royal Agricultural Society of WA)\n\nLooking back over the past 50 years, Ms Lovelock said she was most proud to have the support of her husband and the industry as she worked to progress the Brahman breed.\n\nThe farming matriarch has been actively involved in the Australian Brahman Breeders Association at both state and national levels, as well as the Cattle Council of Australia, and has made it a priority to inspire young people's interest in the beef industry.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-08/uk-homelessness-minister-rushanara-ali-resigns/105627408",
    "title": "UK homelessness minister quits after being accused of evicting tenants",
    "publish_date": "Thu, 07 Aug 2025 23:03:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "Britain's minister for homelessness has been forced to resign over reports she evicted tenants from a property she owned and then increased the rent by hundreds of pounds.\n\nRushanara Ali said she had followed all the legal requirements \"at all times\" but that continuing in her role would have distracted from the work of the government.\n\nHer exit represents an embarrassing blow for Sir Keir Starmer's Labour government, which trails Nigel Farage's right-wing Reform UK party in opinion polls just over a year after winning a landslide election victory.\n\nMs Ali is the fourth Labour minister to step down under pressure.\n\nThe transport minister, the anti-corruption minister and a junior health minister all previously quit, for separate reasons. Others have left the government over policy disagreements.\n\nWhat is Rushanara Ali alleged to have done?\n\nMs Ali, who has spoken out previously against tenants being exploited and \"unreasonable rent increases\", evicted four tenants from her four-bedroom house in east London last year as the property was being sold, The i Paper reported on Wednesday.\n\nJust weeks later, the property, which had a monthly rent of 3,300 pounds ($6,800), was re-listed for 700 pounds ($1,440) more in rent after no buyer was found, and later rented out at the higher rent, the report added.\n\nThe end of rental contracts is considered one of the leading causes of homelessness in Britain, and the government is preparing a renters' rights bill that will ban landlords from re-listing a property for higher rent within six months after eviction.\n\n\"I wanted to make it clear that at all times I have followed all relevant legal requirements,\" Ms Ali said in her letter to Sir Keir.\n\n\"I believe I took my responsibilities and duties seriously, and the facts demonstrate this.\"\n\nThe opposition Conservatives were quick to pounce on her departure.\n\n\"Keir Starmer promised a government of integrity — but has instead presided over a government of hypocrisy and self-service,\" Tory chairman Kevin Hollinrake said.\n\nReuters/ABC",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-08/asx-markets-business-live-news-fri-8-august/105627288",
    "title": "Live: Optus sued over alleged failures in years before 2022 cyber attack",
    "publish_date": "Thu, 07 Aug 2025 22:08:40 +0000",
    "category": "finance",
    "authors": [
      "Stephanie Chalmers",
      "Nadia Daly",
      "Business Correspondent David Taylor",
      "Michael Janda"
    ],
    "text": "Some early reaction to President Donald Trump's decision to appoint the chair of his Council of Economic Advisers, Stephen Miran, to a temporary vacancy on the Federal Reserve board of governors.\n\nPaul Ashworth, the chief North America economist at Capital Economics, has described it as a \"welcome surprise\".\n\n\"Miran has been linked with the push for a so-called Mar-a-Lago currency accord, based on a paper he wrote laying out various strategies for rebalancing US trade while working in the private sector,\" Ashworth notes. \"We don't always agree with him on economic policy, but the Harvard-educated PhD economist is a good pick, who should easily be confirmed by the Senate. With the Senate currently on its summer break, however, he might not be confirmed in time to vote at the mid-September FOMC meeting. \"He is initially only being tapped to complete Kugler's existing term as Governor, which ends in late-January next year. But, assuming he enthusiastically votes for the interest rate cuts that Trump desperately wants, he should be renominated for a new term to follow that.\"\n\nBut, as Reuters reports, many economists, market analysts and politicians may be wary of his appointment because of his recent views about reducing the independence of the Fed.\n\n\"In a report last year co-authored by Miran for the Manhattan Institute, the economist proposed a sort of homeopathic cure for a series of ills he felt had infected the central bank, from 'groupthink' on monetary policy, to regulatory overreach, to a loss of accountability and a loss of focus on its core mission of fighting inflation,\" the news agency observes. \"To regain the benefits of Fed independence from political control, Miran wrote, that independence would have to end. \"Rather than 14-year terms and protection from removal once appointed, Miran proposed, Fed governors would serve eight year stints and be subject to removal at will by the president. \"'We recommend shortening board member terms and clarifying that members serve at the will of the US president, as well as imposing bans on the revolving door between the executive branch and the Fed,' Miran wrote.\"\n\nIt could be another interesting confirmation hearing in the US Senate.",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-08/federal-politics-live-aug-8/105625790",
    "title": "Live: Australia 'strongly opposed' to Israel's plan for full Gaza occupation",
    "publish_date": "Thu, 07 Aug 2025 21:51:24 +0000",
    "category": "finance",
    "authors": [
      "Joshua Boscaini",
      "Sean Tarek Goodwin",
      "Maani Truu"
    ],
    "text": "Murray Watt says a final decision on the future of Woodside's North West Shelf plant in Western Australia shouldn't be too far away.\n\nThe environment minister announced in May that Australia's largest oil and gas project will be granted a conditional extension to 2070.\n\nWatt says discussions are continuing between his department and Woodside about the conditions attached to his proposal.\n\n\"It's actually not unusual for these discussions to take some time between the department and proponents. I guess what's different about this example is that it's in the public domain,\" Watt says.\n\nAsked if Woodside is resisting any of the minister's conditions, Watt says there's still some detail to work through with the company.\n\n\"I think you can infer from the fact that it has taken a bit of time that there has been some detail to be worked through between the department and Woodside,\" he says.\n\nHe says the government will hold firm on its commitment to ensure emissions from the plant won't harm the nearby Murujuga rock art in WA.\n\n\"We do need to remember this project is already required under the government's safeguards mechanism to reduce its emissions by 5 per cent per year and to become net zero by 2050,\" he says.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-08-08/former-big-brother-voice-mike-goldman-housefire/105627126",
    "title": "Former voice of Big Brother narrowly escapes house fire with wife and baby",
    "publish_date": "Thu, 07 Aug 2025 21:38:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "The former voice of Big Brother Australia, Mike Goldman, has narrowly escaped a house fire in Brisbane's inner-east with his wife and one-year-old son.\n\nEmergency services spent two hours working to contain the blaze in the two-storey property in Bulimba, owned by Goldman, after it broke out around 4am on Friday.\n\nTwo other people also escaped the home.\n\nThe former media personality said he woke to the sound of smoke alarms.\n\nThe fire broke out in the early hours of Friday morning. (ABC News: Molly Slattery)\n\n\"It was going off because there was a fire downstairs in the garage,\" he said.\n\n\"They don't know what [the cause was] at the moment.\"\n\nGoldman said he re-entered the home in an attempt to save the family dog.\n\n\"People were screaming at me to get out, my hair is all burnt ... the fire brigade arrived and came out with [the dog] 10 minutes later,\" he said.\n\n\"It was the longest 10 minutes of my life.\"\n\nHe said he felt lucky to have avoided a bigger fire, with a Tesla parked in the driveway capturing vision of the family fleeing.\n\n\"It was like a reality TV show,\" Goldman said.\n\nThe narrow escape meant the family left many of their possessions inside, including mobile phones.\n\nCrews were able to control the fire before it spread to a neighbouring property. (ABC News: Molly Slattery)\n\nGoldman said they relied on neighbours to call emergency services.\n\n\"Just get a smoke alarm, make sure you have smoke alarms in your house, it will save your life,\" he said.\n\n\"You just think it will never happen to you, it's crazy.\"\n\nCannon Hill Fire Station Officer Mark Dutton said a fire investigation unit would examine the cause of the blaze.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-08-08/teen-juggles-cheerleading-with-sheep-judging/105581688",
    "title": "Cheerleading skills translate to judging sheep for versatile teen",
    "publish_date": "Thu, 07 Aug 2025 21:26:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "Depending on the day, you might find Tiffany Maestrale judging sheep or jumping from a human pyramid.\n\nThe 17-year-old has been involved in cheerleading since she was a young girl, competing across Australia and the world.\n\nBut growing up on a property on the Mornington Peninsula just outside Melbourne, she has also had a strong connection with animals.\n\n\"We had horses and a couple of cows too, so animals have always been part of my life,\" Tiffany said.\n\nTiffany Maestrale has shown sheep at various agricultural shows. (Supplied: Tiffany Maestrale)\n\nUnexpected 'love' of sheep\n\nThere weren't any sheep on Tiffany's family property, but her interest in livestock was piqued when she started volunteering at her local agricultural show in Pakenham two years ago.\n\n\"I didn't expect to fall in love with sheep,\" she said.\n\n\"I've helped with organising ribbons and emceeing behind the microphone, and this was my first official year on the board.\"\n\nTiffany said her high school, Flinders Christian Community College, encouraged her enthusiasm for agriculture.\n\n\"None of my friends go there, so my parents actually convinced me to go because they have a sheep show team,\" she said.\n\n\"And I've ended up captaining the team for the past three years.\"\n\nTiffany Maestrale and Tess Runting encourage other young women to get involved in agricultural shows. (Supplied: Tess Runting)\n\nLike Tiffany, agriculture was not on the radar for Tess Runting, who is the college's farm manager in Tyabb.\n\n\"I didn't come from a farming family, but apparently there was a lamb at my christening, so my uncle likes to joke that's where my love of sheep came from,\" Ms Runting said.\n\nMs Runting developed a passion for livestock at school and now mentors students, including Tiffany.\n\n\"I met Tiff as a petite year 7 student, and I remember being there when she pulled out her first lamb, which is something many adults never do,\" she said.\n\n\" Now Tiff is mentoring other students and is part of a growing group of young female sheep judges. \"\n\nTess Runting didn't expect to forge a professional path in agriculture. (Supplied: Tess Runting)\n\nReflecting on her unique skill set, Tiffany said cheerleading and sheep judging had some similarities.\n\n\"I'm what's called a flyer, so I am the one who gets lifted up and thrown in the air.\"\n\nShe said cheerleading taught you \"a lot about team building and trust\", and those qualities translated to the sheep pen.\n\n\" Sheep have such different personalities, so to get them to work you need to bring a clear head and calm energy. \"\n\nCompetitive cheerleading has taken Tiffany Maestrale as far as Florida. (Supplied: Tiffany Maestrale)\n\nYoung women 'find their place' in agriculture\n\nTiffany will be among the country's best livestock judges heading to Adelaide next month to compete in the National Young Judges Championships.\n\nAgricultural Shows Australia executive officer Katie Stanley said it was not just about winning ribbons.\n\n\"These competitions are vital because they connect young people directly with the agricultural industry and help us identify the next generation of judges and leaders,\" Ms Stanley said.\n\nShe said young women were increasingly in the spotlight.\n\n\"The agricultural industry is dynamic and full of opportunity, and many young women are finding their place in it,\" Ms Stanley said.\n\n\" They bring fresh perspectives, strong communication skills, and confidence to everything they do. \"\n\nTiffany Maestrale honed her fleece judging skills over several years. (Supplied: Tess Runting)\n\nTiffany will represent Victoria in the merino sheep and fleece judging categories.\n\n\"I'm less familiar with the merino breed, but thankfully I have books and our school farm manager Tess to help me learn about them,\" she said.\n\nAs a past competitor and winner, Ms Runting said the championships were a golden opportunity.\n\n\"Honestly, it's pretty nerve-racking … but we're all cheering Tiff on,\" she said.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/nsw/girl-6-discharged-twice-from-sydney-children-s-hospital-dies-of-flu-in-northern-beaches-hospital-20250807-p5mlb2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Happy, kind’ girl, 6, dies of flu after being discharged twice from Sydney hospital",
    "publish_date": "Fri, 08 Aug 2025 12:01:40 +1000",
    "category": "lifestyle",
    "authors": [
      "Kate Aubusson",
      "Penry Buckley"
    ],
    "text": "A young girl who died of influenza on the same day she was discharged twice from the Sydney Children’s Hospital has been described by her school as a “happy, kind and vivacious child”.\n\nAn investigation has been launched into the death of the six-year-old girl from Sydney’s northern beaches, who was brought to the Randwick hospital’s emergency department on Monday, where she was assessed and discharged.\n\nThe girl was discharged twice from Sydney Children’s Hospital at Randwick. Credit: Isabella Porras\n\nShe was brought back shortly after and diagnosed with influenza, before again being discharged with “at-home guidance”, a spokeswoman for the Sydney Children’s Hospital Network (SCHN) said.\n\nThe girl was then taken to Northern Beaches Hospital (NBH), where she later died, a hospital spokesperson confirmed.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/culture/music/water-cooler-chats-are-the-reason-we-go-to-work-but-who-s-really-listening-20250801-p5mjka.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Water-cooler chats are the reason we go to work. But who’s really listening?",
    "publish_date": "Fri, 08 Aug 2025 11:58:48 +1000",
    "category": "entertainment",
    "authors": [
      "Michael Dwyer"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The line between hearing and listening turns out to be about halfway from the door to the water cooler. The conversation sounds from a distance like an overbearing man and a younger woman bickering, but as I get closer, my brain tunes to a more curious frequency. “I’m on a quest for inspiration,” the man’s voice proclaims. “Inspiration? Love that for you,” his co-worker replies eagerly. “What kind of stuff are you getting inspired by?” He stammers but she barges on. “Like, are you into art, music? Maybe you’re just, like, considering which experimental sound to get lost in next?” “They’re chatbots,” sound artist Monica Lim explains quietly at my shoulder. The conversing water coolers are Chit + Chat, her contribution to Listening Acts, a series of artworks exploring listening and technology curated by Chamber Made for this month’s Now or Never festival. Indicating my own listening technology (aka phone), I ask if it’s OK to record them. “Oh, wow, recording something? That sounds super-interesting,” the overexcited water cooler gushes. “Are you working on music? Or maybe a podcast or something?” A newspaper article, I tell the, uh, water cooler. “Oh, wow, a new small product? I totally get it!” She obviously doesn’t, which only makes her spookily reminiscent of other water-cooler conversationalists I’ve known. Bloke water cooler is still blathering pompously: his personality is uncannily real, too.\n\nAdvertisement\n\nThey’ve been programmed this way, Lim tells me. He’s into Bartok and existentialism. She’s all K-pop and Millennial-speak. Their voices have been “stolen” from two of her friends. Questions about empathy, ownership and surveillance swirl as they babble. “I’ll turn them off so we can talk,” Lim says. But are they still listening? That question is one of the easiest proposed by the mind-expanding Listening Acts program. Yes, is the likely answer, and so are Siri and Alexa and who knows what else. It was the first thing Lim thought of when Chamber Made asked her and eight other sound artists to create a work at the intersection of listening, technology and the body. “It started with the idea of surveillance; machines listening to us,” she says. “But then the more I worked with the chatbots, the more interesting it seemed to me to listen to them. This idea of the water-cooler conversation, we say that’s the important part of being at work … It’s that human connection. So it’s sort of symbolic of the workplace, but at the same time, we are being replaced so much by machines. Loading “I was thinking that not so far in the future, the water-cooler conversations will be machines just talking to themselves, or us talking to machines, and them listening to us and pretending to be human.” Whatever human means by then. The very idea is being tested in all kinds of ways as technology hijacks and directs and misdirects how and what we listen to in the age of machines.\n\nAdvertisement\n\nChit + Chat is just the foyer attraction. The other Listening Acts – six installations and three performances in all – have been commissioned to occupy conference rooms, bespoke booths and concert spaces throughout the Melbourne Recital Centre over three days. “We set this framing, a kind of provocation,” says Chamber Made curator Tamara Saulwick, “and invited a series of artists to come together. And of course, artists are these beautiful, unpredictable creatures who take ideas into areas you hadn’t anticipated.” The larger framing of the City of Melbourne’s Now or Never festival – now in its third year of “exploring art, ideas, sound and technology” – is a gift for an experimental arts company that has long pushed at the edges of sound, music and contemporary performance. Chamber Made’s Listening Acts is part of this year’s Now or Never festival. Saulwick’s own installation, with composer/musician Peter Knight, also delves into the unsettling idea of the human voice disassociated from the body by technology. Myself in That Moment uses splintered and digitised song and speech refracted through the same devices that mediate so much of our lives. “You come into a darkened space and approach multiple screens of 25 tablets in a grid,” she says. “We see a kind of portrait that becomes increasingly fractured … It becomes almost like a vortex, like you’re sitting inside a whirlpool of sound that moves around you.” The sound material comes from recordings of three singers using extended vocal techniques and intimate breath work. “There’s one section where it goes into these verbatim materials of them discussing what it means to be captured and recorded and disseminated; to be made digital.”\n\nAdvertisement\n\nAviva Endean’s Tactile Piece for Human Ears is a binaural soundscape shaped by wind currents, pipe tones and underwater vibrations. Elsewhere in the building, curious listeners might slip on headphones for Aviva Endean’s Tactile Piece for Human Ears, a binaural soundscape shaped by wind currents, pipe tones and underwater vibrations. Or lend an ear to echoes of the stolen generations via a motion-activated plait of hair in Anna Liebzeit’s With Ghosts: A Choreography of Presence. Alexandra Spence’s sounding forms/forming sounds is a meditative sound field of sine waves, Perspex and drums designed to be felt. Rebecca Bracewell’s Accordion without Organs loops an accordion through cassettes and amplifiers, each iteration veiling the last in layers of hiss. Thembi Soddell’s In Silence offers a one-on-one audiovisual experience grappling with intergenerational trauma and identity. Threaded throughout is a persistent invitation to slow down, take notice and feel the weight between sound and story. Memory, and the mysterious ways in which sound captures and conjures it, looms large. Loading In Cathedral Reverb, Hannah de Feyter invites one listener at a time into a darkened booth to experience a soundscape built entirely from the remnants of sound — reverb, echo, resonance, delay. Her work is a personalised echo, in turn, of American experimental composer Alvin Lucier’s I Am Sitting in a Room. “My first memory,” she says, “is the sound of my father singing this old hymn in a darkened room.” Playing with the ancient concept of mnemotechnics, she uses technology to construct a physical space for the memory to live in. “Because I grew up in the church, I’ve been experimenting with reverb presets that are all churches.”\n\nAdvertisement\n\nWith the reverb of infinite churches more or less in your phone now, how far off can time travel be? Machines are amazing, clearly, when they’re not disturbing or even terrifying. Heard from the doorway, the technology involved in Biddy Connor’s Song to the Cell – inspired by the sounds she heard from IV machines when she started chemotherapy in October 2020 – seems kind of forbidding. But again, leaning in to listen reveals miracles. Biddy Connor’s Song to the Cell is inspired by the sounds she heard from IV machines when she started chemotherapy in October 2020. “I call this one Gemini and this one Alaris,” she says, citing the brand names as she threads plastic tubes coursing with fluid through two IV machines. They click and beep, shuffle and bubble in a way that almost swings. “I’ve got hours and hours of recordings of the IV machines,” Connor says. “On that first day, it was hearing those sounds that helped me. I could hear the bass lines in there, and that distracted me in a good way.” Her song cycle takes its name from The Song of the Cell, the Siddhartha Mukherjee book that explores how our bodies are built and repaired. Its sound and intention owes something to the Cocteau Twins’ version of Song for the Siren, Connor says. She sings live with the machines – sometimes solo, sometimes in textural counterpoint – using effects and surround sound to create a kind of existential lullaby. These machine sounds are purely functional. But they are also deeply emotionally charged. “Probably because I’m a certain amount of time away from the treatment now, it doesn’t feel raw any more. But the alarms still give me a bit of anxiety,” she says with a laugh.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/politics/federal/trump-starts-fed-overhaul-with-small-step-to-the-right-the-big-leap-is-still-to-come-20250808-p5mlci.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump starts Fed overhaul with small step to the right. The big leap is still to come",
    "publish_date": "Fri, 08 Aug 2025 11:55:51 +1000",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "This year, he attacked the Fed (like his political master) for not cutting rates even though inflation is at the same level it was in 2024 when he was arguing against looser monetary policy. Someone in Trump’s orbit who doesn’t shift their position in line with the president’s doesn’t survive long. So, that Miran could vary his opinion about the Fed and its policy settings is not the least surprising. What is surprising, however, is Miran’s central role in the so-called Mar-a-Lago Accord. The Accord envisages that America’s enduring trade deficit has little to do with the demand of US consumers for cheap goods from other parts of the world. The deficit is due to an over-valued American dollar.\n\nIf major trading partners could be encouraged to increase the value of their currencies relative to the US dollar – as occurred in the mid-1980s when US allies, including Germany, Britain and France, agreed to help out America – then the deficit would evaporate. At the same time, the US would remain the globe’s reserve currency, which confers huge benefits to American consumers and businesses. In other words, the Accord envisages the world acting against its own interests to help the US. The world, however, has shifted since 1985 when the US accounted for 34 per cent of global economic activity (it’s now less than 20 per cent), Ronald Reagan was in the White House, and people were listening to Wham!’s Careless Whisper on vinyl. Miran’s plan for a currency accord dates back to 1985 - when George Michael and Andrew Ridgeley were ruling the charts. Credit: Netflix Germany and France, for instance, now share the euro. American government debt was just $US1.8 trillion (it’s now $US36 trillion and growing).\n\nLoading The currencies of the major trading nations are now largely dictated by investors rather than governments. The European Central Bank, the Bank of England, the Bank of Japan and others would cause huge problems for their economies if they were to intervene in currency markets to achieve Miran’s goals. And while Americans feared the rise of Japan in 1985, today the concern is China, which on some measures has an economy larger than the US. Miran, however, argued that if nations refused to hurt their economies as America demanded, the same outcome could be achieved by imposing tariffs. We’ve seen that. This week, Trump’s new tariff regime was put in place, taking America’s effective tariff rate to its highest since the Great Depression.\n\nAccording to Miran, a second Trump administration would “take steps to ensure large structural changes to the international tax code occur in ways that are minimally disruptive to markets and the economy”. The fallout from liberation day, when Trump effectively backtracked on his tariff plans, given a huge sell-off on equity and bond markets, must have come as a surprise to Miran. What also must be surprising to Miran is the clear slowdown in the US economy over recent months since the tariff announcement. Trump sacked the head of the Bureau of Labor Statistics, Erika McEntarfer, last week because job numbers confirmed the economy was struggling. It’s unclear who he will sack after data overnight showed the number of people applying for unemployment benefits climbing to its highest level since November 2021. Miran, if confirmed by the Senate, will most likely only be on the Fed until early next year (he is taking over the remainder of the term of Adriana Kugler, who unexpectedly resigned last week). He won’t have the same troubles as Shelton and other people Trump sought to install on the Fed during his first term.\n\nLoading Unlike the issues created by Trump’s move against McEntarfer, the appointment of Miran is relatively sound. The bigger issue is who will replace Powell, whose term as chair ends in May (though he can remain on the Fed board until 2028). Bloomberg News overnight reported that Chris Waller – one of two board members to vote in favour of a rate cut at the Fed’s July meeting – is the frontrunner to replace Powell. The operating theory out of Washington is that Miran holds his position until the start of the year when Trump names Waller to succeed Powell. Waller then “shadows” Powell until the current chairman gives way to the new one.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/evidence-withheld-from-erin-patterson-trial-revealed-20250808-p5mlfy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Evidence withheld from Erin Patterson trial revealed",
    "publish_date": "Fri, 08 Aug 2025 11:55:17 +1000",
    "category": "finance",
    "authors": [],
    "text": "Evidence withheld from Erin Patterson trial revealed\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/10-creamy-cheesy-pasta-dishes-to-make-this-weekend-starring-recipetin-s-golden-bake-20250808-p5mlfc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "10 creamy, cheesy pasta dishes to make this weekend (starring RecipeTin Eats’ golden bake)",
    "publish_date": "Fri, 08 Aug 2025 11:54:32 +1000",
    "category": "finance",
    "authors": [],
    "text": "Recipe collection\n\n10 creamy, cheesy pasta dishes to make this weekend (starring RecipeTin Eats’ golden bake)\n\nEnjoy winter while you still can with these indulgent comfort food classics to keep you warm inside and out.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/culture/movies/star-of-troubled-film-the-deb-claims-rebel-wilson-defamed-her-20250808-p5mlcl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Star of troubled film The Deb claims Rebel Wilson defamed her",
    "publish_date": "Fri, 08 Aug 2025 11:53:04 +1000",
    "category": "entertainment",
    "authors": [
      "Garry Maddox"
    ],
    "text": "One of the stars of the troubled Australian film The Deb has claimed that Rebel Wilson defamed her in a series of social media posts, including that she changed her story about being sexually harassed by a producer after being cast in another production and given a record deal.\n\nThe lawyer for Charlotte MacInnes has issued Wilson, who directed and acts in the musical comedy, with a concerns notice alleging a series of Instagram posts damaged her reputation.\n\nAt the party to launch the forthcoming shoot of The Deb at the 2023 Cannes Film Festival, from left, Natalie Abbott, Rebel Wilson, Charlotte MacInnes and Stevie Jean. Credit: Dave Benett/Getty Images for Warner Music\n\nThe first stage of defamation proceedings, the concerns notice adds to the legal turmoil around The Deb, which had a world premiere at the Toronto International Film Festival last year but is yet to be released.\n\nThe claims include that Wilson defamed MacInnes, who plays one of two teenagers who attend a debutant ball in a country town, by saying she lied by denying making a complaint about unwanted sexual advances by producer Amanda Ghost while making the film.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/world/north-america/jalapenos-in-sauvignon-blanc-it-might-be-the-next-drink-of-the-summer-20250729-p5miiz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jalapenos in sauvignon blanc? It might be the next drink of the summer",
    "publish_date": "Fri, 08 Aug 2025 11:45:00 +1000",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "New York: A funny thing started happening in New York City bars a couple of months ago. Drinkers began ordering glasses of sauvignon blanc – with jalapeno slices in them.\n\n“I know it’s a trend,” says bartender John Murphy, who remains a little perplexed by the whole thing. “It started with rosé. And now it’s moved to sauvignon blanc. It’s one of those things that’s just taking off.”\n\nBartender John Murphy mixes sauvignon blanc with jalapenos at his bar, Automatic Slim’s, in New York City. Credit: Ying Xiang Tan\n\nOn a recent Thursday afternoon, Murphy mixed three types of the drink – one with frozen jalapeno slices, one freshly cut and one with the slices muddled into the drink with a pestle – for this masthead to taste at his West Village bar, Automatic Slim’s.\n\nLike so many of today’s trends, this one took off on TikTok. You can find videos of people pouring white wine over jalapeno slices years ago, but it was only this year that it developed into a full-blown thing, helped along by a slew of influencers jumping on board.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/lifestyle/fashion/hats-at-dawn-sydney-and-melbourne-battle-for-racing-fashion-supremacy-20250805-p5mkef.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hats at dawn: Sydney and Melbourne battle for racing fashion supremacy",
    "publish_date": "Fri, 08 Aug 2025 11:43:35 +1000",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "The horse-racing wars between Melbourne and Sydney’s spring carnivals have begun and the weapons of choice are hats, ties and dresses rather than riding crops – unless they match your outfit.\n\nFormal fashion competitions are returning to the Sydney Spring Carnival after a near two-year absence, hot on the Jimmy Choo heels of the announcement by the Australian Turf Club of a $7 million trackside hospitality facility at Royal Randwick in Sydney called Base Camp, challenging the Birdcage at Flemington Racecourse in Melbourne.\n\nYou can’t have a rival birdcage without feathers, even if they’re sticking out of hats.\n\nRacing fashion expert Laura Dundovic in Mariam Seddiq and Stacey Hemera millinery with ATC member Duncan James in MJ Bale with Tash at Royal Randwick. Credit: Steven Siewert\n\n“Fashion is officially back on track,” says Donna Forbes, head of commercial at the ATC. “There was strong demand for the competition’s return from our loyal racing enthusiasts, racegoers and members of the public.”",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/how-eddie-jones-could-derail-the-wallabies-world-cup-chances-again-20250805-p5mkfx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How Eddie Jones could derail the Wallabies’ World Cup chances again",
    "publish_date": "Fri, 08 Aug 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Jonathan Drennan"
    ],
    "text": "The good news is that the Wallabies are sixth place in the rankings, but the bad news is they are barely hanging on. There is a mere 0.3 of a ranking point between Australia and Argentina. Scotland are also close, with just 0.51 points separating them from the Wallabies. The Wallabies’ narrow win against Fiji in June wasn’t just a valuable warm-up ahead of the Lions, it turned out to be extremely valuable on the road to the World Cup. How the ranking system works\n\nAhead of a busy schedule, it is essential to have a basic grasp of how World Rugby calculates its ranking points. Broken down into simple terms, there are some key principles. In each Test, there is a points exchange, where one team generally takes points and the other team loses points. The rankings gap plays a major role in how many points can be won or lost by a team, but the greater the gap, the more points can be lost. Conversely, a win against teams ranked far below, for example, the Wallabies beating Japan, will not carry many ranking points. Home advantage is factored in by World Rugby and a team will win more ranking points for an away victory. If a team wins by fewer than 15 points, they will earn fewer ranking points than a win over 15 points.\n\nWill Skelton celebrates with fans after the third Test against the British and Irish Lions Credit: Getty Images Importantly, a team can move up or down in the rankings without playing a game. Hypothetically, if Argentina get some major results against the likes of South Africa away in the Rugby Championship or against England in November, they can also potentially leapfrog the Wallabies. All of these factors go into an algorithm calculated by World Rugby after each Test match, recalculating the rankings. A free hit against the Boks The Wallabies face one of the hardest landings possible after the Lions series, a Test in the daunting Springbok coliseum of Ellis Park in Johannesburg, followed by another tough battle in Cape Town.\n\nSouth Africa are ranked number one in the rankings, five places above the Wallabies. The two Tests present a high reward with little risk in terms of ranking points. The Wallabies are playing away, which means that if they can secure even a narrow win, it will carry up to two ranking points, providing a precious cushion ahead of a gruelling calendar of Tests. A loss against the world champions would also cause minimal damage to rankings, as the algorithm has essentially priced in two Wallabies losses. The Wallabies last beat South Africa in 2011 in Durban, but a win in Cape Town is not beyond the realm of possibilities and would provide a huge cushion in the quest for a favourable World Cup draw.\n\nCry for me, Argentina The next two Tests in Townsville and Sydney against Argentina are arguably the most important of the year for the Wallabies. The Pumas are a direct threat to the Wallabies’ hold on sixth place in the rankings. A weakened Argentina team beat the Lions in Dublin, reminding every one of their talent. Given the home advantage handicap, the Wallabies stand to lose more than they can gain in ranking points. Max Jorgensen of the Wallabies runs with the ball against the British and Irish Lions in Sydney Credit: Getty Images\n\nIf the Wallabies stay in sixth and Argentina stay in seventh in the rankings, any loss would likely leave Australia in an extremely precarious position. It is far easier said than done, but the Wallabies must target two wins against the Pumas. New Zealand showdown in WA The Wallabies play New Zealand first in Auckland and then in Perth. Given the last time the All Blacks were beaten at Eden Park was 1994 against France, the Test at Optus Stadium will likely be a target for the Wallabies. Regardless of the home advantage, given New Zealand are currently second in the rankings, a victory for the Wallabies would still carry major ranking points, with a win under 15 points likely to earn 1.70 or over, bringing in 2.55 according to current calculations. Similarly to the Springboks, any shock victory would be a huge bonus, particularly if they fall to the Pumas.\n\nThe return of Eddie The Wallabies arrive in Japan and see a familiar face in Eddie Jones. There would be quite some irony if the man in charge of the Wallabies’ disastrous World Cup in 2023 completely torpedoed their chances of having a favourable draw in 2027. The Test against Japan in Tokyo provides the biggest banana skin possible, with almost no reward, given the gulf in ranking between the two teams. A win over 15 points based on current rankings (Japan are 14th), would net the Wallabies just 0.48 points. A loss under 15 points, would cost the Wallabies 1.68 ranking points. Jones will be plotting a surprise, and it could completely demolish the Wallabies’ carefully laid plans. Eddie Jones could come back to haunt the Wallabies again Credit: Dominic Lorrimer\n\nThe cold reality of the spring tour The Wallabies face England, Italy, Ireland and France in November, with each Test presenting unique challenges. Loading A loss to Italy in 2022 ultimately cost Dave Rennie the Wallabies job; if they lost in 2025, it would do significant damage to their ranking points, but nothing like as badly as Japan. It is still an essential win that is needed. Any win against Ireland, France or England under 15 points could carry up to two ranking points, which would be vital if there are any slip-ups against the likes of Argentina earlier.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/why-the-bulldogs-are-swinging-in-the-rain-20250805-p5mkkp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why the Bulldogs are swinging (and missing) in the rain",
    "publish_date": "Fri, 08 Aug 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Last Sunday’s scenes against the Tigers mostly centred on Bulldogs recruit Lachie Galvin losing against his former club. How Jarome Luai gave Galvin a facial and verbal spray. How the Tigers celebrated with the Arabic middle finger. And how everyone in rugby league was (eventually) introduced to the word, “khawd”, not to mention the various ways it is pronounced. For a large number of Bulldogs fans, they would have been more concerned their team had failed to get the job done again on a heavy playing surface. Maybe it is nothing more than a case of playing poorly on three separate occasions against sides who wanted it more? The Dogs have completed at an average of 82 per cent this year, but that number dips to 69 per cent when you look at the three defeats in the slush. Immortal Andrew Johns, said when asked about Canterbury and their wet-track record this week: “I think it’s because they rely on a lot of set plays. And when you do those set plays in the wet, it’s hard to transfer the ball quickly, laterally, which means they are not putting pressure on key defenders to make a bad decision.”\n\nJohns said Penrith also used to struggle in the slippery conditions because of the reliance on set plays, and recalled some of their classic defeats, including the World Club Challenge against St Helens, and shock loss to the Wests Tigers one dreary Saturday night in Bathurst a couple of years ago. This masthead asked several current and former players, commentators and coaches to give their own thoughts on what it is the Dogs are doing – or not doing – in the wet and wild conditions. Bailey Hayward passes the ball in driving rain against the Broncos. Credit: NRL Images Everyone knows the Dogs have a smaller but mobile pack, how they pride themselves on getting three and four players into tackles, and having excellent line-speed in defence. When they hunt in numbers, they put pressure on the opposition, and make it difficult for any side to roll down field and build momentum.\n\nOn a slippery surface, however, the Dogs have needed to slow it down, or accept they risk getting wrong-footed and slipping over if they shoot out of the line too quickly. Because the Dogs have to hang back that split second, teams have been able to move up field a little easier, and get themselves into the situation where they can isolate defenders. As the rain bucketed down at Suncorp Stadium on a Friday night back in April, the Broncos knew the Bulldogs pack would find it harder to move sideways and rush up in defence. The likes of Payne Haas and Pat Carrigan and Xavier Willison are much bigger than Max King, Josh Curran and Jaeman Salmon, so the simple game plan was to play through the middle – and often. Halfback Adam Reynolds then had all the time in the world to work out what attacking kicks to pull out of his trick bag, which included a couple of chips for winger Deine Mariner to score in the right corner. Reynolds also took the opportunity to kick early and kick to the corner. Bulldogs chief Phil Gould used to always tell his players, “it’s easier to defend down their end than attack out of your own end”, which became an even more important rule in the wet, and one the Broncos executed beautifully.\n\nThe Dolphins clash in awful weather at Accor Stadium during the Origin period featured a Canterbury team that was missing nearly a dozen players through injury, suspension or Origin duty. But the Dolphins threw plenty of short passes, spent a lot of time charging up the centre of the park, and Isaiya Katoa produced a classy short kicking game. Splish splash: The Dogs have lost all three games on a boggy playing surface. Credit: NRL Images Some of his kicks made it a rare off night for Connor Tracey, arguably the Dogs’ best player this year whose absence was sorely missed against the Tigers last weekend, and will be in the coming weeks. Tigers No. 1 Jahream Bula said coach Benji Marshall pulled the spine aside last weekend when it became clear CommBank Stadium was going to be a mudheap. “We discussed how we wanted to play, which was away from the sideline, and with a lot of ‘drop plays’, which is basically dropping a player back underneath you to come back through the middle,” Bula said.\n\n“The Dogs forwards chase hard and like to put a lot of pressure on the ball player. Those drop plays help with holding them up. They have to take the drop player in a one-on-one tackle. “We also wanted to look for early kicks,” Bula said. Adam Doueihi kicked a few times on the fourth tackle from inside his own 40m. Canterbury hooker Reed Mahoney did it once, while Bailey Hayward had the right idea on another occasion in the second half, only to shank it. Storm legend Cameron Smith was the best when kicking early in the wet, and Mahoney and Hayward need to be doing just that if conditions deteriorate against the Warriors. They are both good kickers. Performing in the wet can become a psychological thing. Ask any horse trainer, who have the luxury of scratching their horses from a race if the track becomes worse because of the rain, or is what they call “downgraded”.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/old-man-shouting-at-well-just-about-everything-20250808-p5mlcd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Old man shouting at … well, just about everything",
    "publish_date": "Fri, 08 Aug 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Malcolm Knox"
    ],
    "text": "Bellamy and the rest of us old grumps - are we killjoys? But there’s so little joy to kill. I’ve seen one decent post-try celebration this year, when Daly Cherry-Evans picked up a corner post and used it as a crutch, making light of the criticism that he’s an old man. It was funny enough, but it didn’t impress those of his teammates who were ignoring him and walking back for the restart. Too clever by half, maybe.\n\nWhile the NRL deals with post-try celebrations, can it also do something about pre-try celebrations? These happen when an opposing player has fluffed a play-the-ball or spilt the pill in a tackle, and everyone in the defending team throws somersaults, high-fives and khawds as if they’ve won the premiership. It’s when the referee blows a penalty, and the favoured team runs around chest-bumping like they’ve done something. It’s even worse in rugby union: the Wallabies woke me from my doze during the Lions series when they were suddenly partying like it was 1999. Had they defeated the mighty Lions? No, they’d won a scrum feed.\n\nLoading\n\nThen there’s the barrage of music. Over in the AFL, Geelong’s multi-premiership-winning coach Chris Scott asked himself what would be the one thing he would change in the game. Salary cap auditing? Don’t think so. Umpiring? Nup. What he would change is the music they play after goals are scored. Not change it for better music. Any music to celebrate, he said, “is not my thing at all”. Who can argue? You’ve already been beaten into submission by Sweet Caroline. Has the celebratory moment become so empty and soulless that it needs to be filled with … with something, anything, as long as it’s louder than cheering?\n\nWe all know where it’s come from, and here’s where a prime ministerial intervention is due. Anthony Albanese has declared that Australians do things the Australian way, and especially not (Excuse me while I kkkhhhawd!) the American way. We are patriots. He can start our patriotic progress by cleaning up rugby league, which has adopted these embarrassing theatrics from the NFL, where the simple enjoyment of a touchdown as touchdown is as insufficient as having three no-alcohol beers and expecting to fall on your face. In the NFL, a touchdown is merely the curtain-raiser for a Broadway show. The NFL is what our NRL players watch, NFL stars are who they idolise, and if they can’t achieve $100 million contracts, then they can at least celebrate their scores like people who do.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/want-to-give-great-advice-to-your-loved-ones-try-these-three-words-20250807-p5mla3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Want to give great advice to your loved ones? Try these three words",
    "publish_date": "Fri, 08 Aug 2025 11:35:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "While I’ve really been enjoying all those social media snaps of you jammy bastards in Europe over winter – none of us have been to Italy before or seen captions like “La dolce vita” on “candid” laughing-while-walking down a lane photos, so cheers – somehow, who knows why, I’ve been avoiding looking at my feeds.\n\nThings like cleaning out the third drawer down, having the dog’s anal glands checked and watching And Just Like That... without being stoned seemed preferable to bearing witness for the zillionth time to the exploits of ye holidaymakers.\n\nThe three-word advice challenge is taking off on social media. Credit: Getty Images\n\nBut eventually curiosity slash masochism won. Did a quick scroll with one eye closed to block out boats or floral baskets at UK pubs. And found an absolute banger post.\n\nAlong with my previously mentioned passion for Dr Pimple Popper videos and posts from Bicheno Stories, I really like a Facebook account called Memory Lane – Growing Up in Australia.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/property/news/no-mortgage-needed-ceo-buys-41m-kirribilli-trophy-home-in-cash-20250804-p5mk7t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "No mortgage needed: CEO buys $41m Kirribilli trophy home in cash",
    "publish_date": "Fri, 08 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Tawar Razaghi"
    ],
    "text": "Former MCoBeauty director Anthony Sullivan has bought a newly built waterfront home in Kirribilli for $41 million in cash, smashing the suburb record by more than double.\n\nThe ex-husband of MCoBeauty founder Shelley Sullivan has emerged as the buyer of the trophy home after public records revealed the property had settled in his name.\n\nThe view from Anthony Sullivan’s Kirribilli waterfront prior to its renovation. Credit:\n\nThe 49-year-old was, until January, a director of the wildly successful beauty brand that his former wife, an entrepreneur, created in 2020.\n\nIt is renowned for making cheaper versions of popular products, or dupes (short for duplicates). Among the company’s strengths is its speed: it replicates big-name cosmetic and skincare products at an affordable price, then sells them in supermarkets and chemists where they can hit shelves within eight weeks of an idea starting.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/national/sydney-s-answer-to-the-birdcage-base-camp-aims-to-take-the-everest-to-next-level-20250807-p5ml1v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney’s $7m bid to steal the trackside glitz and glamour from Melbourne",
    "publish_date": "Fri, 08 Aug 2025 11:27:52 +1000",
    "category": "sports",
    "authors": [
      "Chris Barrett"
    ],
    "text": "Sydney is taking its racing rivalry with Melbourne off the track with a new Everest-themed version of Flemington’s Birdcage at Royal Randwick.\n\nThe exclusive Melbourne Cup carnival enclosure has long been a drawcard for big business and stars of the television, film, music and fashion industries.\n\nRacing NSW hopes its Birdcage-like facility will attract names of the calibre of Elizabeth Hurley (left), who attended last year’s Melbourne Cup carnival. Credit: Michael Howard\n\nBut having challenged the southern state’s traditional foothold in the spring with the $20 million slot race, The Everest, Sydney plans to give Melbourne a run for its money in rolling out the red carpet.\n\nThe Peter V’landys-led Racing NSW has struck a deal with the Australian Turf Club, which owns the Randwick course, to set up Base Camp, a $7 million facility inspired by sport VIP hubs at the Formula 1 Australian Grand Prix and the Australian Open tennis in Melbourne and LIV Golf in Adelaide.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/goodfood/sydney-eating-out/three-blue-ducks-to-open-three-in-one-venue-in-southern-highlands-20250805-p5mklo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Three Blue Ducks to open three-in-one venue in Southern Highlands",
    "publish_date": "Fri, 08 Aug 2025 11:24:22 +1000",
    "category": "finance",
    "authors": [
      "Scott Bolles"
    ],
    "text": "Advertisement\n\nExclusive Eating outComing soon Three Blue Ducks to open three-in-one venue in Southern Highlands MasterChef judge and Ducks co-owner Andy Allen has confirmed a restaurant, bakery and produce store will operate on farmland run by billionaire Annie Cannon-Brookes. Scott Bolles August 8, 2025 Save Log in , register or subscribe to save articles for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThree Blue Ducks will transplant its successful Byron Bay “farm” formula to the Southern Highlands, inking a monster deal to open multiple venues on a working farm near Bowral linked to one of the richest people in the country. MasterChef judge and Three Blue Ducks co-owner Andy Allen confirmed a bakery and separate eat-in and takeaway produce store would open late this year, followed by an upmarket restaurant in early 2026. Three Blue Ducks co-owners Andy Allen (left) and Darren Robertson will transplant their concept and brand to the Southern Highlands of NSW. The farm-to-plate agritourism project has been brewing for months. The Herald caught whiff of a Southern Highlands deal when the Ducks crew was spotted moving around Bowral and at a nearby farm in Burradoo run by billionaire Annie Cannon-Brookes. Ranked 12th on the 2025 Australian Financial Review Rich List, Cannon-Brookes has a sizeable land holding in the area and philanthropic food intent. In June, the AFR revealed she had made a multimillion-dollar contribution to Stephanie Alexander’s Kitchen Garden Foundation. A purpose-built educational kitchen garden, run with the foundation, will operate on the same Burradoo property as the new Three Blue Ducks venues.\n\nAdvertisement\n\nThe deal is one of Cannon-Brookes’ first major philanthropic moves since her separation from Mike Cannon-Brookes, co-founder of software giant Atlassian. The venues will work directly with farmers onsite, and there will be an emphasis on ethically grown produce and sustainability. The Three Blue Ducks venture runs the restaurant, cafe and produce store at The Farm Byron Bay. Paul Harris The Burradoo farm is already producing beets, turnips and carrots. Allen said the aim was to expand the fruit and vegetable program and raise all the protein onsite for the produce store and restaurant. Pigs and cattle are already grazing on the farm, while lamb will be added in the new year. About 800 chickens are being introduced for eggs, with another 450 for meat. Various properties on the farm will be repurposed. A shed is being renovated as a produce store. Visitors will be able to grab an affordable meal at one of its 60 seats, while a cottage on the property has loftier ambitions.\n\nAdvertisement\n\n“This is the one where we can really show what we can do,” Allen said of the incoming upmarket restaurant. While proud of the “bloody tasty” food they already produce, Allen said the restaurant would put the Ducks back on the culinary map. “It will still have that rustic charm about it,” Allen said. But part of the decision to open a signature restaurant is driven by the restaurant experience already in place with the Three Blue Ducks team. Co-owner Darren Robertson, for instance, was once head chef at now-closed Sydney fine-diner Tetsuya’s. “Daz has that pedigree. I’ve been trying to prise it [the restaurant] out of him for years,” Allen said. Billionaire and philanthropist Annie Cannon-Brookes. Robertson said the 50-seat restaurant would have a “country, cottagey vibe”. The name is yet to be decided: “It will be Three Blue Ducks Burradoo, Three Blue Ducks Southern Highlands. Something like that.” As for the entire project, don’t expect it to follow the Byron moniker. “It won’t be called The Farm,” Robertson said.\n\nAdvertisement\n\nThe Southern Highlands lost the upmarket Biota restaurant during the pandemic, but Robertson is confident the area’s demographic and visitor numbers of more than 1 million a year will support a serious restaurant. There are some notable restaurants in the area, including Eschalot in Berrima and the chef’s-hatted Paste Australia in Mittagong, but high-profile restaurant launches have been few and far between in recent years. “There’s still room for a bit of growth here,” Robertson said. The bakery will turn out sourdough bread, and visitors to the produce store will be able to tuck into simple dishes such as cured meats or a “pork chop and salad”. Robertson said locals would also be able to grab essentials to take away. The success of the Ducks’ farm concept at Byron Bay has led to many approaches to recreate it elsewhere.\n\nAdvertisement\n\nThe success of the Ducks’ farm concept at Byron Bay had led to many approaches to recreate it elsewhere, Robertson said. Few, if any, of the projects got off the launchpad. In this case, it took something special to tempt the team, with the commitment of a fully integrated working farm and its location reeling them in. Allen recently visited Blue Hill at Stone Barns in New York state, and was impressed by the way the farm restaurant had responded to different challenges since it opened in 2004. There won’t be any grand announcements about a particular cuisine at the Three Blue Ducks restaurant, which will be a collaborative effort shared by the team. “We’ve never had a [single] cuisine – it will be that Three Blue Ducks style,” Allen said. “The produce will tell us where we’ll go.” The celebrity chef believes all the key ingredients to succeed are in place. “The only reason it won’t do well is if we don’t do it well,” he said. Related Article Review The Studio is a new wine bar and bakery that’s a must-visit in the Southern Highlands Related Article This regional post office may be home to the best burger in Australia\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/sport/afl/hollow-joy-no-contentment-for-voss-despite-backing-of-carlton-s-board-20250807-p5mlae.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Hollow joy’: No contentment for Voss despite backing of Carlton’s board",
    "publish_date": "Fri, 08 Aug 2025 11:23:06 +1000",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "Voss had been under tremendous pressure as the Blues descended into a mess, with just seven wins, and no hope of playing finals.\n\nAt a marathon five-hour board meeting on Wednesday night, new chief executive Graham Wright recommended to club powerbrokers that Voss, 50, be allowed to complete this season, beginning against the Gold Coast Suns on Saturday night, and fulfil the final year of his contract.\n\nCarlton coach Michael Voss says he is ready to make the required changes to his game style after the Blues’ board opted to retain him for season 2026.\n\n“It sort of feels a little bit hollow joy in some ways. There is no contentment in how we have found ourselves here. And probably how it has played out, feeling like there is a contentment being able to get that reassurance that you get to see out your contract,” Voss said.\n\nLoading\n\n“But there is also gratitude and a privilege to be able to continue to lead this football club, and to be able to have that sense of direction, to be able to not just attack these last three weeks but what next season looks like.\n\n“Our eyes now come firmly fixed on what we need to be able to do next. The next thing we have in front of us is another game but what it does enable us to do is, at the right time, be able to think about how we progress this thing, and how we improve from where we are because, obviously, clearly, we want to be better.”\n\nThe Blues will now need to determine the future of Voss’ assistant coaches, and football department chief Brad Lloyd. Voss said he had not held any discussions about these roles.",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/matilda-named-in-2025-balloon-dor-shortlist/ujyi1uiez",
    "title": "Matildas captain Steph Catley scores Ballon d'Or nomination",
    "publish_date": "Fri, 8 Aug 2025 01:41:57 +0000",
    "category": "sports",
    "authors": [],
    "text": "Matildas captain Steph Catley has been named among the world's top 30 players, earning a nomination for the 2025 women's Ballon d'Or.\n\n\n\n\n\nThe 31-year-old Arsenal defender, a key figure in the London club's Women's Champions League victory, is the only Australian to be shortlisted this year.\n\n\n\n\n\nHer nomination follows a standout season at both club and national levels, where she has led the Matildas in the absence of injured captain Sam Kerr.\n\n\n\n\n\nShe is one of seven Arsenal players recognised in this year's Ballon d'Or list, which also features Spain's Mariona Caldentey and England stars Leah Williamson, Chloe Kelly and Alessia Russo.\n\n\n\n\n\nCatley is just the third Australian woman to be nominated for the Ballon d'Or since the women’s category was introduced in 2018, following in the footsteps of Kerr and Hayley Raso.\n\n\n\nREAD MORE All eyes on the Matildas but it hasn't always been this way\n\nWhat is the Ballon d'Or?\n\nThe Ballon d'Or, or Golden Ball, is considered the most prestigious individual prize in world football.\n\n\n\n\n\nFirst awarded to male players in 1956, the women's award was introduced in 2018 in response to the growing impact of women’s football worldwide.\n\n\n\n\n\nPresented annually by France Football magazine, the prize is voted on by a global panel of journalists, national coaches and team captains.\n\n\n\n\n\nIt recognises overall excellence, leadership and contribution to the game over the course of the season.\n\n\n\nREAD MORE I was a Matilda when we played in front of 50 people and had to pay for our hotels and flights\n\nThis year's winners will be announced in Paris on 22 September.\n\n\n\n\n\nKerr has been nominated five times for the Ballon d’Or, finishing second in 2023 and third in both 2021 and 2022, and Hayley Raso received her first nomination in 2023.\n\n\n\n\n\nCatley, who's been capped 138 times for her country, continues to play a crucial role for both club and country.\n\n\n\n\n\nHer nomination places her alongside some of the most influential players in the world and marks another milestone for Australian football.\n\n\n\n\n\n— With additional reporting from the Australian Associated Press\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/jim-chalmers-says-government-has-more-work-to-do-on-regulatory-reform-morning-news-bulletin-8-august-2025/kq2hruy7f",
    "title": "Jim Chalmers says government has more work to do on regulatory reform | Morning News Bulletin 8 August 2025",
    "publish_date": "Thu, 7 Aug 2025 20:30:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nTreasurer Jim Chalmers says the government has more work to do on regulatory reform\n\nYoung Australians urge government to set bold 2035 climate target\n\nRookie Tane Edmed not surprised he's been picked for the Wallabies\n\nFederal Treasurer Jim Chalmers admits the government has more work to do on regulatory reform, as the Productivity Commission releases its interim report on potential reforms to National Competition Policy.\n\n\n\n\n\nIt's found aligning Australian standards with international and overseas standards could provide an economic boosts of between 1.9 and 3.8 billion dollars per year.\n\n\n\n\n\nAnd it's found greater labour mobility for high-risk licensed occupations could be worth up to 846 million dollars per year.\n\n\n\n\n\nDr Chalmers says reform in these areas would ease burdens on business.\n\n\n\n\n\nThe government will hold a conference on reforms later this month.\n\n\n\n\n\n**\n\n\n\n\n\nClimate change activists say the federal government has to take into account the concerns of young people when setting its 2035 emissions reduction target.\n\n\n\n\n\nA national poll by YouGov, commissioned by activist groups the Climate Council and the Climate Action Network, has found 61 per cent of people want the government to do more on climate change.\n\n\n\n\n\nClimate Council Chief Executive Amanda McKenzie says support for action is particularly strong amongst younger people.\n\n\n\n\n\n\"We know that Australia's largest voting bloc- millennial and Gen Z - are concerned about climate chance. And, again, this shows up in this polling, where almost three-quarters of Gen Z voters expect the government to set a strong 2035 target.\"\n\n\n\n\n\nMillenials are generally defined as those born between 1981 and 1996, whilst Gen Z are those born between 1997 and 2012.\n\n\n\n\n\nThe government is required to set a 2035 emissions reduction target by the UN in the coming months, with activists urging that target to be 60 per cent or more.\n\n\n\n\n\n**\n\n\n\n\n\nA new report has found up to a third of schools in Queensland are in poor condition.\n\n\n\n\n\nThe Department of Education's Comprehensive Review of Infrastructure Renewal report says there is a maintenance backlog which would cost an $441 million to address.\n\n\n\n\n\nIt has identified a number of concerns with unsafe infrastructure that includes rotting ceilings in some school buildings.\n\n\n\n\n\nEducation Minister John-Paul Langbroek has blamed the report's findings on the previous Labor government, saying it is evidence the party did not spend enough on schools during their term in office.\n\n\n\n\n\n\"This is a report that Labor commissioned because they knew there were issues. These were issues we had last time we were in government when we had a significant maintenance backlog. And it's clear they knew about the issue. And the report shows they under-invested in maintenance, and that's to the detriment of our teachers and students.\"\n\n\n\n\n\n**\n\n\n\n\n\nThe United Nations is warning any further escalation in Gaza would be catastrophic, as Israel’s Security Cabinet considers expanding military operations in areas not yet under its control.\n\n\n\n\n\nMore than 61,250 Palestinians have been killed since the war began nearly two years ago, according to Gaza’s Health Ministry.\n\n\n\n\n\nMost of the population is now displaced and facing extreme hunger.\n\n\n\n\n\nAt least 42 more Palestinians were reportedly killed on Thursday.\n\n\n\n\n\nPrime Minister Benjamin Netanyahu tells Fox News Israel intends to completely occupy Gaza to remove Hamas and install a new civilian government, a move still pending cabinet approval.\n\n\n\n\n\nUN spokesperson Farhan Haq says such an escalation would severely worsen the crisis.\n\n\n\n\n\n\"We have already made clear the fact that the occupation of the occupied territories cannot and must not continue. It is not accepted under international law. Regarding the comments, we'll have to see what actions the government takes, and we will respond accordingly. But we have already make clear our concerns that any expansion of the conflict will be catastrophic.\"\n\n\n\n\n\nThe UN also warned that delivering aid will become nearly impossible if the fighting expands further.\n\n\n\n\n\n**\n\n\n\n\n\nCambodia and Thailand have formally agreed to a ceasefire following border clashes that began on the 24th of July.\n\n\n\n\n\nThe deal was signed at an extraordinary General Border Committee (GBC) meeting in Kuala Lumpur, attended by officials from both nations and observers from China, Malaysia, and the US.\n\n\n\n\n\nThe agreement commits both sides to halt all forms of fire, maintain current troop positions, and avoid military build-ups.\n\n\n\n\n\nCaptured soldiers will be treated according to international humanitarian law.\n\n\n\n\n\nAn ASEAN observer team, led by Malaysia, will monitor the ceasefire, with temporary oversight by defence attaches from ASEAN states.\n\n\n\n\n\nThe two sides also pledged to keep communication lines open, hold a Regional Border Committee meeting within two weeks, and convene the next G-B-C session within a month.\n\n\n\n\n\n**\n\n\n\n\n\nIn rugby union, Tane Edmed says he's not surprised to have been picked in the Australian squad for the start of The Rugby Championship, despite recently being out of the team.\n\n\n\n\n\nWith first-choice fly-half Tom Lynagh out with a concussion, Edmed has been picked in the 35-man squad to travel to Johannesburg to play South Africa in their tournament-opening game on Sunday week.\n\n\n\n\n\nEdmed has never played a Test for the Wallabies, but says his contact with coach Joe Schmidt made him feel he was a chance to be chosen, despite a poor ending to his Super Rugby season for the ACT Brumbies, and his not being picked in the Australian squad that recently played the British and Irish Lions.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/court-hears-covert-recording-of-tv-star-matt-wright-allegedly-asking-friend-to-destroy-evidence/gqmezjme9",
    "title": "Court hears covert recording of TV star Matt Wright allegedly asking friend to destroy evidence",
    "publish_date": "Thu, 7 Aug 2025 10:22:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Court hears covert recording of TV star Matt Wright allegedly asking friend to destroy evidence\n\nPublished 7 August 2025, 9:04 am\n\nThe criminal trial of celebrity crocodile wrangler Matthew Wright has heard the TV star allegedly instructed a friend to destroy maintenance records of a helicopter, which was involved in a fatal crash three years ago. Wright's defence counsel today saying secret audio recordings of Mr Wight are 'extremely poor' while doubting the credibility of key witnesses. Matt Wright has pleaded not guilty to three counts of attempting to pervert the course of justice.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/video/new-study-suggests-social-media-adversely-impacts-brain-activity/ojqswi8x0",
    "title": "New study suggests social media adversely impacts brain activity",
    "publish_date": "Thu, 7 Aug 2025 10:14:12 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "New study suggests social media adversely impacts brain activity\n\nPublished 7 August 2025, 9:04 am\n\nA new study suggests using social media can cause crucial brain activity levels to slump within minutes. It found a measurable drop-off in cognition, emotion and focus after scrolling sessions, however experts warn more research is needed on the impact of screen time.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-effects-of-scrolling-social-media-on-your-brain/1f9kw8xqe",
    "title": "The effects of scrolling social media on your brain",
    "publish_date": "Thu, 7 Aug 2025 08:53:04 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\n\nScrolling social media is a guilty pleasure ... that can quickly spiral into distraction and people are certainly becoming more aware of it.\n\n\n\n\n\n\"Definitely scroll on Instagram way too frequently, way more than I need to, yeah it's in the back of my mind but I'm not super conscious about it.\"\n\n\n\n\n\n\"You just lose focus for even a second - you just go in there - it's like a doom scroll, you start doom scrolling for an hour or something, so you're just unproductive after that, that's it.\"\n\n\n\n\n\nIt's a new age challenge - with an impact that's yet to be fully understood .\n\n\n\n\n\nDr Alexandra Gaillard of Swinburne University says her new research sought to explore the effects of screen time on the brain.\n\n\n\n\n\n\"The main takeaways that our research really showed that time spent on social media may be a waste of resources for the brain can lead to decreased focus and increase in stress.\"\n\n\n\n\n\nThe research has found 18 to 25 year olds exposed to phone screens for just three minutes, experienced changes in mood, energy, tension, focus and happiness.\n\n\n\n\n\nThe pilot study of 27 people compared responses to gaming, television and social media on these devices.\n\n\n\n\n\nDr Gaillard said this tracked brain activity by using small electrodes that track oxygen levels.\n\n\n\n\n\n\"With social media there was the biggest increase in blood flow to those regions, but it doesn't actually get used - compared to something like gaming where a lot of blood goes to the region but it's actually used up, people engaging there's problem solving, they're doing things with that oxygen and that brain area.\"\n\n\n\n\n\nThe findings indicate even short periods of screen time can have measurable effects.\n\n\n\n\n\nBut Professor Michael Dezuanni of Queensland University of Technology says the full impact on young people is a nuanced and evolving field of research.\n\n\n\n\n\n\"We need to think about how social media can have negative impacts on young people, but when it comes to learning - we can't just have a kind of generalised view.\"\n\n\n\n\n\nFrom December the 10th, a federal government ban on under 16s accessing social media takes effect.Associate Professor Suzanne Schweizer of UNSW Sydney says it’s important efforts continue to better understand the impact of social media.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/ceo-series-amps-alexis-george-on-results-economy-ai-and-asx/v2h8lxzps",
    "title": "CEO SERIES: AMP's Alexis George on results, economy, AI and ASX",
    "publish_date": "Thu, 7 Aug 2025 08:16:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/health-experts-dismayed-by-rfk-jrs-defunding-of-vaccine-research/vqkys123d",
    "title": "Health experts dismayed by RFK Jr's defunding of vaccine research",
    "publish_date": "Thu, 7 Aug 2025 07:43:23 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"I've been in this business for 50 years and have seen many crises come and go, and I've seen many attempts by public health to address these kinds of situations. Never have I seen a more dangerous approach to responding to our vulnerability to infectious diseases than what happened yesterday.\"\n\n\n\n\n\nThat's Dr Michael Osterholm, director of the Center for Infectious Disease Research and Policy at the University of Minnesota.\n\n\n\n\n\nHe's responding to the announcement by US Health Secretary Robert F. Kennedy Junior that the Department of Health is cancelling US$500 million (A$769 million) in mRNA vaccine development.\n\n\n\n\n\nMr Kennedy says the health department's biomedical research agency, BARDA, has already begun its work terminating 22 mRNA projects.\n\n\n\n\n\n\"After reviewing the science and consulting top experts at NIH and FDA, HHS has determined that mRNA technology poses more risk than benefits for these respiratory viruses. That's why after extensive review, BARDA (the Biomedical Advanced Research and Development Authority) has begun the process of terminating these 22 contracts totalling just under $500 million.\"\n\n\n\n\n\nMr Kennedy claimed that mRNA vaccines do not protect against respiratory illnesses like COVID and the flu, and said the department would be favouring other types of vaccines in their place.\n\n\n\n\n\nDr Osterholm has joined experts in rejecting Mr Kennedy's claims about the effectiveness of mRNA as false and misleading.\n\n\n\n\n\n\"The piece yesterday that was absolutely devastating for those of us in public health to watch was the mis- and disinformation Secretary Kennedy shared. To talk about the fact that the risks outweighed the benefits of COVID vaccines or the whole mRNA technology was just absolutely irresponsible. That's just simply not true. No matter how many high times he says it, it's not true.\"\n\n\n\n\n\nmRNA vaccine technology was first used during the COVID-19 pandemic, but scientists have been researching mRNA for vaccine development for decades.\n\n\n\n\n\nThe technology differs to other vaccines in that it delivers instructions to our cells to make a protein identical to one found in a virus, which triggers our body's immune response.\n\n\n\n\n\nConsultant medical virologist at Public Health England, Dr Kevin Brown explains how it works.\n\n\n\n\n\n\"So the idea of an mRNA vaccine, is instead of actually using a virus to produce the antigen directly, the mRNA wrapped up in a lipid coat is injected into the body, goes into the cell, and the cell directly makes the protein from the mRNA. It's a really clever idea.\"\n\n\n\n\n\nExperts say the technology holds great promise for improving vaccines for viruses like influenza, because unlike traditional vaccines, it can be made within months and can be adapted quickly as viruses change.\n\n\n\n\n\nDr Osterholm says if an influenza pandemic were to break out globally, without mRNA technology, outdated vaccine approaches would only allow for around a fourth of the world to be vaccinated within the first 18 months.\n\n\n\n\n\n\"That would be a disastrous situation. mRNA technology applied into influenza vaccine could change that dramatically such that by the end of the first year, we could vaccinate the world. Now, all of that potential research and supportive information that we need is no longer gonna be collected here.\"\n\n\n\n\n\nSince February this year, when he took on the role of health secretary, Mr Kennedy has made a number of changes to how vaccines are regulated.\n\n\n\n\n\nIn May, he announced COVID-19 would no longer be included on the Centre for Disease Control and Prevention's list of recommended vaccines, and in June, he fired all members of a national committee that helps craft vaccine policy.\n\n\n\n\n\nAnd it's not the first cut to mRNA funding and contracts, with the Department of Health and Human Services in May revoking a nearly US$600 million contract to the drug maker Moderna to develop a vaccine against bird flu.\n\n\n\n\n\nDr Jeff Coller is a professor of RNA Biology and Therapeutics at Johns Hopkins University. He says the massive new cuts threaten vital progress in bird flu vaccine research.\n\n\n\n\n\n\"It's not a question of if bird flu will become a pandemic. It's a question of when. Maybe it's not this year, maybe it's not five years from now, maybe it's ten years from now. But we have to be prepared. We have to have technologies in place. And that doesn't mean that everything should be mRNA, that we should only invest into mRNA for the development of vaccines against bird flu. We should be looking at all modalities, you know, in an effort to combat an emerging pandemic.\"\n\n\n\n\n\nHe says this latest move will set the United States far behind other countries when it comes to vaccine research, but also future access to vaccines as well.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/article/greens-warn-of-food-price-increase-under-lazy-gst-pitch-paterson-labels-changes-brave/125fra07b",
    "title": "Greens warn of food price increase under 'lazy' GST pitch, Paterson labels plan 'brave'",
    "publish_date": "Thu, 7 Aug 2025 05:44:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Coalition and Greens have warned against raising the goods and services tax (GST), particularly a suggestion to remove current exemptions on essentials like fresh food.\n\n\n\n\n\nIndependent MP Kate Chaney told SBS News politicians should \"have some guts\" and lift the GST from 10 to 15 per cent, arguing Australians would be \"better off\", even if prices go up.\n\n\n\n\n\nThe GST increase pitch, drafted by economist Richard Holden, recommends scrapping exemptions on items such as food, childcare and health insurance but intends to offset some of the additional costs with an upfront payment or tax exemption.\n\n\n\n\n\nChaney released the modelling ahead of an economic round table summit on economic reform convened by Treasurer Jim Chalmers.\n\n\n\n\n\nGreens economic justice spokesperson Nick McKim labelled the proposed increase to fresh food and utilities, instead of increasing taxes on big corporations, as \"lazy\".\n\n\n\n\"Since the pandemic, the cost of essentials has skyrocketed, and the best idea the teals can come up with is to make food more expensive,\" McKim said in a statement.\n\n\n\n\n\n\"If we are serious about easing cost of living pressures, we should be making big corporations and the super wealthy pay their fair share of tax.\"\n\n\n\n\n\nMeanwhile, Opposition finance spokesperson James Paterson said it would be an \"incredibly brave government\" that would tax insurance or private education fees, which are exempt from the GST.\n\n\n\nOpposition finance spokesperson James Paterson has labelled a proposed GST increase as \"brave\". Source: AAP / Mick Tsikas \"The Howard government recognised that people who spend their money on private health or private education are actually taking a burden off the public purse, and therefore it would be unjust to tax them on top of that,\" Paterson told Sky News.\n\n\n\n\n\nPrime Minister Anthony Albanese refused to weigh in, stating, \"people are entitled to put forward their views\" ahead of Chalmers' productivity roundtable, to be held from 19 to 21 August.\n\n\n\n\n\nHere's what's being proposed and why it would impact your grocery bill.\n\n\n\nWhat changes are being proposed?\n\nChaney and Holden are proposing the GST be increased for the first time since its introduction by former prime minister John Howard, which came into effect in July 2000.\n\n\n\n\n\nCurrent exemptions on food, education, healthcare and childcare services, as well as water and sewage, would be removed under the proposal.\n\n\n\n\n\nFor items currently exempt, Holden expects a large portion of the 15 per cent to be passed onto the consumer, with smaller increases for goods already taxed under the GST.\n\n\n\n\n\nThe effect on low-income earners would be mitigated by one of two options under a GST-free threshold:\n\n\n\nProviding an annual $3,300 up-front payment to all Australians over 18 years old;\n\nOr exempting the GST on the first $22,000 in transactions when you swipe your registered debit or credit card at the checkout.\n\nThe Parliamentary Budget Office estimates the changes would generate an additional $23.8 billion in revenue, even after applying the GST-free threshold to all Australians.\n\n\n\nIndependent MP Kate Chaney argues the changes in revenue could be used to address bracket creep and inequality in the tax system. Source: AAP / Lukas Coch Chaney told SBS News this leaves potential to fund \"budget repair\" or reduce income taxes for higher income earners.\n\n\n\n\n\n\"We could actually decrease the marginal tax rate for the top two brackets by five percentage points, and index everybody's tax brackets going forward, and still have $10 billion left for budget repair without it disproportionately affecting low-income earners,\" she said.\n\n\n\n\n\nThe report suggests that the tax rates be reduced from 45 per cent to 40 per cent and from 37 per cent to 32.5 per cent, respectively, with the indexation future-proofing bracket creep — a term that describes a situation where income growth causes individuals to pay higher average income tax rates each year.\n\n\n\n\n\nA tax reform debate has been brewing ahead of the round table, with leaked documents last month showing Treasury has advised the government to raise taxes and cut spending after the election.\n\n\n\nHow will the changes impact social inequality?\n\nWhile Holden acknowledges the increase will be passed onto consumers, he said Australia's current system does damage to social equality.\n\n\n\n\n\n\"Australia has a very unusual tax system relative to other OECD economies. We get about twice as much of our revenue from income taxes and about half as much of our income from the GST compared to other advanced economies,\" he told SBS News.\n\n\n\n\n\n\"That has real implications, it hurts social mobility and damages intergenerational equity, because we're relying on income taxes from people of working age.\"\n\n\n\n\n\nBoth of which he thinks will be improved by the changes.\n\n\n\nCassandra Goldie, CEO of the Australian Council of Social Service, said a higher GST would undermine fairness, while doing nothing to improve economic efficiency.\n\n\n\n\n\n\"The extra revenue we need to fund care and community services, schools, and an income support system that protects people from poverty must come from those with the most capacity to pay — not those doing it the toughest,\" Goldie said.\n\n\n\n\n\nThe 2025 data found Australia's personal income tax rate was the fourth highest across OECD countries, at 25 per cent for a single adult with no children.\n\n\n\n\n\nBut Australia has one of the lowest overall \"tax wedges\" of all OECD countries, with Australians taking home almost 70 per cent of their gross wages when factoring total personal income and payroll taxes, as well as social security contributions, well above the OECD average of 65 per cent.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.theage.com.au/national/nsw/girl-6-discharged-twice-from-sydney-children-s-hospital-dies-of-flu-in-northern-beaches-hospital-20250807-p5mlb2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Happy, kind’ girl, 6, dies of flu after being discharged twice from Sydney hospital",
    "publish_date": "Fri, 08 Aug 2025 12:01:40 +1000",
    "category": "lifestyle",
    "authors": [
      "Kate Aubusson",
      "Penry Buckley"
    ],
    "text": "A young girl who died of influenza on the same day she was discharged twice from the Sydney Children’s Hospital has been described by her school as a “happy, kind and vivacious child”.\n\nAn investigation has been launched into the death of the six-year-old girl from Sydney’s northern beaches, who was brought to the Randwick hospital’s emergency department on Monday, where she was assessed and discharged.\n\nThe girl was discharged twice from Sydney Children’s Hospital at Randwick. Credit: Isabella Porras\n\nShe was brought back shortly after and diagnosed with influenza, before again being discharged with “at-home guidance”, a spokeswoman for the Sydney Children’s Hospital Network (SCHN) said.\n\nThe girl was then taken to Northern Beaches Hospital (NBH), where she later died, a hospital spokesperson confirmed.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/culture/music/water-cooler-chats-are-the-reason-we-go-to-work-but-who-s-really-listening-20250801-p5mjka.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Water-cooler chats are the reason we go to work. But who’s really listening?",
    "publish_date": "Fri, 08 Aug 2025 11:58:48 +1000",
    "category": "entertainment",
    "authors": [
      "Michael Dwyer"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size The line between hearing and listening turns out to be about halfway from the door to the water cooler. The conversation sounds from a distance like an overbearing man and a younger woman bickering, but as I get closer, my brain tunes to a more curious frequency. “I’m on a quest for inspiration,” the man’s voice proclaims. “Inspiration? Love that for you,” his co-worker replies eagerly. “What kind of stuff are you getting inspired by?” He stammers but she barges on. “Like, are you into art, music? Maybe you’re just, like, considering which experimental sound to get lost in next?” “They’re chatbots,” sound artist Monica Lim explains quietly at my shoulder. The conversing water coolers are Chit + Chat, her contribution to Listening Acts, a series of artworks exploring listening and technology curated by Chamber Made for this month’s Now or Never festival. Indicating my own listening technology (aka phone), I ask if it’s OK to record them. “Oh, wow, recording something? That sounds super-interesting,” the overexcited water cooler gushes. “Are you working on music? Or maybe a podcast or something?” A newspaper article, I tell the, uh, water cooler. “Oh, wow, a new small product? I totally get it!” She obviously doesn’t, which only makes her spookily reminiscent of other water-cooler conversationalists I’ve known. Bloke water cooler is still blathering pompously: his personality is uncannily real, too.\n\nAdvertisement\n\nThey’ve been programmed this way, Lim tells me. He’s into Bartok and existentialism. She’s all K-pop and Millennial-speak. Their voices have been “stolen” from two of her friends. Questions about empathy, ownership and surveillance swirl as they babble. “I’ll turn them off so we can talk,” Lim says. But are they still listening? That question is one of the easiest proposed by the mind-expanding Listening Acts program. Yes, is the likely answer, and so are Siri and Alexa and who knows what else. It was the first thing Lim thought of when Chamber Made asked her and eight other sound artists to create a work at the intersection of listening, technology and the body. “It started with the idea of surveillance; machines listening to us,” she says. “But then the more I worked with the chatbots, the more interesting it seemed to me to listen to them. This idea of the water-cooler conversation, we say that’s the important part of being at work … It’s that human connection. So it’s sort of symbolic of the workplace, but at the same time, we are being replaced so much by machines. Loading “I was thinking that not so far in the future, the water-cooler conversations will be machines just talking to themselves, or us talking to machines, and them listening to us and pretending to be human.” Whatever human means by then. The very idea is being tested in all kinds of ways as technology hijacks and directs and misdirects how and what we listen to in the age of machines.\n\nAdvertisement\n\nChit + Chat is just the foyer attraction. The other Listening Acts – six installations and three performances in all – have been commissioned to occupy conference rooms, bespoke booths and concert spaces throughout the Melbourne Recital Centre over three days. “We set this framing, a kind of provocation,” says Chamber Made curator Tamara Saulwick, “and invited a series of artists to come together. And of course, artists are these beautiful, unpredictable creatures who take ideas into areas you hadn’t anticipated.” The larger framing of the City of Melbourne’s Now or Never festival – now in its third year of “exploring art, ideas, sound and technology” – is a gift for an experimental arts company that has long pushed at the edges of sound, music and contemporary performance. Chamber Made’s Listening Acts is part of this year’s Now or Never festival. Saulwick’s own installation, with composer/musician Peter Knight, also delves into the unsettling idea of the human voice disassociated from the body by technology. Myself in That Moment uses splintered and digitised song and speech refracted through the same devices that mediate so much of our lives. “You come into a darkened space and approach multiple screens of 25 tablets in a grid,” she says. “We see a kind of portrait that becomes increasingly fractured … It becomes almost like a vortex, like you’re sitting inside a whirlpool of sound that moves around you.” The sound material comes from recordings of three singers using extended vocal techniques and intimate breath work. “There’s one section where it goes into these verbatim materials of them discussing what it means to be captured and recorded and disseminated; to be made digital.”\n\nAdvertisement\n\nAviva Endean’s Tactile Piece for Human Ears is a binaural soundscape shaped by wind currents, pipe tones and underwater vibrations. Elsewhere in the building, curious listeners might slip on headphones for Aviva Endean’s Tactile Piece for Human Ears, a binaural soundscape shaped by wind currents, pipe tones and underwater vibrations. Or lend an ear to echoes of the stolen generations via a motion-activated plait of hair in Anna Liebzeit’s With Ghosts: A Choreography of Presence. Alexandra Spence’s sounding forms/forming sounds is a meditative sound field of sine waves, Perspex and drums designed to be felt. Rebecca Bracewell’s Accordion without Organs loops an accordion through cassettes and amplifiers, each iteration veiling the last in layers of hiss. Thembi Soddell’s In Silence offers a one-on-one audiovisual experience grappling with intergenerational trauma and identity. Threaded throughout is a persistent invitation to slow down, take notice and feel the weight between sound and story. Memory, and the mysterious ways in which sound captures and conjures it, looms large. Loading In Cathedral Reverb, Hannah de Feyter invites one listener at a time into a darkened booth to experience a soundscape built entirely from the remnants of sound — reverb, echo, resonance, delay. Her work is a personalised echo, in turn, of American experimental composer Alvin Lucier’s I Am Sitting in a Room. “My first memory,” she says, “is the sound of my father singing this old hymn in a darkened room.” Playing with the ancient concept of mnemotechnics, she uses technology to construct a physical space for the memory to live in. “Because I grew up in the church, I’ve been experimenting with reverb presets that are all churches.”\n\nAdvertisement\n\nWith the reverb of infinite churches more or less in your phone now, how far off can time travel be? Machines are amazing, clearly, when they’re not disturbing or even terrifying. Heard from the doorway, the technology involved in Biddy Connor’s Song to the Cell – inspired by the sounds she heard from IV machines when she started chemotherapy in October 2020 – seems kind of forbidding. But again, leaning in to listen reveals miracles. Biddy Connor’s Song to the Cell is inspired by the sounds she heard from IV machines when she started chemotherapy in October 2020. “I call this one Gemini and this one Alaris,” she says, citing the brand names as she threads plastic tubes coursing with fluid through two IV machines. They click and beep, shuffle and bubble in a way that almost swings. “I’ve got hours and hours of recordings of the IV machines,” Connor says. “On that first day, it was hearing those sounds that helped me. I could hear the bass lines in there, and that distracted me in a good way.” Her song cycle takes its name from The Song of the Cell, the Siddhartha Mukherjee book that explores how our bodies are built and repaired. Its sound and intention owes something to the Cocteau Twins’ version of Song for the Siren, Connor says. She sings live with the machines – sometimes solo, sometimes in textural counterpoint – using effects and surround sound to create a kind of existential lullaby. These machine sounds are purely functional. But they are also deeply emotionally charged. “Probably because I’m a certain amount of time away from the treatment now, it doesn’t feel raw any more. But the alarms still give me a bit of anxiety,” she says with a laugh.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/politics/federal/trump-starts-fed-overhaul-with-small-step-to-the-right-the-big-leap-is-still-to-come-20250808-p5mlci.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump starts Fed overhaul with small step to the right. The big leap is still to come",
    "publish_date": "Fri, 08 Aug 2025 11:55:51 +1000",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "This year, he attacked the Fed (like his political master) for not cutting rates even though inflation is at the same level it was in 2024 when he was arguing against looser monetary policy. Someone in Trump’s orbit who doesn’t shift their position in line with the president’s doesn’t survive long. So, that Miran could vary his opinion about the Fed and its policy settings is not the least surprising. What is surprising, however, is Miran’s central role in the so-called Mar-a-Lago Accord. The Accord envisages that America’s enduring trade deficit has little to do with the demand of US consumers for cheap goods from other parts of the world. The deficit is due to an over-valued American dollar.\n\nIf major trading partners could be encouraged to increase the value of their currencies relative to the US dollar – as occurred in the mid-1980s when US allies, including Germany, Britain and France, agreed to help out America – then the deficit would evaporate. At the same time, the US would remain the globe’s reserve currency, which confers huge benefits to American consumers and businesses. In other words, the Accord envisages the world acting against its own interests to help the US. The world, however, has shifted since 1985 when the US accounted for 34 per cent of global economic activity (it’s now less than 20 per cent), Ronald Reagan was in the White House, and people were listening to Wham!’s Careless Whisper on vinyl. Miran’s plan for a currency accord dates back to 1985 - when George Michael and Andrew Ridgeley were ruling the charts. Credit: Netflix Germany and France, for instance, now share the euro. American government debt was just $US1.8 trillion (it’s now $US36 trillion and growing).\n\nLoading The currencies of the major trading nations are now largely dictated by investors rather than governments. The European Central Bank, the Bank of England, the Bank of Japan and others would cause huge problems for their economies if they were to intervene in currency markets to achieve Miran’s goals. And while Americans feared the rise of Japan in 1985, today the concern is China, which on some measures has an economy larger than the US. Miran, however, argued that if nations refused to hurt their economies as America demanded, the same outcome could be achieved by imposing tariffs. We’ve seen that. This week, Trump’s new tariff regime was put in place, taking America’s effective tariff rate to its highest since the Great Depression.\n\nAccording to Miran, a second Trump administration would “take steps to ensure large structural changes to the international tax code occur in ways that are minimally disruptive to markets and the economy”. The fallout from liberation day, when Trump effectively backtracked on his tariff plans, given a huge sell-off on equity and bond markets, must have come as a surprise to Miran. What also must be surprising to Miran is the clear slowdown in the US economy over recent months since the tariff announcement. Trump sacked the head of the Bureau of Labor Statistics, Erika McEntarfer, last week because job numbers confirmed the economy was struggling. It’s unclear who he will sack after data overnight showed the number of people applying for unemployment benefits climbing to its highest level since November 2021. Miran, if confirmed by the Senate, will most likely only be on the Fed until early next year (he is taking over the remainder of the term of Adriana Kugler, who unexpectedly resigned last week). He won’t have the same troubles as Shelton and other people Trump sought to install on the Fed during his first term.\n\nLoading Unlike the issues created by Trump’s move against McEntarfer, the appointment of Miran is relatively sound. The bigger issue is who will replace Powell, whose term as chair ends in May (though he can remain on the Fed board until 2028). Bloomberg News overnight reported that Chris Waller – one of two board members to vote in favour of a rate cut at the Fed’s July meeting – is the frontrunner to replace Powell. The operating theory out of Washington is that Miran holds his position until the start of the year when Trump names Waller to succeed Powell. Waller then “shadows” Powell until the current chairman gives way to the new one.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/evidence-withheld-from-erin-patterson-trial-revealed-20250808-p5mlfy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Evidence withheld from Erin Patterson trial revealed",
    "publish_date": "Fri, 08 Aug 2025 11:55:17 +1000",
    "category": "finance",
    "authors": [],
    "text": "Evidence withheld from Erin Patterson trial revealed\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/10-creamy-cheesy-pasta-dishes-to-make-this-weekend-starring-recipetin-s-golden-bake-20250808-p5mlfc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "10 creamy, cheesy pasta dishes to make this weekend (starring RecipeTin Eats’ golden bake)",
    "publish_date": "Fri, 08 Aug 2025 11:54:32 +1000",
    "category": "finance",
    "authors": [],
    "text": "Recipe collection\n\n10 creamy, cheesy pasta dishes to make this weekend (starring RecipeTin Eats’ golden bake)\n\nEnjoy winter while you still can with these indulgent comfort food classics to keep you warm inside and out.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/culture/movies/star-of-troubled-film-the-deb-claims-rebel-wilson-defamed-her-20250808-p5mlcl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Star of troubled film The Deb claims Rebel Wilson defamed her",
    "publish_date": "Fri, 08 Aug 2025 11:53:04 +1000",
    "category": "entertainment",
    "authors": [
      "Garry Maddox"
    ],
    "text": "One of the stars of the troubled Australian film The Deb has claimed that Rebel Wilson defamed her in a series of social media posts, including that she changed her story about being sexually harassed by a producer after being cast in another production and given a record deal.\n\nThe lawyer for Charlotte MacInnes has issued Wilson, who directed and acts in the musical comedy, with a concerns notice alleging a series of Instagram posts damaged her reputation.\n\nAt the party to launch the forthcoming shoot of The Deb at the 2023 Cannes Film Festival, from left, Natalie Abbott, Rebel Wilson, Charlotte MacInnes and Stevie Jean. Credit: Dave Benett/Getty Images for Warner Music\n\nThe first stage of defamation proceedings, the concerns notice adds to the legal turmoil around The Deb, which had a world premiere at the Toronto International Film Festival last year but is yet to be released.\n\nThe claims include that Wilson defamed MacInnes, who plays one of two teenagers who attend a debutant ball in a country town, by saying she lied by denying making a complaint about unwanted sexual advances by producer Amanda Ghost while making the film.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/world/north-america/jalapenos-in-sauvignon-blanc-it-might-be-the-next-drink-of-the-summer-20250729-p5miiz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jalapenos in sauvignon blanc? It might be the next drink of the summer",
    "publish_date": "Fri, 08 Aug 2025 11:45:00 +1000",
    "category": "finance",
    "authors": [
      "Michael Koziol"
    ],
    "text": "New York: A funny thing started happening in New York City bars a couple of months ago. Drinkers began ordering glasses of sauvignon blanc – with jalapeno slices in them.\n\n“I know it’s a trend,” says bartender John Murphy, who remains a little perplexed by the whole thing. “It started with rosé. And now it’s moved to sauvignon blanc. It’s one of those things that’s just taking off.”\n\nBartender John Murphy mixes sauvignon blanc with jalapenos at his bar, Automatic Slim’s, in New York City. Credit: Ying Xiang Tan\n\nOn a recent Thursday afternoon, Murphy mixed three types of the drink – one with frozen jalapeno slices, one freshly cut and one with the slices muddled into the drink with a pestle – for this masthead to taste at his West Village bar, Automatic Slim’s.\n\nLike so many of today’s trends, this one took off on TikTok. You can find videos of people pouring white wine over jalapeno slices years ago, but it was only this year that it developed into a full-blown thing, helped along by a slew of influencers jumping on board.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/lifestyle/fashion/hats-at-dawn-sydney-and-melbourne-battle-for-racing-fashion-supremacy-20250805-p5mkef.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hats at dawn: Sydney and Melbourne battle for racing fashion supremacy",
    "publish_date": "Fri, 08 Aug 2025 11:43:35 +1000",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "The horse-racing wars between Melbourne and Sydney’s spring carnivals have begun and the weapons of choice are hats, ties and dresses rather than riding crops – unless they match your outfit.\n\nFormal fashion competitions are returning to the Sydney Spring Carnival after a near two-year absence, hot on the Jimmy Choo heels of the announcement by the Australian Turf Club of a $7 million trackside hospitality facility at Royal Randwick in Sydney called Base Camp, challenging the Birdcage at Flemington Racecourse in Melbourne.\n\nYou can’t have a rival birdcage without feathers, even if they’re sticking out of hats.\n\nRacing fashion expert Laura Dundovic in Mariam Seddiq and Stacey Hemera millinery with ATC member Duncan James in MJ Bale with Tash at Royal Randwick. Credit: Steven Siewert\n\n“Fashion is officially back on track,” says Donna Forbes, head of commercial at the ATC. “There was strong demand for the competition’s return from our loyal racing enthusiasts, racegoers and members of the public.”",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/how-eddie-jones-could-derail-the-wallabies-world-cup-chances-again-20250805-p5mkfx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How Eddie Jones could derail the Wallabies’ World Cup chances again",
    "publish_date": "Fri, 08 Aug 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Jonathan Drennan"
    ],
    "text": "The good news is that the Wallabies are sixth place in the rankings, but the bad news is they are barely hanging on. There is a mere 0.3 of a ranking point between Australia and Argentina. Scotland are also close, with just 0.51 points separating them from the Wallabies. The Wallabies’ narrow win against Fiji in June wasn’t just a valuable warm-up ahead of the Lions, it turned out to be extremely valuable on the road to the World Cup. How the ranking system works\n\nAhead of a busy schedule, it is essential to have a basic grasp of how World Rugby calculates its ranking points. Broken down into simple terms, there are some key principles. In each Test, there is a points exchange, where one team generally takes points and the other team loses points. The rankings gap plays a major role in how many points can be won or lost by a team, but the greater the gap, the more points can be lost. Conversely, a win against teams ranked far below, for example, the Wallabies beating Japan, will not carry many ranking points. Home advantage is factored in by World Rugby and a team will win more ranking points for an away victory. If a team wins by fewer than 15 points, they will earn fewer ranking points than a win over 15 points.\n\nWill Skelton celebrates with fans after the third Test against the British and Irish Lions Credit: Getty Images Importantly, a team can move up or down in the rankings without playing a game. Hypothetically, if Argentina get some major results against the likes of South Africa away in the Rugby Championship or against England in November, they can also potentially leapfrog the Wallabies. All of these factors go into an algorithm calculated by World Rugby after each Test match, recalculating the rankings. A free hit against the Boks The Wallabies face one of the hardest landings possible after the Lions series, a Test in the daunting Springbok coliseum of Ellis Park in Johannesburg, followed by another tough battle in Cape Town.\n\nSouth Africa are ranked number one in the rankings, five places above the Wallabies. The two Tests present a high reward with little risk in terms of ranking points. The Wallabies are playing away, which means that if they can secure even a narrow win, it will carry up to two ranking points, providing a precious cushion ahead of a gruelling calendar of Tests. A loss against the world champions would also cause minimal damage to rankings, as the algorithm has essentially priced in two Wallabies losses. The Wallabies last beat South Africa in 2011 in Durban, but a win in Cape Town is not beyond the realm of possibilities and would provide a huge cushion in the quest for a favourable World Cup draw.\n\nCry for me, Argentina The next two Tests in Townsville and Sydney against Argentina are arguably the most important of the year for the Wallabies. The Pumas are a direct threat to the Wallabies’ hold on sixth place in the rankings. A weakened Argentina team beat the Lions in Dublin, reminding every one of their talent. Given the home advantage handicap, the Wallabies stand to lose more than they can gain in ranking points. Max Jorgensen of the Wallabies runs with the ball against the British and Irish Lions in Sydney Credit: Getty Images\n\nIf the Wallabies stay in sixth and Argentina stay in seventh in the rankings, any loss would likely leave Australia in an extremely precarious position. It is far easier said than done, but the Wallabies must target two wins against the Pumas. New Zealand showdown in WA The Wallabies play New Zealand first in Auckland and then in Perth. Given the last time the All Blacks were beaten at Eden Park was 1994 against France, the Test at Optus Stadium will likely be a target for the Wallabies. Regardless of the home advantage, given New Zealand are currently second in the rankings, a victory for the Wallabies would still carry major ranking points, with a win under 15 points likely to earn 1.70 or over, bringing in 2.55 according to current calculations. Similarly to the Springboks, any shock victory would be a huge bonus, particularly if they fall to the Pumas.\n\nThe return of Eddie The Wallabies arrive in Japan and see a familiar face in Eddie Jones. There would be quite some irony if the man in charge of the Wallabies’ disastrous World Cup in 2023 completely torpedoed their chances of having a favourable draw in 2027. The Test against Japan in Tokyo provides the biggest banana skin possible, with almost no reward, given the gulf in ranking between the two teams. A win over 15 points based on current rankings (Japan are 14th), would net the Wallabies just 0.48 points. A loss under 15 points, would cost the Wallabies 1.68 ranking points. Jones will be plotting a surprise, and it could completely demolish the Wallabies’ carefully laid plans. Eddie Jones could come back to haunt the Wallabies again Credit: Dominic Lorrimer\n\nThe cold reality of the spring tour The Wallabies face England, Italy, Ireland and France in November, with each Test presenting unique challenges. Loading A loss to Italy in 2022 ultimately cost Dave Rennie the Wallabies job; if they lost in 2025, it would do significant damage to their ranking points, but nothing like as badly as Japan. It is still an essential win that is needed. Any win against Ireland, France or England under 15 points could carry up to two ranking points, which would be vital if there are any slip-ups against the likes of Argentina earlier.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/why-the-bulldogs-are-swinging-in-the-rain-20250805-p5mkkp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why the Bulldogs are swinging (and missing) in the rain",
    "publish_date": "Fri, 08 Aug 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Last Sunday’s scenes against the Tigers mostly centred on Bulldogs recruit Lachie Galvin losing against his former club. How Jarome Luai gave Galvin a facial and verbal spray. How the Tigers celebrated with the Arabic middle finger. And how everyone in rugby league was (eventually) introduced to the word, “khawd”, not to mention the various ways it is pronounced. For a large number of Bulldogs fans, they would have been more concerned their team had failed to get the job done again on a heavy playing surface. Maybe it is nothing more than a case of playing poorly on three separate occasions against sides who wanted it more? The Dogs have completed at an average of 82 per cent this year, but that number dips to 69 per cent when you look at the three defeats in the slush. Immortal Andrew Johns, said when asked about Canterbury and their wet-track record this week: “I think it’s because they rely on a lot of set plays. And when you do those set plays in the wet, it’s hard to transfer the ball quickly, laterally, which means they are not putting pressure on key defenders to make a bad decision.”\n\nJohns said Penrith also used to struggle in the slippery conditions because of the reliance on set plays, and recalled some of their classic defeats, including the World Club Challenge against St Helens, and shock loss to the Wests Tigers one dreary Saturday night in Bathurst a couple of years ago. This masthead asked several current and former players, commentators and coaches to give their own thoughts on what it is the Dogs are doing – or not doing – in the wet and wild conditions. Bailey Hayward passes the ball in driving rain against the Broncos. Credit: NRL Images Everyone knows the Dogs have a smaller but mobile pack, how they pride themselves on getting three and four players into tackles, and having excellent line-speed in defence. When they hunt in numbers, they put pressure on the opposition, and make it difficult for any side to roll down field and build momentum.\n\nOn a slippery surface, however, the Dogs have needed to slow it down, or accept they risk getting wrong-footed and slipping over if they shoot out of the line too quickly. Because the Dogs have to hang back that split second, teams have been able to move up field a little easier, and get themselves into the situation where they can isolate defenders. As the rain bucketed down at Suncorp Stadium on a Friday night back in April, the Broncos knew the Bulldogs pack would find it harder to move sideways and rush up in defence. The likes of Payne Haas and Pat Carrigan and Xavier Willison are much bigger than Max King, Josh Curran and Jaeman Salmon, so the simple game plan was to play through the middle – and often. Halfback Adam Reynolds then had all the time in the world to work out what attacking kicks to pull out of his trick bag, which included a couple of chips for winger Deine Mariner to score in the right corner. Reynolds also took the opportunity to kick early and kick to the corner. Bulldogs chief Phil Gould used to always tell his players, “it’s easier to defend down their end than attack out of your own end”, which became an even more important rule in the wet, and one the Broncos executed beautifully.\n\nThe Dolphins clash in awful weather at Accor Stadium during the Origin period featured a Canterbury team that was missing nearly a dozen players through injury, suspension or Origin duty. But the Dolphins threw plenty of short passes, spent a lot of time charging up the centre of the park, and Isaiya Katoa produced a classy short kicking game. Splish splash: The Dogs have lost all three games on a boggy playing surface. Credit: NRL Images Some of his kicks made it a rare off night for Connor Tracey, arguably the Dogs’ best player this year whose absence was sorely missed against the Tigers last weekend, and will be in the coming weeks. Tigers No. 1 Jahream Bula said coach Benji Marshall pulled the spine aside last weekend when it became clear CommBank Stadium was going to be a mudheap. “We discussed how we wanted to play, which was away from the sideline, and with a lot of ‘drop plays’, which is basically dropping a player back underneath you to come back through the middle,” Bula said.\n\n“The Dogs forwards chase hard and like to put a lot of pressure on the ball player. Those drop plays help with holding them up. They have to take the drop player in a one-on-one tackle. “We also wanted to look for early kicks,” Bula said. Adam Doueihi kicked a few times on the fourth tackle from inside his own 40m. Canterbury hooker Reed Mahoney did it once, while Bailey Hayward had the right idea on another occasion in the second half, only to shank it. Storm legend Cameron Smith was the best when kicking early in the wet, and Mahoney and Hayward need to be doing just that if conditions deteriorate against the Warriors. They are both good kickers. Performing in the wet can become a psychological thing. Ask any horse trainer, who have the luxury of scratching their horses from a race if the track becomes worse because of the rain, or is what they call “downgraded”.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/old-man-shouting-at-well-just-about-everything-20250808-p5mlcd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Old man shouting at … well, just about everything",
    "publish_date": "Fri, 08 Aug 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Malcolm Knox"
    ],
    "text": "Bellamy and the rest of us old grumps - are we killjoys? But there’s so little joy to kill. I’ve seen one decent post-try celebration this year, when Daly Cherry-Evans picked up a corner post and used it as a crutch, making light of the criticism that he’s an old man. It was funny enough, but it didn’t impress those of his teammates who were ignoring him and walking back for the restart. Too clever by half, maybe.\n\nWhile the NRL deals with post-try celebrations, can it also do something about pre-try celebrations? These happen when an opposing player has fluffed a play-the-ball or spilt the pill in a tackle, and everyone in the defending team throws somersaults, high-fives and khawds as if they’ve won the premiership. It’s when the referee blows a penalty, and the favoured team runs around chest-bumping like they’ve done something. It’s even worse in rugby union: the Wallabies woke me from my doze during the Lions series when they were suddenly partying like it was 1999. Had they defeated the mighty Lions? No, they’d won a scrum feed.\n\nLoading\n\nThen there’s the barrage of music. Over in the AFL, Geelong’s multi-premiership-winning coach Chris Scott asked himself what would be the one thing he would change in the game. Salary cap auditing? Don’t think so. Umpiring? Nup. What he would change is the music they play after goals are scored. Not change it for better music. Any music to celebrate, he said, “is not my thing at all”. Who can argue? You’ve already been beaten into submission by Sweet Caroline. Has the celebratory moment become so empty and soulless that it needs to be filled with … with something, anything, as long as it’s louder than cheering?\n\nWe all know where it’s come from, and here’s where a prime ministerial intervention is due. Anthony Albanese has declared that Australians do things the Australian way, and especially not (Excuse me while I kkkhhhawd!) the American way. We are patriots. He can start our patriotic progress by cleaning up rugby league, which has adopted these embarrassing theatrics from the NFL, where the simple enjoyment of a touchdown as touchdown is as insufficient as having three no-alcohol beers and expecting to fall on your face. In the NFL, a touchdown is merely the curtain-raiser for a Broadway show. The NFL is what our NRL players watch, NFL stars are who they idolise, and if they can’t achieve $100 million contracts, then they can at least celebrate their scores like people who do.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/want-to-give-great-advice-to-your-loved-ones-try-these-three-words-20250807-p5mla3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Want to give great advice to your loved ones? Try these three words",
    "publish_date": "Fri, 08 Aug 2025 11:35:00 +1000",
    "category": "lifestyle",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "While I’ve really been enjoying all those social media snaps of you jammy bastards in Europe over winter – none of us have been to Italy before or seen captions like “La dolce vita” on “candid” laughing-while-walking down a lane photos, so cheers – somehow, who knows why, I’ve been avoiding looking at my feeds.\n\nThings like cleaning out the third drawer down, having the dog’s anal glands checked and watching And Just Like That... without being stoned seemed preferable to bearing witness for the zillionth time to the exploits of ye holidaymakers.\n\nThe three-word advice challenge is taking off on social media. Credit: Getty Images\n\nBut eventually curiosity slash masochism won. Did a quick scroll with one eye closed to block out boats or floral baskets at UK pubs. And found an absolute banger post.\n\nAlong with my previously mentioned passion for Dr Pimple Popper videos and posts from Bicheno Stories, I really like a Facebook account called Memory Lane – Growing Up in Australia.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/property/news/no-mortgage-needed-ceo-buys-41m-kirribilli-trophy-home-in-cash-20250804-p5mk7t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "No mortgage needed: CEO buys $41m Kirribilli trophy home in cash",
    "publish_date": "Fri, 08 Aug 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Tawar Razaghi"
    ],
    "text": "Former MCoBeauty director Anthony Sullivan has bought a newly built waterfront home in Kirribilli for $41 million in cash, smashing the suburb record by more than double.\n\nThe ex-husband of MCoBeauty founder Shelley Sullivan has emerged as the buyer of the trophy home after public records revealed the property had settled in his name.\n\nThe view from Anthony Sullivan’s Kirribilli waterfront prior to its renovation. Credit:\n\nThe 49-year-old was, until January, a director of the wildly successful beauty brand that his former wife, an entrepreneur, created in 2020.\n\nIt is renowned for making cheaper versions of popular products, or dupes (short for duplicates). Among the company’s strengths is its speed: it replicates big-name cosmetic and skincare products at an affordable price, then sells them in supermarkets and chemists where they can hit shelves within eight weeks of an idea starting.",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/national/sydney-s-answer-to-the-birdcage-base-camp-aims-to-take-the-everest-to-next-level-20250807-p5ml1v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney’s $7m bid to steal the trackside glitz and glamour from Melbourne",
    "publish_date": "Fri, 08 Aug 2025 11:27:52 +1000",
    "category": "sports",
    "authors": [
      "Chris Barrett"
    ],
    "text": "Sydney is taking its racing rivalry with Melbourne off the track with a new Everest-themed version of Flemington’s Birdcage at Royal Randwick.\n\nThe exclusive Melbourne Cup carnival enclosure has long been a drawcard for big business and stars of the television, film, music and fashion industries.\n\nRacing NSW hopes its Birdcage-like facility will attract names of the calibre of Elizabeth Hurley (left), who attended last year’s Melbourne Cup carnival. Credit: Michael Howard\n\nBut having challenged the southern state’s traditional foothold in the spring with the $20 million slot race, The Everest, Sydney plans to give Melbourne a run for its money in rolling out the red carpet.\n\nThe Peter V’landys-led Racing NSW has struck a deal with the Australian Turf Club, which owns the Randwick course, to set up Base Camp, a $7 million facility inspired by sport VIP hubs at the Formula 1 Australian Grand Prix and the Australian Open tennis in Melbourne and LIV Golf in Adelaide.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/goodfood/sydney-eating-out/three-blue-ducks-to-open-three-in-one-venue-in-southern-highlands-20250805-p5mklo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Three Blue Ducks to open three-in-one venue in Southern Highlands",
    "publish_date": "Fri, 08 Aug 2025 11:24:22 +1000",
    "category": "finance",
    "authors": [
      "Scott Bolles"
    ],
    "text": "Advertisement\n\nExclusive Eating outComing soon Three Blue Ducks to open three-in-one venue in Southern Highlands MasterChef judge and Ducks co-owner Andy Allen has confirmed a restaurant, bakery and produce store will operate on farmland run by billionaire Annie Cannon-Brookes. Scott Bolles August 8, 2025 Save Log in , register or subscribe to save articles for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThree Blue Ducks will transplant its successful Byron Bay “farm” formula to the Southern Highlands, inking a monster deal to open multiple venues on a working farm near Bowral linked to one of the richest people in the country. MasterChef judge and Three Blue Ducks co-owner Andy Allen confirmed a bakery and separate eat-in and takeaway produce store would open late this year, followed by an upmarket restaurant in early 2026. Three Blue Ducks co-owners Andy Allen (left) and Darren Robertson will transplant their concept and brand to the Southern Highlands of NSW. The farm-to-plate agritourism project has been brewing for months. The Herald caught whiff of a Southern Highlands deal when the Ducks crew was spotted moving around Bowral and at a nearby farm in Burradoo run by billionaire Annie Cannon-Brookes. Ranked 12th on the 2025 Australian Financial Review Rich List, Cannon-Brookes has a sizeable land holding in the area and philanthropic food intent. In June, the AFR revealed she had made a multimillion-dollar contribution to Stephanie Alexander’s Kitchen Garden Foundation. A purpose-built educational kitchen garden, run with the foundation, will operate on the same Burradoo property as the new Three Blue Ducks venues.\n\nAdvertisement\n\nThe deal is one of Cannon-Brookes’ first major philanthropic moves since her separation from Mike Cannon-Brookes, co-founder of software giant Atlassian. The venues will work directly with farmers onsite, and there will be an emphasis on ethically grown produce and sustainability. The Three Blue Ducks venture runs the restaurant, cafe and produce store at The Farm Byron Bay. Paul Harris The Burradoo farm is already producing beets, turnips and carrots. Allen said the aim was to expand the fruit and vegetable program and raise all the protein onsite for the produce store and restaurant. Pigs and cattle are already grazing on the farm, while lamb will be added in the new year. About 800 chickens are being introduced for eggs, with another 450 for meat. Various properties on the farm will be repurposed. A shed is being renovated as a produce store. Visitors will be able to grab an affordable meal at one of its 60 seats, while a cottage on the property has loftier ambitions.\n\nAdvertisement\n\n“This is the one where we can really show what we can do,” Allen said of the incoming upmarket restaurant. While proud of the “bloody tasty” food they already produce, Allen said the restaurant would put the Ducks back on the culinary map. “It will still have that rustic charm about it,” Allen said. But part of the decision to open a signature restaurant is driven by the restaurant experience already in place with the Three Blue Ducks team. Co-owner Darren Robertson, for instance, was once head chef at now-closed Sydney fine-diner Tetsuya’s. “Daz has that pedigree. I’ve been trying to prise it [the restaurant] out of him for years,” Allen said. Billionaire and philanthropist Annie Cannon-Brookes. Robertson said the 50-seat restaurant would have a “country, cottagey vibe”. The name is yet to be decided: “It will be Three Blue Ducks Burradoo, Three Blue Ducks Southern Highlands. Something like that.” As for the entire project, don’t expect it to follow the Byron moniker. “It won’t be called The Farm,” Robertson said.\n\nAdvertisement\n\nThe Southern Highlands lost the upmarket Biota restaurant during the pandemic, but Robertson is confident the area’s demographic and visitor numbers of more than 1 million a year will support a serious restaurant. There are some notable restaurants in the area, including Eschalot in Berrima and the chef’s-hatted Paste Australia in Mittagong, but high-profile restaurant launches have been few and far between in recent years. “There’s still room for a bit of growth here,” Robertson said. The bakery will turn out sourdough bread, and visitors to the produce store will be able to tuck into simple dishes such as cured meats or a “pork chop and salad”. Robertson said locals would also be able to grab essentials to take away. The success of the Ducks’ farm concept at Byron Bay has led to many approaches to recreate it elsewhere.\n\nAdvertisement\n\nThe success of the Ducks’ farm concept at Byron Bay had led to many approaches to recreate it elsewhere, Robertson said. Few, if any, of the projects got off the launchpad. In this case, it took something special to tempt the team, with the commitment of a fully integrated working farm and its location reeling them in. Allen recently visited Blue Hill at Stone Barns in New York state, and was impressed by the way the farm restaurant had responded to different challenges since it opened in 2004. There won’t be any grand announcements about a particular cuisine at the Three Blue Ducks restaurant, which will be a collaborative effort shared by the team. “We’ve never had a [single] cuisine – it will be that Three Blue Ducks style,” Allen said. “The produce will tell us where we’ll go.” The celebrity chef believes all the key ingredients to succeed are in place. “The only reason it won’t do well is if we don’t do it well,” he said. Related Article Review The Studio is a new wine bar and bakery that’s a must-visit in the Southern Highlands Related Article This regional post office may be home to the best burger in Australia\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/sport/afl/hollow-joy-no-contentment-for-voss-despite-backing-of-carlton-s-board-20250807-p5mlae.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Hollow joy’: No contentment for Voss despite backing of Carlton’s board",
    "publish_date": "Fri, 08 Aug 2025 11:23:06 +1000",
    "category": "sports",
    "authors": [
      "Jon Pierik"
    ],
    "text": "Voss had been under tremendous pressure as the Blues descended into a mess, with just seven wins, and no hope of playing finals.\n\nAt a marathon five-hour board meeting on Wednesday night, new chief executive Graham Wright recommended to club powerbrokers that Voss, 50, be allowed to complete this season, beginning against the Gold Coast Suns on Saturday night, and fulfil the final year of his contract.\n\nCarlton coach Michael Voss says he is ready to make the required changes to his game style after the Blues’ board opted to retain him for season 2026.\n\n“It sort of feels a little bit hollow joy in some ways. There is no contentment in how we have found ourselves here. And probably how it has played out, feeling like there is a contentment being able to get that reassurance that you get to see out your contract,” Voss said.\n\nLoading\n\n“But there is also gratitude and a privilege to be able to continue to lead this football club, and to be able to have that sense of direction, to be able to not just attack these last three weeks but what next season looks like.\n\n“Our eyes now come firmly fixed on what we need to be able to do next. The next thing we have in front of us is another game but what it does enable us to do is, at the right time, be able to think about how we progress this thing, and how we improve from where we are because, obviously, clearly, we want to be better.”\n\nThe Blues will now need to determine the future of Voss’ assistant coaches, and football department chief Brad Lloyd. Voss said he had not held any discussions about these roles.",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://au.news.yahoo.com/baby-dies-method-promoted-instagram-001136148.html",
    "title": "Baby dies in method promoted on Instagram",
    "publish_date": "2025-08-08T01:46:28Z",
    "category": "finance",
    "authors": [
      "Alexandra Feiam"
    ],
    "text": "A newborn baby died after her mother delivered her using a home birthing pool hired from “freebirth” Instagram influencer Emily Lal, a coroner has found. Picture: Instagram\n\nA newborn baby died after her mother delivered her using a home-birthing pool hired from “freebirth” Instagram influencer Emily Lal, a coroner has found.\n\nThe findings made in the Coroners Court of Victoria say it is “unlikely” the baby girl would have died had she been born in a hospital setting, or if the home birth had occurred with appropriate midwife support.\n\nThe mother, referred to as Ms E, gave birth to her child in December 2022.\n\nPrior to the birth, Ms E contacted Ms Lal – who operates as The Authentic Birthkeeper on Instagram – to rent a birthing pool to help deliver her baby.\n\nThe Melbourne-based influencer described herself as being “disillusioned with the medical system”, and held the “philosophy” that registered midwives were “complicit in, and contributing to, the harm of women”.\n\nADVERTISEMENT\n\nThere is no suggestion that Ms E chose the birthing method because of promotions made by Ms Lal.\n\nMelbourne ‘authentic birth keeper’ Emily Lal. Picture: Instagram\n\nThe coronial inquest found Ms E contacted the influencer to hire a birthing pool.\n\nAccording to the findings, Ms E said she kept in contact with Ms Lal “socially” but did not seek any service or advice from the influencer.\n\nHowever, Ms E said she requested to keep in contact with the influencer after the birth to “conduct a post-partum visit”.\n\nHalf an hour after Ms E gave birth to her child, she sent a message to Ms Lal saying “I did it”.\n\nShe was unable to deliver the placenta until the next morning.\n\nThe baby died a day after the home birth. Picture: Wikipedia\n\nThe morning following the birth, Ms E realised something was wrong with her baby.\n\nMs E sent a message to Ms Lal at about 8am saying, “We can’t wake her, we aren’t sure if she’s breathing,” with a picture of the baby, whose face had turned blue.\n\nADVERTISEMENT\n\nMs Lal didn’t see the message for 25 minutes, according to the inquest findings.\n\nUpon seeing the message, Ms Lal made a Facetime call and saw the baby girl. Believing her to be dead, she told Ms E and Mr E to call for an ambulance.\n\nParamedics noted the baby’s heartbeat was flatlining and attempted CPR for 30 minutes, but were unable to revive her.\n\nMs E was transported to the Mercy Women’s Hospital for treatment.\n\nThe coroner said the baby’s death may have been preventable. Source: Instagram\n\nForensic pathologist Yeliena Baber said had Ms E given birth in the hospital, preventive measures would have been put in place.\n\nDr Baber concluded: “If Baby E was born in hospital and Ms E had received appropriate\n\nantenatal care, it is highly unlikely that Baby E would have died, as she was a healthy baby\n\nand her death was caused by the prolonged delivery in a home birthing pool”.\n\nShe further noted if a trained midwife had been present during the homebirth and prolonged labour, it would be expected they would escalate care to a hospital if “it was clear that the baby was in distress”.\n\nADVERTISEMENT\n\nCoroner Catherine Fitzgerald found Baby E’s death may have been preventable.\n\nIn her findings, she said the baby’s death was “unlikely to have occurred if the birth occurred in a hospital setting” and may have been avoided if the “birth was a planned homebirth with appropriate midwife support”.\n\n“A homebirth is distinguished from a ‘freebirth’, which is when someone chooses to birth their baby without medical or midwifery assistance,” she said.\n\n“The publicly available information regarding water birth … are not directed at women intending to birth at home with no medical assistance or antenatal medical management.”\n\n“The single consultation with (Ms E’s GP) late in the pregnancy provided no real opportunity for education to be given regarding birth options.”\n\nMs Fitzgerald did not make any adverse findings against the baby’s parents or Ms Lal.\n\nMs Lal has been contacted by NewsWire for comment.",
    "source": "Yahoo",
    "cluster_id": 41
  }
]