[
  {
    "url": "https://www.9news.com.au/national/microplastics-in-soil-ending-up-in-human-organs-major-health-risks-australian-scientists-say/2be03055-3945-4abf-b665-49f4c1db1a53",
    "title": "Hidden menace turning farmland into 'plastic sink'",
    "publish_date": "Mon, 26 May 2025 00:22:04 +0000",
    "category": "lifestyle",
    "authors": [
      "May"
    ],
    "text": "Agricultural soils now hold 23 times the microplastics the world's oceans do – and humans could be gobbling them up.\n\nPerth's Murdoch University found in a peer-reviewed study that agricultural land was well head of ocean water when it came to playing ﻿host to the potentially dangerous plastics.\n\nThe evaluation also found that soil plastics might be exposed to up to 10,000 chemical additives, most of which were unregulated in agriculture.\n\nMicroplastics have been found in human bodies, and are linked to health issues. (Nine)\n\n\"These microplastics are turning food-producing land into a plastic sink,\" PhD candidate Joseph Boctor, who led the study, said.\n\nMicroplastics and nanoplastics have been detected in lettuce, wheat, and carrot crops through various means including plastic mulching, fertilisers, and even being dropped by clouds.\n\nThe study authors said this was \"particularly concerning\" when seen in the context of microplastics being found in human lungs, brains, hearts, blood, and even placentae.\n\nWheat is among the crops found to have contained microplastics. (iStock)\n\n﻿Many microplastics have been found to contain bisphenol-A (BPA), which has been linked to health conditions including prostate and brain issues in infants and foetuses, as well as blood pressure and heart disease.\n\nFood Standards Australia New Zealand says Australians have a very low, decreasing exposure to BPA.\n\nBut, Boctor claimed, \"BPA-free does not equal risk-free\".\n\n\"Replacement chemicals like BPF (bisphenol-F) and BPS (bisphenol-S) show comparable or greater endocrine-disrupting activity.\"\n\nBoctor said not only was government regulation slower than both scientific finding and industry use, but that the plastic industry lacked transparency around additives it produced.\n\n\"This makes the plastic crisis unchecked, and human health exposed,\" he said.\n\n\"This review tries to bring this creeping danger under the radar and shine a flashlight on regulators.\"\n\nMicroplastics have also been linked to carrots.\n\nAlongside endocrine disruptors, the review pinpointed other additives in soil such as Phthalates (linked to reproductive issues) and PBDEs (neurotoxic flame retardants).\n\nThese additives have been linked with neurodegenerative disease, the authors said, increased risks of stroke and heart attack and early death.\n\n\"These are not distant possibilities – they are unfolding within biological systems – silently and systematically,\" Boctor said.\n\nBoctor is among a number of researchers at the Bioplastics Innovation Hub, launched by the CSIRO and Murdoch University, working on the development of a \"green plastic\" that decomposes properly in soil and water.\n\n\"This review highlights the urgent need for coordinated scientific and regulatory efforts,\" Boctor said.\n\n\"Regulators, scientists and industry must collaborate to close the loopholes before plastic pollution further entrenches itself in the global food chain.\"\n\nThe research appeared in the journal Environmental Sciences Europe .﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/aldi-gas-heater-recalled-due-to-potential-safety-issue/742770e4-198c-49c4-b0ca-b52068f8d390",
    "title": "Aldi outdoor heater recalled over potential risk of serious injury",
    "publish_date": "Sun, 25 May 2025 21:43:34 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "An outdoor﻿ gas heater sold by Aldi at stores in multiple states and territories has been recalled over a potential safety issue.\n\nThe supermarket giant is urging anyone who purchased its Coolabah outdoor area gas heater between May 7 and May 9 to cease using it immediately and return it to an Aldi store for a full refund.\n\nA potential hazard is caused by excess gas which may ignite due to the ignition gas escaping from the cylinder compartment due to a lack of separation from the flame source﻿.\n\nREAD MORE: Two charged after shopping centre knife fight\n\nThe Aldi Coolabah outdoor heater is being recalled due to a potential safety hazard. (Supplied)\n\nThere is a risk of serious injury or death if the gas ignites and causes a fire.\n\nThe model number is SKYFSD-DSS6NW and can be found on the metal plate rating label.\n\nThe heater was sold at stores in NSW, Queensland, South Australia, Victoria, Western Australia and the ACT.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/nsw-wild-weather-heavy-rain-storms-lash-state-coast/479a95d4-8143-4e66-8faa-b85b901a578b",
    "title": "Locals return to clean out homes, shops all but swallowed by floods",
    "publish_date": "Sun, 25 May 2025 21:50:44 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "1 of 93 Attribution: Getty\n\nLinda Saundercock sits in her her flooded second-floor home at Glenthorne in Taree, Australia.\n\nAlthough floodwaters are still high in many places, and more showers have been forecast for the east coast early this week, many residents are beginning the clean-up process.﻿",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/one-phone-call-landed-nikola-with-a-36k-help-debt-shes-been-fighting-for-years-to-get-it-waived/37c73602-b320-4a16-a39e-f043e71a7a40",
    "title": "One phone call landed Nikola with a $36k debt. She didn't find out for years",
    "publish_date": "Sun, 25 May 2025 19:49:28 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "It was a cold call that came at a vulnerable time for Adelaide woman Nikola Cowin.\n\nBack in 2014, Cowin was an out-of-work student, studying a science degree at Flinders University.\n\nOn the other end of the line was a recruiter whose goal was to sign up as many students as possible to the now discredited and defunct tertiary training provider, Franklyn Scholar.\n\nREAD MORE: ﻿ Two charged after shopping centre knife fight\n\nNikola Cowin, pictured with her baby daughter and partner Matthew Smart, says she was unknowingly signed to a student loan by a misleading recruiter. (Supplied)\n\nCowin believes the recruiter obtained her number from one of the popular job websites she was using to apply for work, such as SEEK or CareerOne.\n\n\"They were targeting people who were pretty much jobless, which, looking back on it now, is rather dodgy,\" Cowin said.\n\nThe recruiter offered to sign Cowin up to an online business management course.\n\n\"They were saying it would increase my chances of being able to get work by having that knowledge under my belt,\" she said.\n\nCowin claims the recruiter told her the course was free.\n\n\"They were saying, 'It's government-funded, so there really isn't anything to lose',\" she said.\n\nLike thousands of other students, Cowin was signed up on the spot during that phone call.\n\nCowin said she was a little sceptical at first, and wondered whether the course was a scam, but she was quickly sent her email login and set up with a trainer.\n\n\"I didn't have any reason to really question it. I figured, if it was a scam, it was an elaborate scam,\" Cowin said.\n\nCowin spent the next two years completing the course, while also working on her university degree.\n\nIt wasn't until 2019, about five years after she was first signed up to the Franklyn Scholar course, that she got a nasty surprise.\n\n\"My best friend and I were talking about HECS debts, and I told her what mine was at and she said, 'You've only done a uni course, it shouldn't be that big',\" Cowin said.\n\nHaving not yet hit the income level where compulsory payments would kick in, Cowin had never thought too deeply about her study loans.\n\nAfter contacting her university and the tax office, Cowin was told she had a large debt from Franklyn Scholar, through the VET FEE-HELP (VFH) scheme.\n\nDue to yearly indexation being applied, that debt now amounts to $35,880.\n\nThe news left Cowin shocked and confused.\n\n\"I was thinking, hang on, I wasn't meant to be charged for that course. What's going on here?\" she said.\n\nCowin said she was especially puzzled about how Franklyn Scholar was able to process her debt through the VFH scheme, as she had not signed any forms.\n\nHaving previously gone through the process with Flinders University, Cowin said she knew she needed to sign a Commonwealth Assistance Form (CAF) to apply for the loan.\n\n\"I never signed anything. If there was a (CAF), it was fabricated,\" Cowin said.\n\n\"I started investigating Franklyn Scholar a bit more and found out that they no longer existed - that's when the saga began.\"\n\nFranklyn Scholar was deregistered by the Australian Skills Quality Authority in 2017 as part of a broader crackdown by the watchdog on training providers demonstrating inappropriate conduct.\n\n\"A period of rapid expansion in enrolments across the VET FEE-HELP sector from 2014 has been attributed in many cases to the inappropriate conduct of providers, who used aggressive marketing tactics, including offering inducements and 'free courses',\" a Department of Employment and Workplace Relations document , released last year under a Freedom of Information request by Cowin's partner, Matthew Smart, states.\n\nA Deloitte audit, commissioned by the department, found 86 per cent of Franklyn Scholar students had no online activity between July 2015 and May 2016, and many students had been enrolled without their knowledge.\n\nIn 2017, the Australian Competition and Consumer Commission (ACCC) took an education broker that recruited some students for Franklyn Scholar, among other tertiary education providers, to court.\n\nThe broker, Acquire Learning, was found by the Federal Court to have made unsolicited telephone calls to some job applicants for the purpose of enrolling them on the spot and engaged in \"misleading or deceptive conduct\".\n\nIn October 2019, the Department of Employment and Workplace Relations agreed to waive the FEE-HELP debts of students of Franklyn Scholar who had not completed their courses.\n\nCrucially, however, the debts would not be wiped for students like Cowin, who finished their course.\n\nCowin said the decision by the department was unfair and needed to be changed.\n\n\"It's a bit unfair to say that just because I finished it, I don't deserve a refund when I didn't know what was going on,\" she said.\n\n\"If I knew what was happening, or the charges that I was going to incur, I never would have finished it.\"\n\nCowin, with the help of her partner, Smart, has been fighting to get her debt waived for the past six years, first lodging a complaint with the VET Student Loan Ombudsman and then making an application to the Administrative Appeals Tribunal (AAT).\n\nBoth attempts were unsuccessful, as was her latest request to the Department of Finance to waive her debt.\n\nIn a decision made last month, the Department of Finance upheld Cowin's debt, dismissing her argument that she never signed any loan documents and was told the course was free.\n\nThe department cited findings from the 2016 Deloitte audit of 331 Franklyn Scholar students, which showed CAFs were found for around 95 per cent of cases.\n\nWhile an education department official had been unable to find Cowin's CAF, and Franklyn Scholar's liquidation made it difficult, if not impossible, for her to chase down a copy herself, that did not mean it didn't exist, the department concluded.\n\nThe department noted Cowin should have also received a Commonwealth Assistance Notice at the time, which included the details of her VFH debt, and this would have also made her aware she was signing up to a loan.\n\nHowever, Cowin said she did not received any such notice, which is typically sent by the education provider, either.\n\nThe decision over his partner's debt had come as a hard blow to both of them, Smart said, adding that it felt like the system had failed, leaving them with a large, unjust debt.\n\n\"It's obviously very frustrating. We're young parents now. We don't earn large salaries or anything. We just try and get by,\" he said.\n\n\"It just doesn't make sense. Nikola never signed any forms. Why would she sign up for a double diploma at twice the cost of her uni degree?\"\n\nRegulations require education providers to keep student records on file for seven years.\n\nSmart said the department ought to have take over Franklyn Scholar's record-keeping after the college was deregistered.\n\nA Department of Finance spokesperson told 9news.com.au waiving debts was a \"mechanism of last resort\".\n\n\"Each request is considered on its individual merits. There is no situation which creates an automatic entitlement to a waiver of debt.\"\n\nThe department could not specifically comment on Cowin's case due to privacy reasons, the spokesperson said.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/research-shows-liquid-gold-breast-milk-donations-can-save-lives/fd271c88-47f7-414c-9113-fb879120fd02",
    "title": "Oscar's mum says his life was saved by a service many don't know exists",
    "publish_date": "Sun, 25 May 2025 09:33:51 +0000",
    "category": "lifestyle",
    "authors": [
      "May"
    ],
    "text": "It has been described as \"liquid gold\" for premature babies and new research shows breast milk donations can halve the rate of a life-threatening disease.\n\nA mother who lost one of her newborn twins to an inflammatory bowel disease is speaking out for the first time since the heartbreaking ordeal.﻿\n\nOscar is a cherished twin brother who survived the many challenges that come with a high-risk pregnancy.\n\nIt has been described as \"liquid gold\" for premature babies and new research shows breast milk donations can halve the rate of a life-threatening disease.The disease claimed the life of new born twin Alfie McKenna with his mum speaking for the first time about their heartbreaking ordeal. (Nine)\n\nHe and his brother Alfie arrived into the world extremely early at 25 weeks and four days, each weighing less than one kilogram.\n\n\"It felt like a real blessing and we were very lucky to be having identical twins,\" Ashleigh McKenna said.\n\nThey grew stronger in intensive care until the sixth week when Alfie was struck down with necrotising enterocolitis, an inflammatory bowel disease.\n\n\"The next morning he required emergency surgery and he passed away shortly after the surgery,\" Mckenna said.\n\n\"There are really no words to describe the heartache and immense pain.\"\n\nBrother Oscar also had the condition but he responded to antibiotics.\n\nThe condition affects about one in 20 very preterm babies with a mortality rate as high as 50 per cent.\n\n\"Bacteria can translocate from the wall into the abdomen or into the blood causing significant infection,\" Canberra Neonatologist Dr Tejasvi Chaudhari said.\n\nNow there's new evidence that when a mum can't breastfeed due to illness or low supply the use of donated breast milk can cut the risk of infection by half.\n\nLifeblood milk research lead Dr Laura Klein, said similar research had been been published internationally.\n\n\"We're seeing that over the first three years after the Lifeblood milk service started, we're seeing a reduction in NEC by about a third,\" she said.\n\nREAD MORE: Search resumes for missing teenager in Queensland bush ﻿\n\nMargaret Broom, a neonatal research nurse at Canberra Hospital said it was \"wonderful\" to see \"something so simple can have such a huge effect\".\n\nLifeblood collects and carefully tests and processes the milk that's donated.\n\nIt launched the service six years ago, but a survey reveals there's little awareness among breastfeeding mums that it exists.\n\nOscar was saved by donations of blood and breast milk.\n\nHis mother wants others to know the impact of giving.\n\n\"That gave us the 48 previous days with Alfie and is a huge reason why Oscar is here today because they had a lot of donor milk,\" McKenna said.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/finance/property-prices-australia-following-reserve-bank-interest-rate-cut/b92710b5-d333-4285-8f97-5c7bd86db621",
    "title": "Think property prices are about to balloon after rate cut? It's complicated",
    "publish_date": "Sun, 25 May 2025 04:16:25 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "What do you get if you combine an interest rate cut – and the possibility ﻿for several more – with a crisis-level housing shortage?\n\nCommon sense would suggest the answer is obvious: a big spike in property prices.\n\nBut while they're expected to rise following the Reserve Bank's decision to reduce the cash rate to 3.85 per cent on Tuesday, a repeat of the stratospheric surges from a few years ago seems unlikely.\n\nProperty prices are expected to increase following the RBA's interest rate cut, but not as much as what was seen in previous years. (The Age/Luis Enrique Ascui)\n\n\"The upshot is that we would expect property prices to continue rising over 2025 but it is possible that they won't rise as strongly as they did in 2024,\" Cotality head of research Eliza Owen told 9news.com.au.\n\nInterest rates aren't the be-all and end-all for prices, particularly when you look away from Sydney and Melbourne.\n\n\"The reduction in interest rates historically has had the biggest impact on higher-end property markets on the east coast,\" Owen said.\n\n\"There's less of a correlation with property markets in Western Australia, Adelaide and parts of Queensland, potentially because they're more tied to things like commodities performance, for example, in WA.\n\n\"And so what we saw during interest rate rises is that Perth, Adelaide and Brisbane actually had really strong performance.\n\n\"There's no guarantee that they'll get back to that double-digit growth just because interest rates are falling now.\"\n\nNationally, property prices rose 5 per cent last year.\n\nOwen says something \"around that or a little bit less\" is on the cards this time around, while AMP forecasted last week that there would be a 3 per cent rise for the year. ﻿\n\nA more moderate increase will no doubt come as welcome news to Australians hoping to finally buy their first home in the near future﻿, but it shouldn't be mistaken for a sign the nation's housing market is getting to a point where it's no longer considered a crisis.\n\nJust a day after the RBA cut rates, the National Housing Supply and Affordability Council released its annual report on the state of the housing system.\n\nIt's bleak reading.\n\nWhile there were some silver linings – affordability is expected to stabilise﻿ and potentially even improve over the next four years, and social and affordable housing stock is increasing – the level of overall supply, the main culprit for rising unaffordability for buyers and renters, is in a poor state.\n\nAustralia isn't building anywhere near enough new homes to address the housing crisis. (Louie Douvis/AFR)\n\n\"The supply of new housing is near its lowest level in a decade,\" the report states.\n\n\"177,000 dwellings were completed in 2024, falling significantly short of underlying demand for housing, which was estimated at around 223,000 for the same period.\n\n\"This shortfall added to already significant unmet demand in the system.\"\n\nThe report also found that not only is Australia set to undershoot the federal government's mid-2029 goal of building 1.2 million new homes by some 262,000 dwellings, we're also on track to fail to meet underlying demand for new homes by 79,000.\n\nMarkets are expecting several more rate cuts by early next year, and the federal government's housing policy allowing buyers to purchase their first home with a 5 per cent deposit, which experts say will do little but push prices up further, starts in January.\n\nREAD MORE: Aussie billionaire to give away half of fortune ﻿\n\nThe Reserve Bank is expected to hand down several more rate cuts in the coming months. (AP/Mark Baker)\n\nOn top of low supply, that seems like the perfect storm for another price boom. So why ﻿aren't double-digit increases on the cards once again?\n\nOwen says soft economic outlooks, global uncertainty﻿ and normalising migration levels will all help keep a lid on prices.\n\nAnd ultimately, after years – and, indeed, decades – of surging costs, there's only so much Australians can afford to spend on housing.\n\n\"At the end of the day, you can only really have this ever-increasing demand if people can afford to get into the market,\" Owen says.\n\nWhat Sydney's record $750 weekly rent gets you around the country View Gallery\n\n\"And I think there is a scenario where the rate cuts provide a bit of a sugar hit for market values, but they'll ultimately be weighed down longer-term by affordability constraints and the potentially softer economic outlook.\n\n\"It's a mix of headwinds and tailwinds, and obviously it's difficult to know where all of those factors are going to land... but we would expect off the back of this mix of factors that home values would continue to rise.\"",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/drought-farmers-plead-for-help-in-south-australia/01e0125a-73f2-46f7-8a23-a5f757f8559a",
    "title": "'There's never been a drought like this': Farmers plead for help in South Australia",
    "publish_date": "Sat, 24 May 2025 22:00:05 +0000",
    "category": "finance",
    "authors": [
      "May"
    ],
    "text": "Farmers in South Australia are calling for more help amid a drought they say is the worst they've ever seen.\n\nCassie Oster says her family farm of more than 40 years in Peake, two hours from Adelaide , has been suffering for around 18 months.\n\nAnd while some funding help has been announced, she urged leaders to talk to farmers to see how they can better help.\n\nCassie Oster, centre, with Leigh Oster and Dale Farley on their farm in South Australia. (Supplied)\n\n﻿\"We just need people to understand that it's happening,\" she told 9news.com.au.\n\n\"There's never been a drought like this in South Australia.\n\n\"We've never, ever experienced this.\n\n\"It's never gone on for this long.\"\n\nShe says they have just had to make the tough choice to sell 1000 ewes, which will have an impact lasting for years.\n\nFor example, it means far fewer lambs to sell next year, after what has already been a tough few years with falling livestock prices.\n\nEven if it rains soon, the soil will be in no fit state to plant crops.﻿\n\n\"To come off the back of that bad year for livestock prices and straight into a year of drought and into another one, there's only so many emergency funds you can draw on,\" she said.\n\n\"One farmer put it so well. He said, 'To work for an entire year the same amount of hours that I did the year before, to be behind, is heartbreaking.'\"\n\nThe Bureau of Meteorology confirmed that since 2021, parts of agricultural regions of South Australia have seen record low rainfall compared with records as far back as 1900.\n\n﻿A $55 million package was announced last month by the SA government, on top of $14 million from November 2024.\n\nOster said while they were able to get some grants, they need leaders to understand what they are facing and allow more farmers to get more help.\n\n\"Why don't you just talk to us? Have a bit more community feedback and consultation,\" she said.\n\n\"We are the best ones to say, 'This would help, that would help'.\"\n\nWhile there is a petition to urge the state government to declare a drought to release cash, this is no longer the protocol.\n\nThe National Drought Agreement (NDA) says it instead aims to offer help based on need instead, rather than declaring droughts as happened in the past.\n\nW﻿ade Boughen runs family sheep farm Kamora Park Poll Merinos. (Facebook)\n\nW﻿ade Boughen's fields a few years ago, before drought hit. (Facebook)\n\nW﻿ade Boughen, who runs family sheep farm Kamora Park Poll Merinos, two hours east of Adelaide, started the petition and just wants more help.\n\n\"The amount of money they've issued doesn't really cover too much, we haven't got anything in relief,\" he told 9news.com.au.\n\n\"Without timely intervention, we risk irreversible damage.\"\n\nREAD MORE: How the drought crisis will affect your weekly shop ﻿\n\nSouth Australian Liberal MP Nicola Centofanti﻿, the opposition primary industries spokeswoman, said the relief package has \"missed the mark\".\n\nLast week, she read a letter from a farmer in state parliament, in which a farmer said a farming friend had taken his own life over the stress of the drought.﻿\n\n﻿\"There is too much red tape, too much time required to access help and lengthy waiting times for outcomes,\" she said.\n\nClare Scriven, South Australian minister for primary industries and regional development, said in a statement the $73 million drought support package has been \"designed in consultation with primary producers, farmers and key industries bodies\".\n\n\"I want to get the message out; drought declarations don't happen,\" she said.﻿\n\n\"There is an absolute need for people to reach out now because assistance is available.\"",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-26/ulan-coal-mine-expansion-approved-environmental-concerns/105327044",
    "title": "Country coal mine wins approval to dig extra 18.8 million tonnes",
    "publish_date": "Mon, 26 May 2025 01:17:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "One of Australia's largest coal mines has received approval to expand its operations despite the project's potential impacts on the environment and endangered native wildlife.\n\nThe Ulan Coal Mine near Mudgee in the New South Wales central west has been allowed by the state's planning department to increase its underground operation.\n\nIt will be able to extract a further 18.8 million tonnes of coal and extend the life span of the site by an additional two years until 2035.\n\nThe mine has approval to extract almost 330 million tonnes of ore over the next two decades.\n\nA spokesperson for Glencore Australia, the mine's owners, said the company welcomed the state planning department's decision.\n\n\"The modification will provide ongoing employment opportunities for people at Ulan Coal Complex,\" the spokesperson said.\n\nThere are concerns the expansion will impact endangered species. (Supplied: Glencore Australia)\n\nEnvironmental concerns\n\nThe Department of Climate Change, Energy, the Environment and Water had identified 21 native species that could suffer significant impacts as a result of the development, with 17 hectares of native vegetation to be cleared.\n\nBiodiversity assessment reports found the endangered koala, brush-tailed rocky wallaby and a number of microbats among the native species were likely to experience direct impacts on their habitat.\n\nMudgee District Environment Group president Rosemary Hadaway said the mine's expansion had become \"a death by a thousand cuts\".\n\n\"We are losing so much habitat, threatened species are listed within the proponent's own assessment,\" she said.\n\nRosemary Hadaway is concerned about the expansion's impact. (ABC News)\n\nSinking land\n\nThe existing and extended mining area contains rocky sandstone cliffs that have been identified as suitable habitat for threatened microbat species.\n\nMore than 630 hectares of land is expected to gradually sink in the surrounding area due to the project.\n\nThe large-eared pied bat is listed as endangered in New South Wales. (Flickr CC: Doug Beckers)\n\nSurveys found the large-eared pied bat and large bent-winged bat within the subsistence zone, which they used for roosting and breeding.\n\nThe report found subsidence-related rockfalls would impact breeding caves and roosting colonies, having an \"adverse impact\" on the endangered species.\n\n\"There's a breeding colony and that should receive maximum protection,\" Ms Hadaway said.\n\n\" Why do we have our wonderful animals listed for protection but then we don't do it? \"\n\nA condition of the approval will require Glencore Australia to introduce a \"comprehensive bat monitoring program\" and acquire offsets for predicted impacts on threatened microbat habitat.\n\nHowever, Ms Hadaway said offsetting the impact on the bat's habitat would not work.\n\nShe said they would have \"nowhere else to go\" due to their unique sandstone environment.\n\nA spokesperson for the Department of Planning, Housing and Infrastructure said Glencore Australia must identify any bat sites above mining areas, with the operations to be separately assessed and approved by the department prior to mining.\n\nConditions imposed\n\nThe NSW Department of Planning determination said the development's impacts on native wildlife could be \"avoided, managed and offset\".\n\nIt has imposed 13 conditions on the approval to mitigate impacts on biodiversity, water, greenhouse gas emissions and Aboriginal cultural heritage.\n\nResidents near the Ulan Coal Mine have reported numerous koalas living in the area. (Supplied: Mick Boller)\n\nMs Hadaway said there was no way the project could mitigate against its effect.\n\n\"Monitoring tells you when damage has occurred and that's beyond the point of no return,\" she said.\n\n\" There should never be permission for the damage to occur in the first place. \"\n\nThe assessment determined that emissions from the project would reflect less than 0.1 per cent of the state's greenhouse gas targets in 2030 and 2035.\n\nGlencore Australia will be required to prepare a Greenhouse Gas Mitigation Plan, in consultation with the Environment Protection Authority, within the next six months.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-26/default-market-offer-aer-electricity-price-rise/105336458",
    "title": "NSW to see largest power price rises as default rates revealed",
    "publish_date": "Mon, 26 May 2025 01:11:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Energy prices could lift anywhere from 0.5 per cent to 9.7 per cent in different parts of the national electricity grid, in figures released on Monday.\n\nThe Australian Energy Regulator (AER) released a default market offer — essentially a price safety net — which limits what retailers can charge customers in New South Wales, South-East Queensland and South Australia.\n\nThe prices are meant to protect customers who don't shop around, as well as provide consistency so that people can compare alternative retailers.\n\nThe offer takes into account issues like what customers can afford, the cost of the overall system, and the need for the different parts of it to make a profit.\n\nIn its report, the operator says the cost-of-living crisis has been among the top of its considerations.\n\n\" In setting (prices), one of these matters is electricity affordability, which remains a top cost-of-living issue for households and concern for small businesses and was raised by many stakeholders as part of this process. \"\n\nRegulator denies extra allowance for retailers\n\nTo help with the cost of living, despite pressure from energy retailers and generators, the operator did not impose a fee of $22 on residential customers and $26 on small businesses.\n\nThe so-called \"competition allowance\" helps profits.\n\n\"(But) due to sustained cost-of-living pressures as indicated by the sustained nature of elevated underlying inflation, (the offer) does not include the competition allowance,\" the AER noted in its determination.\n\nStill, prices will rise.\n\nThis is the final determination for Australia's most populous state, NSW, which will see the steepest price rises:\n\nCompared to last year, residential customers will see price increases of 8.5 per cent to 9.1 per cent.\n\nCustomers with controlled load — for example, metering for a specific device that can use off-peak power, like underfloor heating or off-peak hot water — will see price increases of 8.3 per cent to 9.7 per cent.\n\nSmall business customers will see increases of 7.9 per cent to 8.5 per cent.\n\nThe offer also covers South-East Queensland:\n\nResidential customers without controlled load will see price increases of 3.7 per cent.\n\nCustomers with controlled load will see price increases of 0.5 per cent, which is 1.9 per cent below forecast inflation.\n\nSmall business customers will see increases of 0.8 per cent.\n\nThe AER's determination also covers South Australia, which will see price changes between the other two states:\n\nResidential customers without controlled load will see price increases of 3.2 per cent.\n\nCustomers with controlled load will see price increases of 2.3 per cent.\n\nSmall business customers will see increases of 3.5 per cent.\n\nVictoria's energy regulator makes its own determination, which was also released on Monday.\n\nThe state's Essential Services Commission says residential customers on a flat tariff should expect to see a 1 per cent increase in prices, while small business customers can expect a 3 per cent rise.\n\nAll of the price increases take effect from July 1.\n\nIn its pre-election budget, the Albanese government announced an extension of electricity bill relief to the value of $75 a quarter for households and small businesses.\n\nThe bill rebates will apply for the two quarters at the end of this calendar year.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-26/wa-farmers-agritourism-boom-income-diversification/105323644",
    "title": "'Positive shift' as WA farmers capitalise on agritourism boom",
    "publish_date": "Mon, 26 May 2025 01:01:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "Agritourism is helping farmers in southern Western Australia future-proof their businesses and legacies as experts predict the sector will continue to boom.\n\nThe CSIRO estimates the industry, which involves farmers using a combination of tours, accommodation and hospitality to attract guests, will be worth $18.6 billion by 2030.\n\nRaquel and Murray Johnson have been leasing part of their regenerative farm, Galloway Springs at Bridgetown, to the third-party owner of a tiny house for more than two years.\n\nThe Johnsons say the addition of the tiny house has had a positive impact on their business. (ABC South West WA: Kimberley Putland)\n\n\"Agritourism has been a really positive shift for our farm,\" Ms Johnson said.\n\n\"I was reluctant in the beginning to have people come on our farm, but it's proved to be so positive.\n\n\"We started off with just some bookings and two years later we're back-to-back pretty much all of the year.\"\n\nMs Johnson says people are turning to agritourism to find out more about primary production. (ABC South West WA: Kimberley Putland)\n\nMs Johnson said since they started leasing the land the couple's agritourism operations had expanded.\n\nA separate farmstay offering was added and they were considering the addition of a second tiny house.\n\n\"We've had visitors straight from South Korea and from Singapore,\" Ms Johnson said.\n\nMs Johnson invites her guests to learn about food production. (ABC South West WA: Kimberley Putland)\n\nThe farm was also diversifying its income streams via other regenerative practices.\n\n\"I do my own farm tours, so that's exactly why they're booking — to get onto farm and to see farm animals,\" Ms Johnson said.\n\n\"I get the opportunity to explain farming to them and … why healthy food matters and why supporting farmers locally or directly is really important.\"\n\nA way to tell the story\n\nOlio Bello general manager Brett Roberts said his olive farm's expansion into agritourism had been a \"holistic\" process.\n\nHe said the shift, which began seven years ago, had helped to create connections with prospective customers.\n\n\"We're a certified organic property, so with that comes costs,\" Mr Roberts said.\n\n\"Tourism plays a major part in getting people to the property and — if they like our products and like our story and understand what we're about — it helps in the way we sell them.\"\n\nBrett Roberts says tourism has been essential to the growth of his farm. (ABC South West WA: Kate Forrester)\n\nMr Roberts believed the marriage of farming and tourism was essential for his business.\n\n\"Without the tourism experiences, people wouldn't come to Olio Bello,\" he said.\n\n\"So they do piggyback each other, but if we didn't have the farm, then we wouldn't have the tourism facilities here.\n\n\"While they rely on each other, we didn't start out to be a tourist destination — it was a way for us to get our story out.\"\n\nCollaborate and grow\n\nA study led by University of Western Australia Associate Professor Kirsten Martinus identified location, authenticity, interaction and learning as key areas of importance for agritourism operations.\n\nShe also highlighted the need to reframe competition as collaboration.\n\n\"If you're in agriculture, agriculture itself is quite difficult financially,\" Dr Martinus said.\n\n\"It's also highly competitive, but the question is, should you be competing or should providers be collaborating?\"\n\nDr Martinus says agritourists are looking for \"authenticity\". (ABC South West WA: Kimberley Putland)\n\nShe said WA winemakers had shown the way in working collaboratively.\n\n\"Places like wine-growing regions have been really good at this, because it's not just about going to buy the wine,\" Dr Martinus said.\n\n\"They've got chocolate, they've got cheese — you've got all sorts of other experiences you can have.\n\n\"You start to broaden out the cohort that might be interested.\n\n\"If you can collaborate with others … suddenly, you grow your market.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-26/urgent-clarity-requested-for-hobart-private-hospital-healthscope/105336264",
    "title": "Urgent clarity requested over fears of collapse of health provider",
    "publish_date": "Mon, 26 May 2025 00:41:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Health unions are urgently seeking assurances about the ongoing operation of Hobart's main private hospital following reports its operator, Healthscope, could soon enter receivership.\n\nHobart Private Hospital, which has almost 150 beds, treats more than 20,000 patients each year and employs about 600 people, according to its website.\n\nThe facility is one of 37 hospitals operated by Healthscope across the country.\n\nNews Corp is reporting Healthscope could enter receivership as early as Monday due to a $1.4 billion debt owed to about 20 lenders.\n\nIt comes after the company announced the shutdown of maternity services at its Hobart and Darwin hospitals earlier this year.\n\nThe Australian Nursing and Midwifery Federation (ANMF) told ABC Radio Hobart it was deeply concerned about the latest developments.\n\n\"We are writing to [the] Healthscope CEO and the Tasmanian Minister for Health, seeking urgent information and assurances with regard to the ongoing operation of Healthscope hospitals,\" ANMF Tasmanian branch acting secretary Phoebe Mansell said.\n\n\" But members are disappointed that they are hearing about this through the media as they did when midwifery services were removed. \"\n\nDoctors flag 'upheaval' as maternity service provider exits Photo shows Obstetrician and gynecologist Emily Price sitting at a desk. Expectant mothers face an \"upheaval, emotionally and logistically\", one doctor says, after a maternity service provider's shock exit from Hobart and Darwin hospitals.\n\nMs Mansell said it was essential the hospital remains open.\n\n\"We can't afford to lose 150 private sector beds in the Tasmanian state.\n\n\"So our focus now will be really working hard with state and federal governments and stakeholders to try and keep Healthscope hospitals open.\n\n\"Of course, we'll also be looking to try and protect the jobs and entitlements of our members working in those facilities, but particularly for us, the Hobart Private.\"\n\nHealthscope says 'hospitals are operating normally'\n\nIn a statement, Healthscope said it was continuing to work with its lenders on the \"best path forward\" in relation to the company's debt and sale process.\n\n\"All of our hospitals are operating normally, with the full support of lenders and other stakeholders,\" it said.\n\n\"Healthscope is open to finding a solution that does not require lenders to assume formal control, but is also prepared if lenders decide to take a more formal path, including the appointment of receivers to complete the current sale process.\n\n\" Our management team will remain engaged through each pathway, and maintaining focus on hospital operations, and progressing a sale of the business, following the considerable interest received. \"\n\nIndependent federal MP Andrew Wilkie, who is based in Hobart, said the state's health system \"would collapse\" if the private hospital were to close.\n\n\"I think the Tasmanian government needs to get out there today and tell us what it is doing and what contingency plans it is putting in place, and would it even entertain the idea of buying the private [hospital] back and rolling it into the public health system?\n\n\"Because we just can't afford to lose that hospital.\n\n\" The Royal obviously is in a perilous state all the time, and our health system would collapse if we lost the private. \"\n\nState government 'watching closely'\n\nThe Tasmanian government said it was monitoring the situation and working with the company and the federal government on the issue.\n\n\"It's important that we work through these challenges,\" government Minister Felix Ellis said.\n\n\"Tasmanians can be assured that we have strong health services that will remain available to people.\n\n\"The government is watching closely on this unfolding situation.\"\n\nMr Ellis did not respond directly to Mr Wilkie's suggestion the government buy the private hospital.\n\n\"There needs to be good public investment and good private investment in our health system here in Tasmania and around the country,\" he said.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-26/erin-patterson-mushroom-murder-trial-monday-may-26/105336012",
    "title": "Live: Digital forensics expert returns to the stand in Erin Patterson trial",
    "publish_date": "Mon, 26 May 2025 00:29:07 +0000",
    "category": "finance",
    "authors": [
      "Joseph Dunstan",
      "Melissa Brown",
      "Kristian Silva"
    ],
    "text": "Under questioning from Colin Mandy SC, Mr Fox-Henry agrees a purchase was made at the Korumburra pub using auto-filled saved details.\n\nHe agrees that anyone using that computer could use that autofilled information unless there was a password protecting it.\n\nHe says he wasn't asked to look at the data for how the computer was used prior to 7.20pm that day.\n\nHe agrees that if he had looked at the records, he potentially may have been able to say who had used it earlier and for how long.\n\nMr Mandy then walks Mr Fox-Henry through a definition of auto-fill on computers.\n\n\"An example is if you are typing a word, take [Microsoft] Word for example … and it recognises the word you are trying to spell and prompts you or [will] auto-complete that word,\" Mr Fox-Henry says.\n\nThe court hears auto-fill use could be analysed digitally in some instances.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-26/moonlight-range-wind-farm-project-axed/105335872",
    "title": "$1b wind farm project axed by Queensland government",
    "publish_date": "Mon, 26 May 2025 00:21:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "A $1 billion wind farm earmarked for Central Queensland has been axed by Deputy Premier Jarrod Bleijie, using ministerial powers.\n\nThe Greenleaf Renewables development was to include 88 wind turbines and a battery energy storage system over 24 parcels of land at Morinish, 40 kilometres out of Rockhampton, with a capacity of 450 megawatts to generate energy for 260,000 homes annually.\n\nThe company had hoped to start building the Moonlight Range Wind Farm in 2026, with 300 jobs during construction and 10 ongoing jobs on completion.\n\nThe project had been approved by the state planning department, State Assessment and Referral Agency, in December 2024.\n\nJarrod Bleijie says 88 per cent of local residents opposed the wind farm (file photo). (ABC News: Lucas Hill)\n\nIn a notice dated May 22, Mr Bleijie exercised his ministerial powers to refuse the development application.\n\nHe began the process for a \"call-in\" to reassess the development application in January.\n\nDuring the two-month call-in notice period, there were 508 representations, including 142 from local residents.\n\nEighty-eight per cent of residents were against it.\n\nThe main concerns in the objections were strain on the accommodation supply from the 300 construction workers, lack of community consultation, and environmental and bushfire hazard impacts.\n\nCommunity to have a say\n\nSpeaking on Monday, Mr Bleijie said if communities supported these projects, they would go ahead.\n\n\"Eighty-eight per cent of local residents opposed the Moonlight Range Wind Farm proceeding,\" he said.\n\nWhat might our future power grid look like? Photo shows A chart shows the breakdown of energy generation over the course of a day, including coal, gas and renewables Our energy system is evolving at breakneck speed. Here we look at how our power grid works, what more renewables mean for energy prices, how nuclear fits into the picture, and how we might build a grid fit for the future.\n\n\"We think an equal and fair policy is just like the resource sector, the agriculture sector, the gas sector have to get certain approvals and community buy-in and community say, so should renewable energy projects.\"\n\nJohn Ellrott's cattle property runs onto the Moonlight Range and he has previously refused requests from companies to build wind turbines on his property.\n\n\"I'm very pleased about it because the Moonlight Range has got some very significant flora and fauna on it that needs conserving and doesn't need to be flattened,\" he said.\n\n\"We don't need all our ranges covered in wind towers.\n\n\"I think we need to steady down and think about this, a mixture of energy would be good, feel our way into renewables and not rush into it headlong because it may not provide the goods.\"\n\nLNP Member for Mirani Glen Kelly, who has been campaigning for the project to be axed, said it was \"exciting news\".\n\n\"The communities have to have some say on these projects,\" he said.\n\n\"The minister's decision is final so happy days for the communities in and around Rockhampton who I know have been working hard to block this project.\"\n\nThe notice states a person may not appeal against the minister's decision on a call-in under the Planning Act.\n\nGreenleaf Renewables has been contacted for comment.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-26/squadron-energy-delays-start-of-port-kembla-lng-terminal/105332468",
    "title": "'Ready to go' gas terminal mothballed until 2027 amid demand shift",
    "publish_date": "Mon, 26 May 2025 00:17:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "A New South Wales gas terminal is built, connected and ready to go but will not begin operations until at least 2027 as Squadron Energy delays the start amid shifting demand forecasts.\n\nIt comes even as energy authorities warn of looming east coast gas shortfalls.\n\nThe Port Kembla Energy Terminal — which has been completed and tied into the Eastern Gas Pipeline — will stay in \"care and maintenance\" mode until mid-2027, after a reassessment of customer needs and updated projections from the Australian Energy Market Operator (AEMO).\n\nSquadron Energy executive general manager of operations, Stuart Davis, said the revised timeline reflected market conditions.\n\nHe said his company received a request from Egyptian state-owned company Egas for an extension as it was going through a sales process for the terminal.\n\n\"We could see that the demand was from 2027 — so we were able to satisfy Egypt and Egas and meet our customer needs here from 2027,\" he said.\n\nSquadron Energy says the Port Kembla gas terminal is fully built. (ABC News: Marcus Stimson)\n\nSquadron last year announced it had secured LNG carrier vessel the Hoegh Galleon, a floating storage and regasification unit (FSRU) which could receive domestic or imported gas.\n\nMr Davis said the site would remain in \"care and maintenance to ensure that when the Galleon turns up it is ready to go\".\n\nThe company originally forecast it would start operating in 2026.\n\nAEMO forecasts\n\nIn March, AEMO's 2025 Gas Statement of Opportunities identified peak-day shortfall risks in southern states from 2028 — a shift from previous forecasts that had shortfalls arriving earlier.\n\nHowever, the report still warned of deepening supply gaps from 2029 onwards, calling for \"structural\" investment in new supply, pipelines, or storage to avoid market imbalances.\n\nThe Port Kembla terminal was listed in AEMO's report as a future supply option capable of delivering up to 500 terajoules per day — about 130 petajoules a year — from 2026.\n\nBut it was not included in the formal modelling because it was considered a \"proposed\" project.\n\nAn AEMO spokesperson said it was not advanced to be included in the modelling as a committed or anticipated project.\n\n\"Therefore, we wouldn't need to re-model the supply adequacy forecast,\" they said.\n\nJemena, which owns and operates the Eastern Gas Pipeline linking Victoria and New South Wales, said the delay would not impact its work to reconfigure the pipeline for bi-directional flow — allowing gas to move south to Melbourne.\n\nThe liquefied natural gas will be regasified at Port Kembla. (ABC Illawarra: Tim Fernandez)\n\nSquadron said its later start date did not mean it would miss the market window.\n\n\"We are in deep commercial discussions with a lot of very large customers to take the offtake and we're confident from 2027 on we will be able to sell the capacity of the facility,\" Mr Davis said.\n\nHe also said the delay was unlikely to benefit rival projects such as Santos' Narrabri gas field or Queensland pipeline expansions.\n\n\"Ultimately there are lots of projects vying to get financial investment decisions,\" he said.\n\n\"We are the only solution that has gone through FID [Financial Investment Decision], we've finished construction and commissioning.\n\n\" We are ready to go. \"\n\nDebate intensifies\n\nAnalysis from the Australia Institute shows about 80 per cent of Australia's gas is exported as LNG.\n\nIndependent Senator David Pocock has been critical of the policy settings.\n\n\"We don't have a gas supply shortage — we have a gas export problem,\" he said in March.\n\n\" We prioritise exporting gas ahead of actually looking after Australian households and businesses. \"\n\nMr Davis said the Port Kembla terminal, once operational, could help rebalance supply.\n\n\"There are capacity constraints between northern Queensland and the NSW–Victoria market,\" he said.\n\n\"You can't get much gas from the Northern Territory to the east coast, and you can't get any from WA — so Port Kembla Energy Terminal is a fantastic asset to facilitate those flows of Australian LNG.\"\n\nA spokesperson for Energy Minister Chris Bowen said the federal government was made aware of the delay in March.\n\n\"The Albanese government has acted to secure gas supply out until 2029 — ensuring Australian homes and businesses have affordable supply when and where they need it,\" the said.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-26/bagdad-community-rallies-spangler-family-injury-sudden-death/105330436",
    "title": "Family rocked by tragedies finds strength in country town's support",
    "publish_date": "Sun, 25 May 2025 23:33:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Cally Spangler had not expected things could get worse.\n\nHer family had leaned on each other and their community in rural Bagdad in southern Tasmania after her 21-year-old brother Connor suffered a ruptured brain aneurysm that left him in a coma for a month.\n\nThen, while her brother was still in hospital, their 47-year-old father died suddenly in an accident.\n\nMs Spangler, 23, had to step into a co-caring role for her siblings, aged eight to 25, and face potentially complex legal and financial challenges because her father had died without a will.\n\n\"First off, when Connor was in the coma, Dad was in there every day for about three hours,\" the wool grader told ABC Hobart.\n\n\"It didn't matter whether he had the kids or he was at work five days a week.\n\n\"He'd go finish the day at work, go into the hospital, come home, [and] cook tea for the rest of the kids on repeat.\"\n\nHer father, Shawn, had shared custody of five of the eight children after her parents separated five years earlier.\n\nThe three eldest had lived solely with their dad.\n\nCally Spangler with her father Shawn (centre) and brother Connor. (Supplied)\n\n\"I think we're very lucky to have so many brothers and sisters that even though the house feels empty and not quite right, we're never alone,\" Ms Spangler said.\n\n\"[In six months, we've experienced] everything that you could possibly imagine in life: love, happiness, sadness, remorse.\"\n\nCommunity fundraiser\n\nThe Bagdad community has rallied to support the family during Connor's months-long hospitalisation and ongoing rehabilitation, and since their dad's death.\n\nA fundraiser run at Rhonda's on Midlands, formerly Bagdad Community Club, has raised more than $13,000.\n\nBagdad is a small rural community in southern Tasmania. (ABC Rural: Tony Briscoe)\n\nMs Spangler's employer, Adrian Lovell, a shearer, said the family had shown resilience in the face of hardship.\n\n\"It was a terribly sad story right from the start,\" Mr Lovell said.\n\n\"To be on the way up and see what they'd gone through with Connor, then to get a call just after Christmas about her father was, Jesus, I thought, 'How are they going to handle this?'\"\n\nBagdad resident Michelle Visser, of Rhonda's on Midlands, said rural communities were adept at rallying when things were tough.\n\n\"We recently had a big fundraiser up here which started out really small, but the donations got that big that we had to make room in another area to put the donations,'' Ms Visser said.\n\n\" Everyone has been really generous and some of those people that are really generous are doing it tough themselves. \"\n\nMs Spangler said she felt immense gratitude for the community's kindness.\n\n\"The support's been insane,\" she said.\n\n\"When Connor first was in a coma, everyone was bringing around the food then.\n\n\"And then when Dad passed away, we said, 'No, you can help us with lending us an ear, no food', because the freezer just got so full the first time.\"\n\nWhile there had also been offers of household help, Ms Spangler said the rhythm of daily chores had provided a sense of purpose.\n\n\"We don't want our life to stop in any way,\" she said.\n\n\" Even the crappy jobs of mopping the floors, we'll continue to do that. \"\n\nNavigating the system\n\nBeyond community support, Legal Aid Tasmania, some community legal centres and the Public Trustee can provide help in such situations.\n\nTasmania Legal Aid offers general advice and information including referrals through its Legal Help service and has a general civil lawyer available for more intensive casework.\n\nBut that lawyer is unable to assist with administration of an estate or estate planning.\n\n\"It's difficult because the services are quite fragmented,\" Legal Aid Tasmania director Kristen Wylie said.\n\nKristen Wylie says support is available for families when a parent dies without a will. (ABC News)\n\n\"We are funded to provide some general civil assistance, but only one person covers the whole state so we are limited in what we can do.\n\n\"We will be able to give advice on navigating the system and make targeted referrals.\"\n\nShe said things were more complex if, as in Ms Spangler's case, the deceased person had not left a will.\n\nShe said it was called dying \"intestate\".\n\n\"In this case TLA would refer a young person to a private lawyer specialising in wills and estate work to help apply and administer the estate,\" Ms Wylie said.\n\n\"This would involve a fee for those services.\n\n\"Similarly, the Public Trustee can assist and also charge fees.\n\n\"If meeting those fees is an issue, we would try and assist the young person with a referral to a pro-bono lawyer through the schedule run by the Law Society of Tasmania.\"\n\nTasmania Public Trustee chief executive Todd Kennedy said the trustee could perform the role of administrator when someone died without a valid will, but it could be a \"complicated process\".\n\n\"Sadly approximately 50 per cent of Tasmanians pass away without a valid will,\" Mr Kennedy said.\n\n\"This leaves behind a burden for grieving family members during what is already an emotional time.\n\n\"Also, without a valid will your assets may not be distributed in line with your wishes.\"\n\nAccording to the Tasmanian Intestacy Act 2010, the surviving spouse will inherit the whole estate unless there are children from another relationship of the deceased.\n\nWhere there are, the surviving spouse is entitled to a statutory spousal legacy of $350,000.\n\n\"Making a will is easier than you think,\" Mr Kennedy said.\n\nCally Spangler (back right) and her siblings have had support from their community. (Supplied)\n\nExtreme gratitude\n\nMs Spangler said she was \"overcome with emotion\" by the community's financial gift.\n\n\"It was not what I was expecting at all,\" she said.\n\n\"You're going through these times, and you don't know anything for certain.\n\n\"It's just a feeling I've never felt before.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-26/old-mines-being-revived-amid-gold-price-records/105332540",
    "title": "Tim Goyder changes focus from critical minerals to gold as price soars",
    "publish_date": "Sun, 25 May 2025 23:01:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "In Australia's resources sector, Tim Goyder has been the man with the Midas touch in recent years.\n\nAt one point in 2023, his stock holdings in one-time market darlings Liontown Resources and Chalice Mining saw him become a paper billionaire with an estimated net worth of $1.09 billion.\n\nBut as fast as the Perth-based mining investor joined the Australian Financial Review's annual Rich List, such is the swings and roundabouts of commodity price cycles, he slipped off.\n\nThat is not to say Mr Goyder has lost his golden touch, but his personal fortune reflects the downturn in critical minerals such as lithium and nickel.\n\n\"Two years ago, everyone was saying lithium was the thing to be in, which I still believe,\" he said.\n\nThe Kathleen Valley lithium mine, 60km north of Leinster, produced its first concentrate in July 2024. (Supplied: Liontown Resources)\n\nBoom and bust cycle\n\nMr Goyder and his various investment arms control more than 333 million shares in Western Australia's newest lithium miner, Liontown Resources, worth $211.8 million at Friday's closing price of 63.5 cents.\n\nThe company's $951 million Kathleen Valley lithium mine in WA's northern Goldfields shipped its first concentrate from Geraldton Port last September, supplying US electric vehicle manufacturers Ford and Tesla and South Korean battery maker LG Energy Solutions.\n\nThe development of the long-life Kathleen Valley mine saw Liontown trade as high as $3.15 in June 2023, as US chemicals giant Albermarle circled with a $6.6 billion takeover bid before walking away during the due diligence process.\n\nLiontown Resources managing director Tony Ottaviano speaking at the Diggers and Dealers Mining Forum in Kalgoorlie-Boulder. (ABC Goldfields: Jarrod Lucas)\n\nLithium's dramatic slump was underlined this month when Liontown received a state government support package in the form of waivers on port charges and tenement fees, as well as a $15 million interest-free loan until prices recover.\n\n\"It's gratefully received from the WA government,\" Mr Goyder said.\n\n\"They recognise it is an early mover industry, and every bit helps while lithium prices are low, but long term I think we've got a very, very good business.\"\n\nAnother former market darling of Mr Goyder's is Chalice Mining, which has slowed development work for its Gonneville palladium-nickel-copper project near Toodyay in WA's Wheatbelt.\n\nHis 7.8 per cent stake was worth $37.5 million at Friday's $1.23 market close, down from a record $9.86 in November 2021.\n\nThe Bullabulling gold mine, 25km south-west of Coolgardie, closed in 1998 when the gold price was $500 an ounce. (ABC Goldfields: Jarrod Lucas)\n\nGolden opportunity beckons\n\nIn the meantime, Mr Goyder has turned his attention to gold as the precious metal soared above $5,000 an ounce in Australian dollar terms for the first time this year.\n\nAs chairman of fledgling gold miner Minerals 260, and a 7.3 per cent major shareholder, he played a key role in January's $166.5 million acquisition of the Bullabulling project from Chinese-owned miner Norton Gold Fields.\n\n\"We don't have buyer's remorse,\" Mr Goyder said.\n\n\"After paying $72 an ounce, and given the gold price has risen almost $700 an ounce since we announced the deal, we don't have buyer's remorse.\"\n\nThe Bullabulling mine, 65 kilometres south-west of Kalgoorlie-Boulder, closed in 1998 when the gold price was about $500 an ounce.\n\nA major exploration campaign is underway at the Bullabulling project to expand the known gold resources. (ABC Goldfields: Jarrod Lucas)\n\nGeologists have pored over old drilling data and estimate at least 2.3 million ounces of gold remains at Bullabulling, where Mr Goyder believes a mine employing 350 workers could be operational by 2028.\n\n\"There's nothing better than seeing a development go ahead, jobs created, and wealth created for our shareholders,\" he said.\n\nMinerals 260's ASX ticker is MI6, and as one geologist pointed out during a recent field trip, they have been given a \"licence to drill\".\n\nFour drill rigs, and soon to be six, are turning as part of an 80,000-metre exploration campaign to find more pay dirt.\n\n\"There is upside here there's no doubt, that's why we bought it,\" Mr Goyder said.\n\n\"I'm sure once we go through all the studies, the economics are going to look very good.\"\n\nKalgoorlie-Boulder historian Tim Moore holds a copy of the Kalgoorlie Miner newspaper from May 2006 when the Australian dollar gold price hit $900 an ounce for the first time. (ABC Goldfields: Jarrod Lucas)\n\nOld mines revived\n\nIt is a familiar story across WA with old mines being dusted off like old newspapers amid this year's record gold prices.\n\nAmong them is the Youanmi mine, about 400km east of Geraldton, which operated from 1987 to 1997 but closed when the gold price was about $450 an ounce.\n\nPerth-based Rox Resources has estimated it would cost $245 million to bring it into production.\n\nRox has told the ASX it will complete a definitive feasibility study by the end of the year with the aim of entering production by mid-2027.\n\nAt nearby Sandstone in the Mid West, WA gold miner Brightstar Resources has taken the first steps to revive mining, which ceased in 2010.\n\nThe company is currently undertaking an 80,000-metre drilling campaign at Sandstone, with plans to restart production in 2028.\n\nIt is funding those works by selling ore to processing plants surrounding its gold deposits at Laverton and Menzies in the northern Goldfields, a practice known as toll milling.\n\nBrightstar Resources produced 4,297 ounces of gold in April from 56,449 tonnes of ore it delivered for processing at the Laverton Mill. (Supplied: Brightstar Resources)\n\nGold's current hot streak has seen even low-grade material become valuable again, highlighted this week at the Mt Fisher mine, a small open pit last mined in 1987 about 120km east of Wiluna.\n\nOld stockpiles, up to 195,000 tonnes of low-grade ore, that have sat at Mt Fisher for 38 years, are undergoing test work for a potential toll milling deal.\n\n\"There's lots of ups and downs in the market … but the gold price has gone up exponentially in just two years,\" Mr Goyder said.\n\n\"It's a great spot to be right now.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-26/king-valley-italian-wine-migrant-heritage/105322754",
    "title": "Migrant families transform tiny valley into Italian wine hub",
    "publish_date": "Sun, 25 May 2025 21:46:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "A roll call of Italian grape varieties are finding new expression half a world away from their birthplace.\n\nAs are many of the pioneers who brought varieties including prosecco, pinot grigio, nebbiolo, sangiovese, fiano and dolcetto to Victoria's King Valley, one of Australia's most exciting, emerging wine regions.\n\n\"A lot of northern Italian grape varieties have been a real shining light in the Australian wine industry,\" said Fred Pizzini, whose family has played a trailblazing role in the region's development.\n\n\" Our wines do sit on judging panels and wine tastings in Europe. So well done to the Italian wine varieties in this region. \"\n\nBreaking from tradition\n\nMany Australian wineries have been doing it tough.\n\nThere has been a glut of traditional French grape varieties such as shiraz and chardonnay.\n\nFred Pizzini has seen King Valley wines rise to win international acclaim. (ABC Landline: Tim Lee)\n\nNot so in the King Valley, where family-owned vineyards and their distinctive Italian grape varieties and wines have been growing in popularity.\n\nThe valley's high altitude, mountain soil and climate are conducive to producing quality wines.\n\nFred Pizzini's son, Joel, who is the company's principal winemaker, said it made for earthy, savoury, more interesting versions of styles.\n\nThe Pizzini family is one of about a dozen winemaking families of Italian descent in the valley, all of them migrant success stories.\n\nJoel Pizzini showcases some of the Italian varieties in his collection. (ABC Landline: Tim Lee)\n\nFred's father, Arnie, and his three brothers settled in the valley in the 1950s.\n\n\"When we first bought the farm up here, the first thing he did was plant a vineyard of 1 acre,\" Fred said.\n\n\"And then he built his house.\"\n\nFrom tobacco fields to wine country\n\nThe Politini family from Sicily and the Corsini family from Tuscany also arrived in the 1950s and planted vineyards to make wine for their own use.\n\nTheir main crop was tobacco, which flourished on the rich river flats.\n\nWhen the industry rapidly declined in the late 1970s, the valley's farmers shifted to grape growing.\n\nTractors glide through rows of grape vines. (ABC Landline: Peter Healy)\n\nMost took a 10-year contract with prominent wine maker Brown Brothers, but many had already seen the potential of growing Italian grape varieties.\n\nFor the Corsinis, whose cellar door is a majestic stone villa, a family wedding in 1992 launched them into commercial winemaking.\n\n\"My older sister got married and she insisted that she wanted dad's wines at the reception,\" Peter Corsini said.\n\nPeter's father Gino followed a centuries-old family winemaking method that used no preservatives.\n\nLinda Newton, Peter Corsini, Leticia Corsini and Reuben Corsini are part of a multigenerational wine family. (ABC Landline: Tim Lee)\n\nTheir vegan-friendly, non-allergenic wine is made from a range of Italian grape varieties including fiano, sangiovese and dolcetto.\n\nJoel Pizzini said visitors to their part of north-east Victoria, especially Italians, were impressed by the valley's strong Italian culture.\n\n\"It's definitely an amazing drawcard. The beauty of the King Valley is its Italianate culture,\" Joel Pizzini said.\n\n\"It's beautiful tasting lots of different [Italian] varieties, not just different versions of shiraz and cabernet.\"\n\nLegacy grows\n\nSam Politini, 90, is among only a few surviving migrant winemaker pioneers.\n\nHe witnessed fierce fighting between the Germans and Allied Forces in 1943.\n\nIn 1956, aged 21, he followed his brother to Australia for a better life.\n\nSam Politini regularly plays the accordion at his family's vineyard. (ABC Landline: Tim Lee)\n\nOn most days, his fine Italian accordion tunes resonate across the family's picturesque vineyard, where his grandson Jacques Simian is the third generation to take up winemaking.\n\nMr Politini said he was delighted to see the emergence of King Valley wines.\n\n\"I think we are all really excited and also from when we started till now there are plenty more tourists around,\" Mr Politini said.\n\n\"It's really good to work with something that shows your heritage, something that shows where you're from and you can promote it and give it to others,\" Jacques Simian said.\n\nReuben Corsini and his cousin Leticia are also third-generation farmers.\n\nReuben Corsini (left) and his father Peter examine dolcetto grapes. (ABC Landline: Tim Lee)\n\nTheir career choice has helped revitalise the Valley and cater to a growing tourist trade.\n\n\"It's an absolute honour to be able to carry that [tradition] on,\" Linda Newton (nee Corsini) said.\n\n\"Our parents loved it; were passionate about it, and every day you walk into cellar door you've got that connection with them.\n\n\" Now seeing that third generation carry that same passion is just priceless. \"\n\nThe taste of Italy extends beyond wine.\n\nWineries such as the Pizzini's hold cooking classes and festivals that celebrate wine, cuisine and culture.\n\nThe King Valley wine region is home to more than a dozen vineyards. (ABC Landline: Tim Lee)\n\nItalian grape varieties dominate the landscape, including the Pizzini family's vineyards that line the valley's slopes.\n\nSome date back to Roman times, and most can endure tough climatic conditions better than traditional French varieties.\n\n\"As we get more high-intensity heatwaves, high-intensity storm and rainfall events, they're becoming really beneficial for a viticulture adaptation perspective,\" Fred Pizzini said.\n\n\"There's lots of benefits other than just the commercial side of making delicious wines.\n\n\"King Valley is an international name today, which is pretty special.\"\n\nWatch ABC TV's Landline at 12:30pm AEST on Sunday or stream anytime on ABC iview.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-26/french-open-rafael-nadal-honoured-20-years-after-roland-garros/105335032",
    "title": "'Couldn't let you leave like that': Big Four reunite to honour Nadal",
    "publish_date": "Sun, 25 May 2025 21:29:34 +0000",
    "category": "sports",
    "authors": [],
    "text": "Roger Federer, Novak Djokovic and Andy Murray have turned up at the French Open to participate in a ceremony honouring 14-time tournament champion Rafael Nadal, symbolising the approaching end of a golden era in men's tennis.\n\nNadal addressed the packed Court Philippe-Chatrier in French, English and Spanish at the event where he had a ridiculous 112-4 win-loss record since winning his first grand slam title as a 19-year-old on debut in 2005.\n\nDuring a 45-minute tribute, Nadal thanked tournament director Amélie Mauresmo and Fédération Française de Tennis president Gilles Moretton for organising \"this final farewell from, without a doubt, the most important tennis court of my career\".\n\n\"I've experienced everything over these 20 years,\" Nadal said.\n\n\"I've had incredible rivals, like Andy, Novak and of course Roger. And of course many others who pushed me to my physical and mental limits. Truly, nothing would have been as thrilling without these long-lasting rivalries that have driven all of us to improve every single day.\n\n\"Roland-Garros is unique, not only because it is a fundamental part of tennis history, but because of all the people who work tirelessly, always with a smile, to make this tournament what it is: unique.\"\n\nIn the stands, along with thousands of adoring fans, were Nadal's family, including uncle and former coach Toni, wife Mery Xisca Perello and son Rafael Jr, who was passed down onto court with his dad before meeting his dad's great rivals after the ceremony.\n\nFrench tennis great Yannick Noah, Spanish NBA champion Pau Gasol, 1998 French Open winner Carlos Moya and Tennis Australia chief executive Craig Tiley were also in attendance.\n\nRoger Federer, Novak Djokovic and Andy Murray joined the crowd in farewelling the Spanish legend. (Getty Images: Robert Szaniszlo/NurPhoto)\n\n\"To have my three biggest rivals there, in the court with me, meant a lot, no? And at the same time, it's a great message for the world that the … toughest rivalries probably in the history of our sport are able to be good colleagues, to respect each other,\" Nadal said after an emotional on-court ceremony.\n\n\"You don't need to hate the opponent to try to beat him with all your forces, and that's the message that I think we showed people, we showed the new generations, and in some way that's our legacy.\"\n\nDuring the tribute to Nadal, a video played showing those three rivals of his — together, the quartet with a combined 69 grand slam titles came to be known as the Big Four.\n\nNadal, who turns 39 next month, retired after last season with his final few tournaments including the only first-round French Open loss of his career, a runner-up finish in Bastad, a second-round Olympics exit against Djokovic back at Roland Garros and a straight-sets loss at the Davis Cup.\n\n\"We couldn't let you leave like that,\" Djokovic said in the taped segment, and then he, Federer and Murray walked out together on centre court.\n\nNadal gave each a hug as they patted him on the back and shared a laugh.\n\nIt was another emotional moment in a ceremony that left few dry eyes in the arena, least of all for Nadal.\n\nThere were plenty of tears shed by the tennis legend and his fans. (Getty Images: Burak Akbulut/Anadolu)\n\nHe did not know for sure they would be there, but he suspected they would be. (Djokovic is entered in the French Open and is scheduled to play his first match on Tuesday.)\n\n\"All the nerves, pressure, strange feelings that you feel when we see each other when we are really rivals, it's completely different when you finish your career,\" Nadal said, addressing world number six Djokovic in particular.\n\n\"At the end, now it's all about being happy about everything that we achieved. At the end, all of us achieved our dreams.\"\n\nWhile addressing his most famous competitors, Nadal made a point to include a credit to fellow Spaniard David Ferrer, who was also in the building and was beaten by Nadal in the 2013 French final during a run of 10 straight trips to grand slam quarterfinals or better from 2012 to 2014.\n\nFederer, Djokovic, Nadal and Murray won 34 of 35 men's majors from the 2005 French Open to the end of 2013. (Getty Images: Tim Clayton)\n\n\"You gave me some hard times on court but I really enjoyed a lot pushing myself to the limit every single day to compete with all of you,\" Nadal said.\n\n\"At the end, tennis is just a game. Sometimes we feel it's a little bit more but I think we understand it's really only a game.\n\n\"So that means [everything] for me that all of you are here. That's a great message to the world that we can be good friends even if we had the best rivalries. Thank you very, very much for everything during all these years.\"\n\nNadal's record haul of majors in Paris was marked with a permanent plate on centre court featuring his footprint in the red clay.\n\nLoading Instagram content\n\nFederer, now 43, played his last match in 2021 and announced his retirement the following year.\n\nMurray, who turned 38 this month, retired after participating in the Paris Olympics last year and briefly coached Djokovic this season.\n\nDjokovic, who turned 38 on Thursday and won his 100th career title on Saturday, is the only member of the group still active on tour.\n\nThe inevitable is finally catching up with Djokovic Photo shows A shirtless Novak Djokovic gestures. Novak Djokovic is in decline even as he grabbed more tennis history in Geneva. What remains to be seen is whether he still can get through a two-week major with his mind and body intact.\n\nThe Serb has won the most grand slam titles for a man, with 24. Nadal is next on the list with 22, followed by Federer with 20. Murray won three but made eight other finals across all four majors, losing to Federer and Djokovic each time. The Scot also won successive Olympic singles titles in 2012 and 2016.\n\nNadal and Djokovic played each other 60 times, the most matches between two men in the Open era of tennis, which began in 1969.\n\nDjokovic led the series 31-29, taking their final encounter in the second round of the Paris Olympics last year, although Nadal led 8-2 in French Open match-ups.\n\nNadal led Federer 24-16, including 6-0 at Roland-Garros. Nadal led Murray 17-7.\n\n\"They represent a very important part of my tennis career, because in some way, we pushed each other to the limits. … Always, one of that four was winning the tournament,\" Nadal said.\n\n\"So that, to put it in perspective, never allowed us to stay relaxed or to give us a break in terms of intensity, in terms of the determination [to] keep improving our game.\"\n\nIn something of a passing-of-the-torch moment, world number two and recent Rome Masters winner Carlos Alcaraz greeted the quartet after the tribute.\n\nSabalenka advances\n\nOn the court, top-seeded woman Aryna Sabalenka tore past Russian Kamilla Rakhimova 6-1, 6-0, while it was a tough day for the Australians in action, with all three losing.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nRinky Hijikata won a set for the first time in a French Open main draw before going down to giant American Reilly Opelka 1-6, 6-3, 7-5, 7-6(7-3).\n\nTristan Schoolkate was taught a lesson by the last player Nadal beat as a pro, Márton Fucsovics, — losing 6-4, 6-2, 6-2.\n\nAnd Destanee Aiava's main draw debut ended in straight sets against Ukraine's Dayana Yastremska, 7-5, 6-1.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP/ABC",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-26/asx-markets-business-news-live-updates/105334112",
    "title": "Live: ASX flat, trade tensions ease",
    "publish_date": "Sun, 25 May 2025 21:15:44 +0000",
    "category": "finance",
    "authors": [
      "Stephen Letts",
      "Stephanie Chalmers",
      "Daniel Ziffer"
    ],
    "text": "And just like that, the relative calm in the US trade war against almost everyone (shout out to Russia for remaining exempt from any US tariff action) ended on Friday when Trump recommended a new 50% tariff on European goods.\n\nThe threat of 25% tariff on an American champion, Apple, for goods it makes outside the US, was tacked on for good measure.\n\nWall Street fell in the wake of the resumption of hostilities, but it was more a \"here we go again\" orderly exit to the bomb shelter, than a mad panic, hair-on-fire response.\n\nThe Dow, S & P 500 and Nasdaq fell 0.6%, 0.7% and 0.9% respectively.\n\nApple was a significant casualty, falling 3%, having earned the president's ire.\n\nEurope fell harder. The Dax and broader Eurostoxx 600 both fell 1.5%, while in the UK, which has already cobbled together a fairly meaningless trade deal with US, the FTSE was down a more modest 0.2%.\n\nFutures traders on the ASX also took a more sanguine view on the \"déjà vu all over again move\", with the ASX SPI 200 down 0.4%.\n\n\"If I were to put a headline on today's story, it would be 'Here We Go Again!'\" Ocean Park Asset Management CIO James St Aubin told Reuters. \"This is Trump turning on the temperature on the tariff conversation with the EU and Apple. \"The markets were hoping that the worst was behind us when it comes to the tariff rhetoric. But in reality, there's still some smouldering embers when it comes to the tariff talk.\"\n\nUS Treasury Secretary, Scott Bessent, wasn't having any \"smouldering embers\" metaphors, hoping the new threats would \"light a fire under the EU\" in negotiations.\n\n\"Plus ça change, plus c'est la même chose,\" as they may have sighed across the Atlantic.\n\nThis morning EU President Ursula Von Der Leyen tweeted she had a good call with Mr Trump and Europe was ready to advance talks swiftly but needed time to reach a good deal.\n\nOver the week, the three US indices were down around 2.5%, while Europe fell 1.6%.\n\nThe ASX, battling its little contrarian heart out, eked out at 0.2% gain.\n\nBond yields were generally higher in the US, Europe and Japan, although a bit lower in Australia, thanks to the RBA's dovish commentary accompanying last week's rate cut.\n\nThe US dollar continued to be sold off against most major currencies, adding to mounting evidence it has lost its lustre as a safe haven when markets get the staggers.\n\nThat helped push the Australian dollar higher to just under 65 US cents.\n\nOil also edged higher on Friday but was down over the week.\n\nGold (+1.9%) held its position as a safe haven, benefiting from another bout of global uncertainty and gaining almost 2% on Friday,\n\nIron ore edged down 1% but continues to wobble around $US100/ tonne.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-05-26/ses-dad-and-daughter-trauma-team/105309366",
    "title": "Father and daughter duo support SES volunteers after trauma",
    "publish_date": "Sun, 25 May 2025 20:46:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Ray Polaski joined the State Emergency Service (SES) in Portland, Victoria, it was 1981.\n\nThe SES was newly established, and he and his wife Shirley had three young daughters; life was full and busy already, but the volunteer rescue work quickly became Ray's focus.\n\n\"Family was the last thing on our minds in the early phases of SES,\" Ray said.\n\n\"We all did the same thing, we were trying to get SES off the ground, and you put a lot of time and energy into it.\"\n\nRay Polaski training with the Portland SES Cliff Rescue Squad in his 30s. (Supplied: Portland SES)\n\nAfter joining the SES, Ray became its controller for 23 years, and also joined the CFA and helped found the Portland Coast Guard.\n\nHe loved the volunteer work for its camaraderie, and the thrill of learning rescue skills like abseiling, chain sawing and first aid, and received two Emergency Services Medals for his volunteer efforts.\n\nBut he said he had missed out on a lot of family time.\n\n\"It was work, SES, and family in that order,\" he said.\n\n\"It should have been the reverse.\n\n\" We didn't go on many family holidays back then. \"\n\nThese days, Ray said, things have changed.\n\nFor one, more women have joined the SES and his daughter Melissa Polaski is one of them.\n\nBased at Portland SES, Melissa Polaski is also a peer support officer. (Supplied: Elijah Roberts, Portland SES)\n\n\"It used to be known as the 'Boys Club'. When I was controller, I started pushing women into the unit here,\" he said.\n\n\"One of my daughters, Melissa joined us here 10 years ago,\" he said.\n\n\"She joined to find out what Dad does, because I didn't see enough of them when they were younger.\"\n\nRay Polaski and Melissa Polaski over the years. (Supplied: Polaski family)\n\nDad-daughter duo\n\nEach week at the Portland SES headquarters, Ray and his daughter Melissa are making up for lost time.\n\n\"I joined SES to spend time with my dad, give back to the community and obtain different skill sets,\" Melissa said.\n\n\" Dad and I go to most jobs together, kinda like a father-daughter duo. \"\n\nMelissa Polaski training with the \"jaws of life\", a hydraulic rescue tool. (Supplied: Portland SES)\n\nRay said he felt pride watching his daughter rise through the ranks of the Portland SES.\n\n\"She's got two pips on her shoulder in a short time. That's amazing,\" he said.\n\n\"That's deputy, three pips is controller.\"\n\nRay said his daughter was smaller than a lot of the unit's members, which meant she had crawled into the windows of flipped and crumpled cars during rescues.\n\nFifty-one personnel rescued the driver of this car that veered over a cliff in Portland in 2017. (Supplied: Portland SES)\n\n\"Mel's been inside the cars several times to untangle people's feet, help move them around, talk to them, tell them exactly what's going, which is vital to extraction,\" he said.\n\n\"And she doesn't mind going out and bush-slugging with the others.\"\n\n'You can't unsee'\n\nThe SES now has a peer support program, and Melissa and Ray undertook specialised training to become peer support officers.\n\nIf there's been a critical incident in the South West Victorian SES unit, Melissa and Ray head out on the highway, either together or solo, to act as an emotional response team.\n\nRay and Melissa Polaski drive across the region as peer supporters. (Supplied: Elijah Roberts, Portland SES)\n\nAs peers, they give immediate group support using the \"psychological first aid model\".\n\nThey check in with people and look for signs that someone needs help.\n\n\"We get called to most traumatic events, the same day or a couple of days later,\" Melissa said.\n\nRay said he knew what to look for, partly because he had experienced it.\n\nMelissa Polaski and her dad, Ray Polaski, are peer support officers who travel to locations where traumatic incidents have occurred. (Supplied: Elijah Roberts, Portland SES)\n\n\"Wherever children are involved … they are experiences that sit in the back of your brain. It doesn't matter how many you've been to, they will always stay there and you'll always remember them,\" Ray said.\n\n\" You can't unsee, you don't unhear. \"\n\nA spokesperson for the SES said there were 67 peers like Ray and Melissa across Victoria.\n\nPortland SES was called out after a large branch crushed a parked car in the middle of the night. (Supplied: Portland SES)\n\n\"They've each had specialist training in mental health first aid, psychological first aid, and ASIST training, which is applied suicide intervention skills training,\" the spokesperson said.\n\nThe spokesperson said if members needed additional support, they could speak to someone from their clinical mental health support team.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/get-fried-chicken-until-2am-at-this-late-night-koreatown-haunt-20250526-p5m28c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Get fried chicken until 2am at this late-night Koreatown haunt",
    "publish_date": "Mon, 26 May 2025 12:05:41 +1000",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\n1 / 5 Army stew (budae jjigae) with sausages, beans, tofu and kimchi. Chris Hopkins 2 / 5 Fried chicken with sweet chilli glaze (left) and creamy onion. Chris Hopkins 3 / 5 Outside the Healeys Lane restaurant. Chris Hopkins 4 / 5 Seafood pancake with ganjang (soy sauce). Photograph by Chris Hopkins 5 / 5 Inside Seven Star Pocha, open until late in Koreatown. Chris Hopkins Previous Slide Next Slide\n\nKorean$$$$\n\n“Pocha” means outdoor food carts and this eight-year-old mainstay brings street-food energy to its casual, sometimes raucous dining room. If you’re here after 7pm, you’ll probably need to queue, but don’t worry about missing out: the place is open till at least 2am.\n\nArmy stew (budae jjigae) is a key dish, set on the table in a huge tureen over a butane burner for you to cook yourself. As the broth starts to burble, ladle the liquid over the noodles on top to soften them, then stir them in with a jam-packed array of sausages, beans, tofu and kimchi.\n\nOther must-try dishes at Seven Star Pocha are the pizza-sized seafood pancake stuffed with calamari, shrimp and mussels, and boneless fried chicken: try a double plate with sweet chilli glaze on one side and creamy onion on the other. This trending combo sees chicken pieces covered in sliced raw onions and smothered in a bechamel-like sauce.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/business/companies/banks-step-in-to-keep-healthscope-running-as-receivers-appointed-20250526-p5m25x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Banks step in to keep Healthscope running as receivers appointed",
    "publish_date": "Mon, 26 May 2025 12:04:00 +1000",
    "category": "finance",
    "authors": [
      "Colin Kruger"
    ],
    "text": "One of Australia’s largest private hospital owners Healthscope has gone into receivership after its lenders voted to end their support for the current owner, Brookfield, which has been unable to pay to keep facilities, including Sydney’s embattled Northern Beaches Hospital, open.\n\nReceivers have been appointed from McGrathNicol with the Commonwealth Bank and Westpac, two of the lenders owed $1.6 billion, providing additional funding for both receivers’ sales process, and working capital for the hospitals to ensure the hospital operations continue as normal.\n\nHealthscope’s troubled Northern Beaches Hospital will come under the microscope as receivers look to sell the business. Credit: Renee Nowytarger\n\nHealthscope has 38 private hospitals – including Sydney’s Northern Beaches Hospital, Holmesglen Private Hospital and The Melbourne Clinic – which house 5000 beds and employ 17,000 staff across the country.\n\nBrookfield, which has more than $1 trillion of assets under management and paid $4.4 billion for Healthscope in 2019, has been unable to find a buyer for the business and attempted to hand control to the dozens of parties which made up the debt syndicate, including Australia’s Big Four banks.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/gary-linekers-final-goodbye-from-match-of-the-day-20250526-p5m28s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gary Lineker's final goodbye from Match of the Day",
    "publish_date": "Mon, 26 May 2025 12:02:44 +1000",
    "category": "finance",
    "authors": [],
    "text": "Gary Lineker's final goodbye from Match of the Day\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/politics/federal/higher-power-bills-to-kick-in-from-july-20250526-p5m25c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Higher power bills to kick in from July",
    "publish_date": "Mon, 26 May 2025 12:01:15 +1000",
    "category": "finance",
    "authors": [
      "Mike Foley"
    ],
    "text": "Higher-than-forecast power bills have been announced by the market regulator in its latest round of annual price setting, which will kick in for households from July 1.\n\nPrice caps will rise for hundreds of thousands of customers by up to 9.7 per cent in the hardest-hit areas of NSW and up to 5 per cent in parts of Victoria.\n\nPower prices will rise from July 1. Credit: Nine.\n\nThe price spikes were driven by higher costs in the electricity grid in the past year, driven by breakdowns at coal-fired power plants, elevated fossil fuel prices and rising costs for network infrastructure.\n\nHowever, Prime Minister Anthony Albanese is doubling down on his ambitious renewable energy plans, declaring it the cheapest new source of power, while the federal Coalition brawls over the emissions targets and its commitment to build nuclear energy instead of wind and solar farms.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/heavily-strapped-haas-makes-fleeting-appearance-at-blues-training-20250526-p5m262.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Heavily strapped Haas makes fleeting appearance at Blues training",
    "publish_date": "Mon, 26 May 2025 12:00:04 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Payne Haas still appeared hampered by a quad injury as one of Laurie Daley’s former Queensland Origin opponents made a surprise appearance at training at Ballymore on Monday.\n\nHaas had his left quad heavily strapped and only completed a handful of tackles during the opposed session against Queensland Cup side Wynnum Manly before reverting to sprint drills on the sideline.\n\nBlues officials remain hopeful the game’s best front-rower will be fit to start at Suncorp Stadium on Wednesday night, with Stefano Utoikamanu on stand-by.\n\nAs Haas races the clock, Les Kiss, the former Queensland winger and incoming Wallabies coach was spotted on the sidelines.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/business/the-economy/trump-misfires-again-in-his-war-on-the-world-20250526-p5m24s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump misfires again in his war on the world",
    "publish_date": "Mon, 26 May 2025 11:58:33 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "The problem that the EU has is that, even after weeks of negotiations, it has no clear idea of what, in Trump’s mind, constitutes a good deal, or even just a deal. Trump, as his post indicated, isn’t interested in deals, just a one-sided outcome where his will prevails, with the US making no meaningful concessions of its own. He’s a unilateralist. Trump agreed to delay the tariffs after a “very nice” phone call with EU commission president Ursula von der Leyen. Credit: AP The EU has made it clear that the US needs to offer up concessions of its own if it wants a deal – it is prepared to negotiate but doesn’t want Trump to dictate its trade and tax policies without offering anything in return. It’s prepared to retaliate with €95 billion ($166 billion) of tariffs of its own if there is no reasonable deal and could also, if forced into a corner, target the big US tech companies. It already has imposed tariffs of €21 billion on US imports in response to Trump’s 25 per cent tariffs on steel and aluminium imports to the US.\n\nTrump’s walking back of his threat, or at least putting a hold on it until July 9, is consistent with previous behaviours, particularly in the confrontation with China. Loading He gets impatient with his inability to announce a big deal – that other countries don’t just fold immediately in the face of his demands – threatens massive tariffs (145 per cent in China’s case) and then, when cooler heads prevail or the markets respond badly, he blinks. While the US sharemarket slipped only modestly on Friday, bond yields, which are closely watched by the White House, edged up again, with the yield on 30-year bonds remaining above the sensitive 5 per cent level. The dollar weakened again, depreciating 0.8 per cent against the basket of America’s major trading partners’ currencies. It is now down about 9.9 per cent since the start of the year. The EU is America’s largest trading partner, with total two-way trade in goods of about $US975 billion last year. By comparison, the trade with China amounted to $US582 billion.\n\nDisruption to the transatlantic trade – a tit-for-tat tariff war -- would be very damaging to both economies and could help tip both into recession, but could be particularly damaging to the US if other major economies also responded to Trump’s trade wars with tariffs of their own. Trump’s threat to impose a 25 per cent tariff on Apple products, and Samsung’s, unless they make their smartphones in Americas shows how little he understands about modern sophisticated manufacturing and the near-impossibility of Apple being able to deliver what he is demanding. “I have long ago informed Tim Cook of Apple that I expect their iPhone’s (sic) that will be sold in the United States of America will be manufactured and built in the United States, not India, or anyplace else,” he said in the Truth Social post on Friday. Apple, in an effort to tap into India’s vast market aided by significant Indian government incentives, built a manufacturing presence there over nearly a decade.\n\nRoughly 20 per cent of its iPhone are manufactured in India and, after the trade tensions between the US and China exploded this year, the company had planned to use it (and the lower tariff rates the US applied to Indian exports) as the base for iPhones sold into the US. Apple has a vast and complex supply chain. It sources the 2700 or so components of its phones from more than 185 supplies in more than 40 countries, with some components provided by countries with deep specialist skills – like Japan for cameras, or South Korea for screens. In China, Taiwan’s Foxconn assembles iPhone in massive production facilities. “iPhone City” in Zhengzhou employs more than 300,000 people with a mixture of highly skilled engineers and low-skilled workers assembling the devices. Foxconn has expanded into India, alongside Apple. It would be near-impossible for Apple to replicate a supply chain it has spent two decades developing within America. It could build a high-tech facility, with lots of robotics, to try to replace the low-skilled workers its suppliers employ in China and India, but it wouldn’t have the engineers and would still have to rely on imported components.\n\nIt would also take years, probably at least five, to build the facility and tens of billions of dollars. Its phones would cost Americans two or three times, if not more, what they cost today. All in order to make a product that Apple itself has conceded might be superseded by new types of devices within a decade. Last week’s Open AI’s purchase of artificial intelligence device startup io, which was co-founded by Apple’s former design chief Jony Ive, may be a foretaste of what’s to come. Trump, as his post indicated, isn’t interested in deals, just a one-sided outcome where his will prevails, with the US making no meaningful concessions of its own. He’s a unilateralist. It would almost certainly be cheaper and less risky for Apple to pay Trump’s tariffs than to invest tens of billions of dollars to make second-rate, but very expensive, American-made iPhones sometime next decade. Friday’s social media post, and even Sunday’s about-face, are consistent with the inconsistency with which Trump and his administration have waged their trade wars.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/world/north-america/the-trumps-are-monetising-the-presidency-like-never-before-but-where-is-the-outrage-20250526-p5m287.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Trumps are monetising the presidency like never before. But where is the outrage?",
    "publish_date": "Mon, 26 May 2025 11:50:14 +1000",
    "category": "finance",
    "authors": [
      "Peter Baker"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size When Hillary Clinton was US first lady, a furore erupted over reports that she had once made $US100,000 from a $US1000 investment in cattle futures. Even though it had happened a dozen years before her husband became president, it became a scandal that lasted weeks and forced the White House to initiate a review. Thirty-one years later, after dinner at US President Donald Trump’s Mar-a-Lago estate, Amazon executive chairman Jeff Bezos agreed to finance a promotional film about first lady Melania Trump that will reportedly put $US28 million ($43 million) directly in her pocket – 280 times the Clinton lucre and in this case from a person with a vested interest in policies set by her husband’s government. Scandal? Furore? Washington moved on while barely taking notice. The Trumps are hardly the first presidential family to profit from their time in power, but they have done more to monetise the presidency than anyone who has ever occupied the White House. The scale and the scope of the presidential mercantilism have been breathtaking. The Trump family and its business partners have collected $US320 million in fees from a new cryptocurrency, brokered overseas real estate deals worth billions of dollars and are opening an exclusive club in Washington called the Executive Branch charging $US500,000 apiece to join, all in the past few months alone. The Trumps have done more to monetise the presidency than anyone who has ever occupied the White House. Credit: nna\\miriah.davis Just last week, Qatar handed over a luxury jet meant for Trump’s use, not just in his official capacity but also for his presidential library after he leaves office. Experts have valued the plane, formally donated to the Air Force, at $US200 million, more than all the foreign gifts bestowed on all previous American presidents combined. And Trump hosted an exclusive dinner at his Virginia club for 220 investors in the $TRUMP cryptocurrency that he started days before taking office in January. Access was openly sold based on how much money they chipped in – not to a campaign account but to a business that benefits Trump personally. By conventional Washington standards, according to students of official graft, the still-young Trump administration is a candidate for the most brazen use of government office in American history, perhaps eclipsing even Teapot Dome, Watergate and other famous scandals.\n\nAdvertisement\n\n“I’ve been watching and writing about corruption for 50 years, and my head is still spinning,” said Michael Johnston, a professor emeritus at Colgate University and author of multiple books on corruption in the United States. Yet a mark of how much Trump has transformed Washington since his return to power is the normalisation of moneymaking schemes that once would have generated endless political blowback, televised hearings, official investigations and damage control. The death of outrage in the Trump era, or at least the dearth of outrage, exemplifies how far the president has moved the lines of accepted behaviour in Washington. Loading Trump, the first convicted felon elected president, has erased ethical boundaries and dismantled the instruments of accountability that constrained his predecessors. There will be no official investigations because Trump has made sure of it. He has fired government inspectors general and ethics watchdogs, installed partisan loyalists to run the Justice Department, FBI and regulatory agencies and dominated a Republican-controlled Congress unwilling to hold hearings. As a result, while Democrats and other critics of Trump are increasingly trying to focus attention on the president’s activities, they have had a hard time gaining any traction without the usual mechanisms of official review. And at a time when Trump provokes a major news story every day or even every hour – more tariffs on allies, more retribution against enemies, more defiance of court orders – rarely does a single action stay in the headlines long enough to shape the national conversation. Paul Rosenzweig, who was a senior counsel to Ken Starr’s investigation of president Bill Clinton and later served in the George W. Bush administration, said the lack of uproar over Trump’s ethical norm-busting has made him wonder whether longstanding assumptions about public desire for honest government were wrong all along. “Either the general public never cared about this,” he said, or “the public did care about it but no longer does.” He concluded that the answer is that “80 per cent, the public never cared” and “20 per cent, we are overwhelmed and exhausted”.\n\nAdvertisement\n\n“Outrage hasn’t died,” Rosenzweig added. “It was always just a figment of elite imagination.” The White House has defended Trump’s actions, brushing off questions about ethical considerations by saying that he was so rich that he did not need more money. “The president is abiding by all conflict of interest laws that are applicable to the president,” White House press secretary Karoline Leavitt said. “The American public believes it is absurd for anyone to insinuate that this president is profiting off of the presidency. This president was incredibly successful before giving it all up to serve our country publicly.” But saying that he is abiding by all conflict of interest laws that are applicable to the president is meaningless since, as Trump himself has long noted, conflict of interest laws are not applicable to the president. Moreover, he has not given it all up; in fact, he is still making money from his private business interests run by his sons, and independent estimates indicate that he has hardly sacrificed financially by entering politics. Forbes estimated Trump’s net worth at $US5.1 billion in March, a full $US1.2 billion higher than the year before and the highest it has ever been in the magazine’s rankings. The president’s sons scoff at the idea that they should limit their business activities, which directly benefit their father. Donald Trump Jr has said that the family restrained itself during his father’s first term only to be criticised anyway, so it made no sense to hold back any more. “They’re going to hit you no matter what,” he said last week at a business forum in Qatar. “So we’re just going to play the game.”\n\nAdvertisement\n\nThere have been some burgeoning signs of public pushback in recent days. The gift of the Qatar plane seemed to break through to the general audience in a way that other episodes have not. A Harvard/CAPS Harris poll released last week found that 62 per cent of Americans thought the gift “raises ethical concerns about corruption”, and even some prominent right-wing Trump supporters like Ben Shapiro and Laura Loomer voiced objections. Tucker Carlson, the former Fox News host who campaigned with Trump last year, expressed misgivings this week during a podcast with Shawn Ryan, a right-wing influencer, who mentioned all the Trump family business deals that seemed to coincide with the president’s recent trip to the Middle East. “That stuff kind of worries me,” Ryan said. “Well, it seems like corruption, yeah,” Carlson agreed. Trump Organisation executive vice president of development and acquisitions Donald Trump Jr at the Qatar Economic Forum in Doha last week. Credit: Bloomberg But while several dozen demonstrators protested outside Trump’s golf club the other night, Democrats are split about how much to focus on Trump’s profit making, with some preferring to concentrate on economic issues. Senator Christopher Murphy has been leading the charge in the other direction, making floor speeches and leading news conferences denouncing what he calls “brazen corruption”. “It is unlikely he is going to be held accountable through traditional means,” Murphy said in an interview. “There are going to be no special counsels; there’s going to be no DOJ action. And so it’s really just about public mobilisation and politics. If Republicans keep paying a price for the corruption by losing special elections throughout the next year, maybe that causes them to rethink their complicity.” Trump had long promised to “drain the swamp” in Washington after years of corruption by other politicians. When he first ran for president in 2016, he excoriated the Clintons for taking money from Saudi Arabia and other Middle East monarchies with an obvious interest in currying favour in case Hillary Clinton won the presidency. But that money went to the Clinton Foundation for philanthropic purposes. The money Trump’s family is now bringing in from the Middle East is going into their personal accounts through a variety of ventures that The New York Times has documented.\n\nAdvertisement\n\nJohnston said the Trumps represented “an absolute outlier case, not just in monetary terms” but also “in terms of their brazen disregard” for past standards. “While we might disagree as to the merits of policy, the president and figures in the executive branch are expected to serve the public good, not themselves,” he said. Trump made a nod at those standards in his first term by saying he would restrict his family business from doing deals overseas. But since then, he has been convicted of 34 felony counts for falsifying business records and held liable in civil court for fraud while the Supreme Court has conferred immunity on him for official acts. In his second term, Trump has dispensed with self-imposed ethical limits. Loading “He’s not trying to give the appearance that he’s doing the right thing any more,” said Fred Wertheimer, founder of Democracy 21 and a long-time advocate for government ethics. “There’s nothing in the history of America that approaches the use of the presidency for massive personal gain. Nothing.” Congressional Republicans spent years investigating Hunter Biden, the son of President Joe Biden, for trading on his family name to make millions of dollars, even labelling the clan the “Biden Crime Family”. But while Hunter Biden’s cash flow was a tiny fraction of that of Donald Trump Jr, Eric Trump and Jared Kushner, Republicans have shown no appetite for looking into the current presidential family’s finances. “The American public has had to inure itself to the corruption of Donald Trump and his presidency because the president and his Republican Party have given the American public no choice in the matter,” said J. Michael Luttig, a conservative former appeals court judge who has become a critic of Trump. Trump evinces no concern that people funnelling money into his family coffers have interests in government policies. Some of the crypto investors who attended his dinner on Thursday night acknowledged that they were using the opportunity to press him on regulation of the industry. According to a video obtained by the Times, he reciprocated by promising guests that he would not be as hard on them as the Biden administration was.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/wa-news-live-e-scooter-rider-fighting-for-life-after-hit-and-run-20250525-p5m22b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: E-scooter rider fighting for life after hit-and-run",
    "publish_date": "Mon, 26 May 2025 11:48:21 +1000",
    "category": "finance",
    "authors": [],
    "text": "First flagged last year, the WA government’s new Stop Puppy Farming reforms come into effect today.\n\nFrom now on, approved pet shops can only sell dogs or puppies supplied by approved animal rescue shelters and pounds who have got a permit from their local government.\n\nLocal governments will assess applications, with dog-supply approval applications managed by the Department of Local Government, Sport and Cultural Industries.\n\nFrom Monday, pet shops can only sell dogs and puppies from approved shelters. Credit: Getty Images\n\nIt would appear the laws couldn’t come at a better time, after a 40-year-old man has been charged with 36 counts of animal cruelty last week.\n\nThe RSPCA WA received a cruelty report from the City of Canning about the property in December, with council rangers advising there were a large number of dogs roaming outside the property, two which had been taken away for urgent vet attention.\n\nHowever, despite support for the new laws from animal welfare groups, there are reports that so far no pet shops have applied for the permit.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/the-trouble-with-taniela-tupou-20250525-p5m1yq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The trouble with Taniela Tupou",
    "publish_date": "Mon, 26 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "Taniela Tupou’s yellow card against the Force for a bizarre slide tackle is a big issue for the Wallabies. Joe Schmidt must be wondering if he can genuinely trust Tupou against the British and Irish Lions, because any such act will cost them a Test. That incident will put the Lions wind-up merchants on notice, and it doesn’t take a massive stretch of the imagination to envisage players such as Ellis Genge trying to get under Tupou’s skin. The shame in all of this is that Tupou appears to be a very likely player that everyone is willing to come through this rough period, but that combustibility is a big red flag ahead of a series that will be intense in every phase of play.\n\nClub World Championship will outshine Nations Cup\n\nChristmas came early for Super Rugby over the weekend with confirmation from Europe that the club world championship will finally and miraculously come into effect in 2028. Although the details are yet to be unveiled in detail, the outline of the 16-team comp is extraordinarily generous towards Super Rugby, with the top six teams at least set to be included to face that year’s Champions Cup quarter finalists. It means the URC winners, or England Premiership winners, could miss out if they have a bad Champions Cup campaign, yet the door would be open for the Super Rugby outfit that finishes sixth. As a concept, this competition is far more appealing than the Nations Cup concept, and the Herald predicts that supporter interest will be through the roof, with the first edition of the quadrennial tournament to be held in Europe. This is a big moment for the game, and a brilliant deal for Super Rugby.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/property/news/two-bedroom-northbridge-home-fetches-6-1m-in-21-bidder-auction-20250526-p5m257.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Two-bedroom Northbridge home fetches $6.1m in 21-bidder auction",
    "publish_date": "Mon, 26 May 2025 11:37:23 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "A two-bedroom home in Northbridge was snapped up by a developer for $6.1 million at auction on Saturday.\n\nThe dated red-brick house at 5 Harden Avenue sits on a 765-square-metre block and was guided between $4.75 million to $5 million.\n\nTwenty-one parties registered, most were developers and five actively bid before a crowd of 120 in the simple backyard.\n\nBidding opened at $5.3 million and accelerated in $100,000 and $50,000 strides and rapidly cleared its $5.5 million reserve. A few smaller bids at $10,000 and $1000 were placed before $100,000 bids were met out, winning the keys for $6.1 million for the determined buyer.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/payne-haas-training-with-nsw-on-monday-20250526-p5m28h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Payne Haas training with NSW on Monday",
    "publish_date": "Mon, 26 May 2025 11:31:17 +1000",
    "category": "finance",
    "authors": [],
    "text": "Payne Haas training with NSW on Monday\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/national/nsw/the-least-punctual-train-lines-in-sydney-revealed-20250515-p5lzhh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The least punctual train lines in Sydney revealed",
    "publish_date": "Mon, 26 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Cindy Yin"
    ],
    "text": "All six of Sydney’s major suburban train lines have failed to meet punctuality targets set by Transport for NSW, with one in five peak hour services running late in some of the worst-affected lines despite a decade-long project to improve the network’s reliability.\n\nThe worst performing train lines on average in the past five years have been the T1 North Shore and T9 Northern Line, with an average of just 86 and 88 per cent of all services running on time, respectively. It is below Sydney Trains’ benchmark to have at least 92 per cent of peak-hour suburban services arrive at stations within five minutes of their scheduled time.\n\nAnnual performance averages show every train line except for the T8 Airport and South line has not met this target for more than three years. The most punctual train lines were the T4 Eastern Suburbs and Illawarra line and the T8 Airport and South line, with 90 and 92 per cent of all services, respectively, coming on time.\n\nA handful of stations on Sydney’s train network are also equipped with Sydney Metro stations, making them optimal for commuters looking to transfer between train and metro services. For example, Epping station on the T9 Northern Line and Chatswood station on the T1 North Shore Line both serve as popular interchanges for commuters.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/business/companies/the-53-billion-deal-that-started-with-a-love-letter-20250522-p5m179.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The $53 billion deal that started with a love letter",
    "publish_date": "Mon, 26 May 2025 11:28:18 +1000",
    "category": "finance",
    "authors": [
      "Michelle F. Davis",
      "Liana Baker"
    ],
    "text": "The week prior, Donald Trump had been re-elected as US president. With Trump back in the White House, Charter felt it might have an easier time getting regulators on board with a deal than under his predecessor Joe Biden’s antitrust cops, who many felt had been against big deals regardless of their merits. A representative for Liberty Broadband declined to comment. Takeover template Charter already had a well-thumbed playbook for bringing large, billionaire shareholders into its fold. In 2015, it agreed to buy a majority stake in the billionaire Newhouse family’s cable company Bright House Networks from its parent Advance. It paid for the holding with several types of stock and cash. That, along with the more recent Liberty Broadband deal, served as a template for the Cox negotiations. A so-called Up-C structure was used, which allows a closely held company like Cox to go public while keeping some tax advantages.\n\nAdvance, meanwhile, still has seats on Charter’s board and some consent rights, so it didn’t make sense to offer Cox something significantly different from what the longtime partner already had. Eric Zinterhofer, Charter’s non-executive chairman, was tasked with getting the Newhouses comfortable with the idea of a Cox deal, assuring them that the dynamic wouldn’t change when Cox came in. A representative for Advance couldn’t be reached for comment. Cox is a 127-year-old company. Credit: Bloomberg As Charter was making preparations behind the scenes, Cox had also been considering its future. Over the previous two years the advantages of scale and scope in cable had become more apparent, as wireless companies lured away broadband subscribers with their own fibre offerings and abundant streamed content emboldened consumers to cut the cord on cable. Cox early last year brought in consultants from McKinsey & Co to conduct a review, including looking at the company’s position in the industry.\n\nWinfrey’s letter, sent months after McKinsey had wrapped up its review, came at the perfect time. In the multipage missive – which several of the people referred to as a love letter given when it was sent – he praised the company that the Cox family had built and laid out the strategic rationale for a deal: the added scale from a combination would position them to better compete and enable them to bundle offerings and more efficiently invest in infrastructure. Before deciding to engage, Taylor consulted internal confidantes like Cox president Dallas Clement, and brought in external advisers to determine the best path forward. The company also deliberated whether to canvas the market for other potential tie-ups, but ultimately decided to unilaterally negotiate with Charter. Daily discussions Once negotiations were underway, Taylor and Winfrey stayed in near constant communication, exchanging text messages and phone calls daily. The men had spent years getting to know each other, and wanted to keep as much of the negotiations as possible between the two of them to avoid leaks. Inside Cox, the deal was known as Project Horizon. At Charter it was called Project Cabot for Italian explorer John Cabot, who led voyages to the east coast of North America in the 15th Century.\n\nMeanwhile, Clement rallied Cox’s advisers and put together a five-week plan for due diligence to be conducted on Charter’s operating plan, strategy, capital structure and legal agreements. Advisers flew down to Atlanta to help prep Taylor and other members of Cox’s management team for negotiating sessions, and Cox set a goal of having a formal response to Charter’s term sheet by early May. The deal would unite two of the biggest US cable providers. Credit: Bloomberg Once that response was sent, the two sides reached a handshake agreement within a week. The deliberations were able to move smoothly in part because the people around the table already knew each other well. Citigroup’s Dan Richards and Christina Mohr were among the team advising Charter, while Cox’s bankers included Evercore’s Eduardo Mestre and Dan Mendelow, Wells Fargo & Co’s Derek Van Zandt and Jeff Hogan and Allen & Co’s Ketan Mehta and Nancy Peretsman. Mestre, Richards, Mohr and Van Zandt all worked together at Citigroup, with Mehta overlapping with some of them at the same bank.\n\nByron Trott, whose firm also won a role advising Cox, has been on the Cox Enterprises board for a decade and has known the family for years. LionTree’s Aryeh Bourkoff and Ehren Stenzler have been close to Charter and companies associated with Malone for years. Sweet finish The main discussions were around valuation, how much of the combined company Cox would own and what the breakdown would be between cash, convertible preferred stock and common stock. The Cox family also wanted to have a continued presence in Atlanta, but moving the headquarters there wasn’t a dealbreaker. The combined company, which will be called Cox, will be headquartered in Stamford, Connecticut, but keep a significant presence in Atlanta. Last week, Taylor and Winfrey had decided they wanted to announce a deal by Friday morning. They agreed to sprint towards a deadline of 7am. To keep everyone on track the night before the deal, lawyers for all stakeholders – fuelled in at least one office by a late-night ice-cream order – agreed to check in with each other every few hours. If at any point they hit an impasse that would keep them from making the deadline, they’d agree to continue over the weekend.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/property/news/family-who-had-been-looking-for-ages-beats-11-others-to-1-01m-melbourne-home-20250526-p5m258.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Young family beats seven others, pays $1.85m for Melbourne home post-rate cut",
    "publish_date": "Mon, 26 May 2025 11:21:15 +1000",
    "category": "finance",
    "authors": [
      "Shona Hendley"
    ],
    "text": "“The rate cut definitely helped with bidding confidence, and I think it will help the market get even stronger,” Kohli said. Loading The property was one of 1184 scheduled to go to auction in Melbourne this week. By evening, Domain Group recorded a preliminary auction clearance rate of 70.8 per cent from 876 reported results throughout the week, while 63 auctions were withdrawn. Withdrawn auctions are counted as unsold properties when calculating the clearance rate. Elsewhere, an upsizing family beat 11 other registered bidders for a double-storey Gladstone Park home, only ever owned by one family, paying $1.01 million at auction on Saturday, well over its reserve. The home at 16 Goodwood Crescent was listed with a price range of $770,000 to $820,000.\n\nLead agent and auctioneer Phillip Mercieca from Ray White Gladstone Park said it was a “fantastic campaign.” “The home was very popular with over 90 people through in four weeks.” The property’s spaciousness and five bedrooms were major drawcards with many families interested in the home. The “hotly contested auction” had 12 registered bidders, a mix of young families and second and third-home buyers.\n\nThe auction opened at $830,000, just shy of its $850,000 reserve. Mr Mercieca described the bidding as “fierce”. Loading “In the end, only six bidders were active, with some of the others not even able to get their hand up,” he said. The home sold to a family who had been looking to upsize for a long time. “They were incredibly excited,” said Mercieca. The vendors who had built the home in 1985 were equally thrilled. “There was a bit of emotion as it was the family home, but they were overjoyed,” said Mercieca.\n\nThe result shows the strength of the current market, believes Mercieca. Last week the Reserve Bank cut the cash rate for the second time this year. “The market is alive and well, and demand is outstripping supply at the moment, which is pushing prices up,” he said. “Hopefully, we see more listings come on to meet the demand we’re getting, but we’re definitely seeing more confidence from buyers.” In Brunswick, a single-storey terrace sold at auction for $1.21 million on Saturday, over its reserve of $1.17 million. Records show it last sold for $675,000 in 2012.\n\n48 Frederick Street was listed with a price guide of $1.05 million to $1.15 million. Loading The auction had four active bidders, including two investors - one from Western Australia - and two young couples. “It is in a really good spot with bigger than average bedrooms and storage,” said lead agent Scott McElroy from Belle Property Carlton. “It’s also walking distance to the train station, which was a feature that appealed to the bidders,” he said.\n\nThe auction opened with a bid of $1.05 million, and went up in $10,000 increments, then slowed down to $5,000 and $2,500. “It ended up being bought by an investor from Western Australia who plans to rent it out,” said McElroy. McElroy said that while the recent interest rate cut hasn’t generated an obvious impact yet, he has noticed the market picking up in recent weeks. “We are seeing more people come through open for inspections and more emails and phone calls,” he said. “We’re seeing quite a few Sydney investors on the phone, too.” PRD chief economist Dr Diaswati Mardiasmo agreed, believing the auction clearance rate shows that last week’s RBA rate cut did work in “nudging some sticky buyers to purchase and make a decision.”",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-slide-trump-unsettles-wall-street-20250526-p5m23n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX dips, WiseTech jumps after $3.2b acquisition; $A hits US65c",
    "publish_date": "Mon, 26 May 2025 11:18:49 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "The Australian sharemarket opened close to flat after President Donald Trump announced he would extend the deadline for the European Union to face 50 per cent tariffs until July 9 after a phone call with European Commission President Ursula von der Leyen.\n\nThe ASX was 6 points or 0.1 per cent lower shortly before 11am, as technology stocks gained thanks to a jump in local tech giant WiseTech.\n\nWall Street had its worst week in nearly two months. Credit: AP\n\nShares in WiseTech, the biggest tech stock on the ASX, jumped 5.7 per cent after the company announced it was buying US logistics software business e2open. The deal values e2open at $US2.1 billion ($3.2 billion), and WiseTech said the transaction would give it access to new customers and markets.\n\n“Acquiring e2open is a strategically significant step in achieving our expanded vision to be the operating system for global trade and logistics,” WiseTech founder and executive chair Richard White said.",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/property/news/mediterranean-style-masterpiece-built-in-six-months-sells-for-3-91m-20250526-p5m259.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mediterranean-style masterpiece built in six months sells for $3.91m",
    "publish_date": "Mon, 26 May 2025 11:11:07 +1000",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A Mediterranean-style masterpiece built in six months has sold for $3.91 million at auction, with a local couple placing the winning bid 40 minutes after seeing it for the first time.\n\nDubbed Casa Agape, the five-bedroom, four-bathroom showstopper at 68 Burn Street, Camp Hill, features soaring three-metre-high ceilings, a luxe pool house and a media room – and now holds the street’s house price record.\n\nWith a crowd of 150 onlookers, five bidders stepped into the auction ring on Saturday, a local doctor throwing down a $3.5 million opening bid.\n\nBidding climbed in $100,000 leaps to $3.7 million before the auction paused at $3.82 million, with the late-arriving couple negotiating on the floor to seal the deal.",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.smh.com.au/culture/music/superstar-lorde-crashes-her-own-theme-party-at-sydney-nightclub-20250526-p5m25v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Superstar Lorde crashes her own theme party at Sydney nightclub",
    "publish_date": "Mon, 26 May 2025 11:06:13 +1000",
    "category": "entertainment",
    "authors": [
      "Hannah Kennelly"
    ],
    "text": "What Was That is the lead single from pop singer Lorde’s new album – but it also aptly describes the reactions of some lucky Sydney fans who couldn’t believe their eyes when the Kiwi star turned up on the dance floor among them at the weekend.\n\nOn Sunday night, the Grammy award-winning songstress made a surprise appearance at a Lorde-themed night at Mary’s Underground nightclub, delighting unsuspecting fans.\n\n“Lorde appearing at Mary’s Underground in Sydney tonight was not on my 2025 bingo card but I fear I’ve won,” a user posted on TikTok.\n\nFootage shows the 28-year-old singer belting out her own lyrics and dancing with fans to a Girl, so confusing remix with Charli XCX. At one point, she gets behind the DJ decks while fans dance around her, using their phones to create a giant spotlight.",
    "source": "SMH",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/new-electricity-safety-net-prices-not-welcome-news-for-australians-in-some-states/fal7w5nt1",
    "title": "New electricity prices 'not welcome news' for Australians in some states",
    "publish_date": "Mon, 26 May 2025 01:15:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Electricity prices are set to rise for almost half a million households in NSW, south-east Queensland, and South Australia from 1 July.\n\n\n\n\n\nThe Default Market Offer (DMO), a reference price for electricity set by the Australian Energy Regulator (AER), will increase for 475,727 residences and 91,060 small businesses in these states.\n\n\n\n\n\nThe DMO is updated yearly and acts as a price cap that energy retailers can charge residential and small business customers on default contracts, also known as standing offer contracts.\n\n\n\n\n\nVictoria also released its DMO on Monday.\n\n\n\nHow much are the increases for residences?\n\nThe costs of electricity will be higher than last year, as the wholesale costs and the price of transporting electricity have risen, according to AER.\n\n\n\n\n\nThe AER said retail costs, such as the cost of billing customers, running call centres, acquiring new customers, managing defaults, and the rollout of smart meters, have added to the price hikes.\n\n\n\n\n\nIn NSW, residential customers without controlled load will be hit with price hikes of 8.5 per cent to 9.1 per cent, while customers with controlled load will face increases of 8.3 per cent to 9.7 per cent.\n\n\n\n\n\nResidential customers without controlled load in south-east Queensland will face price increases of 3.7 per cent. Customers with controlled load will be hit with price increases of 0.5 per cent.\n\n\n\n\n\nIn South Australia, households without controlled loads will be affected by price increases of 3.2 per cent while those with controlled loads will witness a 2.3 per cent hike in prices.\n\n\n\nElectricity prices are set to rise in several states from July, with the Australian Energy Regulator confirming increases of up to 9.7 per cent for households in NSW. Source: SBS News AER chair Clare Savage said the price hikes are \"not welcome news\".\n\n\n\n\n\n\"We know this is not welcome news for consumers in the current cost-of-living environment,\" she said.\n\n\n\n\n\n\"As noted in our draft determination, sustained pressures across almost all components of the DMO have driven these price rises, with wholesale and network costs rising in most jurisdictions between 1 per cent and 11 per cent, and retail costs between 8 per cent and 35 per cent compared with last year.\"\n\n\n\n\n\nDomestic customers in Victoria will pay about 1 per cent more than last year.\n\n\n\nWhat about small businesses?\n\nSmall business customers on standing offer plans will experience increases of 0.8 per cent to 8.5 per cent, depending on the region.\n\n\n\n\n\nThose in NSW will face increases of 7.9 per cent to 8.5 per cent.\n\n\n\nSmall business customers based in south-east Queensland will witness increases of 0.8 per cent, and those in South Australia will be hit with a 3.5 per cent hike in prices.\n\n\n\n\n\n\n\nAnd small businesses in Victoria will pay around 3 per cent more.\n\n\n\nContact your retailer for a better offer\n\nSavage said you can contact your retailer for a better offer below the DMO.\n\n\n\n\n\n\"I strongly encourage all consumers to avoid staying on an old or uncompetitive plan. Contact your retailer to see if you can get a better offer or shop around,\" she said.\n\n\n\n\n\n\"At least every 100 days, your retailer must tell you on the front page of your bill if they can offer you a better deal.\"\n\n\n\nREAD MORE Will nuclear lead to cheaper energy prices? Experts weigh in\n\nSally Tindall, data insights director at financial comparison site Canstar Blue, said switching plans could save consumers hundreds of dollars.\n\n\n\n\n\n\"These electricity price hikes will knock the wind out of the sails for many families, just when they thought they'd turned a corner in the cost-of-living crisis.\n\n\n\n\n\n\"Our research shows switching from an average-priced plan to one of the lowest in the market could save you over $400 a year in some cases — this, for some households, could be enough to mitigate the upcoming price hikes.\n\n\n\n\n\n\"If you can't pay your electricity bill, contact your provider straight away and ask what options might be available. Every electricity provider has a hardship program they must offer you to help you get back on track.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 8
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/nationals-play-down-speculation-of-a-leadership-spill-after-coalition-breakup/18yys7bsi",
    "title": "Nationals play down speculation of a leadership spill after Coalition breakup",
    "publish_date": "Sun, 25 May 2025 07:35:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAs regional communities confront devastating floods, the National Party is in a storm of its own making.\n\n\n\n\n\nLeader David Littleproud telling Sky News he doesn't care if he loses his job.\n\n\n\n\n\n\"I did what my party room said and I backed them 110 per cent. I'm proud of the fact that we did this – and we didn't do this lightly. It's not something we took great enjoyment on but why would we walk away from something to the people we represent.\"\n\n\n\n\n\nMr Littleproud's leadership is in doubt, after splitting from long-time partners – the Liberals – on Tuesday.\n\n\n\n\n\n\"This is one of the hardest political decisions of my life. But you know what? I didn't make it by myself. I made it through the collective wisdom of everyone sitting in that room today, getting to it through their lived experience of who they represent and what they want to be able to leave for them and next generations.\"\n\n\n\n\n\nA reunion was floated by Thursday and rumours of a leadership spill by Friday, fuelled by Michael McCormack, who used an infamous line:\n\n\n\n\n\n\"I am ambitious for David, I want the Nationals to be the best they can be. He's our leader and I support him. I am not planning on rolling David any time soon – this week has been messy. It has.\"\n\n\n\n\n\nIt's one uttered two days before former Prime Minister Scott Morrison knifed Malcolm Turnbull.\n\n\n\n\n\nMORRISON: \"This is my leader, and I'm ambitious for him!\"\n\n\n\n\n\nTURNBULL: \"Thanks ScoMo (Scott Morrison).\"\n\n\n\n\n\nBut Sunday, arrived with no such challenge.\n\n\n\n\n\nNationals' Deputy, Kevin Hogan, backing him in – while speaking to David Speers on ABC Insiders.\n\n\n\n\n\n\"My belief David, is that David Littleproud has very, very strong support in the Nationals party room and I would say even more support after the process that he followed, how transparent he was with the Nationals party room and the result - even though it wouldn't be the ideal route to get to where we got, given it was so public in the end.\"\n\n\n\n\n\nThe Liberals have given in-principle support for four key policies, including to lift the ban on nuclear power.\n\n\n\n\n\nSenator Andrew Bragg told Sky News all Liberals agree with technology-agnostic energy policy, but it's unclear what that policy will look like.\n\n\n\n\n\n\"The point you're trying to draw me on here is really one of detail, and that would be subject to a further and future shadow cabinet judgement.\"\n\n\n\n\n\nMr Hogan saying the issue of net zero among the National party was settled years ago.\n\n\n\n\n\n\"The Nationals support net zero to 2050. The policy is as it is, the policy is as we took it to the election.\"\n\n\n\n\n\nTony Wood from the Grattan Institute says there's plenty of time to consider how nuclear forms part of that target before the next election.\n\n\n\n\n\n\"There's a lot of work being done globally on small modular reactors, they may turn out to be something that could play a role in Australian in 15 or 20 years, there's plenty of time to think about that and plenty of time to watch – and watch clearly – what's happening in the rest of the world.\"\n\n\n\n\n\nLabor's 2035 emissions target is due before COP30, in November.\n\n\n\n\n\nIndustry Minister Tim Ayres told Sky News the government intends to engage cabinet processes.\n\n\n\n\n\n\"We'll be focused on what is in the best interests of Australia and the Australian economy and what delivers the best result for us to make sure that we deal with the challenges of climate change but also capture the benefits onshore here in Australia in terms of industrial development. That'll be the calculation that we work through when we receive that advice.\"\n\n\n\n\n\nAs talks between the Coalition leaders continue, a resolution could still take days.\n\n\n\n\n\nThe Liberals remain committed to a comprehensive policy review after this month's resounding election defeat.\n\n\n\n\n\nThough results in some seats, are still being counted.\n\n\n\n\n\nBradfield in Sydney remains too close to call – and will go to an automatic recount.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-mould-could-be-the-next-major-concern-for-residents-hit-by-natural-disasters/s50w78ic4",
    "title": "'It’s all gone': After losing nearly everything to the floods, Kelly now faces mould and rats",
    "publish_date": "Sun, 25 May 2025 03:43:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Kelly Morgan has already started cutting up the walls and fences in her home in the New South Wales flood-hit town of Glenthorne.\n\n\n\n\n\n\"We have to get it off and dry it out before the mould sets in,\" she told SBS News in Glenthorne.\n\n\n\n\n\n\"My kitchen's just been ripped out. My laundry's been ripped out. Power points, air conditioners, everything. It's all gone.\"\n\n\n\nKelly Morgan, speaking to SBS News reporter Alexandra Jones. Morgan's home was affected in the 2021 floods but this time, she's lost her home after it was completely inundated by water. Credit: SBS News Morgan's house was painstakingly renovated after the 2021 floods. Now, she's lost virtually everything after her entire house was inundated by last week's floods.\n\n\n\n\n\nAbout 32,000 people remain isolated by floodwaters after deadly weather swept through coastal communities, with the NSW State Emergency Service estimating around 10,000 properties have been affected.\n\n\n\n\n\nResidents are now facing another issue: once waters recede, damp homes, pooled water and limited ventilation create the ideal conditions for mould to grow — sometimes within just 24 hours.\n\n\n\n\n\nMorgan expects she won't be able to live in her home for at least a year due to the scale of the damage.\n\n\n\n\n\nIn the absence of support from the army or the local council, her daughter, Sophie, is helping with the clean-up — drying out the house, clearing debris, and salvaging what little remains.\n\n\n\nKelly has been forced to burn debris on the side of the road, desperate to clear out her house before the mould sets in. Source: SBS News / Alexandra Jones Outside, streets are piled high with twisted metal, broken farm equipment and waterlogged belongings, all covered in thick, muddy sludge. With wait times at the tip stretching to over an hour, Morgan has resorted to burning debris.\n\n\n\n\n\n\"We just don't have the time to try and get this mud out before it sets,\" she said.\n\n\n\n\n\nMorgan is also facing another problem: rodents.\n\n\n\n\n\n\"We have big river rats.\"\n\n\n\nHow concerning is mould?\n\nMould might just seem like a minor annoyance, but it can have serious health consequences, particularly for children, older adults and people with chronic health conditions like asthma or allergies.\n\n\n\n\n\n\"Some moulds contain toxins some scientists feel may have health impacts,\" Associate Professor Nicholas Osborne from the University of Queensland said in a recent article.\n\n\n\n\n\n\"Others may induce allergic reactions, like hay fever.\"\n\n\n\n\n\nOsborne said mould in the home could also exacerbate existing health issues such as rhinitis, chronic obstructive pulmonary disease (COPD) and asthma.\n\n\n\n\n\n\"The jury is still out on whether it contributes to individuals getting these diseases in the first place. In general, a healthy house is one that doesn’t have much mould.\"\n\n\n\nREAD MORE Around 50,000 remain cut off as NSW flood recovery crews confront mammoth challenge\n\nWhat to do after a flood\n\nIf you've been affected by a flood, NSW Health recommends drying out your home as soon as possible to prevent mould from forming.\n\n\n\n\n\nOpen windows and doors to increase airflow, use fans where possible, and remove any pooled water or water-damaged materials.\n\n\n\n\n\nClean all affected surfaces using hot soapy water and a disinfectant or bleach solution. Gloves and protective clothing should be worn during clean-up.\n\n\n\nThe Victorian Department of Health advises removing flood-damaged items that can't be thoroughly cleaned or dried, including carpets, mattresses, furniture and wallpaper.\n\n\n\n\n\nEven if you weren't directly affected by flooding, mould can still be a problem, especially during times of high humidity. If you notice mould at home, it's important to locate and fix the source of moisture, clean any visible mould safely, and take steps to prevent it from returning.\n\n\n\n\n\nIn most cases, home insurance doesn't cover mould damage. But some policies will allow you to claim if mould damage occurs as a result of an insured event, like flooding.\n\n\n\n\n\nBut for people like Kelly Morgan, it doesn't matter. \"The flood insurance — it has to be addressed. It has to be looked at [by the government],\" she said.\n\n\n\n\n\n\"Who has $70,000 a year to insure your property?\"\n\n\n\nNSW residents appear to have the mouldiest homes according to a Compare the Market survey. Source: SBS News\n\nA growing concern\n\nAs extreme weather events become more frequent, mould could become a more common issue for households across Australia.\n\n\n\n\n\nAccording to a Compare the Market survey of 1,006 Australian adults from October 2024, one in five people (20.6 per cent) from NSW say they've experienced mould in their home in the last 12 months, above the national average of 18.7 per cent.\n\n\n\n\n\nNSW homes were the most likely to experience dampness, at a rate of 11.7 per cent, compared to the national average of 9.9 per cent.\n\n\n\nREAD MORE Collapsed ceilings and black mould: Government urged to act on terrible rentals\n\nMeanwhile, Asthma Australia's 'Homes, Health and Asthma in Australia' report from 2022 estimates that figure to be much higher nationwide, finding one third of 5,041 respondents (34 per cent) reporting mould in their home in the last 12 months.\n\n\n\n\n\nAboriginal and Torres Strait Islander people were 2.3 times more likely to report mould and 6.5 times more likely to report dampness.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/six-tips-to-prepare-for-filing-your-tax-return/zt71d9agu",
    "title": "Tax time countdown: Six things you should start doing now",
    "publish_date": "Sun, 25 May 2025 01:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's never too early to plan, especially for what can be a long and tricky tax return proces.\n\n\n\n\n\nThis financial year will finish in over a month, at the end of June, and Australians will have four months to lodge their tax returns — preparing for this early may save you time and money.\n\n\n\n\n\nMasoud Habibian, an accountant and tax agent in Australia, said this may be a \"good time to start\" to \"prepare and review\" your tax lodgement.\n\n\n\n\n\nHere are a few tips that may help you in preparing for your tax return:\n\n\n\nDouble-check your myGov account\n\nFirst of all, make sure your information in your myGov account is updated, the account is linked to the Australian Taxation Office (ATO), and it is working.\n\n\n\n\n\n\"Make sure that all the data, like your bank details and personal information, is updated,\" Habibian said.\n\n\n\n\n\n\"Make sure that you have a strong verification [system] in your myGov ... If it is actually working, and it has been linked properly, [and] you've got access to it.\n\n\n\n\n\n\"Make sure that you've got a good and secure access to the personal information and documents within myGov.\"\n\n\n\n\n\nIn addition, he advised that if you have forgotten your password, changed your phone number or are facing any other difficulties, it's important to resolve them early, as the process may be significantly more time-consuming during tax time.\n\n\n\nFind those old receipts\n\nPreparing all those old receipts as proof for your work-related deductions can also save you time and money on your tax return.\n\n\n\n\n\nAccording to Habibian, finding and keeping receipts of work-related purchases, like \"tools, uniforms, equipment, computer, education expenses, car expenses, donations,\" etc, are important.\n\n\n\n\n\n\"[Gathering] all the receipts and all the documents related to the income and expenses is very important,\" he said.\n\n\n\n\n\n\"A common issue we see is missing receipts or documents, especially for work-related expenses. Make sure that you're storing the receipts digitally.\"\n\n\n\nPrepare your work from home record\n\nIn general, there are two different methods you can use to claim your work from home-related deductions: First, gathering all the information about your expenses for the time you worked from home, and second, providing the total hours you worked remotely to the ATO.\n\n\n\n\n\nHabibian suggests gathering this information as soon as possible.\n\n\n\n\n\n\"Sometimes it might be a bit time-consuming to find the detailed record of a daily log of the hours that you worked from home, and also evidence of the expenses like electricity, internet, and phone,\" he said.\n\n\n\n\n\n\"This document actually takes more time to collect and provide to the tax agent.\"\n\n\n\nSeparate your personal and business expenses\n\nIf you own a business and have not yet separated your personal and business expenses, this might be a great time to start, as it may take up a lot of your time.\n\n\n\n\n\n\"Separating your personal [expenses] from the business expenses would be highly important,\" Habibian said.\n\n\n\n\n\n\"Most of the people have their personal and business expenses mixed, and it will take a huge amount of time to separate them.\"\n\n\n\nGenerally, the distinction between personal and business expenses is straightforward.\n\n\n\n\n\nPurchases intended for business use are deductible business expenses, while items bought for personal use are classified as personal expenses.\n\n\n\n\n\nIf you have an item that serves both business and personal purposes, like a laptop or a phone, you can only deduct the portion used for business.\n\n\n\nDocument your other sources of income\n\nWith only one source of income and a limited number of work-related expenses, the tax return process may not take much time.\n\n\n\n\n\nHowever, if you have multiple income sources, Habibian said you should start your preparation sooner.\n\n\n\n\n\n\"If you have an investment property, you need to gather information,\" he said.\n\n\n\n\n\n\"Make sure that you are focusing on the rental property claims as well ... That would actually be a bit time-consuming. You need to have a chat with your real estate agent.\n\n\n\n\n\n\"You need to start from now.\"\n\n\n\n\n\nThe same goes for other investments like cryptocurrencies.\n\n\n\n\n\n\"If you have crypto that is in the radar of the ATO, you need to gather information about it ... If you are trading crypto, you must report it even if you have made a loss,\" he said.\n\n\n\nDon't rush\n\nTax time starts on the first of July each year and finishes by the end of October.\n\n\n\n\n\nBy mid-July, once employers and banks have submitted more information to the ATO, the prefilled data will be available for your tax lodgement.\n\n\n\n\n\n\"Many people rush to lodge on the first of July ... But you should avoid loading these documents too early.\n\n\n\n\n\n\"This reduces the errors and avoids later amendments.\"\n\n\n\n\n\nThe information in this article is general in nature and is not intended as financial advice. You should consult with a licenced professional to make the decisions that are right for you.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-finding-joy-in-a-world-of-chaos/zfhvhw1zu",
    "title": "INTERVIEW: Finding joy in a world of chaos",
    "publish_date": "Sat, 24 May 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/suffering-in-silence-the-rapidly-rising-disease-impacting-australians/vvxbuimso",
    "title": "Suffering in silence: the rapidly rising disease impacting Australians",
    "publish_date": "Sat, 24 May 2025 21:30:00 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "In her first year of university, when Natasha Jiwani should have been revelling in her new-found independence, she started to experience constant abdominal pain.\n\n\n\n\n\n\"I straight after finishing high school, first year of university would get severe abdominal pain to the point where I would wake up with it and go to sleep with it. No one could diagnose what it was.\"\n\n\n\n\n\nEventually, Natasha was diagnosed with Crohn's disease.\n\n\n\n\n\n\"The overall experience was quite different. So, walking into a gastroenterologist waiting room, I'd look around and I was the only one that was in my close to 20's. Everybody else, the average age was 60 onwards, so there was a lot of confusion.\"\n\n\n\n\n\nCrohn's disease and ulcerative colitis both fall under the umbrella term of Inflammatory Bowel Disease, or IBD — an autoimmune disease where the body's immune system attacks the gut.\n\n\n\n\n\nCrohn’s disease can cause inflammation anywhere in the digestive system, though it usually affects the bowels.\n\n\n\n\n\nUlcerative colitis, often referred to simply as \"colitis\", can cause inflammation and ulcers in the colon and rectum.\n\n\n\n\n\nVincent Ho, a gastroenterologist at Western Sydney University, says both conditions cause multiple symptoms including diarrhea and abdominal pain, though to others they remain invisible.\n\n\n\n\n\n\"People with inflammatory bowel disease may look perfectly fine but are actually suffering from the symptoms of inflammatory bowel disease, which can be quite severe in many cases and affect their daily life.\"\n\n\n\n\n\nThe number of Australians living with I-B-D is rapidly on the rise, increasing from 100,000 a decade or so ago to around 180,000 today, according to a recent State of the Nation Report.\n\n\n\n\n\n\n\nThat number is expected to rise to 200,000 in the next 10 years.\n\n\n\n\n\nDoctor Ho says the rates of IBD in Australia are among the highest in the world.\n\n\n\n\n\n\"Over 65, we're seeing more cases, but we're also seeing cases of inflammatory bowel disease in young children as well. And there are a number of cases of what we call very early onset in inflammatory bowel disease where children can get it a younger than six years of age.\"\n\n\n\n\n\nDr Ho say, while it's largely unknown how this inflammation arises, we are starting to learn more about its causes.\n\n\n\n\n\n\"Some risk factors in the environment include exposure to tobacco smoke, the use of antibiotics, the use of certain drugs like non-steroidal anti-inflammatory drugs, for example Nurofen, Voltaren, those sorts of drugs. We know that some types of infections can increase the risk of developing inflammatory bowel disease.\"\n\n\n\n\n\nAnother risk factor is diet.\n\n\n\n\n\nOne recent world-first pre clinical study, by the Walter and Eliza Hall Institute of Medical Research, shows how eating just a few meals high in saturated fats, can cause inflammation in the body.\n\n\n\n\n\nThose foods can also weaken the production of a crucial protein called IL-22, which helps fight this inflammation.\n\n\n\n\n\nMice were used in this research, which also reveals something that excited researchers: while saturated fats suppress IL-22 production, unsaturated fats, found in nuts and avocados, actually boost the protein’s production.\n\n\n\n\n\nDr Ho says this provides immense hope for people living with chronic inflammatory diseases like IBD.\n\n\n\n\n\n\"We know that certain types of foods, a high-quality diet, for example, reaching fruit, vegetables, fish, and other fibre sources is considered to be a protective factor when it comes to inflammatory bowel disease.\"\n\n\n\n\n\nNatasha has found eating well has had a huge impact on her symptoms.\n\n\n\n\n\n\"I know that if I'm living off fast food for a week as opposed to making healthy at home meals, my Crohn's is a lot better in that latter thing because my body's healthier and it's ensuring that my body's not flaring up with what I'm eating.\"\n\n\n\n\n\nWhile IBD is a chronic condition with no cure, it can be managed with treatment.\n\n\n\n\n\nEarly diagnosis is important, with symptoms including abnormal bowel movements and the presence of mucus or blood in stools, as well as abdominal discomfort, bloating and flatulence.\n\n\n\n\n\nLeanne Raven, CEO of Crohns and Colitis Australia, says greater awareness around I-B-D will also help when it comes to diagnosis, support and treatment.\n\n\n\n\n\n\"Because it's below the belly button, people don't necessarily talk about it. So, a lot of people become quite isolated in trying to manage their conditions. So, we're trying to shatter the IBD silence through raising awareness of and encouraging people to have conversations.\"\n\n\n\n\n\nNatasha says while there is less stigma and embarrassment around I-B-D than ever before, more people need to talk about it.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/taking-coffee-from-functional-beverage-to-indulgence/yk579xo2o",
    "title": "Taking coffee from 'functional beverage' to 'indulgence'",
    "publish_date": "Sat, 24 May 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIndonesia, one of the world’s largest coffee producers, has just hosted a global event that’s turning heads, and turning up the heat, in the specialty coffee world.\n\n\n\n\n\nThis is the World of Coffee Jakarta 2025, the first time this prestigious international coffee showcase has been held in a coffee-producing country.\n\n\n\n\n\nAnd for Indonesia, it’s more than just an honour ... it’s a statement.\n\n\n\n\n\nFrom cutting-edge brewing competitions to ethically sourced beans, thousands gathered in Jakarta for a full-bodied celebration of everything coffee.\n\n\n\n\n\nAt the heart of it is the Specialty Coffee Association, or SCA, which launched the World of Coffee expo back in 1999.\n\n\n\n\n\nThis year, it finally made its way to the farms and forests where so much of the world’s finest coffee begins.\n\n\n\n\n\nYannis Apostolopoulos, the CEO of the Specialty Coffee Association, says the aim is to reframe how we think about coffee.\n\n\n\n\n\n\"I think what we're trying to do is to excite consumers in consuming coffee. Coffee is moving away from being a functional beverage to becoming more of an indulgement. And what we want to do is to get consumers through a journey that they find coffee exciting as food or wine, so that people can actually enjoy coffee and maybe understand the value that they bring to the value chain and to the people that are producing coffee all around the world.\"\n\n\n\n\n\nHe’s talking about a deeper experience, one where coffee sits alongside wine and fine cuisine, with respect for every hand along the supply chain.\n\n\n\n\n\nOne of those hands belongs to Mikael Jasin, the World Barista Champion in 2024.\n\n\n\n\n\nHe’s a familiar face here, brewing with the same meticulous care farmers use when harvesting cherries.\n\n\n\n\n\n“At least for me, it's making sure that the approach that I do when I make this coffee is the same standard at least to the approach that the farmers have done to their coffee, the roasters have done to that coffee, and then me as the barista at least maintain the same standard, if not better. So that the customer when they drink it, they can enjoy that coffee to the best potential of that coffee.\"\n\n\n\n\n\nHe says it’s about preserving the integrity of the bean, from farm to roast to cup.\n\n\n\n\n\nThat sense of duty, he admits, becomes even more intense when he’s making coffee for others.\n\n\n\n\n\n“Coffee, there's still so many people that are involved in the steps and it's very easy to mess it up. So, when I make coffee - and especially when I make coffee for people, when I make coffee for myself, I'm a bit more relaxed - but for people, I want make sure that I'm serving the best of that coffee .\"\n\n\n\n\n\nAnd it all begins with the farmers.\n\n\n\n\n\nOn the volcanic slopes of Bandung, West Java, coffee cherries ripen in the sun.\n\n\n\n\n\nThis is home to Java Halu Coffee, run by Rani Mayasari.\n\n\n\n\n\nAt her booth in Jakarta, she beams with pride.\n\n\n\n\n\nIt’s taken 15 years to build her farm, empower women, and make it here.\n\n\n\n\n\nAnd now, she’s sharing Indonesia’s story with the world.\n\n\n\n\n\n\"It's proof that maybe our world is more better. It's our hope in the coffee industry, our hope, our economy, our politics more better in next year. It's like a medicine for us. It's like a painkiller for us, you know? Because a lot of effort that we already doing in 15 years. So it's like a good food, healthy food, or soulful food maybe for us. So our soul happy, our body happy, so we can make it in these three days.\"\n\n\n\n\n\nShe says serving her first harvest to international buyers is more than a sale, it’s a celebration of identity, resilience, and the soulful joy of good coffee.\n\n\n\n\n\nYoung coffee lovers, too, are finding inspiration here.\n\n\n\n\n\nAmong them, 18-year-old Jamie Elijah Yauw.\n\n\n\n\n\nHe’s just graduated high school but already dreams of joining the industry.\n\n\n\n\n\n“I think every step of the way at the industry is amazing. It's beautiful, it's inspiring, and to be here, meeting people who’ve worked with farmers, meeting people who make the tools we use every day, meeting people explain how they roast their coffee and seeing the effort that people put, or see how much they love, how much they put their whole life into coffee, is so inspiring. Where for me to see people like that, it's just making me awestruck, really.”\n\n\n\n\n\nAnd then, the grand finale, the World Brewers Cup 2025.\n\n\n\n\n\nAfter three days of intense competition, China’s George Jinyang Peng emerged as this year’s champion.\n\n\n\n\n\n\"I feel so very excited and very happy, and maybe a little bit shocked.\"\n\n\n\n\n\nWith over 50 participants and more on the horizon, the competition mirrors the fast-growing specialty coffee market, especially in producing nations like Indonesia, Brazil, and Vietnam.\n\n\n\n\n\nAccording to the Food and Agriculture Organisation, the global coffee industry now generates more than $200 billion in annual revenue.\n\n\n\n\n\nIn 2024 alone, the price of Arabica surged by 58 per cent.\n\n\n\n\n\nAnd with growing interest in transparency, sustainability, and quality, events like World of Coffee Jakarta are redefining the bean, not just as a drink, but as a story.\n\n\n\n\n\nFor Indonesia, that story is just beginning.\n\n\n\n\n\nAnd it smells like a fresh brew of national pride and global respect.\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-new-move-to-expose-the-insidious-tactics-of-australias-cults/7f32xq8pv",
    "title": "The new move to expose the insidious tactics of Australia's cults",
    "publish_date": "Sat, 24 May 2025 20:32:31 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points A committee will oversee an 'inquiry into the recruitment methods and impacts of cults and organised fringe groups'.\n\nIt will look at groups using techniques that harm people emotionally, psychologically, financially, or physically.\n\nSome groups are using coercion techniques and the inquiry will consider whether this should be criminalised.\n\nTore Klevjer has seen the destruction done to the lives of many people who have become part of a cult in Australia.\n\n\n\n\n\nThe president of Cult Information and Family Support Australia is hoping an inquiry into the tactics of cults and fringe groups will bring awareness of the harm such groups are causing and drive change to hold the groups accountable.\n\n\n\n\n\nA Victorian parliamentary committee will oversee the inquiry into the recruitment methods and impacts of cults and organised fringe groups.\n\n\n\n\n\nThe investigation, which is currently taking public submissions, may have a focus on activities in Victoria, but Klevjer said many of the groups that are likely to be analysed operate in much the same way across the country.\n\n\n\n\n\n\n\nElla George, the chair of the Legislative Assembly Legal and Social Issues Committee overseeing the inquiry, said it was \"not about judging or questioning anyone’s beliefs, religious or otherwise\".\n\n\n\nCult Information and Family Support Australia president Tore Klevjer wants those impacted by the practices of cults in Australia to have recourse for the treatment they are subjected to. Source: Supplied The inquiry's guidance notes state its focus will be \"those groups that use techniques that can harm individuals emotionally, psychologically, financially, or even physically\".\n\n\n\n\n\nIt aims \"to understand whether current laws are strong enough to deal with groups that use manipulation or control in ways that can seriously hurt people\".\n\n\n\n\n\nGeorge said in her statement announcing the inquiry that \"recent events in the state\" had led to the probe, but did not detail which groups such events involved.\n\n\n\n\n\nA number of Australian news outlets have reported accounts from former members of groups such as Shincheonji and Geelong Revival Centre, who have spoken about alleged coercion and the negative impacts their involvement with those groups had on their lives.\n\n\n\nThe harm caused by cults\n\nWhile Australians have freedom of religion, the guidance notes for the inquiry state: \"Religious freedom does not grant a licence to cause harm.\"\n\n\n\n\n\nThere is no legal definition of a cult in Australia, but for the purpose of the inquiry, the reference is to groups that use manipulative or controlling tactics to dominate members.\n\n\n\n\n\nGeorge said some groups use \"practices that can cause significant emotional, psychological, financial, or even physical harm\".\n\n\n\n\n\n\"There are legitimate concerns about the techniques being used by certain groups to attract and retain members, and whether they amount to coercion that should be criminalised,\" George said.\n\n\n\nKlevjer said he saw some of the biggest impacts on young people, who some of these groups often tried to sign up.\n\n\n\n\n\n\"It pulls their families apart, a lot of times they quit their education, their uni degree, and when they finally leave, quite often, after three or four years, they've got to start again so they're left behind from their peers, their study and their opportunities,\" he said.\n\n\n\n\n\n\"It disrupts their families as well, because they're taught to lie to their parents and to their family. \"It's very disruptive, and it breaks down a lot of trust.\"\n\n\n\nStatus of such groups\n\nKlevjer said many of the groups that may be considered cults or fringe groups are registered charities in Australia.\n\n\n\n\n\nKlevjer said he would like to see all tax-exempt charities be compelled to make their financial reports publicly available in order for them to demonstrate that funds were being used for \"genuine\" charitable purposes.\n\n\n\n\n\nHe said if the groups themselves were not registered charities: \"A lot of cults will have a front organisation as charitable status, and that's where it gets a little bit tricky, too, because a lot of these groups do have different names in different front organisations.\"\n\n\n\nRecruitment and control\n\nThe use of front groups to mask a group's true nature is listed in the inquiry's guidance notes as one of the tactics used by cults and front groups to recruit new members that may be looked at.\n\n\n\n\n\nOther possible tactics that could be considered include 'love bombing', where new recruits are overwhelmed with affection, praise, and attention to create emotional bonds as well as isolating recruits from outside influences and overwhelming them with group activities or doctrine and framing dissenters as toxic or unenlightened.\n\n\n\nREAD MORE Ruth was born into a cult. She reveals the sly tactics used to lure in victims\n\nOther possible methods used by cults to control members have also been outlined for those considering making a submission.\n\n\n\n\n\nThese include the use of controlling leadership that demands obedience, loss of personal autonomy as members are encouraged to focus fully on a group’s mission, secrecy, deception and emotional and psychological manipulation.\n\n\n\nAddressing the issues around cults\n\nKlevjer said people who feel they have been poorly treated by such groups usually have little recourse and he wanted to see this changed.\n\n\n\n\n\nHe proposes that religious or ideological organisations should have to publish a statement of faith or belief practices to clearly outline their core doctrines, expectations of members, and any practices that may significantly impact individual autonomy or well-being.\n\n\n\n\n\n\"If an organisation is found to have withheld or misrepresented its beliefs in a way that leads to harm, individuals should have legal recourse, similar to protections against deceptive conduct under consumer protection laws,\" Klevjer said.\n\n\n\nIt's understood some groups that are considered cults use the pretext of bible study as a way to bring in new members but fail to fully explain who the group is and what being part of the group will involve. Source: Getty / fstop123 He said often when cults were accused of certain behaviour such as coercion, misrepresentation, or what he referred to as \"personal abuses\" the \"the cult can just turn around, as they often do, and Just say, well, it wasn't our teaching, that was just the leadership you were under at the time, and then just hang someone else out to dry\".\n\n\n\n\n\nHe also wants to see coercive control laws extended beyond domestic relationships to include cases involving such groups.\n\n\n\n\n\nThe Rationalist Society of Australia (RSA) wrote to all states and territories in December, urging them to address coercive control in cults.\n\n\n\n\n\nRSA executive director Si Gladman sent a letter to attorneys-general that said religious cults posed a great danger to the fundamental rights and freedoms of many Australians.\n\n\n\n\n\nGladman wrote that \"numerous survivors of cult groups\", including the Geelong Revival Centre and Shincheonji Church, were \"bravely speaking out about the coercive practices and harm they have been subjected to\".\n\n\n\n\n\n\"These practices are at odds with fundamental human rights norms. Yet, they are all commonplace in certain sections of Australian society.\n\n\n\n\n\n\"Clearly, religious cults pose a great danger to the fundamental rights and freedoms of many Australians.\"\n\n\n\nREAD MORE My daughter has joined a cult. I have no idea how to get her out\n\nGeorge acknowledged upon the announcement of the inquiry that coercive control laws were to be considered as part of the investigation.\n\n\n\n\n\n\"There are legitimate concerns about the techniques being used by certain groups to attract and retain members, and whether they amount to coercion that should be criminalised.\"\n\n\n\n\n\nPublic submissions will be taken until the end of July, and members of the public can also provide input through an online, anonymous questionnaire, with public hearings expected to follow.\n\n\n\n\n\nThe committee is expected to provide its report by the end of September 2026.\n\n\n\n\n\nShincheonji's Melbourne chapter and the Geelong Revival Church have been contacted for comment.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 43
  },
  {
    "url": "https://www.sbs.com.au/news/article/matildas-womens-asian-champions-league-finals-arsenal-melbourne-city/wofovheff",
    "title": "Biggest night since 2023 World Cup fever as nine Matildas set for Champions League finals",
    "publish_date": "Sat, 24 May 2025 07:08:37 +0000",
    "category": "sports",
    "authors": [],
    "text": "Set your alarms and prep the coffee — Australian women's football is about to have one of its biggest nights since Matilda fever gripped the nation during the 2023 Women's World Cup.\n\n\n\n\n\nAcross two cities, nine Matildas players will be taking part in what's set to be a big night of women's football as two teams compete in the Champions League finals.\n\n\n\n\n\nThe first match will start on Saturday night at 10pm AEST, where Melbourne City will face Wuhan Jiangda in the final of the first full Women's Asian Champions League tournament.\n\n\n\n\n\nSix Australians — including current Matildas Holly McNamara, Bryleeh Henry and Leah Davidson, plus Laura Hughes, Karly Roestbakken and veteran keeper Melissa Barbieri — will be chasing the title and a slice of the $2 million prize pool.\n\n\n\n\n\n\"It's so exciting, for it to be the first structured Asian Women's Champions League,\" McNamara told AAP.\n\n\n\nREAD MORE I was a Matilda when we played in front of 50 people and had to pay for our hotels and flights\n\n\"To get all the way to the final as an Australian team is a really good credit to us, and it's something that we've been working towards as soon as we found out about the competition.\n\n\n\n\n\n\"Obviously, playing for your country is such a huge milestone, so those games were pretty big in my career. But in terms of club, this is the biggest game by far.\"\n\n\n\nAustralians look to grasp European Champions League trophy\n\nThen, four hours later at 2am AEST Sunday morning, three of the Matildas' biggest stars — Steph Catley, Caitlin Foord and Kyra Cooney-Cross — will run out in the European Women's Champions League final.\n\n\n\n\n\nTheir club, Arsenal, is aiming to upset reigning champions Barcelona in front of a packed crowd in Lisbon.\n\n\n\n\n\nIf Barcelona is successful, it would be their third consecutive championship win.\n\n\n\n\n\nMeanwhile, underdogs Arsenal are hoping for an upset and are vying to win their second-ever European title.\n\n\n\nSteph Catley (centre) and Kyra Cooney-Cross (right) of Arsenal hope to join the prestigious club of Australian footballers who've won the European Women's Champions League final. Source: AAP / Joel Carrett It's the first time all three women will contest a Champions League final — and they'll be hoping to join the likes of Ellie Carpenter, who is the only Australian woman to lift the trophy after 2020 and 2022 wins with Lyon.\n\n\n\n\n\nThe only other Australian to win the tournament is Harry Kewell, who won the 2005 final of the Men's Champions League with Liverpool.\n\n\n\n\n\nThis week, Ange Postecoglou became the first Australian coach to win a major European football trophy with Tottenham Spurs.\n\n\n\n'Anything can happen'\n\nCatley said Arsenal had \"put ourselves in such an incredible position\".\n\n\n\n\n\n\"A one-off final. Anything can happen, two amazing teams going at it.\"\n\n\n\n\n\n\"It's the best thing about Champions League football. And there's no place I'd rather be.\"\n\n\n\nMatilda player, Steph Catley, has her sights set on winning the Champions League with Arsenal. Source: AAP / Jay Patel \"Obviously, for Australians that follow Arsenal and that follow us, it's a massive occasion.\"\n\n\n\n\n\nCatley said the barriers to Australian women's footballers succeeding on the world stage made the feat even sweeter.\n\n\n\n\n\n\"There is something special about Australians doing well on the world stage, and I think in particular in European football,\" she said.\n\n\n\n\n\n\"Because anyone that knows world football knows how hard it is to be successful over here, especially in the Champions League, and in European competitions in general.\"\n\n\n\nREAD MORE All eyes on the Matildas but it hasn't always been this way\n\n\"Playing in a Champions League final is, along with probably a World Cup final, as high as you can get.\"\n\n\n\n\n\nShe believes it can also inspire young Australian footballers.\n\n\n\n\n\n\"If you see there's three Australians playing in this Champions League final, then it's definitely possible for them,\" Catley said\n\n\n\n\n\n- With reporting by Australian Associated Press.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 44
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/get-fried-chicken-until-2am-at-this-late-night-koreatown-haunt-20250526-p5m28c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Get fried chicken until 2am at this late-night Koreatown haunt",
    "publish_date": "Mon, 26 May 2025 12:05:41 +1000",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\n1 / 5 Army stew (budae jjigae) with sausages, beans, tofu and kimchi. Chris Hopkins 2 / 5 Fried chicken with sweet chilli glaze (left) and creamy onion. Chris Hopkins 3 / 5 Outside the Healeys Lane restaurant. Chris Hopkins 4 / 5 Seafood pancake with ganjang (soy sauce). Photograph by Chris Hopkins 5 / 5 Inside Seven Star Pocha, open until late in Koreatown. Chris Hopkins Previous Slide Next Slide\n\nKorean$$$$\n\n“Pocha” means outdoor food carts and this eight-year-old mainstay brings street-food energy to its casual, sometimes raucous dining room. If you’re here after 7pm, you’ll probably need to queue, but don’t worry about missing out: the place is open till at least 2am.\n\nArmy stew (budae jjigae) is a key dish, set on the table in a huge tureen over a butane burner for you to cook yourself. As the broth starts to burble, ladle the liquid over the noodles on top to soften them, then stir them in with a jam-packed array of sausages, beans, tofu and kimchi.\n\nOther must-try dishes at Seven Star Pocha are the pizza-sized seafood pancake stuffed with calamari, shrimp and mussels, and boneless fried chicken: try a double plate with sweet chilli glaze on one side and creamy onion on the other. This trending combo sees chicken pieces covered in sliced raw onions and smothered in a bechamel-like sauce.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/business/companies/banks-step-in-to-keep-healthscope-running-as-receivers-appointed-20250526-p5m25x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Banks step in to keep Healthscope running as receivers appointed",
    "publish_date": "Mon, 26 May 2025 12:04:00 +1000",
    "category": "finance",
    "authors": [
      "Colin Kruger"
    ],
    "text": "One of Australia’s largest private hospital owners Healthscope has gone into receivership after its lenders voted to end their support for the current owner, Brookfield, which has been unable to pay to keep facilities, including Sydney’s embattled Northern Beaches Hospital, open.\n\nReceivers have been appointed from McGrathNicol with the Commonwealth Bank and Westpac, two of the lenders owed $1.6 billion, providing additional funding for both receivers’ sales process, and working capital for the hospitals to ensure the hospital operations continue as normal.\n\nHealthscope’s troubled Northern Beaches Hospital will come under the microscope as receivers look to sell the business. Credit: Renee Nowytarger\n\nHealthscope has 38 private hospitals – including Sydney’s Northern Beaches Hospital, Holmesglen Private Hospital and The Melbourne Clinic – which house 5000 beds and employ 17,000 staff across the country.\n\nBrookfield, which has more than $1 trillion of assets under management and paid $4.4 billion for Healthscope in 2019, has been unable to find a buyer for the business and attempted to hand control to the dozens of parties which made up the debt syndicate, including Australia’s Big Four banks.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/gary-linekers-final-goodbye-from-match-of-the-day-20250526-p5m28s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gary Lineker's final goodbye from Match of the Day",
    "publish_date": "Mon, 26 May 2025 12:02:44 +1000",
    "category": "finance",
    "authors": [],
    "text": "Gary Lineker's final goodbye from Match of the Day\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/politics/federal/higher-power-bills-to-kick-in-from-july-20250526-p5m25c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Higher power bills to kick in from July",
    "publish_date": "Mon, 26 May 2025 12:01:15 +1000",
    "category": "finance",
    "authors": [
      "Mike Foley"
    ],
    "text": "Higher-than-forecast power bills have been announced by the market regulator in its latest round of annual price setting, which will kick in for households from July 1.\n\nPrice caps will rise for hundreds of thousands of customers by up to 9.7 per cent in the hardest-hit areas of NSW and up to 5 per cent in parts of Victoria.\n\nPower prices will rise from July 1. Credit: Nine.\n\nThe price spikes were driven by higher costs in the electricity grid in the past year, driven by breakdowns at coal-fired power plants, elevated fossil fuel prices and rising costs for network infrastructure.\n\nHowever, Prime Minister Anthony Albanese is doubling down on his ambitious renewable energy plans, declaring it the cheapest new source of power, while the federal Coalition brawls over the emissions targets and its commitment to build nuclear energy instead of wind and solar farms.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/heavily-strapped-haas-makes-fleeting-appearance-at-blues-training-20250526-p5m262.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Heavily strapped Haas makes fleeting appearance at Blues training",
    "publish_date": "Mon, 26 May 2025 12:00:04 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi"
    ],
    "text": "Payne Haas still appeared hampered by a quad injury as one of Laurie Daley’s former Queensland Origin opponents made a surprise appearance at training at Ballymore on Monday.\n\nHaas had his left quad heavily strapped and only completed a handful of tackles during the opposed session against Queensland Cup side Wynnum Manly before reverting to sprint drills on the sideline.\n\nBlues officials remain hopeful the game’s best front-rower will be fit to start at Suncorp Stadium on Wednesday night, with Stefano Utoikamanu on stand-by.\n\nAs Haas races the clock, Les Kiss, the former Queensland winger and incoming Wallabies coach was spotted on the sidelines.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/business/the-economy/trump-misfires-again-in-his-war-on-the-world-20250526-p5m24s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Trump misfires again in his war on the world",
    "publish_date": "Mon, 26 May 2025 11:58:33 +1000",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "The problem that the EU has is that, even after weeks of negotiations, it has no clear idea of what, in Trump’s mind, constitutes a good deal, or even just a deal. Trump, as his post indicated, isn’t interested in deals, just a one-sided outcome where his will prevails, with the US making no meaningful concessions of its own. He’s a unilateralist. Trump agreed to delay the tariffs after a “very nice” phone call with EU commission president Ursula von der Leyen. Credit: AP The EU has made it clear that the US needs to offer up concessions of its own if it wants a deal – it is prepared to negotiate but doesn’t want Trump to dictate its trade and tax policies without offering anything in return. It’s prepared to retaliate with €95 billion ($166 billion) of tariffs of its own if there is no reasonable deal and could also, if forced into a corner, target the big US tech companies. It already has imposed tariffs of €21 billion on US imports in response to Trump’s 25 per cent tariffs on steel and aluminium imports to the US.\n\nTrump’s walking back of his threat, or at least putting a hold on it until July 9, is consistent with previous behaviours, particularly in the confrontation with China. Loading He gets impatient with his inability to announce a big deal – that other countries don’t just fold immediately in the face of his demands – threatens massive tariffs (145 per cent in China’s case) and then, when cooler heads prevail or the markets respond badly, he blinks. While the US sharemarket slipped only modestly on Friday, bond yields, which are closely watched by the White House, edged up again, with the yield on 30-year bonds remaining above the sensitive 5 per cent level. The dollar weakened again, depreciating 0.8 per cent against the basket of America’s major trading partners’ currencies. It is now down about 9.9 per cent since the start of the year. The EU is America’s largest trading partner, with total two-way trade in goods of about $US975 billion last year. By comparison, the trade with China amounted to $US582 billion.\n\nDisruption to the transatlantic trade – a tit-for-tat tariff war -- would be very damaging to both economies and could help tip both into recession, but could be particularly damaging to the US if other major economies also responded to Trump’s trade wars with tariffs of their own. Trump’s threat to impose a 25 per cent tariff on Apple products, and Samsung’s, unless they make their smartphones in Americas shows how little he understands about modern sophisticated manufacturing and the near-impossibility of Apple being able to deliver what he is demanding. “I have long ago informed Tim Cook of Apple that I expect their iPhone’s (sic) that will be sold in the United States of America will be manufactured and built in the United States, not India, or anyplace else,” he said in the Truth Social post on Friday. Apple, in an effort to tap into India’s vast market aided by significant Indian government incentives, built a manufacturing presence there over nearly a decade.\n\nRoughly 20 per cent of its iPhone are manufactured in India and, after the trade tensions between the US and China exploded this year, the company had planned to use it (and the lower tariff rates the US applied to Indian exports) as the base for iPhones sold into the US. Apple has a vast and complex supply chain. It sources the 2700 or so components of its phones from more than 185 supplies in more than 40 countries, with some components provided by countries with deep specialist skills – like Japan for cameras, or South Korea for screens. In China, Taiwan’s Foxconn assembles iPhone in massive production facilities. “iPhone City” in Zhengzhou employs more than 300,000 people with a mixture of highly skilled engineers and low-skilled workers assembling the devices. Foxconn has expanded into India, alongside Apple. It would be near-impossible for Apple to replicate a supply chain it has spent two decades developing within America. It could build a high-tech facility, with lots of robotics, to try to replace the low-skilled workers its suppliers employ in China and India, but it wouldn’t have the engineers and would still have to rely on imported components.\n\nIt would also take years, probably at least five, to build the facility and tens of billions of dollars. Its phones would cost Americans two or three times, if not more, what they cost today. All in order to make a product that Apple itself has conceded might be superseded by new types of devices within a decade. Last week’s Open AI’s purchase of artificial intelligence device startup io, which was co-founded by Apple’s former design chief Jony Ive, may be a foretaste of what’s to come. Trump, as his post indicated, isn’t interested in deals, just a one-sided outcome where his will prevails, with the US making no meaningful concessions of its own. He’s a unilateralist. It would almost certainly be cheaper and less risky for Apple to pay Trump’s tariffs than to invest tens of billions of dollars to make second-rate, but very expensive, American-made iPhones sometime next decade. Friday’s social media post, and even Sunday’s about-face, are consistent with the inconsistency with which Trump and his administration have waged their trade wars.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/world/north-america/the-trumps-are-monetising-the-presidency-like-never-before-but-where-is-the-outrage-20250526-p5m287.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Trumps are monetising the presidency like never before. But where is the outrage?",
    "publish_date": "Mon, 26 May 2025 11:50:14 +1000",
    "category": "finance",
    "authors": [
      "Peter Baker"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size When Hillary Clinton was US first lady, a furore erupted over reports that she had once made $US100,000 from a $US1000 investment in cattle futures. Even though it had happened a dozen years before her husband became president, it became a scandal that lasted weeks and forced the White House to initiate a review. Thirty-one years later, after dinner at US President Donald Trump’s Mar-a-Lago estate, Amazon executive chairman Jeff Bezos agreed to finance a promotional film about first lady Melania Trump that will reportedly put $US28 million ($43 million) directly in her pocket – 280 times the Clinton lucre and in this case from a person with a vested interest in policies set by her husband’s government. Scandal? Furore? Washington moved on while barely taking notice. The Trumps are hardly the first presidential family to profit from their time in power, but they have done more to monetise the presidency than anyone who has ever occupied the White House. The scale and the scope of the presidential mercantilism have been breathtaking. The Trump family and its business partners have collected $US320 million in fees from a new cryptocurrency, brokered overseas real estate deals worth billions of dollars and are opening an exclusive club in Washington called the Executive Branch charging $US500,000 apiece to join, all in the past few months alone. The Trumps have done more to monetise the presidency than anyone who has ever occupied the White House. Credit: nna\\miriah.davis Just last week, Qatar handed over a luxury jet meant for Trump’s use, not just in his official capacity but also for his presidential library after he leaves office. Experts have valued the plane, formally donated to the Air Force, at $US200 million, more than all the foreign gifts bestowed on all previous American presidents combined. And Trump hosted an exclusive dinner at his Virginia club for 220 investors in the $TRUMP cryptocurrency that he started days before taking office in January. Access was openly sold based on how much money they chipped in – not to a campaign account but to a business that benefits Trump personally. By conventional Washington standards, according to students of official graft, the still-young Trump administration is a candidate for the most brazen use of government office in American history, perhaps eclipsing even Teapot Dome, Watergate and other famous scandals.\n\nAdvertisement\n\n“I’ve been watching and writing about corruption for 50 years, and my head is still spinning,” said Michael Johnston, a professor emeritus at Colgate University and author of multiple books on corruption in the United States. Yet a mark of how much Trump has transformed Washington since his return to power is the normalisation of moneymaking schemes that once would have generated endless political blowback, televised hearings, official investigations and damage control. The death of outrage in the Trump era, or at least the dearth of outrage, exemplifies how far the president has moved the lines of accepted behaviour in Washington. Loading Trump, the first convicted felon elected president, has erased ethical boundaries and dismantled the instruments of accountability that constrained his predecessors. There will be no official investigations because Trump has made sure of it. He has fired government inspectors general and ethics watchdogs, installed partisan loyalists to run the Justice Department, FBI and regulatory agencies and dominated a Republican-controlled Congress unwilling to hold hearings. As a result, while Democrats and other critics of Trump are increasingly trying to focus attention on the president’s activities, they have had a hard time gaining any traction without the usual mechanisms of official review. And at a time when Trump provokes a major news story every day or even every hour – more tariffs on allies, more retribution against enemies, more defiance of court orders – rarely does a single action stay in the headlines long enough to shape the national conversation. Paul Rosenzweig, who was a senior counsel to Ken Starr’s investigation of president Bill Clinton and later served in the George W. Bush administration, said the lack of uproar over Trump’s ethical norm-busting has made him wonder whether longstanding assumptions about public desire for honest government were wrong all along. “Either the general public never cared about this,” he said, or “the public did care about it but no longer does.” He concluded that the answer is that “80 per cent, the public never cared” and “20 per cent, we are overwhelmed and exhausted”.\n\nAdvertisement\n\n“Outrage hasn’t died,” Rosenzweig added. “It was always just a figment of elite imagination.” The White House has defended Trump’s actions, brushing off questions about ethical considerations by saying that he was so rich that he did not need more money. “The president is abiding by all conflict of interest laws that are applicable to the president,” White House press secretary Karoline Leavitt said. “The American public believes it is absurd for anyone to insinuate that this president is profiting off of the presidency. This president was incredibly successful before giving it all up to serve our country publicly.” But saying that he is abiding by all conflict of interest laws that are applicable to the president is meaningless since, as Trump himself has long noted, conflict of interest laws are not applicable to the president. Moreover, he has not given it all up; in fact, he is still making money from his private business interests run by his sons, and independent estimates indicate that he has hardly sacrificed financially by entering politics. Forbes estimated Trump’s net worth at $US5.1 billion in March, a full $US1.2 billion higher than the year before and the highest it has ever been in the magazine’s rankings. The president’s sons scoff at the idea that they should limit their business activities, which directly benefit their father. Donald Trump Jr has said that the family restrained itself during his father’s first term only to be criticised anyway, so it made no sense to hold back any more. “They’re going to hit you no matter what,” he said last week at a business forum in Qatar. “So we’re just going to play the game.”\n\nAdvertisement\n\nThere have been some burgeoning signs of public pushback in recent days. The gift of the Qatar plane seemed to break through to the general audience in a way that other episodes have not. A Harvard/CAPS Harris poll released last week found that 62 per cent of Americans thought the gift “raises ethical concerns about corruption”, and even some prominent right-wing Trump supporters like Ben Shapiro and Laura Loomer voiced objections. Tucker Carlson, the former Fox News host who campaigned with Trump last year, expressed misgivings this week during a podcast with Shawn Ryan, a right-wing influencer, who mentioned all the Trump family business deals that seemed to coincide with the president’s recent trip to the Middle East. “That stuff kind of worries me,” Ryan said. “Well, it seems like corruption, yeah,” Carlson agreed. Trump Organisation executive vice president of development and acquisitions Donald Trump Jr at the Qatar Economic Forum in Doha last week. Credit: Bloomberg But while several dozen demonstrators protested outside Trump’s golf club the other night, Democrats are split about how much to focus on Trump’s profit making, with some preferring to concentrate on economic issues. Senator Christopher Murphy has been leading the charge in the other direction, making floor speeches and leading news conferences denouncing what he calls “brazen corruption”. “It is unlikely he is going to be held accountable through traditional means,” Murphy said in an interview. “There are going to be no special counsels; there’s going to be no DOJ action. And so it’s really just about public mobilisation and politics. If Republicans keep paying a price for the corruption by losing special elections throughout the next year, maybe that causes them to rethink their complicity.” Trump had long promised to “drain the swamp” in Washington after years of corruption by other politicians. When he first ran for president in 2016, he excoriated the Clintons for taking money from Saudi Arabia and other Middle East monarchies with an obvious interest in currying favour in case Hillary Clinton won the presidency. But that money went to the Clinton Foundation for philanthropic purposes. The money Trump’s family is now bringing in from the Middle East is going into their personal accounts through a variety of ventures that The New York Times has documented.\n\nAdvertisement\n\nJohnston said the Trumps represented “an absolute outlier case, not just in monetary terms” but also “in terms of their brazen disregard” for past standards. “While we might disagree as to the merits of policy, the president and figures in the executive branch are expected to serve the public good, not themselves,” he said. Trump made a nod at those standards in his first term by saying he would restrict his family business from doing deals overseas. But since then, he has been convicted of 34 felony counts for falsifying business records and held liable in civil court for fraud while the Supreme Court has conferred immunity on him for official acts. In his second term, Trump has dispensed with self-imposed ethical limits. Loading “He’s not trying to give the appearance that he’s doing the right thing any more,” said Fred Wertheimer, founder of Democracy 21 and a long-time advocate for government ethics. “There’s nothing in the history of America that approaches the use of the presidency for massive personal gain. Nothing.” Congressional Republicans spent years investigating Hunter Biden, the son of President Joe Biden, for trading on his family name to make millions of dollars, even labelling the clan the “Biden Crime Family”. But while Hunter Biden’s cash flow was a tiny fraction of that of Donald Trump Jr, Eric Trump and Jared Kushner, Republicans have shown no appetite for looking into the current presidential family’s finances. “The American public has had to inure itself to the corruption of Donald Trump and his presidency because the president and his Republican Party have given the American public no choice in the matter,” said J. Michael Luttig, a conservative former appeals court judge who has become a critic of Trump. Trump evinces no concern that people funnelling money into his family coffers have interests in government policies. Some of the crypto investors who attended his dinner on Thursday night acknowledged that they were using the opportunity to press him on regulation of the industry. According to a video obtained by the Times, he reciprocated by promising guests that he would not be as hard on them as the Biden administration was.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/wa-news-live-e-scooter-rider-fighting-for-life-after-hit-and-run-20250525-p5m22b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: E-scooter rider fighting for life after hit-and-run",
    "publish_date": "Mon, 26 May 2025 11:48:21 +1000",
    "category": "finance",
    "authors": [],
    "text": "First flagged last year, the WA government’s new Stop Puppy Farming reforms come into effect today.\n\nFrom now on, approved pet shops can only sell dogs or puppies supplied by approved animal rescue shelters and pounds who have got a permit from their local government.\n\nLocal governments will assess applications, with dog-supply approval applications managed by the Department of Local Government, Sport and Cultural Industries.\n\nFrom Monday, pet shops can only sell dogs and puppies from approved shelters. Credit: Getty Images\n\nIt would appear the laws couldn’t come at a better time, after a 40-year-old man has been charged with 36 counts of animal cruelty last week.\n\nThe RSPCA WA received a cruelty report from the City of Canning about the property in December, with council rangers advising there were a large number of dogs roaming outside the property, two which had been taken away for urgent vet attention.\n\nHowever, despite support for the new laws from animal welfare groups, there are reports that so far no pet shops have applied for the permit.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/the-trouble-with-taniela-tupou-20250525-p5m1yq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The trouble with Taniela Tupou",
    "publish_date": "Mon, 26 May 2025 11:40:00 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "Taniela Tupou’s yellow card against the Force for a bizarre slide tackle is a big issue for the Wallabies. Joe Schmidt must be wondering if he can genuinely trust Tupou against the British and Irish Lions, because any such act will cost them a Test. That incident will put the Lions wind-up merchants on notice, and it doesn’t take a massive stretch of the imagination to envisage players such as Ellis Genge trying to get under Tupou’s skin. The shame in all of this is that Tupou appears to be a very likely player that everyone is willing to come through this rough period, but that combustibility is a big red flag ahead of a series that will be intense in every phase of play.\n\nClub World Championship will outshine Nations Cup\n\nChristmas came early for Super Rugby over the weekend with confirmation from Europe that the club world championship will finally and miraculously come into effect in 2028. Although the details are yet to be unveiled in detail, the outline of the 16-team comp is extraordinarily generous towards Super Rugby, with the top six teams at least set to be included to face that year’s Champions Cup quarter finalists. It means the URC winners, or England Premiership winners, could miss out if they have a bad Champions Cup campaign, yet the door would be open for the Super Rugby outfit that finishes sixth. As a concept, this competition is far more appealing than the Nations Cup concept, and the Herald predicts that supporter interest will be through the roof, with the first edition of the quadrennial tournament to be held in Europe. This is a big moment for the game, and a brilliant deal for Super Rugby.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/property/news/two-bedroom-northbridge-home-fetches-6-1m-in-21-bidder-auction-20250526-p5m257.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Two-bedroom Northbridge home fetches $6.1m in 21-bidder auction",
    "publish_date": "Mon, 26 May 2025 11:37:23 +1000",
    "category": "finance",
    "authors": [
      "Carmen Forward"
    ],
    "text": "A two-bedroom home in Northbridge was snapped up by a developer for $6.1 million at auction on Saturday.\n\nThe dated red-brick house at 5 Harden Avenue sits on a 765-square-metre block and was guided between $4.75 million to $5 million.\n\nTwenty-one parties registered, most were developers and five actively bid before a crowd of 120 in the simple backyard.\n\nBidding opened at $5.3 million and accelerated in $100,000 and $50,000 strides and rapidly cleared its $5.5 million reserve. A few smaller bids at $10,000 and $1000 were placed before $100,000 bids were met out, winning the keys for $6.1 million for the determined buyer.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/payne-haas-training-with-nsw-on-monday-20250526-p5m28h.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Payne Haas training with NSW on Monday",
    "publish_date": "Mon, 26 May 2025 11:31:17 +1000",
    "category": "finance",
    "authors": [],
    "text": "Payne Haas training with NSW on Monday\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/national/nsw/the-least-punctual-train-lines-in-sydney-revealed-20250515-p5lzhh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The least punctual train lines in Sydney revealed",
    "publish_date": "Mon, 26 May 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Cindy Yin"
    ],
    "text": "All six of Sydney’s major suburban train lines have failed to meet punctuality targets set by Transport for NSW, with one in five peak hour services running late in some of the worst-affected lines despite a decade-long project to improve the network’s reliability.\n\nThe worst performing train lines on average in the past five years have been the T1 North Shore and T9 Northern Line, with an average of just 86 and 88 per cent of all services running on time, respectively. It is below Sydney Trains’ benchmark to have at least 92 per cent of peak-hour suburban services arrive at stations within five minutes of their scheduled time.\n\nAnnual performance averages show every train line except for the T8 Airport and South line has not met this target for more than three years. The most punctual train lines were the T4 Eastern Suburbs and Illawarra line and the T8 Airport and South line, with 90 and 92 per cent of all services, respectively, coming on time.\n\nA handful of stations on Sydney’s train network are also equipped with Sydney Metro stations, making them optimal for commuters looking to transfer between train and metro services. For example, Epping station on the T9 Northern Line and Chatswood station on the T1 North Shore Line both serve as popular interchanges for commuters.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/business/companies/the-53-billion-deal-that-started-with-a-love-letter-20250522-p5m179.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The $53 billion deal that started with a love letter",
    "publish_date": "Mon, 26 May 2025 11:28:18 +1000",
    "category": "finance",
    "authors": [
      "Michelle F. Davis",
      "Liana Baker"
    ],
    "text": "The week prior, Donald Trump had been re-elected as US president. With Trump back in the White House, Charter felt it might have an easier time getting regulators on board with a deal than under his predecessor Joe Biden’s antitrust cops, who many felt had been against big deals regardless of their merits. A representative for Liberty Broadband declined to comment. Takeover template Charter already had a well-thumbed playbook for bringing large, billionaire shareholders into its fold. In 2015, it agreed to buy a majority stake in the billionaire Newhouse family’s cable company Bright House Networks from its parent Advance. It paid for the holding with several types of stock and cash. That, along with the more recent Liberty Broadband deal, served as a template for the Cox negotiations. A so-called Up-C structure was used, which allows a closely held company like Cox to go public while keeping some tax advantages.\n\nAdvance, meanwhile, still has seats on Charter’s board and some consent rights, so it didn’t make sense to offer Cox something significantly different from what the longtime partner already had. Eric Zinterhofer, Charter’s non-executive chairman, was tasked with getting the Newhouses comfortable with the idea of a Cox deal, assuring them that the dynamic wouldn’t change when Cox came in. A representative for Advance couldn’t be reached for comment. Cox is a 127-year-old company. Credit: Bloomberg As Charter was making preparations behind the scenes, Cox had also been considering its future. Over the previous two years the advantages of scale and scope in cable had become more apparent, as wireless companies lured away broadband subscribers with their own fibre offerings and abundant streamed content emboldened consumers to cut the cord on cable. Cox early last year brought in consultants from McKinsey & Co to conduct a review, including looking at the company’s position in the industry.\n\nWinfrey’s letter, sent months after McKinsey had wrapped up its review, came at the perfect time. In the multipage missive – which several of the people referred to as a love letter given when it was sent – he praised the company that the Cox family had built and laid out the strategic rationale for a deal: the added scale from a combination would position them to better compete and enable them to bundle offerings and more efficiently invest in infrastructure. Before deciding to engage, Taylor consulted internal confidantes like Cox president Dallas Clement, and brought in external advisers to determine the best path forward. The company also deliberated whether to canvas the market for other potential tie-ups, but ultimately decided to unilaterally negotiate with Charter. Daily discussions Once negotiations were underway, Taylor and Winfrey stayed in near constant communication, exchanging text messages and phone calls daily. The men had spent years getting to know each other, and wanted to keep as much of the negotiations as possible between the two of them to avoid leaks. Inside Cox, the deal was known as Project Horizon. At Charter it was called Project Cabot for Italian explorer John Cabot, who led voyages to the east coast of North America in the 15th Century.\n\nMeanwhile, Clement rallied Cox’s advisers and put together a five-week plan for due diligence to be conducted on Charter’s operating plan, strategy, capital structure and legal agreements. Advisers flew down to Atlanta to help prep Taylor and other members of Cox’s management team for negotiating sessions, and Cox set a goal of having a formal response to Charter’s term sheet by early May. The deal would unite two of the biggest US cable providers. Credit: Bloomberg Once that response was sent, the two sides reached a handshake agreement within a week. The deliberations were able to move smoothly in part because the people around the table already knew each other well. Citigroup’s Dan Richards and Christina Mohr were among the team advising Charter, while Cox’s bankers included Evercore’s Eduardo Mestre and Dan Mendelow, Wells Fargo & Co’s Derek Van Zandt and Jeff Hogan and Allen & Co’s Ketan Mehta and Nancy Peretsman. Mestre, Richards, Mohr and Van Zandt all worked together at Citigroup, with Mehta overlapping with some of them at the same bank.\n\nByron Trott, whose firm also won a role advising Cox, has been on the Cox Enterprises board for a decade and has known the family for years. LionTree’s Aryeh Bourkoff and Ehren Stenzler have been close to Charter and companies associated with Malone for years. Sweet finish The main discussions were around valuation, how much of the combined company Cox would own and what the breakdown would be between cash, convertible preferred stock and common stock. The Cox family also wanted to have a continued presence in Atlanta, but moving the headquarters there wasn’t a dealbreaker. The combined company, which will be called Cox, will be headquartered in Stamford, Connecticut, but keep a significant presence in Atlanta. Last week, Taylor and Winfrey had decided they wanted to announce a deal by Friday morning. They agreed to sprint towards a deadline of 7am. To keep everyone on track the night before the deal, lawyers for all stakeholders – fuelled in at least one office by a late-night ice-cream order – agreed to check in with each other every few hours. If at any point they hit an impasse that would keep them from making the deadline, they’d agree to continue over the weekend.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/property/news/family-who-had-been-looking-for-ages-beats-11-others-to-1-01m-melbourne-home-20250526-p5m258.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Young family beats seven others, pays $1.85m for Melbourne home post-rate cut",
    "publish_date": "Mon, 26 May 2025 11:21:15 +1000",
    "category": "finance",
    "authors": [
      "Shona Hendley"
    ],
    "text": "“The rate cut definitely helped with bidding confidence, and I think it will help the market get even stronger,” Kohli said. Loading The property was one of 1184 scheduled to go to auction in Melbourne this week. By evening, Domain Group recorded a preliminary auction clearance rate of 70.8 per cent from 876 reported results throughout the week, while 63 auctions were withdrawn. Withdrawn auctions are counted as unsold properties when calculating the clearance rate. Elsewhere, an upsizing family beat 11 other registered bidders for a double-storey Gladstone Park home, only ever owned by one family, paying $1.01 million at auction on Saturday, well over its reserve. The home at 16 Goodwood Crescent was listed with a price range of $770,000 to $820,000.\n\nLead agent and auctioneer Phillip Mercieca from Ray White Gladstone Park said it was a “fantastic campaign.” “The home was very popular with over 90 people through in four weeks.” The property’s spaciousness and five bedrooms were major drawcards with many families interested in the home. The “hotly contested auction” had 12 registered bidders, a mix of young families and second and third-home buyers.\n\nThe auction opened at $830,000, just shy of its $850,000 reserve. Mr Mercieca described the bidding as “fierce”. Loading “In the end, only six bidders were active, with some of the others not even able to get their hand up,” he said. The home sold to a family who had been looking to upsize for a long time. “They were incredibly excited,” said Mercieca. The vendors who had built the home in 1985 were equally thrilled. “There was a bit of emotion as it was the family home, but they were overjoyed,” said Mercieca.\n\nThe result shows the strength of the current market, believes Mercieca. Last week the Reserve Bank cut the cash rate for the second time this year. “The market is alive and well, and demand is outstripping supply at the moment, which is pushing prices up,” he said. “Hopefully, we see more listings come on to meet the demand we’re getting, but we’re definitely seeing more confidence from buyers.” In Brunswick, a single-storey terrace sold at auction for $1.21 million on Saturday, over its reserve of $1.17 million. Records show it last sold for $675,000 in 2012.\n\n48 Frederick Street was listed with a price guide of $1.05 million to $1.15 million. Loading The auction had four active bidders, including two investors - one from Western Australia - and two young couples. “It is in a really good spot with bigger than average bedrooms and storage,” said lead agent Scott McElroy from Belle Property Carlton. “It’s also walking distance to the train station, which was a feature that appealed to the bidders,” he said.\n\nThe auction opened with a bid of $1.05 million, and went up in $10,000 increments, then slowed down to $5,000 and $2,500. “It ended up being bought by an investor from Western Australia who plans to rent it out,” said McElroy. McElroy said that while the recent interest rate cut hasn’t generated an obvious impact yet, he has noticed the market picking up in recent weeks. “We are seeing more people come through open for inspections and more emails and phone calls,” he said. “We’re seeing quite a few Sydney investors on the phone, too.” PRD chief economist Dr Diaswati Mardiasmo agreed, believing the auction clearance rate shows that last week’s RBA rate cut did work in “nudging some sticky buyers to purchase and make a decision.”",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-slide-trump-unsettles-wall-street-20250526-p5m23n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX dips, WiseTech jumps after $3.2b acquisition; $A hits US65c",
    "publish_date": "Mon, 26 May 2025 11:18:49 +1000",
    "category": "finance",
    "authors": [
      "Staff Reporter"
    ],
    "text": "The Australian sharemarket opened close to flat after President Donald Trump announced he would extend the deadline for the European Union to face 50 per cent tariffs until July 9 after a phone call with European Commission President Ursula von der Leyen.\n\nThe ASX was 6 points or 0.1 per cent lower shortly before 11am, as technology stocks gained thanks to a jump in local tech giant WiseTech.\n\nWall Street had its worst week in nearly two months. Credit: AP\n\nShares in WiseTech, the biggest tech stock on the ASX, jumped 5.7 per cent after the company announced it was buying US logistics software business e2open. The deal values e2open at $US2.1 billion ($3.2 billion), and WiseTech said the transaction would give it access to new customers and markets.\n\n“Acquiring e2open is a strategically significant step in achieving our expanded vision to be the operating system for global trade and logistics,” WiseTech founder and executive chair Richard White said.",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/property/news/mediterranean-style-masterpiece-built-in-six-months-sells-for-3-91m-20250526-p5m259.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mediterranean-style masterpiece built in six months sells for $3.91m",
    "publish_date": "Mon, 26 May 2025 11:11:07 +1000",
    "category": "finance",
    "authors": [
      "Sarah Webb"
    ],
    "text": "A Mediterranean-style masterpiece built in six months has sold for $3.91 million at auction, with a local couple placing the winning bid 40 minutes after seeing it for the first time.\n\nDubbed Casa Agape, the five-bedroom, four-bathroom showstopper at 68 Burn Street, Camp Hill, features soaring three-metre-high ceilings, a luxe pool house and a media room – and now holds the street’s house price record.\n\nWith a crowd of 150 onlookers, five bidders stepped into the auction ring on Saturday, a local doctor throwing down a $3.5 million opening bid.\n\nBidding climbed in $100,000 leaps to $3.7 million before the auction paused at $3.82 million, with the late-arriving couple negotiating on the floor to seal the deal.",
    "source": "TheAge",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/culture/music/superstar-lorde-crashes-her-own-theme-party-at-sydney-nightclub-20250526-p5m25v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Superstar Lorde crashes her own theme party at Sydney nightclub",
    "publish_date": "Mon, 26 May 2025 11:06:13 +1000",
    "category": "entertainment",
    "authors": [
      "Hannah Kennelly"
    ],
    "text": "What Was That is the lead single from pop singer Lorde’s new album – but it also aptly describes the reactions of some lucky Sydney fans who couldn’t believe their eyes when the Kiwi star turned up on the dance floor among them at the weekend.\n\nOn Sunday night, the Grammy award-winning songstress made a surprise appearance at a Lorde-themed night at Mary’s Underground nightclub, delighting unsuspecting fans.\n\n“Lorde appearing at Mary’s Underground in Sydney tonight was not on my 2025 bingo card but I fear I’ve won,” a user posted on TikTok.\n\nFootage shows the 28-year-old singer belting out her own lyrics and dancing with fans to a Girl, so confusing remix with Charli XCX. At one point, she gets behind the DJ decks while fans dance around her, using their phones to create a giant spotlight.",
    "source": "TheAge",
    "cluster_id": 36
  },
  {
    "url": "https://au.news.yahoo.com/young-aussie-travellers-18-hour-nightmare-in-chinese-airport-after-passport-vanishes-010159358.html",
    "title": "Young Aussie traveller's 18-hour nightmare in Chinese airport after passport vanishes",
    "publish_date": "2025-05-26T01:01:59Z",
    "category": "finance",
    "authors": [],
    "text": "Maddi Healey, 20, said her passport was nowhere to be found after her 10-hour flight from Sydney.\n\nInstead of enjoying an overseas holiday she had \"dreamed of for years\", an Aussie traveller was left stranded in an overseas airport for more than 18 hours after her passport went missing on her flight.\n\nMaddi Healey, 20, and her friend flew over 10 hours from Sydney to Guangzhou, China earlier this month, speaking excitedly about their plans to visit The Great Wall. However, as they lined up at the customs desk, Maddi realised her passport was nowhere to be found.\n\n\"We turned the bag inside out and searched my friend's bag. It was not there,\" she told Yahoo News. \"I then noticed a decent-sized rip in the top of my backpack that was not there before leaving for China.\"\n\nPanicked, the pair asked if the plane could be searched for the missing passport. Nothing was found.\n\nADVERTISEMENT\n\n\"Something didn't feel right...By this point, my friend and I had to make the tough decision as to whether or not she would continue the trip solo in the hope that I would recover my passport and meet up with her. We said our goodbyes,\" Maddi said.\n\nAussie stranded in airport for over 18 hours 'in complete despair'\n\nAirport staff instructed Maddi to sit down and that's what she did — waiting for over 18 hours without WiFi or access to power outlets to charge her phone. She claims she was given little information on what would happen next and that staff were generally unhelpful.\n\nAfter calling the Australian embassy, who were unable to help her as she hadn't yet gone through customs, Maddi had no faith her passport would be found or handed in. She got the impression that stolen passports were a \"very regular occurrence\" in the country from speaking to the embassy, and she sadly resigned herself to the fact she'd simply have to fly home. An airport worker came to her rescue.\n\n\"About seven hours in [ my wait], a lovely man who was working at the international desk came over and offered his help... he sat with me and booked me a ticket back to Sydney... I ended up paying $660,\" she explained, adding the worker forfeited his lunch so Maddi could eat something.\n\nADVERTISEMENT\n\n\"I believe that if it wasn't for him, I wouldn't have gotten home the way I did and in such a timely manner,\" she said. \"I was in complete despair, filled with fear and frustration.\"\n\nMaddi finally got on a flight back to Australia after spending 18 hours stranded in a Chinese airport. Source: TikTok/_maddikate\n\nWarning to Aussie travellers as passport theft on the rise\n\nMaddi is now warning Aussies to be \"so careful\" with their passport, urging travellers to \"keep it strapped to you at all times\".\n\n\"Don't assume everyone has the same level of respect for your belongings. Have all your documents photographed and saved in your phone,\" she said. \"I was extremely disheartened that I was missing out on a trip that I had dreamt of for years.\"\n\nADVERTISEMENT\n\nMaddi also called for a review of the international system, claiming there needs to be more services that help Aussies who are stuck in the \"grey area\" — not yet in the country but no longer on the plane.\n\n\"Being unable to be helped by the embassy due to a matter of metres is really hard. I hope no one else has to experience this during their travels.\"\n\nThere has been a significant increase in the number of Aussie passports stolen, with 1,942 reported to the Department of Foreign Affairs and Trade between 2023 and 2024 — a 28 per cent increase compared to the previous year.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 45
  },
  {
    "url": "https://au.news.yahoo.com/residents-blast-elon-musks-ugly-tesla-plan-in-aussie-suburb-223606178.html",
    "title": "Residents blast Elon Musk's 'ugly' Tesla plan in Aussie suburb",
    "publish_date": "2025-05-25T22:36:06Z",
    "category": "finance",
    "authors": [],
    "text": "The world's richest man, Musk has faced mounting backlash in recent months, now Australians are joining in.\n\nAustralians are pushing back against a new Tesla factory in Adelaide, citing concerns over its environmental impact and boss, Elon Musk. Source: Getty/AP\n\nPassionate residents in the south are pushing back against a plan to build a Tesla factory on a disused community reserve, with locals describing the proposal as \"ugly\", saying it would be a \"planet-destroying temple to billionaires\".\n\nIn April, Marion Council, in Adelaide's southwest, proposed selling Chestnut Court Reserve for a Tesla battery factory, service centre, and showroom, citing the potential financial benefits. However, many residents strongly opposed the plan, sharing concerns over its controversial owner, Elon Musk and the loss of green space.\n\nThe world's richest man, Musk has faced mounting backlash in recent months for his close involvement in the 2024 US election, his personal ties to President Donald Trump, and sweeping cuts to public services in his role as head of the US Department of Government Efficiency.\n\nTesla factories and showrooms around the world have recently drawn hundreds of protesters opposing Elon Musk’s political ventures — a scene Adelaide residents fear could be replicated if the proposed site goes ahead.\n\nThe site of the proposed Tesla factory. Source: City of Marion\n\nWhy are locals against a new Tesla factory in Adelaide?\n\nWhile the Chestnut Court Reserve has remained closed since 2016 due to contamination stemming from historical industrial activity, some 90 per cent of nearly 1000 community consultation responses rejected the proposal. A total of 897 respondents voted against the project, while just 57 were in favour.\n\nADVERTISEMENT\n\nCommunity members have created a website dubbed \"Trees Not Teslas\" to oppose the facility, stating that it could soon \"bring protests to the area and give the community a bad image\".\n\n\"Clearing this public land will mean removing 58 trees, including mature trees that help cool the neighbourhood and support biodiversity. Once they're gone, they're gone. Replacing these lost trees by replanting saplings does not offset the harm, and new sapling growth can't be guaranteed,\" the site read.\n\n\"The ground contamination, which was exacerbated by previous manufacturing (including car manufacturing) in the area, is larger and more widespread than most realise.\n\n\"Putting a factory on top of it will not help, and promises from private companies to clean and decontaminate public land are ahistorical. The government should, and can, commit to decontaminating the land itself.\"\n\nADVERTISEMENT\n\nMelbourne-based property developer MAB CCT Pty Ltd is behind the proposal to purchase and develop the land at Tonsley, with Tesla lined up as a long-term tenant.\n\nWhile much of the focus has been on Chestnut Court Reserve, it represents only a small portion of the total land the developer aims to acquire. To progress the deal, the City of Marion is currently applying to the South Australian Government to revoke Chestnut Court Reserve’s classification as \"community land\", a necessary step before it can be sold. Supporters of the project, including Marion’s mayor, said it will generate around 100 jobs and bring economic benefits to the area.\n\nProtesters against the Tesla Battery Factory plans for Chestnut Court Reserve. Source: The Adelaide Advertiser\n\nBut City of Marion councillor Sarah Luscombe is against the idea. She argued council should look at alternatives.\n\n\"If council wants to do more to activate the land, then it could be put out to open tender to more local companies who could innovate and do something with the land for conservation biodiversity (and) improve tree canopy,\" Ms Luscombe told The Adelaide Advertiser.\n\nADVERTISEMENT\n\nThe issue is set to be discussed at the next council meeting. Yahoo News has contacted the City of Marion for comment.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 46
  },
  {
    "url": "https://au.news.yahoo.com/young-truckie-shares-job-secrets-amid-major-warning-for-aussie-industry-massive-problem-055742087.html",
    "title": "Young truckie shares job secrets amid major warning for Aussie industry: 'Massive problem'",
    "publish_date": "2025-05-25T05:57:42Z",
    "category": "finance",
    "authors": [],
    "text": "With the trucking industry facing massive driver shortages and a lack of young workers emerging, there's one truckie who is seriously breaking the mould.\n\nTruckers have got a bit of a dirty name, says CJ. But she's working to change that. Source: Facebook/Truckingwith CJ\n\nShe might have more than 200,000 followers across social media, but just don't call her an influencer. She's a truck driver who happens to make videos, taking Aussies behind the wheel to show what life is like on the road and behind some of the country's biggest vehicles.\n\nCasuarina Smith isn't who you would expect to be driving big rigs or road trains on mining sites, but she's worked her way up in the industry dominated by older men. At the age of 26 she threw in her job at an insurance company and a \"miserable\" corporate career to follow her dad and sister into the truckie life.\n\n\"We're farmers, turned truck drivers,\" she told Yahoo News Australia of her family. \"There's just no money for the small guys anymore [in farming].\"\n\nThe change from sitting behind a desk to sitting behind a wheel instantly suited her. \"When I transitioned ... I was taking home more money every week from driving trucks,\" she said, recalling that she was \"blown away\" by the potential money that could be made.\n\nADVERTISEMENT\n\nBetter known as CJ, some nine years later she's now become one of the most prominent faces in billion dollar trucking industry that is crucial to Australia's way of life.\n\nTruckie breaks the mould to show life behind the wheel\n\nIn a previous trip driving from Adelaide to Coober Pedy when she was still fresh in the industry, her dad came along for the ride and CJ filmed parts of the journey for her own recollection. It helped spark an idea, and eventually – about two years ago – she began posting videos of her job because she couldn't see anybody else out there doing it.\n\n\"Typically in our industry we’re not allowed to post anything online,\" she said. \"It's very shunned, and I guess it's seen as a liability.\"\n\nCJ admits truckies can feel a sense of loneliness, but she's trying to create a sense of community with her social media activity. Source: TruckingWith CJ\n\n\"I thought that was really disappointing because how do we encourage other people to get in the industry if we're not actually showing what's involved?\"\n\nADVERTISEMENT\n\nSo she went to HR and showed them a video of the trip she drove with her dad and got permission to post about what she was doing on the road.\n\nSince obtaining the \"top licence\" and navigating the world of fuel tankers and road trains she's turned the unique role into a small social media empire and become the de facto representative for a new generation of truckers.\n\n\"I had all these questions that I had no idea about, and I thought if I can learn something and share that with others, then others don't have to feel stupid in asking those questions,\" she told Yahoo. With so many drivers about to retire \"and take that knowledge with them\", CJ is trying to ask as many questions as she can to pass on the insights from older colleagues before it's too late.\n\nWarning over driver shortages in rapidly ageing industry\n\nIt's a service that could prove vital for the hugely important sector. Earlier this month, a report revealed that about 28,000 heavy-vehicle driving jobs went unfilled in Australia last year, prompting truckies to call for an industry overhaul to attract more young drivers.\n\nADVERTISEMENT\n\nThe same report, from the International Road Transport Union, found that nearly half of drivers in the country were over 55 and therefore nearing retirement, while a meagre five per cent of drivers were under 25.\n\nIt's a worrying state of affairs, says Wade Lewis, who is the vice president of the Australian Livestock and Rural Transporters Association.\n\n\"State and federal governments are going to have to step up and say we are going to start putting a lot more focus on this because it's really important we have young people coming through,\" he told the ABC, adding that long-distance truckers can comfortably earn as much as $150,000 a year.\n\n\"We already have a massive, massive problem. Every single trucking company is in trouble with drivers – they can't get them,\" CJ told Yahoo News about the headwinds facing the industry.\n\nADVERTISEMENT\n\n\"Truckers have got a bit of a dirty name,\" she said. \"I think at schools, no one encourages someone to be a truck driver.\"\n\nCJ uses a drone to show why not giving trucks space can be a bad idea. Source: Facebook/Truckingwith CJ\n\nTruckie shares major road mistake she sees drivers make\n\nCJ doesn't just share videos relevant for those interested in the industry, but also for everyday drivers, highlighting potential road mistakes that could end in serious disaster – like trying to overtake a turning truck.\n\nParticularly when she's driving on remote roads where she's able to get a drone up to perfectly illustrate the potential dangers of not giving trucks the requisite space.\n\n\"My god, it happens all the time,\" CJ said. \"There's an overwhelming naivety about how much space we need... People just don't know.\n\n\"People see a tiny gap and jump in it not realising we actually had that space on purpose.\"\n\nIt's advice that is echoed by the Executive Director of the National Heavy Vehicle Regulator (NHVR), Michelle Tayler. Speaking to Yahoo News recently, she said the one thing truckers want to convey to drivers is to always remain respectful of sheer power and size of Australia's transport trucks.\n\n\"We’ve got more than 200,000 truck drivers across the country ... and they're on the road all the time,\" she said.\n\n\"It's a two way street... As a truck driver they need to respect the fact that they're in a much larger vehicle and it can be quite intimidating to smaller cars.\n\n\"But also as a smaller vehicle, if you're putting yourself in danger, you're really leaving your life in the hands of that truck driver,\" she said.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 47
  }
]