[
    {
        "url": "https://www.9news.com.au/national/ansett-airlines-revived-by-melbourne-entrepreneur-now-ai-powered-travel-agent/f3c32bb5-cd03-457f-b994-0830f38925fc",
        "title": "Australian airline which famously collapsed in 2001 is given new life",
        "publish_date": "Mon, 28 Jul 2025 00:50:18 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "A once-mighty Australian airline which stopped flying in 2001 has resumed business – but not back in the skies.\n\nAnsett Australia, formerly operated by Air New Zealand, collapsed into administration nearly 24 years ago and at its height was the country's second-biggest airline.\n\nAnsett has now made a surprise triumphant return to the travel industry as an AI-operated travel agent known as The Ansett Travel Platform.\n\nAnsett planes ready for work at Sydney Airport in 2001. (Dallas Kilponen)\n\nMelbourne tech entrepreneur Constantine Frantzekos is the brains behind Ansett's timely revival.\n\nHe said he spotted a \"quiet opportunity\" when he noticed the once-famous Ansett trademark had lapsed.\n\n\"I registered the trademark, created a fleet of AI agents, and – thanks to a tech integration with (Victoria's Startup of the Year) TRAVLR – The Future of Travel Commerce - have now turned Ansett into a one-founder online travel agency,\" Frantzekos said on LinkedIn.\n\nFrantzekos claims Ansett is the country's first \"truly AI-run travel agency\" and said it uses artificial intelligence to shave money off the price of hotels, flights and holiday packages.\n\nHis new website is already live with advertisements for holiday deals to the likes of Tokyo, Athens, Las Vegas and Bali.\n\nREAD MORE: Plane gashed open after airport collision in Melbourne\n\nAnsett Airlines was grounded in 2001 after Air New Zealand failed to find a buyer. (National Film and Sound Archive)\n\nFrantzekos describes Ansett as \"like the Costco of travel\".\n\nAround 16,000 people lost their jobs and a 65-year legacy circled the drain when the axe fell on Ansett in September 2001.\n\nIt flew an estimated 10 million passengers and had a 69-plane fleet before it collapsed.\n\nREAD MORE: There is a larger problem for Trump in the Epstein chaos\n\nThe new Ansett Travel website is live now. (Supplied)\n\nThe Ansett Airlines section of the passenger terminal at Essendon Airport in 1969. (Fairfax Photographic)\n\nIt was reported at the time that Air New Zealand failed to offload Ansett to Singapore Airlines and Qantas, while former Transport Minister John Anderson vowed the government would not \"spend a dollar\" to rescue it.\n\nThe former News Corporation acquired a 50 per cent stake of Answett in the early 1980s before Air New Zealand bought the airline in an ill-fated deal in 2001.\n\nAnsett was founded by aviation pioneer Sir Reginald Ansett in 1935.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/australia-retirement-super-finance-money/44158611-c6a6-401b-90be-5d167eb150d0",
        "title": "Millions of Aussies 'unable to afford retirement'",
        "publish_date": "Mon, 28 Jul 2025 00:05:10 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "More than 4 million Australians worry they won't be able to afford retirement, new research shows.\n\nUp to 20 per cent of Australians fear they will not gain enough from their super or other investments to ever stop working, while one in five said they will have to cut back on their spending, a study from Finder revealed.\n\nThe Association of Superannuation Funds of Australia recommends singles have $595,000 tucked away and couples have $690,000 to live comfortably in retirement.\n\nMillions of Australians now fear they won't be able to afford retirement. (Getty Images/iStockphoto)\n\nAccording to data from the ATO, the average Australian has about $172,000 in super, but the median sits at $66,000 for men and $52,000 for women.\n\nAs a result, the retirement dream could be out of reach for many Aussies.\n\n\"Insufficient super or savings could see millions of Aussies facing financial strain in their later years,\" Pascale Heylar-Moray from Finder said.\n\n\"More and more people are worried that retirement will arrive before the money does, leaving them underprepared.\"\n\nThis means more will have to fall back on measures such as the Age Pension, but Heylar-Morey warns this may not be an option for some: \"The Age Pension isn't guaranteed, your assets could disqualify you from receiving it\".\n\nA further 27 per cent of Aussies are still unsure if they will have enough super to get by in retirement, and 10 per cent believe they will need to utilise other investments to meet the shortfall.\n\nREAD MORE: Plane gashed open after airport collision in Melbourne\n\nAustralians are trying to find new measures to be able to retire comfortably (Getty Images/iStockphoto)\n\nAussies are now looking to find new measures to avoid financial pain.\n\nSome are taking shorter, planned, self-funded career breaks every five to 10 years, also known as \"micro-retirement\".\n\nSalary sacrificing, where people can send a percentage of their wage directly into their super, can also help build a larger safety net.\n\n\"Super earnings below $30K are taxed at a maximum of just 15%, which means salary sacrificing into super could help grow your wealth while also lowering your tax,\" Heylar-Morey said.\n\nShe also suggested Aussies consistently monitor the performance of their fund.\n\n\"Make sure that you aren't stuck in a poorly performing fund,\" she said.\n\n\"And check regularly that your employer is paying your 12% superannuation Guarantee contributions on time.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/older-google-pixels-recalled-over-fears-they-could-overheat-and-catch-fire/02111b24-7254-4f48-8fbd-26e2ad48eeca",
        "title": "Older Google Pixel smartphones recalled after burn injuries",
        "publish_date": "Sun, 27 Jul 2025 22:01:43 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "A recall has been issued for some Google Pixel 6a smartphones over fears the device could overheat and catch fire.\n\nIn a recall notice released the Australian Competition and Consumer Commission (ACCC) said: \"Incidents have occurred resulting in serious burn injuries.\"\n\n\"An overheating battery could pose a risk of fire and/or burns to a user.\"\n\nA recall notice has been issued by the ACCC for some Google Pixel 6a smartphones. (iStock)\n\nThe smartphone was released in July 2022 and sold by popular retailers including JB Hi-Fi, Harvey Norman and Officeworks until April this year.\n\nThis issue does not affect all Pixel 6a devices, only those with the model number G1AZG are impacted.\n\nA firmware update which provides new battery management features that mitigate the risk of overheating was rolled out to Google Pixel 6a smartphones on July 8.\n\nOwners of the smartphone have been advised that they do not need to return their devices, but should take steps to check if their phone is affected.\n\nConsumers can visit Google Pixel help page here to find out if their device is impacted.\n\nThe new battery management system will be activated for impacted devices once it receives the firmware update and reaches 400 battery cycles.\n\nIf the device is not impacted by the issue, the firmware update will have no impact on battery management and the device will perform the same as before.\n\nGoogle said some smartphone owners may be eligible to receive the cost of repairs, a cash payment or a Google Store hardware discount credit.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/pbs-medicine-script-prices-25-dollar-cap-prime-minister-anthony-albanese-pledges-legislation/3288c689-e5da-4999-ab35-2902b2c6a5d0",
        "title": "Aussies to save $200 million with slash to medicine prices",
        "publish_date": "Sun, 27 Jul 2025 22:35:20 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Australians can hopefully expect their medicine bills slashed very soon as the federal government brings key legislation to cut costs this week.\n\nPrime Minister Anthony Albanese is expected to fulfil a key election commitment with a bill this week to reduce the price of medicines listed on the Pharmaceutical Benefits Scheme to a maximum of $25.\n\nThe bill has bipartisan support from the Coalition, so it is expected to have an easy ride through parliament.\n\nREAD MORE: Plane gashed open after vehicle collision in Melbourne ﻿\n\n\"Every medicine on the PBS, no more than $25. We're working to make it law this week,\" Albanese posted on X this morning.\n\nThe current cap for PBS medicines﻿ is $31.60, following a previous cut by the Albanese government from $42.50.\n\nThe last time medicine prices were at the $25 level was in 2004, Albanese claimed on ABC's Insiders last night.﻿\n\nPensioners and concession card holders will see their medicine prices frozen at $7.70 until 2030.\n\nThe government claims the legislation will save Australians a collective $200 million.﻿\n\n\"Cheaper medicines is another way we are helping with the cost of living, while putting downward pressure on inflation – our number one focus,\" Albanese said in a pre-election announcement in March.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/mcdonalds-fight-against-safety-beach-victoria/57c44ad9-cf46-494f-8189-ec1b81f0e399",
        "title": "Locals lose fight against McDonald's in beachside suburb",
        "publish_date": "Sun, 27 Jul 2025 08:56:44 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Mornington Peninsula locals have lost a six-year fight to stop the development of a fast-food restaurant just metres away from the foreshore.\n\nConcerns about traffic, litter, and impact on smaller businesses were raised.\n\nSand, salt and a servo have been the mainstays of the Safety Beach shoreline.\n\nMornington Peninsula locals have lost a six-year fight to stop the development of a fast-food restaurant just metres away from the foreshore. (Nine)\n\nBut now the tides of change are rolling in with the golden arches of McDonald's looming.\n\nFor six years, locals have resisted, fencing out a commercial takeover.\n\nBut last week VCAT upheld an appeal to expand the service station and add a fast food outlet next door, calling the existing service station tired and outdated.\n\nMayor Anthony Marsh said it's a \"step too far\".\n\nA major concern is the fear of traffic congestion.\n\nMayor Anthony Marsh said it's a \"step too far\". (Nine)\n\n\"It's a bit quiet now in mid-July, but if you were to come back in five months you'd find cars banked up for hundreds of metres on some days,\" Marsh said.\n\n\"You have boats and a lot of jet-skis also navigating the intersection,\" Dromana Association president Simon Brooks ﻿said.\n\nREAD MORE: Passengers evacuated from plane onto runway after landing gear issue ﻿\n\nThere are also fears local businesses will face the squeeze.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/inside-the-world-of-super-hot-chillies-and-the-aussies-that-love-them/b42160e3-be8d-42c5-8f2a-926327a8e9c7",
        "title": "Inside the world of super hot chillies and the Aussies that love them",
        "publish_date": "Sat, 26 Jul 2025 23:23:32 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "There are three types of people who walk into Phillip Botha's spice shop in Perth 's north-east.\n\nThose who work in restaurants, those who want to add a kick to their meals at home and those who are looking for a challenge.\n\nFor customers in the latter category, Botha often sees groups of young men who are ready to sting their tongues to one-up each other.\n\nREAD MORE: ﻿ Man jailed over Bunnings chilli spray that left 11 people in hospital\n\nPhillip Botha has seen a new wave of customers with a growing enthusiasm for chillies (Supplied)\n\n\"You do have the people who are just crazy and say 'give me the hottest product in the shop, I want to see if I can handle it﻿',\" he told 9news.com.au.﻿\n\n\"If a bunch of guys get together, they just want to prove who can handle the hottest things.\"\n\nSometimes the products have a Scoville rating, which is a measurement of spiciness, of more than a million.\n\n\"They love to come and tell me the stories,\" Botha said.\n\n﻿\"Some of them say 'that was absolutely crazy, we all almost passed out but we're going to try it again'.﻿\n\n\"Although with women, I find they're the return customers, they really enjoy the heat.\"\n\nREAD MORE: Freak tornado carves path of destruction\n\nBotha's store specialises in chillies and the hottest sauces. (Supplied)\n\nFor others, the store is a way to stay connected to their cultures and get a taste of home through food.\n\n\"There's a group of people from parts of Asia who feel they can't find what they're looking for in Woolworths and Coles,\" Botha said.\n\n\"In my shop, the hottest sauce, it's a lady who comes to buy it.\n\n\"She will come and buy a bottle a month, it's two million Scovilles.\"\n\nGrowing appetite for eating challenges\n\nBotha has owned the Spice Wagon and Latino Grocer in Morley for 16 years.\n\nHe has seen a new wave of customers with a growing enthusiasm for chillies in recent years, inspired by the US TV show Hot Ones, a chat show where celebrity guests answer questions as they attempt to eat rounds of chicken wings coated in spicy hot sauce.\n\n\"They try to emulate that where they have a chilli challenge,\" he said.\n\n\"There's quite a bit of that crowd that says 'give us the mildest to the hottest you've got'.\n\n\"They say 'we've seen it on Hot Ones , we're going to try it' and I say 'do you know how hot it is?'﻿\n\n\"I do find that even the restaurants now, they try to satisfy that need.\n\n\"We do sell it to quite a few restaurants who use it for chicken wing challenges.\"\n\nThe success of the show has led to a bigger following and knowledge of chillies.﻿\n\n\"They know what a Carolina reaper is and a ghost chilli is,\" Botha said.\n\n'It takes your breath away'\n\nWhile the hit show has brought a greater awareness to chilli products, another incident brought one item to infamy this month.\n\nFather-of-three Paul Andrew Hart was jailed for 16 months after he sprayed a chilli substance called Satan's Spit inside Bunnings Northam in Western Australia.\n\nThe 52-year-old claimed he intended to release a \"fart spray\" he bought online to \"lighten the mood\" but grabbed the wrong can from his pocket.\n\nREAD MORE: Sydney man eats 276 chicken wings to claim world record\n\nFather-of-three Paul Andrew Hart was jailed for 16 months this week. (9News)\n\nIn Botha's 16 years in business, he has never seen anything like it.\n\n\"It's really like being pepper sprayed, it's not a toy,\" he said.\n\n\"Not knowing what it is, you'd catch a fright, it takes your breath away.\"\n\nBotha's stocks the 30ml bottle in his store, which sells for $22 and is normally used in small amounts on food in restaurants.\n\n\"You have to dilute it,\" Botha said.﻿\n\n\"I usually talk to people when they buy it and say 'listen, it's not a game'.\n\n\"I don't sell it to school-aged kids, youngsters do come in and ask about it.\"\n\nREAD MORE: Aussie pro training for US hot dog eating competition by wolfing down burgers ﻿\n\nPhillip Botha stocks the 30ml bottle in his store, which sells for $22 and is normally used by restaurants. (Supplied)\n\nThe product has a Scoville rating of 1.8 million.\n\nIn comparison, pepper spray is normally rated between two and five million.\n\nIf reforms were ever introduced for the spray, Botha suggested the product should be treated like alcohol.\n\n\"It may be regulated to be sold from behind the counter or sold like liquor where you've got to be of age or a responsible adult,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/what-is-the-difference-between-the-cold-flu-and-rsv/105552230",
        "title": "What's the difference between the cold, flu and RSV?",
        "publish_date": "Mon, 28 Jul 2025 01:19:57 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When we're talking about winter illnesses, people use general terms like cold and the flu as if they're the same thing.\n\nBut while they both tend to make us feel pretty rubbish, there are some key differences between them.\n\nAt the same time, respiratory syncytial virus (RSV) is also circulating in the community, causing similar symptoms.\n\nHere are the differences between the common cold, the flu and RSV.\n\nWhat is a cold?\n\nIt's a generic term for an infection that generally affects a person's nose and throat.\n\nThere are more than 200 viruses that can cause a common cold, most of them being either a type of rhinovirus or coronavirus, Australia's public health information service, Healthdirect, says.\n\n\"The symptoms of a cold are usually mild,\" the service's website says.\n\n\"In most cases, you can treat the symptoms of a mild cold yourself.\n\n\"Most people will get better by themselves within seven to 10 days without any treatment.\"\n\nWhat is the flu?\n\nThe flu is a nickname for influenza.\n\nWhile you may hear people use cold and flu interchangeably, they're actually different diseases.\n\nAnd the flu can be much worse than a cold, Health Direct says.\n\nInfluenza B hitting children hard this flu season Photo shows A young girl in a hospital bed, surrounded by her parents and brother. After missing her flu vaccine for just one year Millie Campbell was fighting for her life.\n\nPeople at risk of developing a severe illness include young children, people over 65 years old and Aboriginal and/or Torres Strait Islander people.\n\nPregnancy is also a risk factor for a serious bout of the flu.\n\nIn serious cases, the flu can lead to pneumonia, breathing difficulties and death.\n\n\"[But] most people will get better by themselves within seven to 10 days and without any treatment,\" Healthdirect's website says.\n\nRest and plenty of water as essential to fighting off an infection. (Getty Images: Roos Koole)\n\nWhat is RSV?\n\nRSV stands for respiratory syncytial virus.\n\nWhile it can affect people of all ages, it's most serious for infants, young children and older adults with chronic health conditions, Health Direct says.\n\nIt can lead to serious respiratory illnesses like bronchitis and pneumonia.\n\n\"There is no specific treatment for RSV, but having lots of rest and drinking plenty of fluids will help you recover,\" Healthdirect's website says.\n\n\"Most people recover from RSV in about 10 days.\"\n\nWhat are the symptoms of a cold, the flu or RSV?\n\nThey might sound the same, but there are specific differences between the three.\n\nHere's how Health Direct breaks it down:\n\nSymptom Cold Flu RSV Cough X X X Stuffy or runny nose X X X Sneezing X X Sore throat and sore ears X Headache X Red eyes X Loss of appetite X Irritability X Fever Some children may X Feeling hot or cold X Shivering X Diarrhoea or vomiting X Fatigue X Wheezing X Body ache X\n\nHowever, Healthdirect says that sometimes symptoms can differ and overlap.\n\nHow do I know if I should see a doctor?\n\nHealthdirect has an online service called Symptom Checker that helps you work out if you should see a doctor or treat yourself at home.\n\nIt asks you a few questions about your symptoms and gives you general advice.\n\nIt can also help you find a healthcare provider.\n\nThe service can help you decide whether you should see a doctor. (Healthdirect)\n\nBut, as a guide, Healthdirect has this advice on its flu website:\n\nSee your doctor if you: are concerned about your symptoms\n\nhave a high fever (over 38 degrees Celsius)\n\nhave a cough that's not improving\n\nare in a high-risk group\n\nWhen should I go to the hospital?\n\nWhile many people won't need specific medical treatment for mild respiratory illnesses, some cases can become quite serious.\n\nHealthdirect says people should call triple-0 if someone is having severe difficulty breathing or turning blue.\n\nHere are some more warnings on the service's website:\n\n\"If your baby is younger than 3 months old and has a fever above 38°Celsius, take them to the nearest hospital emergency department immediately, or call triple zero (000) and ask for an ambulance.\"\n\n\"If your child is having difficulty breathing, is turning blue, is grunting or is lethargic, call triple zero (000) and ask for an ambulance.\"\n\nThe service also has these specific warnings about the common cold on its website:\n\nSee your doctor urgently if you (or your child) have had cold or flu-like symptoms and you: have signs of dehydration\n\nare vomiting often\n\nhave an intense headache or neck stiffness\n\nhave chest pain\n\nhave trouble breathing\n\nhave a rash\n\nDoes it matter what I have?\n\nThe COVID-19 pandemic had many of us used to the idea that we needed to test ourselves to understand what was causing our illness.\n\nWe asked Gemma Saravanos, a registered nurse and infectious diseases epidemiologist from the University of Sydney, if there was much point in that now.\n\n\"Knowing the specific pathogen causing your respiratory illness may not provide a benefit [for treatment], particularly if you have a mild illness and no risk factors for severe disease,\" Dr Saravanos said.\n\nHowever, there are a lot of benefits to testing.\n\n\"Home testing kits, or testing in healthcare services such as general practice, can guide our decision-making around infection prevention practices,\" Dr Saravanos says.\n\n\"Testing is also important for those who may be eligible for influenza or COVID-19 antiviral medication.\n\n\"Lastly, testing also serves a public health function. It helps us to understand what pathogens are circulating in the community and this can inform public health advice and research, such as vaccine effectiveness studies.\"\n\nTest your knowledge about influenza Photo shows A man with black hair and glasses wears a face mask while animated spike proteins surround him As influenza cases rise, so do the number of myths about how to treat it. We separate fact from fiction.\n\nShould I be testing myself?\n\n\"There are no clear guidelines for respiratory testing in the community,\" Dr Saravanos says.\n\nAnd it's not always easy — or cheap — to get tested.\n\n\"Testing may not always be available depending on access and affordability of home testing kits, and laboratory services,\" Dr Saravanos says.\n\n\"Without testing, it is very difficult to know what pathogen is causing a respiratory infection, so it's important to be guided by symptoms and modify our behaviours accordingly to avoid spreading infection.\n\n\"What feels like a mild cold for you may result in a severe illness for another person.\"\n\nSo knowing what you have might help you make better choices about where you go and what you do when you're sick.\n\n\"It's good to know because, for example, I've got parents in their 90s and if I've got a mild cold I might go and see them with a mask,\" Patrick Reading, director of the WHO Collaborating Centre for Reference and Research on Influenza, said.\n\n\"But if I've got influenza, that could be really life-threatening to them.\"\n\nHow do you treat a cold?\n\n\"Most respiratory infections can be safely managed at home with rest, hydration and over-the-counter analgesics (such as paracetamol),\" Dr Saravanos says.\n\n\"We do have antivirals to treat COVID-19 and influenza and these are recommended for older adults and those with certain risk factors.\"\n\nWe asked Dr Saravanos what sorts of foods people should eat if they wanted to speed up their recovery.\n\nBut there doesn't appear to be a magic formula.\n\n\"There is little evidence that foods or supplements will speed up recovery,\" she says.\n\nHow much time should you take off?\n\n\"Be guided by your symptoms,\" Dr Saravanos says.\n\n\"If you are feeling unwell or have active symptoms, it is best practice to stay home, especially in the first few days of illness.\n\n\"This supports recovery and also reduces the risk of passing the infection on to others.\"\n\nHow to call in sick Photo shows woman holding her dog while on the phone We look at your obligations when it comes to calling in sick, including what to say and what evidence you may need.\n\nWhen should you start exercising again?\n\n\"This depends on a range of factors, including severity of illness and individual characteristics such as immune function and fitness,\" Dr Saravanos says.\n\n\"A week may be sufficient for some people, however others will need more time for recovery.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/blood-donation-record-attempt-bloody-good-tour/105555536",
        "title": "Dad rallies Australians to set new blood donation record",
        "publish_date": "Mon, 28 Jul 2025 01:09:44 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Simon Braun is out for blood. Quite literally.\n\nThe father of three has spent the past year driving around the country with his kids, visiting the nearly 80 Lifeblood centres across Australia.\n\n\"Simmo\" said he hoped to enlist more than 33,000 new blood donations, donating plasma himself about every fortnight.\n\nBut tens of thousands of kilometres in a caravan, distance education, and regular donations have not drained him.\n\n\"Donating blood energises me,\" he said.\n\nNew recruits are part of the drive around Australia. (Supplied: Simon Braun)\n\nDonating blood has been a constant bright spot through Mr Braun's challenges.\n\nHe recalled sitting in the donor chair during a \"dark time\" in his life, and feeling \"genuinely happy\" for the first time in a long time.\n\nHe joined the dots.\n\n\"The best way to get out of your own head is to get into someone else's heart,\" he said.\n\nChanges and challenges to donation\n\nThere have long been barriers to blood donation for many people.\n\nThis month, Lifeblood relaxed its rules around sexual activity and donation.\n\nGay and bisexual men and transgender women who have sex with men were allowed to donate plasma.\n\nLifeblood said it was working towards similar changes for whole blood and platelet donation.\n\nChanges to donation rules came into effect this month. (AAP: Angela Brkic)\n\nIn 2022, people who were in the UK during the \"mad cow disease\" outbreak were allowed to donate again after a 22-year ban.\n\nLifeblood researcher Rachel Thorpe said while safety for donors and recipients was the priority, the organisation hoped to get as many people as possible in the blood donation chair.\n\n\"Ultimately we would like more people to be eligible to donate blood,\" she said.\n\nBeing in the regions has also stopped people donating, with Lifeblood centres concentrated in cities.\n\nWA has no permanent centres north of Perth, and the NT's only permanent centre is in Darwin.\n\nThere are pop up centres in some regional towns, and Lifeblood also has mobile \"blood buses\" to allow country people to donate.\n\nRegular visits from blood vans allow donation options in urban and regional centres. (Supplied: Simon Braun)\n\nBut ultimately, cities and regional centres have the most potential with 90 per cent of Australians living within half an hour of a donor centre.\n\nAnd for people who could not regularly donate, Dr Thorpe said having people such as Mr Braun start the conversation was a big help.\n\n\"A lot of people don't really talk about blood donation, it's one of the big barriers to donating blood,\" she said.\n\nOvercoming misconceptions, fears, and 'busyness'\n\nDr Thorpe said common \"misunderstandings\" often stopped people donating.\n\nOne of those was people believing they were too old to donate — a myth Dr Thorpe was keen to bust.\n\nAustralians can be a first-time donor until they are 75, and if they have already donated in the past, there is no upper age limit.\n\nSimon Braun says regular donations have given him a much-needed mood boost in darker times. (Supplied: Simon Braun)\n\nFear of needles has been another common setback. But Mr Braun said that was not necessarily a bad problem to have.\n\n\"It's actually quite a privilege to be able to, with courage, face your fear head-on,\" he said.\n\nHe encouraged nervous donors to keep recipients front of mind.\n\n\"Maybe that's the five-year-old with leukaemia who doesn't get a choice about whether they get the needle or not,\" he said.\n\nLoading...\n\nBut in the thousands of conversations Mr Braun has had about blood donation in the past year, the common theme was not fear, or lack of information, or distance.\n\nIt was time.\n\n\"Everybody's busy these days,\" he said.\n\n\"In fact, you ask someone how they are and they say 'busy'.\"\n\nHis answer to the dilemma was simple.\n\n\"A blood donation takes maybe seven minutes with a needle in the arm for whole blood, and you're in and out in half an hour,\" he said.\n\n\" That act can save three people's lives — so are you really so busy that your time is worth more than six lives an hour? \"\n\nBringing in new blood\n\nMr Braun and his family have been documenting each leg of their journey on The Bloody Good Tour website.\n\nSimon Braun visited Lifeblood centres all over the country. (Supplied: Simon Braun)\n\nThe culmination of the tour will be a national record attempt on July 31.\n\nMr Braun will be donating in Sydney, where the tour wraps up.\n\nBut he has asked people from all over the country to sign up to his donor team, to reach the most donations in a single day by one team.\n\nThe number to beat is 523: a record set by Commonwealth Bank employees in May.\n\n\"With a bit of cheek, we can't let a bank hold the record,\" Mr Braun said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/alex-de-minaur-alejandro-davidovich-fokina-dc-open-final/105580568",
        "title": "De Minaur's classy move after stopping Spaniard from winning first title",
        "publish_date": "Mon, 28 Jul 2025 01:07:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Alex de Minaur has won an epic Washington DC Open final against Alejandro Davidovich Fokina, claiming his 10th singles title 7-3 in the final-set tiebreak.\n\nThe 5-7, 6-1, 7-6(3) victory gave de Minaur his first championship of 2025, and denied Davidovich Fokina his maiden title.\n\nComing off the disappointment of another impressive grand slam campaign at Wimbledon ending in comprehensive defeat, de Minaur showed all his shot-making, athleticism and grit in the three-hour, three-minute win.\n\nHe etches his name alongside Tony Roche (1971), Ken Rosewall (1972), Lleyton Hewitt (2004) and Nick Kyrgios (2019, 2022) as Australian winners in the US capital.\n\nIt also propels the 26-year-old back into the top 10 after a brief absence, as the tour ramps up towards the US Open.\n\nDe Minaur was favoured against his 26th-ranked opponent, but it was clear from the outset he would not have it all his own way as Davidovich Fokina produced some stirring shots to win the first set in over an hour.\n\nThe Australian number one hit back by tearing through the second set 6-1, before being broken in the fourth game of the decider as Davidovich Fokina jumped out to 4-1 and 5-2 leads.\n\nThe 26-year-old served for the match at 5-3 and looked set for his first championship since turning pro in 2017 as he skipped to 30-0, before de Minaur battled back with four straight points to get back on serve.\n\nDown 15-30 on his serve, de Minaur framed a low volley that snuck over the net and out of his opponent's reach before the pair carried on to the first of six deuces in what turned out to be a 10-minute game, during which de Minaur fought off three match points.\n\nBoth players overcame any jangling nerves with successive clutch service holds to send the match to a tiebreak.\n\nDe Minaur got the early mini break to jump out to a 2-0 lead, before being reeled back in to 2-2, only to poke his nose back out in front at 4-2.\n\nDavidovich Fokina stayed in it with de Minaur's unforced error to keep it on serve, but the Australian rattled off three straight points to close out the match and win a thrilling decider with an ace.\n\nDe Minaur launched a ball into the stands, let out a primal scream and punched the air before shaking hands at the net with a clearly emotional Davidovich Fokina, who then slumped in his chair and buried his face on his towel.\n\nDe Minaur, who played junior tennis in Spain while living there as a teenager, sat with Davidovich Fokina and put his arm around the Malaga native who looked utterly crestfallen having fallen short in a final for the third time this year.\n\n\"You're way too good to not have one of these; it's coming for sure. You deserved it today, I just got lucky,\" the Australian said in the trophy presentation.\n\n\"You are a hell of a competitor, hell of a player. No-one on the tour wants to play you. This is not the end, this is only going up for you.\"\n\nOn the women's side, 2021 US Open runner-up Leylah Fernandez had a much easier time of it, brushing aside Russian Anna Kalinskaya 6-1, 6-2 in just over an hour.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/mossman-sugarcane-growers-trial-new-crops-due-to-mill-closure/105541598",
        "title": "Mossman sugarcane growers trial new crops due to mill closure",
        "publish_date": "Mon, 28 Jul 2025 00:44:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "For more than 125 years Mossman's cane growers have delivered a crop to the mill for crushing, but for some this year will be the last.\n\nSince the closure last year of their local factory near Port Douglas in Queensland's far north, farmers have been experimenting with other crops, as the future of their multi-generational industry is still uncertain.\n\nTheir current harvest is trucked 100 kilometres to Mulgrave for crushing, but this subsidised short-term solution may not be sustainable long term.\n\nThe Queensland government has put together a $12.5 million package announced in the budget to support Mossman cane growers with the loss of the sugar mill.\n\nAbout $6m of those funds will fully subsidise the cost of transporting this season's cane harvest from Mossman to Mulgrave Mill, which is critical for growers to make a profit.\n\nThe other $6m will be used to work towards long term solutions and projects beyond 2025.\n\nDiscussions between stakeholders are taking place about how this money is best spent.\n\nDetermined to stay on the land, growers say they have no choice but to try growing crops other than cane.\n\nSpeculation continues about potential buyers of the mill. (Supplied: Far Northern Milling)\n\nGrowers transitioning to new industries\n\nFourth-generation Mossman farmer Don Murday is the deputy chair of Queensland Cane, Agriculture and Renewables, a group that advocates for sugar growers.\n\nHe believes making fuel from plants is the future for Mossman, and has been trialling bana grass, a crop similar to sugarcane but without the sucrose content, used to create biofuels.\n\nHe said the results had been great so far and this would most likely be his last year growing sugarcane.\n\nBana grass looks and grows like sugarcane. (ABC Rural: Sophie Johnson)\n\n\"The leading projects I believe in this transition are bana grass for renewable energy,\" he said.\n\n\"I'm going to transition into bana grass with maybe a few other crops in the interim, but I won't be planning any more sugarcane.\n\n\"I may well be taking the sugarcane out after this harvest.\"\n\nFrom a financial perspective, Mr Murday said using the grass to produce biomass — organic material that can be converted into a renewable energy source — was a viable option.\n\n\"With the predicted tonnages of the bana grass and the price that's being offered, we're looking at gross value of between $4,000 and $5,000 per hectare with lower growing cost than sugarcane,\" he said.\n\n\"So I believe growing the bana grass will compare very favourably to growing the sugarcane at the current prices.\"\n\nThe Mossman mill closed last year. (Supplied: Far Northern Milling)\n\nMatthew Watson also farms in Mossman and has been trialling different crops including coffee, cocoa, corn and sorghum.\n\nHe also sees potential in bana grass, which he said was practical to grow in the district.\n\n\"Bana grass is a grass the same as cane … it grows the same, you can plant it the same, cut it the same [and] we've got all the machinery to do that,\" Mr Watson said.\n\n\"It seems to be growing really well in the trial patches that they've got around the district at the moment.\n\n\" I can't see any reason why it wouldn't, you know, be the greatest thing since sugarcane. What we do with it is the million-dollar question. \"\n\nMatthew Watson has been trialling other crops. (ABC Rural: Sophie Johnson)\n\nNeed for processing facility\n\nGrowing anything without a local processor would be challenging, and Mr Murday and Mr Watson are both apprehensive about what will become of the Mossman factory.\n\nMr Murday said he hoped it could be turned into a biomass processing facility.\n\n\"It's probably 12 to 18 months before we're going to have any commercial quantities [of bana grass] available, and one of the processes that we're looking at is could effectively be operating within 12 months from the time they're given the go-ahead,\" he said.\n\n\" It is feasible, it's just a matter of getting through this process of acquiring the mill site if it's necessary, or someone coming in and starting up separately — I'm not sure which the process is going to be. \"\n\nSome farmers won't make concrete decisions until the future of the mill is more certain. (ABC Rural: Sophie Johnson)\n\nFor now, Mr Murday is only growing bana grass for propagation — experimenting with reproducing the plants — and not for commercial processing.\n\nMr Watson said it would be hard to see a clear future for his farm until more decisions about ownership of the mills or new processing facilities were made.\n\n\"We really just don't know, unfortunately,\" he said.\n\n\"The killer is the not knowing what you're doing from day to day, trying not to get stuck in the negatives.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/kununurra-rental-crisis-groh-housing/105570426",
        "title": "WA town has no homes available but hundreds of people looking",
        "publish_date": "Sun, 27 Jul 2025 23:56:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "For the past couple of years, Billie Mills has wanted a suitable house to rent in Western Australia's north for herself and her two children.\n\nBut the 39-year-old feels lucky to have a single room in her share house in Kununurra, 3,000km north of Perth in the remote East Kimberley.\n\nBillie Mills works full-time but can't secure a suitable home. (ABC Kimberley: Giulia Bertoglio)\n\n\"There were periods when I was sleeping in my car, out of my swag, and couch surfing,\" she said.\n\nMs Mills works full-time in Kununurra, a town with more than 5,000 residents but no properties available for rent.\n\nThere are no rental properties available in Kununurra. (ABC Kimberley: Giulia Bertoglio)\n\nNothing for rent\n\nOut of the East Kimberley Real Estate office, the window displaying Kununurra properties for rent is empty.\n\n\"We don't have anything to advertise or to offer anyone who's looking for a rental,\" the agency's Jill Weller said.\n\n\" We have a long list of excellent tenant applicants waiting for a rental property to become available, and that's year-round. \"\n\nJill Weller says there are many people desperate to secure a rental in Kununurra. (ABC Kimberley: Giulia Bertoglio)\n\nMs Weller said the situation was \"dire\" and even harder for those who were not \"preferred\" tenants.\n\nAt least half of her office's rental roll was made up by corporate clients, including government agencies and private companies looking to secure housing for employees, she said.\n\nThe tenancies are seen as more \"secure\" by local landlords.\n\nThe stunning landscape around Kununurra is a major selling point for would-be residents. (ABC Kimberley: Ted O'Connor)\n\nThe role of government-subsidised housing\n\nThe state's Government Regional Officer Housing (GROH) program manages 319 dwellings across Kununurra and the neighbouring town of Wyndham.\n\nOf those, more than half (167) are leased from the private market.\n\nHousing Minister John Carey said the GROH program was crucial in ensuring regional communities attracted and retained government workers, including teachers and police.\n\nHomes with GROH leases are advertised as profitable investments in Kununurra. (ABC Kimberley: Giulia Bertoglio)\n\nSix GROH houses were built in Kununurra over the 2024-25 financial year as part of a $104 million funding injection across the state.\n\nThe Department of Communities did not respond to the ABC's questions regarding the number of GROH houses currently vacant in the East Kimberley.\n\nIn addition to vacant houses, there are GROH houses with multiple bedrooms allocated to a single tenant.\n\nCheaper to buy than rent in the Pilbara Photo shows A smiling woman standing in front of a fly screen door. The Pilbara topped recent reports of suburbs cheaper to buy in than rent.\n\nA Kununurra GROH tenant, who requested anonymity to protect their employment, said they were allocated a house with extra rooms they did not need.\n\n\"I was very happy to have just the one bedroom,\" they said.\n\n\"We take what's available.\"\n\nDespite providing a valuable service, they said the guarantee of secure housing sparked resentment from local recruits not eligible for the scheme.\n\nThe tenant said they moved to the East Kimberley to contribute to the community but would not have without secure housing.\n\nA small, crowded pool\n\nReal Estate Institute of Western Australia vice president Joe White said corporate leases made \"a critical situation more drastic\".\n\n\"When a mining company or government agency needs to rent a house, they can afford to pay more because they're not limited,\" he said.\n\n\"They will invariably bid higher and you see rents increase.\"\n\nKununurra's median rental price is $730 per week, nearly double what it was in 2021.\n\nJoe White estimates WA is 60,000 to 70,000 houses short of what is needed. (ABC News: Nicholas Martyr)\n\nMost vulnerable pay the price\n\nMr White said the most vulnerable paid the highest price in the current rental crisis.\n\n\"Every time a high-paid person comes into the community, the next most-vulnerable finds themselves on the street.\n\n\"The true figures are hidden because invariably they end up in share houses, living in garages or they leave town.\"\n\nBillie Mills is one of the Kununurra locals struggling with housing. (ABC Kimberley: Giulia Bertoglio)\n\nMs Mills is one of those paying the price — working full-time but unable to secure a suitable home for herself and her children.\n\nShe said she wanted to stay in the Kimberley.\n\n\" I've always got hope, but it's dwindling. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/tas-liberals-accused-of-breaching-caretaker-rules-on-marinus/105578730",
        "title": "Tasmanian Liberals accused of breaching caretaker conventions",
        "publish_date": "Sun, 27 Jul 2025 23:44:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "As votes continue to be counted and both major parties continue discussions with crossbenchers to form government following Tasmania's snap election, the government is being accused of breaching caretaker conventions.\n\nTasmania's Labor opposition has claimed the government's handling of two policy decisions — an increase in the borrowing limit for ferry operator TT-Line and the yet-to-be-made decision on whether to proceed with the Marinus Link undersea power cable — have contravened caretaker conventions.\n\nThe government said it would follow all relevant caretaker conventions and that it had briefed Labor on the TT-Line decision, and would consult with Labor on the Marinus decision \"in due course\".\n\nThe government says it briefed the Labor opposition on the decision to increase TT-Line's borrowing capacity. (Supplied: Angus Duncan)\n\nWhat are 'caretaker conventions' and are they binding?\n\nWhen the House of Assembly is dissolved for a general election, the government is placed in what is called a caretaker period.\n\nCaretaker conventions outline how the government should operate during the period.\n\nAccording to the guidelines, the conventions are \"neither legally binding nor hard and fast rules\" and they should be applied to individual cases with \"sound judgement and common sense\".\n\nProfessor emerita Anne Twomey, a constitutional law expert at the University of Sydney, said the conventions were developed \"as a matter of fairness\".\n\n\"The idea is that during that [caretaker] period, after parliament has been dissolved, where governments are no longer actively responsible to parliament because there's no parliament in existence, then they should be a lot more careful about what they do.\n\n\"You don't want to bind a new government, which may have completely different policies, by entering into a whole lot of commitments immediately beforehand to make life difficult for them,\" Professor Twomey said.\n\nProfessor Anne Twomey says if a government breaches caretaker conventions, it risks damaging its reputation with the public. (ABC News: Liam Patrick)\n\nWhat happens if the conventions are breached?\n\nProfessor Twomey said it \"comes down to the people\".\n\n\"It's really a political matter as to how effective they are. So, it comes down to the people, particularly when they vote, in terms of deciding whether the government has behaved appropriately,\" she said.\n\n\" If a government breaches it, then it risks damaging its reputation with the public. \"\n\nMajor policy decisions sometimes 'unavoidable'\n\nUnder the guidelines, governments are encouraged to avoid making major policy decisions that are likely to commit an incoming government.\n\nHowever, this is not always possible, Professor Twomey said.\n\n\"There is an additional principle that says, if you have to make a major decision in that period, then you should consult the other side as well and try to reach an agreed position,\" she said.\n\nThe government does not require endorsement from the opposition during consultation.\n\n\"Ultimately, it's the government that makes decisions.\n\n\"But it's better to try and get some kind of agreement between both sides in order to progress matters that are significant and would have an impact on an incoming government,\" Professor Twomey said.\n\nPremier Jeremy Rockliff has been leading a caretaker government since the House of Assembly was dissolved on June 11. (ABC News: Luke Bowden)\n\nLiberals won't release Marinus documents until decision made\n\nLabor is calling on the government to release the business case for the Marinus Link undersea power cable project, saying that withholding it is a breach of caretaker conventions.\n\nMarinus would be a second electricity interconnector between Tasmania and Victoria.\n\nMarinus Link's $1.7b cost blowout Photo shows Man stands in front of a large drum of cable. The Tasmanian government details the $1.7 billion reason for downgrading the Marinus Link electricity interconnector from two to one cables, but opposition parties say many questions about costs remain unanswered.\n\nA decision by the Tasmanian, Victorian and federal governments on whether to proceed with the project is due by the end of July.\n\nA whole-of-state business case was provided to the government by Treasury in May.\n\nThe government promised to release the case 30 days before its final investment decision, however said the release has been delayed due to the early election.\n\nLabor MLC Sarah Lovell said the premier needed to release the business case \"as soon as possible\".\n\n\"These are major financial decisions that will be made by the government.\n\n\"These are long-term decisions and under caretaker conventions one of the prerequisites is that decisions that are being made that will impact on future governments need [to have] all that information released to both the opposition and the government, and we're not seeing that from the premier,\" Ms Lovell said.\n\nSarah Lovell says the Marinus Link business case should be released \"as soon as possible\". (ABC News: Owain Stia James)\n\nOn Saturday, Liberal MP Felix Ellis said Labor had not been briefed yet \"because no final decision has been made\" on Marinus Link.\n\n\"We'll continue to work through the process. This is an important investment for our state, and we'll be updating the public as well as the opposition in due course,\" Mr Ellis said.\n\nState Energy Minister Nick Duigan also said on Saturday that \"all relevant information will be publicly released\" only once a decision on the project is finalised.\n\nMarinus Link would be a second electricity interconnector linking Tasmania and Victoria. (Supplied: Marinus Link)\n\nProfessor Twomey said the government did not have to be \"undecided\" before it consulted.\n\n\"It's fair enough for a government to take a view as to what it wants to do before engaging in consultation,\" she said.\n\n\"But if you're saying a decision means that's our final decision and we're not going to pay one iota of attention to anything you say, that would be rather pre-empting the consultation and making it pointless.\"\n\nAdequate consultation up to interpretation\n\nAt the weekend, the government agreed to support a temporary $410 million increase to Bass Strait ferry operator TT-Line's borrowing capacity.\n\nTreasurer Guy Barnett said the government received advice from Treasury on July 25 \"recommending TT-Line's guaranteed borrowing limit be increased\".\n\nThe planned Spirit of Tasmania berth at Devonport. (Supplied: TasPorts)\n\nAnother cost blowout for new Spirit ferries Photo shows The side of a large ship in port. Another $120 million cost blowout hits the embattled Spirit of Tasmania vessel replacement project, with berth infrastructure set to cost $493 million.\n\n\"[Opposition treasury spokesperson] Josh Willie was briefed on July 26, and the decision was announced the same day,\" Mr Barnett said.\n\nMr Willie said he received a call just over an hour before the decision was announced.\n\n\"Jeremy Rockliff's idea of 'consultation' is a last-minute phone call. That's not consultation — that's a courtesy call after the decision had already been made.\n\n\"When a major policy decision is being made during the caretaker period — especially one that would bind a future government — Labor must be consulted before the decision is made,\" Mr Willie said.\n\nGuy Barnett says Labor was briefed about the increase to TT-Line's borrowing limit the same day the decision was announced. (ABC News: Luke Bowden)\n\nProfessor Twomey said caretaker conventions did not outline specific requirements for adequate consultation, rather that was \"a matter for the relevant parties to decide\".\n\n\"Telling someone something an hour before you publicise it does seem to be perfunctory in terms of genuine consultation,\" she said.\n\n\"As a general principle, that would be something that you would think would not be adequate consultation.\n\n\"But, again, these are not binding rules. They're just conventions and it's a matter for the political parties to decide how they want to interpret them.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/tadej-pogacar-wins-fourth-tour-de-france/105580146",
        "title": "Burnout concerns Pogačar as history beckons after fourth Tour de France win",
        "publish_date": "Sun, 27 Jul 2025 23:36:20 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tadej Pogačar appears on the verge of emulating cycling great Eddy Merckx after his fourth Tour de France win, but the Slovenian says he is in no rush to chase history, warning that the risk of burnout looms large in one of the most mentally and physically demanding sports.\n\nThe 26-year-old sealed his fourth Tour de France title after three more weeks of dominance, but admitted fatigue crept in during the final days.\n\n\"We were comfortably in the yellow, but yeah, I was a bit tired in the last week, to be honest,\" Pogačar told a press conference, adding he wanted to enjoy the moment in Paris rather than dissect mistakes.\n\nWhile his achievements have already placed him among the all-time greats in the race's 122-year history, Pogačar said cycling's relentless calendar and obsession with training create a dangerous cycle that could leave riders drained.\n\nMultiple Tour de France titles 5 — Jacques Anquetil, Eddy Merckx, Bernard Hinault, Miguel Induráin\n\n— Jacques Anquetil, Eddy Merckx, Bernard Hinault, Miguel Induráin 4 — Chris Froome, Tadej Pogačar\n\n— Chris Froome, Tadej Pogačar 3 — Philippe Thys, Louison Bobet, Greg LeMond\n\n— Philippe Thys, Louison Bobet, Greg LeMond 2 — 13 riders\n\n\"Burnouts happen in sports, in a lot of sports, mental burnout, physical burnout. We train a lot. Cyclists are sometimes too obsessed with training, and everybody wants to train more and more and more,\" he said.\n\nThe world champion warned over-training combined with constant racing demands could trap riders in a cycle of fatigue that rarely allowed time for recovery.\n\n\"You see some riders have fatigue too early in the season and then the team needs you to race, race, race. In the end, you just keep going into this circle and you never recover,\" the UAE Emirates-XRG rider said.\n\n\"Then you come to October and you're like, finally a break. And then in December, you're trying to do it all over again.\"\n\nFor Pogačar, that risk is why he refuses to set lofty targets such as joining Merckx, Miguel Induráin, Jacques Anquetil and Bernard Hinault with five Tour titles.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Obviously it's not the goal to win five tours. Right now, I have no clear goals. Maybe the world championships this year and [the Tour of] Lombardy, but for now I just enjoy the moment and will think about the next goals quite soon,\" he said.\n\nPogačar also credited rival Jonas Vingegaard, saying their five-year duel was a privilege and pushed both \"to the next level\".\n\nIt is the first time two riders finish first and second in five consecutive Tours, Vingegaard having beaten Pogačar in 2022 and 2023 while the Slovenian edged his rival out this year, in 2021 and 2024.\n\nAfter three gruelling weeks, Pogačar savoured the relaxed final stage in Paris.\n\n\"Today was pure racing and I enjoyed it quite a bit,\" he said with a smile.\n\nBen O'Connor was the best-placed Australian, finishing 11th, 34 minutes and 34 seconds behind Pogačar.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/bedford-industries-workers-relieved-at-financial-lifeline/105052514",
        "title": "'Weight falls off' families as lifeline thrown to disability service",
        "publish_date": "Sun, 27 Jul 2025 23:01:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "David Stevens has been working at Bedford Industries for almost two decades, but in the past few days, he has felt uncertain about his future.\n\nEvery Monday to Thursday, he packages boxes for companies such as Doritos and San Remo.\n\n\"I love it,\" he said.\n\n\"It's really good just to do hands-on jobs, and it's really interesting just to do different multiple jobs for different companies.\"\n\nAsked what his favourite part of going to work was, Mr Stevens said: \"It's just chatting to all my colleagues and having a talk to them about a couple of things … talking about what's our plans coming up for the weekend and that.\"\n\nBedford's Balyana houses 40 people in supported accommodation. (ABC News: Trent Murphy)\n\nThat was all thrown into jeopardy on Thursday, when Bedford revealed that it was on the verge of entering administration due to cash flow issues.\n\nThe state government stepped in on Sunday with a $15 million loan to \"stave off\" administration, at least temporarily, so the disability employment organisation could get back on its feet.\n\nMr Stevens said he was \"shocked [and] disappointed\" when he heard that Bedford was in trouble.\n\n\"It was really nerve-racking because you thought you were going to lose your job on the spot,\" he said.\n\n\"We were all heartbroken and shocked.\"\n\nHis father Wayne Stevens said the work gave his son daily structure.\n\n\"It has been something for him to go to on a daily basis, and to me, going to a job in a normal sense is more than just money, it's also giving you a purpose,\" Wayne Stevens said.\n\nDavid Stevens (left) and his father Wayne were worried about Bedford's future. (ABC News)\n\nWayne Stevens said he would be concerned for his son and other employees if Bedford was to close.\n\n\"David was really concerned and when we found out … [Sunday] morning, David felt so relieved, like a weight had fallen off him that he knows that his job is more stable than what it was a couple days ago,\" he said.\n\n\"Knowing that David can still go tomorrow [Monday], still enjoy the friendship of his friends, work there for four days a week — that has taken a lot off my mind.\"\n\nLoan is conditional, government says\n\nIt is understood Bedford employs more than 800 staff and supports 1,400 people living with a disability at more than 22 sites across South Australia.\n\nBedford's chief executive officer, Myron Mann, has resigned but its chair Janet Miller, who offered to step down, remained in her role.\n\nIn exchange for the $15 million rescue package, the state government will take ownership of Bedford's supported accommodation site Balyana, in Clapham.\n\nBedford's financial status leaves families 'shocked' Photo shows Two men standing in front of a wall of pot plants Families are hoping disability employment provider Bedford Group can be saved to protect the jobs and livelihoods of more than 1,000 South Australian workers who rely on its service.\n\nSA Premier Peter Malinauskas said Bedford's financial position was so \"dire\" that without a loan, the organisation would inevitably lead to liquidation \"by the end of this week if not sooner\".\n\n\"Does anyone seriously think we should sit on our hands and let this hit the fans, and 1,400-1,500 people have their worlds turned upside who were really vulnerable? I just wasn't going to let that happen,\" he said.\n\n\"Jurisdiction responsibilities become a second order of consideration than just doing the right thing.\"\n\nHe told ABC Radio Adelaide advisory firm McGrathNicol had been appointed to work with Bedford on a restructure and \"stem the losses\" in excess of $1 million per month.\n\n\"If that can happen, maybe there is future for Bedford to stand on its own two feet,\" he said.\n\nPremier Peter Malinauskas and Bedford chair Janet Miller announced the loan on Sunday (ABC News: Trent Murphy)\n\nMr Malinauskas said the loan helped saved the Balyana facility, which houses 40 residents but was \"essentially at end of life or fast approaching them\".\n\n\"By us purchasing it, we achieved two things; one we protected the taxpayers' interests as part of this rescue package because it now [has] an asset,\" he said.\n\n\"The second thing is it allows for more thoughtful and compassionate planning around those supported accommodation residents on that facility and a plan for a transition into the future rather than just a overnight liquidation set of circumstances.\"\n\nTreasurer Stephen Mullighan said on Sunday the loan and the transfer of ownership of the Balyana site were \"a good way to structure this support, rather than just providing a cash grant with no recourse for the taxpayers in the future\".\n\nHe added that there would be conditions imposed on how the loan was spent.\n\n\"It won't be a single deposit tomorrow of $15 million and then Bedford has free and unfettered access to it,\" he said.\n\nMartin Mcdermott was glad he can continue to work at Bedford. (ABC News)\n\nFor now, staff working at Bedford's Panorama location are happy to continue going to work.\n\nLauren Cunningham was overjoyed at the news of staying.\n\n\"It's such amazing news I want to thank Peter so much for stepping in to save us from this, fingers crossed Canberra does the same for us too,\" she said.\n\n\"It means the world to me this place, it helps a lot of people with disability here.\n\n\"I love seeing my friends here, and I love helping people out, especially making food.\"\n\nMartin McDermott said he was \"still getting over the shock of it all\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/dog-attack-kills-guardian-llama-near-geraldton/105564978",
        "title": "Dog-attack death of beloved llama sparks call to beef up rangers' powers",
        "publish_date": "Sun, 27 Jul 2025 22:55:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "After spending more than 20 years loyally guarding a flock of about 150 sheep, Larry the llama met a gruesome end in the jaws of one or more roaming dogs.\n\nWARNING: This article contains an image that some readers might find distressing.\n\nOn the day Larry was mauled to death, his owner, Laura Elson, found four dogs running amok on her hobby farm, east of Geraldton.\n\nBut the dogs were not wild — they were domestic pets, and at least three had registered owners.\n\nOn the day of the attack last month, Ms Elson first realised something was wrong when she caught a pair of border collies on her farm.\n\nShe called City of Greater Geraldton rangers and, accompanied by one, went to check on her flock.\n\n\"We found a freshly dead lamb and a limping ewe,\" Ms Elson said.\n\nPaw prints in the sand where Larry the llama was found dead. (Supplied: Laura Elson)\n\nShortly after the rangers left with the border collies, Ms Elson went back to the paddock for a more thorough check, which is when she found a third dog.\n\n\"I loaded that one up, then I located a fourth dog … loaded that one up, and then I called the rangers back again to come and collect the other two dogs,\" she said.\n\nIt was then that she noticed one had blood on its fur.\n\nThe ranger accompanied her to Larry's paddock, where they found him deceased.\n\nA devastated Ms Elson said llamas only lived to between 15 and 20 years, but Larry \"was a bit of a record breaker\".\n\nInitially bought in a pair, her beloved pet had outlived his paddock mate, who died of old age.\n\n\"Larry was quite content, as long as he had sheep company, to keep on doing his job by himself,\" she said.\n\nLarry the llama was found deceased in his paddock with bite marks. (Supplied: Laura Elson)\n\nLack of prosecution 'ridiculous'\n\nThree of the dogs were returned by rangers to their owners, while one has not been claimed.\n\nThe owners who could be identified were issued with fines for not containing their pets or failing to ensure they had collars, with the penalties averaging about $500 for each owner.\n\nMs Elson is angry that no one has been held responsible for the attack on Larry or her livestock.\n\n\"Unfortunately, the rangers said that they can't prosecute,\" Ms Elson said.\n\n\"It would be passed out in court as beyond reasonable doubt because I didn't visually see the dogs attacking him.\"\n\nMs Elson said rangers should have more power to declare dogs as dangerous.\n\n\"I think it's ridiculous,\" she said.\n\n\" I find four dogs and a freshly dead llama and freshly dead lamb, and yet that's not enough evidence for the dogs to be held accountable or their owners, even more so, to be held accountable. \"\n\nRangers 'distressed' over cases\n\nCity of Greater Geraldton ranger coordinator Mark Lambert said they still considered the case to be \"open\".\n\nHowever, prosecution was difficult in situations such as these because court cases had to meet criminal standards of proof, he said.\n\n\"We work within the legislation of the Dog Act of 1976,\" he said.\n\n\"That puts us into a criminal framework and any potential prosecutions, in a Magistrate's Court.\n\n\"We have to operate under evidence rules, and that evidence that we have to provide needs to prove things beyond a reasonable doubt.\"\n\nLarry the llama had outlived his pack mate but was content with the company of sheep. (Supplied: Laura Elson)\n\nMr Lambert said such attacks were upsetting for his team, particularly when they could not resolve a case.\n\n\"A lot of the rangers are animal lovers, and that's why they do this job,\" he said.\n\n\"They do get very distressed when they cannot provide the level of service that they want to provide and cannot bring a positive resolution to an incident, particularly with the dog attacks when we've got stock that are being killed or badly injured.\"\n\nMr Lambert said the city averaged about 15 reports a month of attacks on people, pets or livestock, most of which could be prevented.\n\n\"It really is a big call-out to our community to please check your fencing, make sure that it's good, that it can contain your dog appropriately,\" he said.\n\n\"Keep keep your gates closed. Make sure you know where your dog is. Make sure it's contained, and we can really make a big impact on these dog attack figures.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/coastal-growth-causing-town-planning-headaches/105467960",
        "title": "Coastal growth sees house prices soar and town planning issues mount",
        "publish_date": "Sun, 27 Jul 2025 22:01:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "An influx of people wanting to move to Queensland coastal regions is driving house prices to record highs and causing town planning headaches for local councils.\n\nIn the once-sleepy seaside community of Yeppoon on the Capricorn Coast, the population is continuing to thrive post COVID-19.\n\nYeppoon is forecast to increase from about 40,000 residents in 2021 to 63,000 by 2046, which is above the state average, according to Queensland government population projections.\n\nPattie and Harry Catzikiris moved from New South Wales this month and bought their home without physically inspecting the property.\n\n\"Any that we did like were sold, under contract or under offer,\" Ms Catzikiris said.\n\n\" Our daughter-in-law took photos and videos and said she liked it, so we put an offer in and within half an hour we had bought it. \"\n\nPattie and Harry Catzikiris moved from Tweed Heads to be closer to family. (ABC News: Ellie Willcox)\n\nThe retired couple had been househunting for 12 months before buying a three-bedroom, two-bathroom property close to town for $810,000.\n\n\"[Tweed Heads] is very busy. Coming up here, it's so much quieter,\" Mr Catzikiris said.\n\n\"We moved for family reasons, mainly to be close to our little granddaughter and our son and his wife.\"\n\nYeppoon's annual median house price has risen 12 per cent to $680,000. (ABC News: Ellie Willcox)\n\nRare planning powers\n\nYeppoon's annual median house price has risen 12 per cent to $680,000 according to the Real Estate Institute of Queensland's most recent quarterly data from March.\n\nLivingstone Shire Mayor Adam Belot described the demand for housing as \"unprecedented\" and the catalyst for the council to urgently override its outdated planning scheme to rezone land from rural to residential.\n\n\"It's beyond what I've ever seen in 30 years,\" Cr Belot said.\n\n\"Buying a block of land on average is a bit over $300,000, and by the time you put a house on that you're upwards of up to $900,000, so that's a real challenge.\"\n\nWith permission from the state government, the council adopted rare planning powers to rezone key rural land to residential in a bid to unlock space for thousands of new homes over the next decade.\n\n\"Otherwise, the alternative is to constrain land supplies and potentially end up like Byron Bay, where movie stars can afford to live but the average local person here would be getting priced out of the market,\" Cr Belot said.\n\nAdam Belot says the demand for housing on the Capricorn Coast is unprecedented. (Supplied: Livingstone Shire Council)\n\nPlanning teams under pressure\n\nLocal government planning teams are struggling to keep up with a surge in development applications.\n\nCr Belot said attracting skilled workers was a constant battle.\n\n\"Over the past two to three years, that's put enormous strain on our planning department, in fact, on our entire executive leadership team from planning through to engineering,\" he said.\n\n\"It's one thing to say, 'Hey, come to the Capricorn Coast, it's a great place to live', but if you don't have a home to move into, then you're not going to attract those professionals.\"\n\nAt neighbouring Rockhampton Regional Council, there has been a temporary pause on accepting building applications between May and July, although people can still engage a private certifier if they want to proceed.\n\nA spokesperson said \"resourcing constraints\" was the cause for the freeze.\n\nRockhampton Regional Council has put a temporary pause on accepting building applications. (ABC News: Ellie Willcox)\n\n'Significant' court appeals\n\nFurther south, in the popular coastal towns of Agnes Water and Seventeen-Seventy, there are calls for the local council to cut red tape and approve more housing developments.\n\nPrivate town planner Stephen Enders, who leads the recently formed Gladstone Agnes Water Development Group, said he was concerned about the number of appeals lodged against the Gladstone Regional Council in the Planning and Environment Court.\n\nA new pro-development group wants to see more housing approved in Gladstone and Agnes Water. (ABC News: Ellie Willcox)\n\n\"At the last count it's in the order of about 19 [appeals] in the past three years, which is quite significant in my view,\" Mr Enders said.\n\n\"I think that's a representation of the difficulty in getting approvals through council, and developers are choosing to go to court.\"\n\nMr Enders said the council could be too reactive at times.\n\nStephen Enders is concerned about the number of appeals against Gladstone Regional Council. (Supplied: Stephen Enders)\n\n\"It's a mixed community; some want development and some don't. All those things contribute to it being difficult to get approvals,\" he said.\n\n\"Part of the reason for this group being set up is to actually have a voice for the industry in response to some of those other community groups, particularly in the Agnes area that oppose development down there.\"\n\nGladstone Regional Council has been contacted for comment.\n\nThe Queensland government has opened public consultation on a single statewide housing code to standardise planning rules for local governments.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/england-india-test-ends-in-draw-after-centuries-pitch/105579942",
        "title": "'Farcical': England angered by India batter getting first Test ton in draw",
        "publish_date": "Sun, 27 Jul 2025 21:57:29 +0000",
        "category": "sports",
        "authors": [],
        "text": "India has batted out a draw in the fourth Test against England to keep the series alive, but even on a dead pitch at Old Trafford there was still time for fireworks.\n\nLed once again by captain Shubman Gill's 103, the tourists showed great character to secure a hard-fought draw in another run-fest of a Test.\n\nRavindra Jadeja and Washington Sundar also tonned up on day five, much to the chagrin of English players after they offered to shake hands on a draw with both players in the 80s.\n\nEngland captain Ben Stokes was clearly upset by India's refusal to accept the draw despite having no shot at victory, and fielders could be heard on stump microphones swearing at the batters as they told them to hurry up while 25-year-old Sundar worked his way to his maiden Test century.\n\nAfter losing two wickets before they had scored a run in their second innings, India batted for over five sessions for the loss of two more wickets to end the final day on 4-425.\n\nEngland's dig of 669 had given them a 311-run first-innings lead and a shot at an innings victory with a Test to come, but Gill's courageous hundred — his fourth of the series — and 90 off 230 by KL Rahul set up the series-saving draw.\n\nGill and Rahul, the leading run-scorers for the series with 722 and 511 respectively, fell in the first session on day five, but Jadeja and Sundar picked up the mantle with a 203-run unbeaten stand to see India home with England bowling part-timers Joe Root and Harry Brook.\n\n\"Would they have walked off if someone from England was batting on 90 or 85 and someone has the opportunity to get his first Test hundred?\" India coach Gautam Gambhir said.\n\n\"Would you allow him to do it? It's up to them, if they want to play that way, that's up to them. I think both those guys deserved a hundred and fortunately they got it.\"\n\nEngland offered to shake hands on a draw with both batters in the 80s, but India let them get their tons. (Getty Images: Stu Forster)\n\nPlayer of the match Stokes, who took five wickets in India's first innings and scored 141, said the job was done by Jadeja and Sundar after a \"massive\" partnership whether they reached their tons or not.\n\n\"I don't think there would've been too much more satisfaction from walking off 100 not out, getting your team out of a tricky situation, than walking off at 80 or 90 not out,\" he said.\n\nFormer England quick Steve Harmison said he did not think anyone crossed the line and both batters deserved their chance to reach their milestones.\n\n\"It was a little bit farcical towards the end,\" he told ESPN.\n\n\"I think Ben Stokes said to both batters 'do you really want to get a hundred while Harry Brook is bowling?' I think that was tongue in cheek.\"\n\nUltimately the match rolled on for a few more overs, with the handshakes inevitably coming after Sundar reached his first Test century on a languid day-five pitch.\n\n\"[England] dominated this Test match, but [have] to admit that the wicket won at the end of the day,\" former England captain Alastair Cook said on BBC.\n\n\"We don't want wickets like this, we want them to deteriorate and wickets like this make batting look very easy on day five — we want jeopardy either towards the end or at the start.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"The pitches have been so different from what you usually expect when you come to England because you'd expect lateral movement and there was nothing on this pitch.\"\n\nOne of Cook's predecessors, Michael Vaughan, agreed saying there was \"nothing\" in the pitch for the bowlers.\n\n\"They didn't get anything out of the pitch and it was glaring,\" he said.\n\n\"The frustration will be for England not getting any wickets. The pitch had no lateral movements, there was nothing and it was difficult to get 20 wickets on this pitch.\"\n\nA closely fought series remains at 2-1 to England and the hosts must avoid defeat in the final Test at the Oval in London, starting on Thursday, to win it.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nABC/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/asx-markets-business-news-live-updates-july-28/105578954",
        "title": "Live: US and EU seal trade deal, Wall St has fifth record close, ASX lifts",
        "publish_date": "Sun, 27 Jul 2025 21:25:15 +0000",
        "category": "finance",
        "authors": [
            "Stephen Letts",
            "Daniel Ziffer"
        ],
        "text": "Wall Street's S & P 500 completed a \"clean sweep\" of record closes last week, gaining another 0.4% on Friday.\n\nThe tech-centric Nasdaq (+0.2%) also closed at a record high, while the blue-chip Dow (+0.5%) was not far off a record either.\n\nThe response to the giddy US buying looks a bit muted on the ASX — futures trading point to a marginal 0.1% dip on opening this morning.\n\nThe US rally has been fuelled by positive quarterly earnings reports, trade deals with Japan and the Philippines, and expectations of more trade deals to come ahead of Friday's tariff \"deadline\".\n\nThe market closed ahead of the meeting between US President Donald Trump and EU President Ursula von der Leyen in Scotland on Sunday where the final details of the trade deal was nutted out.\n\nMost European markets slipped on Friday, with Germany's Dax down 0.3% and the Eurostoxx 50 down 0.1%.\n\n\"The market has been anticipating that the deals are going to get done,\" GLOBALT's Senior Portfolio Manager Thomas Martin told Reuters at Wall Street's close. \"Personally, I have a bit more scepticism. You've got to be careful, because if they don't get done, there is more room for disappointment than there is upside.\"\n\nThe US dollar gained as traders firmed in their view that the Fed will take its time in resuming interest rate cuts, however slipped once the trade deal was announced this morning.\n\nThat saw the Aussie dollar edge higher heading towards 67 US cents this morning.\n\nOn commodity markets, oils slid to a 3-week low on speculation of weaker economic growth in both the US and China, as well as evidence of growing supply.\n\nThe global benchmark Brent crude fell 1.1% to $US68.44/barrel while the US standard, West Texas Intermediate crude dropped 1.3% to $US65.16/barrel.\n\nThe stronger US dollar and prospects of more trade deals eroded gold's \"safe haven\" premium a tad — the spot price slipped 1.0% to $US3,336/ounce.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/perth-elephant-departure-delay/105564266",
        "title": "'On elephant time': Move of Perth Zoo's last elephant to SA delayed",
        "publish_date": "Sun, 27 Jul 2025 21:18:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "The scheduled move of Perth Zoo's last elephant to South Australia has been delayed, as its new home Monarto Safari Park works to integrate the four females that arrived earlier this year.\n\nThe zoo had planned for male elephant Putra Mas to leave in June or July, but the Asian elephant will remain in Perth until later in the year.\n\n\"[Monarto] is still managing the introductions of the females,\" Perth Zoo's Acting Director of Life Sciences John Lemon said.\n\nPermai after being loaded into her crate before her long trip to South Australia in January 2025. (Supplied: Perth Zoo)\n\n\"They are still undertaking fence-line contact and trying to get those four animals to be a working herd, or at least share the same habitat.\"\n\nPerth Zoo farewelled its female elephant Permai in January, who joined Burma from Auckland Zoo at Monarto.\n\nTwo other females moved from Taronga Zoo shortly after.\n\nPutra Mas was expected to follow after going through must — a periodic, hormonal condition which can result in aggressive behaviour.\n\nPermai the elephant travelled by truck to South Australia. (ABC News: Tom Wildie )\n\nDelayed works on the habitat required before Putra Mas arrives is contributing to the postponement, though Mr Lemon is confident the male will be in South Australia by the end of the year.\n\n\"We're just on elephant time,\" he said.\n\n\"There's still the introductions, they won't hold us up, if they're not together we'll still look at moving our boy, but there is also some facility works that need to be finished.\n\n\"[Putra Mas] has progressed really well with his crate training here. The bespoke crate's been finished for some time, so it's ready to roll.\n\n\"So it's just waiting for all of those things to come together and we'll set a date and move.\"\n\nMr Lemon predicts Putra Mas will be transported within the next five months. (ABC News: Zathia Bazeer)\n\nRhino change of plans\n\nPerth Zoo was expecting to add two southern white rhinos this year, but health concerns over the incoming pair means that plan isn't going ahead.\n\n\"The female rhinos that were being considered for transfer to Perth Zoo have had a couple of unexpected health issues,\" Mr Lemon said.\n\n\"They are no longer suitable for road or flight transport. From a health point of view they need to stay at Werribee's Open Range Zoo.\"\n\nThe arrival of the rhinos was to coincide with the departure of male Bakari who was slated to be part of the regional breeding program.\n\nPerth Zoo won't be getting two new rhinos, but will press ahead with a redevelopment of the African Savanna exhibit. (Supplied: Perth Zoo)\n\nHe'll instead remain in Perth while other breeding options are explored.\n\n\"There is quite a lot of science that goes into...what his genetics can contribute to the regional program, so we need to look what are the best options for him moving forward,\" Mr Lemon said.\n\nDespite the delayed move for Putra Mas, plans for a 30-million dollar upgrade to the African Savanna were going ahead.\n\n\"We still have grand plans for that, but (the delayed move) is not holding it up at all and won't affect the timing of that,\" Mr Lemon said.\n\nThe zoo has undergone extensive construction in recent years, with a new gibbon enclosure recently opened to patrons.\n\nLoading...\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/gang-gang-cockatoos-frozen-wings-and-tails-victorian-alps/105568878",
        "title": "Endangered cockatoos frozen, trapped by cold snap in Victorian Alps",
        "publish_date": "Sun, 27 Jul 2025 21:08:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Skiers and holiday-makers are enjoying one of the strongest season openings for years as thick snow blankets the Victorian Alps.\n\nBut gang-gang cockatoos, who usually prefer cool temperatures, are at risk of dying in the freezing conditions.\n\nThe endangered birds are being found grounded in the snow, weak and disoriented, suffering from hypothermia.\n\nOne of more than 10 gang-gang cockatoos rescued at Falls Creek so far this winter. (Supplied: Jo Mitlehner)\n\nDeb Howie, who has been rescuing stricken birds at Falls Creek, said the \"cold and windy\" conditions were taking a toll.\n\n\"This winter has been so brutal … we're finding that there are quite a few gang-gangs that are actually struggling,\" she said.\n\n\"They're grounded on the snow, and they don't really move.\n\n\" Their wings are frozen and their tails are frozen, so they can't fly away. They're obviously in distress. \"\n\nGang-gang cockatoos were officially listed as endangered in 2022. (Supplied: Jo Mitlehner)\n\nFalls Creek visitors have been advised to carry cloth bags or pillowcases while walking, so they can gently capture any grounded birds and keep them warm while waiting for help.\n\nMs Howie said of the 10 gang-gangs she had rescued so far, most were juveniles.\n\n\" They get picked up, put in a box or wrapped in a towel …and we get them off the hill. \"\n\nCouples reunited\n\nWildlife carer Jo Mitlehner has also been involved in the rescue efforts and said it was crucial to reunite separated mates, as gang-gangs pair for life.\n\nGang-gang cockatoos have been found grounded, with their wings and tails frozen. (Supplied: Jo Mitlehner)\n\nAt the start of the snow season, she rescued a mature female gang-gang that had been separated from her partner.\n\n\"We found her crawling in the snow at Falls Creek,\" she said.\n\nThe male gang-gangs have a bright red head and crest, while the females are dark grey. (Audience submitted: Andrew Garrett)\n\nMs Mitlehner said as soon as the female was well enough, she was returned to where she had been found because the gang-gangs were preparing to leave the area.\n\n\"We needed to get her straight back before her mate travelled out of the area,\" she said.\n\nOn release, another carer believed he heard a nearby gang-gang responding to her call.\n\nChanging conditions\n\nMs Mitlehner said the birds were not usually found at such high altitudes in winter.\n\nWhile not strictly migratory, they often move from mountain forests to lower elevations during colder months.\n\nMs Mitlehner said she and her team thought a longer summer might have allowed for a second breeding season, leaving more juveniles unprepared for the cold snap.\n\nSean Dooley from Birdlife Australia, the nation's largest bird conservation charity. (Supplied: Sean Dooley)\n\nSean Dooley from BirdLife Australia said shifting climate patterns could be a factor in why the birds had not moved down the mountains.\n\n\"It could be related to the fact that over the past decade or so, we have had much milder winters, and perhaps the gang-gangs have started to adapt to this shift in climate and not been moving as far,\" he said.\n\n\" So when we get an old-fashioned winter blast, some birds are being caught out. \"\n\nEndangered and at risk\n\nAccording to the latest data, gang-gang populations have already suffered a sharp decline — a drop of nearly 70 per cent between 1999 and 2019.\n\nThe 2019–2020 bushfires caused further devastation.\n\nGang-gang added to threatened list Photo shows Two gang-gang cockatoos in a tree. The gang-gang cockatoo will be added to the threatened species list after climate change and bushfires impact populations.\n\nIn 2022, the parrot was officially listed as endangered, with an estimated 25,300 mature birds remaining in the wild.\n\n\"Experts say the likely reason for the decline in gang-gangs has been the destruction of the big old, hollow-bearing trees that they nest in up in mountainous areas, from native-forest logging,\" Mr Dooley said.\n\n\" With fewer gang-gangs around, events like the recent cold snap will have a greater impact on the overall population. \"\n\nCold blast not over yet\n\nA Bureau of Meteorology spokesperson confirmed that much of Victoria had endured below-average minimum temperatures for June.\n\nThe snow dump has arrived just in time for the Victorian and New South Wales winter school holidays. (Supplied: Vail Resorts.)\n\nAnd while there is still cold weather ahead in the short term, the bureau's forecast for August to October is for warmer-than-average temperatures.\n\nUntil then, Falls Creek head of visitor experience David Leathem urged snow-goers to keep an eye out for \"vulnerable species, particularly the endangered gang-gang cockatoo\".\n\n\"Immediate action can make all the difference,\" he said.\n\n\"We encourage residents and visitors to stay alert and contact local wildlife carers for assistance and advice.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/plane-hits-tug-vehicle-at-melbourne-airport/105579874",
        "title": "Virgin plane collides with tug vehicle at Melbourne Airport",
        "publish_date": "Sun, 27 Jul 2025 20:56:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "A Virgin Australia plane has collided with a tug vehicle at Melbourne's Tullamarine airport.\n\nThe aircraft disconnected and hit the tug from the side at about 8:40pm on Sunday while it was being towed to the hangar for scheduled maintenance.\n\nA Melbourne Airport spokesperson said no passengers were on board and no ground staff were injured.\n\nThe plane impacted was a Boeing 737, typically used on Virgin's domestic routes.\n\nFootage showed the jet cracked along the front left side, with workers taping up the damage.\n\nVirgin Australia said it did not expect any disruptions to scheduled flights on Monday.\n\nThe Transport Workers Union (TWU) said the incident spoke to a wider \"crisis\" in Australia's aviation industry.\n\n\"We're seeking an urgent briefing now with Virgin to discuss how these incidents can be avoided in future — and in the meantime calling on all participants in aviation to work towards a better industry,\" TWU National Secretary Michael Kaine said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-28/england-win-womens-euro-final-spain-chloe-kelly-penalty-shootout/105579886",
        "title": "'Not human': England defender plays entire tournament on broken leg",
        "publish_date": "Sun, 27 Jul 2025 20:50:41 +0000",
        "category": "sports",
        "authors": [],
        "text": "England defender Lucy Bronze says she has played the entire European Championships tournament with a broken tibia.\n\nThe Lionesses beat Spain 3-1 in a penalty shootout to win Euro 2025 and defend its title after an enthralling game that ended 1-1 after extra time in Basel, with Chloe Kelly firing home the decisive spot kick.\n\nBut after the match, 33-year-old Chelsea fullback Bronze disclosed she had been playing through considerable pain.\n\n\"I actually played the whole tournament with a fractured tibia, but no-one knew,\" Bronze told the BBC, with coach Sarina Wiegman confirming her star right back's plight.\n\n\"That is why I got a lot of praise from the girls after the Sweden game because I have been in a lot of pain.\n\n\"But if that's what it takes to play for England, that's what I'll do. They know that. We inspire each other by playing through things like that and it got us to the end, in the end.\"\n\nBronze, England's most decorated player and, with 140 caps one of its most experienced, played 598 minutes throughout the tournament, the fourth most minutes of any England player.\n\nShe even scored in the quarterfinal victory over Sweden that sent the game to extra time.\n\n\"She had some issues with her tibia so of course we tried to manage that,\" Weigman said.\n\n\"When you play 120 minutes you're not managing it, are you?\n\n\"The whole team has a great mentality but she has a crazy mentality. It's unbelievable.\"\n\nThe BBC pundits were aghast at the lengths Bronze went to in order to play, describing her efforts as \"not normal\".\n\n\"I mean this in the nicest way but she is not human,\" Ellen White told the BBC.\n\n\"I love her and adore her, but she is proper England.\n\n\"To say she has just won a major tournament on a fractured tibia, that is not normal. That pain must have been insane.\"\n\nKelly the hero as England fights back again\n\nChloe Kelly was once again the hero for England. (Getty Images: James Gill/Danehouse)\n\nEngland's victory was another spectacular turnaround from Sarina Wiegman's side, which came back from two goals down to beat Sweden in a shootout in the last eight and beat Italy in the semifinals with another extra-time goal from Kelly.\n\nWorld and Nations League champions Spain made the breakthrough in the 25th minute as Ona Batlle crossed and caught the England defence flat-footed, allowing Mariona Caldentey to head the ball past goalkeeper Hannah Hampton.\n\nIt put Spain in a position to emulate its 1-0 win over England in the 2023 World Cup final, but Kelly's introduction proved a turning point.\n\nWith Lauren James suffering an ankle injury, England was struggling, but Kelly came off the bench to replace her just before the break.\n\nKelly, the extra-time hero from England's 2022 final win over Germany, helped close down England's porous left flank and provided the cross for Alessia Russo to level in the 57th minute, the forward heading home her inch-perfect assist.\n\nSpain continued to monopolise the ball but could not find another goal before the end of normal time, and the story continued through extra time as they pressed and probed, but could not break the English defence as the game finished 1-1.\n\nThe Spaniards got the shootout off to a great start when Cata Coll stopped Beth Mead's effort — controversially retaken after she initially scored but was called to retake due to a double touch — but England keeper and player of the final Hannah Hampton saved from Caldentey and from Aitana Bonmati to put England in the driving seat.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nColl got Spain back into it with another one-handed stop to block Leah Williamson, but Spain substitute Salma Paralluelo hit her kick wide of the target.\n\nThat set the stage for Kelly to repeat her 2022 heroics, making her trademark prancing run-up before smashing the ball into the net and peeling away in ecstasy to celebrate with her teammates in front of the England fans.\n\n\"I'm so proud, so proud of this team, so grateful to wear this badge, and I'm so proud to be English … I was cool, I was composed and I knew I was going to hit the back of the net,\" Kelly said.\n\nThe final was the first time since the inaugural edition in 1984, in which England were beaten by Sweden, that the tournament was decided by a penalty shootout.\n\nFor player of the tournament Bonmati, the defeat was bitter.\n\n\"I don't have much emotion left to be honest. I have emptied myself of emotion. We are all exhausted,\" she said.\n\n\"I have to say sorry, because it was my fault in the end, but I was not able to score it [the penalty]. Congratulations to our opponents.\n\n\"In my opinion we were superior in the match, [but] on some occasions, that's not enough in football.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nReuters/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/souths-fume-at-wighton-ban-for-head-clash-as-stars-now-sidelined-for-200-matches-20250727-p5mi2e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Souths to fight Wighton’s ‘head clash’ ban as stars now sidelined for 200 matches",
        "publish_date": "Mon, 28 Jul 2025 12:07:43 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Robert Dillon",
            "Adrian Proszenko"
        ],
        "text": "South Sydney will risk a four-match ban by challenging Jack Wighton’s hit on Cronulla’s Toby Rudolf at the NRL judiciary, with the club privately arguing his contact was little more than a head clash.\n\nWighton was served a grade 2 dangerous contact charge on Sunday for the shot that saw him sin-binned in Saturday night’s loss to the Sharks.\n\nThe veteran five-eighth will challenge his suspension on Tuesday night having sought legal counsel from judiciary regular Nick Ghabar.\n\nWighton’s proposed suspension is exacerbated by a 2023 hit on Jackson Hastings counting as a similar previous incident.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/family-beats-10-others-to-3-3m-designer-semi-after-six-month-search-20250728-p5mi95.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Family beats 10 others to $3.3m designer semi after six-month search",
        "publish_date": "Mon, 28 Jul 2025 12:05:57 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A family paid $3,388,000 for a luxurious five-bedroom semi in Burwood at auction on Saturday, beating 10 other registered bidders and ending a six-month search.\n\nThe turnkey designer duplex at 14 Lindsay Street came with a striking, low-maintenance rock and cactus garden and a price guide of $2.5 million.\n\nThe sleek property has an open-plan living area, and one bedroom with an ensuite on the top floor and four bedrooms and three bathrooms on the ground floor.\n\nBidding opened at $2.5 million, and five parties were active. Bids of $100,000 took the price to $3 million, where it met the reserve.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-s-latest-clumsy-deal-has-unintended-consequences-20250728-p5mi8l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s latest clumsy deal has unintended consequences",
        "publish_date": "Mon, 28 Jul 2025 11:59:06 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Agreeing to buy energy from the US was a no-brainer for the EU and Japan, given their reliance on imported energy. The EU, which ended its purchases of Russian gas after the invasion of Ukraine, now imports about half its LNG from the US. LNG is a commodity traded at global market prices, so there is no financial penalty for the EU in sourcing more gas from the US. Perversely, however, there could be an adverse impact on the US - its increased exports of LNG in recent years have flowed through to higher US domestic gas prices. The deals that may underpin this new global trade order have been hastily and clumsily negotiated, are half-formed and have unintended consequences for American companies, consumers and the US economy. The promise, if there is one, to invest $US600 billion in the US was vague and one whose delivery is beyond the EU’s control. It is individual European companies that would have to decide whether or not to invest. Unlike the deal with Japan, where Trump claimed the Japanese would invest $US550 billion in a fund from which the US would get 90 per cent of the profits, the investment agreement with the EU appears just a broad statement of intent.\n\nTrump and his administration have a tendency to over-egg their accomplishments. The Japanese version of what they have agreed to, for instance, varies significantly from what Trump has described. The Japanese have agreed to provide equity, loans and loan guarantees for investments in the US, but government officials say any profits would be split according to the level of contributions made and that the final degree of profit-sharing would rest with the private sector companies involved and the returns they required. It would appear the Japanese envisage their state agencies mainly facilitating debt funding for US projects, with the decisions on which projects to pursue and the apportionment of profits left to the Japanese and US companies involved. Trump said Japan would invest, “at my discretion,” the $US550 billion but, as is the case with the EU, he can’t force Japanese companies to invest.\n\nIt should be noted that the presentation card on Trump’s desk that outlined the investment agreement originally said Japan would invest $US400 billion, but the “$400B” was crossed out with a marker pen (a Sharpie, perhaps) and altered to $US500 billion. When Trump announced the detail, in a post on Truth Social, it had suddenly become $US550 billion. It is unclear whether the Japanese were consulted on the revisions. What that episode demonstrates is how rushed the trade deals have been as the administration tries to demonstrate that the threat of Trump’s “reciprocal” tariffs has been successful in forcing other countries to accept Trump’s terms before the 90-day delay before those tariffs are imposed expires on August 1. That’s why there are obvious blank pages in the EU and Japanese deals to be filled in before they remotely resemble a fully-detailed trade agreement.\n\nIt’s also why, as is the case with Australia’s recent decision to allow more imports of American processed beef, the outcome of the agreements will depend, not on what Trump decrees or the EU and Japanese trade negotiators have agreed to, but on companies and consumers within the markets that the US says it is opening up. The Japanese won’t buy any meaningful volume of US SUVs and pick-up trucks. There is no market for them in Japan and the American auto companies aren’t going to re-tool in order to produce a few gas-guzzling right-hand drive vehicles. Trump mused that the Europeans would enjoy those SUVs and pick-ups. He doesn’t appreciate that there are significant cultural differences between Europeans and Americans and that it is improbable that the narrow and congested streetscapes in European cities are suddenly going to be littered with over-sized US vehicles. Trump doesn’t appreciate that there are significant cultural differences between Europeans and Americans and that it is improbable that the narrow and congested streetscapes in European cities are suddenly going to be littered with over-sized US vehicles. Credit: iStock The 15 per cent tariff on European auto and auto part exports is, however, a big win for the Europeans, as were the same tariff concessions won by the Japanese.\n\nThe EU and Japanese carmakers don’t face tariffs on their raw materials, like steel and aluminium, or components. Their US counterparts, which are heavily integrated into a North American auto industry, with cars and components flowing across the borders with Mexico and Canada, do. Thanks to Trump, who has imposed 25 per cent duties on imports of steel, aluminium, auto parts and those components of US autos not made within the US, the European and Japanese companies will have a material competitive advantage over America’s own carmakers. The fact that the two key trading partners, both heavily reliant on the auto industry, were able to win such advantages for their companies says that, in its haste to proclaim that Trump’s tariffs threats have produced results, the administration hasn’t looked at the complex ways the deals interact with America’s own industries and their supply chains. It does seem rather bizarre that Trump is using the threat of punitive tariffs to bludgeon other countries into trade deals that gives their key industries what is effectively a tariff advantage over his own. He and his advisers also don’t appear to appreciate that allowing tariff-free imports of products from the US is irrelevant if consumers aren’t going to buy what the US is selling or, as is the case with the 100 Boeing aircraft that Japan agreed to buy, if the US companies can’t deliver what the countries have agreed to buy. Boeing’s current backlog of orders is about 6000 planes, or nearly 17 years of production at the rate at which it delivered planes last year.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/ex-winger-who-was-too-slow-too-big-now-a-key-man-up-front-for-dogs-20250728-p5mi8i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ex-winger who was ‘too slow, too big’ now a key man up front for Dogs",
        "publish_date": "Mon, 28 Jul 2025 11:51:23 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "They say lightning doesn’t strike twice, and the same logic usually applies to front-row forwards scoring two tries in a match.\n\nBut anyone thinking that Sam Hughes’ brace in Canterbury’s 42-4 demolition of Manly on Sunday was a fluke is presumably unaware of his background.\n\nThe towering 24-year-old wasn’t always a prop. In his formative years, he was - in his own words - “a big, tall, lanky winger”, firstly with De La Salle Caringbah, then in the Cronulla and Parramatta junior representative systems.\n\nFor good measure, he also played a bit of fullback in junior rugby union.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/perfect-10-demon-recovers-from-brink-of-defeat-to-win-title-20250728-p5mic4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Perfect 10: Demon recovers from brink of defeat to win title",
        "publish_date": "Mon, 28 Jul 2025 11:49:37 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "He never trailed in the tie-break – but twice handed back mini-break leads – before sealing a victory after three hours and two minutes of tense and absorbing tennis that owed to repeatedly brave shot-making in the toughest moments.\n\nDe Minaur saved three separate championship points in a nerve-jangling, 14-minute service game at 4-5, including a defensive backhand that barely touched the sideline on the third of them.\n\nThe Australian became a 10-time champion on the ATP Tour on Monday (AEST), recovering from 5-2 down in the deciding set of the Washington final to outlast childhood rival Alejandro Davidovich Fokina, 5-7, 6-1, 7-6 (7-3), in another performance packed with mental resilience.\n\nLoading\n\nDe Minaur’s triumph means he is only one career title behind Australian greats Patrick Rafter and Mark Philippoussis. He is also the fifth Australian to win the Washington Open, with Nick Kyrgios the most recent in 2019 and 2022.\n\n“I don’t know [how I did that]. It’s something about this court. I did it in 2018 against [Andrey] Rublev, and honestly, I just kind of knew I could do it,” de Minaur said.\n\n“I just backed myself and told myself to commit, no matter what, and if I lost this match, it was going to be on my terms – and today went my way. I’ve had a couple of brutal ones not go my way, so I’m glad this one [did].\n\n“I’m very happy with where I am at the moment, [and] how I’m dealing with things on and off the court. I had the mindset that even if today didn’t go my way, it was a very positive week, so I was proud of my efforts, no matter what, but, geez, it feels good to hold my 10th title.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/the-opera-lover-the-aromatherapist-and-the-1m-inheritance-fight-20250724-p5mhgl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The opera lover, the aromatherapist and the $1m inheritance fight",
        "publish_date": "Mon, 28 Jul 2025 11:45:00 +1000",
        "category": "entertainment",
        "authors": [
            "Michaela Whitbourn"
        ],
        "text": "It was a costly court fight over the million-dollar estate of an elderly opera aficionado. An aromatherapist who struck up a friendship with the woman stood to inherit everything if she won.\n\nEva Marie Easton died in September 2021, aged 89. The German migrant made a will in November 2020 naming the Sydney Opera House Trust as sole beneficiary. It was her wish that the funds be used for the promotion of performances of German classical music.\n\nA NSW woman’s 2020 will left her $1 million estate to the Sydney Opera House Trust. Credit: Nathan Perri\n\nThe 2020 will superseded a will from 2019, which left everything to her friend Isabelle Agnes Peacock, an aromatherapist she met in 2004 when she started having monthly massages. Easton’s Australian ex-husband had died years earlier, and she was unaware of any other living relatives.\n\nBy about 2009, Easton and Peacock “had developed a good friendship”, Supreme Court Justice James Hmelnitsky said in a decision last year.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/de-minaurs-incredible-save-on-match-point-20250728-p5mic1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "De Minaur's incredible save on match point",
        "publish_date": "Mon, 28 Jul 2025 11:44:14 +1000",
        "category": "sports",
        "authors": [],
        "text": "De Minaur's incredible save on match point\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/more-beauty-than-beast-in-new-production-at-perth-s-crown-theatre-20250728-p5mibi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "More beauty than beast in new production at Perth’s Crown Theatre",
        "publish_date": "Mon, 28 Jul 2025 11:43:59 +1000",
        "category": "entertainment",
        "authors": [
            "Emma Young"
        ],
        "text": "There was more beauty than beast represented in the Perth personalities who adorned the red carpet for Saturday’s Beauty and the Beast premiere at Crown Theatre – and the same could be said for the show.\n\nAt the final opening for a national tour attended so far by 1.2 million Australians, anticipation and nostalgia built right from the prologue voiced by Angela Lansbury (Miss Potts in the original Disney animated feature) and the opening glimpses of a jaw-dropping set that required 23 trucks to get to Perth and a team of 70 to unload them across thousands of hours.\n\nShubshri Kandiah and Brendan Xavier in Disney’s Beauty and The Beast. Credit: Daniel Boud\n\nFaithfulness to the original continued; there is no danger of a modern reimagining in this saccharine-sweet production, which despite the vocal prowess of Belle (Perth-born Shubshri Kandiah) and the Beast (Brendan Xavier) unfortunately is slightly lacking in truly memorable numbers in the context of a 2.5-hour run time.\n\nThe obvious exceptions are of course Be Our Guest, a showstopping number bringing all the production’s technical might including projected backdrops of dancers’ onstage patterns, milked to the max through an extended tap finale with 2400 lights; Belle, which shows off a French provincial town created with 30 tonnes of flying scenery and 50 tonnes of automation and staging; and Beauty and the Beast, simply and touchingly rendered by Jayde Westaby as Mrs Potts.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/a-bro-area-full-of-testosterone-tension-over-the-bondi-beach-gym-crackdown-20250722-p5mgy7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘A bro area full of testosterone’: Tension over the Bondi Beach gym crackdown",
        "publish_date": "Mon, 28 Jul 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "A fitness furore has broken out over a council decision to crack down on the use of dumbbells and weights at Bondi’s beachside gym due to “public safety” concerns and fears the site is attracting too much testosterone.\n\nLong-term users of the Bondi Park Fitness Station want Waverley Council to allow gym gear to be returned to the site after complaints resulted in the removal of the equipment in March.\n\nVirginia Venn, Joey Pamment and Louise Brandon pictured at the outdoor gym at Bondi Beach. Credit: Janie Barrett\n\nRegular gym users say they were left stunned when the free weights were removed in response to concerns the site had become a public liability risk for Waverley Council.\n\nA council report outlining concerns stated the fitness equipment posed safety risks, including potential trip hazards that might expose the council to claims for injuries.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/dummies-for-adults-the-practical-uses-for-grown-up-pacifiers-20250624-p5m9we.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dummies for adults? The practical uses for grown-up pacifiers",
        "publish_date": "Mon, 28 Jul 2025 11:19:15 +1000",
        "category": "lifestyle",
        "authors": [
            "Nell Geraets"
        ],
        "text": "To use or not to use a dummy – it’s a question endlessly debated on parenting blogs and baby forums. Some believe they should never be used, but most frown upon children above the age of two or three sucking on them.\n\nIt’s not just babies using them, though. Despite still being relatively niche, some adults use dummies, most commonly referred to as “soothers”. Some are designed specifically for nighttime, others are bedazzled, but they’re all clearly for adult use.\n\nSoothers or dummies specifically designed for adults can be used for a variety of purposes but dental experts warn against their long-term use. Credit: Aresna Villanueva\n\nIf three is considered “too old” by some to be using a dummy, what does this mean for the adults using them? There are several reasons why older people may use soothers – reasons that are gradually becoming better understood.\n\nAren’t dummies just for babies?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/property/news/once-in-a-lifetime-young-family-pays-1-7m-for-architect-designed-home-20250728-p5mi97.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Once in a lifetime’: Young family pays $1.7m for architect-designed home",
        "publish_date": "Mon, 28 Jul 2025 11:08:58 +1000",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "He said home’s architectural design by Taouk Architects was a major drawcard. “He develops some incredible property, and given its proximity to the train line, it was a once-in-a-lifetime opportunity for someone to buy a Taouk property for under $2 million.” Suckling said the local market was quite busy. “There is definitely some activity in the area, that’s for sure ... Alphington is quite resilient,” he said.\n\nLoading “It is an interesting pocket of Melbourne with a lot of families and more family homes. It is less dense than other areas of the inner north, but you still have access to all the things in the area.” The property was one of 752 scheduled for auction in Melbourne in the past week. By Saturday evening, Domain Group recorded a preliminary auction clearance rate of 75.8 per cent from 557 reported results, while 44 auctions were withdrawn. Withdrawn auctions are counted as unsold properties when calculating the clearance rate. A three-level townhouse in Eltham designed by renowned architect Graeme Gunn sold under the hammer for $1.41 million on Saturday. The home at 2/93 Arthur Street was advertised with a reserve of $1,300,000, which selling agent Tom Kurtschenko from Jellis Craig said “was part of the strategy going into the auction”.\n\nPositioned at the highest point of Eltham, the home is a part of the gated Kinloch Estate, which was established in 2000. The property’s treetop and city views on the upper level, along with its three bedrooms and thoughtfully crafted layout, attracted two active bidders, both local families, to the area. “The two bidders went toe to toe,” Kurtschenko said. “It got a run on, and it was a pretty clean auction and got to where it needed to.”\n\nLoading The successful bidders want to do some improvements to bring the home back to its former glory, Kurtschenko said. “It’s a 25-year-old home, and it’s just showing its age a little bit,” he said. Stock markets in the local market were “very low”, the agent said. “Locally in Eltham and Eltham North, there are 75 homes up for sale, which is well down. It usually trends at around 110 to 130 homes, so it is notably down, so I think that’s putting pressure on what’s on the market,” he said.\n\nMeanwhile, in Mornington, a deceased estate located in an ex-housing commission area fetched $815,000 at auction, above its reserve of $690,000. 13 Carramar Street originally had a price guide of $610,000-$670,000, which was increased in week two of the campaign to $640,000-$680,000, said selling agent James Stamatopoulos of Ray White Frankston. “Given the amount of interest we had, we wanted to make the price guide more transparent,” he said. The auction drew four bidders, a diverse mix of aspiring first home buyers, downsizers, investors and developers.\n\nLoading The underbidders were downsizers who wanted to relocate from the city, and the successful bidders were investors from Sydney. “We are seeing more interstate investor interest in this pocket,” said Stamatopoulos. “There’s great value here and buyers are responding.” For the sellers, the sale was bittersweet.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/comic-con-s-best-activations-20250728-p5mib8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Comic-Con’s best activations",
        "publish_date": "Mon, 28 Jul 2025 11:05:17 +1000",
        "category": "finance",
        "authors": [],
        "text": "Comic-Con’s best activations\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/motorsport/verstappens-dad-grilled-about-horner-exit-20250728-p5miba.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Verstappen's dad grilled about Horner exit",
        "publish_date": "Mon, 28 Jul 2025 11:00:21 +1000",
        "category": "finance",
        "authors": [],
        "text": "Verstappen's dad grilled about Horner exit\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/eu-and-us-announce-tariff-deal-to-avoid-spiralling-trade-war/e9akto1ol",
        "title": "EU and US announce tariff deal to avoid spiralling trade war",
        "publish_date": "Sun, 27 Jul 2025 21:15:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "The United States struck a framework trade deal with the European Union on Monday AEST, imposing a 15 per cent import tariff on most EU goods, but averting a spiralling battle between two allies which account for almost a third of global trade.\n\n\n\n\n\nThe announcement came after European Commission President Ursula von der Leyen travelled for talks with US President Donald Trump at his golf course in western Scotland to push a hard-fought deal over the line.\n\n\n\n\n\n\"I think this is the biggest deal ever made,\" Trump told reporters after an hour-long meeting with von der Leyen, who said the 15 per cent tariff applied \"across the board\".\n\n\n\n\n\n\"We have a trade deal between the two largest economies in the world, and it's a big deal. It's a huge deal. It will bring stability. It will bring predictability,\" she said.\n\n\n\n\n\nThe deal, which also includes US$600 billion ($915 billion) of EU investments in the US and US$750 billion ($1.14 trillion) of EU purchases of US energy over Trump's second term, will indeed bring clarity for EU companies.\n\n\n\nEven so, the baseline 15 per cent tariff will be viewed by many in Europe as a poor outcome compared with the initial European ambition of a zero-for-zero tariff deal, although it is better than the threatened 30 per cent rate.\n\n\n\n\n\nGerman Chancellor Friedrich Merz welcomed the deal, saying in a statement that a trade conflict had been averted that would have hit Germany's export-driven economy and its large auto sector hard.\n\n\n\n\n\nBut Bernd Lange, the German Social Democrat who chairs the trade committee of the European Parliament, said he was \"quite critical\" because the tariffs were imbalanced and the pledged $600 billion of investment would likely come at the expense of EU industry.\n\n\n\n\n\nThe euro rose around 0.2 per cent against the US dollar, UK pound sterling and Japanese yen within an hour of the deal.\n\n\n\n\n\nThe deal mirrors key parts of the framework agreement the US clinched with Japan last week.\n\n\n\nThe agreement will mean EU goods exported to the US will be liable for a 15 per cent tariff. Source: AAP / Davide Bonaldo / SOPA Images \"We are agreeing that the tariff ... for automobiles and everything else will be a straight-across tariff of 15 per cent,\" Trump said.\n\n\n\n\n\nThat rate, however, will not apply to steel and aluminium, for which a 50 per cent tariff will remain in place, although von der Leyen said it would be cut and replaced with a quota system.\n\n\n\n\n\nVon der Leyen said the rate also applied to semiconductors and pharmaceuticals, and there would be no tariffs from either side on aircraft and aircraft parts, certain chemicals, certain generic drugs, semiconductor equipment, some agricultural products, natural resources and critical raw materials.\n\n\n\n\n\n\"We will keep working to add more products to this list,\" she said, adding that the situation on spirits was still to be established.\n\n\n\n\n\nEric Winograd, chief economist at investment firm AllianceBernstein in New York, noted the similarity with Japan's US deal.\n\n\n\n\n\n\"We will need to see how long the sides stick to the deal. From a market perspective, it is reassuring in the sense that having a deal is better than not having a deal,\" he said.\n\n\n\nTrump, who is seeking to reorder the global economy and reduce decades-old US trade deficits, has so far reeled in agreements with the United Kingdom, Japan, Indonesia and Vietnam, although his administration has failed to deliver on a promise of \"90 deals in 90 days\".\n\n\n\n\n\nHe has periodically railed against the European Union, saying it was \"formed to screw the United States\" on trade.\n\n\n\n\n\nArriving in Scotland, Trump said the EU wanted \"to make a deal very badly\" and said, as he met von der Leyen, that Europe had been \"very unfair to the United States\".\n\n\n\n\n\nHis main concern is the US merchandise trade deficit with the EU, which in 2024 reached US$235 billion ($357 billion), according to data from the US Census Bureau.\n\n\n\n\n\nThe EU points to the US surplus in services, which it says partially redresses the balance. Trump also discussed the \"hundreds of billions of dollars\" that tariffs were generating.\n\n\n\nOn 12 July, Trump threatened to apply a 30 per cent tariff on imports from the EU starting on 1 August, after weeks of negotiations with the major US trading partners failed to reach a comprehensive trade deal.\n\n\n\n\n\nThe EU had prepared counter tariffs on €93 billion ($166 billion) of US goods in the event there was no deal, and Trump had pressed ahead with 30 per cent tariffs.\n\n\n\n\n\nSome member states had also pushed for the bloc to use its most powerful trade weapon, the anti-coercion instrument, to target US services in the event of a no-deal.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/the-who-says-gaza-city-is-the-area-worst-hit-by-malnutrition-morning-news-bulletin-28-july-2025/2vy06ufxa",
        "title": "The WHO says Gaza City is the area worst-hit by malnutrition | Morning News Bulletin 28 July 2025",
        "publish_date": "Sun, 27 Jul 2025 20:43:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nThe World Health Organization says Gaza City is the area worst-hit by malnutrition\n\nLegislation for cheaper medicines to come before the parliament\n\nTadej Pogacar wins the Tour de France for the fourth time\n\nThe World Health Organization says malnutrition is worsening in Gaza, with Gaza City the worst-hit area.\n\n\n\n\n\nThe UN agency says nearly one in five children under five are now acutely malnourished.\n\n\n\n\n\nMeanwhile, Israel has announced it would halt military operations for 10 hours a day in parts of Gaza, and also allow aid corridors, to refute the claim of intentional starvation.\n\n\n\n\n\nThe World Food Programme says they have been able to bring in 80 aid trucks in the last 24 hours.\n\n\n\n\n\nThe agency's Antoine Renard says a lot more aid is needed to address the level of starvation in Gaza.\n\n\n\n\n\n\"We've been advocating for many of the different, let's say, assurances that we have now related to bringing more aid into Gaza. This is long overdue, and we need still to reiterate how important is the ceasefire. So now we see this as a proper way for us to increase the assistance into Gaza, but it will not be within one single day that we can actually change the current level of starvation that you have currently in Gaza.\"\n\n\n\n\n\n**\n\n\n\n\n\nDeputy Prime Minister Richard Marles has re-affirmed Australia's commitment to a two-state solution in the Middle East, following Prime Minister Anthony Albanese's remarks that Australia won't join France in recognising Palestinian statehood immediately.\n\n\n\n\n\nMr Marles says Australia's support is conditional.\n\n\n\n\n\n\"So we've made it clear that we support a two-state solution. But we also make it clear that conditions about what that would be from an Australian point of view. Obviously, any Palestinian state can't have a role for Hamas within them, the Prime Minister and Foreign Minister have made it clear.\"\n\n\n\n\n\nMr Albanese has said Australia will engage in constructive discussions about whether it will recognise Palestinian sovereignty.\n\n\n\n\n\n**\n\n\n\n\n\nThe United States and European Union have struck a deal on tariffs, which will see a blanket tariff of 15 per cent imposed on EU goods imported to the US.\n\n\n\n\n\nThe negotiations were concluded in Scotland at meeting between US President Donald Trump and European Commission President Ursula von der Leyen.\n\n\n\n\n\nThe new deal is set to start on Friday and is seen as an improvement on the threatened import charges of 30 per cent.\n\n\n\n\n\nSome had been hoping for a tariff-free agreement but Ms von der Leyen says she is happy with the outcome.\n\n\n\n\n\n\"We have a deal. We have a trade deal between the two largest economies in the world and it's a big deal, it's a huge deal. It will bring stability, it will bring predictability, that's very important for our businesses on both sides of the Atlantic.\"\n\n\n\n\n\n**\n\n\n\n\n\nThe federal government is introducing legislation this week to bring down costs for prescription on the Pharmaceutical Benefits Scheme.\n\n\n\n\n\nIf the bill is passed, prescriptions on the PBS will cost no more than $25 from January next year.\n\n\n\n\n\nThe Albanese Government says the change would effectively bring PBS medicines to the same price threshold as they were in 2004.\n\n\n\n\n\nFor pensioners and concession card-holders, PBS medicines would stay at the level of $7.70 until 2030.\n\n\n\n\n\nAll medicines that pharmacies can discount can continue to be discounted once the co-payment is cut to $25.\n\n\n\n\n\n**\n\n\n\n\n\nVictoria's Premier Jacinta Allan has dismissed a new report claiming the Labor government has invested almost $400 million on Treaty negotiation since 2016.\n\n\n\n\n\nThe analysis was published by conservative analysis centre the Institute of Public Affairs.\n\n\n\n\n\nThe report also warns the cost of the issue could rise, with Victoria expected to introduce a Treaty bill to parliament later this year.\n\n\n\n\n\nMs Allan has dismissed the claim, denying the expense was only to pay for Treaty negotiations.\n\n\n\n\n\n\"It would be incorrect, indeed completely false, to characterise the investment that's being made today as just being on the negotiations. We've been in a long and steady journey here in Victoria for the past 8 years. That it's involved legislation going to the parliament, two pieces of legislation to set up this framework. It's involved extensive, intensive engagement with Indigenous Victorians, but also the entire community.\"\n\n\n\n\n\n**\n\n\n\n\n\nIn cycling, Tadej Pogacar has claimed his fourth Tour de France title , cementing his status as the most dominant rider of his generation.\n\n\n\n\n\nWout van Aert won stage 21 after taking the lead from Pogacar with six kilometres to go.\n\n\n\n\n\nPogacar is the sixth rider to win four Tour de France titles.\n\n\n\n\n\nThe world champion effectively sealed his victory in the Pyrenees, with a brutal attack on the climb to Hautacam and a commanding victory in the uphill individual time trial, leaving chief rival Jonas Vingegaard more than four minutes behind.\n\n\n\n\n\nHe says he is overjoyed with the win.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-21-results-pogacar-wins-fourth-title/rkvkls9p8",
        "title": "Tour de France: Imperious Pogačar claims fourth title, Van Aert wins brutal final stage",
        "publish_date": "Sun, 27 Jul 2025 20:17:43 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tadej Pogačar closed out a supreme 21-day performance to win the Tour de France in a rainy Paris on Sunday, crushing his rivals to rack up a fourth title.\n\n\n\n\n\nWout van Aert won the final-day cliffhanger on the cobbled roads of Montmartre, but Pogačar was spared any late challenge when the weather forced organisers to neutralise times to avoid potential accidents.\n\n\n\n\n\nBut Pogačar more than played his part on the final in a six-man breakaway during a thrilling finale before Belgian van Aert pulled away on the last climb.\n\n\n\n\n\n\"I was really happy they neutralised the times of the GC (general classification),\" Pogačar said. \"Then it was more relaxed to race and you just had to have good legs to be in front. I tried but hats off to Wout, he was incredibly strong. It was a really nice race.\"\n\n\n\n\n\nRunner-up Jonas Vingegaard was unable to contend with Pogačar, but the winner praised the Dane for having helped him improve over the years.\n\n\n\n\"I spoke to Jonas today. We've been racing each other for five years now and we have raised each other to a higher level,\" Pogačar said.\n\n\n\n\n\nDespite the rain, tens of thousands of spectators packed Montmartre to follow Pogačar's progress up and down the narrow lanes of the popular tourist spot.\n\n\n\n\n\nHe played to the delighted crowds by racing to the head of the peloton near the Moulin Rouge cabaret at the foot of the climb before van Aert produced a well-timed attack to drop Pogačar and charge to the finish line on the Champs-Élysées avenue.\n\n\n\nPogačar was fourth on the day, but after wins in 2020, 2021 and 2024, he again proved untouchable in the world's greatest bike race.\n\n\n\n\n\nVingegaard, the champion in 2022 and 2023, suffered two shocking off-days and ended second overall, 4 minutes 24 seconds adrift.\n\n\n\n\n\n\"We came out fighting in the first week, and after stage five, I felt I had the legs to win. It was clinched in the second week,\" Pogačar said.\n\n\n\n\n\nBreakout German star Florian Lipowitz took third on his debut, rounding out the podium a distant 11 minutes off the pace in third.\n\n\n\nTurning the screw\n\nDefending his title, Pogačar embarked from the start in Lille as the clear favourite and won four stages along the way.\n\n\n\n\n\nIn the first week, he struck on rolling runs in the north and west at Rouen and the Mur de Bretagne.\n\n\n\n\n\nHe then turned the screw on the slopes of the Pyrenees in week two, with his rivals as good as vanquished.\n\n\n\nOverall winner Tadej Pogačar (centre), second-placed Jonas Vingegaard (left), and third-placed Florian Lipowitz (right) celebrate on the podium. Source: AFP / Anne-Christine Poujoulat Vingegaard suffered on the stage-five time trial and again in the second week at Hautacam mountain, leaving the Dane in shock as his form deserted him.\n\n\n\n\n\nIn need of a massive turnaround in the Alps, Pogačar adopted mature tactics and sat on his rival's wheel.\n\n\n\n\n\nAfter it was all over, a radiant Pogačar said he could finally relax.\n\n\n\n\n\n\"Everybody has different ideas about how to celebrate. I want some peace and beautiful weather, enjoying some quiet days at home.\"\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-27-july-2025/i2vbf2vxo",
        "title": "Evening News Bulletin 27 July 2025",
        "publish_date": "Sun, 27 Jul 2025 06:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Google threatens to sue Australian Government over social media ban\n\nAustralians being provided consular assistance after boat intercepted off Gaza\n\nKaden Groves wins latest stage at Tour de France\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nGoogle says it will launch legal action against the Australian government if it includes YouTube in its social media ban for children under age 16.\n\n\n\n\n\nThe video platform was exempted from rules when the bill was discussed in parliament last year, but in June, the eSafety Commissioner advised the Communications Minister it should also be included.\n\n\n\n\n\nNationals leader David Littleproud told Channel Ten while he wants to understand why there are changing stances on YouTube, he thinks social media platforms can do more to protect children who use them.\n\n\n\n\n\n\"I think these big social media companies have not covered themselves in glory for a long time. And it's time for them to catch up. They had the technology at their fingertips to help us with this, and help families with this, and they straight their way around with legal threats is not how I think good corporate citizen should interact.\"\n\n\n\n\n\nThe federal government hasn't confirmed whether it will include YouTube in the social media ban, which will be enforced in December.\n\n\n\n---\n\n\n\n\n\nThe Department of Foreign Affairs and Trade confirms two Australians were on board a boat, seized by Israeli military off the Gaza coast.\n\n\n\n\n\nA spokesperson confirms there were 21 members on the boat when it was intercepted, including Australian journalist Tania Safi and human rights activist Robert Martin.\n\n\n\n\n\nThe spokesperson says Australian officials in Tel Aviv are liaising with authorities, and consular officers stand ready to offer assistance to affected citizens.\n\n\n\n\n\nThe Guardian reports Ms Safi and Mr Martin were travelling with the pro-Palestinian activist group, Freedom Flotilla Coalition.\n\n\n\n\n\nThe boat was intercepted by Israeli troops when it was about 100 kilometres west of Gaza.\n\n\n\n\n\nThe Israeli foreign ministry claims the boat illegally entered the maritime zone off the coast of Gaza, while the activist group says its crew have been subjected to what it called unlawful detention while attempting to transport aid to the area.\n\n\n\n---\n\n\n\n\n\nTrade Minister Don Farrell is defending the decision to lift restrictions on importing US beef to Australia, rejecting claims the call was made under pressure as tariffs are negotiated.\n\n\n\n\n\nBut Mr Farrell later confirmed that the U-S president Donald Trump had raised the issue of importing US beef to Australia during his phone call with Prime Minister Anthony Albanese.\n\n\n\n\n\nMr Farrell earlier said the decision was made as part of an independent review process before U-S President Donald Trump imposed tariffs on Australian imports.\n\n\n\n\n\nHe told Sky News allowing US beef into the country will not compromise national biosecurity.\n\n\n\n\n\n\"This is an independent process the agriculture department undertakes. They made decisions based on all the scientific evidence as to whether is on a biosecurity basis, it's appropriate to allow our overseas products to come into Australia. On this occasion, they have made that decision.\"\n\n\n\n---\n\n\n\n\n\nForeign Minister Penny Wong and her U-K counterpart David Lammy have stressed the importance of women's roles in the defence force.\n\n\n\n\n\nMs Wong and Mr Lammy are visiting the HMS Prince of Wales this afternoon in Darwin, the site of the Talisman Sabre.\n\n\n\n\n\nThe pair are promoting the UK's Carrier Strike Group's upcoming involvement in Australia's annual war games.\n\n\n\n\n\nMs Wong says both Australia and the UK are committed to continue progressing the Women, Peace and Security agenda developed by the U-N Security Council in 2000.\n\n\n\n\n\n\"We know the importance of women in our armed forces to our security, and we thank those behind us and all women who serve in our defence forces for their contribution to our security, to peace, in our region and beyond. We also know the importance of having women involved in peace settlement and peace negotiation.\"\n\n\n\n---\n\n\n\n\n\nIn cycling, Australia's Kaden Groves has won stage 20 of the Tour de France - his maiden stage win at the race.\n\n\n\n\n\nHis late solo breakaway left the big two of Tadej Pogačar and Jonas Vingegaard trailing in the pouring rain of northern France.\n\n\n\n\n\nThe 26-year-old from the Sunshine Coast was able to demonstrate his bike-handling skills as he managed to stay up when other cyclists skidded out of control in front of him on a wet descent - 21 kilometres from the finish.\n\n\n\n\n\nHe says it is hard to describe his emotions right now.\n\n\n\n\n\n\"There's so many emotions to win here. The team, we come here with so many different plans with Jasper (Philipsen) and Mathieu (van der Poel), and in the end, I get my own opportunities, and they haven't gone the right way, but today, I mean, yeah, I had super legs. I mean, I just suffered to the line and in reward, we get a tour stage.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/genius-move-everyone-is-raving-about-new-astronomer-ad-after-coldplay-kiss-cam-scandal/7mkfdun03",
        "title": "'Genius move': Everyone is raving about new Astronomer ad after Coldplay kiss cam scandal",
        "publish_date": "Sat, 26 Jul 2025 23:58:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Gwyneth Paltrow is starring in a new ad for Astronomer.\n\n\n\n\n\nAlmost a fortnight after the tech company's married CEO, Andy Byron, was caught on a Coldplay concert kiss cam with his arms around his HR executive Kristin Cabot, Paltrow has been hired as a \"temporary\" spokesperson for Astronomer.\n\n\n\n\n\nThe 52-year-old, who was married to Coldplay frontman Chris Martin from 2003 until 2016, appeared in a short video on Astronomer's social media speaking about the company's strengths.\n\n\n\n\n\n\"I've been hired on a very temporary basis to speak on behalf of the 300-plus employees at Astronomer. Astronomer has gotten a lot of questions over the last few days, and they wanted me to answer the most common one,\" she says in the ad.\n\n\n\n\n\nThe first question, \"OMG! What the actual f***?\", then appeared on the screen in writing.\n\n\n\nHowever, she dodged the question and plugged the company's products: \"We've been thrilled so many people have a newfound interest in data workflow automation.\"\n\n\n\n\n\nThe next question to Astronomer was, \"How is your social media team holding ...\"\n\n\n\n\n\nHowever, Paltrow moved on before the whole question could be asked.\n\n\n\n\n\n\"We will now be returning to what we do best, which is delivering game-changing results for our customers. Thank you for your interest in Astronomer,\" she said.\n\n\n\nThe video was captioned: \"Thank you for your interest in Astronomer.\"\n\n\n\n\n\nSocial media users chimed in after the video was released, with tech journalist Neville Lahiru saying: \"Getting Chris Martin's ex-wife was a genius move lol.\"\n\n\n\n\n\nPR and communications consultant Ronke Lawal lauded the move as an \"engaging way to handle a PR crisis\" and \"socially relevant without being too corny and cringe.\"\n\n\n\n\n\nAnother user, Matt Brian, commented: \"Marketing genius. Owning the Coldplay kiss cam video *and* hiring Chris Martin’s ex-wife? Splendid.\"\n\n\n\nAt Coldplay's 15 July concert near Boston, a cameraman panned across the crowd and showed Byron and Cabot in an embrace.\n\n\n\n\n\nIn a video shared to TikTok, as the couple frantically tried to dodge the camera, frontman Martin could be heard saying: \"Oh, look at these two. All right, c'mon, you're okay.\n\n\n\n\n\n\"Oh, what? Either they're having an affair or they're just very shy.\"\n\n\n\n\n\nBoth Byron and Cabot have since resigned from the company.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/hepatitis-warning-migrant-communities-disproportionately-affected-by-the-silent-killer/kv5u12ppe",
        "title": "Hepatitis warning: migrant communities disproportionately affected by the silent killer",
        "publish_date": "Sat, 26 Jul 2025 22:00:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nAs a busy mother juggling the demands of a young kids and work, for a time Mei Mak's Hepatitis B diagnosis took a back seat.\n\n\n\n\n\nShe'd never had any symptoms since discovering she was a carrier before marriage.\n\n\n\nThen one day, she says an annual check-up with her doctor revealed a shock result.\n\n\n\n\n\n\"She found out that my viral load had increased dramatically and so she alerted me and say Mei I'm going to send you to the hospital ... I started to like be a bit scared, a bit concerned, like oh.\"\n\n\n\n\n\nShe's returned every six months since to monitor more closely how the condition is progressing.\n\n\n\n\n\nAlmost 300,000 people in Australia live with Hepatitis B or Hepatitis C - often without any warning signs of liver damage.\n\n\n\n\n\nProfessor Gregory Dore of the Kirby Institute says that silent progression is exactly why routine testing matters.\n\n\n\n\n\n\"Because it doesn't cause symptoms in the initial years, and sometimes even in the initial decades of infection, that's why it can be termed the silent killer because people can have the infection and it can be causing damage to the liver, but they're completely unaware of that, so that's why it's really crucial that we get the message out about who should be screened and tested.\"\n\n\n\n\n\nHepatitis Australia CEO Lucy Clynes says understanding who's most at risk is also a crucial part of that process.\n\n\n\n\n\n\"We know that half that population are either undiagnosed, that means they don't know they are living with hepatitis or they are not connected to the care or the treatment that they need. Hepatitis is Australia's leading cause of cancer death - we have to get people connected to care and support.\"\n\n\n\n\n\nIts new report poses the question - if 100 people were living with viral hepatitis, who would they be?\n\n\n\n\n\nIt found 69 would be living with Hepatitis B and almost a quarter with Hepatitis C.\n\n\n\n\n\nSome can live with multiple forms.\n\n\n\n\n\nThe conditions differ as do their treatments.\n\n\n\n\n\nHepatitis C is curable, but has no vaccine.\n\n\n\n\n\nHepatitis B has a vaccine and treatments, but no cure.\n\n\n\n\n\nEliminating viral hepatitis as a public health threat is the major goal, with almost 1,000 deaths in Australia recorded each year.\n\n\n\n\n\nThe federal government is aiming to get there by the end of the decade.\n\n\n\n\n\nBut Hepatitis Australia wants more action, warning the current rate of progress won't reach that target.\n\n\n\n\n\n\"We know migrant communities are disproportionately impacted by viral hepatitis - particularly Hepatitis B. That means we have to be providing information in a range of community languages and in ways that are culturally sensitive to the needs of migrant populations.\"\n\n\n\n\n\nThe snapshot shows 70 per cent of people affected by Hepatitis B would be born overseas, including higher rates from countries in south east Asia, where mother-to-child transmission is more common.\n\n\n\n\n\nWhile more than half - 56 per cent - speak a language other than English at home.\n\n\n\n\n\nMei Mak has the experienced the stigma that can come with a diagnosis.\n\n\n\n\n\nBut she's urging others not to let that stop them looking out for their health.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/never-tear-us-apart-by-inxs-wins-triple-js-hottest-aussie-100/9k20u6xao",
        "title": "Never Tear Us Apart by INXS voted as Australia's favourite song",
        "publish_date": "Sat, 26 Jul 2025 21:57:05 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Aussie power ballad Never Tear Us Apart by 1980s rock royalty INXS has taken out the title of number one song on Triple J's special edition Hottest 100 countdown dedicated to Australian artists.\n\n\n\n\n\nAudiences have been voting for months to reveal Australia's favourite song in the annual countdown that showcases some of the nation's best homegrown music talent.\n\n\n\n\n\nCelebrating on behalf of the band, founding member and drummer Jon Farriss joined the radio station on Saturday night to reflect on the win.\n\n\n\n\n\n\"We feel so blessed and we're very grateful,\" Farriss said.\n\n\n\n\n\nAustralian hip hop royalty The Hilltop Hoods came in at number two with their 2003 hit The Nosebleed Section.\n\n\n\nQueensland pop duo The Veronicas and their 2007 hit Untouched, Missy Higgins' breakout 2004 single Scar and Don't Dream It's Over by Crowded House rounded out the top five.\n\n\n\n\n\nReflecting on their number three spot, Jess and Lisa Origliasso said for \"just two girls from Brisbane\", the countdown had brought them to tears.\n\n\n\n\n\n\"We're on top of the world right now ... this is such a huge honour for us,\" Jess Origliasso said.\n\n\n\n\n\nHiggins also joined the radio station, telling presenters she couldn't believe Scar still resonated with Australian audiences more than 20 years since its debut.\n\n\n\n\n\n\"I can't quite believe it — I feel like the luckiest person ever,\" she said moments after the song was played.\n\n\n\nMissy Higgins says she feels like \"the luckiest person ever\" after Scar came in at number four. Source: AAP / Joel Carrett The countdown is typically comprised of the best songs of the year from all over the world but the youth station hosted a special mid-year poll dedicated to Aussie artists and tracks to celebrate its 50th anniversary.\n\n\n\n\n\nBelgian-born Australian singer-songwriter and multi-instrumentalist Gotye squeezed in to cinch the number 10 spot with his 2011 hit Somebody That I Used To Know.\n\n\n\n\n\nOther notable mentions included Australian music great John Farnham, voted in at number 15 with his 1986 hit You're the Voice.\n\n\n\n\n\nDaryl Braithwaite's The Horses came in at number 30, with Natalie Imbruglia's Torn voted in at 32.\n\n\n\n\n\nMore than 2.65 million votes were tallied for the countdown, the station's fourth-largest poll, according to the broadcaster.\n\n\n\n\n\nEight tracks in the countdown were separated by fewer than 10 votes and only 30 votes separated songs 100 and 101.\n\n\n\n\n\nThe countdown kicked off at 10am AEST on Saturday and wrapped at 8pm.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australian-early-intervention-program-for-deaf-children-piloted-in-japan/v4hslle7i",
        "title": "Australian early intervention program for deaf children piloted in Japan",
        "publish_date": "Sat, 26 Jul 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nBaby Rafael is hearing for the first time, with a cochlear implant unlocking a new world of sound.\n\n\n\n\n\nThe small electronic device - which is surgically implanted - helps deaf people perceive sound.\n\n\n\n\n\nRafael's mother, Renata Reis, says her son was six months old when he was fitted with the technology.\n\n\n\n\"That's where the magic happens. There's the beautiful day that we were waiting for this first six months of his life where he could hear us for the first time. That was unbelievable. We were waiting, so excited for this day.\"\n\n\n\n\n\nThat was 12 years ago.\n\n\n\n\n\nRafael, now 13, was diagnosed with profound hearing loss soon after birth.\n\n\n\n\n\nAnd so too, were his younger brothers, 10-year-old Gabriel and six-year-old Luca.\n\n\n\nThe Sydney-based siblings all had the device implanted around the age of six months but it was just the beginning of their journey towards hearing and speaking.\n\n\n\n\n\nWhile a cochlear implant can be life-changing, the technology alone is not enough, says Dr Aleisha Davis, CEO of the Shepherd Centre, a not-for-profit that helps children with hearing loss learn to listen and speak.\n\n\n\n\n\n\"There's such a misconception that hearing aids or cochlear implants help a child hear, but they don't. They provide access and the technology helps them hear sound, but brains aren't wired to understand sound at such early ages. So we provide the therapy that enables the children to understand what those signals are and to learn to use them in their everyday environments.\"\n\n\n\n\n\nThe brothers also took part in the Shepherd Centre's early intervention program.\n\n\n\n\n\nThe children are now thriving, says their mother Renata, who migrated to Australia from Brazil 17 years ago.\n\n\n\nMusic is a big part of the family's cultural identity and the two eldest boys are members of their school band.\n\n\n\n\"The program here was essential for them to thrive. You come here for maybe a day in the week, but it's all about the work that you put in every single day, exposing them to language, to sounds and music. They're doing quite well at school. They are very social little people.\"\n\n\n\n\n\nIt was a decade ago that prominent Japanese hearing health specialist Doctor Akira Takagi first learnt about the work at the Shepherd Centre.\n\n\n\nHe says in Japan, children diagnosed with hearing loss who wish to receive a cochlear implant don't typically have the surgery until the age of one or two.\n\n\n\nIn Australia, it's around six months.\n\n\n\n\n\n\"The sooner the surgery the better the outcomes.\"\n\n\n\n\n\nAnd Doctor Takagi adds there's a lack of services in Japan to teach children how to use the devices.\n\n\n\n\n\nHe says he was 'amazed' by the program offered by the Shepherd Centre.\n\n\n\n\"This is the system I am trying to create in Japan in collaboration with the Shepherd centre.\"\n\n\n\n\n\nThis month that became a reality with the launch of an early intervention pilot program.\n\n\n\n\n\nAleisha Davis says the partnership has been a decade in the making. \"I am thrilled that it's happening and that we can help many more children than those locally here in Australia. It really will change the way that children grow up learning to listen with cochlear implants in Japan.\"\n\n\n\n\n\nNot all children born with hearing impairment use a cochlear implant.\n\n\n\nSome families opt for Auslan, while others are bilingual using both sign-language and spoken language.\n\n\n\n\n\nShirley Liu, the CEO of Deaf Australia - the main association representing deaf people in Australia - says there is a diversity of experiences.\n\n\n\n\n\nSpeaking to SBS in Auslan, which we've translated to spoken language, she emphasises the need for access to sign language from birth.\n\n\n\n\n\n\"It's not an either/or, black or white, system that you can either have access to sound or access to Auslan and they can be used in conjunction with each other. Our position is that Auslan is essential and it's a valuable and vital language for deaf children to have access to.\"\n\n\n\n\n\nAround 90 per cent of deaf children are born to hearing parents.\n\n\n\n\n\nThis means many families are initially unfamiliar with deafness.\n\n\n\n\n\nThat was the case for Liz Speilman, whose two-and-half-year-old son, Louis was diagnosed with hearing loss shortly after birth.\n\n\n\n\n\n\"We didn't know anything about hearing loss. We don't have anyone that's deaf in our family. So it was a new world to us as well.\"\n\n\n\n\n\nLouis, who has been fitted with a cochlear implant, has been taking part in therapy sessions at Shepherd Centre every week for the past two years.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-president-trumps-tariffs-are-looming/31fw6olba",
        "title": "INTERVIEW: President Trump's tariffs are looming",
        "publish_date": "Sat, 26 Jul 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-20-results/j7jwtq75l",
        "title": "Tour de France: Australian Kaden Groves wins stage 20 as Pogačar on cusp of fourth title",
        "publish_date": "Sat, 26 Jul 2025 20:58:34 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia's Kaden Groves has completed his set of grand tour stage wins after traversing the slippery roads to triumph on the penultimate day of the Tour de France.\n\n\n\n\n\nThe Australian sprinter is normally renowned for fast finishes, but excelled in the tough and wet slog over the hills to claim an emotional victory from the 13-man breakaway.\n\n\n\n\n\nThe Alpecin-Deceuninck rider surged ahead 16 kilometres from home and held on for his first Tour stage win and 10th at major races. The 26-year-old from the Sunshine Coast has claimed two at the Giro d'Italia and seven at the Spanish Vuelta.\n\n\n\n\n\nHe finished 54 seconds ahead of Frank van den Broek and 59 clear of Pascal Eenkhoorn, bursting into tears as he crossed the finish line in Pontarlier.\n\n\n\n\n\nGroves' first career Tour stage win was a third of this race for his Alpecin-Deceuninck team but the first since stage two, with their previous two winners, Jasper Philipsen and Mathieu van der Poel, since lost to injury and illness.\n\n\n\n\"Today we weren't sure whether to go for the stage or wait for tomorrow but when the rain falls I have a super feeling normally in the cold weather,\" an emotional Groves said.\n\n\n\n\n\n\"There's so much pressure at the Tour, and having won in the Giro, having won in the Vuelta, all I ever get asked is am I good enough to win in the Tour? And now I show them.\n\n\n\n\n\n\"It's my first time winning, so it's pretty incredible.\"\n\n\n\n\n\nEarlier in the stage, another Australian, Harrison Sweeny, had made his mark.\n\n\n\n\n\nWhen the front group tackled the 3.6km Côte de Thésy, Frenchman Jordan Jegat launched a solo attack, but he was then overtaken by Sweeny.\n\n\n\nKaden Groves celebrates on the podium after winning a Tour de France stage for the first time. Source: AP / Mosa'ab Elshamy As rain fell heavily again after 40km, Sweeny opened up a 50-second lead, only to be quickly reeled in.\n\n\n\n\n\nAside from the Australian cameos, Pogačar kept things safe to maintain his healthy lead over arch-rival Vingegard and set the stage for a triumphant finale into Paris on Sunday.\n\n\n\n\n\nThe Slovenian ace has a 4 minutes 24 seconds advantage over two-time Tour winner Vingegaard with Germany's Florian Lipowitz 11:03 behind Pogačar in third overall.\n\n\n\n\n\nBarring a dramatic misadventure, Pogačar should complete the job on Sunday (local time) and move level with British rider Chris Froome on four Tour titles.\n\n\n\n\n\nVictory would also give Pogačar a fifth Grand Tour after winning the Giro d'Italia in dominant fashion last year.\n\n\n\nHowever, Sunday's final stage is not a processional one, as is usually the case, and could potentially prove troublesome toward the end with three consecutive climbs.\n\n\n\n\n\nSaturday's 184.2km route from Nantua through eastern France featured three small climbs and a moderately difficult one up Côte de Thésy.\n\n\n\n\n\nThe wet roads were treacherous at high speeds, with France's Romain Grégoire and Spaniard Iván Romeo both crashing as they attempted to navigate tight turns. Both were able to continue.\n\n\n\n\n\nThe final stage is a 132.3km ride from Mantes-la-Jolie to Paris, where the peloton will cycle up the famous Butte Montmartre three times before the final laps on the Champs-Elysees.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/souths-fume-at-wighton-ban-for-head-clash-as-stars-now-sidelined-for-200-matches-20250727-p5mi2e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Souths to fight Wighton’s ‘head clash’ ban as stars now sidelined for 200 matches",
        "publish_date": "Mon, 28 Jul 2025 12:07:43 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Robert Dillon",
            "Adrian Proszenko"
        ],
        "text": "South Sydney will risk a four-match ban by challenging Jack Wighton’s hit on Cronulla’s Toby Rudolf at the NRL judiciary, with the club privately arguing his contact was little more than a head clash.\n\nWighton was served a grade 2 dangerous contact charge on Sunday for the shot that saw him sin-binned in Saturday night’s loss to the Sharks.\n\nThe veteran five-eighth will challenge his suspension on Tuesday night having sought legal counsel from judiciary regular Nick Ghabar.\n\nWighton’s proposed suspension is exacerbated by a 2023 hit on Jackson Hastings counting as a similar previous incident.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/family-beats-10-others-to-3-3m-designer-semi-after-six-month-search-20250728-p5mi95.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Family beats 10 others to $3.3m designer semi after six-month search",
        "publish_date": "Mon, 28 Jul 2025 12:05:57 +1000",
        "category": "finance",
        "authors": [
            "Carmen Forward"
        ],
        "text": "A family paid $3,388,000 for a luxurious five-bedroom semi in Burwood at auction on Saturday, beating 10 other registered bidders and ending a six-month search.\n\nThe turnkey designer duplex at 14 Lindsay Street came with a striking, low-maintenance rock and cactus garden and a price guide of $2.5 million.\n\nThe sleek property has an open-plan living area, and one bedroom with an ensuite on the top floor and four bedrooms and three bathrooms on the ground floor.\n\nBidding opened at $2.5 million, and five parties were active. Bids of $100,000 took the price to $3 million, where it met the reserve.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-s-latest-clumsy-deal-has-unintended-consequences-20250728-p5mi8l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump’s latest clumsy deal has unintended consequences",
        "publish_date": "Mon, 28 Jul 2025 11:59:06 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Agreeing to buy energy from the US was a no-brainer for the EU and Japan, given their reliance on imported energy. The EU, which ended its purchases of Russian gas after the invasion of Ukraine, now imports about half its LNG from the US. LNG is a commodity traded at global market prices, so there is no financial penalty for the EU in sourcing more gas from the US. Perversely, however, there could be an adverse impact on the US - its increased exports of LNG in recent years have flowed through to higher US domestic gas prices. The deals that may underpin this new global trade order have been hastily and clumsily negotiated, are half-formed and have unintended consequences for American companies, consumers and the US economy. The promise, if there is one, to invest $US600 billion in the US was vague and one whose delivery is beyond the EU’s control. It is individual European companies that would have to decide whether or not to invest. Unlike the deal with Japan, where Trump claimed the Japanese would invest $US550 billion in a fund from which the US would get 90 per cent of the profits, the investment agreement with the EU appears just a broad statement of intent.\n\nTrump and his administration have a tendency to over-egg their accomplishments. The Japanese version of what they have agreed to, for instance, varies significantly from what Trump has described. The Japanese have agreed to provide equity, loans and loan guarantees for investments in the US, but government officials say any profits would be split according to the level of contributions made and that the final degree of profit-sharing would rest with the private sector companies involved and the returns they required. It would appear the Japanese envisage their state agencies mainly facilitating debt funding for US projects, with the decisions on which projects to pursue and the apportionment of profits left to the Japanese and US companies involved. Trump said Japan would invest, “at my discretion,” the $US550 billion but, as is the case with the EU, he can’t force Japanese companies to invest.\n\nIt should be noted that the presentation card on Trump’s desk that outlined the investment agreement originally said Japan would invest $US400 billion, but the “$400B” was crossed out with a marker pen (a Sharpie, perhaps) and altered to $US500 billion. When Trump announced the detail, in a post on Truth Social, it had suddenly become $US550 billion. It is unclear whether the Japanese were consulted on the revisions. What that episode demonstrates is how rushed the trade deals have been as the administration tries to demonstrate that the threat of Trump’s “reciprocal” tariffs has been successful in forcing other countries to accept Trump’s terms before the 90-day delay before those tariffs are imposed expires on August 1. That’s why there are obvious blank pages in the EU and Japanese deals to be filled in before they remotely resemble a fully-detailed trade agreement.\n\nIt’s also why, as is the case with Australia’s recent decision to allow more imports of American processed beef, the outcome of the agreements will depend, not on what Trump decrees or the EU and Japanese trade negotiators have agreed to, but on companies and consumers within the markets that the US says it is opening up. The Japanese won’t buy any meaningful volume of US SUVs and pick-up trucks. There is no market for them in Japan and the American auto companies aren’t going to re-tool in order to produce a few gas-guzzling right-hand drive vehicles. Trump mused that the Europeans would enjoy those SUVs and pick-ups. He doesn’t appreciate that there are significant cultural differences between Europeans and Americans and that it is improbable that the narrow and congested streetscapes in European cities are suddenly going to be littered with over-sized US vehicles. Trump doesn’t appreciate that there are significant cultural differences between Europeans and Americans and that it is improbable that the narrow and congested streetscapes in European cities are suddenly going to be littered with over-sized US vehicles. Credit: iStock The 15 per cent tariff on European auto and auto part exports is, however, a big win for the Europeans, as were the same tariff concessions won by the Japanese.\n\nThe EU and Japanese carmakers don’t face tariffs on their raw materials, like steel and aluminium, or components. Their US counterparts, which are heavily integrated into a North American auto industry, with cars and components flowing across the borders with Mexico and Canada, do. Thanks to Trump, who has imposed 25 per cent duties on imports of steel, aluminium, auto parts and those components of US autos not made within the US, the European and Japanese companies will have a material competitive advantage over America’s own carmakers. The fact that the two key trading partners, both heavily reliant on the auto industry, were able to win such advantages for their companies says that, in its haste to proclaim that Trump’s tariffs threats have produced results, the administration hasn’t looked at the complex ways the deals interact with America’s own industries and their supply chains. It does seem rather bizarre that Trump is using the threat of punitive tariffs to bludgeon other countries into trade deals that gives their key industries what is effectively a tariff advantage over his own. He and his advisers also don’t appear to appreciate that allowing tariff-free imports of products from the US is irrelevant if consumers aren’t going to buy what the US is selling or, as is the case with the 100 Boeing aircraft that Japan agreed to buy, if the US companies can’t deliver what the countries have agreed to buy. Boeing’s current backlog of orders is about 6000 planes, or nearly 17 years of production at the rate at which it delivered planes last year.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/ex-winger-who-was-too-slow-too-big-now-a-key-man-up-front-for-dogs-20250728-p5mi8i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ex-winger who was ‘too slow, too big’ now a key man up front for Dogs",
        "publish_date": "Mon, 28 Jul 2025 11:51:23 +1000",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "They say lightning doesn’t strike twice, and the same logic usually applies to front-row forwards scoring two tries in a match.\n\nBut anyone thinking that Sam Hughes’ brace in Canterbury’s 42-4 demolition of Manly on Sunday was a fluke is presumably unaware of his background.\n\nThe towering 24-year-old wasn’t always a prop. In his formative years, he was - in his own words - “a big, tall, lanky winger”, firstly with De La Salle Caringbah, then in the Cronulla and Parramatta junior representative systems.\n\nFor good measure, he also played a bit of fullback in junior rugby union.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/perfect-10-demon-recovers-from-brink-of-defeat-to-win-title-20250728-p5mic4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Perfect 10: Demon recovers from brink of defeat to win title",
        "publish_date": "Mon, 28 Jul 2025 11:49:37 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "He never trailed in the tie-break – but twice handed back mini-break leads – before sealing a victory after three hours and two minutes of tense and absorbing tennis that owed to repeatedly brave shot-making in the toughest moments.\n\nDe Minaur saved three separate championship points in a nerve-jangling, 14-minute service game at 4-5, including a defensive backhand that barely touched the sideline on the third of them.\n\nThe Australian became a 10-time champion on the ATP Tour on Monday (AEST), recovering from 5-2 down in the deciding set of the Washington final to outlast childhood rival Alejandro Davidovich Fokina, 5-7, 6-1, 7-6 (7-3), in another performance packed with mental resilience.\n\nLoading\n\nDe Minaur’s triumph means he is only one career title behind Australian greats Patrick Rafter and Mark Philippoussis. He is also the fifth Australian to win the Washington Open, with Nick Kyrgios the most recent in 2019 and 2022.\n\n“I don’t know [how I did that]. It’s something about this court. I did it in 2018 against [Andrey] Rublev, and honestly, I just kind of knew I could do it,” de Minaur said.\n\n“I just backed myself and told myself to commit, no matter what, and if I lost this match, it was going to be on my terms – and today went my way. I’ve had a couple of brutal ones not go my way, so I’m glad this one [did].\n\n“I’m very happy with where I am at the moment, [and] how I’m dealing with things on and off the court. I had the mindset that even if today didn’t go my way, it was a very positive week, so I was proud of my efforts, no matter what, but, geez, it feels good to hold my 10th title.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/the-opera-lover-the-aromatherapist-and-the-1m-inheritance-fight-20250724-p5mhgl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The opera lover, the aromatherapist and the $1m inheritance fight",
        "publish_date": "Mon, 28 Jul 2025 11:45:00 +1000",
        "category": "entertainment",
        "authors": [
            "Michaela Whitbourn"
        ],
        "text": "It was a costly court fight over the million-dollar estate of an elderly opera aficionado. An aromatherapist who struck up a friendship with the woman stood to inherit everything if she won.\n\nEva Marie Easton died in September 2021, aged 89. The German migrant made a will in November 2020 naming the Sydney Opera House Trust as sole beneficiary. It was her wish that the funds be used for the promotion of performances of German classical music.\n\nA NSW woman’s 2020 will left her $1 million estate to the Sydney Opera House Trust. Credit: Nathan Perri\n\nThe 2020 will superseded a will from 2019, which left everything to her friend Isabelle Agnes Peacock, an aromatherapist she met in 2004 when she started having monthly massages. Easton’s Australian ex-husband had died years earlier, and she was unaware of any other living relatives.\n\nBy about 2009, Easton and Peacock “had developed a good friendship”, Supreme Court Justice James Hmelnitsky said in a decision last year.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/de-minaurs-incredible-save-on-match-point-20250728-p5mic1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "De Minaur's incredible save on match point",
        "publish_date": "Mon, 28 Jul 2025 11:44:14 +1000",
        "category": "sports",
        "authors": [],
        "text": "De Minaur's incredible save on match point\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/more-beauty-than-beast-in-new-production-at-perth-s-crown-theatre-20250728-p5mibi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "More beauty than beast in new production at Perth’s Crown Theatre",
        "publish_date": "Mon, 28 Jul 2025 11:43:59 +1000",
        "category": "entertainment",
        "authors": [
            "Emma Young"
        ],
        "text": "There was more beauty than beast represented in the Perth personalities who adorned the red carpet for Saturday’s Beauty and the Beast premiere at Crown Theatre – and the same could be said for the show.\n\nAt the final opening for a national tour attended so far by 1.2 million Australians, anticipation and nostalgia built right from the prologue voiced by Angela Lansbury (Miss Potts in the original Disney animated feature) and the opening glimpses of a jaw-dropping set that required 23 trucks to get to Perth and a team of 70 to unload them across thousands of hours.\n\nShubshri Kandiah and Brendan Xavier in Disney’s Beauty and The Beast. Credit: Daniel Boud\n\nFaithfulness to the original continued; there is no danger of a modern reimagining in this saccharine-sweet production, which despite the vocal prowess of Belle (Perth-born Shubshri Kandiah) and the Beast (Brendan Xavier) unfortunately is slightly lacking in truly memorable numbers in the context of a 2.5-hour run time.\n\nThe obvious exceptions are of course Be Our Guest, a showstopping number bringing all the production’s technical might including projected backdrops of dancers’ onstage patterns, milked to the max through an extended tap finale with 2400 lights; Belle, which shows off a French provincial town created with 30 tonnes of flying scenery and 50 tonnes of automation and staging; and Beauty and the Beast, simply and touchingly rendered by Jayde Westaby as Mrs Potts.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/a-bro-area-full-of-testosterone-tension-over-the-bondi-beach-gym-crackdown-20250722-p5mgy7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘A bro area full of testosterone’: Tension over the Bondi Beach gym crackdown",
        "publish_date": "Mon, 28 Jul 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "David Barwell"
        ],
        "text": "A fitness furore has broken out over a council decision to crack down on the use of dumbbells and weights at Bondi’s beachside gym due to “public safety” concerns and fears the site is attracting too much testosterone.\n\nLong-term users of the Bondi Park Fitness Station want Waverley Council to allow gym gear to be returned to the site after complaints resulted in the removal of the equipment in March.\n\nVirginia Venn, Joey Pamment and Louise Brandon pictured at the outdoor gym at Bondi Beach. Credit: Janie Barrett\n\nRegular gym users say they were left stunned when the free weights were removed in response to concerns the site had become a public liability risk for Waverley Council.\n\nA council report outlining concerns stated the fitness equipment posed safety risks, including potential trip hazards that might expose the council to claims for injuries.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/dummies-for-adults-the-practical-uses-for-grown-up-pacifiers-20250624-p5m9we.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dummies for adults? The practical uses for grown-up pacifiers",
        "publish_date": "Mon, 28 Jul 2025 11:19:15 +1000",
        "category": "lifestyle",
        "authors": [
            "Nell Geraets"
        ],
        "text": "To use or not to use a dummy – it’s a question endlessly debated on parenting blogs and baby forums. Some believe they should never be used, but most frown upon children above the age of two or three sucking on them.\n\nIt’s not just babies using them, though. Despite still being relatively niche, some adults use dummies, most commonly referred to as “soothers”. Some are designed specifically for nighttime, others are bedazzled, but they’re all clearly for adult use.\n\nSoothers or dummies specifically designed for adults can be used for a variety of purposes but dental experts warn against their long-term use. Credit: Aresna Villanueva\n\nIf three is considered “too old” by some to be using a dummy, what does this mean for the adults using them? There are several reasons why older people may use soothers – reasons that are gradually becoming better understood.\n\nAren’t dummies just for babies?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/property/news/once-in-a-lifetime-young-family-pays-1-7m-for-architect-designed-home-20250728-p5mi97.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Once in a lifetime’: Young family pays $1.7m for architect-designed home",
        "publish_date": "Mon, 28 Jul 2025 11:08:58 +1000",
        "category": "finance",
        "authors": [
            "Shona Hendley"
        ],
        "text": "He said home’s architectural design by Taouk Architects was a major drawcard. “He develops some incredible property, and given its proximity to the train line, it was a once-in-a-lifetime opportunity for someone to buy a Taouk property for under $2 million.” Suckling said the local market was quite busy. “There is definitely some activity in the area, that’s for sure ... Alphington is quite resilient,” he said.\n\nLoading “It is an interesting pocket of Melbourne with a lot of families and more family homes. It is less dense than other areas of the inner north, but you still have access to all the things in the area.” The property was one of 752 scheduled for auction in Melbourne in the past week. By Saturday evening, Domain Group recorded a preliminary auction clearance rate of 75.8 per cent from 557 reported results, while 44 auctions were withdrawn. Withdrawn auctions are counted as unsold properties when calculating the clearance rate. A three-level townhouse in Eltham designed by renowned architect Graeme Gunn sold under the hammer for $1.41 million on Saturday. The home at 2/93 Arthur Street was advertised with a reserve of $1,300,000, which selling agent Tom Kurtschenko from Jellis Craig said “was part of the strategy going into the auction”.\n\nPositioned at the highest point of Eltham, the home is a part of the gated Kinloch Estate, which was established in 2000. The property’s treetop and city views on the upper level, along with its three bedrooms and thoughtfully crafted layout, attracted two active bidders, both local families, to the area. “The two bidders went toe to toe,” Kurtschenko said. “It got a run on, and it was a pretty clean auction and got to where it needed to.”\n\nLoading The successful bidders want to do some improvements to bring the home back to its former glory, Kurtschenko said. “It’s a 25-year-old home, and it’s just showing its age a little bit,” he said. Stock markets in the local market were “very low”, the agent said. “Locally in Eltham and Eltham North, there are 75 homes up for sale, which is well down. It usually trends at around 110 to 130 homes, so it is notably down, so I think that’s putting pressure on what’s on the market,” he said.\n\nMeanwhile, in Mornington, a deceased estate located in an ex-housing commission area fetched $815,000 at auction, above its reserve of $690,000. 13 Carramar Street originally had a price guide of $610,000-$670,000, which was increased in week two of the campaign to $640,000-$680,000, said selling agent James Stamatopoulos of Ray White Frankston. “Given the amount of interest we had, we wanted to make the price guide more transparent,” he said. The auction drew four bidders, a diverse mix of aspiring first home buyers, downsizers, investors and developers.\n\nLoading The underbidders were downsizers who wanted to relocate from the city, and the successful bidders were investors from Sydney. “We are seeing more interstate investor interest in this pocket,” said Stamatopoulos. “There’s great value here and buyers are responding.” For the sellers, the sale was bittersweet.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/comic-con-s-best-activations-20250728-p5mib8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Comic-Con’s best activations",
        "publish_date": "Mon, 28 Jul 2025 11:05:17 +1000",
        "category": "finance",
        "authors": [],
        "text": "Comic-Con’s best activations\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/motorsport/verstappens-dad-grilled-about-horner-exit-20250728-p5miba.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Verstappen's dad grilled about Horner exit",
        "publish_date": "Mon, 28 Jul 2025 11:00:21 +1000",
        "category": "finance",
        "authors": [],
        "text": "Verstappen's dad grilled about Horner exit\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/plane-collision-major-airport-205943828.html",
        "title": "Plane in collision at major airport",
        "publish_date": "2025-07-28T02:06:56Z",
        "category": "finance",
        "authors": [
            "Alexandra Feiam"
        ],
        "text": "Plane in collision at major airport\n\nA Virgin Australia aircraft was damaged after a tug collided with the side of the plane. Picture: NewsWire / Nicholas Eagar\n\nA Virgin Australia aeroplane has collided with a vehicle during a ground transfer at a major Melbourne airport.\n\nThe Virgin Australia Boeing 737 was being towed to the hangar for maintenance at Melbourne Airport in Tullamarine on Sunday night.\n\nA Virgin Australia aircraft was damaged after a tug collided with the side of the plane. Picture: NewsWire / Nicholas Eagar\n\nDuring the tow, the aircraft became disconnected from the tug vehicle, causing the two to collide.\n\nThe tug hit the side of the plane, causing a large tear in the side of the aircraft.\n\nCrews were on the scene attempting to patch the impacted aircraft.\n\nA Virgin plane at the maintenance hangar on Monday morning. Picture: NewsWire / Luis Enrique Ascui\n\nVirgin said the incident would not impact flights on Monday. Picture: NewsWire / Luis Enrique Ascui\n\n“The aircraft was being towed to the maintenance hangar, so there were no passengers on board,” a Melbourne Airport spokesman told NewsWire.\n\n“An investigation is under way, and the relevant authorities have been notified.”\n\nA Virgin spokesman confirmed the collision would not impact the airline’s flight schedule for Monday.",
        "source": "Yahoo"
    }
]