[
    {
        "url": "https://www.9news.com.au/national/australia-credit-card-debt-interest-rates/94c5d8d2-2987-4e81-b132-95a231ef97d7",
        "title": "Record spending leads to Aussies facing immense credit card debt",
        "publish_date": "Mon, 12 Jan 2026 23:58:31 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Nearly $30 billion was put on credit cards during the month alone as Aussies looked to get ahead buying their\n\nChristmas\n\npresents, according to data from Canstar.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/adelaide-writers-week-director-louise-adler-quits-after-palestinian-writer-randa-abdelfattah-canned/15d14d65-5661-4ddc-aa1a-a818912c6e66",
        "title": "'I cannot be party to silencing writers': Adelaide Writers' Week director quits over ruinous axing",
        "publish_date": "Mon, 12 Jan 2026 23:24:00 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "The Adelaide Writers' Week has plummeted into even further disarray after its director resigned over the board's decision to dump an Australian-Palestinian author from the event .\n\nIn a letter published in The Guardian , Louise Adler accused the Adelaide Festival Board of going over her head to uninvite Randa Abdel-Fattah due to cultural insensitivities in light of the December 14 attack at Bondi Beach, which triggered more than 180 writers to withdraw in protest.\n\n\"The Adelaide festival board's decision – despite my strongest opposition – to disinvite the Australian Palestinian writer Randa Abdel-Fattah from Adelaide writers' week weakens freedom of speech and is the harbinger of a less free nation, where lobbying and political pressure determine who gets to speak and who doesn't,\" she said.\n\nREAD MORE: ﻿ Day of mourning date for Bondi terror attack revealed\n\nAustralian-Palestinian author Randa Abdel-Fattah. (James Brickwood)\n\n\"I cannot be party to silencing writers so, with a heavy heart, I am resigning from my role as the director of the AWW.\n\n\"Writers and writing matters, even when they are presenting ideas that discomfort and challenge us.﻿\"\n\nAdler said artists are being stifled as a result of increasing pressure from \"pro-Israel lobbyists, bureaucrats and opportunistic politicians\", adding that there have never been any major issues from attendees in the event's 65-year history.\n\n\"Hence, in 2026, the board, in an atmosphere of intense political pressure, has issued an edict that an author is to be cancelled,\" she said.\n\n\"AWW is the canary in the coalmine.\"\n\nLouise Adler has resigned as director of the Adelaide Writers' Festival. (Supplied)\n\nThe former director is the fifth resignation this week , following Adelaide Festival Board members Donny Walford, Nicholas Linke, and Daniela Ritorto and chair ﻿Tracey Whiting.\n\nWhiting said \"recent decisions were bound by certain undertakings\" and her departure allows the organisation to \"refresh its leadership and its approach to these circumstances\".\n\nAdler confirmed more than 180 writers, ﻿including former New Zealand prime minister Jacinda Ardern, Pulitzer Prize-winning writer Percival Everett, Booker Prize-shortlisted British author Zadie Smith and former Greek finance minister Yanis Varoufakis﻿, have pulled out of Adelaide Writers' Week following the board's decision.\n\nREAD MORE: ﻿ Kevin Rudd quits as US ambassador a year early\n\nMore than 180 writers have pulled out of the Adelaide Writers' Week. (9News)\n\nIt is unclear if the event, ﻿which runs from February 28 to March 5, will be able to go ahead as planned this year.\n\nAdelaide Festival Corporation executive director Julian Hobba said the organisation is \"navigating a complex and unprecedented moment\" following extraordinary backlash over the board's decision last week to cancel Abdel-Fattah's appearance.\n\n\"Whilst we do not suggest in any way that Dr Randa Abdel-Fattah's or her writings have any connection with the tragedy at Bondi, given her past statements we have formed the view that it would not be culturally sensitive to continue to program her at this unprecedented time so soon after Bondi,\" the board said in a statement on January 8. ﻿\n\nAbdel-Fattah previously made comments against Zionists, saying they are\"murderous\" and have \"no claim or right to cultural safety\".\n\nThe writer has since ﻿engaged lawyers as she seeks an explanation for the decision to cancel her scheduled event.\n\nIn a letter to the board, Marque Lawyers managing director Michael Bradley wrote that Abdel-Fattah was not aware her participation was under question until she received ﻿notice she had been removed on January 8.\n\nThe notice also failed to mention that her past statements contributed to their decision. ﻿\n\nThe Adelaide Writers' Week brings in more than 160,000 attendees each year. (Nine)\n\nSouth Australian Premier ﻿Peter Malinauskas offered his opinion to the board in support of removing Abdel-Fattah from the event, but said he did not instruct them to remove her from the event.\n\nIn 2023, he admitted he was upset by ﻿one writer's social media posts and thought about withdrawing funding from the Adelaide Writers' Week, but decided against interfering with the program.\n\n\"(When) politicians decide what is culturally appropriate… it leads us to a future in which politicians can directly stifle events that are themselves predicated on freedom of speech and the expression of ideas,\" he said.\n\n\"A path, in fact, that leads us into the territory of Putin's Russia.﻿\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/social-media-mental-health-for-teens-study-finds-complex-changes/deeec44a-ba65-46e0-b896-abb63c4b04af",
        "title": "Surprise findings on how social media affects kids' mental health",
        "publish_date": "Mon, 12 Jan 2026 18:22:41 +0000",
        "category": "lifestyle",
        "authors": [
            "Jan"
        ],
        "text": "As Australian kids and teens start their first full year barred from social media , a new study has shed more light on how it affects young peoples' health.\n\nThe ban, which came into force on December 10, means age-restricted social media platforms need to take reasonable measures to prevent under-16s in Australia from opening a new account or accessing a pre-existing one.\n\nFacebook, Instagram, Kick, Reddit, Snapchat, Threads, TikTok, Twitch, X (formerly Twitter), and YouTube are all considered to be age-restricted platforms.\n\nSocial media has a complex relationship with the mental health of teens and children. (Getty)\n\nBut a new Adelaide University study suggested the question of social media's impact on children's mental health was more complex than anticipated.\n\nResearchers analysed the wellbeing and after-school social media usage of more than 100,000 Australian children in grades 4 to 12 over three years.\n\nThey were all categorised as non-users, moderate users, or high users of social media.﻿\n\nModerate use of social media has been linked to better mental health in older girls. (Getty)\n\nFor girls, non-﻿users displayed the highest levels of well-being among grades 4 to 6, but by middle school, moderate users had the best well-being.\n\nHigh usage was consistently linked to poor mental health among girls in general.﻿\n\nAmong boys, the researchers found moderate users and non-users had similar wellbeing outcomes up to grade 6, but from grade 7 onwards, non-used was increasingly linked to poor mental health.\n\nThe social media ban covers a lot of popular platforms. (Getty)\n\nFor grades 10 to 12, non-use was a bigger factor in poor mental health for boys than high usage.\n\nResearchers said the findings showed both heavy use and social media abstinence may have risks for young people, who are at risk of social isolation.\n\nNonetheless, the federal government has hailed the ban as a world first and it has been noted by countries around the world, with global leaders suggesting they may enact their own version depending on how Australia's goes.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/donald-trump-references-to-impeachments-removed-from-smithsonian-us/c45728d0-ef67-4e65-8f21-d9018d53f1b1",
        "title": "Impeachments info removed from Smithsonian's Trump portrait",
        "publish_date": "Mon, 12 Jan 2026 01:03:47 +0000",
        "category": "entertainment",
        "authors": [
            "Jan"
        ],
        "text": "US President Donald Trump's photo portrait display at the Smithsonian's National Portrait Gallery has had references to his two impeachments removed, the latest apparent change at the collection of museums he has accused of bias as he asserts his influence over how official presentations document US history.\n\nThe wall text, which summarised Trump's first presidency and noted his 2024 comeback victory, was part of the museum's \"American Presidents\" exhibition. The description had been placed alongside a photograph of Trump taken during his first term.\n\nNow, a different photo appears without any accompanying text block, though the text was available online. Trump was the only president whose display in the gallery, as seen Sunday, did not include any extended text.\n\nUS President Donald Trump's new portrait in the Smithsonian. (AP)\n\nThe White House did not say whether it sought any changes.\n\nNor did a Smithsonian statement in response to Associated Press questions.\n\nBut Trump ordered in August that Smithsonian officials review all exhibits before the nation celebrates the 250th anniversary of the Declaration of Independence on July 4.\n\nhe Republican administration said the effort would \"ensure alignment with the president's directive to celebrate American exceptionalism, remove divisive or partisan narratives, and restore confidence in our shared cultural institutions.\"\n\nTrump's original \"portrait label,\" as the Smithsonian calls it, notes Trump's Supreme Court nominations and his administration's development of COVID-19 vaccines.\n\nThat section concludes: \"Impeached twice, on charges of abuse of power and incitement of insurrection after supporters attacked the US Capitol on January 6, 2021, he was acquitted by the Senate in both trials.\"\n\nThe exhibit has had text referring to Trump's impeachments removed. (AP)\n\nThen the text continues: \"After losing to Joe Biden in 2020, Trump mounted a historic comeback in the 2024 election. He is the only president aside from Grover Cleveland (1837– 1908) to have won a nonconsecutive second term.\"\n\nAsked about the display, White House spokesman Davis Ingle celebrated the new photograph, which shows Trump, brow furrowed, leaning over his Oval Office desk. Ingle said it ensures Trump's \"unmatched aura ... will be felt throughout the halls of the National Portrait Gallery\".\n\nThe portrait was taken by White House photographer Daniel Torok, who is credited in the display that includes medallions noting Trump is the 45th and 47th president.\n\nSimilar numerical medallions appear alongside other presidents' painted portraits that also include the more extended biographical summaries such as what had been part of Trump's display.\n\nThe Smithsonian in Washington, DC. (Getty)\n\nSitting presidents are represented by photographs until their official paintings are commissioned and completed.\n\nIngle did not answer questions about whether Trump or a White House aide, on his behalf, asked for anything related to the portrait label.\n\nThe gallery said in a statement that it had previously rotated two photographs of Trump from its collection before putting up Torok's work.\n\n\"The museum is beginning its planned update of the America's Presidents gallery which will undergo a larger refresh this Spring,\" the gallery statement said.\n\n\"For some new exhibitions and displays, the museum has been exploring quotes or tombstone labels, which provide only general information, such as the artist's name.\"\n\nOne of Trump's impeachments was over the US Capitol riot. (AP)\n\nFor now, references to Presidents Andrew Johnson and Bill Clinton being impeached in 1868 and 1998, respectively, remain as part of their portrait labels, as does President Richard Nixon's 1974 resignation as a result of the Watergate scandal.\n\nAnd, the gallery statement noted, \"The history of Presidential impeachments continues to be represented in our museums, including the National Museum of American History.\"\n\nTrump has made clear his intentions to shape how the federal government documents US history and culture.\n\nHe has offered an especially harsh assessment of how the Smithsonian and other museums have featured chattel slavery as a seminal variable in the nation's development but also taken steps to reshape how he and his contemporary rivals are depicted.\n\nTrump replaced Joe Biden's portrait in the White House with the picture of an autopen. (Margo Martin/X via CNN Newsource)\n\nIn the months before his order for a Smithsonian review, he fired the head archivist of the National Archives and said he was firing the National Portrait Gallery's director, Kim Sajet, as part of his overhaul. Sajet maintained the backing of the Smithsonian's governing board, but she ultimately resigned.\n\nAt the White House, Trump has designed a notably partisan and subjective \"Presidential Walk of Fame\" featuring gilded photographs of himself and his predecessors – with the exception of Biden, who is represented by an autopen – along with plaques describing their presidencies.\n\nThe White House said at the time that Trump himself was a primary author of the plaques.\n\nNotably, Trump's two plaques praise the 45th and 47th president as a historically successful figure while those under Biden's autopen stand-in describe the 46th executive as \"by far, the worst President in American History\" who \"brought our Nation to the brink of destruction.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-13/mount-alexander-transmission-tower-fire-damage-tv-radio-outage/106223674",
        "title": "Fire at Mount Alexander silences central Victoria broadcasts",
        "publish_date": "Tue, 13 Jan 2026 02:06:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Free-to-air television and radio services across central Victoria face prolonged disruptions after fire severely damaged transmission infrastructure on Mount Alexander.\n\nIt is understood the outages impact broadcasts from the River Murray to the northern suburbs of Melbourne.\n\nThe two transmission sites on Mount Alexander, which broadcast free-to-air television and FM radio including ABC Local Radio, were badly damaged by a fast-moving grass fire that swept through Harcourt on Friday night.\n\nThe blaze has razed three businesses and at least 47 homes, and remains of concern to emergency management authorities.\n\nVictorian fires live updates: Read our blog for the latest news as out-of-control bushfires continue to burn.\n\nA portable transmitter has been installed in Bendigo to restore ABC Local Radio on 91.1 FM, while local radio and TV remain accessible via the ABC Listen app and ABC iview.\n\nBroadcast technicians travelled to Mount Alexander on Tuesday morning to assess the damage and develop a short-term plan to reinstate services.\n\n\"It's a very significant loss,\" said BAI Communications operations manager Chris Howe.\n\n\"Temporary services are days to weeks away, that's for certain.\n\n\"The permanent recovery or the more long-term recovery will happen over the course of months.\"\n\nBAI Communications owns and runs the transmission tower which broadcasts ABC radio and television, as well as SBS TV.\n\nThe road ahead\n\nTechnicians will conduct a full examination of the fire-damaged site in the coming days.\n\nThe inside of the transmission tower has been blackened by fire. (Supplied: WIN TV Facebook)\n\nIt is understood the fire damaged both antennas and power systems, and that redundancy plans including backup generators were unable to continue powering the stations.\n\nMr Howe said he understood the community concern and noted it would likely take months for the site to return to full operational level.\n\n\"The service from Mount Alexander would reach all the way up to the River Murray and down to the northern suburbs of Melbourne,\" he said.\n\n\"I think we need to sort of get a message out to the community to bear with us. We know the transmitter is down. We're working very hard to get it back on the air.\"\n\nScores of businesses affected as bushfire destroys beloved storage facility More than 90 businesses used the coolstore in the central Victorian town of Harcourt to store wine, beer, apples, and other produce. Now it's gone.\n\nMr Howe said more would be known about the timeline to recovery next week once technicians had inspected the site.\n\nHe urged residents not to pay for unnecessary antenna repairs, explaining the outage was caused by the damaged transmission site.\n\nFor people in the immediate Bendigo area, ABC Local Radio can be heard on 91.1 FM.\n\nThe temporary Bendigo transmitter is lower-powered, serving Bendigo well but leaving some surrounding areas with limited reception.\n\nListeners outside Bendigo can stay informed by tuning to ABC Wimmera on 594 AM.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-13/sa-peter-malinauskas-emotional-in-press-conference/106224030",
        "title": "'I do my best to settle my conscience': SA Premier becomes emotional during press conference",
        "publish_date": "Tue, 13 Jan 2026 01:48:32 +0000",
        "category": "sports",
        "authors": [],
        "text": "South Australian Premier Peter Malinaukas has become tearful during a media conference where he faced extensive questions about the crisis surrounding Adelaide Writers' Week (AWW) and allegations of homophobia against Adelaide United made by former player Josh Cavallo.\n\nIt followed former AWW director Louise Adler's resignation from her position on Tuesday morning.\n\nMr Malinauskas continued to defend and support the Adelaide Festival board's decision to cancel the appearance of Palestinian-Australian author Randa Abdel-Fatteh at AWW.\n\n\"If Writers’ Week seeks my views on things, and I certainly offered them, it's up to them whether or not what decisions they make and they get held account for them accordingly,\" he said.\n\nThe premier then began to choke back tears when asked about a series of topics, including about footballer Josh Cavallo's allegations against his former club Adelaide United.\n\nHe was then asked whether his response to Crows player Izak Rankine's homophobic slur had been strong enough.\n\nPeter Malinaukas was asked aboutAdelaide Writers' Week (AWW) and other matters on Tuesday. (ABC News)\n\nMr Malinauskas said he had faced criticism \"for being too strong\" and \"for not being strong enough\".\n\n\"On all these things, I do my best to settle my conscience and offer a view that I believe is consistent with the interests of compassion and advancing the cause of people treating each other with decency and humanity, regardless of their background,\" he said.\n\nWhen the AFL was investigating the incident in August, Mr Malinauskas said while there was no place for homophobia in society and on the footy field, he did not want to add to a pile on against Rankine.\n\n\"I just want to make sure that any sort of response to it acknowledges the severity of what is being alleged but [at] the same time doesn't unnecessarily demonise someone who's obviously expressed contrition,\" he said.\n\n\"There's a young man who's made mistakes.\"\n\n\"...If you're in the public eye, whether you're in politics or a professional footballer, if someone's made a mistake and they've acknowledged it, they'd be punished accordingly and I just don't feel the need to make Izak Rankine feel any worse than he probably does.\"\n\nHe said he had little detail about Cavallo's allegations \"but just as a matter of general principle, treating one another with compassion and decency is fundamentally important\".\n\nEarlier on Tuesday, Ms Adler announced her resignation in an explosive open letter, saying she \"could not be party to silencing writers\".\n\n\"A writer is to be cancelled after pressure from pro-Israel politicians, bureaucrats, and opportunistic politicians,\" she wrote in The Guardian.\n\n\"South Australia's tourism slogan could be 'Welcome to Moscow on the Torrens'.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-13/josh-cavallo-calls-out-adelaide-united/106222918",
        "title": "Josh Cavallo alleges Adelaide United was homophobic",
        "publish_date": "Mon, 12 Jan 2026 23:37:20 +0000",
        "category": "sports",
        "authors": [],
        "text": "Josh Cavallo, Australia's first openly gay male professional footballer, has alleged his former club was homophobic, something it denies.\n\nIn a statement posted on social media, the 26-year-old described the circumstances surrounding his departure from Adelaide United in May 2025.\n\n\"It's hard to swallow when I realised my own club was homophobic,\" he said.\n\nWhen Cavallo's contract ended with Adelaide United, the club said he was leaving to pursue an opportunity overseas after playing 49 matches over five seasons.\n\nCavallo publicly announced he was gay in October 2021 in an emotional video released by the club.\n\nOn Tuesday, Cavallo said in the lead-up to his exit, his contribution was \"continuously ignored\" in the club, which affected his wellbeing.\n\n\"For the first time, I actually questioned if I should have kept my sexuality a secret,\" he said.\n\n\"This brought up fears I had about coming out publicly, that being myself would affect my career.\"\n\nClub 'rejects' allegations\n\nIn a statement, Adelaide United said it was \"extremely disappointed by the claims made and categorically rejects the allegations, including any suggestion that Adelaide United is homophobic\".\n\nThe club is set to take part in its fourth Pride Cup on Saturday against Melbourne Victory at Hindmarsh Stadium.\n\nJosh Cavallo played for Adelaide United in 2021-2025. (ABC News: Brant Cumming)\n\n\"All on-field decisions relating to team selection are made solely on footballing grounds,\" the club's statement read.\n\n\"Adelaide United has always been committed to fostering an inclusive environment for players, staff and supporters, and we remain proud of our ongoing work to promote inclusion across football.\n\n\"Strengthening inclusivity must remain an ongoing focus for the game, and the club looks forward to hosting the fourth annual Pride Cup this weekend against Melbourne Victory.\"\n\nCavallo said it has taken him \"a while to digest\" how his time at the club ended but \"I think the fans deserve honesty\".\n\n\"Despite the way it ended behind the scenes, I refuse to let it ruin my connection to this city. Adelaide is where I found my wings,\" he said.\n\nSupport for player\n\nCavallo's post on Tuesday received a wave of supportive messages.\n\nNow playing for English club Stamford, the athlete has previously spoken out about receiving daily death threats since coming out.\n\n\"This fresh start in the UK has helped me breathe again, and I hope I can fall back in love with the sport that means everything to me,\" he said.\n\nJosh Cavallo proposed to his partner on the pitch at Hindmarsh Stadium in March 2024. (Instagram: Josh Cavallo)\n\nPride Cup chief executive Hayley Conway said Cavallo has shown \"immense courage\" in speaking out.\n\n\"At a time when LGBTIQ+ communities are facing increased hostility around the world, from the denial of medical care to violence, to the winding back of our rights, sport has a huge role to play in making society a safer place for everybody,\" she said.\n\n\"Together, we have so much more work to do.\"\n\nProfessional Footballers Association chief executive Beau Busch said Cavallo had been vital in creating a more inclusive environment in Australian football.\n\n\"Significant progress has been made thanks to the bravery of players like Josh, along with initiatives like this weekend's Pride Cup, and crucial advocacy and education provided by groups like Pride Cup,\" he said.\n\n\"However, it is equally important to acknowledge that there is still plenty of work to do to tackle homophobia in sport and across the broader community.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-13/alyssa-healy-overcomes-weight-of-name-to-become-cricket-great/106222886",
        "title": "As she hangs up her bat and gloves, Healy is set to conquer a new arena",
        "publish_date": "Mon, 12 Jan 2026 23:03:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "It's hard enough for women to be taken seriously in the sporting landscape.\n\nEven more so in 2010. And even more so when you're sporting the name of a men's legend.\n\nWhen Alyssa Healy arrived on the national scene, the immediate question was how much of her ascension was due to her skill and how much was due to her lineage as the niece of former men's Test wicketkeeper Ian Healy.\n\nBut it didn't take long to prove it was the former and she's done it for almost 20 years now.\n\nAlyssa Healy retiring from cricket after losing 'competitive edge' Australia captain Alyssa Healy announces she will retire from all forms of cricket after a multi-format series against India in February and March.\n\nIf the name wasn't enough, Healy was thrust into national headlines when she was just 16 for being the first girl named in the historically male first XI at the prestigious Barker College in Sydney's northern suburbs.\n\nAn email campaign allegedly started by a Barker old boy labelled the inclusion of a future Australian captain in the boys' team as \"disgraceful\" and \"an attack that cannot be accepted\".\n\nHealy said her favourite memory of her time at the school was laughing with her friends while watching the principal run from one end of the school to the other to do media interviews because of a \"scandal\" she caused.\n\nWho'd have thought a wicketkeeper named Healy would ever achieve more than Ian? (Getty Images: Michael Dodge)\n\nThat combination of skill to earn her place and sardonic wit to dismiss what wasn't worth her time helped her navigate her own awkward teenage years and also those of professional women's cricket in Australia.\n\nHealy, like Ellyse Perry and Phoebe Litchfield, has always spoken highly of her time playing with boys in representative and high school cricket teams.\n\nThey and others have spoken about how much it helped them in their early development, but Healy has never tried to dismiss the blindingly obvious that that is not every young girls' experience.\n\n\"If you're more comfortable playing with your mates, you can do that, but if not, you can play with the boys as an opportunity,\" she told Code Sports last year.\n\n\"I think there's pros and cons to both. I think if we want to keep more girls in the game, we keep them playing with their friends.\n\nAlyssa Healy warms up before a match in 2010. (Getty Images: Matt King)\n\n\"As the boys get bigger, stronger throughout the late teenage years, that poses a different challenge for us. And I think the girls that want to take up that challenge, I think is a really cool thing, but that's not necessary for everybody.\"\n\nDespite a largely positive experience, Healy described constantly having to prove herself as worthy of a seat at the table as a \"death by 1,000 cuts\" that left her with self-doubt that plagued her even after being picked for Australia just a few years after her high school exploits made the front page.\n\nHaving been plucked out of her casual KFC job to play 10 internationals before she was 20 and winning a T20 World Cup within months of her debut in 2010, Healy struggled mightily for runs and averaged in the mid teens in both ODIs and T20s for the first seven years of her career.\n\nShe recalls watching a teenage Meg Lanning burst onto the scene and blowing everyone away with a ton in her second ODI, another in India and then a 45-ball century in a cruisy nine-wicket win over New Zealand at North Sydney Oval in 2012.\n\nHealy was at the other end on 30 off the same number of deliveries and carried on to 62 off 69, which was then her highest ODI score, but she said watching Lanning made her question: \"Maybe I'm not good enough\".\n\nKnee, calf and hand injuries have sidelined Healy in the past few years. (Getty Images: Alex Davidson/ICC)\n\n\"I often link it back to being treated as never good enough all the time and I think that naturally leads to lower self-confidence,\" she told Yahoo Sport.\n\nPerhaps it was a blessing for her that those early struggles came before women's cricket became as big as it is now.\n\nFrom playing in kits made for men in front of tiny crowds with no broadcast deals, Healy and her Aussie team are now professional players, household names and able to fill out the MCG.\n\nRemarkably, considering her standing as an all-time great of Australian cricket, Healy's batting only truly flourished in late 2017, after going full-time professional with NSW and once she became a full-time opener in the limited-overs sides.\n\nShe's averaged over 45 in ODIs and over 30 in T20s in that time, clattering a then-record 148 not out in a 20-over game against Sri Lanka in 2019, as well as player-of-the-match efforts in the 2020 T20 World Cup final and 2022 50-over final.\n\nHer service to the team was recognised when Lanning, the woman who once so rattled Healy's own confidence, stepped away from the national captaincy in 2023.\n\nTahlia McGrath (right) has stepped into the captaincy multiple times in Healy's absence. (Getty Images: Matt Roberts/ICC)\n\nA few weeks of pointless speculation followed before Healy was confirmed as the obvious replacement, taking the reins in 40 games since then, with just four more left.\n\nRecently, injuries and the women's team's schedule have allowed us to get a glimpse into what is surely Healy's future.\n\nHer presence in the commentary box in the past few summers has been one of the smoothest transitions from player to broadcaster.\n\nThat is surely aided by regularly being on the player's mic during WBBL games and easing into that space via her podcast, Willow Talk.\n\nBut most of it can be attributed to Healy's own competence and sense of humour helping her ride the waves that have been crashing around her since she was a child.\n\nHaving carved out her own space in the Australian sporting landscape despite the weight of her last name, Healy has also managed her relationship with men's star fast bowler Mitchell Starc expertly.\n\nAlyssa Healy (left) and Mitchell Starc (right) have handled their public relationship expertly. (Getty Images: Robbie Stephenson/PA Images)\n\nThe pair have known each since they were both wicketkeepers in rep sides as kids in Sydney and married in 2016 to form one of the greatest sporting power couples this country has seen, spotted in the stands at one another's games whenever their busy schedules allowed it.\n\nHealy's role in the commentary box commentating on his game could be awkward to navigate for a less intelligent or assured person, but, particularly this summer, she has handled it brilliantly.\n\nIt would be pointless to ignore the fact she lived with the bloke taking 31 wickets across five Tests, but the conversation has never taken on the sort of \"I secretly hate my spouse\" tone of a 1990s sitcom that could be tempting and so easy to lean on for cheap comedy points.\n\nNor has she shied away from her pride and admiration of his exploits, all while maintaining her status as an expert in the field and a great of the game.\n\nIt's a tightrope walk to be sure, but nothing to write home about for a woman who's been on high wires for two decades.\n\nThis article's author is not related to Alyssa Healy in any way.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-13/adelaide-writers-week-director-louise-adler-resigns/106214928",
        "title": "Adelaide Writers' Week director resigns following author's removal",
        "publish_date": "Mon, 12 Jan 2026 22:07:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "The director of Adelaide Writers' Week (AWW) has resigned after days of furore regarding the decision to cancel a scheduled appearance by a Palestinian-Australian author.\n\nLouise Adler said the decision to cancel the appearance by Randa Abdel-Fattah was made by the Adelaide Festival board and came despite her \"strongest opposition\".\n\nSince Abdel-Fattah's appearance was cancelled, more than 180 participants have chosen to boycott Writers' Week — throwing the future of the event and the broader Adelaide Festival into doubt.\n\nIn an open letter published in The Guardian, Ms Adler said she could not be party to silencing writers.\n\nMs Adler, who is on the Jewish Council of Australia's advisory committee and is the daughter of Holocaust survivors, said Abdel-Fattah's appearance had been cancelled \"after pressure from pro-Israel lobbyists, bureaucrats and opportunistic politicians\".\n\n\"The increasingly extreme and repressive efforts of pro-Israel lobbyists to stifle even the mildest criticism has had a chilling effect on free speech and democratic institutions,\" she said.\n\nRanda Abdel-Fattah's appearance at Adelaide Writers' Week has been cancelled. (Supplied: Bendigo Writers Festival)\n\nAbdel-Fattah told ABC Radio Adelaide it was a \"tragedy\" that one of the most \"incredible directors and icons in Australia's cultural history\", Ms Adler, had felt she had to resign over the controversy.\n\n\"I think it's a tragedy it has come to this, it could easily have gone the other way,\" she said.\n\nOn Tuesday, SA Premier Peter Malinauskas reiterated his support for the board's decision to cancel the appearance, but said he did not have the power to direct the board.\n\n\"What Writers' Week does with this community is up to them. It's their event. Their decisions,\" he said.\n\n\"I can't speak for the board. I can't speak to the board.\"\n\nThe premier said he has not spoken with Ms Adler about Abdel-Fattah's inclusion on the AWW program.\n\n\"I have opened Writers' Week. I've stood up for Writers' Week, I've defended Louise Adler in the past,\" he said.\n\nAdelaide Writers' Week has faced a growing boycott. (Supplied: Adelaide Festival)\n\nMr Malinauskas has previously cited numerous anti-Israel and anti-Zionist social media posts by Abdel-Fattah in his support for the author's exclusion from AWW.\n\nThe ABC has contacted the SA government and the Adelaide Festival for responses.\n\nLast week, the board said while it was not suggesting Abdel-Fattah or her writing had any connection to the Bondi attack, based on her past statements, it would \"not be culturally sensitive\" to go ahead with her appearance at the festival, scheduled to begin on February 28.\n\nThe list of authors who have withdrawn from the event includes former New Zealand prime minister Jacinda Ardern, Trent Dalton, Peter Greste, Hannah Kent and Evelyn Araluen.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-13/us-federal-reserve-interest-rates-trump/106222076",
        "title": "Trump's attack on Federal Reserve 'extremely chilling'",
        "publish_date": "Mon, 12 Jan 2026 20:59:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Independent economist Chris Richardson — known for his considered economic analysis — didn't hold back.\n\n\"This will end in tears,\" he wrote on social media.\n\nHe's referring to a criminal probe into the chair of the US Federal Reserve, Jerome Powell.\n\nThe news broke worldwide around midday on Monday.\n\nAs a result, there is now a suggestion, by the US government no less, that the world's most powerful banker is a crook.\n\nThat, analysts have told the ABC, threatens to undermine trust in the US economy and its currency.\n\nThe implications for the global economy are unfathomable.\n\n'New threat' a 'pretext', says Powell\n\nWe learned on Monday that, on Friday of last week, the Department of Justice served the Federal Reserve (the Fed) with grand jury subpoenas.\n\nThe subpoena relates to his testimony before the Senate Banking Committee in June regarding the Fed's $US2.5 billion ($3.7 billion) renovation of two office buildings.\n\nThe New York Times reported the investigation late on Monday morning (eastern Australian time), and, about the same time, Jerome Powell issued a video statement defending the central bank's independence.\n\n\"This new threat is not about my testimony last June or about the renovation of the Federal Reserve buildings,\" he said.\n\nNotice how Powell said \"new threat\".\n\nWe will get to that shortly.\n\nFor now, Powell is simply telling it straight.\n\n\"It is not about Congress's oversight role; the Fed, through testimony and other public disclosures, made every effort to keep Congress informed about the renovation project,\" he said.\n\n\"Those are pretexts.\"\n\nTrust at stake\n\nThese next two lines from Powell are extraordinary.\n\n\"The threat of criminal charges is a consequence of the Federal Reserve setting interest rates based on our best assessment of what will serve the public, rather than following the preferences of the president,\" he said.\n\nHow China is outmanoeuvring Trump on tariffs When Jerome Powell let slip that US monetary policy was restricting the economy, Donald Trump unleashed a wave of buying on both stock and debt markets.\n\n\"This is about whether the Fed will be able to continue to set interest rates based on evidence and economic conditions — or whether instead monetary policy will be directed by political pressure or intimidation.\"\n\nPowell has drawn a line in the sand over the independence of the world's central bank.\n\nMore profoundly, if the Federal Reserve is perceived as not independent, it will lose the public's trust.\n\nIf that happens, there is a risk the US dollar loses its status as the world's reserve currency.\n\nThe global financial system is built on that trust.\n\n\"The world is built on trust, and this is a direct attack on the trust that the world can have in the US and its institutions — both its justice system and its central bank,\" independent economist Chris Richardson said.\n\n\" Such a spectacular unforced error could well come at a considerable cost to America and Americans over the longer term. \"\n\nRichardson adds that US central bank policy would lose credibility if it ceases to become independent.\n\n\"Much of the world took away the power to set interest rates away from politicians in recent decades,\" Richardson says.\n\n\"And for good reason: they have the impulse control of three-year-olds.\n\n\"Now it looks as if poor impulse control wants its rate-setting ability back.\n\n\"This won't end well.\"\n\nWeaponised monetary policy\n\nNow, about that \"new threat\".\n\nTrump has been an albatross around Powell's neck for months now.\n\nThe latest round of pressure relates to Trump's criticism of the round of renovations at the Federal Reserve headquarters in Washington.\n\nFew believe that's what Donald Trump is concerned about.\n\nThe price of gold has spiked. (ABC News: John Gunn)\n\nIndeed, the price of gold jumped to a record $US4,563.61 per ounce, as many sought the precious metal as a haven.\n\n\"Powell has had enough of the carping from the sidelines and is clearly going on the offensive,\" said Ray Attrill, head of FX strategy at National Australia Bank in Sydney.\n\n\"This open warfare between the Fed and the US administration — and to the extent that you take Powell's comments at face value — it's clearly not a good look for the US dollar.\"\n\nEx-Fed chair Yellen condemns probe\n\nThe news that one of their own has come under attack has drawn condemnation from former Fed chiefs.\n\nUS network CNBC reported that former Federal Reserve chair Janet Yellen said the investigation compromised the central bank’s independence.\n\nYellen reportedly added the news was \"extremely chilling\".\n\nReuters is also reporting the investigation was approved and started by Jeanine Pirro, the US Attorney in Washington and an ally of Trump's\n\nPlaying with fire\n\nJerome Powell's term ends in May, after which a new Trump appointment will lead the US Federal Reserve.\n\nBut Powell is due to continue as head of the bank's interest rate-setting committee, the FOMC.\n\nSo this appears to be a particularly overt attempt by Trump to attack the institution itself and its ability to set monetary policy.\n\n\"President Trump's move appears to be a last-ditch effort to pressure Jay Powell not only to end his term as chair in May, but also to step down concurrently from the FOMC, despite that term not expiring until January 2028,\" Betashares chief economist David Bassanese said.\n\n\"Trump is playing with fire in his repeated attempts to pressure the Fed into cutting rates.\n\n\"It risks backfiring if it undermines market confidence in the independence of the US Federal Reserve and pushes long-term bond yields higher.\"\n\nDamaging the Fed's independence would push longer-term interest rates higher because bond investors would see US debt as riskier — the riskier the debt, the higher the cost or yield of it.\n\nLoading\n\nA significant increase in US longer-term interest rates would be a wrecking ball through the economy.\n\n\"After all, in the US it is long-term rates — not the Fed's control over short-term rates — that determine mortgage rates and most corporate borrowing costs,\" David Bassanese said.\n\n\"Rumours that President Trump may nominate his economic adviser, Kevin Hassett, as the next Fed chair will do little to reassure markets about the Fed's independence.\"\n\nA major US economic downturn, a plummeting US dollar and unpredictable US interest rates would create global financial chaos.\n\nThe Australian economy would not escape that extraordinary economic downdraft.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-13/asx-markets-business-live-news-jan13-2026/106222930",
        "title": "Live: ASX rises after Wall Street rally despite Powell probe",
        "publish_date": "Mon, 12 Jan 2026 20:42:49 +0000",
        "category": "finance",
        "authors": [
            "Samuel Yang",
            "Emilia Terzon",
            "Jason Dasey",
            "Ben Butler"
        ],
        "text": "Australian stocks have started the day in positive fashion after investors on Wall Street mostly brushed aside concerns about the US Justice Department's criminal investigation of Federal Reserve chair Jerome Powell.\n\nWe'll bring you the latest on what's happening on the markets throughout the day in our live blog.\n\nDisclaimer: this blog is not intended as investment advice.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-13/australian-dual-citizens-bear-costly-brunt-of-uk-passport-change/106221062",
        "title": "New passport changes create headache for Australian British dual citizens",
        "publish_date": "Mon, 12 Jan 2026 20:17:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "British Australian retiree Ian Fletcher is meant to be going on a seven-week holiday to the United Kingdom with his wife Vicki in April, but it may not go ahead due to new passport rules.\n\nThe 61-year-old is one of many dual citizens who have expressed their frustration online after the UK government announced changes to passport regulations.\n\nIt prevents British/Irish dual citizens from entering the UK using a passport from a different country, such as an Australian passport.\n\nThey will have to use either a valid British or Irish passport, or another valid passport containing a certificate of entitlement (COE).\n\n\"It's quite frustrating for me as I am planning to travel Europe towards the end of April and I now have to rush to get a British passport, which I actually haven't held for 25 years,\" Mr Fletcher said.\n\n\" When you read the online documentation saying that a British passport could take between six and 13 weeks … we are really bordering on not making the flight. \"\n\nIan Fletcher is a keen traveller. (Supplied: Ian Fletcher)\n\nTo complicate matters more, Mr Fletcher has to get a copy of his UK birth certificate before he can apply for a British passport for identity verification purposes, which will cost him a few hundred dollars.\n\n\"I only have an Australian passport, and for 20 years only travelled on an Australian passport. I don't need a British passport,\" he said.\n\nIn the past financial year, 635,000 Australians visited the UK, according to the Australian Bureau of Statistics.\n\nHere is what you need to know about travelling to the UK as a dual citizen or traveller ahead of the changes being implemented next month.\n\nThe new dual citizen British passport rules explained\n\nFrom February 25, Australians visiting the UK will have to pay about $32 and apply for an electronic travel authorisation (ETA).\n\nHowever, British/Irish dual citizens are exempt and will no longer be able to use their Australian passport to get into the UK.\n\nAustralian/British/Irish dual citizens will have to carry two passports if they want to travel to the UK and return to Australia. (ABC News: Mary Lloyd)\n\nA COE is proof you have the right to abode in the UK, which all British citizens have.\n\nIt allows you to live and work in the country without immigration restrictions or a time limit, and is placed in your non-British passport.\n\nEvery time your passport has to be renewed, your COE does too.\n\nThe UK government recommends you do not book travel until you have your new and valid passport, as it will have a different number.\n\nIn a previous statement, the UK government described the changes as a \"significant step towards digitising the immigration system and paves the way for a contactless UK border in the future\".\n\nWhat costs are involved?\n\nAn adult Australian passport now costs more than $400 Here's all you need to know about new passport prices for Australians starting from January 1.\n\nThe changes have come as a surprise to many dual citizens, who will have to choose whether to pay for a British or Irish passport, the COE, or renounce their British citizenship.\n\nAdult British passport applications by Australian residents cost from 120 pounds, plus a 19-pound courier fee, amounting to about $280.\n\nThe cost of an adult Irish standard 10-year passport application by Australian residents is 75 euros with a 15 euros postal fee, totalling about $156.\n\nThe COE is the most expensive option, costing 589 pounds, or about $1,180 when applied for outside the UK.\n\nIt is also possible to renounce your British citizenship at a cost of 482 pounds, or $966.\n\nHow can I tell if I'm a dual citizen?\n\nWhether you are a dual citizen depends on the laws of Australia and your other country.\n\nYou may be a dual citizen if you:\n\nHave a parent who is a national of another country.\n\nMarry a national of another country.\n\nApply for and receive citizenship of another country and do not lose your Australian citizenship.\n\nRemain a citizen of another country and become an Australian citizen.\n\nWere born overseas.\n\nAustralian travellers will have to pay the cost of an ETA when going to the UK. (Reuters: Mina Kim)\n\nYou do not automatically lose your other citizenship when you become an Australian citizen.\n\nThere are often formal processes that have to be undertaken if you want to renounce your original nationality.\n\nYou can always check with your local embassy or consulate.\n\nWhat happens if I do not have valid documents?\n\nIf you do not have a valid passport or COE, you may not be able to board transport to the UK on or after February 25.\n\nWhat is the electronic travel authorisation?\n\nAn ETA gives permission for a person without UK immigration status or citizenship to travel to the country and visit for up to six months.\n\nThe reasons for visiting include seeing family or tourism.\n\nUnder the current rules, an Australian citizen does not need one to travel to the UK, but from February 25, they will.\n\nAn ETA usually costs 16 pounds ($32).\n\nEveryone in the family, including babies and children, must have an ETA.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-13/khancoban-smoke-victorian-bushfires/106219750",
        "title": "Tourists replaced by bushfire evacuees at border holiday town",
        "publish_date": "Mon, 12 Jan 2026 19:32:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Instead of hosting throngs of tourists keen to camp, hike and explore, the New South Wales Snowy Mountains town of Khancoban has become a refuge for Victorian residents who have evacuated their homes amid destructive bushfires.\n\n\"The tourists have all gone,\" local caravan park owner Tony Rowlinson said.\n\nThe residents of Khancoban, just north of the Victorian border, have been watching smoke drift over their town for days.\n\nWith the 2019–2020 Black Summer bushfires still front of mind, the plumes have been an uncomfortable sight for locals and tourists.\n\n\"The town has emptied out quite a bit,\" Mr Rowlinson said.\n\n\" Normally this would be a reasonably busy time of the year for us, so it's a bit of a ghost town. \"\n\nSmoke appears in Khancoban, which is normally teeming with visitors. (ABC Riverina: Melinda Hayter)\n\nWhile the tourists are gone, the town has had an influx of bushfire evacuees from the Victorian town of Corryong, 27 kilometres away, after it was issued with an evacuation order on Friday.\n\nExtra firefighters have also arrived in Khancoban, to help fight the fires across the border.\n\n\"There's a lot of people taking in those who needed to evacuate from across the border,\" Khancoban resident and Snowy Valleys councillor Grant Hardwick said.\n\n\" There's been a calm readiness. \"\n\nHelping hand\n\nAmong the evacuees is Cath Hill, who was holidaying at her family's farm at Corryong when she fled to Tumbarumba, an hour north of Khancoban.\n\nMs Hill left with her 90-year-old father, two kids and three dogs.\n\nShe said it was a \"waiting game\" as to when she may be able to return to Victoria, but feels well looked after in Tumbarumba.\n\nCath Hill (right) evacuated the family farm at Corryong with her kids, father and pets. (ABC Riverina: Melinda Hayter)\n\n\"If you're going to be anywhere, you might as well be in Tumbarumba … it's a town just like Corryong,\" she said.\n\n\"The ladies at the op shop wouldn't let us pay for anything when we needed supplies, we're probably single-handedly keeping the bakery open.\n\n\" It's a genuinely lovely place. \"\n\nA community-led donation site has been established in Tumbarumba, providing supplies such as canned goods and toiletries for those in need.\n\nThe Australian Red Cross is also providing mental health support onsite.\n\nA donation drop-off centre providing supplies to evacuees has been set up in Tumbarumba. (ABC Riverina: Melinda Hayter)\n\nPeter Makryllos from the Red Cross said several families had dropped by since the centre opened on Saturday.\n\n\"We know there's a lot of people in limbo, whether they're staying here or passing through,\" he said.\n\n\"People can come here, have a seat, have a feed and get whatever supplies they need.\"\n\nCalm and ready\n\nLocals expect smoke to remain in the Riverina region for the next few days, with hopes rain and cooler weather is on the way.\n\n\"There's a lot of that banding together to see this through,\" Mr Hardwick said.\n\n\"It is unfortunately a little bit of a waiting game, luck is on our side but things are subject to change.\"\n\nSnowy Valleys councillor and Khancoban resident Grant Hardwick. (ABC Riverina: Melinda Hayter)\n\nSummer trade is expected to again take a hit, as the bushfires persist.\n\nMr Rowlinson reopened his caravan park on Monday, but does not expect many tourists to return until the fires die down.\n\nHe said safety was the priority.\n\n\"We're safe but things can change at a drop of a hat.\n\n\"Buildings can be replaced but you need to look after your life.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/lost-that-competitive-edge-alyssa-healy-announces-retirement-from-cricket-20260113-p5ntjo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alyssa Healy’s decision to retire was made alone. She knew the time had come",
        "publish_date": "Tue, 13 Jan 2026 12:51:39 +1100",
        "category": "sports",
        "authors": [
            "Frances Howe"
        ],
        "text": "On Tuesday morning, Australian women’s cricket captain Alyssa Healy met her mum, dad and husband for a coffee before training. The trio have long been Healy’s counsel, but for the most important decision of her career, she had barely conferred with them.\n\nInstead, earlier that morning and without much input from anyone else, Healy’s retirement from all forms of cricket was announced. After next month’s multi-format series against India, she will retire as captain, some 16 years after making her debut for the national team.\n\nAustralian cricket captain Alyssa Healy calls time on her career. Credit: KATE GERAGHTY\n\n“I just made it and told them, and off we went,” Healy said at NSW Cricket headquarters at Sydney Olympic Park on Tuesday.\n\nSome mental fatigue had been dawning on Healy’s career, and that is what calcified the 35-year-old’s decision before anyone else could have a say.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/playground-surfaces-up-to-63-degrees-20260112-p5nt8i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Playground surfaces up to 63 degrees",
        "publish_date": "Tue, 13 Jan 2026 12:16:48 +1100",
        "category": "finance",
        "authors": [],
        "text": "Playground surfaces up to 63 degrees\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/how-alyssa-healy-took-her-chance-and-launched-a-golden-era-for-australian-women-s-cricket-20260113-p5ntld.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Alyssa Healy took her chance and launched a golden era for Australian women’s cricket",
        "publish_date": "Tue, 13 Jan 2026 11:56:13 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "With a typically cheeky quip about the need to spend more time on her golf, Alyssa Healy drew the curtain on one of Australian cricket’s most game-changing careers.\n\nIt was not a huge surprise to hear that Healy, 35, had decided now was the time to give up cricket, with a farewell series against India to give supporters one final chance to salute her.\n\nAlyssa Healy announced her retirement from international cricket on Tuesday. Credit: Kate Geraghty\n\nInjuries had afflicted each of her past two World Cup campaigns for Australia, neither of which ended with the world’s most feared team reaching the tournament final. The side is regenerating, and Healy’s exit will advance that process.\n\nBut there can be no doubt that its future direction will be shaped in large part by the type of aggressive, barnstorming cricket that Healy had done so much to embed as the trademark of the most trophy-laden national sporting team on the planet.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/climate-change/fires-floods-swimsuits-and-jumpers-in-one-day-climate-whiplash-is-our-new-normal-20260113-p5ntlb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fires, floods, swimsuits and jumpers in one day: ‘Climate whiplash’ is our new normal",
        "publish_date": "Tue, 13 Jan 2026 11:54:09 +1100",
        "category": "finance",
        "authors": [
            "Samantha Selinger-Morris"
        ],
        "text": "Click the player below to listen to the full episode , or read on for an edited extract of the conversation.\n\nSpeaking with host Samantha Selinger-Morris on The Morning Edition podcast , David Bowman , a professor of pyrogeography and fire science at the University of Tasmania, explains what causes this “climate whiplash” – and what we can do to handle the “diabolical and escalating threat” of climate change that is worsening our extreme weather .\n\nSelinger-Morris: One thing I really wanted to ask you about, which I think a lot of Australians would have been thinking about in particular over the last few days, is the wildly different weather we’re seeing at the same time. So you’ve got bushfires in one part of the country ... then you’ve got floods and cyclones in Queensland. Meanwhile, I’m recording in Sydney and within about 24 hours just the other day, we went from searing temperatures over 40 degrees to then quickly needing jumpers. Why is this happening?\n\nLoading\n\nBowman: We’re seeing this extraordinarily unstable climate ... [what] we’re learning as we’re going is that the Earth system and the climate system is really very complicated.\n\nWhen you start putting more energy into the atmosphere … the energy expresses itself in extraordinary ways. So we have, as we know, these extraordinary downpours and flooding events, we have these periods of just amazing rain.\n\nWe’re seeing this as well in California. So you get these very wet periods, you get flooding. You can get an interaction of the flooding with burnt areas. And then before you know it, you can switch back to drought ... and then, to add insult to injury, we’ve been getting these incredible windstorms, and windstorms go with wind-driven fires, and wind-driven fires are just the worst because they move so quickly.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/consumer-affairs/ai-bots-could-collude-to-fix-prices-and-harm-consumers-accc-chair-20260112-p5nteb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AI bots could collude to fix prices and harm consumers: ACCC chair",
        "publish_date": "Tue, 13 Jan 2026 11:53:24 +1100",
        "category": "finance",
        "authors": [
            "Elias Visontay"
        ],
        "text": "Consumer tsar Gina Cass-Gottlieb has sounded a warning over the proliferation of artificial intelligence systems in online retail, saying bots deployed by rival businesses could collude to fix prices.\n\nSpeaking to this masthead, the Australian Competition and Consumer Commission (ACCC) chair highlighted the risks of AI “agents” or bots, which will be a key focus for the watchdog this year.\n\nAI-powered bots can act on behalf of consumers, but there is a risk they are tricked into higher-cost deals. Credit: Michael Howard\n\nAs well as highlighting the risk of cartel conduct by AI-powered bots, Cass Gottlieb also warned of AI’s potential to “supercharge” scams, and an emerging trend among companies of overplaying the extent to which machine learning actually features in their software or products to justify charging consumers more, in a practice dubbed “AI washing”.\n\nCass-Gottlieb said a key concern for the regulator in 2026 would be the rise of AI agents, which have risen in prominence over the past year as tech companies race to release more sophisticated models.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/apple-s-gemini-deal-a-win-for-google-but-will-it-make-your-iphone-smarter-20260113-p5ntk7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Apple’s Gemini deal a win for Google, but will it make your iPhone smarter?",
        "publish_date": "Tue, 13 Jan 2026 11:49:02 +1100",
        "category": "finance",
        "authors": [
            "Tim Biggs"
        ],
        "text": "Apple’s future artificial intelligence (AI) features, including a revamped Siri assistant due to arrive this year, will be powered by Google as the two tech giants have announced an agreement that could potentially shake up how AI works in smartphones.\n\nThe specifics of the deal are still unclear, with a brief joint statement from the two companies saying only that the next generation of Apple AI models will be based on Google technology, but will continue to use Apple’s “Private Cloud Compute” architecture. The statement was published on Google’s blog.\n\nApple’s iPhones will soon be powered by new AI features built on Google tech.\n\nThe announcement comes after years of pressure from analysts and investors for Apple to plug a perceived AI gap, with the company drip-feeding elements of its “Apple Intelligence” suite and delaying its new Siri while competitors raced ahead with experimental generative AI.\n\nThe development is obviously a win for Google, and for Wall Street’s AI hype-pushers. Parent company Alphabet briefly broke above a $US4 trillion ($5.9 trillion) market capitalisation on Tuesday as shares rose 1.7 per cent following the announcement, making it the second-largest firm after Nvidia.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/emotional-hunter-elated-with-aus-open-return-win-20260113-p5ntno.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Emotional' Hunter elated with Aus Open return win",
        "publish_date": "Tue, 13 Jan 2026 11:48:34 +1100",
        "category": "sports",
        "authors": [],
        "text": "'Emotional' Hunter elated with Aus Open return win\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/the-simple-fix-that-is-saving-the-lives-of-very-young-children-from-drowning-20251014-p5n2gj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The simple fix that is saving the lives of very young children from drowning",
        "publish_date": "Tue, 13 Jan 2026 11:45:00 +1100",
        "category": "finance",
        "authors": [
            "Julie Power"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size What’s in a name? If you are the celebrated Professor Jagnoor Jagnoor, it adds up to a legacy of defying racist, religious and sexist stereotypes. A question about her name is one that Jagnoor, an epidemiologist and the head of injury prevention at the George Institute for Global Health, anticipates when we arrange lunch at Mediterranean-influenced restaurant St Siandra, near the Spit Bridge in Sydney. It is often the first thing others ask the global drowning prevention expert or quietly ask people who know her before they meet. Despite knowing Jagnoor for a decade while reporting on water safety, I have never questioned her about it. (Maybe it is because my full name is Julie Anne Julie Power, a weird family story.) Jagnoor’s name was a snub to convention by her mother, Dr Manmeet Kaur, a health promotion educator. Called a tautonym, it is a bit like being called Thomas Thomas. Unusual for India, it was her mother’s way of rejecting the practice of naming a child in a way that immediately pigeonholes religion and caste. “[My mother] was progressive for her time,” says Jagnoor, who moved to Australia more than 20 years ago to do a master’s degree in public health (and ended up staying, marrying and having two children). Between delays caused by roadworks, Mosman Council’s temperamental parking meters, the arrival of photographer Edwina Pickles, and me getting lost, it takes us time to settle into St Siandra and order.\n\nAdvertisement\n\nJagnoor chose the restaurant because it is near water, the foundation of civilisation, a source of joy to many, and sorrow to the families of the 300,000 around the world who fatally drown every year. She has been instrumental in reducing drowning rates in parts of the world where the equivalent of a kindy class of children aged one to five from the poorest of families fatally drowns every week. That compares with one kindy class a year in Australia. Jagnoor chose a restaurant near water, a source of life but also heartache. Credit: Edwina Pickles The fix? Jagnoor worked with local communities to establish small free creches that provide supervision and preschool education for children who live near ponds and other water bodies while their mothers work. It lifts all boats. Described by Jagnoor as the “least glamorous fix for the biggest ripple effect”, these creches reduce the risk of drowning by more than 80 per cent, improve the employment of women, and kickstart the education of young children. But more on that later. To start with, Jagnoor recommends the flat bread, something she makes three times a day. “Food is a love language,” she says. Everything in her home is made with ginger and garlic, she confides, a precursor to a delightful discussion about the joys of Indian lime pickle.\n\nAdvertisement\n\nOver the potato flatbread with smoked garlic and some roasted cauliflower, both as good as she promised, Jagnoor sums up her backstory. An only child, she was born in Chandigarh in north-western India to two progressive academics in an era when India appeared to be embracing the Chinese one-child policy that also favoured boys over girls. Potato flatbread at St Siandra. Credit: Edwina Pickles If her parents had followed Sikh convention, her surname would’ve been Kaur. “My mother thought: ‘I have one child. I have a daughter, and I’m not going to give her a surname. It represents your religion and your caste. And if you want to have equity in society, you don’t want to have those hierarchies’.” “She always said, ‘I never want you to be boxed in, I would like you to be a global citizen’. “You were born a human,” her mother told Jagnoor. “We all are, and then we are tagged and labelled in different ways. I would like you to die a human.” “I hold that dear to my heart,” Jagnoor says.\n\nAdvertisement\n\nJagnoor – a vegetarian – orders the eggplant katsu, and I order the hanger skewers and a salad. We both drink tap water. When her main course arrives, I have FOMO. The eggplant is crunchy and crisp, and when she cracks it open, it oozes with creaminess. She gives me a taste. Then another. My skewers are good, but not quite as delicious. Over lunch and follow-up chats, Jagnoor talks about prejudice towards people with brown skin in global research, and a bias that results in academics from the Global North being deferred to and given first credit rather than local experts. The eggplant is crisp on the outside but creamy inside. Credit: Edwina Pickles As someone who lives in Castle Hill but was born in India, who works in Sydney (at the George Institute and UNSW) but travels to the subcontinent for work and family, Jagnoor sees herself as a kind of “double agent” able to navigate both worlds. Australia is home to more than 900,000 people born in India, the most recent census found, and Indians are one of the nation’s fastest-growing population groups. Jagnoor, voted one of the 40 most influential Asian-Australians under 40 a few years ago, says they are underrepresented in leadership roles like hers.\n\nAdvertisement\n\nOriginally graduating as a dental surgeon in India, hearing an interview about an undertaker who worked in Delhi’s slums changed her life. The undertaker said he had found a little girl cuddling her dead father’s body, seeking warmth in Delhi’s bitter winter. “Because there was no clothing, no blankets,” Jagnoor explains. “It was that level of poverty and inequity in a city that has so much affluence.” Raised to believe that health and education are great equalisers, she switched to studying a master’s in public health at Sydney University, intending to devote herself to overcoming inequality. While undertaking a doctorate and coming across a chart relating to the so-called Million-Death Study, which identifies the causes of death in India, she found her calling. “I realised that ... drowning is the leading cause of death for children aged one to three,” she says. The chart that opened Jagnoor Jagnoor’s eyes, showing the steep rise of children who died from drowning from one to five in India Credit: Jagnoor Jagnoor “I was looking at a line diagram – I still have that figure right in front of my eyes – where on your X axis, you have your age groups, and you’re looking at zero to one, one to two, etc. and you see this steep line going up. “And you look at that variable, and the cause of death is drowning. That number, having that evidence, was definitely the triggering thing.”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/rozlyn-hand-cut-73-000-pieces-of-glass-for-the-qvb-now-the-landlord-wants-them-removed-20260108-p5nsmi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rozlyn hand cut 73,000 pieces of glass for the QVB. Now the landlord wants some removed",
        "publish_date": "Tue, 13 Jan 2026 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "Cindy Yin"
        ],
        "text": "When glass apprentice Rozlyn de Bussey landed a prestigious job to restore the Queen Victoria Building in the 1980s, she didn’t think much of it – the 23-year-old was more interested in using her breaks to try every yum cha restaurant in Chinatown.\n\n“Being so young, I just felt like it was part of being an apprentice, I didn’t really give it much curiosity until much later on,” de Bussey, now 68, said.\n\nRozlyn de Bussey worked on the QVB in her early 20s. Since then, she has worked full time as a glass artist. Credit: Alex Ellinghausen\n\nNow the city is staring down a proposal from retailers who want to replace the QVB’s coloured glass on the ground floor on Market Street with clear glass, which greatly “saddened” de Bussey.\n\nFrom 1985 to 1987, de Bussey and her fellow apprentices embarked on a labour-intensive refurbishment process, cutting more than 73,000 pieces of glass “from morning until night”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/money/investing/at-76-vicki-turned-her-family-group-chat-into-an-investing-club-20260113-p5ntme.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "At 76, Vicki turned her family group chat into an investing club",
        "publish_date": "Tue, 13 Jan 2026 11:16:32 +1100",
        "category": "finance",
        "authors": [
            "Nina Hendy"
        ],
        "text": "Discussing finances and investing is close to taboo in most families, but that’s not the case for grandmother Vicki Price. Instead, she actively encourages it.\n\nHaving spent more than 30 years investing, the 76-year-old has made it her mission to openly discuss which investments and asset classes have worked – and importantly, which haven’t – with the women in her family.\n\nFor many families, discussing money can feel awkward or taboo. Credit: Dominic Lorrimer\n\nPrice has overseen her own share portfolio on behalf of herself and her husband since she was in her late 50s, so she feels well-equipped to drive the family conversations.\n\nWhile she admits it was a case of trial and error in those early days, she’s since learned the benefit of leaving investments time to mature, and how to research companies she wants to invest in over the years.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/my-best-beach-20251229-p5nqk2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "My best beach",
        "publish_date": "Tue, 13 Jan 2026 11:14:50 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "Maybe Max and I were on the same page when it came to appreciating the beauty, the solace and simplicity of this special place.\n\nJanuary 12, 2026\n\nby Georgie Gardner",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/autism-barbie-is-unboxed-to-mixed-reaction-from-advocates/vtjgjpi8l",
        "title": "Autism Barbie is unboxed, to mixed reaction from advocates",
        "publish_date": "Tue, 13 Jan 2026 00:50:14 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nYou can't be what you can't see - it is a maxim you may have heard before.\n\n\n\n\n\nAnd the creators of Barbie, Mattel, say that philosophy is behind their decision to make Barbies that represent autistic women and girls.\n\n\n\n\n\nThe company sent the new doll to Australian actor and disability activist, Chloe Hayden, who couldn't contain her excitement when she shared her reaction on social media.\n\n\n\n\n\n\"Growing up, I never saw myself anywhere. Not in media and definitely not in the toys that I played with. So to now be able to see myself in Barbie is mindblowing. And the impact that this is going to have on little girls is so exciting.\"\n\n\n\n\n\nThe doll is designed to reflect some of the ways neurodiverse people may experience the world, including articulated elbows and wrists to allow for stimming hand movements, a gaze that is slightly averted rather than making direct eye contact, and accessories linked to sensory processing and communication.\n\n\n\n\n\nIt was developed with the Autistic Self Advocacy Network for its Fashionistas collection, which already includes dolls representing a wide range of skin tones, body types, medical conditions and disabilities.\n\n\n\n\n\nAssociate Professor of Social and Development Psychology at Durham University in the UK, Monique Botha, believes it is an important move.\n\n\n\n\n\n\"There are a lot of autistic children who will see a Barbie with ear defenders and an AAC device, which is a communication device, and absolutely be delighted. They will be delighted that there is a toy that might capture a bit of their experience, that they can see themselves in someone else.\"\n\n\n\n\n\nAustralian developmental scientist and autistic mother, Doctor Kristyn Somners, says she won't be buying this toy for her children.\n\n\n\n\n\nShe recently released a video on instagram explaining her concerns over the creation of a visual template for autism.\n\n\n\n\n\n\"And the moment that exists, autistic kids, particularly girls will start to be compared to it. The second problem I see is that it creates a right way to be autistic. If your autism does not look like this, if you don't use an AAC, if you stim visibly, if you mask, this doll does not say that you're being included, it says you are not being autistic the right way.\"\n\n\n\n\n\nBut autistic content creator Ellie Middleton says this doll reflects a broader shift in how autism is understood, moving away from traditionally masculine representations.\n\n\n\n\n\n\"Up until very recently, autism was seen as something that was something that young white boys had and it was kind of especially a male thing. It was seen as something that was almost like one specific type rather than a spectrum. And I think we're starting to see the movement of society understanding that actually women can be autistic, people of colour can be autistic, adults can be autistic.\"\n\n\n\n\n\nWhile others have voiced concerns the Barbie could actually be enforcing stereotypes, rather than broadening inclusion.\n\n\n\n\n\nProfessor Botha advises this - as with all representation - is not universal.\n\n\n\n\n\n\"There will also be an entire group of autistic people who don't particularly see themselves in this toy, who don't feel represented, and a toy cannot possibly represent everyone. Similarly, from other research, we know that children who play with ultra-thin dolls also, it affects how they see themselves and is related to an increased strive towards thinness itself.\"\n\n\n\n\n\nThe iconic doll is famous for embodying different professions and identities since her creation in the 1950s and this latest iteration comes as autism policy is being formed around the world.\n\n\n\n\n\nNicole Rogerson is CEO of Autism Awareness Australia and a parent of an autistic adult.\n\n\n\n\n\nWhile recognising the autistic community will have a range of opinions on this Barbie, she believes this isn't a reflection of meaningful progress in improving the lives of autistic people.\n\n\n\n\n\n\"It did make me honestly roll my eyes a little bit and say in the grand scheme of the challenges that the autism community has both nationally and internationally, you know a doll is not really going to do much here. It's really important for the autism community to be able to look at today and say look, great there is a doll. But let's get back to the serious work we need to do.”\n\n\n\n\n\nA year ago, Australia launched its first National Autism Strategy, a seven-year plan that dedicates more than $42 million in its first phase.\n\n\n\n\n\nMs Rogerson says this is a time of stress and uncertainty for many families.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/josh-cavallo-alleges-homophobia-behind-adelaide-united-exit/pad6y4i91",
        "title": "'Fans deserve honesty': Josh Cavallo alleges homophobia behind Adelaide United exit",
        "publish_date": "Tue, 13 Jan 2026 00:29:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "Former Adelaide United footballer Josh Cavallo has alleged he received homophobic treatment at the A-League Men club and was benched because he was gay.\n\n\n\n\n\nCavallo came out as gay, with Adelaide's support, in 2021, becoming the world's first openly gay active professional male footballer .\n\n\n\n\n\nHe departed the club in May to move to the United Kingdom after limited game time in his final two seasons, and he currently plays for lower-tier Stamford.\n\n\n\n\n\nCavallo, 26, didn't feature last season and was an unused substitute eight times under then-coach Carl Veart, playing his last Reds game in February 2024.\n\n\n\nCavallo also played just four games in the 2023-24 campaign, having suffered a hamstring strain after recovering from an Achilles tendon rupture.\n\n\n\n'People in power blocked my opportunities'\n\nIn a post on Tuesday morning — three days before the Reds' Pride Cup against Melbourne Victory — Cavallo hit out at Adelaide.\n\n\n\n\n\nHe alleged his playing opportunities in his final years there were \"blocked\" because of his sexuality, not injuries, and said teammates had mocked a photo of him and his partner.\n\n\n\n\n\n\"It's taken me a while to digest how my time at Adelaide United ended, but I think the fans deserve honesty,\" Cavallo wrote on Instagram.\n\n\n\n\n\n\"Leaving the club had nothing to do with football. Decisions were made by people in power that blocked my opportunities, not because of my talent, but because of who I choose to love.\n\n\n\n\n\n\"Under the new management, it became clear that I wasn't allowed on the pitch because of politics.\n\n\n\nJosh Cavallo has spoken out about his time at Adelaide United. Source: Getty / Jonathan DiMaggio \"It's hard to swallow when I realised my own club was homophobic. I was angry because people thought I was sidelined based on injuries, when in reality, it was internal homophobia that kept me on the bench,\" Cavallo wrote.\n\n\n\n\n\n\"I stayed professional, kept my head down, and worked hard every day, which I'm proud of.\n\n\n\n\n\n\"Yet no matter how much I produced or improved, my contributions were continuously ignored. It brought a lot of negativity and affected my well-being as a professional footballer.\"\n\n\n\n\n\nThe Australian Associated Press has contacted Adelaide United for comment.\n\n\n\n'I felt incredibly isolated'\n\nCavallo said the experience made him question whether coming out had been the right decision.\n\n\n\n\n\n\"This was exactly the fear I had about coming out, seeing prejudice affect my career in modern day,\" he said.\n\n\n\n\n\n\"For the first time, l actually questioned if I should have kept my sexuality a secret. This brought up fears I had about coming out publicly, that being myself would affect my career.\n\n\n\n\n\n\"I felt incredibly isolated and wondered if I'd made the mistake of sharing my story.\n\n\n\n\n\n\"I felt things going backwards, not just on the pitch, but in the one place l thought was a safe space and after seeing a group chat of teammates mocking a picture of me and my partner only added to this heartache.\"\n\n\n\n\"This fresh start in the UK has helped me breathe again and I hope I can fall back in love with the sport that means everything to me,\" the player said.\n\n\n\n\n\n\"Despite the way it ended behind the scenes, I refuse to let it ruin my connection to this city. Adelaide is where I found my wings.\"\n\n\n\n\n\nLGBTIQ+ Australians seeking support with mental health can contact QLife on 1800 184 527 or visit qlife.org.au . ReachOut.com also has a list of support services.\n\n\n\n\n\nIntersex Australians seeking support can visit Intersex Peer Support Australia at isupport.org.au.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/adelaide-writers-week-crisis-escalates/9hi99sm8u",
        "title": "Louise Adler resigns as Adelaide Writers' Week director amid escalating festival crisis",
        "publish_date": "Tue, 13 Jan 2026 00:18:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Louise Adler has resigned as director of Adelaide Writers' Week (AWW) after organisers removed Palestinian Australian author Randa Abdel-Fattah from this year's program.\n\n\n\n\n\nAdler announced her resignation from the beleaguered literary event in an opinion piece published by Guardian Australia on Tuesday, saying she could not be \"party to the silencing of writers\".\n\n\n\n\n\nA spokesperson for the Adelaide Festival confirmed Adler's departure to SBS News.\n\n\n\n\n\nHer resignation follows days of intensifying fallout from the board's decision to drop Abdel-Fattah, which has triggered a large-scale withdrawal of writers and speakers from the event, which is scheduled to run from 27 February to 15 March,\n\n\n\n\n\nSince the decision, about 180 writers, commentators and academics have pulled out, including former New Zealand prime minister Jacinda Ardern, bestselling author Zadie Smith, Pulitzer prize-winner Percival Everett and one of Australia's most decorated writers, Helen Garner.\n\n\n\n\n\n\"I cannot be party to silencing writers so, with a heavy heart, I am resigning from my role as the director of the AWW,\" Adler wrote for Guardian Australia.\n\n\n\n\n\n\"Writers and writing matters, even when they are presenting ideas that discomfort and challenge us.\"\n\n\n\n\n\nAbdel-Fattah told ABC Radio Adelaide on Tuesday that Adler's resignation was \"a tragedy\".\n\n\n\n\n\n\"Louise is one of the most incredible directors and icons in Australia's cultural history and she has done such amazing work in that role,\" she said.\n\n\n\n\n\n\"I think it's a tragedy it has come to this, it could easily have gone the other way.\"\n\n\n\nREAD MORE Board members, chair quit from Adelaide Festival as fallout from dropped author grows\n\nAdler's departure unfolds as the Adelaide Festival grapples with an unprecedented leadership crisis.\n\n\n\n\n\nOver the weekend, four of the seven voting members of the festival board resigned, including board chair Tracey Whiting.\n\n\n\n\n\nWhiting did not detail her reasons, saying only that \"recent decisions were bound by certain undertakings\" and that her resignation, effective immediately, would allow the organisation to \"refresh its leadership and its approach\".\n\n\n\n\n\nThe Adelaide Festival board's decision to remove Abdel-Fattah has left the future of the 2026 festival in doubt.\n\n\n\n\n\nIt said last week said Abdel-Fattah would no longer appear at Adelaide Writers' Week because it would not be \"culturally sensitive\" following the Bondi Beach terror attack referring to \"past statements\" she had made, which they did not specify.\n\n\n\n\n\nAbdel-Fattah is the daughter of Palestinian and Egyptian parents, and has been a vocal critic of Israel's treatment of Palestinians.\n\n\n\n\n\nShe has previously faced criticism from the Coalition, as well as some Jewish organisations and media outlets, over comments about Israel and Zionism, including a widely reported post in which she claimed Zionists had \"no claim or right to cultural safety\".\n\n\n\n\n\nAbdel-Fattah has said her objections and critiques of Zionism, a political ideology , have been conflated with antisemitism.\n\n\n\n\n\nShe has also said her posting of an image of a Palestinian paratrooper soon after the October 7 attacks, a move that has also been criticised, was intended as a symbolic expression of besieged Palestinians \"breaking out of their prison\", and that she did not support the killing of civilians. She said she was unaware at the time of the scale or severity of the attacks.\n\n\n\nAbdel-Fattah has said she is considering her legal options in the wake of the board's decision, which she described as an \"obscene attempt\" to associate her with the Bondi Beach terror attack.\n\n\n\n\n\nThe board has said it was not suggesting Abdel-Fattah or her work had any connection to the attack, but that proceeding with her appearance would \"not be culturally sensitive\".\n\n\n\n\n\nAdler, a former publisher and editor and the Jewish daughter of Holocaust survivors, has been a consistent defender of the right of Palestinians to speak freely.\n\n\n\n\n\nShe was highly critical of the board's reasoning in her opinion piece.\n\n\n\nShe wrote the decision to dump Abdel-Fattah \"weakens freedom of speech and is the harbinger of a less free nation, where lobbying and political pressure determine who gets to speak and who doesn't\".\n\n\n\n\n\nShe argued the decision reflected a wider pattern within Australian arts organisations, pointing to previous controversies involving the Melbourne Symphony Orchestra, Creative Australia and the collapse of the Bendigo Writers Festival.\n\n\n\n\n\nIn her view, boards with limited arts experience had been unnerved by political pressure and coordinated campaigns.\n\n\n\nREAD MORE Writers pull out of Adelaide festival as dropped Palestinian author claims 'racist' treatment\n\nHer column echoed concerns raised by 17 prominent cultural figures — all former senior leaders of the Adelaide Festival — who wrote an open letter condemning the board's decision.\n\n\n\n\n\nThe signatories challenged the South Australian government to appoint people with arts expertise to the festival board, stating: \"We note there are currently none.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/adelaide-writers-week-uncertainty/0dnsi7brh",
        "title": "Ardern withdraws from Writers' Week; Adelaide Festival board faces fresh questions",
        "publish_date": "Mon, 12 Jan 2026 08:47:25 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A former director of Adelaide Writers' Week says this year's beleaguered literary event is \"untenable\" as organisers admit they've received a \"significant\" community response to a decision to drop a Palestinian Australian author.\n\n\n\n\n\nBut there's no official word yet on whether the event will proceed without a majority of its scheduled speakers, who've announced they will no longer appear following the removal of author and academic Randa Abdel-Fattah from the program.\n\n\n\n\n\nThe Adelaide Festival board last week said Abdel-Fattah would no longer appear at Adelaide Writers' Week because it would not be \"culturally sensitive\" following the Bondi Beach terror attack referring to \"past statements\" she had made, which they did not specify.\n\n\n\n\n\nSBS News on Sunday reported that three board members, as well as the chair, resigned following a crisis meeting, after the number of authors cancelling their scheduled appearance reportedly hit close to 100.\n\n\n\n\n\nAn Adelaide Festival spokesperson confirmed on Monday afternoon that former New Zealand prime minister Jacinda Ardern had also withdrawn from the festival, but did not provide details about when she withdrew or her reasons.\n\n\n\nREAD MORE Board members, chair quit from Adelaide Festival as fallout from dropped author grows\n\nJo Dyer, who was director of Adelaide Writers' Week until 2022, said this year's event — due to start on 28 February — was \"untenable\" without 80 per cent of its scheduled writers.\n\n\n\n\n\n\"It has virtually no writers left in its lineup,\" Dyer told SBS News.\n\n\n\n\n\nShe said it was a \"sad state of affairs\" to watch the festival turmoil amid the \"unprecedented\" turn of events.\n\n\n\n\n\n\"It's only been a few days that this crisis has engulfed the organisation,\" Dyer said.\n\n\n\n\n\n\"I have heard of nothing, ever in the history of the festival which has undermined the international standing of the Adelaide Festival as much as the events of the last few days.\"\n\n\n\nIt's estimated around 80 writers have cancelled their appearance at the Adelaide Writers' Week event. Source: AAP / Joanna Kordina Dyer is among a group of former festival leaders who've written an open letter to call for Abdel-Fattah's reinstatement.\n\n\n\n\n\nShe said she didn't agree with the \"egregious incursion on the principle of freedom of artistic expression\" made by the board's decision.\n\n\n\n\n\n\"People come to these events specifically to hear views with which they may not be familiar. Some of them are going to be uncomfortable. Some of them, people are going to disagree with, a bit mildly or vehemently,\" she said.\n\n\n\n\n\n\"But what writers forums like Writers' Week have shown is that if we are able to have these conversations in civilised ways.\"\n\n\n\n\n\nWith this year's literary event in limbo, Julian Hobba, Adelaide Festival Corporation executive director, issued a statement on Monday saying: \"Following the Adelaide Festival Board's decision on Thursday 8 January and the significant community response, Adelaide Writers' Week and Adelaide Festival are navigating a complex and unprecedented moment and will share further updates as soon as we are able.\"\n\n\n\nConcerns after board resignations\n\nDyer has also raised questions over whether the board is still functional in its current composition.\n\n\n\n\n\nThe Adelaide Festival Corporation Act 1998 stipulates the board must consist of a maximum of eight members, appointed by the governor, with at least two women and two men.\n\n\n\n\n\nThe board currently consists of three women and one man — Leesa Chesser, Mary Couros, Brenton Cox, and Jennifer Fuller as the government observer.\n\n\n\nREAD MORE Writers pull out of Adelaide festival as dropped Palestinian author claims 'racist' treatment\n\nDyer said the board appears to be no longer \"lawfully constituted\".\n\n\n\n\n\n\"It's very difficult for the organisation, generally, to operate without a functioning board. Quite apart from anything else, is that the board of directors are always very important around festival time,\" she said.\n\n\n\n\n\nSouth Australian Premier Peter Malinauskas said he's received advice on Sunday night the board is still formally, constitutionally capable of making decisions, and that the act didn't stipulate a minimum number of board members.\n\n\n\n\n\nBut he had raised concerns about the reputational damage to the festival and the potential economic hit.\n\n\n\n\n\n\"The people who run the festival which is the board as they should have got this into a pretty awful situation, which is unfortunate,\" he told reporters on Monday.\n\n\n\n\n\nMalinauskas has said he is prevented by law from directing the board. But last week, the premier said he had made \"it clear that the state government did not support the inclusion of Dr Abdel-Fattah\" in the festival program when asked for his opinion.\n\n\n\n\n\nSpeaking to the ABC on Monday, Dyer accused the premier of heaping \"unbearable pressure on the board to rescind the invitation to Dr Abdel-Fattah\", which she said was \"completely inappropriate\".\n\n\n\nWho is Randa Abdel-Fattah?\n\nAbdel-Fattah had been scheduled to appear at Writers' Week to discuss her new novel, Discipline, about an academic and journalist facing censorship, set against the backdrop of the 2021 Israeli airstrikes on Gaza.\n\n\n\n\n\nShe is a lawyer, an award-winning author of multiple novels and an academic at the Department of Sociology at Macquarie University.\n\n\n\n\n\nAbdel-Fattah is the daughter of Palestinian and Egyptian parents, and has been a vocal critic of Israel's treatment of Palestinians.\n\n\n\n\n\nShe has previously faced criticism from the Coalition, as well as from some Jewish organisations and media outlets, over comments about Israel and Zionism, including an alleged post saying Zionists had \"no claim or right to cultural safety\".\n\n\n\n\n\nAn $870,000 Australian Research Council grant that Abdel-Fattah received to examine Arab and Muslim Australian social movements was suspended for almost a year amid an investigation into her expenditure and potential conflicts of interest. She was cleared of any wrongdoing and it was reinstated.\n\n\n\nLiberal senator Sarah Henderson said she commended the board's decision to remove the Palestinian Australian author, saying it was \"deeply disappointing\" she had been invited in the first place, saying the academic had posted an image of a Palestinian paratrooper on her Facebook page a day after the October 7 attacks.\n\n\n\n\n\nAbdel-Fattah confirmed she had posted an image of a person parachuting with a Palestinian flag in the wake of October 7 in an interview with the ABC on Monday afternoon, but said she was unaware at the time of the scale or severity of the attacks.\n\n\n\n\n\nShe said the post was intended as a symbolic expression of besieged Palestinians \"breaking out of their prison\", and that she did not support the killing of civilians.\n\n\n\n\n\nOn Monday morning, Abdel-Fattah told ABC radio her objections and critique of Zionism, a political ideology, were being conflated with antisemitism.\n\n\n\n\n\n\"I have never, ever attacked Jewish people,\" she told ABC radio on Monday morning.\n\n\n\n\n\n\"I am attacking a political ideology and the state which is carrying out a genocide against my people.\"\n\n\n\n\n\nA report last year by the United Nations Independent International Commission of Inquiry — which does not speak on behalf of the world body and has faced harsh Israeli criticism — found that Israel was committing genocide in Gaza.\n\n\n\n\n\nIsrael has repeatedly denied is committing genocide in Gaza and rejected the report's findings.\n\n\n\n\n\nAbdel-Fattah has labelled the board's decision to dump her from the event as \"extremely racist\" and an \"obscene attempt\" to associate her with the Bondi Beach terror attack.\n\n\n\n\n\nShe is currently considering her legal options.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/victorian-bushfires-still-raging-as-residents-count-the-cost-of-devastation/3i57v4myf",
        "title": "Victorian bushfires still raging as residents count the cost of devastation",
        "publish_date": "Mon, 12 Jan 2026 08:36:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Victorian bushfires still raging as residents count the cost of devastation\n\nPublished 12 January 2026, 7:42 am\n\nOut-of-control bushfires are continuing to burn across Victoria for a sixth day, with a man confirmed dead and more than 350 structures now lost. The major blazes worrying authorities include a bushfire near Carlisle River in the Otways, and another near Walwa close to the New South Wales border. Meanwhile, more residents are starting to count the cost of the Longwood fire in central Victoria.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australian-open-gets-underway-what-to-know-about-this-years-tournament/vvcoiq3hf",
        "title": "Australian Open gets underway: what to know about this year’s tournament",
        "publish_date": "Mon, 12 Jan 2026 07:48:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe holiday season may have drawn to a close, but for Australian tennis fans, the festivities are just getting started.\n\n\n\n\n\nThe Australian Open returns to Melbourne Park for its 114th edition this month, bringing a wide array of superstars and hopefuls from around the world to sweat it out on the iconic blue courts.\n\n\n\n\n\nThe top ranked men's players Carlos Alcaraz and Jannik Sinner have arrived in Melbourne to begin preparations.\n\n\n\n\n\nWorld number one, Alcaraz, is a six-time Grand Slam champion but has never advanced past the quarter-finals stage in Melbourne, while world number two, Sinner, will be aiming to defend his Australian Open title for a third straight year following the Italian’s successes in 2024 and 2025.\n\n\n\n\n\nThey say they're excited to push each other this tournament.\n\n\n\n\n\n\"We push each other, you know, to be better, so, I think that's what I keep from this, you know, good rivalry. I think everybody needs someone that pushes you to be better, to give your 100 per cent, and I think that's what we are doing every time.”\n\n\n\n\n\n“Yeah, I mean, we are, I believe everyone is different in a way, so, it's good for the sport to have different personalities and game styles, and it's great, you know, to share a court with him I see a completely different point of view, how to approach certain points.”\n\n\n\n\n\nWorld number four Novak Djokovic, who holds the record for most men's Australian Open titles at 10, will be looking to challenge the younger men to extend that achievement.\n\n\n\n\n\nThe Australian Open is the first of the four major tennis tournaments held each year that make up the Grand Slam series, alongside the French Open in Paris, the Wimbledon Championships in London and the US Open in New York.\n\n\n\n\n\nIt includes a range of match types, including men’s and women’s singles and doubles, as well as mixed doubles, junior championships, wheelchair, exhibition matches and more.\n\n\n\n\n\nAt $111.5 million, this year's prize pool is the largest in the tournament’s history — a 16 per cent increase on 2025.\n\n\n\n\n\nThe opening week started on Monday 12 January, with hundreds of lower-ranked hopefuls competing in qualifying rounds to secure their spot in the main draw.\n\n\n\n\n\nThe main draw will start on Sunday, 18 January and run for two weeks.\n\n\n\n\n\nLast year, Madison Keys took home the women's Australian Open trophy - the 30-year-old's first Grand Slam win in her career.\n\n\n\n\n\nThe American, now ranked ninth in the world, says tennis can be unpredictable but she's hoping to defend her title.\n\n\n\n\n\n\"Obviously after you win a slam expectations go up. So, I think I've played the past year with higher expectations, but I think I'm really just trying to go out and start the year off as best as I can and play some really good tennis and I'm excited to see how all of the chips fall.\"\n\n\n\n\n\nHot on the heels of the reigning champion is the world number one women's player Aryna Sabalenka who fell short in last year's final.\n\n\n\n\n\nThe Russian has taken home the Brisbane International trophy earlier in the month and hopes to build off this momentum.\n\n\n\n\n\n\"Yeah it's super special, I'm happy to hold this trophy. I'm happy to start season on a very strong note. Nobody knows what's what's gonna happen in the future but the only one thing I'm sure is that I'll be there, I'll be fighting. I'll do my best to to go as far as possible and do a little bit better than the last year and that's that's where my focus is. My focus is on my game, on developing myself and making sure that I'm strong and healthy heading to the AO.\"\n\n\n\n\n\nWorld number four and reigning French Open champion, Coco Gauff, is also hoping she can start her season with a bang in Australia, with the American telling Channel Nine she's been training hard.\n\n\n\n\n\n\" Last year I felt like I started off my season pretty strong. So, looking forward to hopefully doing the same thing. But you never know what to expect at the start of the year. You've been practising for a few weeks straight. So hopefully the things that I've been working on in practice can translate over.\"\n\n\n\n\n\nAnother big name to watch out for this year is Polish player Iga Świątek who won Wimbledon last year and is currently ranked world number two.\n\n\n\n\n\nAnd when it comes to local Australian Open hopes, there's none better than men's world number six player Alex de Minaur.\n\n\n\n\n\nDe Minaur has been in good form lately, recently defeating Poland's Hubert Hurkacz on home turf in Sydney in the United Cup.\n\n\n\n\n\nHe tells the Australian Open YouTube channel that he's planning on being a title threat this tournament after making it to the quarter finals last year.\n\n\n\n\n\n\"I would love nothing more than to have a deep run there and keep building upon what I've been doing the last couple years. And hopefully I'll be a threat for the title. That would be very very nice.\"\n\n\n\n\n\nRising star Maya Joint is another Australian to watch after the 19-year-old has had a phenomenal couple of years after entering 2024 ranked 684th in the world, but soaring to world number 32 by the end of 2025.\n\n\n\n\n\nJoint is guaranteed to be seeded for this year's Australian Open, meaning she won’t face off against a higher-ranked player until at least the third round, giving her a great chance to have a lengthy run in the tournament.\n\n\n\n\n\nOther top 100 players representing Australia include women’s singles players Daria Kasatkina and Alja Tomljanovic plus men Alexei Popyrin and Adam Walton.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/jerome-powell-facing-criminal-probe-and-implication-for-markets/wfimvzd97",
        "title": "Jerome Powell facing criminal probe and implications for markets",
        "publish_date": "Mon, 12 Jan 2026 07:23:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/your-guide-to-the-australian-open-2026/5q4qkreo1",
        "title": "Australian Open 2026: Your guide to this year's tournament",
        "publish_date": "Mon, 12 Jan 2026 05:36:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "The silly season may have drawn to a close, but for tennis fans, the festivities are just getting started.\n\n\n\n\n\nThe Australian Open (AO) returns to Melbourne Park for its 114th edition this month, bringing a wide array of superstars and hopefuls from around the world to sweat it out on the iconic blue courts.\n\n\n\n\n\nHere's what you need to know about when the action is taking place, the key players to watch out for, and how to watch.\n\n\n\nWhat is the Australian Open?\n\nThe AO is the first of the four major tennis tournaments held each year that make up the Grand Slam series, alongside the French Open in Paris, the Wimbledon Championships in London and the US Open in New York.\n\n\n\n\n\nIt includes a range of match types, including men's and women's singles and doubles, as well as mixed doubles, junior championships, wheelchair, exhibition matches and more.\n\n\n\n\n\nAt $111.5 million, this year's prize pool is the largest in the tournament's history — a 16 per cent increase on 2025.\n\n\n\nThe Australian Open kicks off the Grand Slam tennis series each year. Source: AAP / James Ross Players also compete to bolster their rankings on the official leaderboards, maintained by the Women's Tennis Association (WTA) for women and the Association of Tennis Professionals (ATP) for men.\n\n\n\nWhen is the Australian Open 2026?\n\nThe main draw for this year's AO will start on 18 January and run for two weeks.\n\n\n\n\n\nMen's and women's singles quarter-finals will take place on 27 January, with women's semifinals on 29 January and men's semifinals on 30 January.\n\n\n\n\n\nThe women's singles grand final will be held on 31 January, with the men's singles grand final the next evening, 1 February.\n\n\n\n\n\nThe men's and women's doubles finals will also be held over that weekend.\n\n\n\n\n\nIf you're extra keen to get stuck in, good news — you don't have to wait for the main draw to kick off to see some great tennis.\n\n\n\nOpening week started on 12 January, with hundreds of hopefuls competing in qualifying rounds to secure their spot in the main draw.\n\n\n\n\n\nPlayers who have not automatically qualified for the main draw (through their global ranking) are required to win three matches to secure one of the 16 places available in each of the men's and women's singles draws.\n\n\n\n\n\nBesides the qualifiers, opening week also includes practice sessions each day that are open to the public, live concerts, and exhibition events like the One Point Slam — where world pros and amateurs alike will compete for a $1 million prize, with matches won by whoever gets a point first.\n\n\n\nWho will be competing in the Australian Open?\n\nThere's a strong mix of both established heavy-hitters vying for glory and newcomers hoping to make their mark on the tournament this year — both international stars and homegrown heroes.\n\n\n\n\n\nIn terms of the big names, Italian Jannik Sinner will be hoping to win his third consecutive AO (and fifth Grand Slam title), after coming out on top in the men's singles in 2024 and 2025 . He's currently ranked second, behind Spanish world number one Carlos Alcaraz — another player set to draw attention at this year's AO.\n\n\n\n\n\nThe two players faced off in the finals of all three other Grand Slams last year — with Alcaraz winning the French Open and US Open, and Sinner winning Wimbledon in between.\n\n\n\nSpain's Carlos Alcaraz (left) and Italy's Jannik Sinner (right) each won two Grand Slam titles last year — with the other coming runner-up both times. Source: Getty / Matthew Stockman World number four Novak Djokovic, who holds the record for most men's AO titles at 10, will also be looking to extend that achievement.\n\n\n\n\n\nAO 2025 women's singles winner Madison Keys will also be hoping to defend her Australian crown at this year's event, after beating Belarusian world number one Aryna Sabalenka last year . Sabalenka is the most recent Grand Slam title winner, emerging victorious at the US Open last year.\n\n\n\n\n\nOther big names this year include Polish player Iga Świątek, who won Wimbledon last year and is currently ranked world number two, and American player Coco Gauff, who took out first place in the French Open and is currently ranked world number three.\n\n\n\n\n\nIn terms of local talent, rising Australian player Maya Joint is a clear one to watch.\n\n\n\n\n\nThe 19-year-old has had a phenomenal couple of years — entering 2024 ranked 684th in the world, soaring to world number 32 by the end of 2025.\n\n\n\n\n\nJoint will also benefit in this year's tournament from seeding — the process in which the top 32 players (as determined by world rankings) are arranged in the draw to ensure they don't play one another too early.\n\n\n\n\n\nJoint is guaranteed to be seeded for this year's AO, meaning she won't face off against a higher-ranked player until at least the third round.\n\n\n\n\n\nSeeding will be confirmed this week, with the official draw revealed on 15 January.\n\n\n\nAustralian player Maya Joint has enjoyed a rapid rise in recent years. Source: AAP / AP / Rick Rycroft World number six Alex de Minaur, Australia's top singles player, will also be a major draw, having reached the quarter-finals last year before being bested by eventual winner Sinner .\n\n\n\n\n\nDe Minaur has been in good form lately, recently defeating Poland's Hubert Hurkacz on home turf in Sydney during AO warm-up the United Cup.\n\n\n\n\n\nOther players representing Australia this year that are worth keeping an eye on include women's singles players Daria Kasatkina and Ajla Tomljanovic, plus men Alexei Popyrin, Adam Walton, James Duckworth, Aleksander Vukic and Tristan Schoolkate. All are ranked within the top 100 of either the WTA or ATP.\n\n\n\n\n\nGrand Slam tennis is always full of twists, and it's worth keeping an eye on the smaller courts throughout the tournament.\n\n\n\n\n\nThe Australian Open is also no stranger to surprise upsets: last year, 19-year-old American qualifier Learner Tien knocked out Russian player Daniil Medvedev — then ranked world number five — in the second round.\n\n\n\n\n\nUS legend Venus Williams will play in this year's main draw, after receiving a wildcard slot. The 45-year-old has not played in Melbourne since 2021, and it will mark her first time playing outside the US since 2023.\n\n\n\nHow can I watch the Australian Open?\n\nThis year, Australians can watch the AO live and free via Channel 9 and its streaming platform 9Now. Stan Sport (which requires a paid subscription) will also have every match live and on demand.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/critical-mission-why-rare-earths-and-minerals-are-a-new-priority-for-australia/ezm7ul0id",
        "title": "Critical mission: why rare earths and minerals are a new priority for Australia",
        "publish_date": "Mon, 12 Jan 2026 05:29:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nCritical minerals are - as the name suggests - becoming increasingly critical in the modern world.\n\n\n\n\n\nThey underpin technology used by billions of people, like smartphones and computers.\n\n\n\n\n\nIn 2026, they are both an economic and literal weapon - according to Federal Resources Minister Madeleine King, who describes the strategic reserve of these resources as a matter of national security.\n\n\n\n\n\n\"Especially in turns of antimony and gallium and rare earth elements, they are very important within the AUKUS context as well, so making sure those products are available for the builds of what our three nations are doing with the submarines is also very important.\"\n\n\n\n\n\nGallium, antimony and rare earths have been listed as priority resources for Australia's 1.2 billion dollar critical minerals reserve.\n\n\n\n\n\nAntimony can be used in a number of ways, including to harden bullets and as a component of missile guidance systems and night-vision goggles.\n\n\n\n\n\nGallium is also important for military equipment, including as a component of advanced radar systems.\n\n\n\n\n\nThe reserve also allows the Federal Government to buy minerals from Australian mines and sell to other nations.\n\n\n\n\n\nIn October , Prime Minister Anthony Albanese signed the Critical Minerals Framework deal for critical minerals with the Trump Administration in the US.\n\n\n\n\n\n\"Well this is an eight and a half billion dollar pipeline, ready to go.\"\n\n\n\n\n\nTrump: \"Yes, ready to go.\"\n\n\n\n\n\nThat pipeline - and this new announcement - is designed to ensure regular supply of minerals to the US, with president Donald Trump making this forecast last year:\n\n\n\n\n\n\"A year from now we will have so much critical mineral and rare earths that you won't know what to do with them, they'll be worth about two dollars.\"\n\n\n\n\n\nIt's not yet been a year, but from Airforce One today he was revealing where some of those minerals would be used.\n\n\n\n\n\n\"I'm going to be making a trip to Detroit to talk about our unbelievable amount of factories opening up around the country, many of which are car factories. We have manufacturing plants opening up at a level nobody has ever seen before.\"\n\n\n\n\n\nThe Albanese government in total is committing around 28 billion dollars to fund a series of measures to support the sector.\n\n\n\n\n\nHowever, Shadow Resources Minister Susan McDonald told Sky News she is concerned domestic policy will impede Australia's international plans.\n\n\n\n\n\n\"We have been warning for years that Labor needs to ensuring the supply of these critical minerals and that means insuring mining. That means not introducing more legislation like the EPB. It means reducing the costs of processing. You know, if we just talk about gallium for a second. I mean, that is a by product of bauxite mining and yet, bauxite processing is on its knees.\"\n\n\n\n\n\nMost of Australia's critical minerals have been processed in China, which controlled close to 90 per cent of the resource's global supply chain last year.\n\n\n\n\n\nThat reliance is shared by other advanced economies, with finance ministers from G7 nations in Washington D-C to discuss the issue.\n\n\n\n\n\nFederal Treasurer, Jim Chalmers, will be there to spruik Australia's place on the critical minerals supply chain - and potential to disrupt China's monopoly.\n\n\n\n\n\nAccording to the resources minister, it signals Australia's place on the global stage.\n\n\n\n\n\n\"What this says is that whilst Australia is not a member of the G-7, because of our extraordinary resources sector and natural advantages in resources and critical minerals we are welcome at these forums as a leader in rare earths and critical minerals globally.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/jerome-powell-says-federal-reserve-subpoenaed-by-trump-administration/op0fd8q5j",
        "title": "US federal reserve threatened with criminal charges by Trump administration, bank chair says",
        "publish_date": "Mon, 12 Jan 2026 02:31:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "United States Federal Reserve chair Jerome Powell says the justice department has served the central bank with subpoenas and threatened criminal indictment over his testimony about the Fed's building renovations.\n\n\n\n\n\nThe move represents a major escalation in US President Donald Trump's battle with the Fed, an independent agency he has repeatedly attacked for not cutting its key interest rate as quickly as Trump prefers.\n\n\n\n\n\nThe subpoena relates to his testimony before the senate banking committee in June, Powell said, regarding the Fed's US$2.5 billion ($3.7 billion) renovation of two office buildings, a project that Trump criticised as excessive.\n\n\n\n\n\nPowell cast off what has up to this point been a restrained approach to Trump's criticisms and personal insults, which he has mostly ignored.\n\n\n\n\n\nInstead, on the weekend, he issued a video statement in which he bluntly characterised the threat of criminal charges as simple \"pretexts\" to undermine the Fed's independence when it comes to setting interest rates.\n\n\n\nPowell said: \"This is about whether the Fed will be able to continue to set interest rates based on evidence and economic conditions — or whether instead monetary policy will be directed by political pressure or intimidation.\"\n\n\n\n\n\nIt's a sharp departure from the Fed's understated response to Trump so far.\n\n\n\n\n\nThe central bank has tried to placate the administration by dialling back some policies, such as efforts to consider the impact of climate change on the banking system, that the administration clearly opposed.\n\n\n\n\n\nIn his June testimony, Powell disputed some of the criticisms levelled against the Fed's renovation of two historic office buildings, which have ballooned in cost.\n\n\n\nThe White House did not immediately respond to a message seeking comment.\n\n\n\n\n\nThe justice department in a statement said it can't comment on any particular case, but added attorney general Pam Bondi \"has instructed her US attorneys to prioritise investigating any abuse of taxpayer dollars\".\n\n\n\n\n\nWith the subpoenas, Powell becomes the latest perceived adversary of the president to face a criminal investigation by the Trump administration's justice department.\n\n\n\n\n\nTrump himself has urged prosecutions of his political opponents, obliterating institutional guardrails for a justice department that for generations has taken care to make investigative and prosecutorial decisions independent of the White House.\n\n\n\nREAD MORE What would the fallout be if Donald Trump tries to fire the Federal Reserve chief?\n\nThe potential indictment has already drawn concern from one Republican senator, who said he'll oppose any future nominee to the central bank, including any replacement for Powell, until \"this legal matter is fully resolved\".\n\n\n\n\n\n\"If there were any remaining doubt whether advisers within the Trump administration are actively pushing to end the independence of the Federal Reserve, there should now be none,\" said North Carolina senator Thom Tillis, who sits on the banking committee, which oversees Fed nominations.\n\n\n\n\n\n\"It is now the independence and credibility of the Department of Justice that are in question.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/lost-that-competitive-edge-alyssa-healy-announces-retirement-from-cricket-20260113-p5ntjo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Alyssa Healy’s decision to retire was made alone. She knew the time had come",
        "publish_date": "Tue, 13 Jan 2026 12:51:39 +1100",
        "category": "sports",
        "authors": [
            "Frances Howe"
        ],
        "text": "On Tuesday morning, Australian women’s cricket captain Alyssa Healy met her mum, dad and husband for a coffee before training. The trio have long been Healy’s counsel, but for the most important decision of her career, she had barely conferred with them.\n\nInstead, earlier that morning and without much input from anyone else, Healy’s retirement from all forms of cricket was announced. After next month’s multi-format series against India, she will retire as captain, some 16 years after making her debut for the national team.\n\nAustralian cricket captain Alyssa Healy calls time on her career. Credit: KATE GERAGHTY\n\n“I just made it and told them, and off we went,” Healy said at NSW Cricket headquarters at Sydney Olympic Park on Tuesday.\n\nSome mental fatigue had been dawning on Healy’s career, and that is what calcified the 35-year-old’s decision before anyone else could have a say.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/playground-surfaces-up-to-63-degrees-20260112-p5nt8i.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Playground surfaces up to 63 degrees",
        "publish_date": "Tue, 13 Jan 2026 12:16:48 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/how-alyssa-healy-took-her-chance-and-launched-a-golden-era-for-australian-women-s-cricket-20260113-p5ntld.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How Alyssa Healy took her chance and launched a golden era for Australian women’s cricket",
        "publish_date": "Tue, 13 Jan 2026 11:56:13 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "With a typically cheeky quip about the need to spend more time on her golf, Alyssa Healy drew the curtain on one of Australian cricket’s most game-changing careers.\n\nIt was not a huge surprise to hear that Healy, 35, had decided now was the time to give up cricket, with a farewell series against India to give supporters one final chance to salute her.\n\nAlyssa Healy announced her retirement from international cricket on Tuesday. Credit: Kate Geraghty\n\nInjuries had afflicted each of her past two World Cup campaigns for Australia, neither of which ended with the world’s most feared team reaching the tournament final. The side is regenerating, and Healy’s exit will advance that process.\n\nBut there can be no doubt that its future direction will be shaped in large part by the type of aggressive, barnstorming cricket that Healy had done so much to embed as the trademark of the most trophy-laden national sporting team on the planet.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/climate-change/fires-floods-swimsuits-and-jumpers-in-one-day-climate-whiplash-is-our-new-normal-20260113-p5ntlb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Fires, floods, swimsuits and jumpers in one day: ‘Climate whiplash’ is our new normal",
        "publish_date": "Tue, 13 Jan 2026 11:54:09 +1100",
        "category": "finance",
        "authors": [
            "Samantha Selinger-Morris"
        ],
        "text": "Advertisement\n\nListen EnvironmentClimate changeExtreme weather Fires, floods, swimsuits and jumpers in one day: ‘Climate whiplash’ is our new normal Samantha Selinger-Morris January 13, 2026 — 11:54am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWhy it matters The climate is no longer playing by the old rules, making it difficult to reliably forecast what’s going on.\n\nWhat we do know is that “hydroclimate whiplash” or “climate whiplash” is becoming our new normal.\n\nBuilding community capacity is vital to coping with the new extreme weather systems that are emerging.\n\nAdvertisement\n\nSelinger-Morris: One thing I really wanted to ask you about, which I think a lot of Australians would have been thinking about in particular over the last few days, is the wildly different weather we’re seeing at the same time. So you’ve got bushfires in one part of the country ... then you’ve got floods and cyclones in Queensland. Meanwhile, I’m recording in Sydney and within about 24 hours just the other day, we went from searing temperatures over 40 degrees to then quickly needing jumpers. Why is this happening? Related Article Analysis\n\nExtreme weather The official temperature was 42 degrees – but western Sydney felt as hot as 55 degrees Bowman: We’re seeing this extraordinarily unstable climate ... [what] we’re learning as we’re going is that the Earth system and the climate system is really very complicated. When you start putting more energy into the atmosphere … the energy expresses itself in extraordinary ways. So we have, as we know, these extraordinary downpours and flooding events, we have these periods of just amazing rain. We’re seeing this as well in California. So you get these very wet periods, you get flooding. You can get an interaction of the flooding with burnt areas. And then before you know it, you can switch back to drought ... and then, to add insult to injury, we’ve been getting these incredible windstorms, and windstorms go with wind-driven fires, and wind-driven fires are just the worst because they move so quickly.\n\nAdvertisement\n\nBowman: The growth rate is so high. Extremely difficult to fight, very difficult to use aircraft because the atmosphere is… you’ve got a windstorm, and then you also have... what we’ve seen in Victoria, which is just mind-bending, is these fire thunderstorms where you get such incredible intense fires that they generate their own weather systems, and they are, again, horrible things to contemplate, very difficult things to fight. A packed Sydney beach on Saturday, when Victoria battled bushfires and Queensland endured floods. Oscar Colman Related Article Analysis\n\nExtreme weather Heatwave Hayley? It’s time to name these ‘supercharged’ weather events So what we’re really describing is what’s being called in fire science “hydroclimatic whiplash”, this climate whiplash where we’re … going from wet to dry, wet to dry. So we’ve got this flickering between these states. Then, within our fire seasons, we’re seeing extreme heat waves, extreme wind events, and then you get the conjunction of an extreme heat wave and extreme wind event. We’ve just seen what happens. It’s just absolutely horrendous.\n\nAdvertisement\n\nSelinger-Morris: I wanted to ask you about what you’ve just mentioned there, which was climate whiplash or hydroclimate whiplash. How is climate change causing or driving this? You know, fires in one part of the country, floods in another. What’s happening here? Loading Related Article Victoria bushfires Fire at the door, skylights melting: How 60 people were saved from flames Bowman: What’s happening is basically that the old weather patterns are breaking down ... one of the reasons it’s going to become increasingly difficult to forecast weather is because we’re getting all of these complex interactions between sea surface temperatures. Wind fields are changing because the high-pressure systems are moving further south. We’re getting all sorts of complicated interactions at a planetary scale, and then that plays out at local scales. I mean, often I’ve been looking at synoptic charts and just puzzled at the complexity of them because new emergent weather patterns are becoming created.\n\nAdvertisement\n\nAnd that is a really important point ... it’s not a criticism that this terrible fire season wasn’t adequately forecast ... what we know from the past isn’t necessarily scaling well into the future. We do know about what are called inter-annual climate modes ... we have names for them, like the Indian Ocean Dipole and the La Niña, El Niño phenomenon. But when you heat up the planet, those things start expressing themselves in new ways. Loading Bowman: We’re seeing different sorts of weather systems emerging. So for instance, the west coast of Tasmania was classically a very, very wet place. And it’s undergoing a drying trend just in the same way that the ocean currents are changing. So this makes it very, very difficult to reliably predict or forecast what’s going on. We’re absolutely certain that the climate is going to change because of increased greenhouse gas pollution. But exactly how that will play out this summer or next summer becomes more and more difficult ... that’s where we’re really involved as a learning as we go. And that’s why research and development and really good monitoring is so important because ... we’re almost rediscovering, or discovering, a new climate as it’s evolving and emerging.\n\nAdvertisement\n\nRelated Article Heatwave ‘Grumpy, exhausted and really unwell’: How to cope with heatwave nights And this is where building community capacity is going to be so important. Communities have to be on this awareness that, as we’ve seen, situations can escalate extremely quickly because the climate is not playing by the old rules. It’s a different beastie. To hear more about how communities and governments can prepare for the increasingly devastating impacts of climate change, and what pyrogeography even is, listen to the podcast episode in the player above or click here. Hear the story behind the headlines on The Morning Edition podcast, every weekday from 5am on Apple, Spotify or your favourite podcast platform.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/consumer-affairs/ai-bots-could-collude-to-fix-prices-and-harm-consumers-accc-chair-20260112-p5nteb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AI bots could collude to fix prices and harm consumers: ACCC chair",
        "publish_date": "Tue, 13 Jan 2026 11:53:24 +1100",
        "category": "finance",
        "authors": [
            "Elias Visontay"
        ],
        "text": "Advertisement\n\nExclusive BusinessConsumer affairsAI AI bots could collude to fix prices and harm consumers: ACCC chair Elias Visontay January 13, 2026 — 11:53am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nConsumer tsar Gina Cass-Gottlieb has sounded a warning over the proliferation of artificial intelligence systems in online retail, saying bots deployed by rival businesses could collude to fix prices. Speaking to this masthead, the Australian Competition and Consumer Commission (ACCC) chair highlighted the risks of AI “agents” or bots, which will be a key focus for the watchdog this year. AI-powered bots can act on behalf of consumers, but there is a risk they are tricked into higher-cost deals. Michael Howard As well as highlighting the risk of cartel conduct by AI-powered bots, Cass Gottlieb also warned of AI’s potential to “supercharge” scams, and an emerging trend among companies of overplaying the extent to which machine learning actually features in their software or products to justify charging consumers more, in a practice dubbed “AI washing”. Cass-Gottlieb said a key concern for the regulator in 2026 would be the rise of AI agents, which have risen in prominence over the past year as tech companies race to release more sophisticated models.\n\nAdvertisement\n\nArtificially intelligent bot “agents” can act on behalf of a user to search for products, compare prices and execute transactions based on previously gathered information on their needs and preferences. Related Article AI Would you let a bot choose your insurance for you? Equally, AI agents can be used by companies to tailor marketing to specific consumers, as well as conduct other business such as sourcing products and dealing with suppliers. Multi-agent systems, where several AI agents work together on a shared goal, are increasingly used by businesses to boost efficiency. Cass-Gottlieb said that AI agents could also collude with each other to fix prices, meaning that consumers comparing prices might be misled into accepting prices that aren’t the cheapest. Even AI agents acting on behalf of a shopper could be fooled into such purchases. Her warning comes as an ACCC research paper found that while AI agents had the potential to help shoppers and firms, “as businesses increasingly incorporate AI agents, agent-to-agent communications and dealings will become more commonplace”.\n\nAdvertisement\n\nAI’s ability to learn from a customer’s personal data means it can manipulate their preferences and the purchasing decisions of an AI agent they’ve deployed, more effectively than traditional nudges, the ACCC has found. ACCC chair Gina Cass-Gottlieb said the rise of AI-powered bots raised the risk of cartel conduct. Edwina Pickles Even without an AI agent acting for a consumer, AI agents deployed by businesses can use personal data to tailor marketing to an individual’s real-time consumer behaviour such as their emotional vulnerabilities, something that would amount to a “hypernudge” in pressuring them into a sale. In terms of cartel conduct, while some businesses could instruct algorithms to price fix deliberately, the ACCC has warned the widespread use of AI agents by businesses could give rise to the risk of AI agents “learning to collude with one another, even when collusion is not intended by their developers or operators”. It referenced research that “competitors using the same AI agent may end up exchanging competitive pricing information, without knowing or intending to do so”.\n\nAdvertisement\n\nOn Monday, Cass-Gottlieb said “there are some pretty serious risks for cartel conduct. “There have already been some cases internationally looking at algorithmic collusion, so looking at the problem of anti-competitive conduct and once you ask the question whether AI systems are intelligent enough to work out that it is in the interests of the people deploying them to co-ordinate their conduct,” Cass-Gottlieb said. Related Article Food On gelato and in coffee: Australian olive oil’s health-led boom She referenced a recent matter in the United States where the Department of Justice reached a settlement with a real estate platform over allegations an algorithmic rent-setting software allegedly allowed landlords to compete less and boost prices they charged tenants. “There is manifestly a capacity for this to be done at an incredibly sophisticated level, informed by highly up-to-date data with very rapid analysis using AI,” Cass-Gottlieb said.\n\nAdvertisement\n\nIn such cases of algorithmic collusion, the ACCC has noted businesses “may lead to corporations disputing their liability for the outputs or actions” of their agents. However, a Treasury review of AI and consumer law in October found that existing laws were suitable. Cass-Gottlieb said it was important for laws to keep pace with the development of AI technology to ensure Australians weren’t worse off in the end. “The hope is that it’s a net positive, that it enables better informed consumers … (but) the fear is that it enhances the capacity to do these sorts of negative (methods)“. Increasingly sophisticated AI-image, voice and website generation is also a prime concern for the ACCC. Fake reviews are another issue Cass-Gottlieb expects to grow worse with AI’s proliferation, due to its ability to generate convincing reviews. It also means that ghost stores are easier to set up, she said. These are websites purporting to be the online presence for local bricks-and-mortar small businesses running closing down sales but which don’t actually exist and instead “drop-ship” poor quality products from overseas. “It can supercharge scams, so that the messages that we receive just appear so much more believable because they’re targeted to us in a more effective and believable way, even before you ask about AI voice replication,” Cass-Gottlieb said. The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/technology/apple-s-gemini-deal-a-win-for-google-but-will-it-make-your-iphone-smarter-20260113-p5ntk7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Apple’s Gemini deal a win for Google, but will it make your iPhone smarter?",
        "publish_date": "Tue, 13 Jan 2026 11:49:02 +1100",
        "category": "finance",
        "authors": [
            "Tim Biggs"
        ],
        "text": "Advertisement\n\nAnalysis TechnologyAI Apple’s Gemini deal a win for Google, but will it make your iPhone smarter? Tim Biggs January 13, 2026 — 11:49am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nApple’s future artificial intelligence (AI) features, including a revamped Siri assistant due to arrive this year, will be powered by Google as the two tech giants have announced an agreement that could potentially shake up how AI works in smartphones. The specifics of the deal are still unclear, with a brief joint statement from the two companies saying only that the next generation of Apple AI models will be based on Google technology, but will continue to use Apple’s “Private Cloud Compute” architecture. The statement was published on Google’s blog. Apple’s iPhones will soon be powered by new AI features built on Google tech. The announcement comes after years of pressure from analysts and investors for Apple to plug a perceived AI gap, with the company drip-feeding elements of its “Apple Intelligence” suite and delaying its new Siri while competitors raced ahead with experimental generative AI. The development is obviously a win for Google, and for Wall Street’s AI hype-pushers. Parent company Alphabet briefly broke above a $US4 trillion ($5.9 trillion) market capitalisation on Tuesday as shares rose 1.7 per cent following the announcement, making it the second-largest firm after Nvidia.\n\nAdvertisement\n\nRelated Article Opinion\n\nAI Does Apple really need to become an AI company? Tim Biggs Consumer Technology Writer Wedbush Securities analyst Dan Ives said the move was what the Street had been waiting for, “a stepping stone to accelerate [Apple] AI strategy into 2026 and beyond”. The deal could be a threat to Samsung, which also leans heavily on Google AI to differentiate its phones from Apple’s, and to OpenAI which wants its ChatGPT to find a home on iPhones. But what will the development mean for consumers? On the one hand, the tech industry’s enthusiasm for AI is far greater than the average phone user’s need for more generative features. An OPPO Australia survey published in October found only four per cent of respondents thought AI was an important factor in choosing a phone. Behind the scenes, AI can positively affect smartphone elements people actually care about – improving battery life, maximising storage space, powering computational photography – but the more language-focused or creative elements explicitly marketed as AI have received a lukewarm welcome.\n\nAdvertisement\n\nThe buzziest of Gemini capabilities, including real-time voice conversations and image generation, have proven to be hit-and-miss, while the chatbot itself continues to struggle when it comes to serving reliable and verified information without invention or confusion (and Gemini is not alone in this). By hitching a core part of its smartphone experience to Google’s wagon, Apple could make it much more difficult for consumers to find an AI-free path to information. Editor's pick AI Google’s Gemini 3: What’s new and what can it do? On the other hand, Apple has arguably proven itself to be the most cautious and trustworthy of the tech giants when it comes to AI. If it uses Google’s raw resources to create responsible features, the iPhone could become a superior overall platform for AI. If consumers consider the major issues with these features to be around privacy, utility and seamless integration, Apple is ideally positioned to deliver an experience that’s preferable to what is currently found on Pixel and Galaxy phones. However, the iPhone-maker also has other challenges ahead of it. It appears determined to deliver the more personal, more context-aware AI Siri it originally promised years ago, but it needs to find a way to avoid the problem Gemini and ChatGPT have with lying and overconfidence.\n\nAdvertisement\n\nApple also runs platforms favoured by the creative industry, and will likely want to avoid the perception that its technology is based on art that Google has scraped and repurposed behind creators’ backs. The final piece of the puzzle will be price. Consumers currently pay Apple subscription money for tangible benefits including cloud storage and premium news content, but will the company charge for high-end AI like Google and OpenAI do? Perhaps unsurprisingly, analysts view that as inevitable. “This was a necessary move for Apple to deliver its own personal assistant within its hardware ecosystem, while expecting to deliver a new subscription-based revenue stream to the largest consumer installed base in the world,” Ives said. Get news and reviews on technology, gadgets and gaming in our Technology newsletter every Friday. Sign up here.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/emotional-hunter-elated-with-aus-open-return-win-20260113-p5ntno.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "'Emotional' Hunter elated with Aus Open return win",
        "publish_date": "Tue, 13 Jan 2026 11:48:34 +1100",
        "category": "sports",
        "authors": [],
        "text": "'Emotional' Hunter elated with Aus Open return win\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/the-simple-fix-that-is-saving-the-lives-of-very-young-children-from-drowning-20251014-p5n2gj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The simple fix that is saving the lives of very young children from drowning",
        "publish_date": "Tue, 13 Jan 2026 11:45:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Julie Power"
        ],
        "text": "Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Share A A A\n\nWhat’s in a name? If you are the celebrated Professor Jagnoor Jagnoor, it adds up to a legacy of defying racist, religious and sexist stereotypes. A question about her name is one that Jagnoor, an epidemiologist and the head of injury prevention at the George Institute for Global Health, anticipates when we arrange lunch at Mediterranean-influenced restaurant St Siandra, near the Spit Bridge in Sydney. It is often the first thing others ask the global drowning prevention expert or quietly ask people who know her before they meet. Despite knowing Jagnoor for a decade while reporting on water safety, I have never questioned her about it. (Maybe it is because my full name is Julie Anne Julie Power, a weird family story.) Jagnoor’s name was a snub to convention by her mother, Dr Manmeet Kaur, a health promotion educator. Called a tautonym, it is a bit like being called Thomas Thomas. Unusual for India, it was her mother’s way of rejecting the practice of naming a child in a way that immediately pigeonholes religion and caste. “[My mother] was progressive for her time,” says Jagnoor, who moved to Australia more than 20 years ago to do a master’s degree in public health (and ended up staying, marrying and having two children). Between delays caused by roadworks, Mosman Council’s temperamental parking meters, the arrival of photographer Edwina Pickles, and me getting lost, it takes us time to settle into St Siandra and order.\n\nAdvertisement\n\nJagnoor chose the restaurant because it is near water, the foundation of civilisation, a source of joy to many, and sorrow to the families of the 300,000 around the world who fatally drown every year. She has been instrumental in reducing drowning rates in parts of the world where the equivalent of a kindy class of children aged one to five from the poorest of families fatally drowns every week. That compares with one kindy class a year in Australia. Jagnoor chose a restaurant near water, a source of life but also heartache. Edwina Pickles The fix? Jagnoor worked with local communities to establish small free creches that provide supervision and preschool education for children who live near ponds and other water bodies while their mothers work. It lifts all boats. Described by Jagnoor as the “least glamorous fix for the biggest ripple effect”, these creches reduce the risk of drowning by more than 80 per cent, improve the employment of women, and kickstart the education of young children. But more on that later. To start with, Jagnoor recommends the flat bread, something she makes three times a day. “Food is a love language,” she says. Everything in her home is made with ginger and garlic, she confides, a precursor to a delightful discussion about the joys of Indian lime pickle.\n\nAdvertisement\n\nOver the potato flatbread with smoked garlic and some roasted cauliflower, both as good as she promised, Jagnoor sums up her backstory. An only child, she was born in Chandigarh in north-western India to two progressive academics in an era when India appeared to be embracing the Chinese one-child policy that also favoured boys over girls. Potato flatbread at St Siandra. Edwina Pickles If her parents had followed Sikh convention, her surname would’ve been Kaur. “My mother thought: ‘I have one child. I have a daughter, and I’m not going to give her a surname. It represents your religion and your caste. And if you want to have equity in society, you don’t want to have those hierarchies’.” “She always said, ‘I never want you to be boxed in, I would like you to be a global citizen’. “You were born a human,” her mother told Jagnoor. “We all are, and then we are tagged and labelled in different ways. I would like you to die a human.” “I hold that dear to my heart,” Jagnoor says.\n\nAdvertisement\n\nJagnoor – a vegetarian – orders the eggplant katsu, and I order the hanger skewers and a salad. We both drink tap water. When her main course arrives, I have FOMO. The eggplant is crunchy and crisp, and when she cracks it open, it oozes with creaminess. She gives me a taste. Then another. My skewers are good, but not quite as delicious. Over lunch and follow-up chats, Jagnoor talks about prejudice towards people with brown skin in global research, and a bias that results in academics from the Global North being deferred to and given first credit rather than local experts. The eggplant is crisp on the outside but creamy inside. Edwina Pickles As someone who lives in Castle Hill but was born in India, who works in Sydney (at the George Institute and UNSW) but travels to the subcontinent for work and family, Jagnoor sees herself as a kind of “double agent” able to navigate both worlds. Australia is home to more than 900,000 people born in India, the most recent census found, and Indians are one of the nation’s fastest-growing population groups. Jagnoor, voted one of the 40 most influential Asian-Australians under 40 a few years ago, says they are underrepresented in leadership roles like hers.\n\nAdvertisement\n\nOriginally graduating as a dental surgeon in India, hearing an interview about an undertaker who worked in Delhi’s slums changed her life. The undertaker said he had found a little girl cuddling her dead father’s body, seeking warmth in Delhi’s bitter winter. “Because there was no clothing, no blankets,” Jagnoor explains. “It was that level of poverty and inequity in a city that has so much affluence.” Raised to believe that health and education are great equalisers, she switched to studying a master’s in public health at Sydney University, intending to devote herself to overcoming inequality. While undertaking a doctorate and coming across a chart relating to the so-called Million-Death Study, which identifies the causes of death in India, she found her calling. “I realised that ... drowning is the leading cause of death for children aged one to three,” she says. The chart that opened Jagnoor Jagnoor’s eyes, showing the steep rise of children who died from drowning from one to five in India Jagnoor Jagnoor “I was looking at a line diagram – I still have that figure right in front of my eyes – where on your X axis, you have your age groups, and you’re looking at zero to one, one to two, etc. and you see this steep line going up. “And you look at that variable, and the cause of death is drowning. That number, having that evidence, was definitely the triggering thing.”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/rozlyn-hand-cut-73-000-pieces-of-glass-for-the-qvb-now-the-landlord-wants-them-removed-20260108-p5nsmi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rozlyn hand cut 73,000 pieces of glass for the QVB. Now the landlord wants some removed",
        "publish_date": "Tue, 13 Jan 2026 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "Cindy Yin"
        ],
        "text": "Advertisement\n\nExclusive NationalNSWCity life Rozlyn hand cut 73,000 pieces of glass for the QVB. Now the landlord wants some removed Cindy Yin January 13, 2026 — 11:30am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nWhen glass apprentice Rozlyn de Bussey landed a prestigious job to restore the Queen Victoria Building in the 1980s, she didn’t think much of it – the 23-year-old was more interested in using her breaks to try every yum cha restaurant in Chinatown. “Being so young, I just felt like it was part of being an apprentice, I didn’t really give it much curiosity until much later on,” de Bussey, now 68, said. Rozlyn de Bussey worked on the QVB in her early 20s. Since then, she has worked full time as a glass artist. Alex Ellinghausen Now the city is staring down a proposal from retailers who want to replace the QVB’s coloured glass on the ground floor on Market Street with clear glass, which greatly “saddened” de Bussey. From 1985 to 1987, de Bussey and her fellow apprentices embarked on a labour-intensive refurbishment process, cutting more than 73,000 pieces of glass “from morning until night”.\n\nAdvertisement\n\n“Internal, external, we cut every bit of glass in the QVB,” she said. “It was tedious and laborious. We were beginners, but good beginners. You’re working fast, you’re diligent in what you’re doing, and you’re getting the work done efficiently.” They worked offsite at a Pyrmont factory, using templates and patterns of varying sizes to guide their work before the glass was transported and installed at the QVB. There were no traces of any blueprints for the centre panel in this QVB arch, so artists had to come up with a new design. James Brickwood “Precision is everything,” according to de Bussey. “If you’re a millimetre off at the bottom of a building, you’re going to be 100 millimetres off at the top.” Some of her fondest memories as a young glass artist were forged during her two-year stint working on the QVB. Even after more than 30 years, she feels prouder than ever for the opportunity.\n\nAdvertisement\n\nRelated Article Heritage ‘If it ain’t broke, don’t fix it’: Retailers want to scrap the QVB’s stained-glass windows She said any retailer “should be proud to be in the building”. “It’s vital to actually keep what’s there and appreciate it. Even to replace it with modern glass today, it would probably cost a lot more than what it did,” de Bussey said. And it isn’t the first time there has been a push for change. In 1959, the QVB faced complete demolition when then-lord mayor of Sydney Harry Jensen announced plans to replace the building with a civic square and car park.\n\nAdvertisement\n\nAlthough it was saved, the building remained idle as debate over its fate swirled for decades before it was classified by the National Trust in 1974. Lord Mayor Clover Moore was on the council committee that approved the restoration in the 1980s, and said the QVB was one of her favourite buildings in Sydney. These stained-glass windows outside Market St could be replaced with clear ones if a development application is waved through. Louie Douvis “The Queen Victoria Building is an icon, and one of our most important heritage buildings in the City,” Moore said. “Today the QVB stands in all her glory, testimony to the original vision for the building and the superb craftsmanship of the artisans who put it all back together again.”\n\nAdvertisement\n\nWho else was part of the glass restoration efforts? Standing underneath the QVB’s vast central dome that is 19 metres wide and 58 metres tall, it is difficult to imagine how one person could have painted all the glass – but that was precisely what glass artist Rodney Marshall did. Rodney Marshall painted the QVB’s central dome, which spans 19 metres. James Brickwood Rodney Marshall was one of the glass painters behind the 1980s refurbishment of the QVB. James Brickwood Marshall and his business partner Steve Taylor won a competitive tender process, and in 1985 were tasked with the mammoth effort to restore and repaint almost every glass panel in the building, with the help of apprentices such as de Bussey.\n\nAdvertisement\n\n“We didn’t think we’d get the job, there were a few people quoting. We were very excited about the whole thing,” Marshall said. Rodney Marshall working on the QVB in the 1980s. Shockwaves from the nearby 1978 Hilton Hotel bombing caused extensive damage to the QVB and presented the pair with further challenges, but together they meticulously combed through council archives, library records, architect designs, and even the Herald’s own archives to piece together accurate blueprints of the original glass. When he could not find any design traces for one of the main windows, Marshall opted to paint the panels with original designs instead. The process also involved removing the windows, measuring them, cutting glass with templates, painting the panels, kiln firing, coating the glass with putty, and then reinforcing it with steel bars for added strength.\n\nAdvertisement\n\n“It was a huge job, with long hours and some days that ended at 9 or 10pm. But it was a wonderful thing to work on – there was no doubt about it,” the 84-year-old said. Working with glass was an extremely tedious and meticulous process, Marshall said. And while Marshall’s intricate glass windows aren’t the ones on the chopping block – the ones that could be scrapped were glazed by a different company – he is adamant that nothing of heritage significance should be removed from the QVB. Related Article Opinion\n\nTravel tips The world has hundreds of stunning arcades. Australia’s are under threat Lee Tulloch Travel columnist “I don’t think many tourists would come to Sydney and head down to a big financial building – but they’ll go and look at the QVB. I hope people appreciate it,” he said.\n\nAdvertisement\n\nA spokesperson for Vicinity Centres – the country’s second-largest retail landlord and co-owner of the QVB – said the changes were “minor adjustments”, which, if approved, would “improve natural light and visibility while maintaining architectural consistency along this key streetscape”.\n\n\n\nThe City of Sydney’s local planning panel will determine the outcome after public submissions close on February 6. Start the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/money/investing/at-76-vicki-turned-her-family-group-chat-into-an-investing-club-20260113-p5ntme.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "At 76, Vicki turned her family group chat into an investing club",
        "publish_date": "Tue, 13 Jan 2026 11:16:32 +1100",
        "category": "finance",
        "authors": [
            "Nina Hendy"
        ],
        "text": "Advertisement\n\nMoneyInvestingActive investing At 76, Vicki turned her family group chat into an investing club Nina Hendy January 13, 2026 — 11:16am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nDiscussing finances and investing is close to taboo in most families, but that’s not the case for grandmother Vicki Price. Instead, she actively encourages it. Having spent more than 30 years investing, the 76-year-old has made it her mission to openly discuss which investments and asset classes have worked – and importantly, which haven’t – with the women in her family. For many families, discussing money can feel awkward or taboo. Dominic Lorrimer Price has overseen her own share portfolio on behalf of herself and her husband since she was in her late 50s, so she feels well-equipped to drive the family conversations. While she admits it was a case of trial and error in those early days, she’s since learned the benefit of leaving investments time to mature, and how to research companies she wants to invest in over the years.\n\nAdvertisement\n\nVicki Price, 76, has made it her mission to educate her family about investing. “I’m the one that pushes things along after a bit of research, sharing what I’ve learned with my two daughters, my granddaughter and my sister,” Price says. For years, family group chats and get-togethers have quickly turned to the topic of who has been investing in what, and what the returns have been like. “It’s not so much about me giving advice, but more about sharing what each of us are investing in, and what returns we’re achieving.” Price started investing out of necessity in the beginning, hoping she could build her retirement savings. “When we reached our early 50s, we didn’t have much saved as we had been raising kids, so I was looking to build the nest egg.”\n\nAdvertisement\n\nPrice started out with a CommSec portfolio, but now uses Stockspot to invest in exchange-traded funds (ETFs). Others in her family invest in silver, property and shares. Over the years, her investment portfolio has experienced steady growth. Price says her husband doesn’t have much interest in investing, so leaves her to make the decisions. “I always do my homework, researching all the big investment companies and looked at their returns, and I could see you were just a small cog in a big wheel, and I didn’t like that.” Over the next decade, women are expected to inherit and control approximately 65 per cent of the nearly $5 trillion set to change hands in the largest intergenerational wealth transfer on record. This will see women become the primary decision-makers for family budgets and wealth creation. So, it’s perhaps not surprising that a growing number of women are turning to investing, now accounting for 42 per cent of investors with active holdings – up 18 per cent over the past three years.\n\nAdvertisement\n\nDespite ongoing efforts to close the gender gap, women still trail men in finances. The average Australian woman has $428,000 in net wealth, compared to $597,000 for men – a 40 per cent gap. This comes down to factors such as lower workforce participation, the gender pay gap and more time spent out of the workforce raising children, along with superannuation disparities. Editor's pick Opinion\n\nKids & money The best financial gift you can give your kids – beyond doubt Victoria Devine Money columnist This year has seen all previous Australian ETF inflows records broken, with investors channelling $15.8 billion into the asset class in the September quarter alone, according to ETF provider Vanguard Investments. ETFs have taken off because people want a simple way to invest without the stress of picking stocks, says Chris Brycki, founder and chief executive of Stockspot. People know they’re not betting on one company, they’re buying the whole market, he says, adding that ETFs are designed for patience.\n\nAdvertisement\n\n“You can have good years and bad years. The magic happens when you stay invested through the full cycle. We recommend a time horizon of at least three to seven years for the best chance of success.” Advice given in this article is general in nature and is not intended to influence readers’ decisions about investing or financial products. They should always seek their own professional advice that takes into account their personal circumstances before making any financial decisions. Expert tips on how to save, invest and make the most of your money delivered to your inbox every Sunday. Sign up for our Real Money newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/my-best-beach-20251229-p5nqk2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "My best beach",
        "publish_date": "Tue, 13 Jan 2026 11:14:50 +1100",
        "category": "entertainment",
        "authors": [],
        "text": "Maybe Max and I were on the same page when it came to appreciating the beauty, the solace and simplicity of this special place.\n\nJanuary 12, 2026\n\nGeorgie Gardner",
        "source": "TheAge"
    }
]