[
    {
        "url": "https://www.9news.com.au/world/audi-holding-cars-in-us-ports-after-donald-trump-tariffs/328ccc3f-f43d-42fc-a1f1-fc7a11184ae1",
        "title": "Volkswagen thinks its cars are better off here than the showrooms",
        "publish_date": "Tue, 08 Apr 2025 00:53:21 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "T﻿ens of thousands of foreign-made cars are reportedly being held in US ports following US President\n\nDonald Trump's\n\nimposition of tariffs on auto imports last week.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/huge-thunderclap-as-tornado-rips-through-new-zealand-town-of-levin/bcbc7802-d271-4023-9b20-75bd1874f0cc",
        "title": "Tornado rips off roofs, topples fences and sends trampolines flying in NZ town",
        "publish_date": "Tue, 08 Apr 2025 01:09:14 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Video shows the moment a tornado hit Levin, leaving a trail of destruction.\n\nTrish Wilkinson was laying in bed when she heard what she described as a huge thunder clap on Tuesday morning.\n\nIt was a tornado hurtling through the small town, taking off roofs, toppling fences and sending trampolines flying.\n\nThere was extensive damage after the tornado ripped through Levin. (Supplied)\n\nShe said a trampoline and a fence had been damaged near her property by the weather.\n\nAnother resident, who didn't want to be named, told Stuff he was sitting in his lounge when he heard the rain begin.\n\n\"And then it got heavier and heavier and heavier, and then the house really shook, and I heard a lot of noise and [a] bang and commotion.\"\n\nREAD MORE: Trump threatens China with monster new tariff as global markets plunge\n\nThe moment a tornado rips through Levin, tree falls on SH1. (Supplied)\n\nHe said when he walked outside came outside the first thing he noticed outside the front door was a trampoline.\n\n\"Further, I saw my tree on the footpath, I went to the back of my house and saw [the] dividing fences between two neighbours had fallen down and my own fence to Wilton St was destroyed.\"\n\nFire and Emergency assistant commander Craig Gold said the town was a \"madhouse\", with sheds left as bits of tin, and trampolines turning into kites.\n\nGold said the tornado came through the town at 7.45am, heading down the west of the Adventure Park, along the main road and down Wilton St before lifting off at Playford Park.\n\nHe said it had caused significant damage to a number of properties, but there were no reports of injuries.\n\nCrews were responding to several callouts for broken fences, downed trees and there was significant damage at the Top 10 Holiday Park.\n\nSheds at the site had been lefts as bits of tin, he said.\n\nGold was with Horowhenua mayor Bernie Wanden, and said the council had activated its emergency operations centre.\n\nHe said Levin was a madhouse, and trampolines had turned into kites and were everywhere.\n\nHe said a number of trees on Oxford St had been cleaned up, but State highway 1 was blocked.\n\nThe council said initial reports indicated the tornado took down trees, impacted utilities lines and lifted roofs and fences.\n\n\"Contractors are out responding and clearing drains. Fire and Emergency have been activated, with a diversion on Oxford Street due to a fallen tree. Arborists are currently working to clear the road.\"\n\nThey said the main damage was on Wilton and Carlisle streets.\n\nDamage was also reported at Waikato beach, a beach township south of Levin.\n\n\"Emergency Management crews are currently checking on affected residents. Minimum flooding has been reported.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/finance/interest-rate-cut-expected-in-may-amid-global-economic-uncertainty/9009b72a-c8f2-471f-94d8-cae0d8154b5e",
        "title": "Treasurer flags 'multiple' interest rate cuts amid market turmoil",
        "publish_date": "Mon, 07 Apr 2025 22:20:55 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Treasurer Jim Chalmers has given mortgage holders hope today, revealing market volatility sparked by Donald Trump's tariff war could trigger interest rate cuts this year.\n\nChalmers yesterday highlighted forecasts by bond markets the Reserve Bank of Australia would slash the cash rate up to four times this year, and even a 50 basis point cut next month.﻿\n\nBut fund manager and investment expert Jun Bei Liu played down such a radical move by the RBA.\n\nREAD MORE: Trump threatens more tariffs on China as global markets plunge\n\nTreasurer Jim Chalmers has talked up the prospect of multiple interest rate cuts later this year. (Photo: Alex Ellinghausen) (Alex Ellinghausen)\n\n\"That's very unlikely. We will get a rate cut. It looks like it's about 25 basis points.\" she told Today this morning.\n\n\"It's just not how the RBA works. I know globally share market is moving in a very volatile, volatile manner, but 50 basis points is just not how they work.\"\n\nDespite the turmoil on currency and share markets, Chalmers insisted ﻿Australia could weather the economic turbulence.\n\n\"What we're seeing here is the impact of a series of bad decisions taken about tariffs and the whole world is trying to get their head around the impacts on their own economies and the global economy, as well,\" he said.\n\nBut Chalmers also cautioned the federal government expects Australian GDP to take a hit and prices of some goods will rise.\n\nAll eyes will be on the Australian sharemarket today amid global uncertainty over US tariffs. (Photo Louie Douvis/AFR) (Louie Douvis)\n\nTreasury data released yesterday showed the US tariffs will deliver a \"modest\" 0.2 per cent hit to GDP by the end of next year, and just 0.1 per cent by 2030.\n\nInflation, meanwhile, is expected to be 0.2 percentage points higher this year this year due to the new taxes imposed on imports into the US.﻿\n\nLiu says Australian shares are expected to rebound today after they suffered the worst one-day loss since 2020 yesterday.\n\n\"But now we don't have a pandemic. We've got Donald Trump ... It can change very quickly,\" she said.\n\nDo you think the world is heading towards a recession? Yes 5899 No 677",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/donald-trump-tariffs-anger-us-billionaires-business-leaders/f9c0c63b-3f9d-442f-aaf5-df5065aa86de",
        "title": "'Stupid, wrong': Billionaire supporters turn on Trump as tariffs bite",
        "publish_date": "Mon, 07 Apr 2025 21:02:11 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Wealthy business leaders are turning on US President Donald Trump over his plan to impose a colossal set of tariffs on America's trading partners, as losses mount on stock markets around the world.\n\nBillionaire investor Bill Ackman, who endorsed Trump's 2024 presidential bid, warned yesterday that going ahead with the new tariffs was tantamount to launching an \"economic nuclear war.\"\n\nLast Thursday, Trump said he would impose significantly higher \"reciprocal\" tariffs on dozens of countries that have the highest trade imbalances with the US.\n\nREAD MORE: Trump threatens China with monster new tariff as global markets plunge ﻿\n\nUS President Donald Trump. (AP)\n\nIn a post on X, Ackman said \"business investment will grind to a halt, (and) consumers will close their wallets\" if the new levies do indeed come into force.\n\n\"We will severely damage our reputation with the rest of the world that will take years and potentially decades to rehabilitate,\" he added in the post, which was viewed 10.6 million times.\n\nUnless Trump changes tack, \"we are heading for a self-induced, economic nuclear winter, and we should start hunkering down,\" the CEO of Pershing Square Capital Management warned.\n\nBill Ackman, CEO of Pershing Square Capital Management, has criticised Trump's tariffs. (Michael M. Santiago/Getty Images via CNN)\n\n\"What CEO and what board of directors will be comfortable making large, long-term economic commitments in our country in the middle of an economic nuclear war?\" he said, adding that \"the president is losing the confidence of business leaders around the globe.\"\n\nAlready Trump's baseline 10 per cent tariff on all goods imports into the US went into effect Saturday, and dozens of economies are bracing for even higher levies starting this week.\n\nThose harder-hit countries include major US trading partners China and the European Union, which face new duties of 34 per cent and 20 per cent respectively.\n\nOther billionaires and wealthy business leaders have also openly criticised Trump's tariff agenda in recent days as fear over its economic fallout gripped markets.\n\nStocks in the US and around the world are crashing. (AP)\n\nJamie Dimon, CEO of JPMorgan Chase, warned Monday that the tariffs threatened to raise prices, drive the global economy into a downturn and weaken America's standing in the world.\n\n\"The recent tariffs will likely increase inflation and are causing many to consider a greater probability of a recession,\" Dimon said in an annual letter to shareholders.\n\n\"Whether or not the menu of tariffs causes a recession remains in question, but it will slow down growth.\"\n\nBillionaire Stanley Druckenmiller, founder of the Duquesne Family Office, an investment firm, said in a post on X that he did \"not support tariffs exceeding 10 per cent.\" Druckenmiller is worth an estimated US$11 billion ($18.37 billion), according to the Bloomberg Billionaires Index.\n\nJPMorgan Chase CEO Jamie Dimon. (Kevin Dietsch/Getty Images via CNN)\n\nLater in the day, billionaire Ken Fisher, the founder and executive chairman of Fisher Investments, said on X: \"What Trump unveiled (last) Wednesday is stupid, wrong, arrogantly extreme, ignorant trade-wise and addressing a non-problem with misguided tools. Yet, as near as I can tell it will fade and fail and the fear is bigger than the problem, which from here is bullish.\"\n\nFisher noted that he does not typically comment publicly on presidential actions, \"but on tariffs Trump is beyond the pale by a long shot.\"\n\nEven Elon Musk – the world's richest man and top Trump acolyte – said Sunday that he hoped for a \"zero-tariff situation\" between Europe and the US. In an interview with Italy's Deputy Prime Minister Matteo Salvini via video link, Musk said he wanted to see an effective \"free-trade zone\" created between Europe and North America.\n\nEchoing Ackman, Simon MacAdam, deputy chief global economist at consultancy Capital Economics, said businesses were likely to hold off making investments due, in large part, to the \"sheer uncertainty\" of Trump's tariff policy.\n\nTrump-backing billionaires poised to lose nearly a trillion dollars in two days View Gallery\n\n\"If you're a mid-sized or even a large-cap company, you're going to be very hesitant about what to do,\" he told CNN.\n\n\"If those tariffs are going to be negotiated back down again in a few months' time, then you'd be wasting your time investing potentially hundreds of millions of dollars in new plants… in the US.\"\n\nIn his post, Ackman said the new tariffs were \"massive\" and \"disproportionate,\" saying: \"This is not what we voted for.\" He called for a 90-day \"time out\" in which Trump could negotiate with trading partners to \"resolve unfair asymmetric tariffs deals.\"\n\nTrump has said his tariff agenda is designed to redress years of lopsided trade between America and its partners, caused, in his view, by other countries imposing steeper tariffs on US goods imported into their markets than the US does on theirs.\n\nBut investors are clearly not convinced by the wisdom of Trump's plan. Stock markets in Asia and Europe plunged Monday and futures pointed to another bad day for US stocks, following Trump's tariffs announcement last Wednesday.\n\nDo you think the world is heading towards a recession? Yes 5859 No 676",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/man-dies-in-moe-victoria-police-investigating/1e9ca981-d5b4-4ba1-b751-525b9bf8cdbf",
        "title": "Investigation underway after man dies east of Melbourne",
        "publish_date": "Mon, 07 Apr 2025 21:29:35 +0000",
        "category": "sports",
        "authors": [
            "Apr"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/donald-trump-tariffs-update-us-president-threatens-more-tariffs-on-china-as-global-markets-plunge/1eaea3da-54ed-4749-a6c5-ac04a037e335",
        "title": "Trump threatens China with monster new tariff as global markets plunge",
        "publish_date": "Mon, 07 Apr 2025 20:28:01 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "Trump's threat, which he delivered on social media, came after China said it would retaliate against US tariffs he announced last week.\n\n\"If China does not withdraw its 34 per cent increase above their already long term trading abuses by tomorrow, April 8th, 2025, the United States will impose ADDITIONAL Tariffs on China of 50 per cent, effective April 9th,\" he wrote on Truth Social.\n\nTrump posted on his Truth Social site early on Monday, blaming China and other \"abusing countries\" for retaliating against the US with additional tariffs. (AP)\n\n\"Additionally, all talks with China concerning their requested meetings with us will be terminated!\"\n\nIf Trump implements his plans, US tariffs on imports from China would reach a combined 104 per cent. The new taxes would be on top of the 20 per cent tariffs announced as punishment for fentanyl trafficking and his separate 34 per cent tariffs announced last week.\n\nNot only could that increase prices for American consumers, it could give China an incentive to flood other countries with cheaper goods and seek deeper partnerships with other trading partners.\n\nYun Sun, a director of the China program at the Stimson Centre think tank in Washington, said ﻿\"at this point, it is extremely unlikely for China to back down\" and any chance of a summit between Trump and Chinese President Xi Jinping \"doesn't appear likely in the near future\".\n\n\"China is increasingly convinced that the tariff is not negotiable because Trump's eventual goal is to bring manufacturing jobs back to the US,\" Sun said.\n\nCraig Singleton, senior China fellow at another Washington-based think tank Foundation for Defense of Democracies, called Trump's threat from today \"a blunt ultimatum to Beijing that sharply raises the takes in the US-China tariff war.\"\n\nHe said Beijing's rigid system and fear of looking weak prevent Xi from opening back channels with the Trump administration that could offer relief.\n\n\"This is not a contest of endurance so much as a collision course, where neither side intends to swerve,\" Singleton said. \"In other words, Trump and Xi are locked into escalation-as-strategy, and the risk now is a slow-motion spiral with no clear ceiling.\"\n\nTrump faces mounting pressure in the financial markets and from business leaders to backtrack on his tariff ambitions, yet he has shown no signs of reversing course or finding a message to calm panicked markets.\n\nThe White House said on Monday that Trump would veto a Senate bill that would mandate congressional approval for new tariffs, a bet that the critical mass of Republican lawmakers will loyally back his taxes on imports despite the economic and political chaos being created.\n\nAs of midday on Monday, the Dow Jones Industrial Average had fallen 750 points, or 2 per cent. The S&P 500 had slumped 1.5 per cent, and the Nasdaq composite was off 1.2 per cent. The drop in the markets briefly reversed in the morning after a false report that Trump was considering a pause in his tariff plans. The frantic trading, which sent stocks spiking before plummeting again, showed how investors are operating on a hair trigger and are eager for any sign of encouraging news.\n\nTrump-backing billionaires poised to lose nearly a trillion dollars in two days View Gallery\n\nThe White House account said it was \"fake news\" that Trump was considering a pause. The Republican president has remained defiant despite fears that he could be pushing the US toward a recession, insisting that his tariffs are necessary for rebuilding domestic manufacturing and resetting trade relationships with other countries.\n\n\"Be Strong, Courageous, and Patient, and GREATNESS will be the result!\" he wrote on Truth Social.\n\nHe accused other countries of \"taking advantage of the Good OL' USA\" and said \"our past 'leaders' are to blame for allowing this\".\n\nTrump also called on the Federal Reserve to lower interest rates. On Friday, Federal Reserve Chair Jerome Powell warned that the tariffs could increase inflation, and he said \"there's a lot of waiting and seeing going on, including by us\", before any decisions would be made.\n\nInvestors expect the US central bank to cut its benchmark interest rates at least four times by the end of this year, according to CME Group's FedWatch, a sign that concerns about inflation will be eclipsed by fears of layoffs and a shrinking economy.\n\nREAD MORE: Woman who killed husband during sleepwalk freed\n\nTrump's tariff strategy has long been criticised by economists, investors and business leaders, who fear that US isolation will severely limit economic growth. (AP)\n\nTrump spent the weekend in Florida, arriving on Thursday night to attend a Saudi-funded tournament at his Miami golf course. He stayed at Mar-a-Lago, his private club in Palm Beach, and golfed at two of his properties nearby.\n\nOn Sunday, he posted a video of himself hitting a drive, and he told reporters aboard Air Force One that evening that he won a club championship.\n\n\"It's good to win,\" Trump said.\n\n\"You heard I won, right?\"\n\nHe also said that he wouldn't back down from his tariffs despite the turmoil in the global markets.\n\n\"Sometimes you have to take medicine to fix something,\" Trump said.\n\nGoldman Sachs issued a new forecast saying a recession has become more likely even if Trump backtracks from his tariffs.\n\nSouth Korea's Kospi lost 5.6 per cent to 2,328.20. (AP)\n\nThe financial firm said economic growth would slow dramatically \"following a sharp tightening in financial conditions, foreign consumer boycotts, and a continued spike in policy uncertainty that is likely to depress capital spending by more than we had previously assumed\".\n\nEuropean Commission President Ursula von der Leyen said the European Union would focus on trade with other countries besides the United States, saying there are \"vast opportunities\" elsewhere.\n\nTrump said he spoke with Japanese Prime Minister Shigeru Ishiba to start trade negotiations. He complained on Truth Social \"they have treated the US very poorly on Trade\" and \"they don't take our cars, but we take MILLIONS of theirs\".\n\nIshiba said he told Trump that he's \"strongly concerned\" that tariffs would discourage investment from Japan, which has been the world's biggest investor in the US in the past five years. He described the situation as a \"national crisis\" and said that his government would negotiate with Washington to urge Trump to reconsider the tariffs.\n\nEuropean shares followed Asian markets lower, led by Germany's DAX index, which briefly fell more than 10 per cent at the open on the Frankfurt exchange. (AP)\n\nWhite House trade adviser Peter Navarro suggested countries would need to do much more than simply lower their own tariff rates to reach deals, saying they would have to make structural changes to their tax and regulatory codes.\n\n\"Let's take Vietnam,\" he said on CNBC.\n\n\"When they come to us and say, 'We'll go to zero tariffs', that means nothing to us because it's the non-tariff cheating that matters.\"\n\nOn Monday, Trump welcomed the Los Angeles Dodgers to the White House to celebrate their World Series victory. He's also meeting with Israeli Prime Minister Benjamin Netanyahu, and they're expected to hold a joint press conference in the afternoon.\n\nTrump has strived for a united front after the chaotic infighting of his first term. However, the economic turbulence has exposed some fractures within his disparate coalition of supporters.\n\nBill Ackman, a hedge fund manager, lashed out at Commerce Secretary Howard Lutnick on Sunday as \"indifferent to the stock market and the economy crashing\".\n\nHe said Cantor Fitzgerald, the financial firm led by Lutnick before he joined the Trump administration, stood to profit because of bond investments.\n\nOn Monday, Ackman apologised for his criticism but reiterated his concerns about Trump's tariffs.\n\n\"I am just frustrated watching what I believe to be a major policy error occur after our country and the president have been making huge economic progress that is now at risk due to the tariffs,\" he wrote on X.\n\nTop White House economic adviser Kevin Hassett told Fox News Channel that Ackman should \"ease off the rhetoric a little bit\".\n\nHe insisted that other countries, not the US, are \"going to bear the brunt of the tariffs\".\n\nBillionaire Elon Musk, a top adviser to Trump on overhauling the federal government, expressed scepticism about tariffs over the weekend. Musk has said that tariffs would drive up costs for Tesla, his electric automaker.\n\n\"I hope it is agreed that both Europe and the United States should move ideally in my view to a zero tariff situation, effectively creating a free trade zone between Europe and North America,\" Musk said in a video conference with Italian politicians.\n\nHe added, \"That certainly has been my advice to the president\".\n\nNavarro later told Fox News that Musk \"doesn't understand\" the situation.\n\n\"He sells cars,\" Navarro said. \"That's what he does.\"\n\nHe added that, \"He's simply protecting his own interests as any business person would do\".\n\nDo you think the world is heading towards a recession? Yes 5899 No 677",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/best-companies-to-work-for-australia-2025-in-photos/fb3c1650-8a18-47dd-a841-79cb661a8110",
        "title": "These are top 10 'best' companies to work for in Australia",
        "publish_date": "Tue, 08 Apr 2025 01:16:42 +0000",
        "category": "finance",
        "authors": [
            "April"
        ],
        "text": "1 of 11 Attribution: Nine\n\nProfessional networking site LinkedIn has put together its annual list of Australia's best workplaces for career growth potential.\n\nIt trawled through the career data of millions of workers and judged the companies based on promotions, skill acquisition, gender diversity and employee benefits﻿.\n\nAnd many of the listed workplaces have one thing in common: flexibility and a \"work from anywhere\" policy.﻿\n\nAmong the top 10 list are a smattering of Australian-owned companies, while global tech brands dominated the list.\n\nSee the top 10 companies for 2025 here.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/cheapest-countries-to-visit-from-australia-destinations-where-aud-goes-further-in-pictures/0f930c9b-bde0-4105-a0fb-1455ca9bc364",
        "title": "Where is the Aussie dollar still good value for travellers?",
        "publish_date": "Mon, 07 Apr 2025 23:25:35 +0000",
        "category": "finance",
        "authors": [
            "April"
        ],
        "text": "1 of 14 Attribution: Getty\n\nPeople hoping to take a holiday soon should pick their destinations carefully, with the dollar's value tumbling in many parts of the world.﻿\n\nT﻿he Australian dollar hit a historic low in value in early April, dipping below US60 cents for the first time since the COVID-19 pandemic.\n\nOngoing economic chaos has seen the dollar weaken in other countries around the world too﻿.\n\nHere are some popular tourist destinations where the currency exchange is in your favour - and others where it isn't.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/dj-fisher-launches-luxury-property-development-at-palm-beach-on-gold-coast/55d5debb-2d4a-4264-bc43-3a9b31a243c5",
        "title": "International DJ Fisher gets into Gold Coast property development",
        "publish_date": "Mon, 07 Apr 2025 10:58:30 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "International DJ sensation Paul Fisher is making waves in a new arena: real estate development.\n\nThe Gold Coast native is spearheading the construction of \"Pescado\", a luxury high-rise apartment complex in Palm Beach, with prices starting at $5.25 million.\n\n\"For me, it's super special,\" Fisher said.\n\nInternational DJ sensation Paul Fisher is making waves in a new arena. (Nine)\n\n\"I grew up in Palm Beach and Jefferson Lane was my place.\n\n\"I used to ride my bike up and down, surf from Nineteenth down to Second Ave, and I just love it here.\"\n\nThe name Pescado, meaning \"fish\" in Spanish, holds personal significance for Fisher.\n\n\"Everyone calls me Pescado,\" he said, referencing his time living in Ibiza.\n\n\"We thought we'd bring that back to Palm Beach.\"\n\nThe development boasts six full-floor luxury apartments and a two-storey penthouse, with the top spot already claimed by Fisher himself.\n\n\"We're gonna take the top one because it's our dream home,\" he said.\n\n\"We just want six other lucky people to come join us.\"\n\nEach apartment features three bedrooms and three bathrooms, along with access to a resort-style pool, cold plunge, and gym.\n\nChloe Fisher, Paul's wife, is leading the interior design, drawing inspiration from their travels.\n\n\"We've been very lucky to experience some extremely beautiful hotels and AirBnbs and resorts,\" she said.\n\n\"We've kind of just handpicked our favorite parts from our travels.\"\n\nThe development has garnered attention for its high-end design and prime location.\n\nJayde Pezet, Managing Director of Pezet Matheson, describes the architecture as \"out of this world,\" praising the \"considered facade and internal finishes\".\n\nSeveral apartments have already sold.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/will-pucovski-cricket-retirement-concussion-age-27/105150470",
        "title": "Will Pucovski announces retirement following 'scary' concussion symptoms",
        "publish_date": "Tue, 08 Apr 2025 01:12:47 +0000",
        "category": "sports",
        "authors": [],
        "text": "Former batting prodigy Will Pucovski has officially retired from cricket, admitting he is still suffering \"scary\" symptoms from repeated concussions.\n\nThe Victorian last played Sheffield Shield in March 2024, when he was hit on the helmet by a delivery from Tasmania speedster Riley Meredith.\n\nIt caused the 13th-known concussion of his sporting career.\n\nPucovski's official announcement on Tuesday came after a medical panel recommended he retire.\n\nThe 27-year-old said his life had changed and it had not been easy.\n\n\"I'm not going to be playing cricket again,\" Pucovski said.\n\n\"It's been a really difficult year, to put it as simply as possible.\n\n\"The simple message is, I won't be playing at any level again.\n\n\"In the couple of months post that [last concussion] I struggled to get anything done, walking around the house was a struggle.\n\n\"My fiancee was annoyed because I didn't contribute to chores. I was sleeping a lot.\n\n\"From there it's been a tough year, a lot of the symptoms didn't go away, which has led me to this decision.\n\n\"The first few months were horrendous, but things didn't leave me.\"\n\nPucovski played his only Test in January 2021 against India at the SCG, scoring 62 in the first innings.\n\nHe finishes with a first-class average of 45.19 that includes seven centuries and a highest score of 255 not out.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/multiple-majors-presidents-cup-on-adam-scott-s-bucket-list/105150108",
        "title": "Time running out for Adam Scott to win multiple majors",
        "publish_date": "Tue, 08 Apr 2025 00:39:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "Adam Scott has detailed his desperation to become a multiple major winner and explained the balancing act behind it ahead of a 24th Masters start.\n\nThe former world number one turns 45 in July and admits time is running out to add to his 2013 Masters triumph.\n\nAdam Scott at the majors Best finishes The Masters: Winner (2013)\n\nPGA Championship: 3rd, T-3 (2006, 2018)\n\nUS Open: T-4 (2015)\n\nOpen Championship: 2nd (2012)\n\nHe has not won on the PGA Tour in five years. However, he claimed two runner-up and five top-10 finishes last year to remain in the conversation.\n\nTeeing up for a 94th consecutive majors start, Scott almost always figures at a tournament he has made the cut at for the past 15 years.\n\n\"The dream of chasing Jack Nicklaus's record (18 majors) is long gone, but I did have the belief that I can become a multiple-major champion,\" Scott said as rain and thunderstorms hit Augusta National Golf Course on Monday, local time.\n\n\"I don't want to leave it to just showing up and having a lucky week — I know there is a lot that has to go into it.\n\n\"I'd love to win another Australian Open [too] — it's a special one — and the Open Championship. I mean, I felt like I was right there [in 2012], and I'd like to get both hands on that claret jug.\n\n\"Augusta is such a challenge. It tests every part of your game, and then ultimately, at a major, it's going to come down to the heart and the head to get it done.\"\n\nAhead of Thursday's first round at Augusta, family man Scott explained it had become impossible to commit to the Tour like he once did, but the big events still commanded his full focus.\n\n\"I'm [still] very motivated. It comes and goes though,\" he said.\n\nInstalled as the Tour's player advisory council chairman in 2023, Scott has also been tasked with managing the attempted merge with LIV Golf's rebel league.\n\n\"I don't think I can have the 12-month focus that I used to. There's life as well, and I have a family and growing kids,\" he said.\n\n\"I feel a strong sense to not miss their entire upbringing, and it's more demanding to stay at the top level out here.\n\nIt has been 12 years since Adam Scott won his one and only major at Augusta, winning a play-off to clinch the Masters. (Getty Images: Sports Illustrated/Simon Bruty)\n\n\"The balance of staying at the top is tough, but when you start getting to big events, the Players Championship and now the Masters, that's when you really switch on — and I think I can do it in shorter periods, but maybe not stretch out all year.\"\n\nWorking through his bucket list, the 11-time Presidents Cup representative would also love to tick off winning the teams event.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe Australian has the most career points by an international and has been touted as a future captain ahead of Melbourne's Kingston Heath hosting in 2028.\n\nBut next year's event at Medinah Country Club in the US is as far as he is looking.\n\n\"Actually, if we go into tournaments I'd like to win, that might be right up there, level with another major for me,\" Scott said.\n\n\"I feel like I've given a lot to the International team and it's been challenging for us, to say the least, over the years.\n\n\"I'd love to win as a player and then worry about the captaincy later.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/support-to-drought-stricken-sa-farmers-boosted/105149418",
        "title": "Drought relief boosted by $55m, with farmers promised 'faster' responses",
        "publish_date": "Mon, 07 Apr 2025 23:44:37 +0000",
        "category": "finance",
        "authors": [],
        "text": "Drought relief amounting to $55 million will flow to South Australian communities in desperate need of relief, with the state government announcing the additional funding a month after farmers made an urgent plea for more help.\n\nThe government said the new package was on top of $18 million announced in November, and would go towards such measures as rebates, infrastructure upgrades, financial counselling and mental health support, as well as assisting charities that transport fodder.\n\nPremier Peter Malinauskas today conceded it had taken too long for applicants under the previous round of funding to receive responses, and that the system had \"to be faster\".\n\n\"I've been frustrated about some of the time it's taken the bureaucracy to respond to these applications — I can't imagine how much more frustrating it is for someone who actually needs the support,\" Mr Malinauskas told ABC North and West SA.\n\n\"[I've] asked my department, the Department of Premier and Cabinet, to oversee an effort to expedite the timeliness.\n\n\" I've been given advice that I can assure people that it will take no more than 30 days to get these applications processed. \"\n\nCreek beds have been exposed during the prolonged dry spell. (ABC South East SA: Caroline Horn)\n\nIn March, Adelaide Hills farmers urged more assistance including interest-free or low-interest loans to help with the cost of bringing in feed and water.\n\nSwathes of South Australia have endured extremely dry conditions for months, leading to crop losses, dry dams and a high reliance on water carting in the Adelaide Hills.\n\nAdelaide's reservoirs were recently described by the environment department as being at their lowest levels in more than two decades.\n\nPrimary Industries Minister Clare Scriven said the new support package would be made available \"in the coming weeks\".\n\n\"It's been designed with farmers to both look at what the immediate supports are that they need to get through day to day as they're facing one of the worst droughts that they've experienced, as well as preparing for the ongoing issues of drought,\" she said.\n\n\"We're also looking at mental health … and so there's an additional $2.5 million for that, and rural financial counselling support.\n\n\"There'll also be additional money for donated fodder, to cover the transport costs of that, and some immediate financial relief for those who receive the farm household allowance.\"\n\nMs Scriven said the funding package included $2.5 million for mental health support. (ABC News: Brant Cumming)\n\nOf the funding, $13 million will go towards \"rebates that assist with projects to manage drought conditions\", with another $17 million set aside for future drought preparedness and resilience programs.\n\n\"It's regional communities that are affected by drought, as well as the farmers directly, so we're doing additional supports for small businesses that are not farm businesses,\" Ms Scriven said.\n\nAbout $2.5 million will go towards the provision and upgrading of standpipes, and $4.5 million to electronic identification for sheep and farmed goats.\n\n\"The challenge is consistent for everyone — we need more rain, we can't make that happen,\" Mr Malinauskas said.\n\n\"[But] we've dramatically boosted the size of the fund because it was oversubscribed, the first time round when we did it.\"\n\nDams have dried up, leaving local residents increasingly reliant on water carting. (ABC South East SA: Caroline Horn)\n\nThe opposition's spokeswoman for water resources, Nicola Centofanti, said the support was overdue.\n\n\"Currently the processing time for those drought infrastructure rebate programs is 10 weeks if not longer and farmers can't really afford to wait that long,\" she said.\n\n\"There will be a lot of farmers who'll be waking up today somewhat relieved that this support has finally been delivered, because it's been a long time in the coming.\"\n\nMs Centofanti said it had taken too long to process applications for support.\n\nBut she said on-farm drought infrastructure grants had previously been capped at $5,000.\n\n\"I am keen to learn more about how the on-farm drought infrastructure grants will be increased, whether more funds will be available per farmer.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/charles-and-camilla-20th-anniversary-photos-in-rome/105149794",
        "title": "Charles and Camilla mark 20th anniversary with photos in Rome",
        "publish_date": "Mon, 07 Apr 2025 23:42:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "King Charles III and Queen Camilla have released three new portrait photos during their state visit to Italy ahead of their 20th wedding anniversary on Wednesday.\n\nThe photographs were taken at Villa Wolkonsky, the British ambassador's residence in Rome, next to the Neronian spur of the Aqua Claudia, an ancient Roman aqueduct.\n\nThe pair arrived in Italy on Monday for a four-day state visit during which the British monarch will address the Italian parliament in Rome.\n\nThe photographs were taken at Villa Wolkonsky in Rome. (Chris Jackson/Getty Images for Buckingham Palace/Handout via Reuters)\n\nIt is Charles's 17th official visit to Italy and his first overseas trip this year as he continues to undergo treatment for cancer.\n\nIt coincides with the 20th wedding anniversary of Charles and Camilla, who married on April 9, 2005.\n\nTheir wedding took place the day after the funeral of Pope John Paul II, which Charles attended as then heir to the throne.\n\nBusy Italian schedule\n\nCharles is the supreme governor of the Church of England, and had been due to meet Pope Francis this week, but the meeting was postponed in late March because of concern over the pontiff's health.\n\nA king out of his mother’s shadow Photo shows A man in a grey suit jacked with blue white and red tie looks up with sad eyes King Charles is making a comeback in 2025 and as he keeps calm and carries on, what makes this monarch tick?\n\nPope Francis spent five weeks in hospital suffering from double pneumonia. However, he has now returned to the Vatican.\n\nCharles previously met Francis, the head of the Roman Catholic Church, during visits to Italy in 2017 and 2019.\n\nIn the past, he also met Pope John Paul II and Pope Benedict XVI.\n\nHis mother, Queen Elizabeth II, also visited the Holy See in 2000 during the last Catholic Jubilee year.\n\nCharles and Camilla are scheduled to meet Italian President Sergio Mattarella on Tuesday and visit the Colosseum.\n\nCharles and Camilla have a busy schedule in Italy. (Chris Jackson/Getty Images for Buckingham Palace/Handout via Reuters)\n\nOn Wednesday the king and queen will meet Italian Prime Minister Giorgia Meloni, after which Charles will deliver a speech to parliament — the first British monarch in history to address a joint parliamentary session in Italy.\n\nThe royals will also celebrate the cuisine of the Emilia-Romagna region and meet with local farmers whose fields were devastated by floods that recently hit the area.\n\nFollowing that, Charles and Camilla will travel to Ravenna to take part in a ceremony marking the 80th anniversary of the city's liberation from Nazi occupation by Allied forces in World War II.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/bitterweet-win-aussie-surfer-to-miss-sisters-wedding/105149648",
        "title": "Aussie surfer's 'bittersweet' victory means she will miss sister's wedding",
        "publish_date": "Mon, 07 Apr 2025 23:20:59 +0000",
        "category": "sports",
        "authors": [],
        "text": "Isabella Nichols has pulled off a shock victory in the last 16 of the World Surf League's El Salvador leg, then revealed the win would likely cause her to miss her sister's wedding.\n\nThe Queenslander upset 2023 WSL champion Caroline Marks, winner of the previous leg in Portugal and event favourite after back-to-back victories in El Salvador.\n\nNichols's win earned her a quarterfinal against Bettylou Sakura Johnson, who defeated Australia's Tyler Wright in the only other heat to take place on a truncated day's competition on the Pacific coast at Punta Roca.\n\nBut it also meant, after delays getting on the water, that she was unlikely to be able to make her sibling's big day.\n\n\"I just want to give a shout-out to my sister, and this might make me a bit emotional, but I think getting through that heat means maybe I'll miss her wedding,\" Nichols said.\n\n\"So for me it's a tough one. It's a bittersweet win, but just want to say 'I love you so much'.\"\n\nWith Nichols currently 11th, and only the top 10 going through after the cut following leg seven at Margaret River, Nichols will hope the sacrifice is worth it, because she could do with a good placing ahead of the Australian swing.\n\nIsabella Nichols left it late in the round of 16, with her best two scores coming from her last two rides of the heat. (Getty Images: World Surf League/Aaron Hughes)\n\nIn three- to four-foot waves in slower sets with a series of falls, Nichols posted a 7.17 (out of a possible 10) followed by a 5.13 in her last two scoring rides to defeat Marks 12.30-9.66.\n\n\"It's been a tough few days,\" Nichols said. \"I've put this jersey on for a third time now and I guess third time lucky.\n\n\"It's been really stop-starty, and the emotional roller-coaster we go through just to get ready for one heat and having to do that a bunch of times, it's been tough.\n\n\"To be able to pull through that one was nice after a shaky start. I hadn't surfed a wave for 20 minutes, so my legs weren't really working.\"\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nWright lost 11.50-9.53 to Johnson after the Hawaiian established an early lead Wright was never able to close.\n\n\"Just knowing that the ocean was super slow this morning, I knew to capitalise on those bigger sets when they did come in,\" Johnson said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"Coming up against Tyler, she's a world champion, she's hard to beat. I'm definitely happy to get over that one.\"\n\nJohnson is currently 13th, close behind Nichols, adding spice to their meeting.\n\nAlready in the quarterfinals is another Australian, Molly Picklum, who will face Costa Rica's Brisa Hennessy when the women get back on the water. The victor will face the winner of the Nichols-Johnson match-up.\n\nThe men's round-of-16 action features Ethan Ewing, Joel Vaughan, Ryan Callinan, Jack Robinson and George Pittar, the last two against each other.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/qld-construction-industry-growth-tradies-building-2032-olympics/105147278",
        "title": "Tradie shortage could see builds blow out in cost and time, report finds",
        "publish_date": "Mon, 07 Apr 2025 23:18:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Queensland construction projects can expect cost blowouts and time lags over the next decade as the industry value balloons by billions and its workforce shrinks, according to a new report.\n\nThe workforce report by Construction Skills Queensland, released on Tuesday, estimates the value of the state's construction pipeline will increase from $53 billion this financial year to $77 billion by 2027.\n\nAt the same time, it predicts an average worker shortfall of 18,200 a year over the next eight years.\n\nTo keep up with public infrastructure and private housing projects, Queensland needs thousands more skilled tradespeople. (Supplied: Cheney Constructions)\n\nThe Brisbane Olympic and Paralympic Games, rapid population growth and the transition to net zero are behind the industry surge, the report found.\n\nBrisbane construction company manager Jessica Cheney said businesses like hers would feel the pressure the most.\n\n\" Builders are having to pay a lot more to do good trades, to keep them on site as well. Otherwise you can't get anyone showing up to work. \"\n\n'Some projects are going to miss out'\n\nMs Cheney said cutting workers' rates would mean lower quality work, by less skilled tradespeople.\n\nMaster Builders Queensland chief executive Paul Bidwell agrees.\n\n\"The tradies go where the better pay and the better conditions are,\" he said.\n\nThe industry's \"biggest challenge\" right now is finding enough workers to finish all the jobs ahead — including the 63,000-seat Victoria Park stadium for Brisbane 2032.\n\n\"If there's a fixed number of people, then some projects are going to miss out,\" Mr Bidwell said.\n\nThe Queensland government will build a new stadium at Victoria Park ahead of the 2032 Games. (Supplied)\n\nThe construction sector has battled \"all sorts of pressures\" since the pandemic, including an \"enormous demand for workers\", he said.\n\nMeanwhile, the cost of materials \"certainly hasn't gone backwards\".\n\nPaul Bidwell said the biggest challenge is finding enough workers to complete the builds planned in Queensland. (Supplied)\n\nExtended timelines likely\n\nIt won't only be large projects that feel the pressure, Ms Cheney said.\n\n\"Wait times for homes to be built are going to go through the roof as well,\" she said.\n\nQueensland is facing a massive shortage of skilled workers in the construction industry, threatening to make the current housing crisis even worse. (Supplied: Cheney Constructions)\n\nAt the same time, Queensland's population is growing as the state grapples with a housing crisis.\n\nMr Bidwell said there was still a long way to go before Queensland has enough homes to meet demand, with \"50,000 dwellings that we need to build in order to deal with the housing crisis\".\n\nThe biggest construction worker shortfall in Queensland is in carpentry, he added.\n\n\"Carpenters, by a long way, are the biggest hole to be filled,\" he said.\n\nThe construction sector has battled \"all sorts of pressures\" since the pandemic. (ABC News: Keana Naughton)\n\nConstruction Skills Queensland CEO Geoff Clare said the report should be a wake-up call.\n\n\"It's actually a good story, in the sense that you never complain about work coming down the line, but it does mean that there's going to be a lot of conflicting priorities.\n\n\" A number of these projects are going to need to be constructed around similar timelines, which obviously creates that pressure. \"\n\nMr Clare said the construction pipeline is \"a fantastic opportunity for us to invest in our people and our state\", but governments and the private sector would have to work together.\n\n\"We've got to come together to ensure that our state benefits, by ensuring we've got a sufficient workforce to deliver these projects on-time and on-budget for Queenslanders,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/proposed-rehabilitation-centre-in-merbein-divides-community/105026682",
        "title": "Proposed rehabilitation centre divides small community",
        "publish_date": "Mon, 07 Apr 2025 23:10:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Readers are advised this story discusses suicide.\n\nSeven years ago, Patsy Miller was at work in her small town of Merbein in Victoria's north-west when she received the heartbreaking news that a \"young man\" had died nearby.\n\nThe young man was her son, Lenny, who had taken his own life at the age of 24, and metres from her workplace after years of battling a drug addiction.\n\nLenny died seven years ago. (ABC News: Timu King)\n\nLenny had sought help on multiple occasions and wanted to recover from his addiction, but with no rehabilitation centre close to home, he was forced to make the long and exhausting six-hour journey to Melbourne for recovery.\n\n\"If we had the rehab centre [in Merbein], life may have been different for him, if he was given those chances,\" Ms Miller said.\n\nLenny's tomb at the Merbein Cemetery. (ABC News: Timu King)\n\n30-bed rehab centre planned\n\nAfter more than a decade of lobbying from residents struggling with the fallout of alcohol and drug use in Victoria's north-west, the state government has funded a $36 million, 30-bed rehabilitation centre in the Mallee town.\n\nBut while Ms Miller said the facility would change lives, the proposal has caused fierce division in the community.\n\nMerbein is a small town in Victoria's north-west. (ABC News: Timu King)\n\nMs Miller said it was vital that rehabilitation facilities existed in regional areas so people could recover while having family and support close to them.\n\nWhen the state government announced the centre in 2022, Ms Miller said she cried.\n\nMementos and photographs of Lenny can be found all over his mother’s home. (ABC News: Timu King)\n\n\"I was so, so glad, because there's so many times when Lenny was in his bad addiction, I would pray that and wish that someone could just come and help him, something could change … somewhere I would find help.\n\n\"And it never came, unfortunately.\n\n\" But to think that we've got a chance now to mend families, to help people, to build a better community here in Merbein, I think it's wonderful. \"\n\nMs Miller says she would pray for help for her son in the midst of his addiction. (ABC News: Timu King)\n\nAddressing 'a gap'\n\nThe residential rehabilitation facility will be able to accommodate up to 200 people per year and will be located on the site of an old primary school.\n\nThe proposed site for the alcohol and rehabilitation centre at an old Merbein school. (ABC News: Timu King)\n\nThe facility will be the first in the area, and the fourth rehabilitation centre in Victoria run by service provider Odyssey House.\n\nCEO Stefan Gruenert said Victoria's north-west was an area that needed greater attention.\n\nStefan Gruenert says there haven't been any incidents at any of their sites. (Supplied: Odyssey House)\n\n\"There's been a really big gap in the western part of the state, particularly that north-west, and some people have had to access treatment in Adelaide or come all the way into Melbourne,\" Dr Gruenert said.\n\n\"In the north-west of the state they tend to have higher than average rates of alcohol and other drug use, and I think in part, their lack of services hasn't helped.\"\n\nAccording to the 2024 data from the Victorian Alcohol and Drug Association (VAADA), there are approximately 4,500 Victorians waiting to access some type of treatment at any given point in time.\n\nThat number has nearly doubled since the association's first survey in 2020.\n\nNationally, the number of people able to access treatment in a given year is between 30 and 40 per cent of the total number of people that would like to get help, according to VAADA.\n\nMore than 1,000 sign petition\n\nThe plan for a rehabilitation centre in Merbein has not been well received by some residents.\n\nOver 1,000 people in the community have signed a petition against having the drug and alcohol rehabilitation centre in the town.\n\nMerbein Lions Club president Phillip Sedgmen started the petition.\n\nPhillip Sedgmen started the petition against the rehabilitation centre. (Supplied: Phillip Sedgmen)\n\nHe said the group wasn't against the centre, but wanted it located 10 kilometres away in Mildura.\n\n\"We haven't got a bus service, a taxi service, we haven't got medical facilities, we don't have a manned police station,\" Mr Sedgmen said.\n\n\" If someone does happen to overdose, by the time you get an ambulance out here they are dead. \"\n\nHe said the group was also concerned about safety, given the proximity of the facility to homes and the lack of consultation they received.\n\nMP for Mildura Jane Benham said the community had \"little to no communication whatsoever\" from the state government and was \"appalled\" by its approach to announcing the location.\n\nBut, she said it was a much needed health facility for the community.\n\nThe Victorian government did not respond to Ms Benham's comments directly, but said the location was found to best meet the government's site evaluation criteria.\n\nAn information session was held with the Merbein community in February.\n\nDr Gruenert said safety shouldn’t be a concern for residents.\n\n\"We don't have any incidents that have occurred with neighbours [of existing Odyssey House facilities] and our residents at any of those other sites for at least the last 10 years, and to my memory, even for 40 years that we've been operating.\"\n\nFacility offers jobs for small town\n\nLocal Jacinta Masierowski recovered from drug addiction more than 10 years ago with the help of a rehabilitation program in Western Australia.\n\nJacinta Masierowski beat her addiction 10 years ago. (ABC News: Timu King)\n\nShe said a rehabilitation centre close to home would be \"amazing\" and she hoped to work there when it opened.\n\n\"It's kind of what saved me from still being an addict,\" Ms Masierowski said.\n\n\"It's been a passion since I have been clean to work in rehab and when this was coming up, I was like, 'Oh wow, this is amazing.'\n\n\"I was so excited, I said to Mum, 'I need to get there and work, I need to get my foot in the door.'\"\n\nMs Masierowski said the majority of the workers at the rehabilitation centre she attended had recovered from addiction themselves and understood the challenges of recovery.\n\n\"They told us about their stories and how they got clean, and I think that then sets a positive note to know that you can actually get clean,\" she said.\n\n\"It's just that you need that one person to believe in you, to say, 'You're going to make it' and you'll be surprised by how that makes an addict feel.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/blondie-clem-burke-dies-aged-70/105149478",
        "title": "Clem Burke, drummer and 'the heartbeat' of Blondie, dies aged 70",
        "publish_date": "Mon, 07 Apr 2025 23:00:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "Clem Burke, the drummer of band Blondie, has died aged 70.\n\nBurke's bandmates Debbie Harry and Chris Stein said he had died after a private battle with cancer.\n\nThe band, which formed in the 70s, shared a tribute to the American rocker on their official social media pages.\n\nIn their post, the group described Burke as the \"heartbeat of Blondie\".\n\n\"It is with profound sadness that we relay news of the passing of our beloved friend and bandmate Clem Burke following a private battle with cancer,\" they said in a statement.\n\n\"Clem was not just a drummer; he was the heartbeat of Blondie.\n\n\"His talent, energy, and passion for music were unmatched, and his contributions to our sound and success are immeasurable.\"\n\nThe group finished by extending their condolences to Burke's family and friends and signed off with \"Godspeed Dr Burke\".\n\nLoading Instagram content\n\nThe signoff referenced the honorary doctorate he received from the University of Gloucestershire for a drumming project he conducted that showed that drummers can reach the same physical exertion as professional athletes.\n\nBurke, who was born Clement Anthony Bozewski in New Jersey in 1954, joined Blondie shortly after they formed in New York in 1975 and played on all 11 of their studio albums.\n\nHe was inducted into the Rock and Roll Hall of Fame along with his bandmates in 2006.\n\nIn 2016, Rolling Stone named him one of the top 100 drummers of all time.\n\nBlondie became known for its hits including Heart of Glass, One Way or Another and The Tide is High.\n\nBlondie members Stein (L), Harry and Burke during their induction into the RockWalk sidewalk gallery. (Reuters: Lucas Jackson)\n\nTheir first chart success came in Australia and the UK with songs such as Denis and Hanging on the Telephone.\n\nBut the group swept to global fame in 1979 with the release of Heart of Glass.\n\nBurke also played in bands including the Ramones and The Romantics during his career. He also collaborated or played with names like Bob Dylan, Iggy Pop and Bob Geldof.\n\nHe is survived by his wife Ellen, who he married in 2002.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/what-dress-codes-can-employers-enforce/105134172",
        "title": "Your rights when it comes to what you can wear at work",
        "publish_date": "Mon, 07 Apr 2025 22:22:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "Catherine Jia remembers two emails being sent to staff at her last job addressing dress code. The first took aim at sneakers. The second, denim.\n\nDespite this, she says she often experimented with what was appropriate in her office.\n\nCatherine Jia says she often tweaked her outfits for the office. (Supplied: Catherine Jia)\n\nUntil recently, she worked in the building and construction industry in \"client-side project management\". It was office-based with the occasional site visit, she says.\n\nCatherine, who lives on Gadigal land in Sydney, left the job and the industry in January.\n\nAs someone who is passionate about sustainable fashion, she tried her best to incorporate all her clothing into work wear.\n\nSo, can workplaces tell you what to wear? And how enforceable are directives about what you wear to work?\n\nWhy some workplaces have a dress code?\n\nCecilia White is the director of human resources and recruitment firm Perks People Solutions, based in Adelaide on the traditional lands of the Kaurna people.\n\nShe says dress codes — rather than uniforms — tend to apply in industries where an employee interacts with customers or clients, such as professional services or retail.\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nMs White says a workplace's dress code policy should be in writing.\n\n\"We certainly recommend that when employees start … they're given the handbook, or they're shown where the policies can be accessed.\"\n\nYou can ask a manager or the human resources department if your workplace has a policy.\n\nHow can a dress code be enforced at work?\n\nRoxanne Hart says workplaces cannot have \"one standard for one gender and a different standard\" for another. (Supplied: Roxanne Hart)\n\nRoxanne Hart, a senior lawyer at commercial and employment law firm Hart & Co in Naarm/Melbourne, says dress codes are normally dealt with in a policy so they can be updated.\n\n\"Typically, the employment contract says the employer can implement policies,\" she says.\n\nEven without a policy or written contract in place \"employers are still allowed to give employees lawful and reasonable directions,\" Ms Hart explains.\n\n\"Courts have found previously that that can extend to dress, so long as it relates to a person's employment.\"\n\nWhat's reasonable for an employer to enforce?\n\nUltimately, it depends on the role.\n\nWhile an employer can dictate a professional dress code, Ms Hart says they can't discriminate between genders.\n\nTax deduction for handbags? Photo shows A stylish woman in a beige coat and jeans holds a large black handbag. Handbags, backpacks and other work bags may be tax deductible providing they comply with some rather strict rules.\n\n\"Nowadays we wouldn't see [a condition that women wear heels] in most dress codes, and if we did it would be difficult to enforce.\"\n\nAn employer might find sandals in the office too casual, but they couldn't instruct a woman to wear heels rather than the professional shoes men at work are wearing, she says.\n\nMs White also says employers can't enforce a dress code policy that \"may have a discriminatory effect\".\n\n\"In South Australia, for example, we have a law which says that you can't have a dress code policy in place which prevents someone from wearing a certain item of clothing or jewellery … related to their religion,\" she says.\n\nThere are some workplace health and safety exemptions, she caveats, but \"the default is that people should be allowed to express their religion in their workplace\".\n\nCan you be fired for breaking the dress policy?\n\nYes, but not without warning.\n\nMs White says If someone is not presenting themselves in line with the policy, their supervisor, manager or someone from the human resources department will likely have a conversation with them first.\n\nCecilia White says a dress code policy is \"perfectly reasonable and perfectly lawful\". (Supplied: Cecilia White)\n\nPersistent breaches may result in another conversation and then perhaps a verbal or written warning. It could escalate and become \"grounds for termination\" if someone is \"refusing to follow a lawful and reasonable direction\".\n\nMs White says this is assuming the employee is aware of the dress code policy and that it is reasonable. An employer should also be enforcing it consistently.\n\nMs Hart says an employee could make an unfair dismissal claim if they believed the \"termination was harsh, unjust or unreasonable.\"\n\nShe adds that a general protections claim may be appropriate if someone felt the \"decision to terminate [them] was discriminatory\".\n\nRebel with caution\n\nCatherine Jia is now working in content creation and vintage fashion, but says she understands the need for dress codes in some industries.\n\nShe says she did rebel a bit to incorporate more of her own personal style into work week.\n\n\"I would always go in more professional and then see what everyone else is doing and get the vibe from there,\" Ms Hart says.\n\nShe says you could negotiate with an employer to wear a particular item or style, but consider the potential impact.\n\n\"In my experience, if employees are not complying with the dress code and causing issues, an employer may well look to get them out.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/matildas-new-coach-search-tom-sermanni/105149396",
        "title": "Matildas 'in limbo' as search for permanent coach continues",
        "publish_date": "Mon, 07 Apr 2025 22:15:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "Matildas star Steph Catley says she hopes Football Australia finds a permanent coach \"sooner rather than later\", admitting players are \"in limbo\".\n\nThe Matildas have been without a full-time coach for eight months since Tony Gustavsson's official departure on August 1 after the Paris Olympics.\n\nIn their 11th game under caretaker Tom Sermanni, Australia defeated South Korea 2-0 at Newcastle's McDonald Jones Stadium to claim their first back-to-back wins of the year.\n\nFowler leads Matildas to victory Photo shows Kaitlyn Torpey and Mary Fowler celebrate Mary Fowler has played a starring role in attack as the Matildas completed a 2-0 win over South Korea in their second international friendly.\n\nThe South Korea friendlies are hoped to be the last under Sermanni, with FA having flagged a coach will be in place by mid-year and the May/June friendlies against Argentina in Melbourne and Canberra.\n\nSermanni himself is unsure whether this will be the case, with pressure mounting on FA given the ever-shortening runway to the looming 2026 Asian Cup to be hosted by Australia.\n\nAmid relief at claiming a clean sweep of their two-match series with South Korea, Catley admited the rebuild had been difficult without a permanent coach.\n\n\"We are at very early stages of a rebuild and that happens every cycle when you're leading into major tournaments and we've got a year to build — well, less than a year now, but that's what it's about,\" Catley said.\n\n\"It's hard as a playing group when you're in limbo a little bit.\n\n\"You haven't got clear direction in how we're going to play moving forward.\n\n\"Tommy's done a great job coming in. He creates an amazing culture for the girls, a real positive energy.\n\n\"You can't fault him and how he's gone about it, but it is difficult when you're trying to build towards something specific and it's been a while since we've sort of had that.\n\n\"The girls have been doing the absolute best that they can and we've been sticking together and galvanising as a group.\n\n\"That'll be important for us going forward.\"\n\nLyon coach Joe Montemurro had emerged as a frontrunner for the vacant Matildas post.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nCatley is well-acquainted with the decorated Australian coach, having played under him at Melbourne City before following him to current club side Arsenal.\n\nThe star defender played a straight bat when asked about her former boss.\n\n\"I have no idea. I have no idea if that's the chat or whatever it is,\" said Catley, whose Arsenal team plays Lyon in the Women's Champions League semifinals this month.\n\n\"He's obviously in a role right now so I don't really know how that works.\n\n\"He's a great coach. I've had him a couple of times and he's doing well over there at Lyon [but] I'm not picking the coach. It's just not my role.\n\n\"We'll wait and see and hopefully it gets done sooner rather than later.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/copperstring-transmission-line-cost-blowout-powerlink-katter/104979944",
        "title": "Outback power line cost blows out from $1.8 billion to nearly $14 billion",
        "publish_date": "Mon, 07 Apr 2025 22:10:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "The cost of Queensland’s CopperString transmission line project has blown out to almost $14 billion – four times what the state government will spend on the Olympics and Paralympics.\n\nTreasurer and Energy Minister David Janetzki is expected to reveal the massive cost increase in a major speech on Tuesday after a review into the high voltage network project.\n\nIt is a significant increase from the $1.8 billion slated when the project was first announced in 2020.\n\nThe construction of 1,100-kilometres of overhead power lines from Townsville to Mount Isa would result in mines and towns in the region being connected to the national electricity market for the first time.\n\nQueensland MP Robbie Katter has called for project operator, Powerlink, to step down from the construction of the project.\n\nThe project was purchased by the Queensland government in 2023.\n\nIt then tasked government-owned corporation Powerlink to deliver the construction.\n\nPowerlink has since advised it would be better to build the transmission line from Townsville to Hughenden before extending it to Mount Isa — a backflip on the original plan to first build west from Hughenden.\n\nMr Katter, who is leader of Katter's Australia Party and state member for Traeger, said the news underscored a lack of desire or drive to get the project built.\n\n\"We've put up with a lot of signs of gross incompetence, this in the nail in the coffin, the government can no longer ignore this issue,\" Mr Katter said.\n\nBillion-dollar blowouts\n\nMr Katter says there are other options for the construction of the project. (ABC News: Emily Dobson)\n\nWith ground broken at an accommodation camp in Hughenden in July 2024, the shake-up in recommendation comes amid concerns any change could delay or even jeopardise the future of the project.\n\n\"Everything is blowing out, and you've got ambivalence from the leadership about where we it should start it,\" Mr Katter said.\n\n\"This is one of the most significant economic developments in our history of the region, and they're acting like it's just a little side project that they chop and change.\n\n\"They're treating customers like they're insignificant and they're nothing, and that's our future they're playing around with.\"\n\nCopperString 2032 is on track for completion by 2029, with commissioning of the transmission line expected by 2031.\n\nPowerlink said proposed changes could mean the project connected existing networks earlier, and be more cost-effective.\n\nThe Queensland government will review the recommendation made by Powerlink. (Supplied: CopperString 2.0)\n\nFor Mr Katter, it was the last straw.\n\n\"There's plenty of construction companies out there that could build this faster and progress,\" he said.\n\n\" We're almost two years in and all we have are half-built dongas and an interpretive centre in Townsville — how did that become the priority? \"\n\nHe said he was concerned about the flow-on effect the uncertainty would have on shires dotted across the bush.\n\n\"Flinders Shire have to decide whether to extend the sewerage network and spend ratepayers' money,\" he said.\n\n\"Richmond and Julia Creek have to plan around housing and what they can develop.\n\n\" You need the confidence underpinned by the certainty work is coming up, that just reverberates through. \"\n\nConcern across the region\n\nThe proposal to flip the order in which the transmission line is built has been met with dismay by many across north-west Queensland.\n\nMount Isa to Townsville Economic Zone (MITEZ) chief executive Maria James said she was shocked when Powerlink told her about the advice it had given government.\n\n\"My concern is that it's the projects in the west that need (CopperString) the most,\" she said.\n\n\" North-west Queensland has been promised a transition line and they deserve it. \"\n\n\"If we don't have certainty, if we don't have key deliverables, key milestones, they may not survive this.\"\n\nClarity in the pipeline\n\nA spokesperson for Powerlink said the mandate from the previous state government was to deliver a smaller project.\n\n\"The ultimate development cost may be up to $13.9 billion, but this doesn't reflect an increase in cost, the original scope was only deliver the 836km high voltage transmission backbone from Townsville to Mount Isa,\" they said.\n\n\"It [the cost] is a reflection the original plan did not include major network extensions, including works to connect mining and renewable energy projects.\"\n\nDavid Janetzki says the government will review the proposed changes. (Supplied: AAP)\n\nQueensland Treasurer David Janetzki last month said the government would \"save\" the project.\n\nMr Janetski will deliver the keynote speech to the Energy Club in Brisbane on Tuesday.\n\n\"This is an important project for the north, and contrary to what Labor would have done, we will save it,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/roger-cook-wa-labor-government-42nd-parliament-sits/105147068",
        "title": "WA's parliament returns today with a new look. So what's on the agenda?",
        "publish_date": "Mon, 07 Apr 2025 21:51:47 +0000",
        "category": "finance",
        "authors": [],
        "text": "Returning to parliament should be a celebratory affair today for Roger Cook, whose Labor government scored yet another emphatic election victory — but for those paying attention, all eyes will be on one man.\n\nFormer Perth Lord Mayor and long-time TV \"Perthonality\" Basil Zempilas will today step onto the floor of parliament as a first-term MP and, most importantly, the leader of the opposition.\n\nIn political analyst Martin Drum's view: \"He's certainly been very effective at garnering media attention.\"\n\nBasil Zempilas will take charge of the Liberals and the opposition in parliament. (ABC News: Keane Bourke)\n\nAnd the long-time political observer doesn't expect that pressure to let up.\n\nJoining Mr Zempilas is a cohort of new Liberal and National MPs who are expected to be a much louder opposition than there has been in the past four years.\n\nBut it's Labor who returns with a very healthy 46 lower house seats, giving it plenty of firepower.\n\nSo what can we expect as Western Australia's 42nd parliament kicks off today?\n\nWhat's on the agenda?\n\nMr Cook was asked last week what was at the top of the government's agenda with parliament's return.\n\nLoading...\n\n\"Our key priorities are to make sure we get our WA Student Assistance Payment, the next round of that going, and to legislate for stamp duty,\" he said.\n\n\"We're also continuing to make sure that we do everything we can to bring on the household battery program as quickly as possible.\"\n\nThe keys to solving WA's housing crisis Photo shows An aerial shot of the inner-city Perth suburb of Mount Hawthorn As the housing crisis persists, experts say none of the promises made during the WA election campaign will make much difference to those struggling to get a foothold in the market.\n\nIn late March, the premier outlined the government's first post-election commitment to increase stamp duty exemptions and concessions for first home buyers. Now he wants the seal of approval.\n\nThe changes would see no payable stamp duty on a house valued up to $500,000 and the concessional threshold limit increased from $600,000 to $700,000.\n\nThe changes were effective from March 21, but the government needs them to be legislated. Once that's done, a determination will be made to backdate them.\n\nThe government also needs to get its second round of Student Assistance Payments up and running, although that doesn't need to pass through parliament.\n\nParents can claim $150 for primary school children and $250 for high school kids. (ABC News: Luke Stephenson)\n\nThe second round will allow parents to claim $150 for every kindergarten or primary school child and $250 for high school pupils in term two.\n\nIt'll also need to get its ducks in a row when it comes to the introduction of its household battery scheme.\n\nThe WA government is restructuring its departments, but what actually changes? Photo shows WA Premier Roger Cook wearing a suit and tie smiling at a lectern. WA Premier Roger Cook is making changes that will impact a third of government departments.\n\nThe subsidy scheme, slated to commence on July 1, will give one-off rebates of up to $7,500 for customers to purchase residential batteries, with interest-free loans to low and medium-income earners to fund the remainder of the cost.\n\nGiven its July start, businesses raised concerns customers would now hold off or cancel orders to wait for the rebate.\n\nThe government has hinted the implementation of the program may be brought forward, but it's a question mark at the moment.\n\nAdding to that confusion, federal Labor promised its own battery rebate on the campaign trail of $4,000 for every household, including for West Australians.\n\n\"We'll work through all those details,\" Treasurer Rita Saffioti said on Sunday when asked if West Australians could double-dip.\n\nLoading...\n\n\"We believe that through all of that we'll have the most generous battery scheme in the nation, but we want to make sure we can work together to get as many West Australians to apply as possible.\"\n\nFederal Assistant Minister for Climate Change and Energy Josh Wilson said Labor wanted the state and federal battery schemes to complement each other.\n\n\"It would mean that Western Australians are able to access home battery storage at, you know arguably, the most affordable price nationwide,\" he told ABC Radio Perth yesterday.\n\nExpect louder opposition\n\nMartin Drum, University of Notre Dame's professor of politics, thinks that although the government will still dominate, opposition parties will be heard more during Question Time, which is an important accountability measure.\n\nMartin Drum says Labor can expect more scrutiny in the new parliament. (ABC News: Courtney Withers)\n\n\"It's still a large majority in the lower house and that will still make it difficult for the opposition parties to scrutinise government activity,\" he said.\n\n\"Importantly when the new upper house comes in, they have a lot more ability to scrutinise legislation, and that shouldn't be able to pass nearly as easily.\"\n\nParliament's current upper house finishes its fixed term in late May, which means the new-look upper house, with a stronger representation of parties like the Greens, won't commence until then.\n\n\"With a current upper house where the Labor party has 22 members out of 36 … they're going to have a good opportunity to pass legislation,\" Professor Drum said.\n\nNormally, the first few weeks of parliament are a bit quiet as new members make maiden speeches and retiring upper house MPs give their valedictories, so it's unclear what legislation Labor will try and get through before the upper house changes come into effect.\n\nProfessor Drum also said one of the biggest differences from the previous parliament was the make-up of parliamentary committees, which will include \"more non-government members\".\n\n\"Where the upper house is involved, there'll be committees without government majority, so they might produce findings which are critical of government,\" he said.\n\nLiberals raring to go\n\nThe Liberals have increased their lower house seat count from two to seven and, crucially, have regained formal opposition status.\n\n\"I think there's a number of reasons why they're in better shape than they were before, I think there will likely be scrutiny over a range of government promises,\" Professor Drum said.\n\nBasil Zempilas will also take the floor of parliament as Liberal leader for the first time after Libby Mettam stepped down.\n\nWill Basil Zempilas be a lifeline or a liability for the WA Liberals? Photo shows Headshot of Basil Zempilas speaking. Is Basil Zempilas the silver bullet the WA Liberals so desperately need? Even within the party's own ranks, opinions are divided.\n\n\"There's still a fair bit of work to do because they didn't make the ground that they would have hoped [in the election], but having the leader of the opposition being in the Liberal Party is very good for the Liberal Party,\" Professor Drum.\n\n\"I expect that he'll probably be drawing a line under both the last term and the performance in the election and seeking a fresh start … and he'll be emphasising the need for unity and discipline in opposition.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/qld-star-accepts-lifeline/105149436",
        "title": "Star Entertainment signs $300m lifeline deal with US gaming giant",
        "publish_date": "Mon, 07 Apr 2025 21:51:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Embattled casino group Star Entertainment has secured a $300 million lifeline from US gaming giant Bally's, which has made a specialty of picking up \"distressed\" casinos.\n\nLast month it offered Star a $250 million deal and the Australian casino group wouldn't even meet with them.\n\nStar — which owns casinos in Brisbane, the Gold Coast and Sydney and employs more than 9,000 people — has warned for months it could fall into administration if a financier was not found.\n\nStar shares have been suspended from trade on the Australian Securities Exchange since March after the company failed to submit its half-year accounts.\n\nLast time they traded, a share was worth 11 cents. Near the end of 2021 they were trading at $3.85 per share.\n\nIn an update posted to the ASX on Monday night, Star has confirmed it has agreed to a $300 million rescue package with American casino and gaming group, Bally's.\n\nBally's would get a 56.7 per cent stake in Star, according to the ASX statement.\n\nThe deal could see Gold Coast pub and poker machine billionaire Bruce Mathieson potentially investing $100 million if needed, which would reduce Bally's contribution by $100 million.\n\nFirst $100 million payment due tomorrow\n\nThe first payment — about $100 million — will be made on Wednesday to allow the operator to stay afloat.\n\nA proposed long-term funding deal with Salter Brothers last week could not be finalised.\n\nThat left the door open to Bally's, after its initial approach to Star last month was unsuccessful.\n\nBally's owns and operates 19 casinos in the US.\n\nThe following $200 million is subject to a shareholder vote and regulatory approvals. (It might even come in two lots of $100 million, the first after a shareholder vote and the latter after approvals).",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/israel-to-eliminate-us-trade-barriers-trump-wont-pause-tariffs/105149326",
        "title": "Israel to 'eliminate' US trade barriers but Trump won't pause tariffs",
        "publish_date": "Mon, 07 Apr 2025 21:23:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Israeli Prime Minister Benjamin Netanyahu has vowed to eliminate his country's trade deficit with the United States during a meeting with Donald Trump at the White House, but the US president says his administration is not looking to pause tariffs that have shaken global financial markets.\n\nIn an address alongside Mr Trump in the Oval Office on Monday local time, Mr Netanyahu also said he would look to remove trade barriers between Israel and the US.\n\n\"We're going to also eliminate trade barriers, a variety of trade barriers that have been put up unnecessarily,\" Mr Netanyahu said.\n\nIsraeli Prime Minister Benjamin Netanyahu has vowed to eliminate trade barriers between his country and the United States. (Reuters: Kevin Mohatt)\n\n\"I think Israel can serve as a model for other countries that ought to do the same.\n\n\"I recognise the position of the United States that says: 'We are allowing other countries to put tariffs on us, but we don't put tariffs on them'.\n\n\" I'm a free trade champion and free trade has to be fair trade. \"\n\nMr Netanyahu's commitment comes after Mr Trump announced a 17 per cent tariff to be applied to Israeli goods that come into the US.\n\nThe United States, Israel's closest ally and largest single trading partner, last year had a $US7.4 billion ($12.3 billion) trade deficit with Israel.\n\nWhen asked if his administration would look to pause those tariffs while negotiations with Israel are ongoing, Mr Trump said he is looking to secure \"fair deals\" for the US.\n\n\"\"Well, we're not looking at [a pause]. We have many, many countries that are coming to negotiate deals with us and they're going to be fair deals,\" Mr Trump said.\n\n\"In certain cases they're going to be paying substantial tariffs. There'll be fair deals.\n\n\"We've been ripped off and taken advantage of by many countries over the years, and can't do it anymore.\"\n\nIsrael had already moved to cancel its remaining tariffs on US imports last Tuesday.\n\nThe two countries signed a free trade agreement 40 years ago and about 98 per cent of goods from the United States are now tax-free.\n\nThe leaders' White House meeting followed a day of significant financial losses on global markets, including almost $110 billion of share value being wiped off the ASX, in the wake of the tariffs announced by the US president.\n\nMr Trump stopped short of declaring a pause on 17 per cent tariffs he announced against Israel, saying he's working to secure \"fair deals\" with countries. (Reuters: Kevin Mohatt)\n\nTrump to hold 'major meeting' with Iran over nuclear program\n\nThe US president also told reporters in the Oval Office that his administration and Iran were beginning direct talks on Tehran's nuclear program, in a surprise announcement made after Iranian officials had appeared to rebuff US calls for such negotiations.\n\nIran had pushed back against Mr Trump's demands that it directly negotiate over its nuclear program or be bombed, though it had initially left the door open to indirect discussions.\n\n\"We're having direct talks with Iran, and they've started. It'll go on Saturday. We have a very big meeting, and we'll see what can happen,\" Mr Trump said.\n\nLoading...\n\n\"And I think everybody agrees that doing a deal would be preferable.\"\n\nMr Trump also refused to say whether his administration would look to take military action against Iran if the negotiations collapse, but said if the talks weren't successful \"Iran's going to be in great danger\".\n\n\"They can't have a nuclear weapon. It's not a complicated formula, Iran cannot have a nuclear weapon. That's all there is,\" the president said.\n\n\" If the talks aren't successful, I actually think it'll be a very bad day for Iran, if that's the case. \"\n\nWarnings by Mr Trump of military action against Iran had jangled already tense nerves across the Middle East after open warfare in Gaza and Lebanon, military strikes on Yemen, a change of leadership in Syria and Israeli-Iranian exchanges of fire.\n\nSaturday's meeting will come after Mr Trump said on March 7 that he had written to Supreme Leader Ayatollah Ali Khamenei to suggest talks. Iranian officials said at the time that Tehran would not be bullied into negotiations.\n\nThe US is in danger of becoming a friendless state Photo shows An illustration treatment of Donald Trump, from behind, walking between two curtains Some of America’s strongest allies are rethinking their relationship as Donald Trump’s isolationism threatens to entirely remake the West.\n\nDuring his 2017-2021 term, Mr Trump withdrew the US from a 2015 deal between Iran and world powers designed to curb Iran's sensitive nuclear work in exchange for sanctions relief. He also reimposed sweeping US sanctions.\n\nSince then, Iran has far surpassed that deal's limits on uranium enrichment.\n\nWestern powers accuse Iran of having a clandestine agenda to develop nuclear weapons capability by enriching uranium to a high level of fissile purity, above what they say is justifiable for a civilian atomic energy program.\n\nTehran says its nuclear program is wholly for civilian energy purposes.\n\nLoading...\n\nIsrael negotiating fresh hostage release deal, Netanyahu says\n\nMr Netanyahu said during his White House appearance that new negotiations were in the works, aimed at getting more hostages released from Hamas captivity in Gaza.\n\n\"We're working now on another deal that we hope will succeed, and we're committed to getting all the hostages out,\" he said in the Oval Office.\n\nMr Trump echoed that messaging, saying his administration is \"trying very hard to get the hostages out\".\n\n\"We're looking at another ceasefire, we'll see what happens,\" he said.\n\nPalestinians forced out of homes say they faced a horrifying journey Photo shows A man in combat gear walks over sand towards a damaged apartment building Five witnesses tell the ABC that multiple civilians were targeted and killed by the IDF when they were supposed to have safe passage out of the city of Tel Al-Sultan.\n\nThe Israeli leader highlighted an earlier hostage release agreement negotiated in part by Mr Trump's regional envoy Steve Witkoff that \"got 25 out\".\n\nMr Netanyahu's visit to Washington DC follows the collapse of Israel's six-week truce with the Palestinian terror organisation Hamas, whose militants launched an unprecedented attack on Israel on October 7, 2023 that triggered the war.\n\nThe fragile ceasefire ended with Israel's resumption of air strikes on Gaza on March 18.\n\nThe recent truce had allowed the return of 33 Israeli hostages, eight of whom were dead, in exchange for the release of some 1,800 Palestinians held in Israeli jails.\n\nThe prime minister and his government maintain — against the advice of most hostage families — that increased military pressure is the only way to force Hamas to return the remaining hostages, dead or alive.\n\nOf the 251 hostages abducted during Hamas's October 7 attack, 58 remain in captivity in Gaza, including 34 who the Israeli military says are dead.\n\nABC/wires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/alternative-y-school-finds-success-individualised-learning/105047314",
        "title": "'I love school now': How this small campus is keeping kids in class",
        "publish_date": "Mon, 07 Apr 2025 21:15:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "A school in Perth's north says it's figured out a way to improve the attendance rates of some of Western Australia's most disengaged students — and it may be as simple as catering to their hobbies and interests.\n\nSince 2022, the Y School in Mirrabooka has enrolled students in years 10 to 12 who've previously struggled to engage with mainstream education.\n\nIt's one of 11 independent alternative education schools in WA, which typically has small student cohorts and low student-to-teacher ratios.\n\nEducation experts say while alternative schools can offer important best-practice lessons, there are significant barriers to applying them more broadly.\n\n'I love school now'\n\nJames Parker may have physically turned up at his last school, but his mind was often elsewhere.\n\n\"I didn't have a lot of friends, and the teachers weren't very supportive, so I didn't feel comfortable going to class,\" he said.\n\nJames Parker struggled with engagement at his mainstream school. (ABC News: Lauren Smith)\n\n\"If someone is different to the rest of the class, it can be difficult for the teacher to personalise it for them [and] make it work for them.\"\n\nHis attitude changed when he arrived at the Y School and was given the opportunity to design its gym.\n\n\"It gave me something that was directly connected to school that I really loved,\" he said\n\nJames Parker helps clients in the school gym he helped design. (ABC News: Lauren Smith)\n\nJames is now studying a Certificate III in Personal Training while completing year 12.\n\n\"The teachers helped me link what I'm doing in class to what I'm doing in the gym and what I'll be doing in the real world once I finish school and get a job,\" he said.\n\n\" I love school now [and I come] five days a week … but I'd come more if I could. \"\n\nBarriers to learning\n\nData from the Australian Curriculum Assessment and Reporting Authority (ACARA) showed national attendance rates had trended downward over the past decade.\n\nLiz Parker is the principal at the Y School. (ABC News: Lauren Smith)\n\nBut in 2023, the Y School's overall attendance rate was 56 per cent, increasing to 64.5 per cent in 2024.\n\nWhile that's still well below the average for WA high school students, principal Liz Parker said it was a huge improvement for these students.\n\n\"A lot of them will come to us having found that mainstream school is not the place where they felt like they fitted,\" she said.\n\n'The system is broken' We asked students, teachers and parents all across Australia to tell us their thoughts and concerns about education. Here's what they said.\n\n\"When we unpack that, we find there are mental health issues, physical health issues, some of them are young carers and some of them have had family members with significant illness.\n\n\"There's been periods of time when they've disconnected from school and not felt like they can reconnect.\"\n\nAbout 100 students were enrolled and given a high level of support, with every learner assigned a youth worker and class sizes capped at 17.\n\nThe youth workers help students figure out what they want to do after school and plan their pathway.\n\nMs Parker credited the school's success to the personalised curriculum.\n\nEach student works with a youth worker who helps them master their learning. (ABC News: Lauren Smith)\n\n\"We look at their strengths, their capabilities, capacity and also the things that might hinder them,\" she said.\n\nEducation at 'tipping point'\n\nEducation experts said applying the Y School's philosophy in mainstream secondary schools would be a huge challenge.\n\nWA has some of the biggest classroom sizes in Australia, with a cap of 32 students for years 4 to 10.\n\nTeacher shortages and increased workloads were also placing pressure on the education system.\n\nDr Saul Karnovsky says there needs to be change and it needs to be a collaborative effort. (ABC News: Lauren Smith)\n\nCurtin University education researcher Saul Karnovsky said that was partly due to the increased standardisation of education.\n\n\"It's standardisation of assessment, of curriculum and now we are seeing a standard way of teaching,\" he said.\n\n\" It means teachers can't have the kind of creative autonomy they used to, to design learning that suits their community. \"\n\nDr Karnovsky said with the one-size-fits-all approach contributing to student disengagement, a review of the education landscape was well overdue.\n\n\"What we are teaching them and how we are teaching them doesn't suit modern young people growing up in Australia in 2025,\" he said.\n\nStudents create art work at the Y School. (ABC News: Lauren Smith)\n\n\"We're at a tipping point [and] younger people want more out of schools that suits their needs.\n\n\"We need to wind back all that standardisation and begin from a place of trust.\"\n\nSector in need of 'rethink'\n\nKellie Tobin is a lecturer at Deakin University with a focus on social justice education and equitable learning.\n\nShe believed with mental health challenges and higher demands turning learners away from the classroom, the sector needed a rethink of how teachers themselves were trained.\n\n\"It requires a change in the way we think about our current schooling structures and programs, but also in the ways we teach young people,\" she said.\n\n\"It's around having authentic learning experiences for the students, things that are real and connect to their real world.\"\n\nAttending Y School has given James the confidence to work towards making his dreams a reality. (ABC News: Lauren Smith)\n\nConnecting his passions with school had been transformative for James, who hopes to own his own gym one day.\n\n\"It was always a dream, [but] I feel a lot more confident that I will achieve that,\" he said.\n\n\"It feels amazing, like nothing else I've experienced before.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/asx-markets-business-live-news-08april-2025/105149368",
        "title": "Live: ASX lifts and Asian markets climb after tariff turbulence on Wall St",
        "publish_date": "Mon, 07 Apr 2025 21:00:18 +0000",
        "category": "finance",
        "authors": [
            "Samuel Yang",
            "Michael Janda",
            "Emily Stewart",
            "Luke Cooper",
            "Stephanie Chalmers"
        ],
        "text": "Would love some economics 101, the past 3 or so years the reserve bank has been talking about getting inflation under control. Now since the US 10% tariff decision that seems to be thrown out the window, and rate cuts are back on the cards. Is inflation now not a primary concern? - A\n\nHi A, the Reserve Bank won't throw inflation out the window when it comes to deciding the level of interest rates.\n\n\"Remember, the Reserve Bank bails out the economy, not financial markets, and so it's not going to be responding to the fall in financial markets, per se, it's going to be responding to what it thinks the economic implications might be,\" Challenger chief economist and former senior RBA official Jonathan Kearns told Kirsten Aiken on The Business yesterday.\n\nWhat it does look at, though, is where the economy is heading over the next year or two, which is when its rate moves will take full effect.\n\nA recent speech by RBA assistant governor Sarah Hunter noted that the full effect of a rate move on GDP took about nine months and double that time for inflation.\n\nRBA modelling shows the GDP response to rate cuts peaks three quarters later. (RBA)\n\nFinancial markets also don't price shares for what companies are earning today, but what they think they'll be earning in six, 12 or 24 months from now.\n\nSo, in a sense, share markets and the RBA are looking at the same thing and, if their views align about the future, then it makes sense that rate cuts will often coincide with big stock market falls.\n\nAlso, while the US tariffs will certainly increase inflation in the US, at least in the short-term, it isn't clear they'll do the same here.\n\nThere is a prospect that a reduction in consumption in the US may see some consumer goods redirected to Australia, pushing prices down here.\n\nThis isn't what recent Treasury modelling predicts, but nor does it expect a massive uptick in prices in Australia from the tariffs either.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-08/send-us-your-perimenopause-questions-live-blog/105132884",
        "title": "Perimenopause has a big impact on your life. Ask our health experts your questions",
        "publish_date": "Mon, 07 Apr 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "On Friday April 11, ABC News will be hosting our Ladies We Need To Talk perimenopause Q&A live blog.\n\nWe will have a panel of health experts to answer your questions on navigating the physical, mental and sexual upheaval that can occur in the months and years leading up to a person's last period.\n\nOur special guests on the day will be Dr Natasha Vavrek, a consulting specialist women's GP at The Bubble Launceston; and Dr Shelley Wilkinson, the principal dietitian at Lifestyle Perimenopause. They will both be on board from 11.30am AEDT on Friday April 11 to answer your questions.\n\nAnd we'll also have Professor Susan Davis, head of the Monash University Women’s Health Research Program, to answer some of your questions early in the day too.\n\nFrom hot flashes and night sweats to painful sex, mood swings and rage, the hormone fluctuations that accompany perimenopause can lead to a range of symptoms. And yet there's so much confusion as to how to make it through.\n\nSo, what are your best ways to remedy these symptoms and enjoy this phase of life? Our experts specialise in these areas, so please send us a question via the contact form below, being sure to include brief details of the issue, your age group and which state you're in. We'll endeavour to answer as many as possible in our live blog on Friday.\n\nLoading...\n\nPlease note: This content is published for general information purposes only. It should not be used as a substitute for professional medical advice. Always seek the advice of your doctor or other qualified healthcare provider with any questions you may have regarding your health or a medical condition.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/business/markets/us-stock-market-undergoes-wild-swings-after-false-rumour-on-trump-tariffs-20250408-p5lpxv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX rebounds after Wall Street rollercoaster; Tech, consumer stocks rise",
        "publish_date": "Tue, 08 Apr 2025 11:55:23 +1000",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket opened higher after its bloodbath on Monday, following a manic session on Wall Street overnight where US stocks careened as President Donald Trump threatened to crank his tariffs even higher, despite global markets’ stunning losses since “Liberation Day”.\n\nThe S&P/ASX 200 rose 97.50 points, or 1.3 per cent, to 7440.80 as of 11.38am AEST, with all 11 industry sectors advancing, led by consumer discretionary, energy and tech stocks. The rebound comes after the index tumbled by 4.2 per cent on Monday, its biggest fall since the COVID-19 pandemic of 2020 as a panicked sell-down wiped almost $100 billion from the local market.\n\nThe Australian dollar plunged to five-year lows of less than US60¢ on Monday and was trading at US60.14¢ as of 11.37am.\n\nUS President Donald Trump has doubled down on his stiff tariffs, despite seeing how much Wall Street wants him to do the opposite. Credit: AP\n\nTech stocks led the morning’s rebound, which saw some of the market’s hardest-hit sectors in the sell-down pare back some of their losses. The nation’s biggest IT stock, WiseTech, rose 2 per cent, while software companies Xero and Technology One gained 2.6 per cent and 3.7 per cent, respectively, and family member tracking app Life360 rallying 7.2 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/have-we-reached-the-point-of-peak-connectivity-we-re-just-getting-started-20250326-p5lmpa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Have we reached the point of ‘peak connectivity’? We’re just getting started",
        "publish_date": "Tue, 08 Apr 2025 11:54:46 +1000",
        "category": "finance",
        "authors": [
            "Cameron Bayley"
        ],
        "text": "As cloud gaming grows in popularity, again demand is pushing household expectations further, requiring between 14 and 24 times more data than standard streaming, and appetite for this world is sure to grow with some of the developments already glimpsed on the horizon. “I think it’s going to be AI-generated — AI that can generate quests dynamically and entire worlds tailored to your actions,” says Hunter.\n\nBrain-controlled gaming could remove the need for handheld controllers entirely, and both virtual and augmented reality are nowhere near their full capacity yet. “We’re just getting started,” he adds.\n\nTV and home transformed\n\nCurrently, the average home contains 25 connected devices. Credit: iStock\n\nJia paints an all-too-familiar picture of the cosy get-togethers of yesteryear. “I remember in the 1980s when some families had their first colour TV, their family members and even neighbours would gather to view programs.”\n\nOne little development that followed had us all very excited also. “When the remote control arrived, we thought, ‘This is it, this is peak’,” adds Hunter.\n\nSmart TVs would have something to say about that, and those along with other devices for the home, has meant connectivity has almost snuck up on us. “It’s already in everybody’s life, [things like] smart home devices like Google Nest, smarter lights that you can control from your mobile phone, home security with cameras,” Jia explains.\n\nThe research again predicts a rise in the adoption of these and other data-hungry tech, revealing that almost 80 per cent of Australians are keen to add more next-generation tech to their world, whether it’s immersive streaming or using high-definition connected cameras.\n\nWhat office?\n\nFlashback just a decade ago and for a huge proportion of working Australians the idea of conducting their role entirely from home would have been dismissed as a pipe dream. Yet living in lockdown had many of us doing precisely that, borne by necessity.\n\nWe evolved our work environment, finding innovative ways to pivot, and showing that what was thought impossible was, by and large, surprisingly adaptable. “We are all game players and we are all potentially game changers; every one, every industry,” states Jia.\n\nThe creation of smart cities will be what takes us to the next level, and connectivity will drive that — to the point where its presence is a given. “[The future will be] more about smarter and invisible connections, so devices that anticipate our needs, communicate seamlessly and basically connectivity itself becomes ubiquitous and we’ll stop noticing it,” says Hunter.\n\nAn ever-evolving connected world will require us to filter the information that’s best for us to digest, and know how to keep it under control, but that’s all part of moving forward.\n\n“This is a very dynamic era and everything is changing,” says Jia. “We need to continue to stay open, embrace all the potential, be adaptable and remain curious.”\n\nWhatever tomorrow brings in innovation, one thing is for certain: Australia’s broadband network — nbn — is ready to connect you to the future. Do great things on Australia’s network. Learn more here.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/community-in-shock-after-mans-body-found-in-home-on-phillip-island-20250408-p5lq3e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Community in shock after man's body found in home on Phillip Island",
        "publish_date": "Tue, 08 Apr 2025 11:54:31 +1000",
        "category": "finance",
        "authors": [],
        "text": "Community in shock after man's body found in home on Phillip Island\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/trump-surfs-high-on-a-wave-of-tariff-unease-just-the-way-he-likes-it-20250408-p5lpz5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump surfs high on a wave of tariff unease, just the way he likes it",
        "publish_date": "Tue, 08 Apr 2025 11:53:39 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "Washington: Donald Trump spent the weekend playing golf in Florida. He wore a MAGA cap and even posted clips on social media. Far from hiding from the tariff-prompted market crash, he was projecting nonchalance.\n\nMeeting with Israeli Prime Minister Benjamin Netanyahu on Monday (Tuesday AEDT), he was equally sanguine. If he was at all worried by the massive stock sell-off and growing drumbeat of opposition on Wall Street, he didn’t let on.\n\nIsraeli Prime Minister Benjamin Netanyahu with Donald Trump in the Oval Office. Credit: Getty Images\n\nAnd that’s probably because in many respects, Trump has everyone right where he wants them. He says he has world leaders on the phone “dying to make a deal”, and offering to remove long-standing trade barriers, just as he demanded and predicted.\n\nThe EU says it has made an offer to cut tariffs on certain goods. Japan and the US are commencing talks. And in the Oval Office, Netanyahu provided a shining example for Trump to show the rest of the world. The Israeli leader pledged to cut down Israel’s trade surplus with the US to zero and eliminate tariffs, in what looked like a highly orchestrated but nonetheless valuable demonstration of Trumpian dealmaking.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/why-locals-are-fighting-to-keep-the-potholes-on-this-dilapidated-road-20250407-p5lpq7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why locals are fighting to keep the potholes on this dilapidated road",
        "publish_date": "Tue, 08 Apr 2025 11:37:00 +1000",
        "category": "finance",
        "authors": [
            "Adam Carey"
        ],
        "text": "The Boulevard in Ivanhoe East might be Melbourne’s most dilapidated road, but the locals love it that way – and will fight anyone who dares try to fix it.\n\nAlong most of its 2.8-kilometre length between Banksia Street and Burke Road, The Boulevard is badly cracked and potholed. Loose chunks of bitumen, some the size of cricket balls, litter the crumbling roadside.\n\nThe Boulevard in Ivanhoe East has not been resurfaced for decades, and is more frequently used by pedestrians than motorists. Credit: Justin McManus\n\nDriving its length is a bone-rattling experience, best done at speeds of 30 km/h or less.\n\nThe advisory speed limit, set due to the road’s degraded condition, also affords motorists time to soak up bucolic views of the Yarra Flats parkland to the east and a row of palatial, multimillion-dollar houses to the west.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/workplace/benefits-of-wfh-now-too-big-to-ignore-20250408-p5lpyu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Benefits of WFH now too big to ignore",
        "publish_date": "Tue, 08 Apr 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Cassandra Winzar"
        ],
        "text": "The Coalition’s decision to change its policy on working from home (WFH) for public servants shows the benefits of this kind of workplace flexibility are now too big to ignore.\n\nThirty-six per cent of Australians worked from home on a regular basis in 2024, ABS figures show. That’s almost the same as the 37 per cent who did so in 2023. But it’s a dramatic rise from the five per cent rate before COVID seen in the 2016 Census.\n\nA larger proportion of the population has benefited from this shift to WFH. Credit: iStock\n\nWhile that means the majority of Australians don’t WFH regularly, the benefits experienced by the one-third of Australians who WFH are enjoyed more broadly.\n\nIn households where one person works from home and another goes to the office, the whole household benefits from the time and money saved on commuting and buying lunch, as well as other less quantifiable benefits such as the flexibility to do chores at home.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/how-an-arsenal-champions-league-loss-could-benefit-the-matildas-20250408-p5lpyz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How an Arsenal Champions League loss could benefit the Matildas",
        "publish_date": "Tue, 08 Apr 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "It might be broken-record territory, but there really is no getting over the impact of the coaching situation. It has been most irregular to see a nation as prominent as Australia go so long without any sort of on-field direction, and especially with an Asian Cup just around the corner. So kudos to Sermanni, who in difficult circumstances has ensured that the Matildas have taken as much as they could from these two games against South Korea. Standing still in women’s football these days is going backwards; at least in this window, they’ve taken a tiny step forward. Matildas interim head coach Tom Sermanni. Credit: Getty Images Though their cohesion in the final third and retention of possession could have been better, it’s hard to sneeze at two confidence-boosting wins and two clean sheets against the team that knocked them out of the last Asian Cup in heartbreaking fashion. In Newcastle, Sermanni may have found the answer to the seemingly eternal question of how Australia can get the best out of Mary Fowler and her majestic talents.\n\nIt was pretty obvious, though: play her in the same position and role as Manchester City, out on the left wing, enabling her to cut inside and use her vision and technique to set up goals or score them herself, as she did on Monday night. “At club land, I play on the wing quite often, and I really like playing there,” Fowler said. Mary Fowler. Credit: Getty Images “I see a lot of the field from there and just a lot of different angles, so I enjoyed being there ... on a personal level, I want to try to be a bit more consistent with my performance as a national team. I think being out in that position made it a bit easier for me to be in a role that I’ve played quite a bit this season.” Playing Fowler on the left means Foord will have to play elsewhere. The good news is she can play just about anywhere. Foord came on at half-time for Holly McNamara, who has recovered from her third ACL injury to prove she has a role to play for the Matildas, and was deployed as a central striker. She can also play on the right, as she has occasionally with Arsenal, and to best accommodate Foord and Sam Kerr, that might be her best position moving forward.\n\nThrow in the likes of Sharn Freier, Hayley Raso, Michelle Heyman, Kaitlyn Torpey and, at some point, Cortnee Vine, and there are a bunch of puzzle pieces waiting to be put together. Speaking of Kerr, there’s another tick for this window: Kerr has been successfully re-integrated into the Matildas set-up and the circus surrounding her behaviour and captaincy has now passed. The rousing reception shown by crowds in Sydney and Newcastle each time the 31-year-old was shown on the big screen was evidence of what Sermanni said last week: most Matildas fans still adore her. Loading “Even playing, when she comes on the big screen, the cheer ... it’s a bit of a shock because you’re like, ‘Have I missed something? What’s going on’?” Catley said. “It just shows how much the country loves her and so many people support her. We support her ... she’s been through a really tough time the last year or so, and the main thing for us is just making sure that she was OK as a person and having her in camp and her leadership and just having her around is always amazing for us. It’s nice to have her back.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/cctv-footage-shows-tornado-hitting-new-zealand-town-20250408-p5lq2z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CCTV footage shows tornado hitting New Zealand town",
        "publish_date": "Tue, 08 Apr 2025 11:24:46 +1000",
        "category": "finance",
        "authors": [],
        "text": "CCTV footage shows tornado hitting New Zealand town\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/infinite-green-energy-collapses-into-administration-20250331-p5lnyz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hydrogen hopeful Infinite Green Energy collapses into administration",
        "publish_date": "Tue, 08 Apr 2025 11:22:32 +1000",
        "category": "finance",
        "authors": [
            "Jesinta Burton"
        ],
        "text": "Perth-based hydrogen player Infinite Green Energy has brought in administrators less than 24 hours before a Supreme Court hearing in a multimillion-dollar debt dispute its chief executive claimed the WA Premier could help resolve.\n\nKordaMentha’s Richard Tucker and Jared Palandri were handed the reins to the company and nine of its associated entities on Monday, according to documents filed with the corporate regulator.\n\nInfinite Green Energy CEO Stephen Gauld. Credit: Kate Ferguson\n\nThe appointment came just hours before IGE had been due to front court in an investor row it had successfully kept under wraps until it was revealed by WAtoday — which is understood to have sparked concern among other stakeholders who have since been scrambling to safeguard their investment.\n\nFor the past six weeks, IGE has been fending off a bid by Queensland-based investor DD Investment to have liquidators appointed over its failure to repay a $3.85 million debt.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/holiday-from-hell-or-killer-season-the-cases-for-and-against-the-white-lotus-20250408-p5lq03.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Holiday from hell or killer season? The cases for and against The White Lotus",
        "publish_date": "Tue, 08 Apr 2025 11:05:53 +1000",
        "category": "finance",
        "authors": [
            "Thomas Mitchell"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size For eight episodes, The White Lotus’ writer and director Mike White kept viewers guessing as to who the body in the water would be (turns out there was more than one). But was it a satisfying conclusion to another standout season, or was White just repeating himself, retreading the themes from seasons one and two? Writers Thomas Mitchell and Cameron Bayley take up the case for and against season three of The White Lotus. The case for season three ... It’s always a worry when you begin to sound like your parents, but after hearing endless criticism of The White Lotus’ third season – “Too slow! Nothing happens! Where’s Jennifer Coolidge?” – I suspect their fears about social media ruining our brains might be on the money. In this brave new world of TikTok attention spans, we’ve lost the ability to appreciate anything that doesn’t trigger our dopamine receptors in 15 seconds or less. Timothy (Jason Isaacs) and Victoria Ratliff (Parker Posey) are not relaxed at The White Lotus. Has it been a slow burn? Sure. Is there anything wrong with that? Absolutely not. Successfully pulling off a third instalment was destined to be a gargantuan effort for Mike White. Partly because the first two seasons were so well received and partly because the formulaic nature of the show (rich people, fancy resort, mysterious death) means audiences are conditioned to White’s particular brand of craziness. All of which makes the achievements of season three more impressive.\n\nAdvertisement\n\nRather than overstaying its welcome, The White Lotus has found itself at home on holiday, White no longer wedded to a single theme but free to turn his discerning eye where he sees fit. Where seasons one and two explored class dynamics and sexual politics, season three expanded its horizons: the complexity of midlife friendships, toxic masculinity, capitalism as a force of all-consuming corruption, the fine line between hedonism and spirituality, and, yes, brotherly incest. Saxon (Patrick Schwarzenegger) after his night that he could barely remember. On that note, The White Lotus is the standard-bearer for water cooler TV, and even by that metric, this season didn’t disappoint. Few people will forget where they were when they first watched Sam Rockwell’s monologue about wanting to be an Asian girl in lingerie; Walton Goggins’ facial reactions captured what everyone at home was feeling. An instant entrant into The White Lotus Hall of Fame, that scene was all anyone could talk about until that other scene. I’d hate to see the official Google search results for “Saxon and Lochlan incest”, but I suspect they’d be worryingly high. Frank (Sam Rockwell) and Rick’s (Walton Goggins) Bangkok side-quest was a season three highlight. Delivering shocking “moments” has become White’s calling card, so too serving up endlessly quotable dialogue that can be repurposed as memes to live forever on the internet. Naysayers were already fretting about the Coolidge-sized hole in season three. Who would provide the comic relief? Could anyone deliver a line such as, “These gays, they’re trying to murder me,” with that kind of timing? Enter Parker Posey. As the pill-popping Victoria Ratliff, Posey was a revelation. Her overly affected North Carolina accent single-handedly changed how everyone says “tsunami” or “Buddhism.”\n\nAdvertisement\n\nWhile it is easy to list the quantifiable ways in which The White Lotus is great TV – inspired casting, gripping cinematography, unrivalled art direction – this series has always been one that lives and dies on the strength of its finale. Belinda (Natasha Rothwell) got more than she bargained for in season three. In season three, White was able to gather his loose ends and blend them (just like a poison smoothie) in a deeply satisfying yet cynical ending. Loading Of course, Rick’s quest for revenge descended into a Greek tragedy, ending with not only his death but the death of Chelsea (Aimee Lou Wood), the only person who ever really loved him. Of course, Tim Ratliff (Jason Isaacs) learnt there are more important things in life than federal prison and being rich (and all it took was nearly killing his youngest son). And, of course, Belinda (Natasha Rothwell) and Gaitok (Tayme Thapthimthong), the two characters we were supposed to sympathise with, end up turning into the worst versions of themselves. Gaitok betraying his Buddhist beliefs to take a life and the newly minted Belinda channelling her inner Tanya, abandoning her promise to Pornchai (Dom Hetrakul), and sailing off into the sunset. A masterful way to check out of The White Lotus. Now pass me the Lorazepam. Thomas Mitchell\n\nAdvertisement\n\nThe case against season three ... “Nooo! Mike White, nooooo!” The latest season of The White Lotus may have gone out with a bang (in fact, several), but it took seven weeks of whimpers to get there. Chelsea (Aimee Lou Wood) and Saxon (Patrick Schwarzenegger) in the final episode of The White Lotus. Having dutifully checked in to this Thailand outing, I was excited for another twisted tale of the super-rich in all sorts of physical and psychological peril. Loading However, it didn’t take long before I started to feel something was amiss – not unlike Jaclyn (Michelle Monaghan), Laurie (Carrie Coon) and Kate (Leslie Bibb) at the senior citizen’s resort (one of many unexplained plot strands). Mirroring Jason Isaacs’ Lorazepam-induced Timothy Ratliff, this season soon became the epitome of a fugue state.\n\nAdvertisement\n\nMike White, sticking to the same roll-call of characters (Screwed up family? Check. Ditsy doyenne? Check. Douche bro? Check. Criminal undercurrent? Check), trod water, with set-ups, characters and storylines going nowhere fast. Take Isaacs’ troubled mogul who, after discovering he was about to go down for some seriously bad financial shenanigans, turned to his wife’s mind-numbing anxiety meds and henceforth wandered around in what could be an audition for The Walking Dead right up until the last few moments of the season. Even a subplot involving a stolen gun and some cocktail-induced familicide barely seemed to register with him. Gary/Greg (Jon Gries) had little comeuppance in the final episode. Who wasn’t on tenterhooks waiting to hear what Parker Posey’s Victoria (“I just don’t think at this age I’m meant to live an uncomfortable life”) would make of the news her life was about to become Gucci-free? It’s a crime we were denied this. Joining Isaacs in true zombie form was the excellent Walton Goggins, whose Rick arrived rebuffing any attempt at engaging with anyone, including his girlfriend Chelsea (who had to constantly proclaim their soulmate connection as we never saw a skerrick of this otherwise). He remained infuriatingly somnambulistic until the show’s final few scenes. K-pop star Lisa Manobal was inspired casting as Mook. To his credit, White casts his shows impeccably, and bringing in K-pop superstar Lalisa Manobal was an inspired choice. But her character, Mook, was only there to smile at Gaitok, the world’s most inept security dude. We had to watch Gaitok look merely perturbed for an entire seven episodes (losing a gun barely causing a ripple) until those last few moments.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/henry-worked-135-hours-in-the-past-fortnight-today-he-joined-thousands-demanding-change/7djhtzlwo",
        "title": "Henry worked 135 hours in the past fortnight. Today, he joined thousands demanding change",
        "publish_date": "Tue, 8 Apr 2025 01:48:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Thousands of doctors from more than 30 public hospitals across NSW walked off the job on Tuesday, seeking a one-off, 30 per cent salary increase and guaranteed breaks.\n\n\n\n\n\nOutside the 975-bed Westmead Hospital in Sydney's west, hundreds of doctors chanted that only safe working conditions could provide patients with safe care.\n\n\n\n\n\n\"Doctors at this rally have actually already signed contracts in other states,\" junior doctor Henry Crayton said.\n\n\n\n\n\n\"I'd be lying if I said I myself was not actively looking, because if the state government doesn't value me and doesn't help me be the best doctor I can, why would I stay?\"\n\n\n\n\n\nHe said he'd worked 135 hours in the past fortnight, with one day off, covering 150 patients per shift.\n\n\n\n\n\n\"That is a completely normal fortnight for me, and I'm over it,\" Crayton said.\n\n\n\nAnother western Sydney doctor said the government's unwillingness to move on pay and conditions was demoralising the sector.\n\n\n\n\n\nFirst-year doctors earn about $38 an hour but can collect $45 per hour in Queensland, before considering penalty rates and extra leave.\n\n\n\n\n\n\"Patient care is declining simply by virtue of the fact we can't staff our hospitals appropriately — we are chronically unstaffed,\" Zachary McPherson said.\n\n\n\n\n\n\"Any one of our doctors here striking today could make 20 or 30 per cent more money just by simply moving to Brisbane or Melbourne.\"\n\n\n\nFears of health system chaos\n\nThe strike — the first by NSW doctors since 1998 — has sparked fears that an already stretched health system will plunge into chaos, although union officials insist urgent care will be administered.\n\n\n\n\n\nHospitals will be staffed at public holiday levels throughout the strike, with only non-urgent procedures postponed.\n\n\n\n\n\nThe NSW doctors also want better work conditions, such as a guaranteed 10-hour break between shifts.\n\n\n\nHealth Minister Ryan Park urged union officials to negotiate \"without the threat of industrial action over the community's head\".\n\n\n\n\n\nHe said elective surgery patients would remain waiting in pain as a result, adding that public holiday staffing levels were far below a regular Tuesday.\n\n\n\n\n\n\"We understand there are gaps in pay, we're not trying to hide from the fact that there are,\" he told ABC radio.\n\n\n\n\n\n\"What we've said to the union is, 'can we get more time to try and make this catch-up a reality?'\n\n\n\n\n\n\"We simply can't do it over the course of a single year, that's not feasible.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/us-defends-tariffs-on-uninhabited-australian-islands/e5p7j6ehi",
        "title": "US defends tariffs on uninhabited Australian islands populated by penguins and seals",
        "publish_date": "Tue, 8 Apr 2025 00:48:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Australian islands inhabited only by penguins had to be hit with tariffs to close potential \"ridiculous loopholes\", the US commerce secretary said.\n\n\n\n\n\nThe Heard and McDonald islands are uninhabited and were part of a range of countries and territories that would be subjected to tariffs under Donald Trump's so-called 'Liberation Day' plans .\n\n\n\n\n\nA 10 per cent tariff will be placed on goods from these islands, a \"reciprocal\" tariff on the 10 per cent the US believes it pays.\n\n\n\nWhy did the United States introduce the tariffs on the islands?\n\nHoward Lutnick, the US commerce secretary, defended the tariffs during an interview with US broadcaster CBS, in which he added: \"The idea is that there are no countries left off.\"\n\n\n\n\n\n\"If you leave anything off the list, the countries that try to basically arbitrage America go through those countries to us.\"\n\n\n\nWhat has Australia said about the tariffs?\n\n\"The unilateral action that the Trump administration has taken today against every nation in the world does not come as a surprise. For Australia, these tariffs are not expected, but let me be clear — they are totally unwarranted,\" Prime Minister Anthony Albanese said last week when they were announced.\n\n\n\n\n\nHe added: \"Nowhere on earth is safe.\"\n\n\n\nWhere are the Heard and McDonald Islands and how do you get there?\n\nThe Heard and McDonald Islands are around 4,100km southwest of Perth and more than 1,500km north of Antarctica.\n\n\n\n\n\nThe islands are populated by seals, penguins, and birds — but not by people.\n\n\n\n\n\nAustralia's Antarctic Program says to visit Heard Island, you need to travel by boat, with the journey taking around two weeks from Australia.\n\n\n\nWell, usually it's cold, rainy and windy. It does depend where exactly you are on the island, but pretty much anywhere is still cold, rainy and windy. Australian Antarctic Program\n\nIt added: \"(Outside of Australian Antarctic Science expeditions) the birds and seals have the place to themselves, except for the very occasional visit by a commercial tourist group, private expedition, or periodic fisheries/defence surveillance patrols.\"\n\n\n\nWhat are the US tariffs?\n\nAustralia will be hit with a blanket 10 per cent base tariff. This is the global baseline and the smallest tariff implemented.\n\n\n\n\n\nAccording to a chart displayed by Donald Trump , the tariffs hitting each country include:\n\n\n\nAustralia: 10 per cent\n\nChina: 34 per cent\n\nEuropean Union: 20 per cent\n\nVietnam: 46 per cent\n\nTaiwan: 32 per cent\n\nJapan: 24 per cent\n\nIndia 26 per cent\n\nSouth Korea 25 per cent\n\nThailand 36 per cent\n\nJapan: 24 per cent\n\nIsrael: 17 per cent\n\nNorfolk Island was earmarked for a 29 per cent tariff but a spokeswoman for the island's administrator told SBS News that it made no exports to US, and had since confirmed it would only be charged 10 per cent .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/mary-fowler-shines-as-matildas-defeat-south-korea/ah0wbwvpz",
        "title": "Mary Fowler shines as Matildas defeat South Korea",
        "publish_date": "Mon, 7 Apr 2025 21:22:08 +0000",
        "category": "sports",
        "authors": [],
        "text": "Enjoying a move to the wing, Mary Fowler believes she's only scratching the surface of her national team potential after helping the Matildas to a 2-0 win over South Korea in Newcastle.\n\n\n\n\n\nAfter igniting Australia off the bench in Sydney last Friday, Fowler returned to the starting line-up at McDonald Jones Stadium and regained her best form against the world number 19 team on Monday night.\n\n\n\nFowler steals the show\n\nThe 22-year-old star outworked four South Korean defenders in the box to slot the 44th-minute opener before sparking Kaitlyn Torpey's goal in front of a record 28,019-strong crowd.\n\n\n\n\n\nFowler had plucked the ball off Lim Seon-joo and crossed to substitute Caitlin Foord — cleared of suffering a nose fracture after a head clash in Friday's match in Sydney — in the 63rd minute.\n\n\n\nREAD MORE Sam Kerr clear to keep Matildas captaincy after not-guilty verdict in harassment case\n\nIt was a move to the left wing — the same role at her club side Manchester City — that helped Fowler spark her side.\n\n\n\n\n\nSouth Korea almost hit the scoreboard when Ko Yoo-Jin's header crossed the line in the 86th minute, but the debutant was found to be offside.\n\n\n\nPraises from Sermanni\n\nTom Sermanni, whose future as Matildas caretaker boss remains unclear, could only praise the young star.\n\n\n\n\n\n\"I thought tonight was the most involved I've seen her in the game since I've been the coach,\" Sermanni said.\n\n\n\n\n\n\"You see how valuable a player she is when she actually gets on the ball.\"\n\n\n\nKennedy and Yallop collide\n\nAlanna Kennedy looked worse off after a collision with teammate Tameka Yallop minutes later.\n\n\n\n\n\nKennedy had extensive bruising and swelling around her right cheek and Yallop walked gingerly with a knee complaint, but both veterans finished the first half.\n\n\n\n\n\n\"Yallop's OK. She's obviously got a hard Queensland head,\" Sermanni said. \"And Alanna's OK — she's got a real sweller. She'll probably have a shut eye tomorrow, but we don't think she's done any damage.\"\n\n\n\n\n\nThe pair were eventually substituted in the 59th minute, replaced by Claire Hunt and Torpey.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/donald-trump-threatens-china-with-extra-50-per-cent-tariff-says-hes-not-looking-at-pause/prc4ix1wb",
        "title": "Donald Trump threatens China with extra 50 per cent tariff, says he's 'not looking' at pause",
        "publish_date": "Mon, 7 Apr 2025 20:41:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "A global trade war touched by United States President Donald Trump's sweeping tariffs escalated further on Monday as Trump threatened to increase duties on China and the European Union proposed counter-tariffs of its own.\n\n\n\n\n\nTrump said on Tuesday he was not considering a pause on tariffs to allow for negotiations with trading partners, but he said he would talk to China, Japan and other countries about the duties.\n\n\n\n\n\nAsked during a White House press availability with Israeli Prime Minister Benjamin Netanyahu if he was open to pausing tariffs, Trump said: \"Well, we're not looking at that. We have many, many countries that are coming to negotiate deals with us and they're going to be fair deals. And in certain cases they're going to be paying substantial tariffs. There'll be fair deals.\"\n\n\n\nChina's retaliation\n\nTrump said he would impose an additional 50 per cent duty on US imports from China on Wednesday if it did not withdraw the 34 per cent tariffs it had imposed on US products last week.\n\n\n\n\n\nThose Chinese tariffs had come in response to 34 per cent \"reciprocal\" duties announced by Trump.\n\n\n\nREAD MORE Australian, global shares take major hit amid fears of a US recession after Trump tariffs\n\n\"All talks with China concerning their requested meetings with us will be terminated!\" Trump wrote on social media.\n\n\n\nHow has Europe responded?\n\nThe European Commission proposed counter-tariffs of 25 per cent on a range of US goods, including soybeans, nuts and sausages, though other potential items like bourbon whiskey were left off the list, according to a document seen by Reuters.\n\n\n\n\n\nOfficials said they stood ready to negotiate a \"zero for zero\" deal with Trump's administration.\n\n\n\n\n\nEU trade commissioner Maros Sefcovic said at a news conference: \"Sooner or later, we will sit at the negotiation table with the US and find a mutually acceptable compromise.\"\n\n\n\nRecession fears\n\nFinancial markets across the globe posted a third day of losses as investors worried that steep trade barriers around the world's largest consumer market could lead to a recession.\n\n\n\n\n\nAsian and European shares also plunged as investors feared the duties Trump has likened to \"medicine\" could lead to higher prices, weaker demand and potentially a global recession.\n\n\n\n\n\nGoldman Sachs raised the odds of a US recession to 45 per cent.\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-can-trillions-just-disappear-what-you-may-not-know-about-the-stock-market/2zeoy1a67",
        "title": "How can trillions just disappear? What you may not know about the stock market",
        "publish_date": "Mon, 7 Apr 2025 19:48:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Trillions have been wiped off markets since United States President Donald Trump announced his latest round of tariffs last week during a so-called 'Liberation Day' event.\n\n\n\n\n\nAnd it's not just the US stock markets that are nosediving; economies around the world, including in Australia , have witnessed sharp declines.\n\n\n\n\n\nThe Australian share market took its biggest hit in over a year on Monday, as fears grow that the US could enter a recession, limiting its buying power and creating global uncertainty.\n\n\n\nWhere did the money go?\n\nDr Pramod Kumar Yadav, a lecturer of finance at the University of Sydney Business School, told SBS News the missing trillions are subjective values, not physical money.\n\n\n\n\n\n\"The decrease in the market value is not equivalent to cash. It's essentially a decline in the market value of stocks that are listed on that particular exchange,\" he said.\n\n\n\nREAD MORE Australian, global shares take major hit amid fears of a US recession after Trump tariffs\n\nYadav said stock prices can fall due to the uncertainty that an economic measure like trade tariffs can create, making stock markets risky for investors.\n\n\n\n\n\n\"There is also going to be people moving money from risky assets like the stock market, to safer assets like cash, gold and government bonds,\" he said.\n\n\n\nSource: SBS News\n\nHow does one market affect another?\n\nGlobal markets are interconnected, and as Yadav explained, Australia is not immune to the impact of foreign stock crashes.\n\n\n\n\n\n\"Anything that happens in the US market will definitely have an impact on the Australian dollar simply because the Australian dollar is one of the most traded currencies,\" he said.\n\n\n\n\n\nFluctuations in global markets drive the Aussie dollar up and down, which then affects price levels domestically.\n\n\n\nHow will the stock market fluctuations impact Australians?\n\nPeter Swan, a professor of finance from the University of New South Wales Business School, told SBS News the fluctuations would leave Australians poorer.\n\n\n\n\n\n\"The main investors who have lost wealth are the superannuation funds representing Australian retirees,\" he said.\n\n\n\n\n\n\"Since these subscriptions are compulsory, most Australians are now poorer.\"\n\n\n\nSource: SBS News While institutional stock traders are bearing the brunt, he noted that everyday investors are also feeling the pinch.\n\n\n\n\n\nHowever, those who sold shares in anticipation of a market crash are now in a better position.\n\n\n\nCould more tariffs make things worse?\n\nWhile it's hard to determine whether markets will continue to decline, the uncertainty surrounding potential tariff threats and subsequent trade wars is unlikely to help them recover.\n\n\n\n\n\nProfessor Robert Brooks from Monash University's Department of Econometrics and Business Statistics said: \"The more that we get tit for tax on retaliation to the Trump tariffs, the greater is the risk to global growth.\"\n\n\n\n\n\nHe told SBS News the uncertain economic policies, like threats of reciprocal tariffs or embargoes, could prompt countries and investors to avoid markets.\n\n\n\nWhen will the markets recover?\n\nFor markets to start to recover, there needs to be less risk, according to Brooks.\n\n\n\n\n\n\"What will help markets to recover is to get a greater level of certainty for investors,\" he said.\n\n\n\n\n\nHe said it's hard to determine when markets will recover, as some countries will try to negotiate trade deals with the US which could again destabilise markets.\n\n\n\n\n\n\"When it comes to global growth and trade, everyone's outlook has become more pessimistic.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/more-support-for-young-people-labor-promises-1-billion-for-mental-health/eouee98ht",
        "title": "'More support for young people': Labor promises $1 billion for mental health",
        "publish_date": "Mon, 7 Apr 2025 12:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "A re-elected Labor government would invest $1 billion into mental health services across Australia, in what the nation’s peak mental health body has labelled a \"landmark investment.\"\n\n\n\n\n\nThe commitment includes $225 million to deliver 21 new Medicare Mental Health Centres and upgrade 10 centres across the country, many of those in regional centres.\n\n\n\n\n\nThere would also be $200 million to expand Headspace services, $500 million for Youth Specialist Care Centres and $90 million to train 1,200 new mental health professionals.\n\n\n\nThe announcement forms a critical pillar in what Prime Minister Anthony Albanese describes as Labor’s plan to \"strengthen Medicare\", outspending the coalition on youth mental health, as the leaders prepare for their first election-campaign debate in Sydney on Tuesday night.\n\n\n\n\n\n\"I want everyone, and especially young people, to be able to access the mental health care they need,\" Albanese said.\n\n\n\n\n\n\"Whether you need short-term support or ongoing care, young or old, we will ensure that a free, mental health service backed by Medicare will be there for you and your family.\"\n\n\n\nCEO of Mental Health Australia Carolyn Nikoloski said the package \" will fundamentally increase access to free mental health support across the country\" while Headspace CEO Jason Trethowan said the commitments would \"provide support to more young people.\"\n\n\n\n\n\nNikoloski said \"It also responds to some of the real pressures the sector is facing, by growing the pipeline of the mental health workforce, so that we can better respond to the community’s mental health needs, both now and into the future.\"\n\n\n\n\n\n‘Labor has failed Australians’ on mental health\n\n\n\n\n\nOne of Opposition leader Peter Dutton’s first campaign commitments was $6.2 million to upgrade headspace Melton, in Melbourne’s western suburbs.\n\n\n\nREAD MORE Australian federal election 2025 explained: Everything you need to know\n\n\"It is only a Dutton Coalition Government who will address the youth mental health crisis,\" he said.\n\n\n\n\n\n\"Last year, a quarter of young Australians delayed or avoided seeking professional support for their mental health needs because they just could not afford it.\n\n\n\n\n\n\"Labor has failed Australians when it comes to mental health, but we are committed to turning that around.\"\n\n\n\n\n\nMental health was a key focus of Opposition leader’s Budget reply speech, where he pledged $400m for youth mental health services - and to expand the National Centre for Excellence in Youth Mental Health, which he established as health minister in 2014.\n\n\n\n\n\nDutton also pledged to permanently double Medicare-subsidised psychologist sessions from 10 to 20 per year, which Labor has not matched.\n\n\n\nREAD MORE The billion-dollar problem that neither Albanese nor Dutton wants to become a big issue\n\nHealth Minister Mark Butler said that would only \"repeat the mistakes of the past.\"\n\n\n\n\n\n\"You can’t double the number of sessions without doubling the number of psychologists, or you create a bottleneck that means tens of thousands of Australians get no help at all,\" he said.\n\n\n\n\n\nLabor has so far campaigned almost exclusively on health, claiming the Coalition would not honour its bipartisan commitment to invest $8.5bn into Medicare, something Dutton has labelled \"misinformation.\"\n\n\n\n\n\nThe Coalition has pledged to invest $9 billion into health, which includes its mental health policy.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/injured-hiker-reunited-with-rescuers-who-saved-his-life/5npo354w8",
        "title": "Injured hiker reunited with rescuers who saved his life",
        "publish_date": "Mon, 7 Apr 2025 08:43:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWhat was supposed to be a day hike in Victoria's Cathedral Range in late February almost took a fatal turn for Stoj Jovevski.\n\n\n\n\n\nHe says he was near the top of a 1,200 metre ridge with a group of friends when he slipped.\n\n\n\n\n\n\"I think there was a tricky section where it was narrow and the footing wasn't even. I went through that section maybe a little bit too quickly, lost balance and then fell over onto a ledge. I tried to grab onto something there was nothing to grab on, so I slid off that and free fell down another four or five metres.\"\n\n\n\n\n\nThe 43-year-old says he fractured his pelvis, wrist and vertebrae in the six metre fall.\n\n\n\n\n\n[\"I wasn't able to walk. I was in a lot of pain. Yeah, I couldn't even move my legs a few inches, it was incredibly painful.\"\n\n\n\n\n\nThe group made the call to triple zero and specialist teams arrived to try and get Mr Jovevski to safety.\n\n\n\n\n\nState Emergency Service volunteers and an Ambulance Victoria paramedic treated him on the scene.\n\n\n\n\n\nBut getting Mr Jovevski off the mountain on a day with temperatures over 35 degrees wasn't straightforward.\n\n\n\n\n\nA team of over 20 rescuers had to move him in three separate stages in an operation that took around six hours.\n\n\n\n\n\nSteve Ellis, the Leading Senior Constable of Victoria's Search and Rescue Squad says the rescue took a lot of effort and planning.\n\n\n\n\n\n[[\"We realised pretty quickly that we weren't going to be able to carry Stoj out given the terrain etcetera. So we formulated a plan and that plan involved setting up a roping system, which was a little bit technical given the terrain we working in. We were able to get Stoj into a stretcher, establish a rope system, haul him up to the top of the ridgeline where we were able to call in our air asset to then winch him out to safety and medical help.\"]]\n\n\n\n\n\nThe Point Cook man was flown to a Melbourne hospital, where he was treated for several weeks for serious back injuries.\n\n\n\n\n\nOn Monday, he reunited with the rescuers who saved his life.\n\n\n\n\n\nHe thanked the police and SES members with flowers.\n\n\n\n\n\n\"It's fantastic to be able to show a bit of gratitude and thankfulness for the amazing job that they've done. It was an incredibly tricky rescue, difficult location, very risky, took a number of hours in hot conditions. So it's fantastic to be able to say thank you face to face.\"\n\n\n\n\n\nMr Jovevski says his experience makes him feel fortunate to live in Australia.\n\n\n\n\n\n\"We must never forget the wonderful jobs that the police, the ambulance, the doctors, nurses, the S-E-S, the fire brigades, C-F-A -- all these services do for us. We're all incredibly lucky to be living in Australia to have these wonderful men and women and organisations that can help us out.\"\n\n\n\n\n\nMr Ellis says it was all part of the job.\n\n\n\n\n\n\"Being able to help someone in their time of need, that's why we do the job. I think it's the best part about it and to put those skills -- that we've worked pretty hard to get and maintain -- to put them to good use, it's quite satisfying.\"\n\n\n\n\n\nBec Maratos from the S-E-S also warns about the unpredictability and dangerous conditions in Victoria's Cathedral Range State Park and says not all walkers are as lucky as Mr Jovevski after his fall.\n\n\n\n\n\n\"Make sure you've got a jacket, a headtorch in case it's gonna get dark, make sure you prepare for any conditions. It was a really hot, blisteringly hot day. There's no shade up there when we were up there with Stoj and completing that rescue but as we were going back down in the dark there were thunderstorms rolling in. So you never know what weather conditions you might get. So, just being prepared and have more water than you think you might need.\"\n\n\n\n\n\nAfter several weeks in hospital, Mr Jovevski says he still has months of rehab ahead of him.\n\n\n\n\n\nHowever, he says the experience won't stop him from continuing to bushwalk in the future.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-on-the-money-where-to-next-after-one-of-the-worst-days-in-years/neozul5im",
        "title": "SBS On The Money: Where to next, after one of the worst days in years",
        "publish_date": "Mon, 7 Apr 2025 08:08:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/tim-tszyu-dominates-to-secure-convincing-win-against-joey-spencer/3lrpwm8mv",
        "title": "Tim Tszyu dominates to secure convincing win against Joey Spencer",
        "publish_date": "Mon, 7 Apr 2025 07:44:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/election-2025-dutton-wfh-backflip-the-talking-point-of-day-10/2p9vdeu49",
        "title": "Election 2025- Dutton WFH backflip the talking point of Day 10",
        "publish_date": "Mon, 7 Apr 2025 07:29:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"We're listening to what people have to say. We've made a mistake in relation to the policy. We apologise for that and we've dealt with it.\"\n\n\n\n\n\nThat's Opposition Leader Peter Dutton, speaking to Channel Nine, after abandoning the coalition's policy to force all public servants back into the office.\n\n\n\n\n\n\"Our intention always was to make sure where taxpayers are working hard and their money is being spent to pay wages that its being spent efficiently.\"\n\n\n\n\n\nThe coalition's changes to the public service were a centre piece of its election platform.... cutting 41,000 jobs, and ending work from home.\n\n\n\n\n\nThe initial plan was to force all public servants back into the office five days a week if it won the next election.\n\n\n\n\n\nBut over the weekend, Peter Dutton said he only meant workers in Canberra.\n\n\n\n\n\nAnd now, the whole policy has been abandoned - with no changes to be made to the current flexible working arrangements.\n\n\n\n\n\nMr Dutton says the whole issue has been blown out of proportion by the Labor Party.\n\n\n\n\n\n\"I've apologised for the decision that we took in relation to work from home. It only applied to Canberra. Labor's run this scare campaign and I think we bring an end to that today and we strongly support flexible workplace arrangements.\"\n\n\n\n\n\nPrime Minister Anthony Albanese taking advantage of the coalition's reversal of course.\n\n\n\n\n\nHe says the whole thing shows how out of touch Mr Dutton is with female voters in particular.\n\n\n\n\n\n\"Peter Dutton wants to undermine work rights, and in particular, doesn't understand modern families, doesn't understand the important role that women and men play in organising their families and organising appropriate work conditions wherever it is possible.\"\n\n\n\n\n\nMr Albanese says, although it was only a policy for the public sector, it could have had flow on effects for all workers.\n\n\n\n\n\n\"Go through Hansard and look for Liberal party IR spokespeople saying the reason why this shouldn't happen in the public sector is because it flows through to the private sector. That's what they say, that's their whole argument.\"\n\n\n\n\n\nInternal Liberal Party polling was showing the policy was deeply unpopular.\n\n\n\n\n\nAnd the latest Newspoll shows the Coalition behind Labor on two party preferred basis - 48 to 52.\n\n\n\n\n\nMr Dutton now looking to simply move on from the whole issue.\n\n\n\n\n\n\"The objective for us is to make sure that we can win the next election so that we can manage the economy well. That we can support families get through what's been a really difficult period.\"\n\n\n\n\n\nThe coalition has also changed its approach to cutting public sector jobs.\n\n\n\n\n\nIt still plans to reduce the Australian Public Service by 41,000 over five years, but has ruled out achieving it through forced redundancies, instead relying on a hiring freeze and natural attrition.\n\n\n\n\n\nPeter Dutton has previously said the public sector has grown exponentially under Labor, and cutting 41,000 jobs would reduce wasteful government spending.\n\n\n\n\n\nMelissa Donnelly from the Community and Public Sector Union says this approach has its problems.\n\n\n\n\n\n\"The policy to do this by natural attrition is a policy for chaotic cuts. It means that there'll be cuts right across the public sector when people leave the public sector not refilling those jobs. This is also a policy that's going to have a disproportionate impact on frontline services.\"\n\n\n\n\n\nShe says those public-facing agencies have a higher staff turnover.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-7-april-2025/pe8rifbod",
        "title": "Treasurer says markets banking on interest rate cut | Evening News Bulletin 7 April 2025",
        "publish_date": "Mon, 7 Apr 2025 06:14:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Treasurer flags significant interest rate cut for May\n\n\"Extraordinary\" revelations from parliamentary inquiry into fake terror plot\n\nFulham beats Liverpool in English Premier League\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nTreasurer Jim Chalmers says markets believe a substantial interest rate cut is likely to arrive in May, with another three cuts expected to come this year.\n\n\n\n\n\nLast week, the Reserve Bank of Australia held interest rates steady at 4.1 per cent after its first rate cut in nearly five years, in February.\n\n\n\n\n\nDr Chalmers says market sentiment predicts more significant relief for Australian mortgage-holders to come next month.\n\n\n\n\n\n\"Markets are now expecting about four interest rate cuts in Australia this calendar year. There's even a more-than-50-per-cent expectation in the markets that the next Reserve Bank interest rate cut in May might be as big as 50 basis points, so the Australian dollar is reflecting that. I don't predict or pre-empt those decisions, but the market is now expecting multiple interest rate cuts over the course of the year.\"\n\n\n\n\n\nThe Treasurer also says he has met with Reserve Bank governor, Michele Bullock, on how to respond to global trade tensions and believes Australia will not enter a recession.\n\n\n\n---\n\n\n\n\n\nOpposition leader Peter Dutton says stock market turmoil and the fall of the Australian dollar, should encourage voters to seek the Coalition's economic management.\n\n\n\n\n\nAlmost $100 billion had been wiped off the Australian share market as of lunch time in response to United States tariffs and fear of a global trade war.\n\n\n\n\n\nAfter falling as much as six per cent in the first hour of trading, the market's top share indexes recovered slightly more than two per cent by lunch time.\n\n\n\n\n\nThe Australian dollar fell below 60 US cents early but has recouped some losses to trade at 60.14 US cents, still down nearly six per cent since Thursday's tariff announcement.\n\n\n\n\n\nMr Dutton argues the Coalition are the only ones who can handle the global economic shocks to come.\n\n\n\n\n\n\"Now when you see the correction on the stock market today, when you see what's happening in the United States with the prospects of a recession or a global recession, you don't want a Labor-Greens government in charge of the economy when we need to meet the challenges that we'll face over the next couple of years. We need a strong Coalition government to get our country back on track, to manage the economy, to get the price of fuel down, to get the price of groceries down.\"\n\n\n\n---\n\n\n\n\n\nAn inquiry into a fake terrorist plot involving a caravan filled with explosives, has revealed a senior police officer signed a non-disclosure agreement and withheld information from his colleagues.\n\n\n\n\n\nThe inquiry is investigating when Premier Chris Minns and his cabinet learned the caravan found on the outskirts of Sydney was not related to a legitimate terrorist plot targeting Jewish Australians.\n\n\n\n\n\nPolice were first tipped off about the potential plot in January 19, with the Australian Federal Police suspecting a criminal link early in the investigation.\n\n\n\n\n\nHowever, New South Wales Police Deputy Commissioner David Hudson told Nationals MP Wes Fang, he and his officers were denied information related to these motivations for over a month.\n\n\n\n\n\n\"We were not told. We repeatedly asked what the motivation of the person providing that information was, however, their internal policies prevented them from doing that.\n\n\n\n\"So, you asked for more than a month and the AFP withheld the motivation for the informant providing that advice.\n\n\n\n\"The senior investigating officer from NSW was informed at some stage. However, he was forced to sign a non-disclosure agreement.\n\n\n\n\"That's extraordinary Deputy Commissioner Hudson.\"\n\n\n\n---\n\n\n\n\n\nIsraeli strikes across the Gaza Strip have killed more than 50 Palestinians in just one day according to local medics, including more than a dozen women and children.\n\n\n\n\n\nWith no end to the bombardment in sight, Israeli Prime Minister Benjamin Netanyahu is heading to the United States, seeking more support from President Donald Trump.\n\n\n\n\n\nMohamed Abdel Hady, whose relatives were killed without warning as they slept, believes Mr Netanyahu will get permission from President Trump to continue the violence.\n\n\n\n\n\n\"I expect more massacres and more killing, as long as Arabs and Muslims are asleep. We will continue to see more massacres and killing. There’s no hope in them, no hope they will lift a hand to help this oppressed people. It’s clear, Netanyahu will further get a green light to finish Gaza, just like before, to wipe out what remains in Gaza.\"\n\n\n\n\n\nMeanwhile, a tent filled with journalists in Gaza's Khan Younis region has also been bombed by Israel, killing at least two people, and wounding seven others.\n\n\n\n\n\nThe Palestinian Journalist Syndicate say more than 200 journalists have been killed by Israeli fire in Gaza since early October 2023.\n\n\n\n-—\n\n\n\n\n\nThe rainbow lorikeet has been unveiled as the nation's most spotted bird after a count involving nearly 60,000 Australians.\n\n\n\n\n\nThe noisy miner bird flew into second place and the infamous Australian magpie swooped into third.\n\n\n\n\n\nParticipants in BirdLife Australia's eleventh annual national bird count, released today, tallied up 4.1 million birds during the week-long community event.\n\n\n\n\n\nNo two states or territories shared the same top three most sighted birds, which the not for profit says is a reminder of how birds are integral to the unique character and identity of each place.\n\n\n\n---\n\n\n\n\n\nTo sport and in football, Liverpool's 26-match unbeaten streak in the English Premier League has come to an end at the hands of Fulham.\n\n\n\n\n\nDespite the 3-2 defeat, the Reds maintain an 11-point lead on top of the table.\n\n\n\n\n\nManager Arne Slot concedes that it was an unusually poor performance from his team.\n\n\n\n\n\n\"The errors we made is something we're not used to. Not only me, the players, the teammates, the fans: it disappoints us all. But one of the reasons that we're in the position we're in as that we don't make a lot of mistakes and if we do, players try to make up for them.\"\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/torpedo-bats-craze-sweeps-major-league-baseball/sxo6xxk3w",
        "title": "Torpedo bats craze sweeps Major League Baseball",
        "publish_date": "Mon, 7 Apr 2025 05:18:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "Torpedo bats craze sweeps Major League Baseball\n\nPublished 7 April 2025, 4:57 am\n\nAmerican sport is buzzing over a new style of bat being used in Major League Baseball. Pitchers throwing sliders and sinkers usually heap pressure on the batters. But now, the new Torpedo bat is helping the sluggers sink the pitchers.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/liberal-candidate-admits-shes-a-landlord-as-rival-accuses-her-of-acting-as-millennial-renter/lga75vprd",
        "title": "Liberal candidate admits she's a landlord as rival accuses her of acting as 'millennial renter'",
        "publish_date": "Mon, 7 Apr 2025 04:47:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "A high-profile Liberal candidate running to reclaim a former blue-ribbon seat has been accused of keeping voters in the dark about her property interests.\n\n\n\n\n\nAmelia Hamer, the grand-niece of former Victorian premier Rupert Hamer, has repeatedly pitched herself as a renter to appeal to frustrated young voters in the seat of Kooyong in Melbourne's inner-east.\n\n\n\n\n\nBut the 31-year-old has been forced to come clean ahead of the 3 May federal election, admitting she also owns two properties outside of Melbourne.\n\n\n\n\n\n\"While working in London and Canberra, I took out mortgages to buy the apartments that I lived in,\" Hamer said in a statement.\n\n\n\n\n\n\"Now that I'm back living in Melbourne, I am renting in Hawthorn.\"\n\n\n\nREAD MORE What if no one wins? What to know about minority government\n\nHamer studied at Oxford University before working in banking, venture capital and technology.\n\n\n\n\n\nHer profile on the Liberal Party's website says she wants to \"help more locals achieve the dream of home ownership\" and will \"fight for policies to make home ownership more achievable for young Australians\".\n\n\n\n\n\nIn the lead up to the poll, Hamer told media outlets she was renting a one-bedroom apartment but did not disclose she was a landlord.\n\n\n\n\n\n\"I know my rent's gone up significantly, I'm a renter,\" she said on Nine's Today Show.\n\n\n\nREAD MORE Australian federal election 2025 explained: Everything you need to know\n\nIt's the first major misstep of her push to win back Kooyong after teal independent Monique Ryan unseated former Liberal deputy leader and treasurer Josh Frydenberg in 2022.\n\n\n\n\n\nRyan accused her political rival of trying to deceive the people of Kooyong.\n\n\n\n\n\n\"The issue here isn't that she owns two properties,\" she told AAP in a statement.\n\n\n\n\n\n\"It's that by painting herself as a millennial renter she misled people by not disclosing she was also a property owner and landlord.\"\n\n\n\n\n\nCity of Boroondara councillor Rob Baillieu, who volunteered on Ryan's 2022 campaign, went further by claiming Hamer had lied about being a \"struggling renter\" while owning millions of dollars worth of property.\n\n\n\n\n\n\"She's been a politician for five minutes and has already lied to you,\" he wrote in a post on X.\n\n\n\n\n\n\"Why would you vote for her.\"\n\n\n\nRyan, a former paediatric neurologist and medical researcher, was among a raft of community independents to oust sitting Liberal MPs from former heartland seats in 2022.\n\n\n\n\n\nShe won Kooyong by 2.9 per cent but a redistribution has notionally whittled the margin down to 2.2 per cent, although demographics are skewing younger as more millennials and members of Ggen Z move to the area.\n\n\n\n\n\nThe head-to-head battle between Ryan and Hamer has heated up on the ground since the election was called.\n\n\n\n\n\nRyan's spouse Peter Jordan apologised after video footage emerged of him removing a sign promoting her main political rival.\n\n\n\n\n\nHamer also came under scrutiny for pulling out of a candidates' forum at short notice to participate in a mass phone call to residents with Opposition treasury spokesperson Angus Taylor.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/trump-stands-firm-on-tariffs-as-markets-crash/5yc3j4nr9",
        "title": "Trump stands firm on tariffs, as markets crash",
        "publish_date": "Mon, 7 Apr 2025 04:10:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n[ANTHONY ALBANESE: \"The administration's tariffs have no basis in logic, and they go against the basis of our two nations partnership.\"\n\n\n\n\n\nMARK CARNEY: \"We will fight the US tariffs, with retaliatory trade actions of our own, that will have maximum impact in the United States. \"\n\n\n\n\n\nURSULA VON DER LEYEN: \"If you take on one of us, you take on all of us. So, we will stand together and stand up for each other. Our unity is our strength.\"\n\n\n\n\n\nLast week, U-S President Donald Trump jolted the world by announcing a slate of new tariffs, and disrupting a decades old global trade order.\n\n\n\n\n\nWith some tariffs already in place and others set to come into effect later this week, U-S officials say more than 50 nations have already reached out to begin negotiations.\n\n\n\n\n\nBoarding Air Force One, Mr Trump described his tariffs as a type of medicine, and says foreign governments will have to pay a lot of money to lift them.\n\n\n\n\n\nSpeaking to A-B-C America, U-S Treasury Secretary Scott Bessent says decisions on potential concessions are up to the president.\n\n\n\n\n\n“But I can tell you that, as only he can do at this moment, he's created maximum leverage for himself. And more than 50 countries have approached the administration about lowering their non-tariff trade barriers, lowering their tariffs, and stopping currency manipulation. And they've been bad actors for a long time, and it's not the kind of thing you can negotiate away in days or weeks.”\n\n\n\n\n\nLast week's tariff announcement fulfilled a key campaign promise from Donald Trump, who has long denounced foreign trade deals as unfair to the United States.\n\n\n\n\n\nThe announcement, his most expansive on tariffs yet, will see a baseline tariff of 10 per cent on all foreign goods imported into the United States.\n\n\n\n\n\nThat baseline 10 per cent will be supplemented in certain cases by additional reciprocal tariffs that vary by nation.\n\n\n\n\n\nJoseph Williams is a former senior editor of U-S News and World Report.\n\n\n\n\n\nHe says the measures raise the risk of a recession.\n\n\n\n\n\n\"I certainly think prices are going to increase in the United States. There's going to be rising voter anger -- probably a recession could be triggered -- that will ripple around the world, because production around the world will decrease as American consumption decreases. So I think it's going to drive everybody into a race towards the bottom. We will be looking at five percent or more unemployment in the United States. We'll be looking at, probably, a mild recession heading into a deeper recession, if one has not already occurred.\"\n\n\n\n\n\nAlready announcing retaliatory measures, China says it will be imposing 34 per cent tariffs on all U-S imports.\n\n\n\n\n\nThe Chinese market was singled out by the trade policy, with Mr Trump imposing an additional 34 per cent tariff for China, on top of the previously announced 20 per cent.\n\n\n\n\n\nEven Japan, a key ally of the U-S in Asia, was hit with a 24 per cent tariff and dubbed by Mr Trump as one of the worst offenders for unfair trade practices.\n\n\n\n\n\nTakuji Okubo is the managing director and chief economist at Japan Macro Advisors.\n\n\n\n\n\nHe says while there will be obvious negative impacts on the economy, this may lead to stronger regional co-operation in Asia.\n\n\n\n\n\n\"Economically, obviously it's bad. But I think this is one challenge. This challenge against Trump's tariff policy is, I think this actually provides a common ground between Japan, China, South Korea and of course the EU. So this is a common challenge for all these countries where we can have some uniting ground. I think I'm actually jumping ahead to the next topic, from a geopolitical point of view, this could actually help ease the tension in Asia.\"\n\n\n\n\n\nAlready, Chinese state media has signalled that China, Japan, and South Korea they may work together to try and counter the tariffs- no small move, considering they are all major export economies who do a lot of trade with the U-S, and the historic enmity between these three nations.\n\n\n\n\n\nEuropean governments are also reeling from the announcement.\n\n\n\n\n\nThe 27-nation European Union bloc is facing a 25 per cent tariff on steel and aluminium as well as cars, and will also be hit with a 20 per cent tariff on almost all other goods from Wednesday [[9 apr]].\n\n\n\n\n\nThe tariffs cover around 70 per cent of the E-U's exports to the U-S.\n\n\n\n\n\nE-U members are expected to present a united front in the coming days, with reports that approval is likely for countermeasures on around $45 b illion [[USD$28B]] worth of U-S imports.\n\n\n\n\n\nItalian Prime Minister Giorgia Meloni says her government is ready to support those impacted.\n\n\n\n\n\nITALIAN THEN ENGLISH VO: \"We are governing at probably the most difficult time since the post-war period. A little bit of everything has happened and is happening. We will also address the issue of tariffs, with determination and pragmatism, without alarmism. Of course, we did not agree with the choice of the United States, but we are ready to deploy all the instruments - negotiations and economic - needed to support our businesses and the sectors that will be penalised.\"\n\n\n\n\n\nGlobal stock markets were hit hard by the announcement, with $5 trillion U-S dollars wiped from the stock market value for S&P 500 companies by last week's close.\n\n\n\n\n\nSince China announced countermeasures, the U-S stock market has slipped into its worst crisis since March 2020, which was the start of the COVID-19 pandemic.\n\n\n\n\n\nThe Australian share market has taken its biggest hit in over a year, with the top 200 companies opening more than six per cent lower in the first few minutes of trade.\n\n\n\n\n\nThe Australian dollar has also dropped below 60 US cents for the first time since COVID, while also experiencing the biggest daily fall in 17 years.\n\n\n\n\n\nPrime Minister Anthony Albanese says the government is continuing to engage diplomatically with the U-S, while also considering other options.\n\n\n\n\n\n\"Well, what we're doing is preparing for further uncertain times. We do live in uncertain times. And part of that is the impact of global changes, including the tariffs decision that was made by the US administration last week. You can't change global events, what you can do is prepare for them.\"\n\n\n\n\n\nAs fears of a global recession mount, U-S Treasury Secretary Scott Bessent says it doesn't have to end that way.\n\n\n\n\n\n\"I reject that assumption. There doesn't have to be a recession. Who knows how the market is going to react in a day, in a week. What we are looking at is building the long-term economic fundamentals for prosperity that I think the previous administration had put us on the course toward financial calamity.”\n\n\n\n\n\n\n\nIn the U-S Congress, where the Republican Party has long championed free trade, the tariff regiment has been met with both applause and unease.\n\n\n\n\n\nSeveral Republican senators have already signed onto a new bipartisan bill that would require presidents to justify new tariffs to Congress.\n\n\n\n\n\nCongress would then have to approve the tariffs within 60 days, or they would expire.\n\n\n\n\n\nDirector of the National Economic Council of the United States, Kevin Hassett, says media outlets are exaggerating the impacts.\n\n\n\n\n\n\"There is kind of like a logical disconnect between the stories, the competing stories that your team is using to attack President Trump, on the one hand, you are saying the countries are really angry, and they are going to have to retaliate on the other hand you are saying that consumers are going to have to bear the cost and it is going to drive inflation up. If US consumers are going to bear the cost there is no reason for the countries to be angry.\"\n\n\n\n\n\nRadhika Desai is the director of the Geopolitical Economy Research Group.\n\n\n\n\n\nShe says that, in the long term, more and more countries are going to shift away from trade with the U-S.\n\n\n\n\n\n\"The one thing we can be sure of is that these tariffs and the revenue they will allegedly bring to the US government will be used as a justification to give huge tax cuts to the rich in the United States. And I think this is going to be the first most important consequence and the most certain consequence of this, that is, ordinary Americans, working Americans will pay for a tax cut that will be enjoyed by a small number. But I would say that the long run effect of this is bound to be that more and more countries will shift their trade away from the United States.\"\n\n\n\n\n\n\n\n\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/multiple-interest-rate-cuts-expected-this-year-treasurer-jim-chalmers-says/fjf0x9gwi",
        "title": "The Australians 'worst off' after US tariffs — despite multiple interest rate cuts being flagged",
        "publish_date": "Mon, 7 Apr 2025 03:36:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Donald Trump's tariffs could impact Australians of various age groups differently — as Treasurer Jim Chalmers flags multiple interest rates are likely.\n\n\n\n\n\nDuring a press conference on Monday, Chalmers said escalating trade tensions had cast a dark shadow over the global economy.\n\n\n\n\n\nFollowing the United States president's tariff announcement last week on trade partners , including Australia, there has been a \"bloodbath\" on global markets .\n\n\n\n\n\nThe Australian share market took its biggest hit in over a year, with the top 200 companies opening more than 6 per cent lower in the first few minutes of trade today.\n\n\n\n\n\nChalmers noted the volatility and said the value of the Australian dollar had been bouncing around.\n\n\n\nREAD MORE What the latest inflation data could mean for your interest rate\n\nBut Chalmers said this reflected the market expectation that the next Reserve Bank (RBA) interest rate cut in May might be as big as 0.5 per cent.\n\n\n\n\n\n\"We are seeing very substantial volatility now in global stock markets and in our own markets as well,\" he said.\n\n\n\n\n\n\"That's largely a reflection of people's concerns about the Chinese economy, but it also reflects the fact that markets are now expecting around four interest rate cuts in Australia this calendar year.\n\n\n\n\n\n\"The market is expecting multiple interest rates cuts over the course of the year beginning in May.\"\n\n\n\nRBA governor Michele Bullock is expected to deliver additional interest rate cuts in 2025 after holding the cash rate in April. Source: AAP / Lukas Coch The US tariffs have raised fears of a recession, and it's expected the RBA will cut rates to stimulate growth while juggling its mandate to keep inflation under control.\n\n\n\nWhy would the RBA cut interest rates?\n\nDr Zac Gross, a senior lecturer in economics at Monash University, said the RBA will be looking to combat the flow-on effect of Trump's tariffs in Australia, which are expected to lower inflation and lead to rising unemployment.\n\n\n\n\n\n\"Lower inflation [and] higher unemployment [are] a textbook case for cutting interest rates,\" he told SBS News.\n\n\n\n\n\nWhile the tariffs will drive up inflation in the US because of the extra tax on goods entering the country, he explains the impact for Australia may be deflationary.\n\n\n\nREAD MORE Meet the Australian farmers Donald Trump has a beef with\n\nHigh tariffs on countries like China and Vietnam will lock them out of the US market and force them to reorient their cheap goods to places like Australia.\n\n\n\n\n\nMeanwhile, direct impacts on industries such as Australia's beef sector, which will be subject to the 10 per cent tariff, could push up unemployment.\n\n\n\n\n\n\"So to the extent that we see higher unemployment in companies and towns that focus on the beef market, that's going to be another reason why the RBA is going to be more likely to cut interest rates,\" Gross said.\n\n\n\n\n\nOverall, he said, \"the bad will outweigh the good\" for Australians.\n\n\n\nWhich Australians will be hit 'fairly hard'?\n\nGross said anyone with \"light exposure to the share market is going to be disproportionately affected\".\n\n\n\n\n\nHe explains young investors are more likely to invest in stocks, while older Australians usually shift their exposure to safer assets like government bonds or cash.\n\n\n\n\"Those in their 50s and 60s, they're probably the worst off because they've probably got a high exposure to shares, given they're not in their 80s or 90s,\" Gross said.\n\n\n\n\n\n\"But they don't have that much time left in the labour force and so having a 10 per cent fall in value of their shares is probably going to hit them fairly hard.\"\n\n\n\n\n\nHe said the impacts to the superannuation sector should be \"fairly limited\".\n\n\n\n\n\n\"Young people who are the most exposed should have plenty of time to make up the losses,\" he said.\n\n\n\n\n\nLast week, RBA governor Michelle Bullock announced interest rates would remain on hold. Its next decision is expected on 20 May.\n\n\n\n\n\nIn February, the RBA cut rates for the first time since 2020, reducing the rate from 4.35 per cent to 4.1 per cent.\n\n\n\n\n\nThe reprieve followed 13 consecutive hikes since May 2022.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/business/markets/us-stock-market-undergoes-wild-swings-after-false-rumour-on-trump-tariffs-20250408-p5lpxv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX rebounds after Wall Street rollercoaster; Tech, consumer stocks rise",
        "publish_date": "Tue, 08 Apr 2025 11:55:23 +1000",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket opened higher after its bloodbath on Monday, following a manic session on Wall Street overnight where US stocks careened as President Donald Trump threatened to crank his tariffs even higher, despite global markets’ stunning losses since “Liberation Day”.\n\nThe S&P/ASX 200 rose 97.50 points, or 1.3 per cent, to 7440.80 as of 11.38am AEST, with all 11 industry sectors advancing, led by consumer discretionary, energy and tech stocks. The rebound comes after the index tumbled by 4.2 per cent on Monday, its biggest fall since the COVID-19 pandemic of 2020 as a panicked sell-down wiped almost $100 billion from the local market.\n\nThe Australian dollar plunged to five-year lows of less than US60¢ on Monday and was trading at US60.14¢ as of 11.37am.\n\nUS President Donald Trump has doubled down on his stiff tariffs, despite seeing how much Wall Street wants him to do the opposite. Credit: AP\n\nTech stocks led the morning’s rebound, which saw some of the market’s hardest-hit sectors in the sell-down pare back some of their losses. The nation’s biggest IT stock, WiseTech, rose 2 per cent, while software companies Xero and Technology One gained 2.6 per cent and 3.7 per cent, respectively, and family member tracking app Life360 rallying 7.2 per cent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/community-in-shock-after-mans-body-found-in-home-on-phillip-island-20250408-p5lq3e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Community in shock after man's body found in home on Phillip Island",
        "publish_date": "Tue, 08 Apr 2025 11:54:31 +1000",
        "category": "finance",
        "authors": [],
        "text": "Community in shock after man's body found in home on Phillip Island\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/trump-surfs-high-on-a-wave-of-tariff-unease-just-the-way-he-likes-it-20250408-p5lpz5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Trump surfs high on a wave of tariff unease, just the way he likes it",
        "publish_date": "Tue, 08 Apr 2025 11:53:39 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "Washington: Donald Trump spent the weekend playing golf in Florida. He wore a MAGA cap and even posted clips on social media. Far from hiding from the tariff-prompted market crash, he was projecting nonchalance.\n\nMeeting with Israeli Prime Minister Benjamin Netanyahu on Monday (Tuesday AEDT), he was equally sanguine. If he was at all worried by the massive stock sell-off and growing drumbeat of opposition on Wall Street, he didn’t let on.\n\nIsraeli Prime Minister Benjamin Netanyahu with Donald Trump in the Oval Office. Credit: Getty Images\n\nAnd that’s probably because in many respects, Trump has everyone right where he wants them. He says he has world leaders on the phone “dying to make a deal”, and offering to remove long-standing trade barriers, just as he demanded and predicted.\n\nThe EU says it has made an offer to cut tariffs on certain goods. Japan and the US are commencing talks. And in the Oval Office, Netanyahu provided a shining example for Trump to show the rest of the world. The Israeli leader pledged to cut down Israel’s trade surplus with the US to zero and eliminate tariffs, in what looked like a highly orchestrated but nonetheless valuable demonstration of Trumpian dealmaking.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/why-locals-are-fighting-to-keep-the-potholes-on-this-dilapidated-road-20250407-p5lpq7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why locals are fighting to keep the potholes on this dilapidated road",
        "publish_date": "Tue, 08 Apr 2025 11:37:00 +1000",
        "category": "finance",
        "authors": [
            "Adam Carey"
        ],
        "text": "The Boulevard in Ivanhoe East might be Melbourne’s most dilapidated road, but the locals love it that way – and will fight anyone who dares try to fix it.\n\nAlong most of its 2.8-kilometre length between Banksia Street and Burke Road, The Boulevard is badly cracked and potholed. Loose chunks of bitumen, some the size of cricket balls, litter the crumbling roadside.\n\nThe Boulevard in Ivanhoe East has not been resurfaced for decades, and is more frequently used by pedestrians than motorists. Credit: Justin McManus\n\nDriving its length is a bone-rattling experience, best done at speeds of 30 km/h or less.\n\nThe advisory speed limit, set due to the road’s degraded condition, also affords motorists time to soak up bucolic views of the Yarra Flats parkland to the east and a row of palatial, multimillion-dollar houses to the west.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/workplace/benefits-of-wfh-now-too-big-to-ignore-20250408-p5lpyu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Benefits of WFH now too big to ignore",
        "publish_date": "Tue, 08 Apr 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Cassandra Winzar"
        ],
        "text": "The Coalition’s decision to change its policy on working from home (WFH) for public servants shows the benefits of this kind of workplace flexibility are now too big to ignore.\n\nThirty-six per cent of Australians worked from home on a regular basis in 2024, ABS figures show. That’s almost the same as the 37 per cent who did so in 2023. But it’s a dramatic rise from the five per cent rate before COVID seen in the 2016 Census.\n\nA larger proportion of the population has benefited from this shift to WFH. Credit: iStock\n\nWhile that means the majority of Australians don’t WFH regularly, the benefits experienced by the one-third of Australians who WFH are enjoyed more broadly.\n\nIn households where one person works from home and another goes to the office, the whole household benefits from the time and money saved on commuting and buying lunch, as well as other less quantifiable benefits such as the flexibility to do chores at home.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/how-an-arsenal-champions-league-loss-could-benefit-the-matildas-20250408-p5lpyz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "How an Arsenal Champions League loss could benefit the Matildas",
        "publish_date": "Tue, 08 Apr 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "It might be broken-record territory, but there really is no getting over the impact of the coaching situation. It has been most irregular to see a nation as prominent as Australia go so long without any sort of on-field direction, and especially with an Asian Cup just around the corner. So kudos to Sermanni, who in difficult circumstances has ensured that the Matildas have taken as much as they could from these two games against South Korea. Standing still in women’s football these days is going backwards; at least in this window, they’ve taken a tiny step forward. Matildas interim head coach Tom Sermanni. Credit: Getty Images Though their cohesion in the final third and retention of possession could have been better, it’s hard to sneeze at two confidence-boosting wins and two clean sheets against the team that knocked them out of the last Asian Cup in heartbreaking fashion. In Newcastle, Sermanni may have found the answer to the seemingly eternal question of how Australia can get the best out of Mary Fowler and her majestic talents.\n\nIt was pretty obvious, though: play her in the same position and role as Manchester City, out on the left wing, enabling her to cut inside and use her vision and technique to set up goals or score them herself, as she did on Monday night. “At club land, I play on the wing quite often, and I really like playing there,” Fowler said. Mary Fowler. Credit: Getty Images “I see a lot of the field from there and just a lot of different angles, so I enjoyed being there ... on a personal level, I want to try to be a bit more consistent with my performance as a national team. I think being out in that position made it a bit easier for me to be in a role that I’ve played quite a bit this season.” Playing Fowler on the left means Foord will have to play elsewhere. The good news is she can play just about anywhere. Foord came on at half-time for Holly McNamara, who has recovered from her third ACL injury to prove she has a role to play for the Matildas, and was deployed as a central striker. She can also play on the right, as she has occasionally with Arsenal, and to best accommodate Foord and Sam Kerr, that might be her best position moving forward.\n\nThrow in the likes of Sharn Freier, Hayley Raso, Michelle Heyman, Kaitlyn Torpey and, at some point, Cortnee Vine, and there are a bunch of puzzle pieces waiting to be put together. Speaking of Kerr, there’s another tick for this window: Kerr has been successfully re-integrated into the Matildas set-up and the circus surrounding her behaviour and captaincy has now passed. The rousing reception shown by crowds in Sydney and Newcastle each time the 31-year-old was shown on the big screen was evidence of what Sermanni said last week: most Matildas fans still adore her. Loading “Even playing, when she comes on the big screen, the cheer ... it’s a bit of a shock because you’re like, ‘Have I missed something? What’s going on’?” Catley said. “It just shows how much the country loves her and so many people support her. We support her ... she’s been through a really tough time the last year or so, and the main thing for us is just making sure that she was OK as a person and having her in camp and her leadership and just having her around is always amazing for us. It’s nice to have her back.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/cctv-footage-shows-tornado-hitting-new-zealand-town-20250408-p5lq2z.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CCTV footage shows tornado hitting New Zealand town",
        "publish_date": "Tue, 08 Apr 2025 11:24:46 +1000",
        "category": "finance",
        "authors": [],
        "text": "CCTV footage shows tornado hitting New Zealand town\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/infinite-green-energy-collapses-into-administration-20250331-p5lnyz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hydrogen hopeful Infinite Green Energy collapses into administration",
        "publish_date": "Tue, 08 Apr 2025 11:22:32 +1000",
        "category": "finance",
        "authors": [
            "Jesinta Burton"
        ],
        "text": "Perth-based hydrogen player Infinite Green Energy has brought in administrators less than 24 hours before a Supreme Court hearing in a multimillion-dollar debt dispute its chief executive claimed the WA Premier could help resolve.\n\nKordaMentha’s Richard Tucker and Jared Palandri were handed the reins to the company and nine of its associated entities on Monday, according to documents filed with the corporate regulator.\n\nInfinite Green Energy CEO Stephen Gauld. Credit: Kate Ferguson\n\nThe appointment came just hours before IGE had been due to front court in an investor row it had successfully kept under wraps until it was revealed by WAtoday — which is understood to have sparked concern among other stakeholders who have since been scrambling to safeguard their investment.\n\nFor the past six weeks, IGE has been fending off a bid by Queensland-based investor DD Investment to have liquidators appointed over its failure to repay a $3.85 million debt.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/holiday-from-hell-or-killer-season-the-cases-for-and-against-the-white-lotus-20250408-p5lq03.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Holiday from hell or killer season? The cases for and against The White Lotus",
        "publish_date": "Tue, 08 Apr 2025 11:05:53 +1000",
        "category": "finance",
        "authors": [
            "Thomas Mitchell"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size For eight episodes, The White Lotus’ writer and director Mike White kept viewers guessing as to who the body in the water would be (turns out there was more than one). But was it a satisfying conclusion to another standout season, or was White just repeating himself, retreading the themes from seasons one and two? Writers Thomas Mitchell and Cameron Bayley take up the case for and against season three of The White Lotus. The case for season three ... It’s always a worry when you begin to sound like your parents, but after hearing endless criticism of The White Lotus’ third season – “Too slow! Nothing happens! Where’s Jennifer Coolidge?” – I suspect their fears about social media ruining our brains might be on the money. In this brave new world of TikTok attention spans, we’ve lost the ability to appreciate anything that doesn’t trigger our dopamine receptors in 15 seconds or less. Timothy (Jason Isaacs) and Victoria Ratliff (Parker Posey) are not relaxed at The White Lotus. Has it been a slow burn? Sure. Is there anything wrong with that? Absolutely not. Successfully pulling off a third instalment was destined to be a gargantuan effort for Mike White. Partly because the first two seasons were so well received and partly because the formulaic nature of the show (rich people, fancy resort, mysterious death) means audiences are conditioned to White’s particular brand of craziness. All of which makes the achievements of season three more impressive.\n\nAdvertisement\n\nRather than overstaying its welcome, The White Lotus has found itself at home on holiday, White no longer wedded to a single theme but free to turn his discerning eye where he sees fit. Where seasons one and two explored class dynamics and sexual politics, season three expanded its horizons: the complexity of midlife friendships, toxic masculinity, capitalism as a force of all-consuming corruption, the fine line between hedonism and spirituality, and, yes, brotherly incest. Saxon (Patrick Schwarzenegger) after his night that he could barely remember. On that note, The White Lotus is the standard-bearer for water cooler TV, and even by that metric, this season didn’t disappoint. Few people will forget where they were when they first watched Sam Rockwell’s monologue about wanting to be an Asian girl in lingerie; Walton Goggins’ facial reactions captured what everyone at home was feeling. An instant entrant into The White Lotus Hall of Fame, that scene was all anyone could talk about until that other scene. I’d hate to see the official Google search results for “Saxon and Lochlan incest”, but I suspect they’d be worryingly high. Frank (Sam Rockwell) and Rick’s (Walton Goggins) Bangkok side-quest was a season three highlight. Delivering shocking “moments” has become White’s calling card, so too serving up endlessly quotable dialogue that can be repurposed as memes to live forever on the internet. Naysayers were already fretting about the Coolidge-sized hole in season three. Who would provide the comic relief? Could anyone deliver a line such as, “These gays, they’re trying to murder me,” with that kind of timing? Enter Parker Posey. As the pill-popping Victoria Ratliff, Posey was a revelation. Her overly affected North Carolina accent single-handedly changed how everyone says “tsunami” or “Buddhism.”\n\nAdvertisement\n\nWhile it is easy to list the quantifiable ways in which The White Lotus is great TV – inspired casting, gripping cinematography, unrivalled art direction – this series has always been one that lives and dies on the strength of its finale. Belinda (Natasha Rothwell) got more than she bargained for in season three. In season three, White was able to gather his loose ends and blend them (just like a poison smoothie) in a deeply satisfying yet cynical ending. Loading Of course, Rick’s quest for revenge descended into a Greek tragedy, ending with not only his death but the death of Chelsea (Aimee Lou Wood), the only person who ever really loved him. Of course, Tim Ratliff (Jason Isaacs) learnt there are more important things in life than federal prison and being rich (and all it took was nearly killing his youngest son). And, of course, Belinda (Natasha Rothwell) and Gaitok (Tayme Thapthimthong), the two characters we were supposed to sympathise with, end up turning into the worst versions of themselves. Gaitok betraying his Buddhist beliefs to take a life and the newly minted Belinda channelling her inner Tanya, abandoning her promise to Pornchai (Dom Hetrakul), and sailing off into the sunset. A masterful way to check out of The White Lotus. Now pass me the Lorazepam. Thomas Mitchell\n\nAdvertisement\n\nThe case against season three ... “Nooo! Mike White, nooooo!” The latest season of The White Lotus may have gone out with a bang (in fact, several), but it took seven weeks of whimpers to get there. Chelsea (Aimee Lou Wood) and Saxon (Patrick Schwarzenegger) in the final episode of The White Lotus. Having dutifully checked in to this Thailand outing, I was excited for another twisted tale of the super-rich in all sorts of physical and psychological peril. Loading However, it didn’t take long before I started to feel something was amiss – not unlike Jaclyn (Michelle Monaghan), Laurie (Carrie Coon) and Kate (Leslie Bibb) at the senior citizen’s resort (one of many unexplained plot strands). Mirroring Jason Isaacs’ Lorazepam-induced Timothy Ratliff, this season soon became the epitome of a fugue state.\n\nAdvertisement\n\nMike White, sticking to the same roll-call of characters (Screwed up family? Check. Ditsy doyenne? Check. Douche bro? Check. Criminal undercurrent? Check), trod water, with set-ups, characters and storylines going nowhere fast. Take Isaacs’ troubled mogul who, after discovering he was about to go down for some seriously bad financial shenanigans, turned to his wife’s mind-numbing anxiety meds and henceforth wandered around in what could be an audition for The Walking Dead right up until the last few moments of the season. Even a subplot involving a stolen gun and some cocktail-induced familicide barely seemed to register with him. Gary/Greg (Jon Gries) had little comeuppance in the final episode. Who wasn’t on tenterhooks waiting to hear what Parker Posey’s Victoria (“I just don’t think at this age I’m meant to live an uncomfortable life”) would make of the news her life was about to become Gucci-free? It’s a crime we were denied this. Joining Isaacs in true zombie form was the excellent Walton Goggins, whose Rick arrived rebuffing any attempt at engaging with anyone, including his girlfriend Chelsea (who had to constantly proclaim their soulmate connection as we never saw a skerrick of this otherwise). He remained infuriatingly somnambulistic until the show’s final few scenes. K-pop star Lisa Manobal was inspired casting as Mook. To his credit, White casts his shows impeccably, and bringing in K-pop superstar Lalisa Manobal was an inspired choice. But her character, Mook, was only there to smile at Gaitok, the world’s most inept security dude. We had to watch Gaitok look merely perturbed for an entire seven episodes (losing a gun barely causing a ripple) until those last few moments.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/job-swap-marsh-quits-aflpa-for-second-stint-as-cricket-union-boss-20250408-p5lq1v.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Job swap: Marsh quits AFLPA for second stint as cricket union boss",
        "publish_date": "Tue, 08 Apr 2025 10:45:03 +1000",
        "category": "sports",
        "authors": [
            "Andrew Wu"
        ],
        "text": "AFL Players Association chief Paul Marsh has resigned to return to his old job in cricket as the boss of Australian cricket’s players union.\n\nThe respective organisations made the announcement on Tuesday morning that Marsh would leave the AFLPA at the end of May, ending his 11 years at the helm.\n\nPaul Marsh (left) has resigned from the AFL Players Association to return to cricket. Credit: Getty Images\n\nMarsh, who entered football as an outsider having been well established in cricket circles, was a key player in multiple collective bargaining agreement negotiations.\n\nHis legacies include the joint CBA in 2023 which delivered male and female footballers a 37.1 per cent share of industry revenue, and the deal struck in 2017 which saw the introduction of a percentage share of industry revenue.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/heartbreaking-scene-spotted-by-passing-driver-highlights-worsening-aussie-crisis-080407510.html",
        "title": "Heartbreaking scene spotted by passing driver highlights worsening Aussie crisis",
        "publish_date": "2025-04-07T08:04:07Z",
        "category": "finance",
        "authors": [],
        "text": "The displacement of wildlife has become a 'national crisis', but little is being done to address it, animal rescuer Krysti Severi tells Yahoo News.\n\nA poignant image of a dead kangaroo curled up on the grass in front of a housing development sign has some Aussies pondering if the heartbreaking scene was in fact staged. Tragically, the wildlife rescuer who desperately tried to save the animal seen in the viral photo confirmed to Yahoo News on Monday the brutal sight on the side of a busy road was in fact real.\n\n\"A gentleman driving past saw him trying to hide in the really small bit of shade cast from the sign,\" Krysti Severi said. \"He was completely defeated and had given up. Temporary fencing surrounded him.\"\n\nKrysti, who responds to wildlife calls in and around Melbourne every day, told Yahoo the impact of new developments on our native creatures is only getting worse, and despite the \"nationwide crisis being in our face\" like the photo indicates, little is being done to preserve animals.\n\n\"This issue is not just happening here, it's happening all across Australia. The developers and councils and government — they all aren't doing anything. No wildlife corridors are being erected. There's no safe areas for wildlife to escape.\n\nADVERTISEMENT\n\n\"It's heartbreaking — but it's actually pretty standard.\"\n\nThe kangaroo in question what spotted at Donnybrook, about 30km north of the city's CBD. Yahoo News has reached out to developer YourLand for comment.\n\n\"The roo was in extremely bad shape. He was struggling to breathe and struggling to move. He had a previous injury from being hit by a car, the area is notorious for being busy. There's a high volume of trucks and traffic going through there daily... we're at crisis point,\" Krysti said.\n\nKrysti said there is a stark difference between how Aussies use kangaroo imagery and how we actually treat them. Source: Facebook/Rescue Rehabilitation Release\n\n'Ironic' photos highlight poor treatment of kangaroos\n\nIt's not the first photo Krysti has taken that highlights the \"ironic\" difference between kangaroos being used as an Aussie emblem, and the reality of how they're actually treated.\n\nShe recently captured an image of a dead kangaroo lying at the side of the road while a Qantas play flew above it, proudly showcasing the outline of a kangaroo on its tail.\n\nADVERTISEMENT\n\nRoos 'pushed' to breaking point by developments\n\nYahoo News has covered countless stories about kangaroos being misplaced from their habitat due to increased construction, from Sydney's west where housing development has significantly reduced the size of a once large mob, to Perth's northeast where roos were spotted looking disorientated on a makeshift road that was once their paddock.\n\nDevelopment is pushing kangaroos into more urbanised areas. Source: Vets for Compassion\n\nThe clearing of habitat pushes the native animals out of their land, and the increased traffic from development poses a significant risk, with vehicles travelling at speeds of 40km/h likely to cause fatalities if a collision occurs.\n\nADVERTISEMENT\n\nTemporary fencing from developments often traps animals who are unable to find their way around it, while others may get injured trying to clear the fences. Their displacement also forces them into urban areas, with increased sightings of roos in shops and residential streets where off leash dogs can also pose risk.\n\n\"The odds are absolutely stacked against the animals,\" Krysti told Yahoo. \"Developments are started and it pushes the roos further up. If it's not the development traffic, it's dogs off the leash or temporary fencing...kangaroos are being pushed and pushed away from their land.\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/big-change-coming-to-hundreds-of-woolworths-stores-to-combat-growing-problem-070955088.html",
        "title": "Big change coming to hundreds of Woolworths stores to combat growing problem",
        "publish_date": "2025-04-07T07:09:55Z",
        "category": "finance",
        "authors": [],
        "text": "The Soft Plastics Taskforce was set up in the wake of the REDcycle collapse. Source: Woolworths/Facebook/Getty\n\nWoolworths is aiming to significantly expand its in-store soft plastics collection trial over the next year, with plans to achieve \"full coverage\" across 500 stores within the next 12 months.\n\nThe supermarket giant claimed its biggest challenge in broadening the trial so far has been the fact there's not enough soft plastic recycling capacity in Australia to support nationwide collections.\n\nBut, speaking to Yahoo News, Woolworths said it will \"work toward\" increasing collection points from 120 stores currently, to about 500 across metropolitan Sydney, Melbourne, and in parts of southeast Queensland, the ACT and Adelaide in the coming months.\n\n\"The Soft Plastics Taskforce has now launched recycling trials in around 120 supermarkets, and has been careful not to exceed limited local recycling capacity as it works with the broader industry to responsibly rebuild the soft plastic recycling system,\" a spokesperson said.\n\nADVERTISEMENT\n\n\"We’re in close contact with soft plastic recyclers as they rebuild, and expand their operations, with a number of new recyclers starting to open their doors over the last year. The Taskforce was set up in the wake of the REDcycle collapse as an interim measure to facilitate an immediate response to the stockpiles left ... and [to] commence work on a new recycling scheme.\"\n\nA \"more permanent, industry-wide soft plastic stewardship program\" is currently in the works to bring together all manufacturers and retailers who generate household soft plastics, the spokesperson added.\n\nOne of the key issues with recycling soft plastics is that they can only be recycled once or twice before their quality deteriorates, which limits their ability to be reused in the same form. Source: Facebook\n\nWhat challenges face soft plastic recycling?\n\nOne of the key issues when it comes to recycling soft plastics is that they can only be recycled once or twice before their quality deteriorates, which limits their ability to be reused in the same form.\n\nADVERTISEMENT\n\nUnlike rigid plastics that can be recycled more times, soft plastics, such as shopping bags, plastic wrap, and product packaging, degrade quickly during the recycling process.\n\nIt means they must be carefully managed and their recycling systems continually expanded to ensure the process remains sustainable. Soft plastic recycling remains vital for reducing landfill waste and supporting the circular economy.\n\nSoft plastics account for a significant proportion of plastic waste in Australia — an estimated 538,000 tonnes annually, in fact — and without adequate recycling programs, these materials would often end up in landfills, contributing to environmental damage.\n\nAs the Taskforce continues to build a more robust recycling infrastructure, a more permanent and expansive soft plastic stewardship program is expected to play a crucial role in this effort, benefiting both the environment and the economy.\n\nADVERTISEMENT\n\nThe major supermarkets involved in the Soft Plastics Taskforce — Woolworths, Coles and Aldi — do not own or operate any soft plastic recycling facilities. Instead, independent third-party companies, with expertise in recycling, manage these operations.\n\nThe Taskforce works closely with these recyclers to expedite their development. The Australian Competition and Consumer Commission (ACCC) has authorised the supermarkets to collaborate through the Taskforce, with the latest draft proposal extending this authorisation until July 31, 2026.\n\nRecycling collection points in Woolworths supermarkets will reportedly return to the front of stores.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]