[
    {
        "url": "https://www.9news.com.au/finance/interest-rates-reserve-bank-australia-meeting-cash-rate-may-20-live-updates/1f97d894-76da-40fa-a742-77b31459a3be",
        "title": "Millions hoping for relief with RBA about to hand down rates decision",
        "publish_date": "Tue, 20 May 2025 01:49:56 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "T﻿he Reserve Bank of Australia will announce its next decision on interest rates at 2.30pm (AEST) today. Economists are widely expecting a rate cut that would deliver some much-needed relief to mortgage holders across the country. The stock market has risen in early trading on the back of hopes for a cash rate cut.\n\nREAD MORE: Reserve Bank expected to deliver another interest rate cut﻿\n\nREAD MORE: With fixed-rate home loans falling, should homeowners lock in now?\n\nREAD MORE: New data reveals it's not just homeowners holding on for rate cut\n\nREAD MORE: ﻿Most Comm Bank homeowners did not lower repayments after February rate cut",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/interest-rate-cut-expected-at-rba-meeting-today/ede8ba0a-f973-48fa-a6a2-68e063a82610",
        "title": "Reserve Bank expected to deliver another interest rate cut",
        "publish_date": "Mon, 19 May 2025 23:48:47 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "M﻿ortgage holders are looking forward to further relief, with the Reserve Bank of Australia expected to deliver an interest rate cut at 2.30pm AEST today.\n\nEconomists and financial markets are forecasting a 0.25 per cent cut to the current 4.1 per cent cash rate, which would be the second of the year.\n\nThe near-unanimous view is that conditions are ripe for a reduction given ﻿continuing weak growth in the Australian economy, struggling consumer spending and the global uncertainty sparked by US tariffs.\n\nHome owners can expect some relief today, with the RBA expected to cut interest rates. (Photo by ROB HOMER SPECIAL 103506) (Rob Homer) (Nine)\n\nThe outlook is backed by the inflation dropping to the RBA's target range of between 2 per cent and 3 per cent.\n\nEconomist Evan Lucas told Today this morning that it was unlikely the RBA would make a larger cut today.\n\n\"There are some that are suggesting they could do as much as half of 1 per cent. That seems unlikely, considering how robust the employment market is.\" he said.\n\nIn February, the RBA made the first official rate cut in almost five years, and a big question home owners are asking now is how many more there will be.\n\nExperts are tipping two or three further reductions this year.\n\nThe next one would probably be in August when results from the second quarter of the economic year become clear.\n\nThe RBA could possibly make a fourth reduction in Melbourne Cup week when its board meets in early November.﻿\n\n\"But in short, it will mean that the cash rate will be significantly lower than where it started the year and a significantly bigger boost for the household and the mortgage rates that people have,\" Lucas said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/majority-of-australians-working-second-job-to-make-ends-meet-research-shows/849e5969-ecae-4ce3-9d58-0f467c439d6f",
        "title": "Majority of Australians considering second job to make ends meet, research shows",
        "publish_date": "Tue, 20 May 2025 00:17:34 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "A﻿ majority of Australians are considering taking on a second job or side hustle, according to new research.\n\nGlobal recruitment firm ﻿Robert Walters found 70 per cent of Australian professionals are considering or already working a second job.\n\nIn a survey of 2000 people, 90 per cent said they were concerned their salary alone wouldn't be enough to cover their yearly expenses.\n\nThe researchers found 70 per cent of Australian professionals are considering or already working a second job. (Getty)\n\n\"As cost-of-living pressures rise, we're seeing more professionals explore second jobs, side gigs, or even interstate relocation in pursuit of financial stability,\" Shay Peters, CEO of Robert Walters Australia and New Zealand, said.\n\n\"While work-life balance was once a priority, today it's clear that salary has retaken centre stage.\n\n\"People simply can't afford to stay in roles that don't pay enough to keep up with their lives.\"﻿\n\nThe concern surrounding wages has also sparked a wave of interstate migration.\n\nUp to 54 per cent of Australians have considered relocating interstate for better pay, cheaper housing and different career options, the study found.\n\n\"The decision of where to live is no longer just a matter of preference; it has become a strategic decision driven by financial pressures,\" Peters said.\n\n\"Choosing a place where one can earn a competitive income without spending most of it on daily living expenses will be a pivotal factor in these moves.\"\n\nIn a survey of 2000 people, 90 per cent said they were concerned their salary alone wouldn't be enough to cover their yearly expenses. (iStock)\n\nThe study also broke down which states were the most unsatisfied with their salary.\n\n﻿In NSW, 90 per cent of participants said their pay did not match their cost of living.\n\nIn Victoria, 84 per cent reported similar concerns.\n\nIn Queensland, 83 per cent of participants said they were not satisfied with their salary growth.\n\nIn Western Australia, ﻿80 per cent of participants said they had salary concerns.\n\nThe research is a \"wake-up call\" for employers, Peters said.\n\n﻿\"This is a warning bell for businesses,\" Peters said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/spot-the-snake-sunshine-coast-catchers/123f3fea-cd2e-4832-9e82-fb392495fcb8",
        "title": "This 2000-piece woodpile hid one of the world's deadliest snakes",
        "publish_date": "Mon, 19 May 2025 23:43:41 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "1 of 282 Attribution: Blackie Swart Snake Relocations\n\nIt would be cheating to ask you to \"spot the snake\" in this image. The snake catcher certainly couldn't.\n\nBut Blackie Swartz Snake Relocations 24/7, based in Helderberg, South Africa, didn't let that deter them.\n\n\"I know of snake catchers who would have gone out, blink their eyes max three times, and then tell the property owner to call again if they see the snake, and then wait anxiously for their money in the palm of their hands, but not me,\" the snake catcher wrote on Facebook.\n\n\"For me it is about the safety of the caller and their family and their pets, and of course the safety of the snake to be relocated﻿.'",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/victoria-south-australia-drought-what-effect-will-it-have-on-food-supply-supermarket-prices/f736df8f-81b6-4085-a29c-5235901f8dd3",
        "title": "How the drought crisis will affect your weekly shop",
        "publish_date": "Mon, 19 May 2025 19:36:14 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "A crippling drought described as the worst in decades is devastating regional Victoria and South Australia.\n\nSmall communities and agricultural producers are doing it tough and have warned of potential collapse as they plead for urgent government assistance .\n\nAnd with household budgets tight and stretched around the country, consumers are looking at the shelves wondering if they'll start seeing prices start to shoot up - or worse, empty spaces - as producers dig in for the lean times.\n\nAustralian producers are battling drought in Victoria and South Australia. (AAP)\n\nShould shoppers be worried?\n\nIndustry analyst and managing director at Food Industry Foresight﻿ Sissel Rosengren has some reassuring news for households, although, she says, many Australian producers are still \"struggling\".\n\n\"It fluctuates, but on a national scale, Australia is very resilient to these types of supply shocks,\" she said.\n\n\"Shortages are likely to be more localised in the supply chain. Longer, centralised supermarket supply models are more flexible and will already be assessing and working rapidly to fill supply from other sources.\"\n\nSupermarkets have indicated they aren't worried about short supplies. (Getty)\n\n﻿Supermarkets contacted by 9news.com.au indicated they were not worried about supply and were working with producers around the country to keep shelves stocked.\n\nRosengren said the lessons learned during the COVID-19 pandemic also stood the country in good stead﻿, from the importance of diversifying supply chains, to the need for food businesses to stay ahead of supply issues.\n\n\"Even with the recent avian flu, with periods of little to no egg cartons on the shelves in supermarkets – there is a lot of work put in along the supply chain to find ways to correct, which is why you can still buy eggs, even if not as abundantly,\" she said.\n\nAre any foods in particular likely to be affected?\n\n﻿Any shortfalls in production from commodities like beef and grain from Victoria and South Australia can likely be made up from other states which are major producers, Rosengren said.\n\n\"Victoria is a leader for lamb and mutton however, so there might be some pressure on that commodity as a result, though NSW and Western Australia also contribute significantly,\" she said.\n\n\"Another one would be wine grapes, considering South Australia is the highest producer by volume.\n\nLamb supplies out of Victoria could be affected. (Getty)\n\n\"Both South Australia and Victoria are significant horticultural producers, but it is a mix that can be supplied from elsewhere also.\"\n\nIt's also possible the market could see an \"intermittent glut\" of livestock, as producers sell off herds and flocks to save on feeding costs.\n\n\"Drought also affects producer resources, such as feed for livestock. Interstate freight is particularly expensive at the moment, which reduces the ability to supply feed from Western Australia, for example, to fill that need,\" Rosengren said.\n\nSouth Australia is a major wine producer. (Getty)\n\n\"Producers are likely sourcing closer to home, such as NSW, but that places added burden in the supply chain and can impact prices.\"\n\nShe said this could affect the local economies where producers are being hardest hit, while broader state economies would have to bear the cost of lost production.﻿\n\nWill things get worse if the drought continues?\n\nAccording to Rosengren, Australia imports only about 10 per cent of its food, with up to 90 per cent being grown and produced locally.\n\n\"Droughts such as these do place a constriction on supply, but due to that high domestic production, there is also room to increase the import mix to buffer the impact of the drought,\" she said.\n\n\"This is only seen when effects are long-term, such as years long.\"\n\nBut prices in the shorter term can be affected by things like export incentives, freight costs, productivity in other states, and inflation, though the latter, Rosengren said, was \"getting under control\".\n\n\"It is likely the most noticeable impact on shelf prices will come if there is a long, extended drought,\" she said.\n\n\"If you take the drought from 1996 to 2010 as an example, food prices only sharply increased from around 2005.\"\n\nWhat does the future hold?\n\nRosengren said Australia's history of droughts and other environmental challenges had fuelled the construction of a robust, adaptable, resilient food industry﻿.\n\nProducers have also been focused on resilience and mitigation strategies to reduce the impact of drought.﻿\n\nBut, she warned, climate change was likely to make dealing with similar situations \"the new normal\".﻿\n\nThese are the world's most expensive passports View Gallery\n\n\"Australian agriculture productivity has continued to improve despite challenging climate conditions, even if gains have slowed,\" she said.\n\n\"Australian producers are amazing at producing more with less, and this will continue with ongoing investment in research and development, innovation and technology.\n\n\"That also means our food systems continue to evolve to have the adaptability to respond and implement their own mitigation strategies.﻿\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/with-fixed-home-loan-interest-rates-falling-should-people-lock-in-now/d33902e2-2ef2-446d-82a6-d46cdfc336db",
        "title": "With fixed-rate home loans falling, should homeowners lock in now?",
        "publish_date": "Mon, 19 May 2025 09:25:24 +0000",
        "category": "sports",
        "authors": [
            "May"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/runner-becomes-the-fastest-person-to-run-across-australia/74760fd5-027b-4ef8-bea1-c50554c865ee",
        "title": "Runner becomes fastest person to cross Australia on foot",
        "publish_date": "Mon, 19 May 2025 07:02:25 +0000",
        "category": "sports",
        "authors": [
            "May"
        ],
        "text": "A British endurance athlete has become the fastest person to run across Australia, making it from Perth to Sydney in just 35 days.\n\nWilliam Goodge set out from Cottesloe Beach on April 15 and kept an average distance of more than 100 kilometres per day.\n\nHe arrived in Sydney this afternoon, capping off the brisk 3800-kilometre run.\n\nA British endurance athlete has become the fastest person to run across Australia, running from Perth to Sydney in just 35 days. (Nine)\n\nHis run beat the previous record of 39 days and earns him the fastest foot crossing of Australia.\n\nGoodge has been raising money for the Cancer Council of Australia in memory of his mother, who died in 2018.\n\nGoodge was met by hundreds of fellow runners at Centennial Park in Sydney's east about 3pm, before the group made their way towards the finish line at Bondi Beach.\n\nWilliam Goodge (right) and runner Ned Brockman pose at Cottesloe Beach in Western Australia. (Nine)\n\nGoodge and his followers depart Centennial Park. (Nine)\n\nSeveral streets were swamped as the crowd made their way east.\n\nGoodge arrived at Bondi at 4.07pm, where he was welcomed by a large crowd.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/lawrence-campbell-oratory-dame-enid-lyons-oratory-competition/105293122",
        "title": "New speaking comp for girls who are excluded from storied boys' equivalent",
        "publish_date": "Tue, 20 May 2025 01:31:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "For 90 years, a prestigious impromptu public speaking competition in NSW has been exclusive to high school boys, with minimal reason given as to why female students haven't been considered.\n\nNearly a century later, a competition of equivalent standing has been launched for girls.\n\nIn its inaugural year, 10 female students have been selected out of three heats to compete in the finals of the Dame Enid Lyons Oratory Competition this week.\n\nIt is open to all private and public girls' high schools in the state.\n\nThe boys' event — the Lawrence Campbell Oratory Competition — has 15 boys selected from NSW high schools — 14 of which are private schools.\n\nGirls' time to shine\n\nThe girls' competition is named in honour of the first woman elected to the House of Representatives in Australia, Dame Enid Muriel Lyons who won a Tasmanian seat in 1943.\n\nOrganised by the Independent Girls School Association, executive officer Sonia Berry said she had wanted to start a girls' oratory competition for years, noting the male equivalent \"excludes girls\".\n\nSonia Berry says she wants to advance girls' education.\n\n\"I am from the independent schools, we have 32 schools, but we also champion girls' education,\" she said.\n\n\"That's what we aim to do and that includes all girls who are educated from all schools.\"\n\nThe girls' competition involves three topics to choose from — including a Shakespearean quote — and 15 minutes without internet access to prepare an eight-minute speech.\n\nThis style of competition requires the participants to engage with the topic by drawing from life experiences, Ms Berry said.\n\nInclusion 'long overdue'\n\nZoya Aziez, 16, from St George Girls High School in Kogarah, is the only public school student to have made the finals.\n\nThis year 28 schools entered the competition and four were public schools.\n\nMs Aziez said she has always enjoyed public speaking and hopes her involvement in the competition will encourage other public school students to compete in future years.\n\n\"Public speaking is very popular amongst private schools, and it's very encouraged there, but… no matter what school you go to, at the end of the day, we're all part of the Australian youth,\" Ms Aziez said.\n\n\"I think equal opportunity [and] equal involvement is really important.\"\n\nFinalist Zoya Aziez hopes more students from public schools have the opportunity to participate in competitions like these. (Patrick Thomas)\n\nMs Berry agreed, saying she wanted to see the ratio between public versus private school participation in the competition at \"50 per cent\".\n\nFellow finalist Gabrielle Flemming, 18, from Our Lady of Mercy College in Parramatta, has a passion for politics and impromptu speaking.\n\nMs Flemming described the competition as a \"step forward\".\n\nHighlighting the impact competitions like these can have, previous winners of the Lawrence Campbell Oratory Competition include former prime minister Malcom Turnbull, former chief justice Murray Gleeson and also former NSW Supreme Court justice Anthony Whealy.\n\nFormer NSW Supreme Court justice Anthony Whealy is a past winner of the prestigious Lawrence Campbell Oratory Competition.\n\nWorking in law, Mr Whealy said the experience influenced his early career, adding it was \"long overdue\" for girls \"to have a proper competition\".\n\n\"That ability to communicate to people, to have a logical argument, and to present it in an attractive way, is going to stand you in good stead, no matter what profession you're in,\" he said.\n\nEncouraging diverse voices\n\nMs Aziez said she draws speech inspiration by reflecting on her Pakistani background and how her parents built a life in Australia for their family.\n\n\"I feel like the migrant experience is really important to understand, because Australia is a country built on migrants.\"\n\nThe Year 11 student sees impromptu speaking as a platform for sharing and hearing different voices.\n\n\"You get a really good cross section of society,\" she said.\n\nGabrielle Flemming is keen to pursue her passion for politics and impromptu speaking. (ABC News: Marcus Stimson)\n\nMs Flemming, who has Filipino heritage, said she too has a similar outlook in terms of acknowledging diverse perspectives in her work.\n\n\"For us, we take the luxury of having a shower … but in other countries, all you have is a stream of water. You've got a bucket.\"\n\nBoth students expressed nerves for the upcoming finals but will be supported by family, friends and teachers in the audience.\n\nThe 10 girls will compete at the finals tomorrow at the Sydney Opera House.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/meat-smoking-bbq-trend-takes-hold-among-aussie-backyard-chefs/105309796",
        "title": "American-style meat smoking puts a new spin on the Aussie Sunday roast",
        "publish_date": "Tue, 20 May 2025 01:19:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Most weekends, Callan Buchholz wakes up early, not for a morning run or yoga class, but in pursuit of the perfect smoked brisket.\n\nThe 35-year-old lives in Rockhampton, central Queensland, a region regarded as the beef capital of Australia and renowned for its bull statues and meat-related experiences.\n\nHe has joined the growing trend of weekend barbecue enthusiasts converting from the traditional Aussie barbie to American-style smoking.\n\nSlow-cooked barbecue brisket is hugely popular when it comes to meat smoking. (Supplied: Burleigh BBQ)\n\nIt's a mouth-watering method increasing in popularity both for the challenge and the cost.\n\n\"You can definitely feed a lot of people in one sitting and have food for days left over,\" Mr Buchholz said.\n\n\" Brisket Benny's unreal the next day for breakfast too. \"\n\nBeef brisket is a popular cut of meat for American-style barbecuing. (Unsplash: Luis Santoyo)\n\nMr Buchholz said it was his wife, Ashleigh, who got him into the culinary art of meat smoking.\n\n\"I turned 30 and I'm not into golf nor history so my wife bought me a meat smoker,\" he said.\n\n\"Since then, I think I've had about 15–20 mates travel with me on the journey the last few years, which is cool.\n\n\" Our text group chat is called Meat Pigs and we're always sharing pictures of our meat. \"\n\nMr Buchholz and his mates enjoy regular catch-ups and cook-ups. (Supplied: Callan Buchholz)\n\nLow and slow cooking style\n\nMeat smoking involves a slow, low-temperature cooking approach over direct heat from wood or charcoal that tenderises the meat and develops a unique smoky taste.\n\nIt requires skill and technique, but also, time and patience.\n\n\"There's a few more elements at play than a traditional Australian barbecue,\" Mr Buchholz said.\n\n\"The prep that goes into the meat and the planning is all part and package of it.\"\n\nButchers like Luke Leyson are trying to keep up with the demand. (Supplied: Luke Leyson)\n\nAdelaide's Luke Leyson is a butcher but not just any butcher.\n\nHe's captain of the Australian Butcher Team.\n\nMr Leyson said the rising trend of meat smoking had resulted in increased demand for certain types of meat.\n\n\"It's definitely translated into retail butchery,\" he said.\n\nMr Leyson (third from right) representing Australia at the World Butchers' Challenge. (Supplied: World Butchers' Challenge)\n\n\"The cuts that are used in these low and slow methods aren't your ones that you would normally come across, so as butchers we've got to move with the times as well.\n\n\"That's the best thing about these food trends. As long as we can educate ourselves and keep on top of them, it's great for us to then help out our consumers to be able to cook the perfect meat on the weekend.\"\n\nMeat coming out of the smoker. (ABC Southern Queensland: David Chen)\n\nThe 'new' Sunday roast\n\nAs the nation grapples with a cost-of-living crisis, Mr Leyson said a big weekend cook-up could also be more cost-effective.\n\nHe said a 12-hour smoked beef brisket was a new twist on the Sunday roast.\n\n\"It's almost like that little take on your Sunday roast where you'd cook a big roast and then it would carry over into the start of the week for cold cuts.\"\n\nMr Leyson says there are plenty of options when it comes to smoking meat. (Supplied: Luke Leyson)\n\nButchers across the country are also getting in on the backyard-cooking trend.\n\nMr Leyson said beef, pork and lamb were the most popular choices of meat when it came to smoking.\n\n\"It's kind of hard not to get into the trend especially when we've got to have a knowledge of how to cook it as well so we can translate that to our customers.\n\n\"When you're thinking low and slow you think of ribs and pork ribs is a good place to start.\"\n\nBeef ribs cooking in an American-style barbecue. (Supplied: Burleigh BBQ)\n\nSmoke or sizzle?\n\nIs the traditional Aussie backyard barbecue under threat from a meat-smoking culture?\n\nAccording to Australian celebrity chef Matt Golinski, there's still a place for both.\n\nHe said the low and slow style of cooking had taken off in Australia in recent years.\n\nAmerican barbecue typically produces rich, smoky flavours. (Unsplash: Luis Santoyo)\n\n\"It's become a huge thing now for amateurs and professionals and the teams that you see getting around the countryside with their big smokers and entering in competitions is an amazing thing,\" he said.\n\n\"It is an art form and the guys that get really serious about it, they understand the science of it.\n\n\"The temperatures are hugely important and there's the purists who will only smoke with certain woods, so there's a massive variation in the way you can achieve an end result.\"\n\nMatt Golinski says the low and slow cooking style is attracting enthusiasts in Australia. (Supplied: Matt Golinski)\n\nThe highly regarded Sunshine Coast-based chef said the reward of cooking and eating smoked meat offered a unique and intensely flavoured experience.\n\n\"You can really create magic,\" he said.\n\n\"It's also that anticipation as well and you have to be patient enough to wait for it to be ready and once it is, it's worth that wait.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/national-native-title-tribunal-rules-on-narrabri-gas-project/105272428",
        "title": "Tribunal rules NSW government can lease culturally significant land to Santos",
        "publish_date": "Tue, 20 May 2025 01:03:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "A decision by the National Native Title Tribunal to allow the New South Wales government to lease land to Santos for gas extraction has left a traditional landowner \"devastated\".\n\nThe tribunal was asked to decide whether the leases, which mostly overlap with a significant Gomeroi cultural area, the Pilliga, should be allowed.\n\nThe NSW Independent Planning Commission (IPC) approved the $3.6 billion Narrabri Gas Project for up to 850 gas wells in 2020.\n\nIn its decision handed down on Monday, the tribunal said, weighing the public interest evidence and concerns of the Gomeroi people, they believed the Narrabri Gas Project offered a \"net public benefit\".\n\nGomeroi woman and native title applicant Polly Cutmore said the decision was upsetting.\n\n\"I am very upset, but it doesn't surprise me,\" she said.\n\n\" We live in a colonial system and the judgement was done by people who haven't taken consideration of us [the Gomeroi people]. \"\n\nLengthy tribunal process\n\nThe tribunal decision was not the only remaining hurdle for the Narrabri Gas Project, but it has been a protracted issue.\n\nIn December 2022, the tribunal decided the leases could be allowed, subject to conditions.\n\n\n\n\n\nIn March 2024, the Federal Court ruled the Native Title Tribunal didn't properly consider the climate impact when Santos's $3.6 billion gas project was approved. (ABC News: Brendan Esposito) The Gomeroi people then lodged an appeal.\n\nIn March 2024, the Federal Court unanimously rejected the Gomeroi people's five grounds of appeal relating to good faith.\n\nBut the appeal was allowed on one ground; two of the three Federal Court Justices found the tribunal erred in its limited consideration of environmental concerns.\n\nChief Justice Debra Mortimer said in the 2024 ruling the Gomeroi people \"were deprived of the possibility of a successful outcome by reason of the tribunal's errors\".\n\nTraditional owners called the decision groundbreaking for their people and the fight against climate change.\n\nMeanwhile, Santos indicated they would continue mediation to reach a mutually beneficial outcome for both parties.\n\nGomeroi people 'will continue to fight'\n\nMs Cutmore said her people would continue to fight to protect their country.\n\n\"I am just so upset over it, it should have been our cultural values of our country should have been taken into consideration,\" she said.\n\nMs Cutmore said when she was first made aware of the project almost a decade ago, she was concerned about Santos's plan to extract gas from the Great Artesian Basin.\n\nPolly Cutmore has long campaigned for stronger recognition and protection of culturally significant lands. (ABC New England North West: Max Tillman)\n\n\"The people from the Namoi, who rely on the water system, all the way through to the Murray Darling Basin, it's going to be devastating for the country, the land,\" she said.\n\n\"It's going to be devastating for our people.\n\n\"We took everything into consideration what Santos offered us at the (National) Native Title Tribunal table, we said no.\n\n\"We are here because of our ancestors, they fought and we will continue to fight.\n\n\"We are still here and we will continue to fight, we love our country.\"\n\nPipeline ruling yet to come\n\nSantos's proposal for the Narrabri Lateral Pipeline, a 30-kilometre pipeline to connect the Narrabri Gas Project to the Hunter Gas Pipeline, is still being assessed by the federal government.\n\nBefore the IPC's approval of the Narrabri Gas Project, the state government received almost 23,000 public objections and the Mullalley Gas and Pipeline Accord later unsuccessfully challenged the approval in court.\n\nSantos will need to comply with strict conditions to proceed with the project.\n\nSantos has been approached for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/using-superannuation-to-pay-for-ivf/105201960",
        "title": "How much is using superannuation to pay for IVF really costing women?",
        "publish_date": "Tue, 20 May 2025 00:58:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "In her late 30s, there was nothing Cyndi wanted more than to become a mum.\n\nSingle and worried about declining fertility, Cyndi says it was \"now or never\" and she planned to start IVF.\n\nBut she couldn't afford it.\n\n\"It wasn't something I could put off and save for,\" says the 40-year-old from Melbourne/Naarm, who asked we don't use her surname.\n\nAfter discovering she could apply to use her superannuation to pay for treatment, Cyndi did so on three occasions.\n\n\"At that point, what I really wanted in life more than anything was to have a child.\n\n\"I had this mindset, which might sound a bit morbid, but you could die at any point and not use your super.\"\n\nShe withdrew a total of $42,000 (plus tax), and after six embryo transfers, gave birth to her son.\n\nAustralians are increasingly accessing their superannuation early on compassionate grounds, mainly to fund medical procedures, including IVF.\n\nIn 2023-24, 4,210 people had applications approved for IVF treatment, compared to 2,720 in 2018-19 — an increase of 55 per cent.\n\nSo what is the process, and what are the ramifications of choosing this route?\n\nOur experts Dr Neera Bhatia, an associate professor and director of the Law, Health and Society Research Unit at Deakin University\n\nNatasha Janssens, financial educator and behavioural money coach\n\nDr Manuela Toledo, board member with the Fertility Society of Australia and New Zealand\n\nAn emotionally vulnerable time\n\nThe use of super to pay for IVF is something that concerns Neera Bhatia, an associate professor and director of the Law, Health and Society Research Unit at Deakin University.\n\nHer paper, Emptying the nest egg to fill the nursery: early release of superannuation to fund assisted reproductive technology, was published in 2021.\n\nNeera Bhatia says people accessing superannuation for IVF are often in a vulnerable position and don't rationally think about the implications. (Supplied)\n\nWhile Dr Bhatia is not critical of people accessing their super to fulfil their desire to become a parent, she says there is potential for exploitation.\n\nHaving been through IVF to have her own children, Dr Bhatia says \"people are really emotionally vulnerable and fragile\" at the time, and often don't think about the implications of accessing super in \"a rational sense.\"\n\nAnd not every IVF journey ends with a baby.\n\nDealing with IVF debt when you're childless Photo shows couple hugging and looking out window Any debt linked to fertility treatment can be a painful reminder for childless people that life didn't go as they planned. And it's often not just financial debt they are left with, either.\n\nThe process of accessing super early to fund IVF\n\nTo access super funds early on compassionate grounds, people apply to the Australian Taxation Office (ATO).\n\nApplicants need to show the procedure is needed to alleviate pain or to treat a life-threatening injury or illness, says Dr Bhatia, or claim they are experiencing \"acute, or chronic, mental disturbance\".\n\n\"A person might be able to access super early on the basis they are claiming that infertility or the fact they are unable to have a child has caused them acute mental disturbance,\" she says.\n\n\"It doesn't actually define what a mental disturbance is; it leaves it really open and broad.\"\n\nSign up to the ABC Lifestyle newsletter Get a mid-week boost and receive easy recipes, wellbeing ideas, and home and garden tips in your inbox every Wednesday. You’ll also receive a monthly newsletter of our best recipes.\n\nPeople must submit two medical practitioner reports certifying the treatment is necessary, along with a quote or unpaid invoice that details the expenses.\n\n\"One has to come from a registered medical specialist in the area you are applying to have medical treatment for,\" Dr Bhatia says.\n\nFor IVF, that would be a fertility doctor.\n\n\"The second report has to come from either a registered medical practitioner or another registered medical specialist … and it does actually say on the ATO website that your application must include a medical report from psychiatrist,\" Dr Bhatia says.\n\nFinancial educator and behavioural money coach Natasha Janssens says people also need to show they can't pay for the expenses by other means, such as by obtaining a loan.\n\nHow did you manage the cost of IVF? We'd love to hear from you to help cover stories in this space: lifestyle@abc.net.au\n\nHow much super could you ultimately lose?\n\nThe cost of withdrawing your superannuation early is likely to be more than what you take out, due to the missed returns of compounding interest.\n\nIf retirement is 30 years away, Ms Janssens says a \"general rule of thumb\" is that it will ultimately cost you about double what you withdraw.\n\n\"These numbers won't be set in stone — there are so many variables — but … a 35-year-old taking out $20,000 now means they are going to have about $42,000 less at retirement [age],\" she says.\n\nYou can test your own circumstances by adjusting the \"super balance\" entry of the MoneySmart superannuation calculator to factor in how much you intend to withdraw.\n\nIs egg freezing really an 'insurance policy'? Photo shows A brunette woman stands in the street holding a cup of ice cream. She wears a white tank top and denim skirt. Egg freezing is often sold by fertility clinics as an \"insurance policy\". But some experts say it's more like a lottery, and few women return to use their frozen eggs.\n\nUnexpected costs\n\nThe super you withdraw on compassionate grounds is paid and taxed as a normal super lump sum.\n\nThere may also be other costs you don't expect, says Ms Janssens.\n\nThat was the case for Cyndi.\n\n\"Taking out two lots of $16,000 in one financial year, I didn't realise it would affect my income.\n\n\"Having that extra $32,000 income on my tax return, meant I had to pay an extra $5,000 on my HECS debt.\"\n\nFor couples undertaking IVF, either party can apply to access their super for treatment if they meet certain criteria, however, Dr Bhatia says her research shows more women than men access their super early for IVF.\n\n\"And we know women [already] have less super than men.\"\n\nThere are specialist companies that offer to help people access their super early.\n\nNot every IVF journey ends with a baby. (Pexels)\n\nCyndi paid $1,000 to one of these companies the first time.\n\n\"After that I actually felt like a bit of an idiot because I realised how simple it was.\"\n\nDr Bhatia says some of the companies advertise their services on fertility clinic websites, and in some cases, fertility clinics refer people to them.\n\nA conflict of interest?\n\nDr Bhatia says people should be able to access their superannuation if they wish, but the involvement of fertility clinics in the process concerns her.\n\nShe says it can be a \"closed-loop system\" where clinics are the ones providing information about accessing super to their patients.\n\nIt's also possible for a fertility doctor from an IVF clinic to be one of the certifying doctors for the application.\n\n\"To my mind that is a conflict of interest. It's an industry that is worth over $6 billion; they have their own vested interest.\n\n\"We do need greater regulatory oversight … in that process.\"\n\nManuela Toledo is a board member with the Fertility Society of Australia and New Zealand, medical director at TasIVF and a fertility specialist at Melbourne IVF.\n\nShe says the decision to access super for fertility treatment \"should not come from the clinics\".\n\n\"FSANZ strongly recommends that this process be independent of the clinics and the treating fertility doctors.\"\n\nFinancial advice 'should be mandatory'\n\nDr Bhatia says financial counselling should be a mandatory part of the process to help people \"take a breather and think about what other ways there might be.\"\n\nMs Janssens says it would be \"wise\" to speak to a financial adviser, counsellor, accountant, or your super fund to get a greater understanding of your individual circumstances, adding that people should consider how they will replenish the money they withdraw.\n\nCyndi says she doesn't regret accessing her superannuation early.\n\n\"I do think about it in the sense that that money could be a lot down the line, but I don't dwell on it.\n\n\"I made the decision, what's done it done. I have my son, and life will play out as it will.\"\n\nKey takeaways Australians are increasingly accessing their superannuation early to fund IVF treatment.\n\nThe cost of withdrawing your superannuation early is likely to be more than what you take out. For many people undertaking IVF in their 30s, it will be roughly double at retirement.\n\nSome experts are concerned about the involvement of fertility clinics in the process, noting a \"conflict of interest\".\n\nUndertaking independent financial advice could help mitigate some risks.\n\nThis article contains general information only. You should consider obtaining independent professional advice in relation to your particular circumstances.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/formula-1-jack-doohan-calls-for-online-abuse-of-family-to-stop/105313280",
        "title": "'Stop harassing my family': Doohan's plea after abuse over fake photo",
        "publish_date": "Tue, 20 May 2025 00:46:40 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australian Formula 1 driver Jack Doohan has made a plea for the online abuse of his family to stop, following the circulation of an image from a parody account falsely portraying his father.\n\nDoohan was dumped from his seat at the French F1 team Alpine for last weekend's Emilia-Romagna Grand Prix, making way for Argentine driver Franco Colapinto.\n\nColapinto, who competed in nine grands prix for Williams last season, crashed during one of the practice sessions at the famous Imola circuit.\n\nA parody social media account named formulafakers then posted a doctored image that appeared to show Doohan's father, Mick, making light of Colapinto's crash.\n\nThe image was made to look like a screenshot from Mick's account, with a photograph of Colapinto's wrecked car captioned, \"very impressive\".\n\nJack Doohan's statement following online abuse directed at his family. (Instagram: jackdoohan)\n\nThat fake post circulated online, leading to Jack Doohan calling for an end to what he described as the \"online abuse of my family\".\n\n\"As you can clearly see, the story circulating above is completely false,\" Doohan wrote on social media.\n\n\"They edited the original content to make it appear as though my father posted it, which is entirely untrue.\n\n\"Please stop harassing my family. I didn't think it would have to get to this point.\"\n\nDoohan initially said it was \"Argentine fans\" who had created the false image, but later corrected himself.\n\n\"However, multiple Argentine outlets falsely reported the fabricated image, which triggered the online abuse of my family.\"\n\nThe parody account formulafakers released a statement on their social media pages apologising to the Doohan family for the heartache caused.\n\n\"Posting that screenshot was a mistake,\" the statement read.\n\n\"The Doohan family does not deserve to be attacked in the way they evidently were for our fake news post.\n\n\"We did not expect this post to cause any damage.\n\n\"We deeply, sincerely apologise to the Doohan family. This has been a wake-up call on the real, tangible effects of social media.\"\n\nDoohan is currently a reserve driver for Alpine as the team struggles for good results through seven rounds of the 2025 season.\n\nHis best result this season was 13th in China.\n\nColapinto was 16th in Sunday's Emilia-Romagna Grand Prix, while teammate Pierre Gasly was 13th.\n\nAlpine is ninth out of 10 teams in the constructors' championship standings with just seven points, all scored by Gasly.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/erin-patterson-mushroom-murder-trial-live-blog-may-20/105312988",
        "title": "Live: Phone records back in spotlight as Erin Patterson's murder trial continues",
        "publish_date": "Tue, 20 May 2025 00:27:40 +0000",
        "category": "lifestyle",
        "authors": [
            "Judd Boaz"
        ],
        "text": "Dr Sorell is asked about EBM data (event based monitoring data) that he was provided with by authorities.\n\nHe says he only received EBM data for specific days rather than all available data, and initially avoided looking at it to avoid bias in his analysis.\n\nMr Mandy says that if he wanted to, he could have received EBM data for the entirety of the past two years.\n\nDr Sorell says that is correct, but he did not request it.\n\nMr Mandy busts out some maps of his own, and Justice Beale jumps in to a request a break.\n\nBack with more soon.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/gary-lineker-leaves-the-bbc-after-zionism-post/105313086",
        "title": "'Genuine mistake': Lineker to leave the BBC after sharing Zionism post",
        "publish_date": "Tue, 20 May 2025 00:27:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "Gary Lineker, the England soccer great turned media celebrity, will leave his role as a presenter for the BBC after facing criticism for reposting an Instagram story about Zionism that featured a picture of a rat.\n\nThe 64-year-old, who is the British national broadcaster's highest-paid presenter on about 1.3 million pounds ($2.6 million) a year, was set to leave flagship soccer highlights show Match of the Day at the end of this season, but remain with the BBC to front other soccer coverage, including next year's men's World Cup.\n\nHowever, the BBC said on Monday, local time, in a statement that Lineker will step down entirely from the corporation after the final Match of the Day episode next weekend in the wake of his decision to share a post from the group, Palestine Lobby, illustrated with a picture of a rat, titled: \"Zionism explained in two minutes.\"\n\nRats, linked to disease and dirt, have been used to represent Jews in antisemitic propaganda throughout history, including by the Nazis in Germany in the 1930s.\n\nBBC sports is in hot water. What’s it all about? Photo shows Soccer broadcaster Gary Lineker holding a microphone Here's a look at who Gary Lineker is, the debate surrounding his comments, and how it has affected the BBC.\n\n\"Gary has acknowledged the mistake he made,\" BBC director-general Tim Davie said.\n\n\"Accordingly, we have agreed he will step back from further presenting after this season.\"\n\nLineker had already apologised for his conduct, saying last week he reposted material which he subsequently learned contained \"offensive references,\" adding that he withdrew the post as soon as he became aware of the issue and \"would never knowingly share anything anti-Semitic\".\n\nBefore Lineker's apology, Davie said the corporation needed people to be the \"exemplars of BBC values and follow our social media policies\" and that \"when someone makes a mistake, it costs us\".\n\n\"Football has been at the heart of my life for as long as I can remember — both on the pitch and in the studio,\" Lineker said in the BBC statement.\n\n\"I care deeply about the game, and about the work I've done with the BBC over many years. As I've said, I would never consciously repost anything anti-Semitic — it goes against everything I stand for.\n\n\" However, I recognise the error and upset that I caused, and reiterate how sorry I am. Stepping back now feels like the responsible course of action. \"\n\nIn a separate video post on Instagram, Lineker said he had made a \"genuine mistake\" and \"should have been more diligent\".\n\n\"I have stood up for minorities and humanitarian issues and all forms of racism all of my life, including of course antisemitism, which I absolutely abhor,\" he said.\n\n\"There's no place for it, and never should be.\"\n\nStrained relationship with the BBC\n\nLineker's openness to reflect his political views on social media has caused growing friction with the BBC regarding its impartiality guidelines.\n\nHe was temporarily suspended from the corporation in March 2023 over comments he made criticising the then-Conservative government's new asylum policy.\n\nGary Lineker is the highest paid presenter at the BBC and has been a stalwart in its football coverage. (Getty Images: Michael Regan)\n\nIt led to the BBC's rules on social media posts being rewritten to say presenters of high-profile programs outside news had a \"responsibility to respect the BBC's impartiality, because of their profile on the BBC\".\n\nLineker was among 500 high-profile figures who signed an open letter in February urging the BBC to re-broadcast a documentary, Gaza: How to Survive a War Zone, to its streaming service, BBC iPlayer.\n\nThe documentary was pulled after it emerged its 13-year-old narrator was the son of a Hamas official.\n\nLast week, in an interview with the UK's The Daily Telegraph newspaper that came a day after his initial apology, Lineker spoke out about the conduct of Israel in the war against Hamas in Gaza, saying those who stayed silent about it were \"almost complicit\".\n\nLineker's media career\n\nThe BBC has lost something of a national treasure who has become almost as well-known a broadcaster as he was a soccer player.\n\nLineker is one of England's greatest players — he scored 48 goals in 80 games for his country and was the leading scorer at the 1986 World Cup in Mexico — who transitioned into being a slick, witty and knowledgeable TV personality and an all-around media darling, with 8.7 million followers on X and 1.2 million followers on Instagram.\n\nGary Lineker in Augusta for the BBC while covering The Masters in 2006. (Getty Images: David Cannon)\n\nHe has been the main presenter of BBC's Match of the Day since 1999 and used his status as a freelancer to work for other broadcasters such as NBC, Al Jazeera and BT Sport.\n\nLineker, who played his club soccer for Everton, Tottenham and Barcelona, is the co-founder of the hugely successful Goalhanger podcasts — the maker of the popular The Rest is History series and its spin-offs about politics, soccer, entertainment and money.\n\nReaction to Lineker's departure\n\nLineker's departure from the BBC was welcomed by the Campaign Against Antisemitism, which said he had become \"a symbol of the rot at the heart of our national broadcaster\".\n\nLineker, the group added, was \"repeatedly allowed to flout the BBC's own rules on impartiality, abusing his position to promote his increasingly propagandist politics, vilifying those he disagrees with, and even promoting dehumanising and extreme messages\".\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nLineker has accepted that being outspoken with his views would make him a target, but for many, it has strengthened his status as one of Britain's most popular figures.\n\n\"Gary has been a defining voice in football coverage for the BBC for over two decades,\" Davie said.\n\n\"His passion and knowledge have shaped our sports journalism and earned him the respect of sports fans across the UK and beyond. We want to thank him for the contribution he has made.\"\n\nMatch of the Day — a late-night program that has been running since the 60s and is regarded as an institution in Britain — will be hosted by Kelly Cates, Mark Chapman and Gabby Logan for the start of the 2025-26 season. None of them are former soccer players.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/the-red-envelope-review/105301846",
        "title": "A homophobic man has to marry a gay ghost in this deeply silly Thai rom-com",
        "publish_date": "Mon, 19 May 2025 23:31:16 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "If 2005 rom-com Just Like Heaven hinged on Mark Ruffalo helping the ghost of Reese Witherspoon jolt her body to life and find her one true love, Thai comedy The Red Envelope is about a man helping a ghost he has been betrothed to achieve his dream of getting married and reincarnated. It is as culturally specific as it gets.\n\nFast Facts about The Red Envelope What: A deeply silly platonic love story between a gay ghost and a straight man Directed by: Chayanop Bonnprakob Starring: Billkin, PP Krit, Piyamas Monyakul, Anna Chuancheun Where: In cinemas now Likely to make you feel: Tickled and, despite yourself, moved\n\nThe ghost is the spirit of gay man Titi, whose wishes to get married in life were thwarted by a prejudiced father. On his last day on Earth, Titi had a fight with his father and died in a hit-and-run car accident while in an anguished state.\n\nIn a posthumous scheme hatched by Titi's amah (Piyamas Monyakul) — perhaps the most progressive grandma to ever live — whoever stumbles upon a red envelope with Titi's lock of hair and cut fingernails will be his husband for perpetuity.\n\nThat person turns out to be Menn, a petty criminal-turned-informant who fools men and women alike in sting operations that often go wrong due to his general uselessness. Crucially, he's also a homophobic straight man, despite his penchant for masquerading as a gay man when it suits him.\n\nTiti's amah (Piyamas Monyakul) will not let anything get in the way of her marriage matchmaking, including his death. (Supplied: Cine Asia Films)\n\nThe Red Envelope's draw rests on its two superstar leads: Thai actor-singers PP Krit and Billkin, who play Titi and Menn respectively. This is not the first time they have acted together, however — their joint breakout roles were in the queer coming-of-age TV series I Told Sunset About You and its sequel I Promised You the Moon.\n\nThe rapport between them is palpable as Menn's prejudice gives way to care and he becomes accustomed to the presence of a ghost in his apartment, while Titi discovers things about his life that shatter his understanding of himself and his loved ones.\n\nThe other thing that must be said: The Red Envelope is patently ridiculous, comically overblown and absurdly camp.\n\nBillkin (left) became a household name after starring in 2024's How to Make Millions Before Grandma Dies, which was the first Thai film to be shortlisted at the Oscars. (Supplied: Cine Asia Films)\n\nThe low-fi special effects as Titi jumps out of photo frames and glides through the air like he is on roller-skates — I suspect this is the case, because we never see his feet — make the technology of late 90s TV adaptation Animorphs look sophisticated. The one horror scene in the film is so overdone it is ludicrous.\n\nTiti's ability to possess anyone leads to uproarious outcomes, particularly in the case of Menn. One particularly memorable scene revolves around Menn undergoing a makeover as he pretends to be a gay man in order to infiltrate a queer club — the transformation hinges on an outfit that an archetypal straight man like Menn would not be capable of conjuring.\n\nChallenged to a dance battle that is most reminiscent of White Chicks, Menn is possessed by Titi, who takes pity on him, and soon his stilted dance moves give way to stylised voguing and impeccable choreography.\n\nTiti and Menn must work together to solve the mystery of who killed him. (Supplied: Cine Asia Films)\n\nThe emotional core of the film begins to emerge after the first act as Menn starts to work with Titi to track down his killer, a case that neatly segues into Menn's own mission to discover the identity of a drug overlord who remains at large. Motivated initially by his wish to vanquish Titi permanently from his life — the theory is that Titi will be reincarnated if he finds peace — Menn starts to discover the benefits of having a close friend, when he previously had none.\n\nThe Red Envelope is a remake of 2022 Taiwanese blockbuster Marry My Dead Body, but it has a tongue-in-cheek script that references its own distinct influences, from Thai horror film Shutter to South Korean social realist drama Parasite.\n\nAt times, the film struggles to balance its sillier aspects with the ever-growing seriousness of the dual mysteries that it is trying to resolve. Did it have to be 2 hours 8 minutes? Almost certainly not.\n\nLess a rom-com and more a buddy cop bromance between the unlikeliest of partners, The Red Envelope tugs on the heartstrings — particularly in a stirring climactic performance by Titi's father (Anna Chuanchuen) — even as it remains a deeply unserious film.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/criminal-charges-laid-against-agl-over-lead-exposure/105312796",
        "title": "Charges laid against AGL over 'unsafe' lead exposure",
        "publish_date": "Mon, 19 May 2025 23:11:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "SafeWork SA has lodged criminal proceedings against energy giant AGL, alleging the company exposed workers to \"unsafe levels of lead\" at its Torrens Island plant.\n\nLast year, the ABC revealed workers, including AGL employees, had been affected by lead exposure while working on the decommissioning project of the power station north of Adelaide.\n\nAt the time, the energy giant was also accused of multiple breaches of work safety laws and regulations during its decommissioning of the station by South Australia's electrical and plumbing union.\n\nIn a statement, SafeWork SA said it launched legal action in the South Australian Employment Court on May 16, following a \"lengthy and complex investigation\".\n\nIt said AGL Torrens Island failed to comply with its health and safety duty, when its workers were allegedly exposed to unsafe lead levels during the plant's decommissioning process between October 2022 and April 2023.\n\n\"This involved de-energising, or preparing to de-energise, cabling throughout the power station, allegedly exposing the workers to lead or lead dust,\" the statement said.\n\n\"Personal protective equipment was provided — but allegedly did not include a full-face respirator.\n\n\" Five workers allegedly recorded an elevated blood lead level subsequent to the work. \"\n\nAGL's Torrens Island and Barker Inlet gas power stations near Port Adelaide. (ABC News: Che Chorley)\n\nAGL has been charged with a category two offence to the Work Health and Safety Act, which carries a maximum penalty of $1.5m.\n\n\"As the matter is before the courts, SafeWork SA is unable to provide any further information at this time,\" SafeWork said in its statement.\n\nIn a statement, an AGL spokesperson confirmed the legal action had been launched and said it could not provide further comment.\n\n\"AGL reported the event to SafeWork SA in May 2023 and has been working co-operatively with SafeWork SA,\" a spokesperson said.\n\n\"Health and safety is a core value of AGL and is an integral part of the way we work.\n\n\"As this is an ongoing matter, AGL cannot comment further at this time.\"\n\nThe decommissioning works were carried out at AGL's Torrens Island power station. (ABC News: Dean Faulkner)\n\nUnion welcomes legal action\n\nSecretary of the Communications, Electrical and Plumbing Union's (CEPU) South Australian branch John Adley told ABC Radio Adelaide he first became aware of the issue two years ago, when workers began falling \"seriously ill\".\n\n\"There was inability to sleep, weight loss, physical illness, inability to eat, chronic fatigue ... and these went for a very long period of time and it was particularly concerning for workers because they didn't really know why it was happening,\" Mr Adley said.\n\nTorrens Island lead exposure Photo shows A man with a serious expression stands in front of a brick wall Sean Gibbons says he started experiencing fatigue, stomach upsets, pins and needles in his legs, and insomnia after helping decommission AGL's Torrens Island power plant.\n\n\"It wasn't until there was an investigation into what was suspected to be lead paint that the toxicity and the danger of the lead cables became apparent to the workers.\"\n\nMr Adley said he believed the charges would send a \"strong message\" to employers about the risks of lead.\n\n\"It’s pretty rare to see this kind of charge being laid,\" he said.\n\n\"There is a lack of awareness generally about the risks of lead, and this is a big concern.\n\n\"Lead is extremely sticky and what has happened in this case and other cases is that workers working with lead take lead home on them and it can cause serious illness to their families and particularly their children who are very susceptible to lead.\"\n\nSA Premier Peter Malinauskas said he welcomed SafeWork taking \"strong action\" against AGL.\n\n\"If it is confirmed through a court process that AGL is guilty of the charges that have been laid, that is a very poor reflection on them indeed,\" Mr Malinauskas said.\n\n\"This is a highly profitable company that has the capacity and wherewithal to make sure that their workers are safe.\n\n\"We should never see profit trump the safety of employees ... this is something we want SafeWork to actively police.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/main-roads-wa-closes-marbelup-rest-stop/105305534",
        "title": "WA authorities bulldoze 'pigsty' rest stop where poo-filled toilet left",
        "publish_date": "Mon, 19 May 2025 22:31:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "The West Australian roads authority has drawn fire for bulldozing and closing off a rest stop that illegal campers used as a dumping ground.\n\nThe Marbelup rest stop, about halfway between Albany and Denmark on the south coast, was left looking like a landfill site after the recent school holidays due to illegal campers and dumping.\n\nMain Roads said the rest stop had become too difficult to manage. (ABC Great Southern: Andrew Chounding)\n\nRubbish left in the area included piles of razors, food waste and an excrement-filled portable toilet.\n\nMain Roads WA, which manages the South Coast Highway and its rest stops, initially suggested people misusing the rest area would be tracked down and fined.\n\nBut travellers in the area this week found the rest stop had been bulldozed and all access had been blocked.\n\nThe former rest area has been bulldozed and fenced off. (ABC Great Southern: Andrew Chounding)\n\nMain Roads Great Southern regional director Andrew Duffield said ongoing misuse of the site and limited resources led to the closure.\n\n\"The decision there was based on our inability to be able to control people doing all the things it was suggested they were doing in there,\" he said.\n\n\" We've had a bit of a history of people trashing that site — there are no bins there and people are just using it as a dump site. \"\n\nRazors and toilet paper were also found scattered across the rest stop. (ABC Great Southern: Andrew Chounding)\n\nMr Duffield said the department had been reviewing rest stops on the network and chose to revegetate the site due to its proximity to the City of Albany.\n\n\"People could come into Albany if they're heading this way. We don't see that as a fatigue risk,\" he said.\n\nThe Marbelup rest area is the third stop in the south-west that Main Roads has closed in the past two years. However Mr Duffield said the department was reinvesting resources in the improvment of other rest stops on the network.\n\nSince January 2023, Main Roads has built 11 rest areas, upgraded 13 and closed nine across the WA network.\n\n'Huge impact'\n\nThe closure has angered some road users, including the Australian Caravan Club, which said the decision was \"disappointing\" and posed safety issues for all road users.\n\nDeputy chair Tom Smith said alternative management options should have been explored before the site was closed.\n\n\"Quite a high percentage of our members prefer to use these facilities when they're travelling to save money,\" he said.\n\n\"It's not the RV or the caravan that creates the mess, because a lot of them have got their facilities on board.\n\n\" It's other people who do it and you just shake your head sometimes when you see these pigsties. \"\n\nMr Smith said regardless of its proximity to town, the closure posed a safety risk.\n\n\"Fatigue management is very important to people, especially as you get older, not just for the grey nomads but for anybody driving on the road,\" he said.\n\nMain Roads says it is closing some rest areas and redistributing maintenance resources to others. (ABC Great Southern: Andrew Chounding)\n\nShort supply\n\nWestern Roads Federation chief executive Cam Dumesny said the closure of the rest area highlighted a worrying trend.\n\n\"There's actually not enough of them as it is across the state,\" he said.\n\n\"We need those rest areas so the drivers can pull in, [and] have their fatigue brakes, which [they] are legally mandated to do. So losing rest areas when we've already got a shortage is certainly a major impact.\"\n\nRough surface signs are dotted along the South Coast highway to warn drivers of the poor road condition. (ABC News: Andrew Chounding)\n\nMr Dumesny said the federation and Livestock and Rural Transport Association had lobbied the government to develop and upgrade heavy vehicle rest areas across the state.\n\n\"We all want these rest areas when driving a car or a caravan or a truck,\" he said.\n\n\"We've all got a social responsibility, like a barbecue at a community park — we use it, we clean it afterwards so that the next person can use it.\n\n\"That element seems to be missing.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/emergency-services-levy-protest-victoria-state-budget/105309740",
        "title": "Calls for Vic premier to 'hold a hose' as firies rage against new levy",
        "publish_date": "Mon, 19 May 2025 22:13:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Thousands of Country Fire Authority (CFA) volunteers and farmers have travelled to Melbourne on state budget day to protest against the government's new emergency services tax.\n\nAmong them is a fire brigade captain who says his station does not need the new truck allocated to it through the Emergency Services and Volunteers Fund (ESVF).\n\nLoading...\n\nThe Corop West brigade is set to be among the first to receive a new tanker via a $110-million investment in CFA, SES and Fire Rescue Victoria fleet replacement.\n\nBut captain Toby Acocks said the first he heard of it was on ABC radio.\n\n\"Myself, our group officer, our district commander, knew nothing of it,\" he said.\n\n\"I'd say someone in Spring Street picked a brigade at random and we happened to be it.\n\nLoading...\n\n\"We're probably a brigade that would happily upgrade to a hand-me-down from a bigger brigade and let someone else have a brand new one.\n\n\"There's definitely other brigades that need new trucks before we do.\"\n\nMr Acocks said there was \"frustration and disbelief\" over the new tax among brigade volunteers, but none had decided to quit.\n\n\"To resign is really penalising the community we're trying to service rather than penalising the government,\" he said.\n\nThe Corop West brigade would happily take a second-hand tanker from another unit, according to Toby Acocks. (ABC Central Victoria: Anna McGuinness)\n\nLack of input from firies\n\nA Victorian government spokesperson said the levy would help keep emergency services funded.\n\n\"These changes will give emergency services the funding and equipment they need as they face natural disasters, which are happening more often and becoming more destructive,\" the spokesperson said.\n\n\"Every single dollar raised by this new fund will support our emergency services, helping them to keep communities safe year-round.\"\n\nFiries say they have not been adequately consulted. (ABC News.)\n\nThe government's initial announcement released Friday said CFA brigades in Darraweit Guim, Corop West, Barmah, Erica, Lubeck, Goroke, Crowlands, Modewarre, Kawarren and Moe South would be the first recipients of fire trucks funded through the ESVF levy.\n\n\"You would have thought that the district commanders and the likes would have some input as to where they get allocated,\" Mr Acocks said.\n\nThe government said new trucks were funded based on information provided to it by the CFA, based on operational need.\n\nEliza Ayres says farmers cannot afford to pay the emergency services tax. (ABC Central Victoria: Sarah Lawrence)\n\n'Learn to hold a hose'\n\nAll ratepayers in Victoria will pay more for the ESVF, but farmers in particular are facing increases of tens of thousands of dollars.\n\nElmore farmer Eliza Ayres boarded a bus in the dark this morning to travel to Melbourne for the protest.\n\n\"I am here because I don't know any farmer who can actually afford this,\" she said.\n\n\" Our prices have tripled over the past five years but our revenue has not, so basically we can't afford this levy. \"\n\nDozens of CFA trucks have spotted around Melbourne protesting against the levy. (ABC News: Stephanie Ferrier)\n\nDavid Johnson also travelled to Melbourne from Elmore and said the tax was \"totally unfair\".\n\n\"Bloody hell, how many charities or organisations do you know where the volunteers have to pay to be volunteers? It's not on,\" he said.\n\n\"They criticise Scott Morrison saying he doesn't know how to hold a hose, well I reckon the Premier better learn how to hold a hose,\" he said.\n\nA convoy of CFA trucks drove down the Calder Freeway to Melbourne this morning. (Supplied)\n\nLevy concerns councils\n\nThe fund replaces the cheaper fire services levy and is aimed at raising more revenue for the fire services, the SES, the triple-0 call centre and the State Control Centre.\n\nThe levy will be implemented by local councils with variable rates that depend on property type.\n\nThe government says CFA and SES volunteers will be able to apply for a rebate after paying the tax, but Mr Acocks says that does not take into account the reality for many farmers.\n\n\"From our understanding it's only a rebate on your primary residence — most operators in regional Victoria are going to have more than one rates notice,\" he said.\n\nSpring Street was swarming with CFA volunteers on Tuesday morning. (ABC News)\n\nThe terms of the rebate will not be released until July.\n\nIt will be the job of councils across the state to collect the new levy as a component of their annual rates bills.\n\nEarlier this year a group of regional councils lobbied the Victorian government to revise its plans for the new fund.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/nsw-origin-mitchell-moses-nathan-cleary-game-1/105312660",
        "title": "Cleary and Moses have both starred in Origin. But can they do it together?",
        "publish_date": "Mon, 19 May 2025 21:57:25 +0000",
        "category": "sports",
        "authors": [],
        "text": "When it comes to sport Americans seem to have a turn of phrase for everything and one particular piece of Yankee wisdom hangs over the fresh New South Wales halves duo of Nathan Cleary and Mitchell Moses.\n\nIf you have two quarterbacks, they say, you really don't have one.\n\nFor a good while, the Blues didn't have one at all. The halfback jersey was a poisoned chalice, until Cleary and then Moses drunk deep, stood steady and asked for more.\n\nCleary has already played in that position for New South Wales more times than anyone except Andrew Johns and won more series as a halfback than anyone bar Johns and Ricky Stuart.\n\nOrigin II was the game of a lifetime for Mitchell Moses Photo shows A man kicks a ball during a State of Origin match More often than not, the New South Wales halfback spot can be a poisoned chalice but under the harshest of scrutiny Mitchell Moses produced the game of his life.\n\nMoses's experience is less extensive, but his man-of-the-match showing in Melbourne and the way he plunged a dagger into Queensland's heart in Brisbane last year was proof he's made of the true steel.\n\nAs they prepare to play together for the first time, what faces them at Lang Park is a different challenge — how do a pair of the best and most dominant halves in rugby league find a way to fit together? They can both lead, but can they follow?\n\nAfter a lifetime of learning the art and science of play-making, which is the hardest task rugby league has to offer, can they share a crown? How do two quarterbacks become one?\n\nBoth Cleary and Moses average a shade over 60 touches per game, putting them third and fourth for possessions among regular halves. It's been a long time since it was any other way for them, because they've been in command of every team they've played on for many years now.\n\nCleary hasn't had to play second fiddle since 2019, before the premierships and the dynasty and the Clive Churchill Medals. Back then, when he was still Penrith's prince and not quite it's king, he partnered James Maloney for club and state.\n\nFor Moses, you have to go back even further, close to a decade. But in his mind, there's no doubt as to where things will stand come Wednesday night.\n\n\"He's the seven. That excites me — I haven't done that since I was playing five-eighth at the Tigers in the early days,\" Moses said.\n\n\"It excites me to play with a dominant halfback, where I can just pick my opportunities.\"\n\nMoses last played five-eighth at Wests Tigers back in 2017. (Getty Images: Cameron Spencer )\n\nCleary sees it slightly differently, as more of a give-and-take. In his mind, one player does not necessarily need to overwhelm the other.\n\n\"It's an understanding, not letting our egos get in the way, doing what's best for the team at that time and having those discussions about what that looks like at certain times of the game,\" Cleary said.\n\n\"We both understand the game pretty well, so that will help, but it's all about complimenting each other.\"\n\nThe pair are different styles of halfbacks, but they share a versatility that should boost their combination.\n\nBoth are adept at playing both sides of the field and can operate equally well out of first and second receiver. Given the physical and direct nature of his play, Cleary is more known for his work in the former but much of his finest hour — the closing stages of the 2023 grand final — came in the latter as he took on more of a creative role following a shoulder injury to Jarome Luai.\n\nLoading YouTube content\n\nLike so much of Penrith's recent glories, it was a showcase of his problem-solving abilities and relentless nature, which is what Moses admires most about Cleary.\n\n\"He competes on every play. He's the ultimate competitor, he's shown that his whole career,\" Moses said.\n\n\"It excites me, to play with a player like that who doesn't leave anything to chance out on the field.\"\n\nMoses showed a similar ability to excel off the ball as recently as Parramatta's win over Newcastle last Friday. Two of his best moments of the night came in chasing kicks from halves partner Dylan Brown.\n\nThe first was for the opening try, when Moses flew through to claim a bomb. The second was for Zac Lomax's second score, when Moses tapped a kick back to create the chance for support players.\n\nOverall, Brown had more touches than Moses on the night as the Eels scored the most points they have in a game all season.\n\nMoses's presence, be it as the primary or secondary playmaker, also opens up the options for the Blues kicking game. It's what Cleary, whose boot is one of his best attributes and primary weapons, admires most about the Parramatta man's game.\n\n\"His kicking game, particularly his long kicking, is exceptional. I think it's the best in the game at the moment,\" Cleary said.\n\n\"But also his running game — he's pretty well-rounded, but those two stand out to me. His defence has also gone to another level as well, he gets in there and he's aggressive.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe nuts and bolts of the combination are still being tightened — at the time of writing, the Blues had only one training session under their belt — but if it can hold the side together, New South Wales will be staring a second consecutive series win right in the eye.\n\nIt's an accolade that would do much for both their legacies. Cleary hasn't played in a winning series in four years and as well as Moses played last year, his own Origin career is still just five games old — this will be the first time he's played in a series opener.\n\nGetting there will require a different kind of skills to those they know so well and worked so hard to master.\n\nFor both Moses and Cleary, getting as much of the ball as they wanted exactly when they wanted it has been the solution to just about every problem rugby league has ever thrown at them.\n\nThey have learned to be great by learning to dominate but if they can learn to let go just a touch, to cede a bit of control, to trust someone who is so like them and wear their trust in return, they can be greater still.\n\nIt is hard to put your faith in the unfamiliar when faith in yourself has taken you so far but if Moses and Cleary can give up just a little, they can have it all.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/ange-postecoglou-tottenham-hostpur-europa-league-micky-hazard/105312682",
        "title": "Postecoglou should stay if he wins Europa League, says Tottenham legend",
        "publish_date": "Mon, 19 May 2025 21:41:29 +0000",
        "category": "sports",
        "authors": [],
        "text": "The last time Tottenham Hotspur won a European trophy it proved to be manager Keith Burkinshaw's last game in charge, and as the club arrives in Bilbao for Thursday's (AEST) Europa League final against Manchester United, history could be repeating itself.\n\nBurkinshaw is regarded as one of the club's greatest managers, taking the north London club to back-to-back FA Cup triumphs and then the 1984 UEFA Cup after a memorable two-legged final decided on penalties at White Hart Lane.\n\nShortly after that epic night, Burkinshaw parted company with Spurs over disagreements with the board and as local legend would have it, his parting words as he walked away were, \"There used to be a football club over there\".\n\nForty-one years and countless managers later, Tottenham boss Ange Postecoglou faces a game that could well be his last — win or lose against United in northern Spain.\n\nIt has been a miserable Premier League season for Tottenham and Ange Postecoglou. (Getty Images: PA Images/Ben Whitley)\n\nTottenham has suffered its worst ever Premier League season with 21 defeats, the same number Burkinshaw's side lost in 1976-77 when they were relegated to the old second division.\n\nBurkinshaw survived, led the club back after one season and blazed an audacious trail by signing Argentina World Cup winners Osvaldo Ardiles and Ricky Villa for the club.\n\nWhile 17th-placed Tottenham has avoided relegation, Postecoglou's demeanour as the Premier League losses racked up has been that of a man who knows his time might be up.\n\nFormer Tottenham great Micky Hazard, part of the 1981-82 FA Cup final team and who famously lost a contact lens in the mud after scoring in the 1983-84 UEFA Cup semifinal win against Hajduk Split, says Burkinshaw's departure cost the club the chance of winning more silverware.\n\nHe strongly believes Tottenham chairman Daniel Levy should stick with Postecoglou if the Australian delivers the Europa League and ends a 17-year trophy drought on Wednesday.\n\n\"I think it's important that they get out of that cycle, win or bust, win or bust, win or bust,\" the 65-year-old Hazard said.\n\n\"Look through history and you look at Alex Ferguson. He took five or six years to win things with Manchester United and then he won things non-stop.\n\n\"Success — it's not overnight, and the longer it takes to get it, the more solid the foundation is.\n\n\"Alex Ferguson built on his first five years of not winning a trophy by winning everything for the next 20 years.\n\n\"When Keith [Burkinshaw] was allowed to resign I thought it was a big, big loss. I didn't agree with it.\n\n\"Will Ange stay? I'm of the belief that winning a trophy is the most amazing thing in football. I always say that if someone wins a trophy they have earned the right to have another crack.\n\n\"Would it be right to get rid of someone that changed the mentality and got the club over the line?\"\n\nThe Europa League final gives Postecoglou the chance to salvage something from Tottenham's season. (Getty Images: Danehouse/Harry Murphy)\n\nHazard says Tottenham must play without fear against United and said despite missing several key players because of injury, there can be no excuses.\n\n\"Injuries are part and parcel of football,\" he said.\n\n\"In 1984 we were without [Glenn] Hoddle, Ardiles, [Steve] Perryman, [Ray] Clemence and [Garth] Crooks and we went and won it.\n\n\"Look for excuses and you find excuses. It's an opportunity for players coming in to go and win a European final.\n\n\"Winning a cup final means playing with no fear, being brave. You don't just turn up in a final and it all goes your way. Nobody's going to give you this, you have to earn it.\"\n\nTottenham will play Manchester United in the Europa League final on Thursday, May 22 at 5am (AEST). Join ABC Sport's Simon Smale as he live blogs all the action.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/farmers-sell-stock-as-drought-deepens-riverina-southern-nsw/105300140",
        "title": "Dams empty, farmers sell livestock as southern NSW dries out",
        "publish_date": "Mon, 19 May 2025 21:34:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "Dams have dried up and the paddocks of Yvette McKenzie's New South Wales Riverina sheep farm are dry and bare.\n\nWhile torrential rain lashes eastern Australia, conditions could not be more different at Ms McKenzie's Bethungra property.\n\n\"I haven't seen it this dry in the 25 years that we've had this property,\" she said.\n\nCattle have been sold in record numbers, farmers have brought in feed for their livestock and the potential of newly planted grain crops has waned across southern NSW.\n\nAccording to the Bureau of Meteorology, parts of the Riverina received 1–10 millimetres of rain last month.\n\nThe drought has led to empty dams across the Riverina. (ABC News: Emily Doak)\n\nMs McKenzie said she had been forced to reduce livestock numbers.\n\n\"We've had to sell a lot of sheep that we normally wouldn't at this stage … as well as hand-feeding every day now,\" she said.\n\nMs McKenzie said feeding the sheep with silage and grain helped her get a good price for the surplus livestock, despite the dry conditions.\n\nShe said she had focused on keeping her best sheep.\n\n\"It's keeping the top line so we can keep our genetics and selling off anything that is not a breeder,\" she said.\n\nYvette McKenzie says she is handfeeding sheep every day. (ABC News: Emily Doak)\n\nRecord livestock numbers\n\nRecord numbers of cattle have been sold at the Wagga Wagga saleyards amid worsening drought conditions.\n\nAn offering of 5,000 head of cattle would normally be considered large, so when almost 8,700 cattle were sold earlier this month at the saleyards, the agents were stretched to capacity.\n\nThere was a large yarding of cattle at Wagga Wagga. (ABC News: Emily Doak)\n\nCattle auctioneer Tyler Pendergast said truckloads of cattle had been moved to the \"greener pastures of the north\".\n\nMr Pendergast said that was providing an opportunity for local producers to offload stock.\n\n\"Hay prices are dear and stock prices are dear, so just sell, it's pretty simple at the minute,\" he said.\n\n'Two different planets'\n\nAccording to the Department of Primary Industries, 1.7 per cent of NSW is in drought, and a further 23.1 per cent is drought-affected.\n\nAlmost all of that is in the Riverina and Murray.\n\nLocal Land Services drought adoption officer Geoff Minchin said the difference was \"chalk and cheese\".\n\nGeoff Minchin says there is a stark contrast between northern and southern NSW. (ABC News: Emily Doak)\n\n\"Two different planets, really very dry in the south and very wet in the north,\" he said.\n\nMr Minchin, who advises farmers on drought management strategies, said producers were drawing on their experience in previous droughts to adapt farming practices.\n\n\"I think there's a higher percentage of landholders that are better prepared and making some really good decisions,\" he said.\n\n\" Things around trimming up the cropping program or changing varieties early puts us in good stead for the rest of the season. \"\n\nHe said destocking, making sure feed was at hand and planning grazing to protect ground cover were good strategies.\n\nFarmers are encouraged to be proactive when it comes to drought management. (ABC News: Emily Doak)\n\nAt Marrar, north of Wagga Wagga, farmer Ben Langtree has been planting crops into dry ground after several months without rain.\n\n\"Sometimes we've started the sowing and it's been a bit dry but not the whole way through,\" he said.\n\nMr Langtree said he had cut back on crops that were more expensive to plant, such as canola, instead using barley and oats.\n\n\"We are trying to choose crops that will give us a shorter growing season and a bit cheaper to grow with the most potential,\" he said.\n\nAccording to the Bureau of Meteorology, there is a 20 per cent chance of exceeding the median rainfall in Marrar in May, which is 5.9mm.\n\nIt is expected to rise to 52 per cent in June, with a historical median chance of 48.9mm of rain.\n\nThere is a 48 per cent chance of Wagga Wagga exceeding its medium rain fall next month, which is 53.3mm.\n\nBen Langtree says he hopes for rain and better conditions. (ABC News: Emily Doak)\n\nDespite the tough conditions, Mr Langtree said it was not too late for the season to turn around.\n\n\"Rain sooner than later would be great and it would get us back on track,\" he said.\n\n\"Every farmer is a gambler, they take a fair bit of risk every year so this is just a different type of risk for us now.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-20/asx-markets-business-live-news-may-20-rba-may-rates-decision/105309380",
        "title": "Live: RBA interest rate cut considered a near certainty",
        "publish_date": "Mon, 19 May 2025 21:30:32 +0000",
        "category": "finance",
        "authors": [
            "Stephanie Chalmers",
            "Emily Stewart",
            "Gareth Hutchens"
        ],
        "text": "Westpac's chief economist Luci Ellis is forecasting a 0.25 percentage point cut today, with two further cuts this year.\n\nThe former RBA Assistant Governor Luci Ellis told Kirsten Aiken on The Business that the cuts are likely to come in August and November.\n\n\"We think the Reserve Bank's still concerned about lingering inflation pressures so they won't be in a hurry even though the economic situation is looking worse,\" she said.\n\nThe economic teams at the big four banks have divergent views, with forecasts varying between three and five cuts in the next 12 months.\n\nLuci Ellis says part of that's because of different takes on the risks around the global economy, but also different interpretations of how the RBA is seeing the world.\n\n\"We've had a good six or nine months where the Reserve Bank has been very hawkish on inflation risks. It's trying to fine tune the inflation result to show a sustained forecast at 2.5 per cent,\" she said. \"One of the reasons they were so hawkish in February was their forecast said trimmed mean inflation is going to be stuck at 2.7 instead of 2.5 (per cent) and their interpretation on the statement on the conduct of monetary policy says you should be aiming for the midpoint of the target range which is 2.2 (per cent). \"So, I think you know, not everybody is sort of keying into those particular nuances of how the RBA is seeing the world, or maybe they're sort of putting more trust in the idea that the RBA will change its mind.\"\n\nLuci Ellis explains the RBA is also out of consensus in terms of its February forecasts around consumption growth.\n\nWestpac is expecting household consumption to increase by 1.5% over calendar 2025, which is the median of the market forecasts.\n\n\"The February forecast from the RBA was 2.6. They're well out of consensus. They're very bullish about the tendency for people to pick up their spending. But that's not what we're seeing in our own Westpac DataX data. It's not what we're seeing in the ABS data,\" she said.\n\nYou can watch the full interview with Lucy Ellis here:",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/healthcare/it-took-six-years-to-diagnose-adele-with-endometriosis-a-50m-donation-aims-to-end-the-wait-20250514-p5lz80.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It took six years to diagnose Adele with endometriosis. A $50m donation aims to end the wait",
        "publish_date": "Tue, 20 May 2025 12:00:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Aubusson"
        ],
        "text": "An Australian study estimated 50 per cent of cases could be linked to a genetic risk and a meta-analysis, including 60,674 endometriosis cases and 701,926 controls, found 42 genetic regions associated with a risk of endometriosis. Having a mother or sister with endometriosis increases the likelihood of developing the condition by about 7 per cent. The endometriosis dilemma Endometriosis is a condition in which tissue similar to the lining of the uterus (called the endometrium) grows in other parts of the body, most commonly the pelvis. It can also spread through other organs, forming scar tissue and often causing severe pain and other distressing symptoms. One in three cases leads to infertility. An estimated one in nine girls and women in Australia has endometriosis. It’s one in seven among women aged 47 to 52 and hospitalisation rates for endometriosis among 20- to 24-year-olds have doubled in the past decade to 660 per 100,000 females. Investment in understanding the basic science of endometriosis is 30 years behind, leading to damaging delays in diagnosis (on average, eight years from symptom onset in Australia) and effective treatments. The economic burden of endometriosis in Australia is an estimated $7.4 billion to $9.7 billion annually. Adele Taylor described her abdomen as a pin cushion of cuts and laparoscopy holes from the 16 surgeries to burn, cut and laser the cysts and lesions of her fast-growing endometriosis. During her teenage years, her doctors had no explanation for the cysts and lesions. Since she was 13, she had shockingly painful periods, terrible bloating and heavy bleeding that seeped through her school uniforms.\n\n“I was one of those young girls who went to GPs and was told it was all in my head,” Taylor said. Her first surgery was booked only because the pain of an ovarian cyst was mistaken for appendicitis when she was 15. Taylor was diagnosed with endometriosis at 19, six years after she first experienced symptoms. The lesions had spread rapidly through several of her organs. Her 20s were characterised by pain and more surgeries. Hormone treatment made her nauseated and played havoc with her moods, threatening to derail a burgeoning corporate career. Adele Taylor’s treatment odyssey included 16 surgeries and hormone treatment that made her ill. Credit: Sitthixay Ditthavong Taylor’s gynaecologist told her not to put off having children since she may struggle to conceive. She gave birth to her daughter, Charley, in her early 30s. While Taylor breastfed, her endometriosis seemed to have paused only to “return with a vengeance”.\n\n“I had extensive surgery, which involved cutting away some of my organs, including my bowel, to attack it and remove the endo,” she said. “Scar-tissue-wise, it’s pretty awful in there.” Loading Under Abbott’s care, Taylor moved to a daily pain medication regimen aimed at treating the symptoms of her endometriosis with minimal surgery and lifestyle changes, including running, strength training and a balanced diet. “He was focused not only on treating the condition, but recognising I’d been through a pretty awful experience,” said Taylor, now an avid runner who recently completed the New York Half Marathon. “I will be on medication for the rest of my life [but] I’ve had good pain relief for a decade [and] almost seven years when I didn’t need surgery.”\n\nJess Taylor, chair of peak body the Australian Coalition for Endometriosis, characterised current endometriosis treatment as “throwing spaghetti at the wall and seeing what sticks in terms of treatment options”. “Having an entire institution dedicated to understanding the mechanisms of endo and all the systems it impacts across the body puts this condition on a whole new playing field,” she said. Professor Caroline Ford, the scientific director of UNSW’s AERI, with clinical director Professor Jason Abbott. Credit: Peter Rae AERI is expected to partner with top international scientists, clinicians, and philanthropists, focusing on genomic research, biobanks of endometriosis tissue, and advanced testing. Professor Caroline Ford, AERI’s scientific director, said the institute would build a strong evidence base to support doctors in offering personalised medical care for each endometriosis patient.\n\n“This substantial investment will allow researchers for the first time to build a solid understanding of endometriosis biology and pathogenesis that will lead to improved detection, management and treatment,” Ford said. UNSW said AERI was only possible with the $50 million donation by the Ainsworth family. Anna and her daughter Lily Ainsworth have both experienced the debilitating effects of the disease. Lily Ainsworth has lived with endometriosis since she was 15 years old, with daily chronic pain and severe, debilitating flare-ups that could last weeks. Anna and Lily Ainsworth at UNSW. Credit: UNSW “This reality is shared with millions of people living with endo around Australia and the world. We believe this can change,” Ainsworth said.\n\nLed by patriarch Len Ainsworth, founder of two of the world’s biggest pokies manufacturing companies, Aristocrat Leisure and Ainsworth Game Technology, the family is building a philanthropic legacy by donating tens of millions to institutions, universities, hospitals and art galleries. Loading UNSW has an Ainsworth Building in its engineering and manufacturing facility after a $10 million donation. UNSW academics, who declined to speak on record, are among critics of institutions that accept these donations. They say the family’s philanthropy should not overshadow the harms inflicted by pokies. Anti-gambling advocate Tim Costello said that when universities and other “powerful culture bearers and gatekeepers in society” take Ainsworth’s money, “gambling reform becomes so much harder”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/investors-are-chilled-now-but-trump-s-tariffs-and-debt-will-test-them-20250520-p5m0m0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Investors are chilled now, but Trump’s tariffs and debt will test them",
        "publish_date": "Tue, 20 May 2025 11:58:32 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The chances of elevated inflation and stagflation (higher inflation with lower economic growth) were greater than people thought, he warned. Yet, US asset prices were high and credit spreads (the differences in yields between securities with similar maturities but different risk levels) didn’t reflect the impact of a potential downturn. “Credit today is a bad risk,” Dimon said. “The people who haven’t been through a major downturn are missing the point about what can happen in credit.” “Credit today is a bad risk,” says JPMorgan CEO Jamie Dimon. Credit: AP In a significant economic downturn, lenders will not lend to companies that are perceived as risky, or demand they pay higher interest rates. The spreads between government bond yields, the most creditworthy companies and higher-risk companies would widen. Default rates and the numbers of corporate collapses would increase. With a recession, particularly a stagflationary one, companies would face higher borrowing costs to reflect the increased risk even as their sales and profitability come under pressure.\n\nMoody’s may only have been telling people what they already knew, or should have known, but its assessment of America’s deteriorating public finances ought to be unnerving investors - particularly as it appears that, after last-minute concessions from Congressional leaders, Trump’s “One, Big, Beautiful Bill Act” is likely to be endorsed by House Republicans. Loading The US, with deficits approaching $US2 trillion ($3.1 trillion) and government debt of $US36.2 trillion already, is facing the addition of another $US3 trillion to $US4 trillion or more of debt over the next decade as a result of the tax cuts and spending plans in that bill. The bond market will have to absorb that extra issuance of debt as well as the rolling-over of maturing debt, placing upward pressure on bond yields. That would in turn flow through to borrowing costs across the economy With the Biden administration’s Treasury Secretary Janet Yellen issuing mainly short-dated securities during Biden’s presidency and her successor in the Trump administration Scott Bessent pursuing a similar strategy to keep the pressure off the yields on longer-term bonds, the market’s appetite for US debt will be tested by the surge in supply from both the existing debt rolling over and the new debt flowing from the One, Big, Beautiful Bill.\n\nThe ability of the bond market to soak up the volume of debt heading its way will also be challenged by the aftershocks of Trump’s trade policies. Loading Tariffs are taxes on domestic consumption, whether felt directly by consumers or absorbed via lower profit margins by the importing companies. When their effects eventually show up, as they will, they will push the inflation rate up and the economic growth rate down. The increased deficits and debt could, therefore, coincide with a higher inflation rate and a slowing economy, even a Trump-induced recession. An increase in inflation and interest rates even as the economy is slowing is a recipe for something quite unpleasant. Trump, of course, doesn’t believe his beloved tariffs will impact inflation or growth because he continues to believe, or at least say, that they are paid by the exporting countries.\n\nThat’s despite a growing list of US companies warning that they are already experiencing cost pressures from the tariffs and will have to pass at least some of those costs onto their customers. “He (Trump) maintains the position that foreign countries absorb these tariffs,” the White House press secretary Karoline Leavitt said on Monday. Why then did Trump attack Walmart at the weekend for warning that it would have to raise its prices to reflect the impact of the tariffs? “Walmart should STOP trying to blame the tariffs as the reason for raising prices throughout the chain. Walmart made BILLIONS OF DOLLARS last year, far more than expected. Between Walmart and China they should...EAT THE TARIFFS, and not charge valued customers ANYTHING. I’ll be watching and so will your customers,” he posted on social media.\n\nIf the tariffs are actually absorbed by foreign countries, why would Walmart or China have to “eat” anything? The reality is, as Walmart and other US retailers are only too aware, that they are the ones importing the goods and, even if the exporters are prepared to absorb something of the tariff impacts, they and their customers will be the ones bearing the brunt of the costs. That’s been the history of trade wars. Loading Walmart’s profits haven’t surprised anyone and, in the very competitive US retail environment, aren’t extraordinary. The group’s profit margin in the first quarter of this year was about 2.7 per cent and its retail margin (earnings before interest and tax relative to sales) a modest 4.3 per cent. The world’s biggest retailer is always going to post profits in the multi-billions of dollars, but it doesn’t have the profit margins to absorb the tariff impacts in their entirety. Even if it did, the lower profitability would probably mean less employment and investment by the company and lower dividends and a lower share price for shareholders.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/victoria/victorian-state-budget-2025-live-blog-updates-when-what-times-treasurer-jaclyn-symes-key-policies-healthcare-hospitals-surplus-deficit-cost-of-living-jacinta-allan-government-20250520-p5m0n7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victorian budget 2025 LIVE: Victoria to post rare surplus, but debt continues to mount; CFA firefighters protest levy increase",
        "publish_date": "Tue, 20 May 2025 11:56:27 +1000",
        "category": "finance",
        "authors": [
            "Lachlan Abbott"
        ],
        "text": "Thousands of protesters are about to disband from the steps of Victorian Parliament after cheering on more than an hour’s worth of speeches.\n\nThe speakers, which ranged from MPs to volunteer firefighters, spoke of the impact the increased fire services levy will have across regional communities.\n\nProtesters on the steps of Victorian Parliament on Tuesday morning. Credit: Luis Ascui\n\nThe crowd shouted “scrap the tax” and cheered at the promise to vote out the Allan government in 2026.\n\nThe crowd has been told that several CFA volunteers have resigned as a result of the levy.\n\nAn entire brigade, in charge of a region spanning 1 million acres, has gone on strike since legislation passed.\n\nSome protesters woke up at 1am to travel to the steps of parliament.\n\nThe scene outside Victorian Parliament on Tuesday morning. Credit: Luis Enrique Ascui\n\nLawloit farmer John Bennet lashed the Allan government for “political spin and misinformation”, and said the government’s promise that CFA volunteers would be exempt from the tax is “abject nonsense”.\n\n“We’ll be up for a small rebate on a tiny portion of our land. That will have the same impact on a farming family as taking one litre of milk out of a loaded supermarket trolley will have on your grocery bill,” he said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/i-hate-it-paul-gallen-wishes-he-never-punched-nate-myles-20250520-p5m0mi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I hate it’: Paul Gallen wishes he never punched Nate Myles",
        "publish_date": "Tue, 20 May 2025 11:55:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "As Paul Gallen was being inducted into the NSW Rugby League Hall of Fame on Monday night, video footage of him repeatedly punching Queenslander Nate Myles in the head during a 2013 Origin game was beamed on a giant TV screen inside The Star.\n\nGallen cringed when he spotted the moment, and sheepishly smiled at the two other inductees sitting on stage, fellow Cronulla legend Andrew Ettingshausen and Balmain’s Benny Elias.\n\nPaul Gallen punches Nate Myles. Credit: Nine\n\nThe night Gallen landed a barrage of blows on Myles’ chin also signalled the end of punching in the NRL, with the governing body ruling the next day that any player who threw a punch would be sent to the sin bin.\n\nGallen rarely speaks about the incident, and 12 years on “hates” the fact it happened and is still a hot topic at this time of year.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/road-tripping-through-gippsland-stop-at-this-tiny-cafe-for-old-school-jaffles-homemade-sausage-rolls-and-more-20250520-p5m0oo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Road tripping through Gippsland? Stop at this tiny cafe for old-school jaffles, homemade sausage rolls and more",
        "publish_date": "Tue, 20 May 2025 11:51:55 +1000",
        "category": "finance",
        "authors": [
            "Emily Holgate"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nGrab brekkie for the road and local produce from Snaffle in Cann River.\n\n1 / 6 Homemade sausage rolls are available in the cabinet. Supplied 2 / 6 Outside the Cann River cafe. Supplied 3 / 6 Egg and bacon jaffle at Snaffle in Cann River. Supplied 4 / 6 Cheeseburger jaffle. Supplied 5 / 6 Ready-made wraps, salads, sandwiches and cakes are available to order. Supplied 6 / 6 Inside the shop, where you can also purchase local jams, honey and flowers. Supplied Previous Slide Next Slide\n\nCafe$$$$\n\nIn the tiny town of Cann River, Snaffle is the perfect pit stop for those passing through the Gippsland region – perhaps returning from a coastal camping trip in Mallacoota or Merimbula, or tackling the lengthy road trip back to Melbourne from Sydney.\n\nThe menu revolves around loaded jaffles – typically only $10 a pop, more or less – including a brekkie number packed with egg, bacon, gooey cheese, native pepperberry chutney and caramelised onion, or a smokey baked bean and cheese mix. There are plenty of vegan options, too.\n\nJaffles aside, there’s also smoothies and a cabinet filled with snacks like homemade sausage rolls, plus ready-made salads, wraps, sandwiches and baked goods. Coffee is by Code Black.\n\nStocking up on camping staples or looking for some goodies to take back home? Snaffle’s fridges are filled with local produce including cheeses, deli goods, milk and more, while shelves are stocked with local honey, jams, preserves and flowers, all available to purchase.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/budget-bangers-30-warming-meals-that-start-with-a-sausage-20250519-p5m0iw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Budget bangers: 30 warming meals that start with a sausage",
        "publish_date": "Tue, 20 May 2025 11:46:14 +1000",
        "category": "sports",
        "authors": [],
        "text": "You have reached your maximum number of saved items.\n\nRemove items from your saved list to add more.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/asia/why-albanese-s-detour-to-visit-australia-s-best-friend-matters-20250519-p5m0j7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A good friend in troubled seas: Why Albanese’s Singapore visit matters",
        "publish_date": "Tue, 20 May 2025 11:32:42 +1000",
        "category": "finance",
        "authors": [
            "Zach Hope"
        ],
        "text": "If the massive SunCable project works out, the two nations will also be connected by a 4300-kilometre underwater cable sending Northern Territory sunlight to Singapore in the form of green electricity. The ruling People’s Action Party (PAP) last year granted SunCable a conditional licence to import Australian electricity from 2035. More broadly, Singapore’s geography at the juncture of strategic waters is as significant now, if not more so in these unpredictable times, as it was when Sir Stamford Raffles set up shop more than 200 years ago. Playing a smart, middle-power role, Singapore maintains good relationships with both China and the US and has long been a beacon of stability among its regional neighbours, which are troubled with coups, corruption and crisis. It is a good friend to have in troubled seas. Albanese’s visit is short, however. He’ll spend only a couple of hours in Singapore before flying to Canberra on Tuesday night.\n\nLoading Australia and Singapore have both escaped US President Donald Trump’s “Liberation Day” tariff calls with a 10 per cent flat rate. Still, global trade is Singapore’s heartbeat, and any disruption to the pre-Trump status quo will be keenly felt here. Wong, who is paid a salary of $2.6 million, is still little known outside his homeland. But he seems a considered and mild-mannered kind of guy. Like Australia, he did not retaliate with further tariffs on the US. And like Albanese, he ventured to say the tariffs were “not actions one does to a close friend”. As a politician, he also played on the US economic threat to keep would-be straying voters in the arms of what they’ve always known. The two PMs have at least several years of clear electoral air to build their personal relationship and strategies for dulling the unwieldy Trumpian knife.\n\nAlbanese and Wong were both elected on May 3. It was Wong’s first election since taking the job from Lee Hsien Loong last year. With a strong showing (Wong’s PAP won about 65 per cent of the popular vote), the prime ministership is now essentially his for as long as he wants to keep it and the party lets him. Wong, 52, is only Singapore’s fourth prime minister in six decades of independence. Lee held the post for 20 years, long enough for Australia to cycle through seven prime ministers. Wong and Albanese at the APEC Summit in Peru in November. Credit: Alex Ellinghausen Both nations’ open economies are deeply wedded to international norms, but the styles of democracy are vastly different. Singapore is dominated by the undefeated PAP – the product, in part, of its good track record, expert gerrymandering, a compliant mainstream media and the party’s suppression of free speech and protests. Wong has shown no inclination to mess with the winning formula. The main opposition party fielded only 26 candidates for 97 seats in parliament in the May 3 election. It won 10. Again, the PAP will be able to do as it pleases.\n\nLoading Don’t expect Albanese to raise any of this. But he will point out that Australia was among the first nations to establish diplomatic ties with Singapore when it separated from Malaysia 60 years ago this year. In that time, “the little red dot” has grown into a wealthy middle-power of influence, one of the great financial hubs and ports of the world. Singapore and Australia are awash in bilateral and joint multilateral agreements ranging from free trade to defence. One of them, the Australia-Singapore Military Training Initiative, will have at its peak 14,000 Singaporean troops training for more than four months of the year in Queensland. Another deal, the comprehensive strategic partnership, is due to be renewed this year and could be the subject of announcements on Tuesday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/gallen-shows-up-sbw-at-pre-fight-presser-20250520-p5m0ox.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gallen shows up SBW at pre-fight presser",
        "publish_date": "Tue, 20 May 2025 11:23:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "Gallen shows up SBW at pre-fight presser\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/lockyer-backs-madge-amid-taupau-saga-20250520-p5m0ou.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lockyer backs Madge amid Taupau saga",
        "publish_date": "Tue, 20 May 2025 11:18:41 +1000",
        "category": "finance",
        "authors": [],
        "text": "Lockyer backs Madge amid Taupau saga\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-to-watch-the-europa-league-final-tottenham-v-manchester-united/r42am8dci",
        "title": "How to watch the Europa League final: Tottenham v Manchester United",
        "publish_date": "Tue, 20 May 2025 01:26:35 +0000",
        "category": "sports",
        "authors": [],
        "text": "Ange Postecoglou will be hoping to guide Tottenham to their first trophy since 2008 as his side takes on Manchester United in the final of the Europa League on Thursday morning (AEST).\n\n\n\n\n\nThe Australian manager took charge of the Premier League side in 2023, finishing 5th in his first season. But this season has been poor in comparison, with Spurs 17th in the table with one game left to play.\n\n\n\n\n\nThe Europa League campaign has been a rare positive for Tottenham, who will be taking on Manchester United, who are also having a poor season and are currently 16th.\n\n\n\nHow can I watch the Europa League final? What channel is it on?\n\nThe final kicks off at 5am AEST in Bilbao, Spain, and will be the third final in the competition to feature two English teams.\n\n\n\n\n\n\n\nIt will be broadcast on 9Gem and 9Gem HD, starting at 4.30am AEST on Thursday.\n\n\n\nHow did Tottenham get to the Europa League final?\n\nSpurs finished fourth in the Europa League group stage — one spot below Manchester United — and went on to defeat Dutch side AZ Alkmaar, Germany's Eintracht Frankfurt and Norway's FK Bodø/Glimt in the knockout stages.\n\n\n\n\n\nUnited saw off Real Sociedad, Lyon and Athletic Bilbao as they made their way to the final.\n\n\n\nTottenham manager Ange Postecoglou smiles after his team's win over Norwegian side Bodø/Glimt that put them in the Europa League final. Source: AP / Mats Torbergsen\n\nWhat will happen to Postecoglou?\n\nTottenham's league performances have placed pressure on Postecoglou, but Micky Hazard, part of the club's 1981-82 FA Cup final-winning team, said the club should stick with the Australian if the side win.\n\n\n\n\n\nHe told Reuters: \"I think it's important that they get out of that cycle, win or bust, win or bust, win or bust.\"\n\n\n\n\n\n\"Look through history and you look at Alex Ferguson. He took five or six years to win things with Manchester United [Ferguson's first trophy, the 1990 FA Cup, came three-and-a-half years after he joined the club] and then he won things non-stop. Success — it's not overnight, and the longer it takes to get it, the more solid the foundation is.\n\n\n\n\n\n\"Alex Ferguson built on his first five years of not winning a trophy by winning everything for the next 20 years.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-rba-is-expected-to-cut-rates-it-could-stretch-record-high-housing-unaffordability/9s3gzgsp5",
        "title": "RBA rate decision: A cut today could worsen Australia's 'record high' housing unaffordability",
        "publish_date": "Mon, 19 May 2025 19:35:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points The RBA is anticipated to reduce the cash rate from 4.1 to 3.85 per cent.\n\nRate cuts can lead to moderate increases in property prices according to a market analyst.\n\nDarwin and Melbourne remain the most affordable capitals considering median income and property prices.\n\nThe Reserve Bank of Australia (RBA) is widely anticipated to reduce the cash rate target today by at least 0.25 percentage points.\n\n\n\n\n\nWhile some economists and banks have predicted a rate cut of 0.25 per cent at the RBA's board meeting today, NAB is forecasting twice that much at 0.5 per cent. On 16 May, the ASX indicated a 96 per cent expectation of an interest rate cut — from the current 4.10 per cent to an expected figure of 3.85 per cent.\n\n\n\n\n\nIn the March quarter, the Consumer Price Index (CPI) stood at 2.4 per cent and the trimmed mean inflation at 2.9 per cent — figures that fall within the 2-3 per cent range the RBA considers healthy inflation, thus raising expectations of a rate cut.\n\n\n\n\n\nWith housing affordability being closely linked to the RBA's decisions on the cash rate, this much-anticipated decision could influence house prices for those looking to buy property in the near future.\n\n\n\n\n\nFrom property market watchers to keen buyers — anyone with an interest in Australia's real estate sector will be looking for an answer to the big question: Will a rate cut make housing more affordable?\n\n\n\nSource: SBS News\n\nWill a rate cut drive house prices up?\n\nProperty market analyst Tim Lawless said a rate cut can be a downside for affordability when you compare dwelling values to income.\n\n\n\n\n\nHe told SBS News that when prospective home owners can to borrow more after a rate cut, it historically puts pressure on the housing market.\n\n\n\n\n\n\"We probably will see some additional upward pressure on housing prices as interest rates come down,\" the head of research at Cotality, formerly CoreLogic, said.\n\n\n\n\n\n\"We're already seeing dwelling dollars relative to household incomes quite stretched. In fact, at record highs, we're likely going to see that stretched affordability potentially worsen further from here.\"\n\n\n\nREAD MORE What will be on the RBA’s mind as it weighs a rate cut next week\n\nHe added consumers are also \"increasingly pessimistic\", according to consumer confidence readings, which suggests home buyers feel somewhat locked out of the property market.\n\n\n\n\n\n\"There's a clear relationship between confidence and housing markets,\" he said.\n\n\n\n\n\n\"Buying a home is a very high-commitment decision, and if you're more confident in your ability to hold a job and pay down your mortgage or get financing, then you're probably more willing to make the high-commitment decision like that.\"\n\n\n\nWhere are the 'healthy' property markets?\n\nHome buyers in some cities could be feeling more confident than others, as affordability varies widely from state to state.\n\n\n\n\n\nLawless said the most common metric to determine housing affordability is to compare the value of a property with household income as a ratio, also known as the dwelling value to income ratio.\n\n\n\n\n\n\"Melbourne's got a ratio of seven, which simply means if you're buying into that market and you have the median household income and you buy the median-priced dwelling, you're spending about seven times your gross annual income,\" he said.\n\n\n\n\n\n\"Melbourne's down towards the bottom of the pack in terms of that affordability ratio, which is a very healthy thing.\"\n\n\n\nIn comparison to Melbourne, most of Australia's capital cities are less affordable by the same measure.\n\n\n\n\n\nSydney had the highest ratio of 9.8, followed by Adelaide on 9, Brisbane on 8.3, Perth on 7.4, and Hobart on 7.2.\n\n\n\n\n\nMore affordable than Melbourne were the ACT at 6.1 and Darwin at 3.9.\n\n\n\nHow much could you save monthly if the rate is cut?\n\nIf you already have a mortgage, a rate cut of 0.25 percentage points could make a difference to your household budget if the rate stays the same or continues to fall in coming months.\n\n\n\n\n\nAn owner-occupier with a $500,000 loan could save around $76 per month, according to data from the financial comparison website Canstar.\n\n\n\n\n\nA rate cut can also be a good opportunity to see what lenders are offering customers on a variable mortgage loan, according to Sally Tindall, data insights director at financial comparison site Canstar.\n\n\n\nCredit: SBS News Doing research ahead of time on the offerings of different banks can be a \"bargaining chip\" in negotiations,\" she said.\n\n\n\n\n\n\"For many people, even in the first year or two, the savings you could potentially make would outweigh the effort and the cost of refinancing,\" she told SBS News.\n\n\n\n\n\nBut there can be fees you owe your current leader should you switch to a different bank.\n\n\n\n\n\nSome banks will charge switch fees or have other costs when changing providers.\n\n\n\n\n\nThe information in this article is general in nature and is not intended as financial advice. You should consult with a licenced professional to make the decisions that are right for you.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/william-goodge-becomes-fastest-runner-to-cross-australia-on-foot/dx2p8pjx7",
        "title": "Ultra-endurance athlete becomes fastest runner to cross Australia on foot",
        "publish_date": "Mon, 19 May 2025 10:40:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "An ultra-endurance athlete has just smashed the world record for running across Australia after spending more than a month on foot.\n\n\n\n\n\nSpurred on by his mother's battle with cancer, and with his father by his side, William Goodge crossed the finish line in Sydney just after 4pm on Monday.\n\n\n\n\n\nIt brings an end to 35 days of pounding the pavement, striding the equivalent of two and a half marathons per day.\n\n\n\n\n\nThat's four days quicker than previous record holder, Chris Turnbull, who completed the 3800km feat in 39 days in 2023.\n\n\n\n\n\nThe 31-year-old Brit crossed the finish line at Bondi Beach, making his massive run a new Guinness World Record.\n\n\n\nREAD MORE Cool Runnings: How Covid birthed Sydney Marathon boom\n\nGoodge set out from Cottlesloe Beach in Perth on April 15, averaging more than 100km per day at about seven and a half minutes per kilometre.\n\n\n\n\n\n\"Done a run in Centennial Park,\" he said in a video posted to social media just moments before finishing.\n\n\n\n\n\n\"What's up!?\" he shouted to the hundreds of runners behind him who turned out to run the last five and 10 kilometres with him.\n\n\n\nWilliam Goodge ran from Cottesloe Beach in Western Australia to Bondi Beach in Sydney. Source: AAP / PR Image / William Goodge \"It's obviously been quite the journey ... we start before the sun comes up and finish when the sun's gone down,\" he previously told AAP.\n\n\n\n\n\n\"I've seen every one of your famous animals, other than sharks and crocodiles, but unfortunately, a lot of them have been dead on the side of the road.\"\n\n\n\n\n\nAfter crossing the line he was handed a bunch of flowers which he placed at the shoreline in memory of his late mother who passed away from cancer in 2018.\n\n\n\n\n\n\"She was the most special person in my life ... she passed away seven and a half years ago to cancer,\" he said.\n\n\n\n\n\nThroughout the run, Mr Goodge has raised money for the Cancer Council of Australia in honour of his mother Amanda.\n\n\n\nREAD MORE Are running clubs the new dating apps? This trend has some groups concerned\n\nGoodge said he used his grief and the strength his mother showed while fighting the disease to motivate him to do something positive instead of \"waving the white flag\".\n\n\n\n\n\n\"She would be proud of everything I've done. She'd also be concerned,\" he said with a chuckle.\n\n\n\n\n\nThe punishing run has tested Goodge.\n\n\n\n\n\n\"The first nine days trying to sort of acclimatise to what I was doing was a big challenge,\" he previously said.\n\n\n\n\n\n\"I wasn't sleeping at night and I had deep pain in my bones and things like hip flexors ... and mentally I was tossing and turning throughout the night, hallucinating a little bit, which isn't that fun.\"\n\n\n\nGoodge said he suffered multiple injuries as he crossed the country, including toenails falling off and one toe that's \"been rotting for the past probably a week\".\n\n\n\n\n\n\"Ironically, the knees have felt OK. They've been very solid,\" he said.\n\n\n\n\n\nGoodge, who celebrated his birthday on the Nullarbor Plain during the run, is also the fastest Brit to run across the US.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/albanese-meets-with-world-leaders-on-the-sidelines-of-the-popes-inaugural-mass/xza4kk3ng",
        "title": "Albanese meets with world leaders on the sidelines of the Pope's inaugural mass",
        "publish_date": "Mon, 19 May 2025 08:45:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nOn the sidelines of the historic inaugural mass...\n\n\n\n\n\nAnthony Albanese has met face-to-face with Ukraine's President, Volodomyr Zelenskyy for the first time since 2023, confirming Australia's continuing military support.\n\n\n\n\n\n\"The Australian government's position, that I lead, is very supportive of your struggle. We have tanks that are on the way at the moment, which is a very positive initiative, we've provided now about 1.5 billion dollars in support.\"\n\n\n\n\n\nMr Zelenskyy thanked Mr Albanese for the ongoing support, but urged Australia to apply further sanctions on Russia.\n\n\n\n\n\n\"Together we can really move this situation closer to peace, through applying pressure on Russia. We are very thankful for sanctions, I'd also like to raise this topic with you, which is very important, to put more pressure, more sanctions on Russia.\"\n\n\n\n\n\nEarlier, Mr Albanese met with European Union President, Ursula Von Der Leyen, who raised the prospect of a formal defence pact between the EU and Australia.\n\n\n\n\n\n\"We do not only see you as a trading partner, we also see you as a strategic partner. We'd like to broaden this strategic partnership. For example, we have signed defence agreements with South Korea and with Japan, soon with the UK, we would be very pleased if we could build a strategic and defence partnership, too.\"\n\n\n\n\n\nMr Albanese focused on Australia's strong economic relationship with the E-U in his own comments, a focus which reflects Australia's ongoing efforts to carve out a trade agreement with the E-U.\n\n\n\n\n\nOn the question of strengthening Australia's defence relationship with the EU, Mr Albanese responded cautiously, later telling reporters no further detail had been provided.\n\n\n\n\n\n\"This was just a suggestion that Ursula Von Der Leyen raised, there was no detail further, it was really just an assertion of Europe's values being consistent with Australia's values, and in what ways could be explored further defence cooperation.\"\n\n\n\n\n\nMr Albanese also spoke with Canadian Prime Minister Mark Carney, German Chancellor Friedrich Merz and British Deputy Prime Minister Angela Rayner.\n\n\n\n\n\nAnd, while he did not meet with U-S Vice President J-D Vance, who also attended the inauguration, he did have a brief conversation with the man of the moment, Pope Leo, in St Peter's Basilica after the mass.\n\n\n\n\n\nMr Albanese, who was raised Catholic, says his meeting with the new pontiff was a very positive one.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/energyaustralia-admits-offsets-not-the-most-effective-way-to-cut-emissions-ends-go-neutral/mbkabm7t3",
        "title": "EnergyAustralia admits offsets 'not the most effective way’ to cut emissions, ends Go Neutral",
        "publish_date": "Mon, 19 May 2025 08:13:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "EnergyAustralia will stop offering its \"Go Neutral\" carbon offset product after admitting offsets \"do not prevent or undo the harms caused by burning fossil fuels\".\n\n\n\n\n\nThe decision follows a 2023 lawsuit from the advocacy organisation Parents for Climate, which alleged the carbon offset product was misleading and deceptive and EnergyAustralia engaged in \"greenwashing\".\n\n\n\n\n\nOn Monday, the case was settled in the Federal Court, with the energy giant acknowledging that offsets weren't the most effective way to reduce emissions and may have given customers a false impression of environmental benefit.\n\n\n\n\n\nGreenwashing is when a company exaggerates or misrepresents the environmental benefits of its products and practices, often to appear more environmentally friendly than it is.\n\n\n\nCarbon offsets 'do not prevent or undo harms' caused by fossil fuels\n\nIn a statement release on Monday as part of the settlement, EnergyAustraia said it \"accepts the scientific consensus that these 'offsets' do not indefinitely remove greenhouse gas emissions from burning fossil fuels, because carbon is stored in plants for a substantially shorter time than those emissions remain in the atmosphere\".\n\n\n\n\n\n\"While high-quality carbon offsets may play a role for hard-to-abate residual emissions, it is important for organisations to provide clear and transparent information to consumers on where and how offsets have been used and what those offsets can achieve.\"\n\n\n\n\n\nThe Go Neutral scheme was introduced in 2016 and allowed residential customers to pay to offset emissions associated with their electricity and gas use.\n\n\n\nBut the energy provider has now admitted that it cannot fully cancel out or prevent the harm caused by fossil fuels.\n\n\n\n\n\nEnergyAustralia's chief customer officer, Kate Gibson, said a decision was made to withdraw the Go Neutral product from the market in July 2024.\n\n\n\n\n\n\"In recent years, questions have begun to emerge about the benefits of carbon offsets, including those offered as part of certified Government programs such as Climate Active and whether they are having the impact intended,\" Gibson said.\n\n\n\n\"While EnergyAustralia participated in the Climate Active certified carbon offset program in good faith, today EnergyAustralia accepts that there is legitimate public concern about the efficacy of these programs.\"\n\n\n\n\n\n\"Carbon offsets should not be used to delay or diminish the important work that needs to be done to actively decarbonise.\n\n\n\n\n\n\"EnergyAustralia is now focused on more effective ways of helping its customers to directly reduce the emissions associated with their energy use.\"\n\n\n\nParents for Climate CEO Nic Seton says the acknowledgement will \"set a new standard\" for the way carbon offset products are sold to customers. Source: AAP / Bianca De Marchi\n\n'Will set a new standard'\n\nParents for Climate said the acknowledgement from the energy giant was a \"major win\" and the \"first legal case of its kind in the country to protect the public from 'carbon neutral' greenwashing\".\n\n\n\n\n\n\"Not only does this acknowledgement send a powerful message that the era of unchecked greenwashing is over, but it’s incredibly reassuring to see the commitment from one of the largest energy retailers in the country to want to do better for their customers and the climate,\" Nic Seton, CEO of Parents for Climate, said in a statement.\n\n\n\n\n\n\"This isn't just about EnergyAustralia — it's about holding companies to a higher standard across the board.\n\n\n\n\n\n\"Greenwashing isn’t harmless. It’s costing families money, delaying climate action, and eroding trust.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/asx-eight-day-winning-streak-ends-as-us-credit-rating-cut/4rwb00smp",
        "title": "ASX eight day winning streak ends, as US credit rating cut",
        "publish_date": "Mon, 19 May 2025 07:15:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/we-want-them-to-pay-union-seeks-121-million-fine-for-qantas-over-sacking-workers/hqpm2wtvi",
        "title": "'We want them to pay': Union seeks $121 million fine for Qantas over sacking workers",
        "publish_date": "Mon, 19 May 2025 06:50:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Qantas should be forced to pay the maximum penalty of $121 million for illegally outsourcing the roles of 1,800 ground workers, to send a strong message to all companies, a union says.\n\n\n\n\n\nJustice Michael Lee is set to decide the penalty Qantas must pay after three days of hearings that started on Monday in the Federal Court in Sydney.\n\n\n\n\n\nOutside court, Transport Workers Union (TWU) national secretary Michael Kaine said the hearing was the beginning of the end of \"a protracted, brutal, distressing set of litigation\" that started in 2020 after Qantas sacked the workers during the COVID-19 pandemic.\n\n\n\nWhat is the case against Qantas?\n\nThe TWU started a case in the Federal Court in 2020 over the outsourcing of workers during the COVID-19 pandemic.\n\n\n\n\n\nQantas appealed the case all the way to the High Court, which unanimously upheld the Federal Court's finding it had breached the Fair Work Act by outsourcing the workers, preventing them from accessing industrial rights to collectively bargain and take protected industrial action.\n\n\n\nLast October, Lee ordered Qantas to pay $120 million to the workers as compensation for their economic loss, pain and suffering, and the TWU is seeking that he impose the maximum penalty of $121 million.\n\n\n\n\n\n\"We have to send a very strong, clear signal to Qantas and every other company in Australia that this can never, ever happen again to any Australian worker,\" Kaine said.\n\n\n\nWhat has Qantas said?\n\nIn court, Qantas chief people officer Catherine Walsh told Lee that: \"hopefully you'll see from the size of the compensation payment that, in fact, we are very sorry\".\n\n\n\n\n\n\"We do wish for the workforce that was impacted to be properly remediated and the compensation that has been agreed could go some way to deal with that,\" she said.\n\n\n\nThe Transport Workers Union said a strong message must be sent to Qantas. Source: AAP / Dan Himbrechts The compensation payments will start flowing to workers by the end of May, with a base payment of $10,000 for all workers.\n\n\n\n\n\nOutside court, Kaine said Qantas had: \"said sorry at two minutes to midnight\".\n\n\n\n\n\n\"They put it in an affidavit in these proceedings, because if you show contrition in penalty proceedings, the judge is bound to consider whether that should provide you with a discount on your penalty,\" he said.\n\n\n\n'It's changed their world'\n\nKaine said the penalty should reflect the \"human suffering, the family dislocation, the financial stress, the mental anguish, the family breakdowns\" directly resulting from Qantas' illegal conduct.\n\n\n\n\n\nAlso outside court, former Qantas worker Tony Hayes said the saga was \"never-ending\".\n\n\n\n\n\n\"It's been the same conversation for five years and we just want it to go away, but we want them to pay,\" he said.\n\n\n\nAnother former worker, Anne Guirguis, said she was with the company for 28 years and thought she would retire there.\n\n\n\n\n\n\"I've got colleagues that have lost houses and have been divorced, it's changed their world,\" she said.\n\n\n\n\n\nJustice Lee was expected to start hearing closing submissions from lawyers for Qantas and the TWU on Monday afternoon.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/watchdog-considering-whether-telstra-exaggerated-its-99-per-cent-coverage-claims/eam1fxq5s",
        "title": "Watchdog considering whether Telstra exaggerated its 99 per cent coverage claims",
        "publish_date": "Mon, 19 May 2025 03:03:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Vodafone has accused Telstra of exaggerating the scope of its network coverage.\n\nVodafone says Telstra made the claims for over a decade.\n\nTelstra has previously claimed to have network coverage for over 99 per cent of Australia.\n\nAustralia's biggest telecommunications company is facing allegations it misled customers by inflating claims of how far its network reached.\n\n\n\n\n\nIn claims levelled by rival telco Vodafone, Telstra is accused of \"dramatically\" overstating its reach by as much as 40 per cent — for more than a decade.\n\n\n\n\n\nVodafone, along with parent company TPG Telecom, said Telstra advertised its coverage based on a signal strength customers could only get if they used a special external antenna and a powered repeater that is usually installed on a vehicle or building.\n\n\n\n\n\nIts rival said network coverage claims should be based on signal strength a mobile phone would usually get without any extra devices.\n\n\n\n\n\nTPG group executive Kieran Cooney said the allegations were \"alarming\" and would have cost his company customers.\n\n\n\nA rival telco has accused Telstra of making misleading claims about its network coverage. Source: AAP / Dean Lewins \"It appears Telstra has tricked Australians into paying top dollar for coverage they simply can't get on a regular mobile phone,\" Cooney said.\n\n\n\n\n\n\"We are calling on them to make it right ... Telstra's conduct could have misled consumers into believing they can get coverage in places that require special equipment.\"\n\n\n\n\n\nSpecifically, TPG alleged Telstra claimed its mobile network was around one million square kilometres greater than it was because it based its figures on the use of an antenna and repeater.\n\n\n\n\n\nIt also said the network covered 99.7 per cent of the population based on using those same devices.\n\n\n\n\n\nTelstra recently updated its coverage claims to note that the 99.7 per cent mark required an external antenna.\n\n\n\nREAD MORE Telstra and Optus delay 3G shutdown as concerns over emergency calls remain\n\nIn a statement, Telstra stood by its network claims and measurements.\n\n\n\n\n\n\"No matter how you look at it, Telstra’s mobile network covers more of Australia than any other. Any suggestion that we've misled the public about the size of our network is completely untrue,\" a spokesperson said.\n\n\n\n\n\n\"Using our coverage maps, customers have always been able to determine our level of coverage with and without an external antenna, so they always knew what to expect based on the device they're using.\"\n\n\n\n\n\nThe telco said many customers in regional and remote areas benefit from using external antennas to maximise their coverage.\n\n\n\n\n\nThe spokesperson said this was why Telstra had used this as the basis for calculating the coverage footprint.\n\n\n\n\n\n\"Now that Vodafone has communicated to us how it's chosen to calculate its coverage footprint, to help the public understand the difference, we're highlighting that our three million square kilometres of coverage is based on using an external antenna,\" the spokesperson said.\n\n\n\n\n\n\"Using coverage maps, people can see the many towns, highways and places where we've invested to provide coverage and Vodafone hasn't. We're all for transparency and industry consistency in how we report coverage and would gladly put our maps up, side-by-side, so that Australians can see the difference.\"\n\n\n\nREAD MORE Why the consumer watchdog says you could be missing out on electricity savings\n\nTPG has reported Telstra to the consumer watchdog, called for a regulatory investigation and threatened legal action to stop the practice and potentially force a compensation payment.\n\n\n\n\n\nThe Australian Competition and Consumer Commission (ACCC) said it is considering the claims but would not confirm an investigation into Telstra.\n\n\n\n\n\n\"Mobile operators do not have a standardised or consistent approach to the coverage maps they publish via their websites and in advertising,\" an ACCC spokesperson said.\n\n\n\n\n\n\"We continue to urge mobile operators to provide comparable coverage maps … There is no legal requirement for mobile network operators to provide this, but the ACCC has been advocating for more transparency for consumers for some time.\"\n\n\n\n\n\nAustralians living in regional and remote areas would pay extra for Telstra service because they believe it is the only option for reliable coverage, a consumer group said.\n\n\n\n\n\nAustralian Communications Consumer Action Network chief executive Carol Bennett said: \"If this allegation is true — and the coverage advantage is not as big as people have been led to believe — regional consumers would be forgiven for feeling betrayed.\"\n\n\n\n\n\n\"When consumers are misled, markets are distorted, and trust is eroded.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/sbw-ready-to-unleash-on-gallen-20250520-p5m0pp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "SBW ready to unleash on Gallen",
        "publish_date": "Tue, 20 May 2025 12:04:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "SBW ready to unleash on Gallen\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/healthcare/it-took-six-years-to-diagnose-adele-with-endometriosis-a-50m-donation-aims-to-end-the-wait-20250514-p5lz80.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "It took six years to diagnose Adele with endometriosis. A $50m donation aims to end the wait",
        "publish_date": "Tue, 20 May 2025 12:00:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Aubusson"
        ],
        "text": "An Australian study estimated 50 per cent of cases could be linked to a genetic risk and a meta-analysis, including 60,674 endometriosis cases and 701,926 controls, found 42 genetic regions associated with a risk of endometriosis. Having a mother or sister with endometriosis increases the likelihood of developing the condition by about 7 per cent. The endometriosis dilemma Endometriosis is a condition in which tissue similar to the lining of the uterus (called the endometrium) grows in other parts of the body, most commonly the pelvis. It can also spread through other organs, forming scar tissue and often causing severe pain and other distressing symptoms. One in three cases leads to infertility. An estimated one in nine girls and women in Australia has endometriosis. It’s one in seven among women aged 47 to 52 and hospitalisation rates for endometriosis among 20- to 24-year-olds have doubled in the past decade to 660 per 100,000 females. Investment in understanding the basic science of endometriosis is 30 years behind, leading to damaging delays in diagnosis (on average, eight years from symptom onset in Australia) and effective treatments. The economic burden of endometriosis in Australia is an estimated $7.4 billion to $9.7 billion annually. Adele Taylor described her abdomen as a pin cushion of cuts and laparoscopy holes from the 16 surgeries to burn, cut and laser the cysts and lesions of her fast-growing endometriosis. During her teenage years, her doctors had no explanation for the cysts and lesions. Since she was 13, she had shockingly painful periods, terrible bloating and heavy bleeding that seeped through her school uniforms.\n\n“I was one of those young girls who went to GPs and was told it was all in my head,” Taylor said. Her first surgery was booked only because the pain of an ovarian cyst was mistaken for appendicitis when she was 15. Taylor was diagnosed with endometriosis at 19, six years after she first experienced symptoms. The lesions had spread rapidly through several of her organs. Her 20s were characterised by pain and more surgeries. Hormone treatment made her nauseated and played havoc with her moods, threatening to derail a burgeoning corporate career. Adele Taylor’s treatment odyssey included 16 surgeries and hormone treatment that made her ill. Credit: Sitthixay Ditthavong Taylor’s gynaecologist told her not to put off having children since she may struggle to conceive. She gave birth to her daughter, Charley, in her early 30s. While Taylor breastfed, her endometriosis seemed to have paused only to “return with a vengeance”.\n\n“I had extensive surgery, which involved cutting away some of my organs, including my bowel, to attack it and remove the endo,” she said. “Scar-tissue-wise, it’s pretty awful in there.” Loading Under Abbott’s care, Taylor moved to a daily pain medication regimen aimed at treating the symptoms of her endometriosis with minimal surgery and lifestyle changes, including running, strength training and a balanced diet. “He was focused not only on treating the condition, but recognising I’d been through a pretty awful experience,” said Taylor, now an avid runner who recently completed the New York Half Marathon. “I will be on medication for the rest of my life [but] I’ve had good pain relief for a decade [and] almost seven years when I didn’t need surgery.”\n\nJess Taylor, chair of peak body the Australian Coalition for Endometriosis, characterised current endometriosis treatment as “throwing spaghetti at the wall and seeing what sticks in terms of treatment options”. “Having an entire institution dedicated to understanding the mechanisms of endo and all the systems it impacts across the body puts this condition on a whole new playing field,” she said. Professor Caroline Ford, the scientific director of UNSW’s AERI, with clinical director Professor Jason Abbott. Credit: Peter Rae AERI is expected to partner with top international scientists, clinicians, and philanthropists, focusing on genomic research, biobanks of endometriosis tissue, and advanced testing. Professor Caroline Ford, AERI’s scientific director, said the institute would build a strong evidence base to support doctors in offering personalised medical care for each endometriosis patient.\n\n“This substantial investment will allow researchers for the first time to build a solid understanding of endometriosis biology and pathogenesis that will lead to improved detection, management and treatment,” Ford said. UNSW said AERI was only possible with the $50 million donation by the Ainsworth family. Anna and her daughter Lily Ainsworth have both experienced the debilitating effects of the disease. Lily Ainsworth has lived with endometriosis since she was 15 years old, with daily chronic pain and severe, debilitating flare-ups that could last weeks. Anna and Lily Ainsworth at UNSW. Credit: UNSW “This reality is shared with millions of people living with endo around Australia and the world. We believe this can change,” Ainsworth said.\n\nLed by patriarch Len Ainsworth, founder of two of the world’s biggest pokies manufacturing companies, Aristocrat Leisure and Ainsworth Game Technology, the family is building a philanthropic legacy by donating tens of millions to institutions, universities, hospitals and art galleries. Loading UNSW has an Ainsworth Building in its engineering and manufacturing facility after a $10 million donation. UNSW academics, who declined to speak on record, are among critics of institutions that accept these donations. They say the family’s philanthropy should not overshadow the harms inflicted by pokies. Anti-gambling advocate Tim Costello said that when universities and other “powerful culture bearers and gatekeepers in society” take Ainsworth’s money, “gambling reform becomes so much harder”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/investors-are-chilled-now-but-trump-s-tariffs-and-debt-will-test-them-20250520-p5m0m0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Investors are chilled now, but Trump’s tariffs and debt will test them",
        "publish_date": "Tue, 20 May 2025 11:58:32 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The chances of elevated inflation and stagflation (higher inflation with lower economic growth) were greater than people thought, he warned. Yet, US asset prices were high and credit spreads (the differences in yields between securities with similar maturities but different risk levels) didn’t reflect the impact of a potential downturn. “Credit today is a bad risk,” Dimon said. “The people who haven’t been through a major downturn are missing the point about what can happen in credit.” “Credit today is a bad risk,” says JPMorgan CEO Jamie Dimon. Credit: AP In a significant economic downturn, lenders will not lend to companies that are perceived as risky, or demand they pay higher interest rates. The spreads between government bond yields, the most creditworthy companies and higher-risk companies would widen. Default rates and the numbers of corporate collapses would increase. With a recession, particularly a stagflationary one, companies would face higher borrowing costs to reflect the increased risk even as their sales and profitability come under pressure.\n\nMoody’s may only have been telling people what they already knew, or should have known, but its assessment of America’s deteriorating public finances ought to be unnerving investors - particularly as it appears that, after last-minute concessions from Congressional leaders, Trump’s “One, Big, Beautiful Bill Act” is likely to be endorsed by House Republicans. Loading The US, with deficits approaching $US2 trillion ($3.1 trillion) and government debt of $US36.2 trillion already, is facing the addition of another $US3 trillion to $US4 trillion or more of debt over the next decade as a result of the tax cuts and spending plans in that bill. The bond market will have to absorb that extra issuance of debt as well as the rolling-over of maturing debt, placing upward pressure on bond yields. That would in turn flow through to borrowing costs across the economy With the Biden administration’s Treasury Secretary Janet Yellen issuing mainly short-dated securities during Biden’s presidency and her successor in the Trump administration Scott Bessent pursuing a similar strategy to keep the pressure off the yields on longer-term bonds, the market’s appetite for US debt will be tested by the surge in supply from both the existing debt rolling over and the new debt flowing from the One, Big, Beautiful Bill.\n\nThe ability of the bond market to soak up the volume of debt heading its way will also be challenged by the aftershocks of Trump’s trade policies. Loading Tariffs are taxes on domestic consumption, whether felt directly by consumers or absorbed via lower profit margins by the importing companies. When their effects eventually show up, as they will, they will push the inflation rate up and the economic growth rate down. The increased deficits and debt could, therefore, coincide with a higher inflation rate and a slowing economy, even a Trump-induced recession. An increase in inflation and interest rates even as the economy is slowing is a recipe for something quite unpleasant. Trump, of course, doesn’t believe his beloved tariffs will impact inflation or growth because he continues to believe, or at least say, that they are paid by the exporting countries.\n\nThat’s despite a growing list of US companies warning that they are already experiencing cost pressures from the tariffs and will have to pass at least some of those costs onto their customers. “He (Trump) maintains the position that foreign countries absorb these tariffs,” the White House press secretary Karoline Leavitt said on Monday. Why then did Trump attack Walmart at the weekend for warning that it would have to raise its prices to reflect the impact of the tariffs? “Walmart should STOP trying to blame the tariffs as the reason for raising prices throughout the chain. Walmart made BILLIONS OF DOLLARS last year, far more than expected. Between Walmart and China they should...EAT THE TARIFFS, and not charge valued customers ANYTHING. I’ll be watching and so will your customers,” he posted on social media.\n\nIf the tariffs are actually absorbed by foreign countries, why would Walmart or China have to “eat” anything? The reality is, as Walmart and other US retailers are only too aware, that they are the ones importing the goods and, even if the exporters are prepared to absorb something of the tariff impacts, they and their customers will be the ones bearing the brunt of the costs. That’s been the history of trade wars. Loading Walmart’s profits haven’t surprised anyone and, in the very competitive US retail environment, aren’t extraordinary. The group’s profit margin in the first quarter of this year was about 2.7 per cent and its retail margin (earnings before interest and tax relative to sales) a modest 4.3 per cent. The world’s biggest retailer is always going to post profits in the multi-billions of dollars, but it doesn’t have the profit margins to absorb the tariff impacts in their entirety. Even if it did, the lower profitability would probably mean less employment and investment by the company and lower dividends and a lower share price for shareholders.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/victoria/victorian-state-budget-2025-live-blog-updates-when-what-times-treasurer-jaclyn-symes-key-policies-healthcare-hospitals-surplus-deficit-cost-of-living-jacinta-allan-government-20250520-p5m0n7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victorian budget 2025 LIVE: Victoria to post rare surplus, but debt continues to mount; CFA firefighters protest levy increase",
        "publish_date": "Tue, 20 May 2025 11:56:27 +1000",
        "category": "finance",
        "authors": [
            "Lachlan Abbott"
        ],
        "text": "Thousands of protesters are about to disband from the steps of Victorian Parliament after cheering on more than an hour’s worth of speeches.\n\nThe speakers, which ranged from MPs to volunteer firefighters, spoke of the impact the increased fire services levy will have across regional communities.\n\nProtesters on the steps of Victorian Parliament on Tuesday morning. Credit: Luis Ascui\n\nThe crowd shouted “scrap the tax” and cheered at the promise to vote out the Allan government in 2026.\n\nThe crowd has been told that several CFA volunteers have resigned as a result of the levy.\n\nAn entire brigade, in charge of a region spanning 1 million acres, has gone on strike since legislation passed.\n\nSome protesters woke up at 1am to travel to the steps of parliament.\n\nThe scene outside Victorian Parliament on Tuesday morning. Credit: Luis Enrique Ascui\n\nLawloit farmer John Bennet lashed the Allan government for “political spin and misinformation”, and said the government’s promise that CFA volunteers would be exempt from the tax is “abject nonsense”.\n\n“We’ll be up for a small rebate on a tiny portion of our land. That will have the same impact on a farming family as taking one litre of milk out of a loaded supermarket trolley will have on your grocery bill,” he said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/i-hate-it-paul-gallen-wishes-he-never-punched-nate-myles-20250520-p5m0mi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I hate it’: Paul Gallen wishes he never punched Nate Myles",
        "publish_date": "Tue, 20 May 2025 11:55:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "As Paul Gallen was being inducted into the NSW Rugby League Hall of Fame on Monday night, video footage of him repeatedly punching Queenslander Nate Myles in the head during a 2013 Origin game was beamed on a giant TV screen inside The Star.\n\nGallen cringed when he spotted the moment, and sheepishly smiled at the two other inductees sitting on stage, fellow Cronulla legend Andrew Ettingshausen and Balmain’s Benny Elias.\n\nPaul Gallen punches Nate Myles. Credit: Nine\n\nThe night Gallen landed a barrage of blows on Myles’ chin also signalled the end of punching in the NRL, with the governing body ruling the next day that any player who threw a punch would be sent to the sin bin.\n\nGallen rarely speaks about the incident, and 12 years on “hates” the fact it happened and is still a hot topic at this time of year.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/road-tripping-through-gippsland-stop-at-this-tiny-cafe-for-old-school-jaffles-homemade-sausage-rolls-and-more-20250520-p5m0oo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Road tripping through Gippsland? Stop at this tiny cafe for old-school jaffles, homemade sausage rolls and more",
        "publish_date": "Tue, 20 May 2025 11:51:55 +1000",
        "category": "finance",
        "authors": [
            "Emily Holgate"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nGrab brekkie for the road and local produce from Snaffle in Cann River.\n\n1 / 6 Homemade sausage rolls are available in the cabinet. Supplied 2 / 6 Outside the Cann River cafe. Supplied 3 / 6 Egg and bacon jaffle at Snaffle in Cann River. Supplied 4 / 6 Cheeseburger jaffle. Supplied 5 / 6 Ready-made wraps, salads, sandwiches and cakes are available to order. Supplied 6 / 6 Inside the shop, where you can also purchase local jams, honey and flowers. Supplied Previous Slide Next Slide\n\nCafe$$$$\n\nIn the tiny town of Cann River, Snaffle is the perfect pit stop for those passing through the Gippsland region – perhaps returning from a coastal camping trip in Mallacoota or Merimbula, or tackling the lengthy road trip back to Melbourne from Sydney.\n\nThe menu revolves around loaded jaffles – typically only $10 a pop, more or less – including a brekkie number packed with egg, bacon, gooey cheese, native pepperberry chutney and caramelised onion, or a smokey baked bean and cheese mix. There are plenty of vegan options, too.\n\nJaffles aside, there’s also smoothies and a cabinet filled with snacks like homemade sausage rolls, plus ready-made salads, wraps, sandwiches and baked goods. Coffee is by Code Black.\n\nStocking up on camping staples or looking for some goodies to take back home? Snaffle’s fridges are filled with local produce including cheeses, deli goods, milk and more, while shelves are stocked with local honey, jams, preserves and flowers, all available to purchase.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/budget-bangers-30-warming-meals-that-start-with-a-sausage-20250519-p5m0iw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Budget bangers: 30 warming meals that start with a sausage",
        "publish_date": "Tue, 20 May 2025 11:46:14 +1000",
        "category": "sports",
        "authors": [],
        "text": "You have reached your maximum number of saved items.\n\nRemove items from your saved list to add more.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/asia/why-albanese-s-detour-to-visit-australia-s-best-friend-matters-20250519-p5m0j7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A good friend in troubled seas: Why Albanese’s Singapore visit matters",
        "publish_date": "Tue, 20 May 2025 11:32:42 +1000",
        "category": "finance",
        "authors": [
            "Zach Hope"
        ],
        "text": "If the massive SunCable project works out, the two nations will also be connected by a 4300-kilometre underwater cable sending Northern Territory sunlight to Singapore in the form of green electricity. The ruling People’s Action Party (PAP) last year granted SunCable a conditional licence to import Australian electricity from 2035. More broadly, Singapore’s geography at the juncture of strategic waters is as significant now, if not more so in these unpredictable times, as it was when Sir Stamford Raffles set up shop more than 200 years ago. Playing a smart, middle-power role, Singapore maintains good relationships with both China and the US and has long been a beacon of stability among its regional neighbours, which are troubled with coups, corruption and crisis. It is a good friend to have in troubled seas. Albanese’s visit is short, however. He’ll spend only a couple of hours in Singapore before flying to Canberra on Tuesday night.\n\nLoading Australia and Singapore have both escaped US President Donald Trump’s “Liberation Day” tariff calls with a 10 per cent flat rate. Still, global trade is Singapore’s heartbeat, and any disruption to the pre-Trump status quo will be keenly felt here. Wong, who is paid a salary of $2.6 million, is still little known outside his homeland. But he seems a considered and mild-mannered kind of guy. Like Australia, he did not retaliate with further tariffs on the US. And like Albanese, he ventured to say the tariffs were “not actions one does to a close friend”. As a politician, he also played on the US economic threat to keep would-be straying voters in the arms of what they’ve always known. The two PMs have at least several years of clear electoral air to build their personal relationship and strategies for dulling the unwieldy Trumpian knife.\n\nAlbanese and Wong were both elected on May 3. It was Wong’s first election since taking the job from Lee Hsien Loong last year. With a strong showing (Wong’s PAP won about 65 per cent of the popular vote), the prime ministership is now essentially his for as long as he wants to keep it and the party lets him. Wong, 52, is only Singapore’s fourth prime minister in six decades of independence. Lee held the post for 20 years, long enough for Australia to cycle through seven prime ministers. Wong and Albanese at the APEC Summit in Peru in November. Credit: Alex Ellinghausen Both nations’ open economies are deeply wedded to international norms, but the styles of democracy are vastly different. Singapore is dominated by the undefeated PAP – the product, in part, of its good track record, expert gerrymandering, a compliant mainstream media and the party’s suppression of free speech and protests. Wong has shown no inclination to mess with the winning formula. The main opposition party fielded only 26 candidates for 97 seats in parliament in the May 3 election. It won 10. Again, the PAP will be able to do as it pleases.\n\nLoading Don’t expect Albanese to raise any of this. But he will point out that Australia was among the first nations to establish diplomatic ties with Singapore when it separated from Malaysia 60 years ago this year. In that time, “the little red dot” has grown into a wealthy middle-power of influence, one of the great financial hubs and ports of the world. Singapore and Australia are awash in bilateral and joint multilateral agreements ranging from free trade to defence. One of them, the Australia-Singapore Military Training Initiative, will have at its peak 14,000 Singaporean troops training for more than four months of the year in Queensland. Another deal, the comprehensive strategic partnership, is due to be renewed this year and could be the subject of announcements on Tuesday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/gallen-shows-up-sbw-at-pre-fight-presser-20250520-p5m0ox.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gallen shows up SBW at pre-fight presser",
        "publish_date": "Tue, 20 May 2025 11:23:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "Gallen shows up SBW at pre-fight presser\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/prospector-makes-ripper-90-year-old-discovery-in-thick-aussie-bush-205947829.html",
        "title": "Prospector makes 'ripper' 90-year-old discovery in thick Aussie bush",
        "publish_date": "2025-05-19T20:59:47Z",
        "category": "finance",
        "authors": [],
        "text": "The seasoned gold hunter explained what signs to look for in the search for old homesteads.\n\nAngus James spotted this bluestone and then found this 1935 Centenary of Melbourne medallion nearby. Source: Gold Coin and Relics Australia\n\nTiny clues in the Australian bush have led a seasoned prospector to a massive haul of old relics buried in the dirt. The first sign European settlers had visited the area was a broken piece of porcelain lying in the dirt, but it was the bluestone slab that made it clear Angus James had found something bigger — the ruins of an old house.\n\nStone like that wasn’t natural to the site, around an hour’s drive west of the Victorian gold mining town of Ballarat, meaning someone around a century ago hauled it to the site. When Angus James wiped the dirt away, it was pretty clear it had once formed part of a fireplace.\n\n“It was very thick bushland. I was out in the middle of nowhere,” he told Yahoo News.\n\n“Often, when I come across remnants of old bluestone and bricks, they’re signs of houses or mudhuts.”\n\nADVERTISEMENT\n\nRelated: Aussie prospector reveals secret maps to find fortune\n\nSimple signs in bush that indicate long-lost houses\n\nLike Ballarat, the secret area Angus was prospecting in had been a gold mining region. Whenever there’s a spot where the diggings have been successful, there are usually signs of a house.\n\nAngus was excited to find a stash of old bottles. Source: Gold Coin and Relics Australia\n\n“This time I could also see old bulbs and garden beds as well — European trees are normally a good sign. Old cactus bushes are ones to look out for too, because they used to use aloe vera for cuts and abrasions in the 1800s and early 1900s,” Angus said.\n\nIt was around the old bluestone fire pit that Angus discovered a massive cluster of old glass bottles. While there’s not much value to any of them, they reveal interesting insights into the lives of everyday people who were never recorded in the history books.\n\nADVERTISEMENT\n\nBecause there was no garbage collection, garbage was simply piled up and buried.\n\nBut it wasn’t just bottles he found, also among the haul was half a rusted cap gun. In a video posted to his Gold Coin and Relics Australia social media page, you can hear his excitement as he dusts it off.\n\n“I also found this little ripper. I love finding these. Lots of fun back in the day,” he said.\n\nProspector excited to imagine who lost old coin\n\nAngus's next find is a medallion commemorating a “centenary of Melbourne”, dating back to 1935.\n\n“That is an absolute cracker, I actually haven’t found one like this before so I’m very happy with this,” he adds, before pointing out details on the coin like a swagman and a ship. These coins can sell from $20 to $1,000, depending on their condition.\n\n“You get a bit of a rush from the history. It’s fascinating to think about what life was like back then,” Angus said.\n\nADVERTISEMENT\n\n“That coin would have come out just after the [Great] Depression. A coin like that would have been circulated around and put a smile on people’s faces.\n\n“I really like trying to build a picture of what it was like back then, why they dropped it, why it was lost, and who had it in their hands.”\n\nBut it’s not just old relics that lie around old mining settlements. Prospecting machinery is always improving, and modern handheld detectors are able to detect gold that went unnoticed a century ago.\n\nUsing his “extremely sensitive” tools, Angus also discovered 14 small gold nuggets.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
        "source": "Yahoo"
    }
]