[
    {
        "url": "https://www.9news.com.au/national/sydney-trains-review-to-narrow-investigation-to-three-key-concerns/9adec0ad-2581-4a8b-a144-d712e6b835e7",
        "title": "The three key concerns at the heart of Sydney Trains review",
        "publish_date": "Wed, 28 May 2025 01:21:21 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "An expert panel will investigate three key concerns regarding the problem-plagued Sydney Trains network following last week's overhead wiring incident that triggered mass disruptions and delays.\n\nA 1500-volt wire came down at Strathfield Station during peak-hour on Tuesday and affected 80 per cent of the network until issues eased by Thursday.\n\nUnrelenting wet weather caused floodwaters over some tracks, which also hampered services later in the week. ﻿\n\nCommuters crowd onto platforms at Central Station last week. (Kate Aubusson)\n\nThis week, a three-member panel will meet to finalise their terms of reference for the independent review they are leading.\n\nThe panel is comprised of Sydney Metro and Sydney Light Rail Advisory Board head Kerry Schott, former NSW Independent Transport Safety and Reliability Regulator boss Carolyn Walsh, and former Ausgrid chief Trevor Armstrong will meet to lead the independent review.\n\nThey will focus on the specific cause of last week's electrical incident, whether a recent investment into rail and fleet repairs improved reliability and whether communication ﻿with customers during times of delays is adequate.\n\nIn the meantime, Sydney Trains has also begun its own internal investigation of the failed wire at Strathfield and will report their findings to the review.\n\nWater on tracks were reported between Bardswell Park and Turella last week. (Sam Mooy)\n\nTransport Minister John Graham acknowledged there was more the government could do to improve the rail system.\n\n﻿\"We have heard loud and clear the frustration of the commuting public and this expert and independent panel of three reviewers is going to assist in making sure we are focused in exactly the right areas to drive the improvements to the train system that passengers expect,\" he said.\n\n\"A short and sharp independent review into maintenance, punctuality and customer communications will assist in understanding how we can do better.\"\n\nREAD MORE: ﻿ National park search for missing teen Pheobe Bishop suspended\n\nPremier Chris Minns admitted that ﻿his government was on a \"very short leash\" with disgruntled commuters. (Sam Mooy)\n\nPremier Chris Minns admitted that ﻿his government was on a \"very short leash\" with disgruntled commuters while announcing the review.\n\n\"I want to say from the get-go that rail performance for Sydney Trains in New South Wales has not been good enough,\" he said last week.\n\n\"For many people who rely on the public transport system, we've let them down.\"\n\nMinns also gave commuters a fare-free day on Monday to compensate for the network-wide disruptions. ﻿\n\n\"Frankly, that's the least we can do. I don't expect it to make up for the chaos of the last 24 hours,\" he said.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/nsw-floods-damage-aerial-photographs-before-and-after/1f716490-37f4-495f-af9d-209e3566c3f9",
        "title": "Shocking before and after aerial images expose the severity of the NSW floods",
        "publish_date": "Wed, 28 May 2025 01:49:18 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "1 of 37 Attribution: Nearmap\n\nNewly released aerial imagery from the NSW Mid North Coast has captured the sobering scale of flood damage.\n\nThe images from Nearmap show the before and after of the situation.\n\nNearmap's Senior Director of Survey and Geospatial Content Operations M'Shenda Turner spoke of the devastation.\n\n\"This has been one of the most severe weather events we've seen in NSW in recent years — entire communities have been cut off, and the scale of the damage is staggering.\n\n\"These imagery and insights give us a powerful way to help emergency services, insurers and local councils understand exactly what they're facing on the ground.\n\n\"In moments like this, fast, clear information is everything - it helps guide critical decisions, prioritise support, and ultimately, speed up the path to recovery for the impacted communities.\"\n\nIn this photo, cows are crowded in a tiny island that was previously a small patch of a paddock.﻿\n\nClick through to see the before and after photos.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/cook-islands-dengue-fever-outbreak-travel-advice/4bcdff32-7bdd-4d07-b26a-2c1150e974ca",
        "title": "Travel warning after deadly disease outbreak in tourist hotspot",
        "publish_date": "Tue, 27 May 2025 02:40:59 +0000",
        "category": "lifestyle",
        "authors": [
            "May"
        ],
        "text": "A﻿n outbreak of dengue fever has been declared in a Pacific country beloved by Australian travellers.\n\nThe Cook Islands Ministry of Health declared the outbreak last week, with a total of seven cases of the illness in the past 18 days now confirmed.\n\nSo far, the ministry said, the cases were confined to the main isle of Rarotonga, with none in the outlying islands of the Pa Enua.﻿\n\nThe islands are a favoured travel destination for Australians. (Getty Images/iStockphoto)\n\nThe Cook Islands have declared a dengue fever outbreak. (Getty)\n\nThe Australian government has urged﻿ people to protect themselves against mosquitoes and use insect repellent while in the country.\n\nThe tropics-associated illness is carried ﻿by certain species of mosquito.\n\nDengue fever is mostly imported into Australia by travellers - if a mosquito bites an infected person, that mosquito can become a carrier.\n\nTravellers are urged to wear insect repellent. (Getty)\n\nOutbreaks in Australia are largely confined to north Queensland.﻿\n\nSymptoms can include a sudden fever, a headache, chills, swollen glands, muscle and joint pain, fatigue, abdominal pain, nausea, vomiting, and a faint, red rash.\n\nThe severity can range from mild to severe.\n\nWhere is the Aussie dollar still good value for travellers? View Gallery\n\nMost people with dengue fever recover in about a week, according to Health Direct, but other cases can require hospital case.\n\nOccasionally, dengue fever has proven fatal.\n\nSevere dengue fever symptoms may develop several days after the initial systems, and include frequent vomiting, vomit with blood in it, and unexpected bleeding.\n\nPeople who have any dengue fever symptoms and are concerned for their health should contact their doctor.\n\nAnybody feeling extremely unwell should contact Triple Zero in Australia, or emergency health services overseas.﻿\n\nAnd stay up to date with government warnings about travel to the Cook Islands on the Smartraveller website .﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/bookipi-success-story-how-sydney-tiler-tim-lee-built-46-billion-dollar-business-with-hard-work-smartphone/9ed5d19d-e4ed-4b28-b162-7149b1f0caf6",
        "title": "How a Sydney tradie built up a multimillion-dollar success story",
        "publish_date": "Tue, 27 May 2025 01:12:55 +0000",
        "category": "finance",
        "authors": [
            "May"
        ],
        "text": "With little time or money, the odds were stacked against Tim Lee on paper.\n\nWhen he was 22, the South Korean immigrant first came to Sydney on a working holiday with limited English skills and big dreams.\n\nLee picked up work as a tiler in Bankstown in the city's south-west and quickly improved with his second language.\n\nDespite a few setbacks, Lee went on to build a business with a billion dollar success story. (Nine/Supplied)\n\nBut it was a side project he quietly worked on late at night which eventually allowed him to create a sense of freedom for his family and build a business with a billion-dollar success story.\n\nLee decided to learn coding, business and marketing entirely through free videos found on YouTube, often with a coffee in one hand and a toddler crawling in the other.\n\nArmed with his smartphone and curiosity, the video-sharing platform became his university.\n\nAs he gained experience in his trade, he went on to open his own tiling business, which taught him firsthand the struggles small business owners face daily.\n\nHis new side hustle helped him figure out how to eliminate common problems teams face.\n\nAt the age of 32, he decided to call time on his tiling career.\n\n\"I didn't want to do it for the next 30 years so I decided to quit,\" he said.\n\nLee set up his business Bookipi﻿ in 2018 to offer businesses a simplified bookkeeping platform to save time.\n\nWhile he had high hopes for the business, it initially didn﻿'t make money for the first few years and he was supported by his wife on his journey.\n\nBut he soon secured his first investment in 2020 and achieved growth.\n\nTim Lee would teach himself coding, marketing and business after long days at work. (Nine/Supplied)\n\nLee said he then turned his passion project into a $1 million business in just two months after he decided to monetise in 2021.\n\nThe bookkeeping system is now being used by 524,00 businesses in more than 170 countries.\n\nThe product has generated $46 billion in invoices since 2020 and has a team more than 120 employees.﻿\n\nLee's success is no mean feat, with statistics revealing many Australian small businesses fail in their first year.\n\nIn the early days, Lee himself failed six times but each setback gave him a valuable lesson.\n\n\"What I learned was in order for me to build a solution it took a bit of time,\" he said.\n\n\"When I failed the second and third time, I realised even though I had great ideas, no one was going to use them.\n\n\"I decided to build things quickly instead of perfectly.\"\n\nLee's advice to fellow small business owners is a finished product is better than a perfect product.\n\n\"Execution is way more important than planning to me,\" he said.\n\n\"Once you start, you get a lot of feedback and you have customers.\n\n\"There are opportunities you can learn from them.\"\n\nThe other key ingredients are working with good people and having fun along the way.\n\n\"﻿If you have smart people and if they're nice, then the company will grow dramatically, that's my philosophy,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-28/young-adult-ya-novel-how-to-survive-1985-tegan-bennett-daylight/105346016",
        "title": "Young adult novel set in the 80s rejects idea today's kids are 'hopeless'",
        "publish_date": "Wed, 28 May 2025 01:56:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "What would you do if you came out of a cinema and found you had somehow gone back in time to the 1980s?\n\nThat's the predicament facing Shannon, the teenage protagonist of Tegan Bennett Daylight's new young adult (YA) novel, How to Survive 1985.\n\nThe book follows Shannon as she tries to find her friends — who have also travelled back in time — and a way to return to her usual life.\n\nWhile it would be easy for a time travel tale to embrace the cliches of the era and have its characters get around in acid wash jeans while listening to power ballads on their walkmans, Daylight's book has fun with its setting — but takes a different path.\n\nLooking back to see how far we've come\n\nHow to Survive 1985 uses its time shift for social commentary, as Shannon reflects on how society has changed in the past four decades.\n\nSeeing a less inclusive Australia leads her to celebrate progress on gender equality, LGBTQIA+ rights and environmental issues.\n\nShe also becomes thankful for the modern medical advances that help people live longer, happier lives.\n\nDaylight is also the author of Stella Prize-shortlisted book, Six Bedrooms. (Supplied)\n\nDaylight says she has seen teenagers become more compassionate and inclusive, and wanted to celebrate this change.\n\n\"I come across Gen-Xers who seem to think that all the radical work stopped with us, as though we'd done everything that we needed to do, or that Gen Z are a hopeless bunch. I just don't believe that at all.\n\n\"I've been teaching for 30 years, and I've got kids, and I have found that young people are lost in some ways, but they just get kinder and kinder.\"\n\nTeenage-hood 'burned into your brain'\n\nWhile Daylight, who turned 16 in 1985, consulted with some Gen X friends about their memories of the 1980s, she didn't have to do too much research to set the scene.\n\n\"That part of your life gets burned into your brain,\" she explains of being a teenager.\n\n\"Anything that happens then stays [with you], so it was very, very easy to remember my attitudes, clothing, the music I was listening to and what the world looked like.\"\n\nDaylight drew on the rich memories 'etched into the brain' from her own experience of living through the 80s. (Supplied)\n\nShe can also easily recall the connection she felt with her family as a teenager.\n\nIn the book, Shannon hangs out with her teenage mother and reflects on her hopes and dreams for the future.\n\nDaylight says the storyline was close to home for her.\n\n\"I asked my oldest child what they would do if they went back to 1985, and they said, 'I'd look for you.' That was a lovely thing to hear.\n\n\"I also realised as I was writing that it was likely to be something I'd do as well.\"\n\n'A great thought experiment'\n\nOne key difference with setting a book in the 1980s is that the characters can't communicate with mobile phones or the internet.\n\n\"Taking phones out [of the story] is a great thought experiment to see what young people who are used to phones might do,\" Daylight says.\n\n\"It's also a great plot point, because they know they want to find each other but don't know how. So that gives them this lovely adventure to go on.\"\n\nIn How to Survive 1985, Daylight's protagonists return from her debut YA novel, Royals. (Supplied)\n\nDaylight, who published her first adult novel, Bombora, in 1996, never planned to write YA fiction.\n\n\"I just had this idea of six teenagers trapped in Penrith Plaza,\" she says of her previous book, Royals. (How to Survive 1985 features the same characters, but can be read as a standalone book.)\n\n\"But once I'd written that, I was like, 'OK, cool, I've finished my YA.'\n\n\"A few people said to me, 'Are you going to write a sequel?' and I said 'No way.' But then this other idea [for How to Survive 1985] just turned up and kept hanging out with me.\"\n\nNow, she's even working on a third book in the series that she never intended to write.\n\nYA's loyal following\n\nDaylight says the main difference she has found between writing literary fiction and YA is promoting the work.\n\n\"YA is a different space; it's much less heightened and poised than literary, where you're really curating yourself,\" she says.\n\nShe has found that while there is less focus on YA in the media and at writer's festivals, it has a vibrant and enthusiastic readership.\n\n\"Even though you might be quite visible as a literary writer and less so as a YA writer, what happens is the books actually sell.\n\n\"They call it young adult, but [the character ages] start at about 10 and go to 25, so it's quite a broad market, and it's been super interesting.\"\n\nAnd Daylight is delighted that her time travel fiction is striking a chord.\n\n\" I just got the most beautiful letter from a 14-year-old reader; she was saying, 'It's so nice to have someone so positive about our generation.' \"\n\nHow to Survive 1985 (Simon & Schuster) is out now.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-28/anu-medical-college-allegations-to-be-investigated/105345824",
        "title": "ANU open to firing staff over 'wildly inappropriate behaviour'",
        "publish_date": "Wed, 28 May 2025 01:21:40 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "People accused of \"wildly inappropriate behaviour\" at the Australian National University's medical college could be fired if allegations are proven, Vice-Chancellor Genevieve Bell says.\n\nA report by Professor Christine Nixon into gender and cultural issues at the College of Health and Medicine and its constituent schools — found an entrenched toxic culture and a \"remarkable tolerance for poor behaviour and bullying\".\n\nThe college includes the John Curtin School of Medical Research, the School of Medicine and Psychology and the National Centre for Epidemiology and Population Health.\n\nProfessor Bell said a second, confidential report by Professor Nixon was also presented to university leadership, which included allegations about people who still worked at the university as well as ex-staff.\n\n\"We expected, as people talked to [Professor Nixon], that people were going to disclose and make allegations about really wildly inappropriate behaviour and we asked her to quarantine that from the report,\" Professor Bell said.\n\n\" I have a confidential report from her with a series of allegations against individuals at the university. \"\n\nSign for the Australian National University (ANU) in Canberra. August 2019. (ABC News: Tamara Penniket)\n\nProfessor Bell said an external investigator would be appointed to review those allegations.\n\n\"At the moment they are allegations and the thing about that is they need to be investigated appropriately,\" she said.\n\nShe did not rule out firing people if the allegations were found to be true.\n\n\"When we have had serious misconduct we will manage it within the parameters that we have,\" Professor Bell said.\n\nMore widespread than the college\n\nProfessor Bell said the report primarily focused on one college — arising from \"disturbing accounts\" of what had been happening.\n\nSince the review was commissioned last year, ANU closed the College of Health and Medicine and created a combined College of Science and Medicine.\n\nANU has closed the College of Health and Medicine and created a combined College of Science and Medicine. (ABC News: Matt Roberts)\n\nProfessor Bell said the eight key findings and 17 recommendations made in the report were \"absolutely\" applicable across the university.\n\n\"There have been places where people were basically making their own rules and that's just not appropriate,\" she said.\n\nMs Bell says the recommendations of the report absolutely are applicable to processes throughout the university. (ABC News: Niki Burnside)\n\nProfesor Bell said previous reports into different aspects of the College of Health and Medicine over the years had pointed to challenges in the culture there.\n\n\"I suspect this is not a recent phenomenon,\" she said.\n\n\"Something that's been there that long will take time to unpick and change.\"\n\nShe said she read the report alongside her predecessor Brian Schmidt, and said all previous vice-chancellors had \"done their best\" to improve the university.\n\n\"He reflected on how hard it is to change large institutions,\" Professor Bell said.\n\n\"He said it was a hard read — which it has been for all of us.\"\n\n'Top to bottom' change\n\nANU Students' Association president William Burfoot said the report's findings were \"shocking and incredibly, incredibly concerning\" but reflected a culture not limited to just the medical school.\n\nWilliam Burfoot says \"top to bottom\" change is needed. (ABC News)\n\n\"The report really goes into a painful amount of detail into how widespread these issues are,\" he said.\n\n\"I don't think it's unique to the medical school.\n\n\"It is a more pervasive issue and that just requires us to do much, much more to address it and to make sure that these kinds of things can't continue to happen.\"\n\nMr Burfoot said it was great the report was initiated and shared publicly, but the community needed to see \"top to bottom\" change implemented.\n\n\"We're letting down the people that come to this university,\" he said.\n\nImplementing recommendations\n\nProfessor Bell said the university was already taking steps to implement the report's recommendations.\n\nAustralian National University vice chancellor Genevieve Bell says the allegations of the Nixon report will be privately investigated.\n\nShe said a leader had been allocated to each recommendation and would report back on first steps taken by July.\n\n\"I'm really committed to the idea here that these shouldn't just be documents,\" she said.\n\n\"There should be an expectation about accountability. There should be an expectation about action.\"\n\nProfessor Bell said Professor Nixon would carry out a follow-up assessment at the beginning of 2026.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-28/millicent-woman-makes-10000-free-fabric-shopping-bags/105336582",
        "title": "Volunteer makes 10,000 free fabric shopping bags to fight waste",
        "publish_date": "Wed, 28 May 2025 00:54:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "A woman from the South Australian town of Millicent has achieved her goal of making 10,000 fabric shopping bags just in time for a local festival celebrating sustainability.\n\nJody McKechnie began her mission to make and give away the bags a year ago and, with some help from other volunteers and local schoolchildren, made her 10,000th bag on Sunday ahead of the Re-A-Range Festival that begins on Friday.\n\n\"It was just gruelling getting that amount done so quickly,\" the 62-year-old volunteer said.\n\n\"It's been pretty intense — it was elating and it felt like a dream afterward.\"\n\nProduction ramped up ahead of the self-imposed deadline. (ABC South East SA: Eugene Boisvert)\n\nThe 10,000 Bag Project began when Ms McKechnie was working in an op shop and realised how many plastic bags were still being used.\n\nShe suggested the project to the Wattle Range Council, which runs the Re-A-Range Festival, and began making the tote bags using donated unwanted fabric.\n\nShe said reusable plastic shopping bags were not ideal because they did not decompose and contributed to microplastics in the environment.\n\n\"The whole idea was to educate people about what they're purchasing, the plastics that they're purchasing, where it's all going … because a lot of people don't even realise where the garbage goes,\" she said.\n\nEach bag has a message about sustainability on it. (ABC South East SA: Eugene Boisvert)\n\nHelping hands\n\nMs McKechnie has been working from a shop owned by Sukhi Dhaliwal, who also part-owns the neighbouring IGA supermarket.\n\nThe space had been empty for three years.\n\nMr Dhaliwal said he thought Ms McKechnie could get more recognition for her project in a permanent space.\n\n\"Me, personally, whenever I think if I can help the community in some way, I will always do that,\" he said.\n\n\"I saw there is a need, I can help somehow and I just came on board and helped.\"\n\nSukhi Dhaliwal gives out the bags at his shop. (ABC South East SA: Eugene Boisvert)\n\nMs McKechnie has trained local primary school students in sewing, and they have made some bags for the project.\n\nMillicent North Primary School teacher Kylie Peace said the children learnt to sew, but also learnt about perseverance, sustainability and microplastics.\n\n\"It's really important that they learnt to get along with people that they may not be super-familiar with and it's really important for them to learn to give back to the community as well,\" Ms Peace said.\n\nMillicent North Primary School students Lilly and Mary, both 11, make a fabric shopping bag. (ABC South East SA: Eugene Boisvert)\n\nCommunity support\n\nMs McKechnie said there was an element of surprise to finishing on time, but she knew the people of Millicent would embrace her project.\n\n\"This community is a really giving community,\" she said.\n\nHow many times do you need to use your green bags? Photo shows Green bag at Woolworths Which type of bag should you use to take your groceries home if you're trying to have as little an impact as possible on the environment?\n\n\"There is a lot of people who do a lot of volunteer work and there's a lot of support networks in this community for people who are disadvantaged, so I haven't been that surprised that people have gotten behind the project,\" she said.\n\n\"I've found it really encouraging that people have actually taken it a little bit more seriously and to the next step and started conversing about their own use of plastic and what they can do modify that.\"\n\nScraps of fabric that did not make it into bags have been used to fill dog beds made by Ms McKechnie's friend, Mary Pappin.\n\nThe bags will form centrepieces for the Millicent Met Gala Wearable Art Fashion Parade on Friday and will be given out on the night.\n\nThe event is a competitive fashion parade showcasing wearable art made from recycled materials.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-28/mallee-broombush-eucalyptus-farmers-angry-nsw-restrictions/105341880",
        "title": "Eucalypt farmers say new restrictions 'ruining livelihoods'",
        "publish_date": "Wed, 28 May 2025 00:31:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "New South Wales farmers who have harvested native plants on their land for eucalyptus oil and brush fencing for decades say new restrictions are ruining livelihoods.\n\nEucalyptus oil has been distilled from blue mallee around West Wyalong in the Central West region of New South Wales since the early 1900s, and for the last 50 years, mallee-broombush has been harvested to provide a popular alternative to timber or metal fencing.\n\nBrush fencing has grown in popularity as a sustainable building option. (ABC Riverina: Emily Doak)\n\nBut that has come to a halt for many property owners due to laws protecting environmentally significant native vegetation.\n\nOver decades, Gaye Wheatley and her late husband Ned expanded the areas of mallee-broombush on their property to provide an alternate source of income to cropping, sheep, and cattle.\n\n\"We could see how we could make it productive, encourage the bush and have the income,\" she said.\n\n\"[Harvest involved] weaving through the bush in a mosaic way, leaving certain trees and taking dead wood to regenerate, making sure that we got the strangle vine down so that bush could replenish itself.\"\n\nGaye Wheatley (right) on her property with daughter Michelle and granddaughter Evie. (ABC News: Emily Doak)\n\nMore than 40 per cent of Ms Wheatley's property is now classified as sensitive regulated land, which means clearing is not permitted and a limited range of activities are allowed.\n\n\"It's virtually stopped our industry, and my three sons were involved with it … and it has greatly affected my income too,\" she said.\n\n\" We feel like we've been penalised and the underlying thing that worries me is my rights to use my land. \"\n\nFlow-on impacts to regional economy\n\nThe Lynch family has been harvesting broombush in the West Wyalong district since the 1970s, manufacturing brush fencing panels that are sold across the country.\n\nLen Lynch said his family had invested hundreds of thousands of dollars in equipment, but now most of their traditional harvest areas were off limits.\n\n\"It's absolutely devastating, we've had to cut back 90 per cent of our staff,\" he said.\n\n\"The economy in the town is affected, the landowners get a royalty, and all the truck drivers — it's a big loss to the township.\"\n\nLogan and Bailey Lynch normally make 20 fencing panels a day but production has been cut by three quarters. (ABC Riverina: Emily Doak)\n\nA group representing about 45 affected landholders and businesses called Landholders Right to Farm will meet with NSW members of parliament in Sydney on Wednesday.\n\nThey claim data used in 2010 to list woodland and shrubland dominated by mallee and mallee-broombush as a critically endangered ecological community under-represented the amount of habitat remaining.\n\nThe group also argues that new draft native vegetation mapping is flawed and does not recognise the continued use of the bushland for eucalyptus oil and brush fencing.\n\nIncomes lost\n\nSignificant areas of blue mallee plantations have been established in the West Wyalong district but on some farms, stands of bush have also been harvested.\n\nLandholders Right to Farm spokesperson Annabelle Davis said to produce eucalyptus oil, the blue mallee was cut down near the base and allowed to regrow.\n\n\"The trees are hedged to about 20 centimetres above the ground,\" she said,\n\n\"The leaves and the branches are taken up to the distillery where it's boiled, steamed, distilled and the oil is extracted.\"\n\nMs Davis said the restrictions on land use were \"ruining livelihoods\".\n\n\"We've had a number of people who have [lost] their entire ability to earn an income from land they purchased … to harvest blue mallee or cut broombush,\" she said.\n\nLandholders Right to Farm said several members had been fined or accused of illegal land clearing.\n\nMs Davis's family company disputes an accusation of illegal clearing, and Ms Wheatley has a remediation order over part of her property.\n\nAnnabelle Davis says native vegetation mapping is flawed. (Supplied: Annabelle Davis)\n\nThe meeting at NSW Parliament was organised by Member for Cootamundra Steph Cooke, who said current mapping had left many people too afraid to continue a sustainable practise due to the threat of legal penalties.\n\nIn a statement, a Department of Climate Change, Energy, the Environment and Water spokesperson said the department continued to work through mapping and compliance issues.\n\nThe spokesperson said landowners could seek approval from the independent Native Vegetation Panel to clear broombush in the critically endangered ecological community.\n\nThe statement said NSW Environment Minister Penny Sharpe had met with landholders and continued to investigate alternative solutions.\n\nLandholders Right to Farm said its members had only recently become aware they could apply for approval to harvest broombush.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-28/lng-problems-with-spirit-of-tasmania-ferries/105346408",
        "title": "New problems with Spirit ferries delay arrival in Tasmania again",
        "publish_date": "Wed, 28 May 2025 00:18:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Both of Tasmania's brand new Bass Strait ferries have \"technical issues\" with their LNG systems, the government has said — adding to the list of problems which have plagued the ships.\n\nThe new Spirit of Tasmania ferries, Spirit IV and V, have been built in Finland by shipbuilder Rauma Marine Construction and have been undergoing testing and preparations to travel to Tasmania.\n\nSpirit IV has been docked in Scotland in recent months and was due to leave for Tasmania on Monday, May 26, but TT-Line said in a statement on Monday that inclement weather had prevented its departure.\n\nFix will 'take some time'\n\nA \"technical issue\" had been detected with the liquified natural gas systems in both ships, the government says. (Supplied: Dennis Conaghan)\n\nCritics lash ads about Spirit ferries Photo shows Spirit of Tasmania IV ship in port. Tasmania's government has paid for double-page ads across three newspapers to address \"frequently asked questions\" about why the Spirit of Tasmania ferries are still a long way off operating.\n\nIn a statement this morning, Minister for Transport Eric Abetz said TT-Line had advised the government an issue with the liquefied natural gas (LNG) systems on board both ships had been identified.\n\n\"RMC has advised TT-Line that the issue needs further assessment and rectification, and as a result Spirit IV will not depart for Australia until the work is completed,\" Mr Abetz said.\n\n\"The government is awaiting further details in relation to a new expected departure date, but it is understood that this work will take some time.\"\n\nHe said that any necessary repair costs will be covered under warranty with RMC, and that TT-Line had representatives on the ground in Finland and was engaging with the company.\n\n\"The ship will be relocated to Hobart as soon as possible for final fit-out,\" Mr Abetz said.\n\nLoading...\n\n'Good news' issue found before departure, Abetz says\n\nSpeaking in parliament this morning, Labor leader Dean Winter asked Mr Abetz how much time the fresh delays will add to Spirit IV being \"stuck in Scotland as an international embarrassment\".\n\nTensions flared on both sides of the parliamentary benches during the subsequent debate, as Mr Abetz said he was \"no mechanic\" and could not offer further technical details.\n\nMr Abetz said it was actually \"good news\" the issue had been identified before Spirit IV had departed from Scotland.\n\n\"Thank goodness for the weather,\" Mr Abetz said.\n\n\"She might have been well into the deep oceans and then suffer a mechanical issue … the full extent of which I am not appraised of.\"\n\nLong list of problems for project\n\nThe LNG issue is just the latest in a project plagued by cost blowouts and delays that have led to multiple people losing their jobs.\n\nBoth ships were originally due to be delivered to Tasmania in late 2024, but construction on a new berth in Devonport did not start until that year and is not expected to be completed until late 2026.\n\nCould ownership of TasPort's new Spirit of Tasmania berth in Devonport be privatised before it's even completed? (Supplied: TasPorts)\n\nFormer minister for infrastructure and transport Michael Ferguson resigned ahead of a parliamentary no-confidence motion over his handling of the Spirit saga last year.\n\nThe former TT-Line chair Michael Grainger also resigned amid the debacle after criticising the government's handling, and chief executive Bernard Dwyer also left the company in November last year.\n\nEarlier this month, the government revealed one of the projects central to the cost blowouts and delays — the construction of the new berth — had again blown out by more than $100 million.\n\nInitially quoted at $90 million prior to 2024, the berth construction cost was estimated at $375 million last year, and that figure has now been revised to $495 million.\n\nAnnouncing the revised cost, Mr Abetz said on May 9 it was \"fanciful to suggest the original figure was ever realistic\" and a \"clear failure\" by TT-Line.\n\nSpirit IV had its first successful sea trial in June last year, while TT-Line said Spirit V completed its first sea trial just last month.\n\nIn a statement on April 16, TT-Line said all tests were completed successfully and that Spirit V was operating as it should.\n\nAt the time, RMC chief executive Mika Nieminen said construction was continuing ahead of secondary sea trials planned for May, which Mr Abetz had referred to.\n\n\"This first sea trial is a significant milestone and confirms that Spirit of Tasmania V is performing to expectations,\" Mr Nieminen said.\n\nTT-Line and RMC have been approached for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-28/moira-deeming-former-liberal-premiers-john-pesutto-legal-costs/105345780",
        "title": "Liberal MP says she may pursue former leader's backers for court costs",
        "publish_date": "Wed, 28 May 2025 00:13:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Liberal MP Moira Deeming says she will pursue senior Victorian Liberal figures to help recover $2.3 million in legal costs if John Pesutto cannot pay.\n\nMs Deeming successfully sued the former Victorian Liberal leader for defamation after he moved to expel her from the party room in 2023 after she attended an anti-trans-rights rally that was gatecrashed by neo-Nazis.\n\nEarlier this month, Mr Pesutto was ordered to pay more than $2.3 million in costs to Ms Deeming.\n\nIt's understood he's unable to pay the costs order or his own legal bills, and has been seeking loans from Liberal powerbrokers to fend off bankruptcy.\n\nThe Australian newspaper on Wednesday reported Ms Deeming's legal team had written to Mr Pesutto's lawyers seeking information about some of his high-profile donors.\n\nMs Deeming told the ABC the letter was sent to understand who had financially backed Mr Pesutto during their defamation battle, because she \"may have to seek cost recovery through them.\"\n\nFormer premiers Jeff Kennett and Ted Baillieu are among the Liberal faithful who have chipped in to help save Mr Pesutto's political career.\n\nBoth declined to comment to the ABC.\n\nIn a statement this morning, Ms Deeming said she had not yet launched any lawsuits against anyone other than Mr Pesutto.\n\n\"The letter simply seeks to understand who aided him [to run the case],\" she said.\n\n\"Being a lawyer, John knew better than anyone, the legal and financial risks in refusing to apologise and retract his defamatory claims against me.\n\n\"His defences failed, I won my case and he agreed to pay my costs last year.\"\n\nThe legal stoush was prompted by Ms Deeming's attendance at a Let Women Speak rally at state parliament in March 2023.\n\nThe event, categorised by supporters as a women's rights event, featured UK anti-trans-rights activist Kellie-Jay Keen. Ms Deeming was also involved in organising the rally.\n\nLiberal leader wants 'whole matter resolved'\n\nVictorian Opposition Leader Brad Battin said the idea of potential further legal action by Ms Deeming on three former Liberal premiers was a \"distraction\".\n\n\"I would love to see this whole matter resolved,\" he told ABC Radio Melbourne on Wednesday.\n\nMr Battin would not be drawn on questions about what he could do to resolve the saga.\n\n\"I'll continue to have discussions internally with my colleagues, with the party and whoever else I'm required to, but at the end of the day … those conversations will remain confidential,\" he said.\n\n\"It is frustrating because it's not a topic that I think most Victorians at home want us talking about.\"\n\nSenior Liberals have told the ABC they are furious with Mr Battin over his handling of the situation.\n\nSome say his lack of action to try and broker a deal to avoid a by-election was damaging the party and his leadership.\n\nIf Mr Pesutto declared bankruptcy he would be forced from parliament, and there is no guarantee the Liberals would retain his Hawthorn seat in a by-election.\n\nEarlier this year, Mr Battin appointed Ms Deeming as his special representative in the western suburbs, infuriating colleagues.\n\nMr Pesutto declined to comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-28/coalition-gets-back-together-after-week-long-split/105346446",
        "title": "Coalition gets back together after week-long split",
        "publish_date": "Wed, 28 May 2025 00:10:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Liberal and National parties have struck a deal to reunify, a week after the Coalition's extraordinary split in the wake of a ruinous election defeat.\n\nThe ABC has been told a press conference will be held later today, and that frontbench positions are being allocated.\n\nNationals Leader David Littleproud announced last Tuesday that his party would be ending the Coalition Agreement with the Liberals over four policy issues the party demanded be kept.\n\nDays later, the Liberal Party agreed in principle not to include those policies — nuclear power, a Regional Australia Future Fund, break-up powers for the supermarket sector and better mobile coverage in the bush — in a sweeping review of the Coalition's election loss.\n\nDavid Littleproud walked away from the Coalition last week after a vote in his party room. (ABC News: Simon Beardsell)\n\nSome senior Liberals told the ABC that the Coalition split could give the party \"breathing space\" on its policy, with a view the Liberal brand had been damaged in the cities.\n\nThe Liberal Party has lost as many as 13 seats at an election where it had expected to gain seats.\n\nReunification draws line under days of infighting\n\nThe split has led to days of infighting and jostling between the parties.\n\nIn contention was also a claim that Mr Littleproud demanded the Nationals be free to breach cabinet solidarity and be allowed to speak out against policies they disagreed with, which Ms Ley flatly refused.\n\nThe opposition leader initially did not want to rule out any policies from a total review of the Coalition's election loss.\n\nBefore the Coalition was so divided on climate, Labor had its own splits Photo shows Sussan Ley in press conference Just as the Liberal Party has tossed and turned on climate, Labor undertook multiple reversals as it grappled with refugee policy.\n\nBut Mr Littleproud said his party would not \"blink\" on its four policy demands, and repeated over the weekend that he was proud to stand up for Nationals principles and deliver the message to Ms Ley that his party had voted to leave.\n\nThe Liberals and Nationals will not pursue their election commitment to build seven nuclear power plants, but will continue to push to lift the national ban on nuclear power.\n\nThe parties have also negotiated a position on three other election commitments: to introduce divestiture powers that could be used to break up supermarket and hardware store chains found to be abusing their market power, a $20 billion future fund that could be drawn down on to pay for regional services and infrastructure, and minimum broadband speeds of at least 25Mbs and basic mobile service requirements for regional and rural Australia.\n\nInternally, however, leadership questions have roiled within the Nationals, with the party leader openly saying on Sunday that if the cost of taking a stand would be that he lost his job, so be it.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-28/social-media-rental-scams-on-the-rise-wa/105335962",
        "title": "'All you see is fake': Rental scams on the rise on social media",
        "publish_date": "Tue, 27 May 2025 23:04:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Lorenzo Pietribiasi moved to Broome from Italy, he bounced around living with friends and in staff accommodation before braving the rental market.\n\nHe spent over a month trying to find a rental but said part of the problem was scammers on social media.\n\n\"It's frustrating … you have to work or do other stuff, and you're trying to sort out where you're going to sleep for the next month,\" Mr Pietribiasi said.\n\n\" And then all you see is fake and pretend. \"\n\nMr Pietribiasi said he was contacted by four separate scammers while trying to secure a property in the northern WA town.\n\nRental advocacy groups say it is concerning people cannot find rentals through traditional means. (ABC Kimberley: Ruby Littler)\n\n\"I did the normal procedure like everyone does — I went on Facebook and in all the groups started posting that I'm looking for a place,\" he said.\n\n\"But no real people were contacting me, it was mainly scams.\"\n\nRental price hike\n\nMr Pietribiasi said he would receive direct messages on Facebook asking him to disclose personal information before letting him view the property.\n\nWhen he pushed back, they either went silent or gave \"more excuses\".\n\nIn other instances, \"scam links\" were left in comments under his posts.\n\nRental scam links are regularly shared under posts on social media. (Supplied: Facebook)\n\nThe ABC spoke with the facilitator of a Broome rental page, who said they used certain technology to automatically block scam posts and comments on prospective tenants' profiles.\n\nOn some rental group pages, there are upwards of 10 third-party link comments underneath posts.\n\nThe Real Estate Institute of WA's latest quarterly report showed average weekly rents in Broome had reached $1,050 per week, representing a 5 per cent increase in three months.\n\nWorse in the regions\n\nRental scamming is \"exacerbated\" in regional areas like Broome, according to lawyer Alice Pennycott from Making Renting Fair WA.\n\n\"People wouldn't be as susceptible or as desperate if they had more choice or knew they would be able to find a property,\" she said.\n\nMs Pennycott said people locked out of finding a rental through \"traditional\" means like a realtor often turned to online platforms, which were unregulated and \"more rogue\".\n\nAlice Pennycott from Make Renting Fair WA, a coalition of housing bodies and renters' rights advocates. (Supplied: Circle Green Community Legal)\n\n\"New ways of scamming people have emerged … they [scams] can look quite sophisticated now. It can be hard to tell that it isn't legit,\" she said.\n\n\"It's alarming seeing people unable to access properties through … more traditional means.\"\n\nMs Pennycott said prospective renters were made vulnerable by a \"power imbalance between tenants and landlords\".\n\nRental prices in Broome have increased by 11.1 per cent in three months. (ABC Kimberley: Vanessa Mills)\n\n\"People are often asked to give a lot of personal and confidential information to apply for a rental property, like bank statements and details of employment,\" she said.\n\n\" That can potentially, in the wrong hands, make them susceptible to identity theft and fraud. \"\n\nMake Renting Fair WA has called for tighter regulation around tenancy applications so renters are protected regardless of what the market is doing.\n\nAnge Inns says Consumer Protection has noticed an increase in rental scams. (ABC Kimberley: Ruby Littler)\n\nTips for avoiding rental scams Be wary of photos/rents that are too good to be true, only being able to inspect the outside of a home, or being asked to keep the deal private.\n\nReverse image search the listing's photos to see if they have been used elsewhere.\n\nLook up the property on real estate websites and contact previous listing agents for more information.\n\nOnly deal with landlords who can meet face-to-face, or go through a licensed real estate agent.\n\nBe cautious if asked to pay funds via direct bank transfer.\n\nOnly pay funds in exchange for keys and a signed rental agreement. Source: Consumer Protection\n\nKimberley-based Consumer Protection senior officer Ange Inns said the agency was trying to arm people with knowledge to help them avoid scams.\n\nShe said there had been an increase in rental scams, and the current market made it especially hard for people under financial pressure, who urgently needed a home.\n\n\"Scammers target people who are likely to make these decisions out of desperation. They make the scams look too good to be true,\" Ms Inns said.\n\n\"They're posting fake photos and making the property look great, and the rental price is often too good to be true — so these are red flags.\"\n\nProspective tenants should view the property before providing identification documents or transferring bank funds, according to Ms Inns.\n\nConsumer Protection encouraged anyone who may have encountered a rental scam to report it immediately to help the state agency track fraudulent activity and prevent others from falling victim.\n\nLoading...",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-05-28/myer-bendigo-history-redevelopment-sidney-myer-bendigo/105326916",
        "title": "Duct tape holds the floors together at Myer's original store in Bendigo",
        "publish_date": "Tue, 27 May 2025 22:20:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "As the Myer retail chain faces a major shake-up under businessman Solomon Lew, residents in the regional city where Myer was born have called on the company to give its original store some love.\n\nAustralia's first Myer department store opened in Bendigo's Pall Mall 125 years ago, in 1900, 11 years before the doors swung open at its flagship Melbourne Bourke Street base.\n\nIt was the launch pad for what has become one of Australia's most recognised brands, with 56 stores across the country.\n\nBut step inside the Bendigo Myer store and it is easy to see why rumours about its future are circling around town.\n\nPeeling linoleum floors are patched up with duct tape, and plaster crumbles from the walls.\n\nThe retailer evolved from being a drapery into a department store in Bendigo. (Supplied: Myer)\n\nBendigo Historical Society former president Jim Evans said residents had always been proud of Myer's presence in town, but the facade of the historic building was falling apart, and the interior had also seen better days.\n\n\"Bendigonians are appalled at the state of the building,\" Mr Evans said.\n\n\"It's an iconic building and it's certainly something that would attract attention from all over the world.\"\n\nBlack duct tape can be seen on the store's floor. (ABC Central Victoria: Emile Pavlich)\n\nJane Symonds, 74, has shopped at the Bendigo Myer store since the 1980s and said it used to be a mecca of high-end local retail.\n\n\"Everything needs to be refreshed … they need to refurbish it, make it brighter, newer,\" she said.\n\n\"We need a big, quality department store like that in Bendigo because we've got bugger all.\"\n\nMyer grandson joins calls for revamp\n\nSidney Myer's grandson Andrew Myer, who is also the chair of the philanthropic Sidney Myer Fund, believes the Bendigo building should be restored to its former glory rather than sit in disrepair.\n\nAndrew Myer chairs the philanthropic Sidney Myer Fund. (ABC News: Richard Sydenham)\n\n\"I think it is a cornerstone building,\" he told the ABC.\n\n\"As a passionate family member and knowing that it is the first store, I would love Myer, particularly the CEO [Olivia Wirth], to take some personal interest in the refurbishment of the store.\"\n\nSidney Myer also purchased a drapery business on Bourke Street in Melbourne before turning it into the Myer Emporium. (ABC Archives)\n\nThe philanthropist said the state of the Bendigo store was a matter for the board and management, and he believed other family members had raised the issue personally with the Myer Group.\n\nResurrecting Myer will be no easy task Photo shows Bald man stands at podium wearing white shirt, pink tie and blue suit jacket Solomon Lew has fulfilled a long-held dream by taking the reins at Myer. But it has comes at a time when many shoppers and investors have grown tired of its business model.\n\nThe ABC understands the Bendigo store's elevator has recently been upgraded and plans are in place to replace the roof.\n\nA Myer spokesperson acknowledged Mr Myer's feedback and said a review of all stores was underway.\n\n\"As this work progresses, we will have more to say on it, but there are no announcements in relation to Myer Bendigo at this stage,\" the spokesperson said.\n\n\"We have a constant program of maintenance works across our store network, which includes Myer Bendigo.\n\n\"Myer owns the Bendigo store and there are no changes to our operations.\"\n\nMyer's Bendigo store is the chain's original outlet. (ABC Central Victoria: Sarah Lawrence)\n\nBendigo's Chamber of Commerce Be Bendigo chief executive Hayley Tibbett said she had contacted the Myer Bendigo manager, but had not received a response.\n\n\"We all [the Bendigo community] feel a passion for Myer,\" she said.\n\n\" Everybody will have some story about their connections to Myer and we would love it to actually reflect that in the premises itself. \"\n\nSidney Myer opened his first Myer store in Bendigo in 1911. (ABC Central Victoria: Emile Pavlich)\n\nWho was Sidney Myer?\n\nSidney Myer, born Simcha Myer Baevski, was a Russian Jewish immigrant who arrived in Melbourne in 1899.\n\nHe opened a small drapery shop in Bendigo with his brother Elcon in 1900, which went on to become Myer and now extends to Hargreaves Mall.\n\nSidney Myer was also known for his philanthropy. (ABC Archives)\n\nThe brothers prospered in central Victoria and opened another Myer store in Bendigo in 1908. In 1911, Sidney Myer bought a drapery store in Bourke Street, Melbourne, which is where the Myer Emporium flagship store still stands today.\n\nThe National Library of Australia holds newspaper records showing that in the 1930s at the height of the Great Depression, Mr Myer arranged to provide Christmas dinner for 10,000 people mostly from poorer families in Melbourne.\n\nAt the time, the Brisbane Courier reported that Mr Myer said he did not want the sense of charity to enter into the project, but rather for the people to feel like his personal guests to whom he wished to give a memorable Christmas.\n\nThe legacy of his philanthropy continues through the Sidney Myer Fund and The Myer Foundation.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/culture/books/what-has-the-pornification-of-pop-culture-done-to-women-20250526-p5m251.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What has the ‘pornification’ of pop culture done to women?",
        "publish_date": "Wed, 28 May 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Jenna Price"
        ],
        "text": "Author and journalist Sophie Gilbert. Credit: Urszula Soltys\n\nFor me, there is a little too much about reality television, but it’s a big part of the culture so there’s no way of avoiding it, from Big Brother and An American Family. And Gilbert introduces me to one I’d never heard of before: Who Wants to Marry a Multi-Millionaire, which she describes as “the beginning of reality TV’s determination to view twenty-first century women through a nineteenth century frame: Jane Austen heroines who, deprived of agency or power of their own, could only compete to claim status and self-betterment through their looks, their alliances and their rivalries”. Pretty much.\n\nOr, as Jerry Hall said in 1985, “My mother said it was simple to keep a man, you must be a maid in the living room, a cook in the kitchen and a whore in the bedroom.” Hall updated it: “I said I’d hire the other two and take care of the bedroom bit.”\n\nBut by far the most striking, most frightening, aspect of the book is the way in which Gilbert has both drawn on, and expanded, the work of philosopher Amia Srinivasan, The Right to Sex and Gail Dines’ Pornland: How Porn Has Hijacked Our Sexuality. Porn trains us.\n\nPorn trains us in how to be women. And worse, it trains men in how to treat women. “It has trained a good amount of our popular culture ... to see women as objects, as things to silence, restrain, fetishise, or brutalise,” says Gilbert. The fleshed-out concept of pornography as a textbook for how women must be in their lives is terrifying. Now I’ve read Gilbert’s persuasive arguments, I’m embarrassed I’ve ever been persuaded otherwise. I’ve never felt so wrong in my life. There is now, she argues, a “pornification” of everything, including music.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/a-playful-meditation-on-the-hellscape-of-contemporary-literature-20250526-p5m2ar.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A playful meditation on the hellscape of contemporary literature",
        "publish_date": "Wed, 28 May 2025 12:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Declan Fry"
        ],
        "text": "There is a sense throughout that, smarmy as the narrator is, his desire to be a writer is merely incidental. He is described as having little mercy – a quality that seems to be borne out, given his treatment of Shales. Could it be mercy for himself too, though, that he lacks? Caught in his Tantalus visions of literary fame, he regularly conflates literature with the satisfaction of other desires (legitimacy, likeability, self-worth). He believes or wants to believe himself to be Brenda’s confidante and confessor. He would be better served learning to act as his own.\n\n“Fame is a form of incomprehension,” Borges observed, “perhaps the worst.” Cannily, Borges never bothered specifying whether this incomprehension belonged to the artist, their audience or both. There is an ironic edge to this aspect of the book. Amerena plays with questions of domination and subordination, both sexual and economic. (Regularly highlighting every abject and unseemly stitch of his characters, Amerena plays the dom.)\n\nLoading\n\nIn I Want Everything, the conniving opportunism and careerism of the present eclipse … well, everything. If Shales could become Australia’s greatest author, it wasn’t while donating her body to science and her soul to the industry. It was because she came of age in a country that offered its people something more than a series of transactional arrangements. Where authors once sought time and space to write, now they seek time and space to better leverage their brand.\n\nWas it always like this? A sense of parasitism, of being redundant and secondhand, has often haunted settler art in Australia. You can accuse Amerena of romanticising the past if you like. He isn’t alone. In any case, a romantic vision does not necessarily equate to an incorrect one. You may want everything, Amerena suggests, but first you’ll need to sell yourself out – along with your friends, enemies, colleagues, fans, associates, pets, peers and family – to get there.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/why-did-atc-members-look-a-gift-horse-in-the-mouth-20250528-p5m2tg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rosehill rejection: Why did ATC members look a gift horse in the mouth?",
        "publish_date": "Wed, 28 May 2025 11:59:22 +1000",
        "category": "sports",
        "authors": [
            "Andy Marks"
        ],
        "text": "Not since 100-to-1 outsider Prince of Penzance defied the odds to win the 2015 Melbourne Cup has a result so deeply confounded established racing logic. The rejection by members of the Australian Turf Club of a $5 billion proposal to sell Rosehill Gardens Racecourse to the NSW government comes close.\n\nChris Minns Credit: Aresna Villaneuva\n\nThe prospect of 25,000 new homes on a site situated in the heart of Australia’s fastest-growing region were stakes Premier Chris Minns had no option to mount. Under the National Housing Accord he has committed to delivering 377,000 new homes across NSW by 2029. Weigh up the racecourse’s adjacency to a newly-constructed light rail network, a coming metro line and a surging jobs hub in Parramatta, and the odds looked impossible to ignore.\n\nThe NSW government has made no secret of the centrality of housing supply to its agenda. From its establishment last year of the Housing Delivery Authority, through to its pursuit of its Transport Oriented Development initiative, its colours were clear and unambiguous.\n\nRecent measures by the premier to upscale the state’s production of modular homes – and the contingent manufacturing jobs boost – only upped the stakes. As did the commitment from Peter V’landys, chief executive and board member of Racing NSW, to “ensure the revenue derived from the [Rosehill] proposal is reinvested to benefit the racing industry as a whole”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/coalition-split-over-after-little-more-than-a-week-20250528-p5m2w5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Coalition split over after little more than a week",
        "publish_date": "Wed, 28 May 2025 11:57:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "Coalition split over after little more than a week\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/this-is-not-a-pop-band-as-a-packed-melbourne-room-reflected-it-s-something-more-unusual-20250525-p5m20c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "When she starts singing, the crowd falls into complete silence",
        "publish_date": "Wed, 28 May 2025 11:57:45 +1000",
        "category": "entertainment",
        "authors": [
            "Vyshnavee Wijekumar",
            "Michael Dwyer"
        ],
        "text": "The stage is minimalist, adorned with a side table laden with a vase of flowers, a globe and an array of lamps. Occasionally there’ll be a lighting effect, like a spotlight that emulates the moon or a tortoise shell speckled design projected onto the back curtain. Loading The crowd is tentative about applauding, waiting for a conclusive indication that she’s finished before clapping between tracks. Hardly anyone raises their phone to record, and when they do, she kindly asks them to stop. The performance goes for just under two hours, including the encore. A long time to be standing, even for the most dedicated fan. A couple of audience members even faint. Seating would have ensured a comfortable concert experience and suited the intimate atmosphere. A captivating performance, where you surrender to Aoba’s fantasy and detach from the chaos of the outside world.\n\nReviewed by Vyshnavee Wijekumar\n\nMUSIC\n\nFloodlights ★★★\n\nForum Melbourne, May 24 Smoke, an immense cage of light, an eager rush onto one of Melbourne’s most storied stages, and a hometown heroes’ welcome that swells the room. Floodlights’ night is a triumph already. Alive (I Want To Feel) is heralded by the lone trumpet of Sarah Hellyer: the bugler in the face of a gathering storm. And alive we feel. Melbourne rock band Floodlights at the Forum on Saturday night. Credit: Martin Philbey Floodlights are no pop band; no hits or Hottest 100 contenders, though their second album, Painting of My Time, was shortlisted for the 2023 Australian Music Prize. What tonight’s packed room reflects is more unusual: a serious following for serious music, with a gritty, localised aesthetic that more tenderly echoes Midnight Oil, The Triffids, Goanna – bands that tried to make sense of a country and its shadows. Tonight’s set leans hard on Underneath, the new album that continues the collective’s earnest search for meaning in a more inward direction. It’s less postcard-accessible than Small Town Pub and Nullarbor — older tunes that reliably lift the energy when long intros and murmured set-ups lead attention to drift. The new material is thematically dense, deliberate, sometimes elusive.\n\nBut JOY is pure high. Horses Will Run creeps and surges with dream-state drama. Frontman Louis Parsons doesn’t so much sing as declaim. He’s insistent, on edge, but rarely quite decipherable in the wiry ensemble attack. Hellyer’s heroic trumpet and wailing blues harp are recurring motifs, adding flashes of texture and tension that hark back to Aussie pub rock forebears. Louis Parsons, lead singer and guitarist for Melbourne rock band Floodlights, performs on stage at the Forum on May 24, 2025 Credit: Martin Philbey Mid-show, the piano-led Melancholy Cave wants to pull the room into a hush, but the crowd seems elsewhere. There’s a nagging sense that much of Underneath hasn’t quite landed yet—at least not live. But Buoyant is a late-set victory. As promised by the title, the room levitates. The crowd picks up the booming hook and sways into a proper old-school beer barn moment. And the sprawling 5AM is an epic set closer of slow-building, stadium-targeted proportions. “It’s been an emotional day for us,” Parsons offers gratefully before the single-song encore. Golden oldie Painting of My Time is the climax the night needs and again, the room rises to meet its all-in chanting refrain. It’s late, but a moment of exhilarated arrival that makes the journey worthwhile. Floodlights don’t always hit their mark. But there’s no question they know what they’re aiming for.\n\nReviewed by Michael Dwyer\n\nTHEATRE\n\nEndgames ★★★\n\nfortyfivedownstairs, until June 1 Three brief encounters with hideous men achieve a sense of twilit tragicomedy in the hands of the legendary Max Gillies. The legendary Max Gillies stars in Endgames at fortyfivedownstairs. Credit: Jodie Hutchinson With Endgames, Gillies rejoins director Laurence Strangio to present what’s in some ways a companion piece to their 2018 production of Krapp’s Last Tape – this time uniting the late Beckett work Eh Joe with an excerpt from Jack Hibberd’s classic monodrama A Stretch of the Imagination and Chekhov’s shambolic lecture On the Harmful Effects of Tobacco. Although Hibberd died last year, the curtain may long continue to fall on his immortal stage creation, Monk O’Neill. The misanthropic hermit in Stretch remains an incarnation of Australian male destructiveness and despair as appalling as he is compelling.\n\nHibberd used this character to diagnose cultural disease – from slashing misogyny to the rapacity and bad faith of colonialism – with a clear-eyed honesty that reshaped what was possible on our stages, and this excerpt includes Monk’s final will and testament, in which he gives: ‘All my lands and property, goods and chattels, to the Aboriginal peoples of Australia … On no account must my domain fall into the clutches of the predatory and upstart albino. I believe that the tides of history will swamp and wash aside this small pink tribe of mistletoe men, like insects …Change insects to dead leaves…’ With Endgames, Gillies rejoins director Laurence Strangio. Credit: Jodie Hutchinson One Tree Hill isn’t his to give, of course, and even Monk’s presence is erased in this version, largely an audio performance under crepuscular lighting. Gillies only appears once, rifle in hand, pursuing “an emu on heat” through the shadows; the brilliantly produced soundscape, however, overfills the physical absence – not least in the copious, and comically loud, urination which bookends the piece.\n\nIf that whets the appetite for a proper remount of Stretch, the audio monologue in Eh Joe is part of Beckett’s creative intention. The elderly loner here sits entombed in silence on a couch, as the accusatory voice of a woman (Jillian Murray) torments him with memory and regret. Loading As he seduced women in his life, so this internal voice now seduces him towards death, and Gillies’ wordless performance haunts with barely perceptible pain and confusion, with the agony of futile presence. Gillies has always had a talent for clowning, and in the Chekhov, he leans into a more overtly satirical sort of existential monologue. Nyukhin is a nervy, ineffectual public speaker. The man is supposed to be giving a charity lecture on the evils of tobacco, but it keeps turning into a digressive complaint about his wife and daughters, whom he fears. The actor fumbles his lines more than a few times, which matters less than it might when he’s playing a character who wishes he could erase his memory, and whose comical lack of authority is his defining feature.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/i-have-nothing-but-respect-for-gus-but-i-wouldn-t-be-doing-my-job-if-i-didn-t-question-him-20250527-p5m2oa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I have nothing but respect for Gus, but I wouldn’t be doing my job if I didn’t question him",
        "publish_date": "Wed, 28 May 2025 11:53:18 +1000",
        "category": "finance",
        "authors": [
            "Michael Chammas"
        ],
        "text": "Chammas: Is it right that you weren’t even at the dinner the other night?\n\nGould: I haven’t met Lachlan Galvin. I haven’t met Lachlan Galvin. I really haven’t.\n\nChammas: Why do you not turn up to such a big decision?\n\nGould: What I do know is there is not another CEO, another general manager or a recruitment manager that has to sit on a panel and answer these questions, week in, week out.\n\nChammas: But that’s your choice, Gus.\n\nGould: I’m just saying, you’re getting a free licence here. What I’m saying is that these are things we do internally. Most of our issues internally are created by the gibber in the media, and what you want to do and extend on it.\n\nChammas: But it’s not gibber. We predicted it was going to end up (with Galvin) at the Bulldogs.\n\nGould: It is gibber. It is gibber. You say a lot of things that just aren’t true. And you say a lot of things that are exaggerated.\n\nChammas: We played a highlight clip of what you’ve said over the past few months.\n\nGould: You’re exaggerating. You’re exaggerating.\n\nChammas: Tell me which one?\n\nGould: All of it.\n\nChammas: Yeah, but we hit you about Lachlan Galvin …\n\nGould: You exaggerate. You exaggerate what’s going on and that makes it difficult for us. Now I don’t want to sit here and point out everything that you’ve done wrong. It doesn’t worry me and it doesn’t influence me, but it certainly has an effect on the players. And it has an effect on the players and their families. And that’s what you don’t see. And that’s the thing we’ve got to mop up. That’s the thing we’ve got to do.\n\nChammas: Is that why, then when we ask you about these things, is that why you mislead us with what the information is?\n\nGould: What have I misled you on?\n\nChammas: Well, the Galvin situation for one.\n\nGould: How have I misled you?\n\nChammas: Leo Thompson, you said that …\n\nGould: How did I mislead you on Lachlan Galvin?\n\nChammas: Gus, you were three steps ahead of everyone. To suggest that you didn’t think that Galvin could become …\n\nGould: You say that. You say that. How did I mislead you on Lachlan Galvin? Go back to everything I said.\n\nChammas: You said you weren’t interested?\n\nGould: What?\n\nChammas: You said you weren’t interested.\n\nGould: I never, at any time, said we weren’t interested. What I said was …\n\nChammas: He’s not in your plans.\n\nGould: … That we’re on a different course. He’s not in our plans because he wasn’t off contract until 2027. We couldn’t talk to him until November.\n\nChammas: Yeah, but we all knew he was going to leave. We all knew that was going t leave, you could see …\n\nGould: Well I didn’t know that. I didn’t know that.\n\nChammas: Oh come on, Gus.\n\nGould: No, you’re surmising that now because it’s happened. You want that to be the truth.\n\nChammas: At the time we were all saying ‘how is this going to be tenable?’\n\nGould: You want that to be the truth. That’s the scenario you want to create.\n\nChammas: You didn’t see it happening that way?\n\nGould: No, I didn’t see it happening that way at all. Not at all.\n\nChammas: I said to you, I joked about it on here that I don’t think it’s a coincidence that you ended your feud with Isaac Moses.\n\nGould: Why did you assume that I knew that? Why did you assume? Because it suits your narrative.\n\nChammas: It’s not about narratives.\n\nGould: It suits the media’s narrative.\n\nChammas: You ended your feud with Isaac Moses at the end of last year …\n\nGould: You go back and have a look at everything I’ve said about Lachlan Galvin and what transpired and everything I said was 100 per cent the truth, at the time.\n\nThe goalposts moved this week when they came back and said ‘he could be available now’.\n\nChammas: I don’t doubt that.\n\nGould: Which I took to the coaches and the coaches went and met with him, not me. The coaches went and met with him.\n\nChammas: I don’t doubt that.\n\nGould: I met with the manager Thursday after the coach came back and said ‘this could be an option’. It wasn’t my decision. Coach’s decision.\n\nChammas: So how does it sit with you then when Andrew Webster writes today (in The Australian) that there are clubs are up in arms, and you spoke about it, you have to come on here and …\n\nGould: I don’t give a damn about anything Andrew Webster writes, or any journalist in this town, to be honest.\n\nChammas: But the clubs are obviously starting to say, ‘why can Gus publicly court Lachlan Galvin, tell everyone he’s the best player …’\n\nGould: How did I publicly court Lachlan Galvin?\n\nChammas: Well, what you’ve said about him.\n\nGould: What did I say?\n\nChammas: You praised him like I’ve never heard before.\n\nGould: I’ve praised a lot of players. I’ve praised Cameron Smith. Did I ever offer you a contract, Cameron?\n\nCameron Smith: (Laughing) No\n\nGould: No, never. Nor would I think you’d ever become available.\n\nChammas: Do you care though, that other clubs are saying stuff to the NRL?\n\nGould: I don’t give a rats what other clubs think. You mistake me for someone who cares. What I don’t like is being sit here with a bloke like you, questioning my credibility.\n\nChammas: I’m not questioning your credibility.\n\nGould: You are. You said I misled the public. You said I misled you.\n\nChammas: That’s what everyone’s saying at the moment.\n\nGould: No, you’re saying it. You’re saying I misled you. I misled no one.\n\nChammas: When we’re talking about the Galvin situation, there are a number of issues over a number of years …\n\nGould: I misled no one. I misled no one. Mind your words, son.\n\nSmith: Is there a chance he doesn’t even end up at the Bulldogs? Cause I’m hearing that his first preference is Parramatta?\n\nChammas: I think, for a while, everyone thought he was going to parramatta. And the talk was, potentially, his manager wanted him to go to Parra, play with Mitchell Moses. But obviously, as I said, Cameron Ciraldo, Luke Vella – the relationship there and where the bulldogs are as a club; they’re sitting in top of the ladder. It’s a different situation to where Parramatta are. Parramatta are completely rebuilding. Perhaps he didn’t want to be part of that rebuild. Perhaps what he saw at Canterbury or heard from the club was what interested him the most.\n\nGould: You’re guessing.\n\nChammas: No, I’m not guessing.\n\nGould: You haven’t spoken to Lachlan Galvin, you’re guessing. You’re putting out a heap of scenarios.\n\nChammas: But you’ve told me you haven’t spoken to Lachlan Galvin either, so you and I are as equally educated on the situation.\n\nGould: Yeah, but I’m not commenting on what he’s saying.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/national-news-live-coalition-division-king-charles-state-of-origin-20250528-p5m2rm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Coalition back together after Ley, Littleproud strike agreement; Fatima Payman alleges sexual, racial comments against older male colleague",
        "publish_date": "Wed, 28 May 2025 11:44:15 +1000",
        "category": "entertainment",
        "authors": [
            "Christopher Harris"
        ],
        "text": "The United Nations is poised to knock back Australia’s application for World Heritage listing for the Murujuga rock art in Western Australia, recommending the “total removal of degrading acidic emissions” that are impacting on the rock carvings, or petroglyphs.\n\nThe largest source of emissions is Woodside’s North West Shelf gas processing facility, which is less than 10km from more than 1 million petroglyphs in the Murujuga National Park – some of which are 50,000 years old.\n\nThousands of pieces of Aboriginal rock art dating back tens of thousands of years are found on the Burrup Peninsula, or Murujuga.\n\nEnvironment Minister Murray Watt is due to decide this week on Woodside’s application to extend its North West Shelf operations for another 45 years.\n\nIn a draft decision in the provisional agenda for UNESCO’s July meeting, UNESCO recommended Australia’s application be rejected, due to the impact of emissions on the integrity of the rock art.\n\nThe Climate Council has described Woodside’s proposal as a “climate bomb”, which would unleash 4.4 billion tonnes of climate pollution over the life of the project.\n\nUNESCO recommended Australia’s application for World Heritage status be referred back to the Australian government to allow it to “ensure the total removal of degrading acidic emissions” and to prevent any further industrial developments adjacent to and within the Murujuga cultural landscape.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/origin-i-our-experts-make-the-call-on-who-will-win-and-why-20250527-p5m2lh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Origin I: Our experts make the call on who will win and why",
        "publish_date": "Wed, 28 May 2025 11:40:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "Origin I: Our experts make the call on who will win and why\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/saves-screamers-and-pitch-invasions-inside-the-melbourne-derby-20250526-p5m26r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Saves, screamers, and pitch invasions: Inside the Melbourne derby",
        "publish_date": "Wed, 28 May 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Roy Ward",
            "Brittany Busch"
        ],
        "text": "Muscat shouted at the referee as he left the field and Zahra lay on the ground clutching his leg. “Wild, reckless,” commentator Paul Trimboli exclaimed. “He just flew into that tackle. He’s mistimed it horrendously … He’s gone way over the ball. That is dangerous from Muscat.” Kevin Muscat was given a straight red card for the tackle on Heart’s Adrian Zahra. Credit: Fox Sports Muscat was widely condemned, and the incident sparked talk about the Victory bruiser’s retirement. Muscat swiftly apologised. “Firstly having had a sleepless night myself I felt it was important that I did front up and accept everything that is going to be coming my way in relation to bans … and also being criticised [over] my character, my performance [and] all that comes with it,” he said. “I’m going to have to sit here and accept full responsibility for it.”\n\nThompson at the death: December 22, 2012 The sides were set to leave their 2012 encounter at AAMI Park with an unsatisfying 1-1 score when Victory star Archie Thompson wrote his own page into the derby history books. Marco Rojas, running at pace, threaded the ball through to the striker in the 92nd minute and Thompson seized the moment to slot an audacious lob just under the crossbar. Defender Aziz Behich booted the ball out of the goal, but it was in vain as the referee declared it had cleared the line. The last-minute attack, which took place just minutes after Heart had snagged an equalising score, handed Victory a stunning 2-1 win.\n\nLoading Thompson stripped off the “high-vis” jersey Victory had donned that night and swung it around in celebration as the 26,000-strong crowd erupted. The win put Victory in third place on the ladder and left Heart languishing third from bottom. Cahill’s wonder goal: October 15, 2016 Tim Cahill put his stamp on the derby in front of more than 43,000 fans with a stunning volley 26 minutes into a bumper clash between City and Victory at Marvel Stadium in 2016.\n\nCahill, in his A-League debut following a stellar career playing for Australia and internationally, advanced as the ball bounced away from the centre circle towards the goal, more than 40 metres away. “What a hit!” commentator Simon Hill roared as Cahill’s long-distance volley went into the top corner. “The Socceroos great announcing his arrival in some style.” The 36-year-old celebrated by taking on his favourite boxing opponent: the corner flag. Cahill’s miraculous goal paved the way for a scoring blitz from City, who went on to win 4-1 following goals from Bruno Fornaroli, Luke Brattan and Fernando Brandan.\n\nCahill would score against Victory again in their next clash in December, but this volley will always rank among the best goals in derby history. The “darkest day” in Australian soccer: December 17, 2022 Hundreds of Victory’s active supporters stormed the field during the derby in 2022, in what has been dubbed the darkest moment in A-League history and left a cloud hanging over the club to this day. The attack on City goalkeeper Tom Glover. Credit: Ten Hooligans broke down the field barriers in the 22nd minute of play, running onto the pitch with lit flare and tearing at the goal net.\n\nPlayers and officials were attacked, with one man throwing a bucket of sand at City keeper Tom Glover, cutting his head open, while others targeted referee Alex King. Scores of invaders were later banned for life and several were charged by police. Fans from both clubs had been protesting the A-League’s decision to move the grand final to Sydney. Melbourne Victory were fined more than $500,000 – the largest fine in A-League history – and continues to deal with the fallout with a suspended 10-point deduction hanging over them. Play was abandoned on the night, but the game was completed months later, restarting from the 22nd minute and ending with City winning 2-1.\n\nIzzo the hero: May 5, 2024 Victory and City were fighting for a place in the semi-finals last year when the game went to penalties (scores tied 1-1 at the end of extra time), before Victory keeper Paul Izzo emerged as the hero for the side in navy blue. Izzo let one penalty in early before Victory equalled. Boos rang out from Victory fans as City made a second attempt but Izzo blocked the ball. Victory capitalised, taking the score to 2-1. Izzo ultimately saved two more and then calmly converted his own penalty shot, sending his team to the semi-final against Wellington Phoenix after the 3-2 penalty win.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/mediterranean-one-pan-fish-with-cherry-tomatoes-olives-and-cannellini-beans-20250528-p5m2uy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mediterranean one-pan fish with cherry tomatoes, olives and cannellini beans",
        "publish_date": "Wed, 28 May 2025 11:19:16 +1000",
        "category": "lifestyle",
        "authors": [
            "Sarah Pound"
        ],
        "text": "Step 1 Heat the olive oil in a large, shallow frying pan or a shallow casserole dish over medium heat. Add the onion and cook, stirring, for 2-3 minutes or until soft and translucent. Add the garlic and cook, stirring, for 2 minutes. Stir in the capers and cook, stirring, for 1 minute.\n\nStep 2 Add the cherry tomatoes to the pan, stir and cook for 5-6 minutes, until the tomatoes have softened. Stir in half of the olives and the passata and cook for 3-4 minutes. Using a fork, gently press the cherry tomatoes so they burst and release their juices into the sauce. Add the cannellini beans and stir through gently.\n\nStep 3 Nestle the fish fillets into the sauce so they sink about halfway in. Scatter in the roasted red peppers. Cover with a lid on and cook for 6-8 minutes to allow the fish to cook through.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-wall-street-rallies-after-trump-tariff-delay-20250528-p5m2r6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX opens higher ahead of inflation figures, boosted by Wall Street rally",
        "publish_date": "Wed, 28 May 2025 11:13:22 +1000",
        "category": "finance",
        "authors": [
            "Frances Howe"
        ],
        "text": "The Australian sharemarket has opened higher on Wednesday, tracking the biggest rally on Wall Street in more than two weeks following Donald Trump’s latest tariff mood swing.\n\nThe S&P/ASX 200 rose by 40.10 points, or 0.5 per cent, to 8447.70 as of 10.42am AEST, with nine of the 11 industry sectors advancing, led by tech, energy and consumer discretionary stocks. The Australian dollar retreated, trading 0.6 per cent lower at 64.43 US cents just before 10.30am AEST.\n\nWith tariff concerns easing after the US president’s backtracking from his trade threats against Europe, local investors are turning their focus on the inflation figures, which the Australian Bureau of Statistics releases later this morning.\n\nWall Street has bounced back in its first trading session of the week. Credit: AP\n\nWestpac chief economist Luci Ellis predicts the inflation rate for April will fall through the floor of the Reserve Bank’s target range to 1.9 per cent, from 2.4 per cent in March, leaving the door open for more rate cuts over the coming months which could further stimulate consumer spending.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-carer-charged-over-crash-that-killed-two-clients-20250527-p5m2i0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Council, police file order against Story Bridge protest | Carer charged over crash that killed two clients",
        "publish_date": "Wed, 28 May 2025 10:43:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "Cheaper jet fuel and more seat availability have driven down prices for Australian jetsetters and the price relief is expected to continue.\n\nDomestic economy airfares were 12 per cent cheaper in the first two months of 2025 than the same time last year, data compiled by corporate travel advisers FCM Consulting shows.\n\nThat represents $29 off the average ticket price.\n\nThat Bali getaway might be about to become even cheaper. Credit: Wolter Peeters\n\nWhile Qantas Group earnings before tax soared to $1.5 billion in the last six months of 2024, and Virgin Australia also announced record profits, market dynamics since the new year have benefited travellers.\n\nGlobally, jet fuel is down almost 17 per cent compared to the 2024 average, driven in part by economic uncertainty from US President Donald Trump’s trade war curtailing demand for oil.\n\nFuel is the largest operating cost for airlines, so fluctuations flow through to airfares.\n\nOngoing weakness in jet fuel prices will continue to put downward pressure on airfares in coming months, the Australian Competition and Consumer Commission predicts.\n\nAAP",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/have-a-heart-for-your-health-advocates-urge-amid-rising-af-rates/4avhly6te",
        "title": "Have a heart for your health, advocates urge amid rising AF rates",
        "publish_date": "Wed, 28 May 2025 01:16:29 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nTanya Hall is the founder and CEO of an advocacy group in Perth known as hearts4heart.\n\n\n\n\n\n\"So I was diagnosed with congenital heart disease at six months old and I had my first heart operation at nine. But when I was 17, I started having symptoms of atrial fibrillation. And after atrial fibrillation progressing over 10 years I was then diagnosed, and had treatment to improve my symptoms and quality of life.\"\n\n\n\n\n\nTanya is one of the more than half a million Australians who have atrial fibrillation.\n\n\n\n\n\nCardiologist Dr Tomos Walters from the Queensland Cardiovascular Group in Brisbane says it's a lifelong, progressive condition.\n\n\n\n\n\n\"Atrial fibrillation or AF is a disease in which the normal, regular rhythm is replaced by electrical chaos in the atria, the filling chambers at the top of the heart. That then makes the ventricles, the pumping chambers, beat in an irregularly irregular manner, which significantly reduces the mechanical efficiency of the heart.\"\n\n\n\n\n\nDr Walters says atrial fibrillation - or AF - can affect different people in different ways.\n\n\n\n\n\n\"There are some people who just don't feel it. There are some people who are incapacitated by it, and most people are somewhere in between. The symptoms include palpitations, chest pain, breathlessness, dizziness, fatigue.\"\n\n\n\n\n\nBut it's those varied impacts that have advocates and medical professionals concerned.\n\n\n\n\n\nAtrial fibrillation is already the leading cause of cardiovascular hospitalisations, resulting in a direct annual cost of approximately $1.63 billion.\n\n\n\n\n\n\"AF imposes very large burden on the Australian healthcare system. It's one of the most common reasons for emergency department presentation, for hospital admission.\"\n\n\n\n\n\nAF is also responsible for an estimated one in four strokes and a higher risk of dementia.\n\n\n\n\n\nLittle wonder then that Dr Walters has called it one of the largest, and most pressing, public health epidemics, as the population grows older.\n\n\n\n\n\n\"The things we worry about in a patient with AF include the risk of having a stroke; the risk that the AF, if left untreated, can start to affect their heart structure and function. It can cause heart failure in some patients. And of course, we worry about the symptoms and the effect on quality of life.\"\n\n\n\n\n\nPart of the concern is that an estimated 30 percent of people with AF don't even know they have the condition.\n\n\n\n\n\nGeelong mother of two Justine Martin says she found out by chance.\n\n\n\n\n\n\"I was diagnosed with multiple sclerosis in 2011, and I developed this butterfly feeling in my chest, which I put down to being MS. I got rushed to hospital with a really bad headache, and they put me on an ECG machine and discovered that my resting heart rate was 155 beats a minute, which then led to the diagnosis of AF.\"\n\n\n\n\n\nThe concern for advocates is that those who don't know they have AF won't be able to take preventative action to stop the disease from progressing, or avoid complications.\n\n\n\n\n\nDr Emily Kotschet is a cardiologist at Holmesglen Private Hospital in Melbourne.\n\n\n\n\n\nShe says for those that do eventually have symptoms, some might not realise what they are feeling is actually coming from the heart.\n\n\n\n\n\n\"So one in three Australians didn't want to present when they had their first symptoms and waited for four episodes before they sought medical attention… often waiting to see if it'll just settle on its own, or maybe dismissing the significance of it.\"\n\n\n\n\n\nShe says that's a particular issue for women - for whom cardiac issues don't necessarily look the same as they might for men.\n\n\n\n\n\n\"So women often present with different symptoms, so maybe not classic irregular palpitations. They might feel short of breath or just fatigue, unable to do their usual activities.\"\n\n\n\n\n\nThat lack of awareness about what heart problems might look like has been a longstanding concern.\n\n\n\n\n\nIn 2023, Hearts4heart did a comprehensive nationwide survey that found one in three Australians (or around 6.7 million people) were completely unaware atrial fibrillation existed.\n\n\n\n\n\nA Boston Scientific commissioned survey from 2025 has suggested very little has changed.\n\n\n\n\n\nTanya Hall says it's best to not wait to talk to your GP about your concerns.\n\n\n\n\n\n\"Be heart smart. If there’s a family history of heart disease, if you’re having any symptoms, or you’re over the age of 50, then please go and get your heart checked.\"\n\n\n\n\n\nBack in Perth, Tanya Hall says her condition is now under control.\n\n\n\n\n\nShe says it's time for awareness of atrial fibrillation to be raised, so that it helps everyone.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/domestic-airfares-have-been-cheaper-this-year-and-could-stay-low-for-a-simple-reason/w1mgwdqfq",
        "title": "Domestic airfares have been cheaper this year, and could stay low for a simple reason",
        "publish_date": "Tue, 27 May 2025 22:36:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Jet fuel prices have dropped globally reducing operating costs for airlines.\n\nThe capacity of seats on planes has also increased.\n\nAustralia's airlines are launching new international routes later this year.\n\nCheaper jet fuel has driven down airfares for Australian travellers, and the price relief is expected to continue.\n\n\n\n\n\nDomestic economy airfares were 12 per cent cheaper in the first two months of 2025 than the same time last year, according to data compiled by corporate travel advisers FCM Consulting.\n\n\n\n\n\nThat represents $29 off the average ticket price.\n\n\n\n\n\nThe price drop comes despite the Australian Competition and Consumer Commission (ACCC) saying limited domestic competition was helping the country's dominant airline groups — Qantas and Virgin — boost their profit margins.\n\n\n\n\n\nWhile Qantas Group earnings before tax soared to $1.5 billion in the last six months of 2024, and Virgin Australia also announced record profits, market dynamics since the new year have also benefited travellers.\n\n\n\nREAD MORE Could paying Australians for travel frustrations drive up airfares?\n\nJet fuel dropping in cost\n\nGlobally, jet fuel prices are down almost 17 per cent compared to the 2024 average, driven in part by economic uncertainty stemming from United States President Donald Trump's trade war , which has curtailed oil demand.\n\n\n\n\n\nFuel is the largest operating cost for airlines, so fluctuations in fuel prices are passed through to airfares.\n\n\n\nOngoing weakness in jet fuel prices is expected to continue putting downward pressure on airfares in the coming months, according to the ACCC.\n\n\n\n\n\nFCM Consulting director Felicity Burke said Australia and the broader Asia-Pacific region had experienced sharper drops in fares compared to the rest of the world.\n\n\n\n\n\n\"We've been saying for a long time now that global capacity increases and other factors like jet barrel cost reductions would go hand-in-hand with airfare price drops in various regions, and this is one of several reasons that we're now seeing this come to fruition,\" she told the Australian Associated Press.\n\n\n\nMore seats available\n\nAnother factor in the cost of air travel is seat availability.\n\n\n\n\n\nAround the world, more seats are available on planes, contributing to falling costs for travellers on international economy flights.\n\n\n\n\n\nGlobal capacity in May was 7 per cent higher than in 2019 and 5 per cent higher than at the same time last year.\n\n\n\n\n\nInternational economy airfares out of Australia dropped 5 per cent in January and February compared to the same period last year, while business class tickets fell by 3 per cent.\n\n\n\nNew flights on the way\n\nMore routes are set to launch in the second half of this year, with Virgin's partnership with Qatar Airways adding further competition on the highly trafficked Australia to Europe corridor.\n\n\n\n\n\n\"Through this partnership with a world-leading global airline, we expect to not only create more choice for travellers but also drive healthy competition, which typically helps to place downward pressure on fares over time,\" a Virgin Australia spokesperson told AAP.\n\n\n\n\n\nQantas will also launch new routes in late 2025, including Adelaide to Auckland and Perth to Auckland, as well as Perth to Johannesburg.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/wa-government-unveils-stolen-generations-redress-scheme/5gxs8jq4e",
        "title": "WA Government unveils Stolen Generations redress scheme",
        "publish_date": "Tue, 27 May 2025 10:13:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/telstras-new-5-year-plan-and-strata-capital-works-funding/ttw928a6f",
        "title": "Telstra's new 5 year plan and strata capital works funding",
        "publish_date": "Tue, 27 May 2025 07:22:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/ato-whistleblower-richard-boyle-strikes-plea-deal-may-avoid-jail/aocafro2k",
        "title": "'Superhero': ATO whistleblower Richard Boyle strikes plea deal, may avoid jail",
        "publish_date": "Tue, 27 May 2025 06:36:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Tax office whistleblower Richard Boyle, who exposed heavy-handed debt collection tactics, has struck a plea deal with prosecutors.\n\n\n\n\n\nThe 49-year-old has admitted to four criminal charges linked to his exposure of unethical debt recovery practices at the Australian Taxation Office (ATO).\n\n\n\n\n\nBoyle appeared in the Adelaide District Court on Tuesday, where he pleaded guilty to disclosing protected information to another entity, making a record of protected information, using a listening device to record a private conversation and recording other people's tax file numbers.\n\n\n\n\n\nThe Commonwealth Director of Public Prosecutions withdrew a further 15 charges, while another five charges were dropped in March.\n\n\n\nWhat did Richard Boyle do?\n\nBoyle, a former ATO debt collection officer, raised concerns internally about debt recovery practices in October 2017, when he grew worried about operations in the tax office.\n\n\n\n\n\nBelieving his complaints had been ignored, he went public on the ABC's Four Corners program about the tactics used against taxpayers who owed the ATO money.\n\n\n\n\n\nIn 2019, he was charged with 66 criminal offences, but many of them were dropped over time.\n\n\n\nHow did his supporters react to the plea deal?\n\nOutside court, Whistleblowers Justice Fund founder Rex Patrick said Boyle had \"pleaded guilty to helping all Australians by disclosing poor conduct by the tax office, who were stripping funds from businesses who were in distress\".\n\n\n\n\n\n\"He should be wearing a big S on his chest, as a superhero, instead of a conviction,\" the former senator said.\n\n\n\n\n\nAll of the charges Boyle admitted were criminal offences with both financial penalties and a maximum two-year prison sentence, he said.\n\n\n\n\n\n\"I understand that in pleading guilty, he will avoid a custodial sentence, but he may well still be convicted, which is something he'll have to wear very heavily around his neck every time he applies for a job,\" Patrick said.\n\n\n\nREAD MORE Independent MP Andrew Wilkie pushes for stronger whistleblower protections\n\n'Heartbreaking day'\n\nThe Human Rights Law Centre's Kieran Pender said it was a \"heartbreaking day for Richard Boyle and whistleblowers in Australia\".\n\n\n\n\n\n\"He should never have been prosecuted, and his case clearly demonstrates how our laws are failing to protect people who bravely speak up,\" he said.\n\n\n\n\n\n\"Prosecuting whistleblowers has a chilling effect on truth and transparency, and sends a clear message to prospective whistleblowers that if you speak up you will face punishment.\n\n\n\n\n\n\"The re-elected Albanese government must urgently reform the law to prevent a repeat of this prosecution and commit to establishing a federal Whistleblower Protection Authority.\"\n\n\n\n\n\nLast year, the South Australia Court of Appeal ruled Boyle was not protected by federal whistleblowing laws — because the charges related not to his whistleblowing, but steps Boyle had taken in preparation to blow the whistle internally, including taking photos of documents and recording conversations.\n\n\n\n\n\nBoyle returns to court for sentencing submissions on 1 August.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/wa-stolen-generation-survivors-eligible-for-redress/cmtcneyb1",
        "title": "WA Stolen Generation survivors eligible for redress",
        "publish_date": "Tue, 27 May 2025 06:10:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sporting-competition-with-openly-doped-athletes-set-to-launch-in-2026/ap2ll4oh3",
        "title": "Sporting competition with openly doped athletes set to launch in 2026",
        "publish_date": "Tue, 27 May 2025 04:39:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\n\"We live in a performance-enhanced society. Men and women get nose jobs. Women get boob jobs and butt jobs.\"\n\n\n\n\n\nVictor Conte masterminded some of the biggest doping scandals in athletics, and he says he sees the appeal of Enhanced Games, where athletes use drugs to boost their performance.\n\n\n\n\n\nThe American was involved in setting up the Bay Area Laboratory Co-operative, and spent time in prison for illegally distributing anabolic steroids.\n\n\n\n\n\nHe argues using drugs to enhance athletic performance simply reflects the realities of modern life.\n\n\n\n\n\n\"Men take Prozac to enhance their productivity at work. Men take Viagra to enhance their performance and turn themselves from a dud into a stud under the sheets. So I get it. These athletes are wanting to enhance their performance, but people in everyday life are routinely enhancing their performance.\"\n\n\n\n\n\nThe Enhanced Games are set to launch in Las Vegas next May with their inaugural competition.\n\n\n\n\n\nSportspeople using substances banned in official competitions will compete in swimming, athletics and weightlifting.\n\n\n\n\n\nThe founder of the games, Dr Aron D'Souza, believes they can transform sports science.\n\n\n\n\n\n“I think for a few years, there will be a world of natural sport run by the Olympics and a world of enhanced sport run by us. But ultimately, world records matter. As human beings, we're only interested in seeing the fastest humans. We want to see the very best of our species. And we're not interested in the best amateur, right, or the best pro. We're actually just interested in the best.”\n\n\n\n\n\nPrize money is also a factor.\n\n\n\n\n\nParticipants could earn up to $500,000 per event plus bonuses for surpassing a world record mark.\n\n\n\n\n\nEnhanced Games competitor Kristian Gkolomeev competed in four Olympics but never made the podium.\n\n\n\n\n\nAccording to D'Zouza, the Greek-Bulgarian swimmer has since surpassed one of his sport's greatest achievements.\n\n\n\n\n\n“Kristian Gkolomeev is now the fastest swimmer in human history. And he did so at 31 years old, five to 10 years later than is generally regarded as peak swimming career. So he's like, should be retired, but in fact, he's swimming faster than any human being has ever done so. Why? Because he used technology and science to enhance his performance. Once the world realises that, I think everyone is going to want it.”\n\n\n\n\n\nD'Souza argues that doping in professional and amateur sport is rampant despite efforts to eliminate the use of banned substances, leading to secretive and unsafe drug use.\n\n\n\n\n\nGkolomeev swam two hundredths of a second faster than the 50m freestyle official world record that has stood for more than 15 years.\n\n\n\n\n\nHe says the Enhanced Games are about creating a level playing field where all athletes are open about what they are doing to enhance their performance.\n\n\n\n\n\n“I mean I know that you know probably in my career there are some athletes that they were not playing by the rules, you know? But you know I can't prove and never got caught, but as athletes sometimes we understand what's catchy, what's not. But yeah, there's definitely frustration, and that was a big reason that I chose to go to the Enhanced Games, is the level playing field.”\n\n\n\n\n\nFor swimming, the 50m freestyle,100m freestyle, 50m butterfly and 100m butterfly are on the agenda.\n\n\n\n\n\nAthletics has the 100m sprint along with the 100m and 110m hurdles, while weightlifting will feature the snatch, and clean and jerk.\n\n\n\n\n\nRetired Australian world champion swimmer James Magnussen has signed up to take banned performance-enhancing drugs in an attempt to surpass Cesar Cielo's 50m freestyle record.\n\n\n\n\n\nMagnussen makes no apologies about participating in the Enhanced Games training program.\n\n\n\n\n\n\"Forget about the protocols, forget about the world record, all of that stuff. As a mature-age now athlete again, I was just so happy to be back to be training, to be working with world-class professionals and to have a chance to compete again.”\n\n\n\n\n\nThe World Anti-Doping Agency staunchly opposes the project, warning athletes that they risk bans and their health.\n\n\n\n\n\nWADA Science Director Olivier Rabin says long-term health risks can be hard to assess with on-the-spot checks.\n\n\n\n\n\n\"We think this is dangerous and an irresponsible concept by all means. I mean, again, health is at the very heart of what we are doing at WADA and also in the fight against doping in sport. This is very much embedded into the code, into the way we work to establish prohibited substances and methods, and having a free pass to use whatever substance or whatever method to enhance performance without consideration for health for us is absolutely nonsensical.\"\n\n\n\n\n\nMr Rabin also says it would be complicated for athletes to compete in clean sport again after participating in the Enhanced Games.\n\n\n\n\n\n\"They would probably risk committing an anti-doping rule violation. Because, as you know, we can prosecute an anti-doping rule violation for a period of 10 years based on sample analysis or testimonies. So it's not just testing; it's also the fact that you benefited at some point from a performance-enhancing substance. And we know today that there are, for some of them, long-term beneficial effects, in particular on the muscle, of using performance-enhancing substances.\"\n\n\n\n\n\nSports Integrity Australia issued a statement warning athletes of risks to their health, and slamming the games as dangerous, unethical and damaging to sport.\n\n\n\n\n\nThe group's Athlete Advisory Group says normalising performance-enhancing drugs promotes doping as entertainment.\n\n\n\n\n\nMr Rabin agrees.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/three-australian-states-hit-with-electricity-price-hikes/nitysa17s",
        "title": "Three Australian states hit with electricity price hikes",
        "publish_date": "Tue, 27 May 2025 03:33:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralians are increasingly turning up the heat in their homes as winter sets in.\n\n\n\n\n\nThe Grattan Institute's Energy Director Alison Reeve also recommends picking up the phone to find better deals on what we pay for our energy.\n\n\n\n\n\n\"Most of us are actually on a contract that is not the best offer we could have. So there's also a lot that individuals can do.\"\n\n\n\n\n\nThe Institute's call follows confirmation that the Australian Energy Regulator has approved an increase to the amount of electricity residents pay in three states - New South Wales, Queensland and South Australia.\n\n\n\n\n\nAlison Reeve says that's because of rising costs to the delivery and production of power.\n\n\n\n\n\n\"That sort of anticipated higher future cost of energy is a little more acute in New South Wales and that's because that's where the next coal fire power station to close will be closing... The other thing with NSW is they are doing quite a large investment in their network. Some of that is increasing resilience to things like storms and floods, which is very pertinent this week when we look at what's happened on the north coast of New South Wales. But it's also an investment to support greater uptake of electric vehicles and rooftop solar by consumers, and to pay for the new transmission lines that they are having to build in order to build replacement capacity, to replace retiring coal. So all of those are pushing up the cost of the poles and wires rather than the electricity itself in New South Wales.\"\n\n\n\n\n\nThis means that New South Wales residents face the steepest hike, expected to be paying out up to 228 dollars more each year - with regional customers seeing their annual bills to jump to over 2740 dollars a year - the highest in the country.\n\n\n\n\n\nIn south-east Queensland, an average household on a default contract will soon pay around 77 dollars more a year or just over 2100 dollars a year while in South Australia the annual bill will be up 71 dollars, bringing the average annual cost to just over 2300 dollars.\n\n\n\n\n\nIn Victoria the prices are set by the Essential Services Commission - and their average household bills will increase by between 6 to 25 dollars.\n\n\n\n\n\nThese new rates are the maximum retailers can charge for a default contract.\n\n\n\n\n\nBut Cassandra Goldie from the Australian Council of Social Service is concerned - saying the increase will hit those hardest who can least afford it: the roughly three million people who are living in poverty.\n\n\n\n\n\n\"So low income people are often hit with a triple whammy here, where they're paying proportionate to their income five times more than everybody else on energy bills; they're using more energy because their properties are poor quality; and of course they're often the ones with multiple other costs that they can't afford to meet.\"\n\n\n\n\n\nThe federal government says it understands many are still feeling cost of living pressures - and they have already extended the energy bill relief fund to help.\n\n\n\n\n\nACOSS says that is not the right approach.\n\n\n\n\n\n\"One off rebates are not the solution. We've spent over six billion dollars in those one off payments that keep getting extended. We would much rather see first of all boosting home energy upgrades money to get to all low income housing being at a good energy performance standard, solar panels, access to renewable energy, insulation etc. Secondly, to help people who've accumulated big energy debt to have that debt written off.\"\n\n\n\n\n\nThe federal government says it already views renewable energy as part of the solution.\n\n\n\n\n\nThe Prime Minister says they want to bring on those types of sources to bring down the overall cost for everyone on a long term basis.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/books/what-has-the-pornification-of-pop-culture-done-to-women-20250526-p5m251.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What has the ‘pornification’ of pop culture done to women?",
        "publish_date": "Wed, 28 May 2025 12:00:00 +1000",
        "category": "finance",
        "authors": [
            "Jenna Price"
        ],
        "text": "Author and journalist Sophie Gilbert. Credit: Urszula Soltys\n\nFor me, there is a little too much about reality television, but it’s a big part of the culture so there’s no way of avoiding it, from Big Brother and An American Family. And Gilbert introduces me to one I’d never heard of before: Who Wants to Marry a Multi-Millionaire, which she describes as “the beginning of reality TV’s determination to view twenty-first century women through a nineteenth century frame: Jane Austen heroines who, deprived of agency or power of their own, could only compete to claim status and self-betterment through their looks, their alliances and their rivalries”. Pretty much.\n\nOr, as Jerry Hall said in 1985, “My mother said it was simple to keep a man, you must be a maid in the living room, a cook in the kitchen and a whore in the bedroom.” Hall updated it: “I said I’d hire the other two and take care of the bedroom bit.”\n\nBut by far the most striking, most frightening, aspect of the book is the way in which Gilbert has both drawn on, and expanded, the work of philosopher Amia Srinivasan, The Right to Sex and Gail Dines’ Pornland: How Porn Has Hijacked Our Sexuality. Porn trains us.\n\nPorn trains us in how to be women. And worse, it trains men in how to treat women. “It has trained a good amount of our popular culture ... to see women as objects, as things to silence, restrain, fetishise, or brutalise,” says Gilbert. The fleshed-out concept of pornography as a textbook for how women must be in their lives is terrifying. Now I’ve read Gilbert’s persuasive arguments, I’m embarrassed I’ve ever been persuaded otherwise. I’ve never felt so wrong in my life. There is now, she argues, a “pornification” of everything, including music.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/a-playful-meditation-on-the-hellscape-of-contemporary-literature-20250526-p5m2ar.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A playful meditation on the hellscape of contemporary literature",
        "publish_date": "Wed, 28 May 2025 12:00:00 +1000",
        "category": "entertainment",
        "authors": [
            "Declan Fry"
        ],
        "text": "There is a sense throughout that, smarmy as the narrator is, his desire to be a writer is merely incidental. He is described as having little mercy – a quality that seems to be borne out, given his treatment of Shales. Could it be mercy for himself too, though, that he lacks? Caught in his Tantalus visions of literary fame, he regularly conflates literature with the satisfaction of other desires (legitimacy, likeability, self-worth). He believes or wants to believe himself to be Brenda’s confidante and confessor. He would be better served learning to act as his own.\n\n“Fame is a form of incomprehension,” Borges observed, “perhaps the worst.” Cannily, Borges never bothered specifying whether this incomprehension belonged to the artist, their audience or both. There is an ironic edge to this aspect of the book. Amerena plays with questions of domination and subordination, both sexual and economic. (Regularly highlighting every abject and unseemly stitch of his characters, Amerena plays the dom.)\n\nLoading\n\nIn I Want Everything, the conniving opportunism and careerism of the present eclipse … well, everything. If Shales could become Australia’s greatest author, it wasn’t while donating her body to science and her soul to the industry. It was because she came of age in a country that offered its people something more than a series of transactional arrangements. Where authors once sought time and space to write, now they seek time and space to better leverage their brand.\n\nWas it always like this? A sense of parasitism, of being redundant and secondhand, has often haunted settler art in Australia. You can accuse Amerena of romanticising the past if you like. He isn’t alone. In any case, a romantic vision does not necessarily equate to an incorrect one. You may want everything, Amerena suggests, but first you’ll need to sell yourself out – along with your friends, enemies, colleagues, fans, associates, pets, peers and family – to get there.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/why-did-atc-members-look-a-gift-horse-in-the-mouth-20250528-p5m2tg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rosehill rejection: Why did ATC members look a gift horse in the mouth?",
        "publish_date": "Wed, 28 May 2025 11:59:22 +1000",
        "category": "sports",
        "authors": [
            "Andy Marks"
        ],
        "text": "Not since 100-to-1 outsider Prince of Penzance defied the odds to win the 2015 Melbourne Cup has a result so deeply confounded established racing logic. The rejection by members of the Australian Turf Club of a $5 billion proposal to sell Rosehill Gardens Racecourse to the NSW government comes close.\n\nChris Minns Credit: Aresna Villaneuva\n\nThe prospect of 25,000 new homes on a site situated in the heart of Australia’s fastest-growing region were stakes Premier Chris Minns had no option to mount. Under the National Housing Accord he has committed to delivering 377,000 new homes across NSW by 2029. Weigh up the racecourse’s adjacency to a newly-constructed light rail network, a coming metro line and a surging jobs hub in Parramatta, and the odds looked impossible to ignore.\n\nThe NSW government has made no secret of the centrality of housing supply to its agenda. From its establishment last year of the Housing Delivery Authority, through to its pursuit of its Transport Oriented Development initiative, its colours were clear and unambiguous.\n\nRecent measures by the premier to upscale the state’s production of modular homes – and the contingent manufacturing jobs boost – only upped the stakes. As did the commitment from Peter V’landys, chief executive and board member of Racing NSW, to “ensure the revenue derived from the [Rosehill] proposal is reinvested to benefit the racing industry as a whole”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/coalition-split-over-after-little-more-than-a-week-20250528-p5m2w5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Coalition split over after little more than a week",
        "publish_date": "Wed, 28 May 2025 11:57:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "Coalition split over after little more than a week\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/this-is-not-a-pop-band-as-a-packed-melbourne-room-reflected-it-s-something-more-unusual-20250525-p5m20c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "When she starts singing, the crowd falls into complete silence",
        "publish_date": "Wed, 28 May 2025 11:57:45 +1000",
        "category": "entertainment",
        "authors": [
            "Vyshnavee Wijekumar",
            "Michael Dwyer"
        ],
        "text": "The stage is minimalist, adorned with a side table laden with a vase of flowers, a globe and an array of lamps. Occasionally there’ll be a lighting effect, like a spotlight that emulates the moon or a tortoise shell speckled design projected onto the back curtain. Loading The crowd is tentative about applauding, waiting for a conclusive indication that she’s finished before clapping between tracks. Hardly anyone raises their phone to record, and when they do, she kindly asks them to stop. The performance goes for just under two hours, including the encore. A long time to be standing, even for the most dedicated fan. A couple of audience members even faint. Seating would have ensured a comfortable concert experience and suited the intimate atmosphere. A captivating performance, where you surrender to Aoba’s fantasy and detach from the chaos of the outside world.\n\nReviewed by Vyshnavee Wijekumar\n\nMUSIC\n\nFloodlights ★★★\n\nForum Melbourne, May 24 Smoke, an immense cage of light, an eager rush onto one of Melbourne’s most storied stages, and a hometown heroes’ welcome that swells the room. Floodlights’ night is a triumph already. Alive (I Want To Feel) is heralded by the lone trumpet of Sarah Hellyer: the bugler in the face of a gathering storm. And alive we feel. Melbourne rock band Floodlights at the Forum on Saturday night. Credit: Martin Philbey Floodlights are no pop band; no hits or Hottest 100 contenders, though their second album, Painting of My Time, was shortlisted for the 2023 Australian Music Prize. What tonight’s packed room reflects is more unusual: a serious following for serious music, with a gritty, localised aesthetic that more tenderly echoes Midnight Oil, The Triffids, Goanna – bands that tried to make sense of a country and its shadows. Tonight’s set leans hard on Underneath, the new album that continues the collective’s earnest search for meaning in a more inward direction. It’s less postcard-accessible than Small Town Pub and Nullarbor — older tunes that reliably lift the energy when long intros and murmured set-ups lead attention to drift. The new material is thematically dense, deliberate, sometimes elusive.\n\nBut JOY is pure high. Horses Will Run creeps and surges with dream-state drama. Frontman Louis Parsons doesn’t so much sing as declaim. He’s insistent, on edge, but rarely quite decipherable in the wiry ensemble attack. Hellyer’s heroic trumpet and wailing blues harp are recurring motifs, adding flashes of texture and tension that hark back to Aussie pub rock forebears. Louis Parsons, lead singer and guitarist for Melbourne rock band Floodlights, performs on stage at the Forum on May 24, 2025 Credit: Martin Philbey Mid-show, the piano-led Melancholy Cave wants to pull the room into a hush, but the crowd seems elsewhere. There’s a nagging sense that much of Underneath hasn’t quite landed yet—at least not live. But Buoyant is a late-set victory. As promised by the title, the room levitates. The crowd picks up the booming hook and sways into a proper old-school beer barn moment. And the sprawling 5AM is an epic set closer of slow-building, stadium-targeted proportions. “It’s been an emotional day for us,” Parsons offers gratefully before the single-song encore. Golden oldie Painting of My Time is the climax the night needs and again, the room rises to meet its all-in chanting refrain. It’s late, but a moment of exhilarated arrival that makes the journey worthwhile. Floodlights don’t always hit their mark. But there’s no question they know what they’re aiming for.\n\nReviewed by Michael Dwyer\n\nTHEATRE\n\nEndgames ★★★\n\nfortyfivedownstairs, until June 1 Three brief encounters with hideous men achieve a sense of twilit tragicomedy in the hands of the legendary Max Gillies. The legendary Max Gillies stars in Endgames at fortyfivedownstairs. Credit: Jodie Hutchinson With Endgames, Gillies rejoins director Laurence Strangio to present what’s in some ways a companion piece to their 2018 production of Krapp’s Last Tape – this time uniting the late Beckett work Eh Joe with an excerpt from Jack Hibberd’s classic monodrama A Stretch of the Imagination and Chekhov’s shambolic lecture On the Harmful Effects of Tobacco. Although Hibberd died last year, the curtain may long continue to fall on his immortal stage creation, Monk O’Neill. The misanthropic hermit in Stretch remains an incarnation of Australian male destructiveness and despair as appalling as he is compelling.\n\nHibberd used this character to diagnose cultural disease – from slashing misogyny to the rapacity and bad faith of colonialism – with a clear-eyed honesty that reshaped what was possible on our stages, and this excerpt includes Monk’s final will and testament, in which he gives: ‘All my lands and property, goods and chattels, to the Aboriginal peoples of Australia … On no account must my domain fall into the clutches of the predatory and upstart albino. I believe that the tides of history will swamp and wash aside this small pink tribe of mistletoe men, like insects …Change insects to dead leaves…’ With Endgames, Gillies rejoins director Laurence Strangio. Credit: Jodie Hutchinson One Tree Hill isn’t his to give, of course, and even Monk’s presence is erased in this version, largely an audio performance under crepuscular lighting. Gillies only appears once, rifle in hand, pursuing “an emu on heat” through the shadows; the brilliantly produced soundscape, however, overfills the physical absence – not least in the copious, and comically loud, urination which bookends the piece.\n\nIf that whets the appetite for a proper remount of Stretch, the audio monologue in Eh Joe is part of Beckett’s creative intention. The elderly loner here sits entombed in silence on a couch, as the accusatory voice of a woman (Jillian Murray) torments him with memory and regret. Loading As he seduced women in his life, so this internal voice now seduces him towards death, and Gillies’ wordless performance haunts with barely perceptible pain and confusion, with the agony of futile presence. Gillies has always had a talent for clowning, and in the Chekhov, he leans into a more overtly satirical sort of existential monologue. Nyukhin is a nervy, ineffectual public speaker. The man is supposed to be giving a charity lecture on the evils of tobacco, but it keeps turning into a digressive complaint about his wife and daughters, whom he fears. The actor fumbles his lines more than a few times, which matters less than it might when he’s playing a character who wishes he could erase his memory, and whose comical lack of authority is his defining feature.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/i-have-nothing-but-respect-for-gus-but-i-wouldn-t-be-doing-my-job-if-i-didn-t-question-him-20250527-p5m2oa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "I have nothing but respect for Gus, but I wouldn’t be doing my job if I didn’t question him",
        "publish_date": "Wed, 28 May 2025 11:53:18 +1000",
        "category": "finance",
        "authors": [
            "Michael Chammas"
        ],
        "text": "Chammas: Is it right that you weren’t even at the dinner the other night?\n\nGould: I haven’t met Lachlan Galvin. I haven’t met Lachlan Galvin. I really haven’t.\n\nChammas: Why do you not turn up to such a big decision?\n\nGould: What I do know is there is not another CEO, another general manager or a recruitment manager that has to sit on a panel and answer these questions, week in, week out.\n\nChammas: But that’s your choice, Gus.\n\nGould: I’m just saying, you’re getting a free licence here. What I’m saying is that these are things we do internally. Most of our issues internally are created by the gibber in the media, and what you want to do and extend on it.\n\nChammas: But it’s not gibber. We predicted it was going to end up (with Galvin) at the Bulldogs.\n\nGould: It is gibber. It is gibber. You say a lot of things that just aren’t true. And you say a lot of things that are exaggerated.\n\nChammas: We played a highlight clip of what you’ve said over the past few months.\n\nGould: You’re exaggerating. You’re exaggerating.\n\nChammas: Tell me which one?\n\nGould: All of it.\n\nChammas: Yeah, but we hit you about Lachlan Galvin …\n\nGould: You exaggerate. You exaggerate what’s going on and that makes it difficult for us. Now I don’t want to sit here and point out everything that you’ve done wrong. It doesn’t worry me and it doesn’t influence me, but it certainly has an effect on the players. And it has an effect on the players and their families. And that’s what you don’t see. And that’s the thing we’ve got to mop up. That’s the thing we’ve got to do.\n\nChammas: Is that why, then when we ask you about these things, is that why you mislead us with what the information is?\n\nGould: What have I misled you on?\n\nChammas: Well, the Galvin situation for one.\n\nGould: How have I misled you?\n\nChammas: Leo Thompson, you said that …\n\nGould: How did I mislead you on Lachlan Galvin?\n\nChammas: Gus, you were three steps ahead of everyone. To suggest that you didn’t think that Galvin could become …\n\nGould: You say that. You say that. How did I mislead you on Lachlan Galvin? Go back to everything I said.\n\nChammas: You said you weren’t interested?\n\nGould: What?\n\nChammas: You said you weren’t interested.\n\nGould: I never, at any time, said we weren’t interested. What I said was …\n\nChammas: He’s not in your plans.\n\nGould: … That we’re on a different course. He’s not in our plans because he wasn’t off contract until 2027. We couldn’t talk to him until November.\n\nChammas: Yeah, but we all knew he was going to leave. We all knew that was going t leave, you could see …\n\nGould: Well I didn’t know that. I didn’t know that.\n\nChammas: Oh come on, Gus.\n\nGould: No, you’re surmising that now because it’s happened. You want that to be the truth.\n\nChammas: At the time we were all saying ‘how is this going to be tenable?’\n\nGould: You want that to be the truth. That’s the scenario you want to create.\n\nChammas: You didn’t see it happening that way?\n\nGould: No, I didn’t see it happening that way at all. Not at all.\n\nChammas: I said to you, I joked about it on here that I don’t think it’s a coincidence that you ended your feud with Isaac Moses.\n\nGould: Why did you assume that I knew that? Why did you assume? Because it suits your narrative.\n\nChammas: It’s not about narratives.\n\nGould: It suits the media’s narrative.\n\nChammas: You ended your feud with Isaac Moses at the end of last year …\n\nGould: You go back and have a look at everything I’ve said about Lachlan Galvin and what transpired and everything I said was 100 per cent the truth, at the time.\n\nThe goalposts moved this week when they came back and said ‘he could be available now’.\n\nChammas: I don’t doubt that.\n\nGould: Which I took to the coaches and the coaches went and met with him, not me. The coaches went and met with him.\n\nChammas: I don’t doubt that.\n\nGould: I met with the manager Thursday after the coach came back and said ‘this could be an option’. It wasn’t my decision. Coach’s decision.\n\nChammas: So how does it sit with you then when Andrew Webster writes today (in The Australian) that there are clubs are up in arms, and you spoke about it, you have to come on here and …\n\nGould: I don’t give a damn about anything Andrew Webster writes, or any journalist in this town, to be honest.\n\nChammas: But the clubs are obviously starting to say, ‘why can Gus publicly court Lachlan Galvin, tell everyone he’s the best player …’\n\nGould: How did I publicly court Lachlan Galvin?\n\nChammas: Well, what you’ve said about him.\n\nGould: What did I say?\n\nChammas: You praised him like I’ve never heard before.\n\nGould: I’ve praised a lot of players. I’ve praised Cameron Smith. Did I ever offer you a contract, Cameron?\n\nCameron Smith: (Laughing) No\n\nGould: No, never. Nor would I think you’d ever become available.\n\nChammas: Do you care though, that other clubs are saying stuff to the NRL?\n\nGould: I don’t give a rats what other clubs think. You mistake me for someone who cares. What I don’t like is being sit here with a bloke like you, questioning my credibility.\n\nChammas: I’m not questioning your credibility.\n\nGould: You are. You said I misled the public. You said I misled you.\n\nChammas: That’s what everyone’s saying at the moment.\n\nGould: No, you’re saying it. You’re saying I misled you. I misled no one.\n\nChammas: When we’re talking about the Galvin situation, there are a number of issues over a number of years …\n\nGould: I misled no one. I misled no one. Mind your words, son.\n\nSmith: Is there a chance he doesn’t even end up at the Bulldogs? Cause I’m hearing that his first preference is Parramatta?\n\nChammas: I think, for a while, everyone thought he was going to parramatta. And the talk was, potentially, his manager wanted him to go to Parra, play with Mitchell Moses. But obviously, as I said, Cameron Ciraldo, Luke Vella – the relationship there and where the bulldogs are as a club; they’re sitting in top of the ladder. It’s a different situation to where Parramatta are. Parramatta are completely rebuilding. Perhaps he didn’t want to be part of that rebuild. Perhaps what he saw at Canterbury or heard from the club was what interested him the most.\n\nGould: You’re guessing.\n\nChammas: No, I’m not guessing.\n\nGould: You haven’t spoken to Lachlan Galvin, you’re guessing. You’re putting out a heap of scenarios.\n\nChammas: But you’ve told me you haven’t spoken to Lachlan Galvin either, so you and I are as equally educated on the situation.\n\nGould: Yeah, but I’m not commenting on what he’s saying.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/national-news-live-coalition-division-king-charles-state-of-origin-20250528-p5m2rm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Coalition back together after Ley, Littleproud strike agreement; Fatima Payman alleges sexual, racial comments against older male colleague",
        "publish_date": "Wed, 28 May 2025 11:44:15 +1000",
        "category": "entertainment",
        "authors": [
            "Christopher Harris"
        ],
        "text": "The United Nations is poised to knock back Australia’s application for World Heritage listing for the Murujuga rock art in Western Australia, recommending the “total removal of degrading acidic emissions” that are impacting on the rock carvings, or petroglyphs.\n\nThe largest source of emissions is Woodside’s North West Shelf gas processing facility, which is less than 10km from more than 1 million petroglyphs in the Murujuga National Park – some of which are 50,000 years old.\n\nThousands of pieces of Aboriginal rock art dating back tens of thousands of years are found on the Burrup Peninsula, or Murujuga.\n\nEnvironment Minister Murray Watt is due to decide this week on Woodside’s application to extend its North West Shelf operations for another 45 years.\n\nIn a draft decision in the provisional agenda for UNESCO’s July meeting, UNESCO recommended Australia’s application be rejected, due to the impact of emissions on the integrity of the rock art.\n\nThe Climate Council has described Woodside’s proposal as a “climate bomb”, which would unleash 4.4 billion tonnes of climate pollution over the life of the project.\n\nUNESCO recommended Australia’s application for World Heritage status be referred back to the Australian government to allow it to “ensure the total removal of degrading acidic emissions” and to prevent any further industrial developments adjacent to and within the Murujuga cultural landscape.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/origin-i-our-experts-make-the-call-on-who-will-win-and-why-20250527-p5m2lh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Origin I: Our experts make the call on who will win and why",
        "publish_date": "Wed, 28 May 2025 11:40:00 +1000",
        "category": "finance",
        "authors": [],
        "text": "Origin I: Our experts make the call on who will win and why\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/saves-screamers-and-pitch-invasions-inside-the-melbourne-derby-20250526-p5m26r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Saves, screamers, and pitch invasions: Inside the Melbourne derby",
        "publish_date": "Wed, 28 May 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Roy Ward",
            "Brittany Busch"
        ],
        "text": "Muscat shouted at the referee as he left the field and Zahra lay on the ground clutching his leg. “Wild, reckless,” commentator Paul Trimboli exclaimed. “He just flew into that tackle. He’s mistimed it horrendously … He’s gone way over the ball. That is dangerous from Muscat.” Kevin Muscat was given a straight red card for the tackle on Heart’s Adrian Zahra. Credit: Fox Sports Muscat was widely condemned, and the incident sparked talk about the Victory bruiser’s retirement. Muscat swiftly apologised. “Firstly having had a sleepless night myself I felt it was important that I did front up and accept everything that is going to be coming my way in relation to bans … and also being criticised [over] my character, my performance [and] all that comes with it,” he said. “I’m going to have to sit here and accept full responsibility for it.”\n\nThompson at the death: December 22, 2012 The sides were set to leave their 2012 encounter at AAMI Park with an unsatisfying 1-1 score when Victory star Archie Thompson wrote his own page into the derby history books. Marco Rojas, running at pace, threaded the ball through to the striker in the 92nd minute and Thompson seized the moment to slot an audacious lob just under the crossbar. Defender Aziz Behich booted the ball out of the goal, but it was in vain as the referee declared it had cleared the line. The last-minute attack, which took place just minutes after Heart had snagged an equalising score, handed Victory a stunning 2-1 win.\n\nLoading Thompson stripped off the “high-vis” jersey Victory had donned that night and swung it around in celebration as the 26,000-strong crowd erupted. The win put Victory in third place on the ladder and left Heart languishing third from bottom. Cahill’s wonder goal: October 15, 2016 Tim Cahill put his stamp on the derby in front of more than 43,000 fans with a stunning volley 26 minutes into a bumper clash between City and Victory at Marvel Stadium in 2016.\n\nCahill, in his A-League debut following a stellar career playing for Australia and internationally, advanced as the ball bounced away from the centre circle towards the goal, more than 40 metres away. “What a hit!” commentator Simon Hill roared as Cahill’s long-distance volley went into the top corner. “The Socceroos great announcing his arrival in some style.” The 36-year-old celebrated by taking on his favourite boxing opponent: the corner flag. Cahill’s miraculous goal paved the way for a scoring blitz from City, who went on to win 4-1 following goals from Bruno Fornaroli, Luke Brattan and Fernando Brandan.\n\nCahill would score against Victory again in their next clash in December, but this volley will always rank among the best goals in derby history. The “darkest day” in Australian soccer: December 17, 2022 Hundreds of Victory’s active supporters stormed the field during the derby in 2022, in what has been dubbed the darkest moment in A-League history and left a cloud hanging over the club to this day. The attack on City goalkeeper Tom Glover. Credit: Ten Hooligans broke down the field barriers in the 22nd minute of play, running onto the pitch with lit flare and tearing at the goal net.\n\nPlayers and officials were attacked, with one man throwing a bucket of sand at City keeper Tom Glover, cutting his head open, while others targeted referee Alex King. Scores of invaders were later banned for life and several were charged by police. Fans from both clubs had been protesting the A-League’s decision to move the grand final to Sydney. Melbourne Victory were fined more than $500,000 – the largest fine in A-League history – and continues to deal with the fallout with a suspended 10-point deduction hanging over them. Play was abandoned on the night, but the game was completed months later, restarting from the 22nd minute and ending with City winning 2-1.\n\nIzzo the hero: May 5, 2024 Victory and City were fighting for a place in the semi-finals last year when the game went to penalties (scores tied 1-1 at the end of extra time), before Victory keeper Paul Izzo emerged as the hero for the side in navy blue. Izzo let one penalty in early before Victory equalled. Boos rang out from Victory fans as City made a second attempt but Izzo blocked the ball. Victory capitalised, taking the score to 2-1. Izzo ultimately saved two more and then calmly converted his own penalty shot, sending his team to the semi-final against Wellington Phoenix after the 3-2 penalty win.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/mediterranean-one-pan-fish-with-cherry-tomatoes-olives-and-cannellini-beans-20250528-p5m2uy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mediterranean one-pan fish with cherry tomatoes, olives and cannellini beans",
        "publish_date": "Wed, 28 May 2025 11:19:16 +1000",
        "category": "lifestyle",
        "authors": [
            "Sarah Pound"
        ],
        "text": "Step 1 Heat the olive oil in a large, shallow frying pan or a shallow casserole dish over medium heat. Add the onion and cook, stirring, for 2-3 minutes or until soft and translucent. Add the garlic and cook, stirring, for 2 minutes. Stir in the capers and cook, stirring, for 1 minute.\n\nStep 2 Add the cherry tomatoes to the pan, stir and cook for 5-6 minutes, until the tomatoes have softened. Stir in half of the olives and the passata and cook for 3-4 minutes. Using a fork, gently press the cherry tomatoes so they burst and release their juices into the sauce. Add the cannellini beans and stir through gently.\n\nStep 3 Nestle the fish fillets into the sauce so they sink about halfway in. Scatter in the roasted red peppers. Cover with a lid on and cook for 6-8 minutes to allow the fish to cook through.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-wall-street-rallies-after-trump-tariff-delay-20250528-p5m2r6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX opens higher ahead of inflation figures, boosted by Wall Street rally",
        "publish_date": "Wed, 28 May 2025 11:13:22 +1000",
        "category": "finance",
        "authors": [
            "Frances Howe"
        ],
        "text": "The Australian sharemarket has given up some of its early gains after inflation came in slightly higher than expected, but remains in the green after a Wall Street rally overnight.\n\nThe S&P/ASX 200 rose by 15.7 points, or 0.2 per cent, to 8423.30 as of 11.55am AEST, with nine of the 11 industry sectors advancing, led by tech, energy and consumer discretionary stocks. The ASX was trading about 0.5 per cent higher before the release of the figures. The Australian dollar retreated and is fetching 64.30 US cents just before midday.\n\nWall Street has bounced back in its first trading session of the week. Credit: AP\n\nMonthly inflation came in slightly higher than expected at 2.4 per cent in the 12 months to April according to the latest data from the Australian Bureau of Statistics. Markets had been expecting to see the headline inflation rate ease to 2.3 per cent in April, down from 2.4 per cent in March.\n\nBolstered by investors’ returned appetite for riskier, economic growth-dependent stocks, cyclical sectors such as consumer discretionary stocks and tech advanced.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-carer-charged-over-crash-that-killed-two-clients-20250527-p5m2i0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Brisbane news live: Council, police file order against Story Bridge protest | Carer charged over crash that killed two clients",
        "publish_date": "Wed, 28 May 2025 10:43:09 +1000",
        "category": "finance",
        "authors": [],
        "text": "Cheaper jet fuel and more seat availability have driven down prices for Australian jetsetters and the price relief is expected to continue.\n\nDomestic economy airfares were 12 per cent cheaper in the first two months of 2025 than the same time last year, data compiled by corporate travel advisers FCM Consulting shows.\n\nThat represents $29 off the average ticket price.\n\nThat Bali getaway might be about to become even cheaper. Credit: Wolter Peeters\n\nWhile Qantas Group earnings before tax soared to $1.5 billion in the last six months of 2024, and Virgin Australia also announced record profits, market dynamics since the new year have benefited travellers.\n\nGlobally, jet fuel is down almost 17 per cent compared to the 2024 average, driven in part by economic uncertainty from US President Donald Trump’s trade war curtailing demand for oil.\n\nFuel is the largest operating cost for airlines, so fluctuations flow through to airfares.\n\nOngoing weakness in jet fuel prices will continue to put downward pressure on airfares in coming months, the Australian Competition and Consumer Commission predicts.\n\nAAP",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/woolworths-justifies-huge-price-disparity-for-kiwis-for-household-staple-002701966.html",
        "title": "Woolworths justifies huge price disparity for Kiwis for household staple",
        "publish_date": "2025-05-28T00:27:01Z",
        "category": "finance",
        "authors": [],
        "text": "The supermarket giant has revealed there are complex reasons Kiwis are paying more for butter made in their own country.\n\nWoolworths is selling New Zealand-grown butter cheaper to Aussies than Kiwis. Source: Michael Dahlstrom/Woolworths\n\nWoolworths has revealed why it’s continuing to sell a New Zealand-made dairy product cheaper in Australia than what Kiwis are forced to pay in its country of origin.\n\nButter prices in the land of the long white cloud have increased by a staggering 65 per cent in a year, worsening cost-of-living pressure on shoppers. This week, a block of 400-gram New Zealand-made Westgold butter was selling for $6.50 (NZ$7.00) in Woolworths’ Australian stores, but across the ditch they were retailing for NZ$9.95 (A$9.19).\n\nIt is a similar story for New Zealand-made Mainland varieties, with 250-gram butter priced at $6.50 (NZ$7.00) in Australia versus $8.90 (A$8.15) in New Zealand.\n\nWestgold sells for NZ$9.95 in New Zealand and A$6.50 in Australia. Source: Michael Dahlstrom/Woolworths\n\nWoolworths explains difference between butter prices\n\nWoolworths acknowledged shoppers in both countries face cost-of-living pressures, and it claimed “delivering value wherever we can continues to be our priority”.\n\nADVERTISEMENT\n\nWhen it comes to butter prices, the company indicated trans-Tasman pricing is complex because it’s influenced by multiple factors, including tax and global markets.\n\n“A range of factors can influence the price of New Zealand-made products sold locally and in Australia, and Woolworths operates separate buying arrangements across the two countries,” the company told Yahoo News in a statement.\n\n“For butter, for example, New Zealand is the largest exporter globally, and current New Zealand retail prices reflect an increase in the global price paid to producers that came into effect on May 1. Australian prices for the same product sourced before May will reflect the lower global price.\n\n“Different tax arrangements and rates can be a factor, and purchase volumes and different promotional pricing activities can also influence retail prices on either side of the Tasman.”\n\nWoolworths was unable to comment on whether butter prices would increase in Australia when new product is sourced from New Zealand.\n\nADVERTISEMENT\n\nNew Zealand struggles with high prices of supermarket duopoly\n\nWhile there’s an appearance of competition in the New Zealand supermarket space, like Australia, the sector is dominated by a duopoly. The brands PAK’nSAVE, New World and Four Square are all owned by local cooperative Foodstuffs, while Countdown and Woolworths are operated by Australia’s Woolworths Group.\n\nCountdown stores in New Zealand are being rebranded as Woolworths. Source: Michael Dahlstrom\n\nPrices for butter were unsurprisingly similar across the nation’s supermarkets, with Mainland selling for NZ$9.95 at New World and NZ$8.49 at PAK’nSAVE.\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/surprise-town-aussies-are-flocking-to-in-new-internal-migration-trend-221907187.html",
        "title": "Surprise town Aussies are flocking to in new internal migration trend",
        "publish_date": "2025-05-27T22:19:07Z",
        "category": "finance",
        "authors": [],
        "text": "The Sunshine Coast had been the top destination for back to back years, but that's now changed in a major migrational shake-up.\n\nGeelong has become the most sought-after regional district in the country, eclipsing the Sunshine Coast. Source: Getty\n\nA new favourite has emerged as the most sought-after regional hotspot for Australians relocating within the country as Aussies look for the best place to settle.\n\nGreater Geelong in Victoria has now overtaken Queensland’s Sunshine Coast to become the country's most popular destination for internal movers, according to the latest Regional Movers Index (RMI). The Victorian city now claims 9.3 per cent of the nation's total net internal migration, nudging past the Sunshine Coast's 8.9 per cent share and ending its two-year reign at the top.\n\nThe report, a partnership between the Regional Australia Institute (RAI) and the Commonwealth Bank, highlights a continued post-pandemic shift from cities to regional areas, with capital-to-regional moves up nearly 11 per cent from last quarter and 20.5 per cent higher than pre-Covid levels.\n\nThe index focuses specifically on movement to and from regional areas, excluding capital cities like Sydney and Melbourne from the rankings.\n\nADVERTISEMENT\n\nThat means Geelong’s top spot doesn’t mean it drew more total movers than capital cities, but among all regional destinations, it had the largest share of net internal migration in the 12 months to March this year.\n\nThe figure reflects the number of people moving into an area from elsewhere in Australia, minus those moving out, making it a strong indicator of growing popularity among those seeking a \"regional lifestyle\" while remaining relatively close to urban centres.\n\nViews from Port Phillip Bay towards Geelong CBD in Victoria. Source: Getty\n\nWhy has Geelong become so popular?\n\nRAI CEO Liz Ritchie said the data confirms a long-term trend. \"The nation’s love affair with regional life is showing no signs of abating,\" she said. \"Contemporary regional Australia has what people are looking for... clichéd images and misconceptions about regional living are well and truly a thing of the past.\"\n\nADVERTISEMENT\n\nFormer Sydney resident Alanna is one of these regional movers; formerly a Sydney resident, she now resides on the Sunshine Coast.\n\n\"For me, it's been the fact there's no traffic and (mostly) no issues with parking,\" Alanna said. \"I don't know if I can ever return to a one-hour commute.\n\n\"I love the lifestyle I can have with my partner, being able to live by the beach and having the beautiful hinterland close by. There are great camping spots and rivers to go boating and fishing on.\"\n\nThe Sunshine Coast remains a favourite among people fleeing the country's major cities. Source: Sunshine Coast Council\n\nGeelong’s rise is part of a wider boom across regional Victoria, which attracted 34 per cent of all regional net inflows in the March quarter, up from 28 per cent a year earlier. The state also produced the two fastest-growing regional local government areas — Latrobe and Murrindindi.\n\nADVERTISEMENT\n\nCBA Acting Executive General Manager Josh Foster said Geelong stood out for more than its location.\n\n\"In a first for the RMI, Greater Geelong has become the star performer due to its idyllic location, established services and range of employment opportunities,\" he said. \"This is underpinned by significant government and corporate investment in the region.\"\n\nMajor infrastructure projects like the Geelong Convention Centre and Barwon’s Women and Children’s Hospital are helping drive growth. The state government has set a housing target of 128,600 new dwellings in Geelong by 2051.\n\nSydney continues to lead outflows\n\nSydney continues to lead net capital city outflows (64 per cent), with regional NSW securing 40 per cent of total inflows. Queensland’s regional share dipped to 17 per cent from 30 per cent last year, though the state remains attractive due to its climate and housing affordability. The Sunshine Coast still ranked second overall, while locations like the Gold Coast, Townsville and Fraser Coast remain strong magnets.\n\nElsewhere, SA’s Victor Harbour and WA’s Denmark and Harvey also saw strong interest from movers.\n\nADVERTISEMENT\n\nRitchie called for greater government focus on sustaining this momentum. \"There are big economic gains to be made by supporting, facilitating and nurturing growth across the regions,\" she said. \"Those benefits can only be achieved by ensuring communities have the infrastructure, facilities and funding they need.\"\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/national-parks-proposal-branded-misleading-as-aussies-brace-for-camping-price-hikes-074343385.html",
        "title": "National parks proposal branded 'misleading' as Aussies brace for camping price hikes",
        "publish_date": "2025-05-27T07:43:43Z",
        "category": "finance",
        "authors": [],
        "text": "The feedback window has now closed for the NSW National Parks and Wildlife Service's controversial camping proposal.\n\nCamper and former policy analyst Tiaan Shutt told Yahoo News she was concerned authorities were being 'misleading' with its campground proposal. Source: Getty & Instagram/gone_wilding\n\nThere could be a significant overhaul in the way campgrounds in the country's most populous state are managed and experienced campers are holding their collective breath, waiting for authorities to assess community feedback on proposed changes.\n\nNSW National Parks and Wildlife Services (NPWS) has proposed increased camping fees and changes to the booking system to improve the camping experience, but one invested camper has claimed to Yahoo News some of the details presented to the public are \"misleading\".\n\nThe proposal, which is inviting community feedback, would see all campsites categorised into a tiering system based on amenities available at each site and priced accordingly. It would also increase camp fees in relation to the consumer price index, meaning prices would rise each year.\n\nWith the feedback window now closed, campers are waiting to find out what the verdict will be.\n\nCampers poke holes in proposed campground changes\n\nTiaan Shutt, who has a professional background in Policy Analytics, is travelling full-time around the country and frequently stays overnight in NSW campgrounds. She questioned some of the details presented in the proposal, saying authorities \"used data that was a little misleading\".\n\nADVERTISEMENT\n\nFor example, Tiaan questioned why campers should shoulder the cost of increased visitation to national parks — 50 million every year — when the 1.8 million annual overnight campers only make up just over three per cent of total visitors.\n\n\"If you're just an average person reading that, you're like, 'Oh, wow. That's large, that makes sense',\" she said. \"But of that 50 million visitations [per year to national parks], it was only just over three per cent who were actually overnight campers, which is tiny.\n\n\"When you're trying to lay the claim that so many people are visiting so we've got to increase prices, but putting those price increases on the small number of campers is a bit cheeky,\" she said.\n\nHeatley Gilmore, a camper for over 30 years who runs a camping app that helps Aussies locate free campsites around the country, also raised his concerns to Yahoo News, questioning which partners and industry representatives the NPWS consulted with on the proposal.\n\nMichael Atkinson (left) and Heatley Gilmore (right) have both raised concerns about the NPWS proposal. Source: TikTok/outbackmike & Facebook/Camps Australia Wide\n\nNPWS defends camping proposal as review begins\n\nNPWS assured Yahoo News \"all feedback will be carefully considered\" now the feedback window has closed, and \"consistency and equity\" for campers remains at the forefront of what authorities are trying to achieve.\n\nADVERTISEMENT\n\n\"No decisions have been made on the proposal,\" the NPWS spokesperson said on Sunday.\n\nYahoo News understands the 50 million visitation statistic was included for context to the public. NPWS made no comment in response to Tiaan's concern and no details were provided on who the consulting partners were.\n\n\"[The NPWS proposal aims to be a] more consistent and simplified state-wide camping fee and booking system for the 365 campgrounds across NSW national parks,\" the spokesperson said.\n\nWill the new proposal make camping more expensive in NSW?\n\nThe main concern surrounding the proposal is that campers will be forking out much more money to enjoy camping in the state, with the new tiering system meaning campers could pay nine times the nightly fee to stay at some campgrounds during peak periods.\n\nADVERTISEMENT\n\nAustralian adventurer and avid camper Michael Atkinson, also known as Outback Mike, has been vocal on this issue and accused NPSW of simply wanting to make \"heaps of money\". He pointed to Thredbo Diggings campground in the Snowy Mountains as an example, explaining under the new proposal the nightly fee would jump from $6 to $54 during high season.\n\n\"By raising fees, they have just blocked out probably the poorest people in Australia from accessing national parks. It's the one thing they should have access to,\" he previously told Yahoo News.\n\nThis fear was echoed by Tiaan, who said \"everybody should be able to connect with country, connect with our land and nature, and increasing these costs will make it prohibitive for some people\".\n\nHowever, the NPWS pushed back against this claim, saying the proposal will make \"camping in national parks more affordable than ever before.\"\n\n\"[The proposal] lowers camping fees outside high season to encourage visitation in non-peak periods, lowers camping fees in locations where demand is lower, removes the fees for remote and basic campsites — providing genuinely free camping experiences,\" the spokesperson said.\n\nADVERTISEMENT\n\n\"Where there are proposed fee increases, in many cases they only reflect consumer price index adjustments since 2017 [the last time prices were changed].\"\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]