[
  {
    "url": "https://www.9news.com.au/world/indonesia-tour-boat-sinks-people-missing-rescue-operation-underway/aa2046ce-12f5-4222-a775-0f8cf2e46842",
    "title": "Soccer coach, children missing after tour boat sinks in Indonesia",
    "publish_date": "Sat, 27 Dec 2025 23:42:44 +0000",
    "category": "sports",
    "authors": [
      "Dec"
    ],
    "text": "Indonesian rescuers are searching for a Spanish soccer coach and his three children after a tour boat carrying 11 people sank overnight near Padar Island, a popular destination within Komodo National Park, officials said.\n\nThe boat was carrying a family of six, four crew members and a local guide when it went down on Friday evening after suffering engine failure on a trip from Komodo Island to Padar, said Fathur Rahman, who heads the Maumere Search and Rescue Office.\n\nHe said three people were rescued by a passing vessel, and four others were picked up by a search and rescue team. The survivors included the Spanish mother and one daughter. The father, two sons and another daughter were missing, he said.\n\nA father and three children are missing after a tour boat sank in Indonesia. (AP)\n\nThe Spanish soccer club Valencia said that a coach for its women's reserve team, Fernando Martín, and three of his children were among the victims. In a statement on X, Valencia CF expressed condolences, saying their deaths were confirmed by local authorities. Real Madrid CF also offered condolences on the death of Martin, 44, and his three children.\n\nHowever, Rahman said the search was suspended Saturday evening because of bad weather and poor visibility and would resume early on Sunday.\n\n\"Our teams have been combing the northern waters of Padar Island until dusk,\" Rahman said. \"We are determined to find the victims.\"\n\nSearchers inspect debris believed to be from the boat. (AP)\n\nKomodo National Park is a UNESCO World Heritage site famed for its rugged landscapes, pristine beaches and the endangered Komodo dragon. The park attracts thousands of visitors for diving, trekking and wildlife tours.\n\nThe survivors were treated at the port office in Labuan Bajo city as strong waves up to 2.5 metres high and darkness hampered emergency responders overnight, Rahman said.\n\nThe search involved multiple rescue units in inflatable boats, a navy vessel with diving equipment and a rescue ship, with the assistance of local fishermen and residents. It was centered on a 9km radius of the sinking site, where rescuers found the boat debris, Rahman said.\n\nIndonesia is an archipelago with more than 17,000 islands, where boats are a common form of transportation. With lax safety standards and problems with overcrowding, accidents occur frequently.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/coral-adventurer-cruise-ship-hits-coral-reef-two-months-after-passenger-died-left-behind-lizard-island/a6be1a50-1555-4823-9a69-634f879b67b7",
    "title": "Cruise ship runs aground on first trip since passenger's death",
    "publish_date": "Sat, 27 Dec 2025 20:53:34 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "An embattled Cairns-based cruise ship has run aground while sailing around the South Pacific .\n\nThe vessel ran into trouble on Saturday morning, during its first trip back at sea after the death of an 80-year-old passenger on Lizard Island in October .\n\nAustralian-flagged vessel, the Coral Adventurer, hit a coral reef and ran aground off the Papua New Guinea coast, stuck around 30 kilometres from the city of Lae.\n\nREAD MORE: Body found inside a car on the Gold Coast\n\nCoral Adventurer ran into trouble off the Papua New Guinea coast during its first trip back at sea, after the death of an 80-year-old passenger on Lizard Island. (9News)\n\nCrew alerted relevant authorities around 6am.\n\n9News understands there are 123 people on board the luxury cruise ship, including 80 passengers and 43 crew.\n\nThe Australian Maritime Safety Authority (AMSA) said in a statement \"there are no injuries among the passengers and crew onboard\".\n\nThe PNG Maritime Rescue Coordination Centre also confirmed an officer has boarded the vessel and is assisting with the incident.\n\nREAD MORE: Further delays expected to remove snapped crane hovering over caravan park\n\nCoral Adventurer ran into trouble off the Papua New Guinea coast during its first trip back at sea, after the death of an 80-year-old passenger on Lizard Island. (9News)\n\nCrews were waiting for high tide to help re-float the ship, to assess if there's any damage.\n\nIt's been troubled waters for the luxury cruise ship that's already navigated a turbulent two months after it made headlines in October.\n\nSuzanne Rees, an 80-year-old New South Wales tourist, was found dead on remote Lizard Island several hours after being left behind by the Coral Adventurer.\n\nThe tragedy ultimately sparked several investigations, including by the AMSA and Workplace Health and Safety Queensland, which remains ongoing.\n\nSuzanne Rees, an 80-year-old New South Wales tourist, was found dead on remote Lizard Island several hours after being left behind by the Coral Adventurer. (9News)\n\nThis latest 12-night cruise, which costs $13,280 per person, departed from Cairns on December 18, reaching Papua New Guinea last Saturday on December 20.\n\nIt's then been cruising up the coastline over the past week before this latest bungle happened on December 27.\n\nPassengers were due to disembark on December 30.\n\nCoral Expeditions responded on Saturday evening, saying an initial inspection has found no damage to the vessel and further investigations will be undertaken.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/ghostwriter-side-hustle-sydney-mum-cost-of-living-exclusive/d3c1d722-66b9-46f1-8a3e-e4ed20a7c1f7",
    "title": "Sydney mum made bank writing books she's never allowed to talk about",
    "publish_date": "Sat, 27 Dec 2025 19:17:18 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Ghostwriting was the last side hustle Kristy Lee Kelly thought she'd fall into after being made redundant in 2020.﻿\n\nThe 32-year-old from Sydney didn't even know ghostwriting existed until an old colleague suggested it could help her make ends meet.\n\nKelly figured there was no harm trying it, at least until she found a new job.\n\nKristy Lee Kelly is a self-described lover of words who fell into ghostwriting as a side hustle. (Supplied)\n\nInstead she ended up ghostwriting for ﻿more than four years.\n\n﻿For those not in the know, a ghostwriter is a professional author paid to write books (among other things) for other authors, celebrities, even royals.\n\nPrince Harry's Spare was ghostwritten by acclaimed journalist and author J. R. Moehringer, who reportedly charges seven figures per book.\n\nOther, less established ghostwriters make tens or even hundreds of thousands of dollars per book﻿.\n\nThe trade-off is that most receive no credit for what they write because it's published under someone else's name (celebrity ﻿ghostwriters such as Moehringer are outliers).\n\nBut Kelly, a self-proclaimed \"lover of words\", didn't mind writing for other people at first.\n\nREAD MORE: Three words this CEO swears will help you land a better job ﻿\n\nJ. R. Moehringer, the ghostwriter behind Prince Harry's Spare, is one of few ghostwriters who can be open about what they've ghostwritten. (AP)\n\nShe was just happy getting paid to do something she enjoyed.﻿\n\n\"You can't realistically live on one income anymore,\" she told 9news.com.au.\n\n\"It was a combination of extra cash while having a creative outlet that appealed to me.\"\n\nIt only took a few beginner projects to build her confidence and start landing bigger, well-paid contracts writing romance.\n\nIt's ﻿a booming genre, with Australians forking out $50 million on romance novels in 2024 alone, according to Nielsen BookScan.\n\nAnd Kelly was \"floored\" to realise how many authors in it and other popular genres don't write their own books.\n\n\"People don't know how much of the publishing industry is built on ghostwriters,\" she said.\n\nKelly was \"floored\" to realise how many authors use ghostwriters. (Supplied)\n\n﻿Like most jobs, ghostwriting gigs are advertised online with details such as the genre of the book, the level of experience required, and the rate of pay.\n\nAnd almost all of them require the hired ghostwriter to sign a non-disclosure agreement (NDA) prohibiting them from ever revealing they wrote it.\n\nKelly had to sign one for every single book she worked on, but the cash was worth it.\n\nBefore long, she was ghostwriting for ﻿major publishers in the US and UK, as well as a few authors directly.\n\nAs her profile increased, so did her pay.\n\n﻿\"I would negotiate the overall amount, then get paid in milestones,\" she explained.\n\n\"It started with the outline, then it was usually in 10,000- to 20,000-word increments, and then for any further edits.\"﻿\n\nGhostwriting can be a lucrative side hustle for Aussies willing to put in the work. (Getty)\n\nIt became a lucrative side hustle and when Kelly landed a ﻿full-time job in the disability sector in 2021, she decided to keep ghostwriting.\n\nHaving an extra income as the ﻿cost-of-living crisis was kicking off was a huge relief.\n\nEspecially when Kelly and her husband learned they were expecting their first child the following year.\n\nIt was a challenging juggle and Kelly had to ﻿write before and after work and on her lunch breaks to meet tight project deadlines.﻿\n\n\"Whenever I had a spare moment, I was writing,\" she said, describing it as \"exhausting but fulfilling\".\n\n\"Then on weekends I smashed out as much as I could.\"\n\nThe only drawback was that Kelly had no ownership of her writing, even on the projects where she was given almost total creative freedom.\n\nKelly had to ﻿write before and after work and on her lunch breaks while juggling ghostwriting with a full-time role. (Supplied)\n\nFor one project, she was given a vague theme and allowed to run wild with it for three books.\n\nBut as soon as the ink dried, her words were taken away to be published under a stranger's name.﻿\n\n\"That's the one series I wish I could've put my name on, because it had so much of me in it and I still to this day have no idea where it ended up,\" Kelly said.\n\nOf the 20 books she ghostwrote, Kelly has only ever found two on shelves – both by accident.\n\nWhat happened to the rest remains a mystery.﻿\n\nIt was only after becoming a mother that Kelly decided to finally step away from ghostwriting after more than four years.\n\n\"It was incredibly draining to give pieces of myself - my humour, my creativity, even my trauma - to other people's books,\" she explained.\n\n\"I started to question why I was bringing other people's stories to life but not the ones that I've been carrying around inside of me.\"﻿\n\nKelly decided to step away from ghostwriting after welcoming her daughter. (Supplied)\n\n﻿Hoping to show her daughter that it's never too late to chase your passions, Kelly is now writing original fiction between part-time work and raising a toddler.\n\nBut she doesn't regret her time as a ghostwriter.\n\n\"This has all led me to a path where I'm working on my own writing, and I'm excited to see where it leads me,\" she said.\n\n\"It could lead to a pile of books that never see the light of day, but at least I put pen to paper.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/iga-mitre-10-metcash-ceo-doug-jones-secrets-to-success/ec05b570-6130-4501-9e9c-ce64c4cce6cf",
    "title": "CEO of business that made $17.3b last year doesn't 'do much work'",
    "publish_date": "Fri, 26 Dec 2025 20:44:18 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Exclusive: In this nine.com.au series, we'll be talking to some of Australia's smartest and sharpest ﻿entrepreneurs, founders and CEOs to find out what makes them tick - and what advice they'd have for anyone starting out.\n\nAs chief executive of wholesale retailer Metcash (the business behind IGA, Mitre 10, and many other independent Australian retailers), Doug Jones has a lot of responsibility.\n\nUnder him, Metcash hit $17.3 billion in sales revenue for the last financial year but he told 9news.com.au that﻿ he actually doesn't \"get to do much work\".\n\n\"All the teams around me, they do all the work,\" he said.\n\n﻿ These are his secrets to success.\n\nMetcash CEO Doug Jones is all about uplifting independent retailers like IGA, Mitre 10, and The Bottle-O. (Dominic Lorrimer)\n\nHow do you start the day to set yourself up for success?\n\nI like to go for a run or a ride or do some exercise, and then I get stuck into it.\n\nI'm of South African heritage, so I check my WhatsApp from family and friends because the time difference. And sometimes, if it's Monday, I catch up on a little bit of sports news.\n\nBut I'm not one for cold plunges and meditations. I like to just get into the day.\n\nWhat are three daily habits you always stick to?\n\nI write down what I need to do, what my priorities are for the day. That's the first thing I do so I'm very clear about what is it that I want to achieve today.\n\nI make sure that I check in with important people, starting with my wife and kids, and then when I get into the office. It's just making sure that the connection is there, whether it's a quick call on the way in or a visit to someone's office – I prefer face-to-face to email.\n\nAnd then I make sure that I leave my desk at the end of the day being clear with what I've achieved and what's coming up for the next day. It'll involve a quick scan of the diary to make sure that I don't have anything outstanding.\n\nJones said getting a promotion or a new job is about proving you'll do it well. (Bloomberg via Getty Images)\n\nLots of Aussies are looking for a career change – what small action can help them get ahead of other candidates?\n\nAt the end of the day, you need to do a good job.\n\nI tell my children this all the time; having a job is a privilege, not a right. And I think that delivering 10 times the value of your salary is where you should start.\n\nIt's probably boring and old-fashioned advice, but that's the first thing and frankly, that opens up opportunities. Whether you're looking for a career change or a promotion, people around you are looking to work with people that get stuff done, and that do it in a way that's collaborative and pleasant.\n\nSo yes, you should do stuff you're interested in, yes, you should do stuff you're good at, but at the end of the day, you should do things where you can add genuine value.\n\nSurprise entrant to top 10 most trusted brands in Australia View Gallery\n\nWhat financial myth do you wish you never bought into?\n\nI was brought up in a fairly strict environment, and my parents were always very smart about teaching me not to live beyond my means, so I think credit should be used appropriately.\n\nCredit is good at the right time, but only if you can pay back that credit.\n\nWhat do you wish you could tell your 20-year-old self?\n\nDon't be so serious.\n\nThe world is a wonderful place and if you approach it with curiosity, integrity, passion and humility, I think that you can have an amazing career and life.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/the-most-power-hungry-appliances-in-your-house/03d42a81-9b67-4948-b292-31fc50669055",
    "title": "The most power-hungry appliances in your house and how to make better use of them",
    "publish_date": "Fri, 26 Dec 2025 20:34:13 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "As the weather heats up, the temptation to switch on the air conditioner gets stronger.\n\nBut with the cool air comes the higher bills.\n\nAnd power bills remain one of the most unwelcome costs Australians are facing.\n\nThere are plenty of ways to save electricity, but some are better than others.\n\nSo what are the most power-hungry appliances in the average house?\n\nHeating\n\nChanging the temperature of a room is the most effective way of getting a higher electricity bill.\n\nIt's estimated 40 per cent of household electricity use goes towards heating and cooling - though some use far more or less than others.\n\nWhen you buy a space heater, you are usually paying for it later.\n\nThe cheap shelf price betrays how much power they use.\n\nAir conditioner is a major electricity user. (Getty)\n\nBut air conditioners aren't the best option either.\n\nIt's possible someone can pay hundreds of dollars more each year just from air conditioning alone.\n\nCeiling fans are a far more efficient option, even if they aren't as effective.\n\nBut if you have both, you should use the fan while you have the air-con on.\n\nHot water\n\nAn average of 23 per cent of household electricity goes towards hot water.\n\nThe solution is simple but not necessarily easy - shorter showers.\n\nWater-saving showerheads make a big difference, but there's a very easy hack to save power.\n\nWater loses heat as it moves, so by moving the showerhead closer to your body, the water will be warmer.\n\nOther tips include filling up the kettle with cold water or using the cold cycle on the washing machine.\n\nPerhaps the most efficient ways to conserve power is to take shorter showers. (Getty)\n\nFridges\n\nIt's the biggest appliance in the house and it's on all the time, so of course the fridge is a big culprit when it comes to high power bills.\n\nEnsuring the seals are in good condition can be a power-saver, as well as limiting the amount of times you open and close it.\n\nAnd you should try and avoid buying a bigger fridge than what you need.\n\nBut oddly enough, having more food in your fridge means it should use slightly less power than an empty fridge.\n\nThe other big power saver is the spare fridge in the garage.\n\nIf you're only using it for drinks at big parties, you should switch it off at other times.\n\nA crowded fridge uses less power than an empty fridge. (Supplied)\n\nWashers and dryers\n\nFront-loading washing machines are usually better for electricity than top-loaders, though they do cost more to buy.\n\nBut the best way to save power in the laundry is to use cold water in the washing machine rather than hot or warm.\n\nAnd hanging your clothes on the line uses no electricity, compared to putting them in the dryer.\n\nThe laundry is a major user of electricity in the household. (Getty)\n\nDishwashers\n\nYou may have seen ads on TV talking about how dishwashers use less water than washing your dishes in the sink.\n\nThat's not true for electricity.\n\nBut you can maximise your dishwasher efficiency by putting it on an eco wash.\n\nBetter yet, wait until the dishwasher is full until you turn it on.\n\nYou shouldn't put your dishwasher on until it is full. (Getty Images/iStockphoto)\n\nOvens\n\nThere's not much you can do to save power when it comes to ovens, save for the decision you make when you buy it.\n\nBut minimising your preheat time is a good way to save power.\n\nIt's also smart to be cooking more than one thing at a time in the oven if you can help it.\n\nYou shouldn't preheat your oven for longer than necessary. (Getty Images/iStockphoto)\n\nTVs\n\nThe bigger the TV, the more electricity it tends to use - but new LCD screens are more efficient than old plasmas.\n\nBut there's not much that you can do to save power with your existing TV - save for turning it off when you're not watching it.\n\nTVs, gaming consoles, DVD players and other devices tend to use low levels of power when in stand-by mode.\n\nSo switching them off at the power point when they aren't being used is a smart choice.\n\nAs obvious as it seems, you should turn your TV off when you're not watching it. (Getty)\n\nSmaller appliances\n\nUsing a smaller appliance instead of a bigger one is normally the savvier choice.\n\nA slow cooker, air fryer or microwave is better than an oven because they are heating less space or for a shorter time.\n\nAnd boiling water in an electric kettle is more energy efficient than a stovetop option.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/spanish-soccer-coach-missing-after-boat-sank-komodo-park/106182542",
    "title": "Spanish soccer coach missing after tourist boat sinks in Komodo National Park",
    "publish_date": "Sun, 28 Dec 2025 02:02:39 +0000",
    "category": "sports",
    "authors": [],
    "text": "Indonesian rescuers are searching for a Spanish soccer coach and three of his children after a tour boat carrying 11 people sank near Padar Island, a popular destination within Komodo National Park, officials say.\n\nThe boat was carrying a family of six, four crew members and a local guide when it went down on Friday evening, local time, after suffering engine failure on a trip from Komodo Island to Padar, said Fathur Rahman, who heads the Maumere Search and Rescue Office.\n\nThe Labuan Bajo port authority attributed the sinking to high waves of up to three metres.\n\nHe said three people were rescued by a passing vessel, and four others were picked up by a search and rescue team.\n\nThe survivors included the Spanish mother and one daughter.\n\nThe father, two sons and another daughter were missing, he said.\n\nRescuers examine debris believed to be from the boat that sank. (AP: BASARNAS)\n\nMr Raham said the search was suspended on Saturday evening, local time, because of bad weather and poor visibility.\n\nHe also told AFP his team had found debris and parts of the vessel's hull near where the boat went down.\n\nThe Spanish soccer club Valencia said a coach for its women's reserve team, Fernando Martín, and three of his children were among the victims.\n\nIn a statement on X, Valencia CF expressed condolences, saying their deaths were confirmed by local authorities.\n\nReal Madrid CF also offered condolences on the death of Martin, 44, and his three children.\n\nWhy getting more migrants to swim has benefits for all of Australian society Despite wanting to learn how to swim, many from culturally and linguistically diverse communities — particularly adults — face three key barriers to participating.\n\nThe tributes seemed to contradict Mr Raham's search update.\n\n\"Our teams have been combing the northern waters of Padar Island until dusk,\" he added.\n\n\" We are determined to find the victims. \"\n\nVideo released by the National Search and Rescue Agency also showed emergency workers in blue uniforms helping people, some barefoot, out of an inflatable orange boat and onto shore.\n\nKomodo National Park is a UNESCO World Heritage site famed for its rugged landscapes, pristine beaches and the endangered Komodo dragon.\n\nThe park attracts thousands of visitors for diving, trekking and wildlife tours.\n\nIndonesia is an archipelago with more than 17,000 islands, where boats are a common form of transportation.\n\nWith lax safety standards and problems with overcrowding, accidents occur frequently.\n\nAP/AFP",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/guayaquil-four-sentence-lays-bare-racism-and-security-in-ecuador/106173084",
    "title": "Four boys left home to play soccer. Why they never returned has divided Ecuador",
    "publish_date": "Sun, 28 Dec 2025 01:35:38 +0000",
    "category": "sports",
    "authors": [],
    "text": "Like most boys their age in Ecuador, brothers Ismael and Josué Arroyo dreamt of becoming great soccer players.\n\nIsmael, 15, aspired to be like Neymar. Josué, 14, preferred Kylian Mbappé.\n\nIt was not an uncommon occurrence for the pair to wander from their home in the port city of Guayaquil for a game.\n\nOn December 8 last year — alongside friends Steven Medina, 11, and Nehemías Arboleda, 15— that is exactly what they did.\n\nWARNING: This story contains details that some readers might find distressing.\n\nBut that night, their sporting dreams were prematurely snuffed out.\n\nThe pair never returned home.\n\nInstead, weeks later, their bodies were discovered kilometres away — beaten, naked and charred.\n\nNow, 11 soldiers have been sentenced to jail over their disappearance, in a case that has reignited wounds of racism and brought Ecuador's military crackdown into question.\n\nMourners attended a vigil for the four boys. (Reuters: Santiago Arcos)\n\nThe walk home and a doomed encounter\n\nThe four Afro-Ecuadorian boys lived in Guayaquil's Las Malvinas neighbourhood — one of the region's poorest and, at the time, under tight military control.\n\nEarlier in 2024, Ecuador had been plunged into a state of emergency after powerful Los Choneros gang leader Adolfo \"Fito\" Macías escaped prison.\n\nHis escape was followed by gunmen taking over a television station during a live broadcast and brandishing explosives.\n\nStill, life persisted and the boys wanted to play soccer.\n\nThey were around 10 minutes from their homes when they were detained by the soldiers.\n\nRelatives look at the casket of Steven Medina, 11. (Reuters: Santiago Arcos)\n\nDefence Minister Gian Carlo Loffredo Rendon later told reporters the children were stopped by agents who \"observed eight people who were allegedly robbing a woman\".\n\nWhat followed next is captured in security footage unearthed after public outcry.\n\nA group of boys are seen running from men in uniform before two are taken and placed face-down in the back of a white ute with tinted windows.\n\nOne of them is seen getting punched in the head.\n\nThe vehicle had a flashing siren, no licence plate and a black bench in the back — a design similar to those used in military patrols.\n\nThe uniformed men also wore badges resembling those of the Ecuadorian Air Force (FAE).\n\nThe footage ends, but the military mistreatment of the boys allegedly continued.\n\nProsecutors have alleged the four boys were beaten further, forced to remove their clothes and then abandoned naked in Taura, a dangerous rural community some 30 kilometres south of Guayaquil.\n\nThere, one of the boys managed to call his father to tell him they had been abandoned by the soldiers, according to witness testimony.\n\nBut when authorities arrived, they found no sign of the four boys.\n\nSilence before a new year tragedy\n\nIn the following three weeks, grieving families sought answers from the government — to no avail.\n\nThe father of Ismael and Josué, Luis Arroyo, filed a complaint almost immediately with Ecuador's prosecutor’s office, but the investigation was labelled as a kidnapping rather than an enforced disappearance.\n\nOnly when the families came forward to local media did more information begin to trickle out.\n\nThis included that the security footage had been handed into authorities a day after the children went missing.\n\nThe resulting anger — in a case now dubbed the Guayaquil Four or the Las Malvinas case — saw demonstrators flood the coastal city's streets demanding answers.\n\nAs ire grew, President Daniel Noboa assured \"all those responsible\" would be found but stopped short of criticising the military.\n\nA tearful relative protests against suspected military involvement. (Reuters: Santiago Arcos)\n\nThen, on December 24, four charred bodies were found in a marshy area of Taura, outside an air force base.\n\nThe bodies were so badly burnt that their faces and fingerprints were unrecognisable.\n\nForensic examination also revealed several of the corpses had gunshot wounds to the head and bore evidence of torture.\n\nAs the country went into the new year, DNA testing confirmed the remains belonged to the four boys.\n\nRelatives react after the attorney-general's office confirms DNA testing as the four boys. (Reuters: Santiago Arcos)\n\nThe judge who charged 16 soldiers with their disappearance also compelled the defence ministry to apologise to the devastated families.\n\nWhile the ministry initially denied involvement, it now argued the soldiers had apprehended the boys but released them alive in Taura, blaming their deaths on gang violence.\n\nIn his public apology, Mr Loffredo offered his condolences before seeking for the judge in the case to be sanctioned.\n\nHe also condemned what he deemed was the \"use of the narrative of human rights as an instrument of political persecution\".\n\nAs the case evolved, prosecutors brought those initial military claims into further question.\n\nPreliminary hearings heard there was no evidence to support the alleged robbery, or official record of the boy's detention.\n\nA poster for the boys reads \"'neither forgiveness nor forgetting\". (Reuters: Santiago Arcos)\n\nCase marks a national 'turning point'\n\nFor many, the case became emblematic of the racialised violence that haunted Afro-Ecuadorians, and an increasingly unregulated military deployment.\n\nDespite only making up 7.2 per cent of the nation's population, Afro-Ecuadorians make up 40 per cent of people living in poverty, according to the latest statistics.\n\nThe boys' home of Las Malvinas has a predominantly black population.\n\nAs funerals for the four took place, their community led a chigualo down the suburb's streets — a funeral ritual rooted in Afro-descendant tradition and an inherent reminder of their roots.\n\n\"We have endured all of this simply because we are Afro-Ecuadorians and live in Las Malvinas,” Mr Arroyo told The Guardian at the time.\n\nEcuador was already under a state of emergency — then it raided Mexico's embassy Ecuador and Mexico shared a booming trade and strong international relations. Within days, their relations diplomacy would crumble over the fate of a convicted former vice-president.\n\nOn the one-year anniversary of their deaths, Steven's father Ronny Medina also spoke of the prejudice the families had faced as others tried to link the boys to organised crime groups.\n\n\"Many discriminated against us and spoke badly of our children, but the only one who judges is God,\" he told local media.\n\n\"We come from a humble neighbourhood, but that does not make us criminals.\"\n\nInternational nonprofit, Black Alliance for Peace (BAP), said the case highlighted the systemic violation of Afro-Ecuadorian rights as part of Mr Noboa's ongoing internal armed conflict.\n\n\"The Ecuadorian state has rarely recognised let alone protected the fundamental human rights of Afro-Ecuadorians,\" Ajamu Baraka, director of BAP’s North-South Project for People(s)-Centered Human rights said.\n\n\" But this case represents a line in the sand for the Black peoples of that nation. \"\n\nRonny Medina marches on the December 8 anniversary of his son's disappearance. (Reuters: Santiago Arcos)\n\nAs the case lagged, families grew frustrated as to why they were still being left in the dark.\n\nMother of the Arroyo brothers, Katty Bustos, begged for justice as she commemorated the one-year anniversary.\n\n\"I have a nine-year-old daughter that cries every night asking me \"Mama, why did the military do all that to my brothers?\" she said.\n\n\" We need to know the truth, why they did it. \"\n\nKatty Bustos mourns her sons on the one-year anniversary of their disappearance. (Reuters: Santiago Arcos)\n\nThe drawn-out fight also underlined the military's impunity at a time when its presence is more heightened than ever.\n\nSince his initial security crackdown, Mr Noboa has vowed to reduce crime under his \"Plan Fenix\" — a ploy consisting of successive states of emergency and increased military patrols.\n\nBut crime remains at a high in Guayaquil, where 1,900 murders were recorded between January and September.\n\nHuman rights advocates have argued the crackdown has instead emboldened arbitrary detentions and risks serious human rights violations.\n\nAna Piquer, Americas director at Amnesty International, said the Guayaquil Four case proved Mr Noboa had to reverse his approach.\n\n\"Enforced disappearances are multiplying in Ecuador while the government insists on a militarised strategy that not only has not reduced crimes, but has increased human rights violations,\" she said.\n\nEcuador's military has increasingly patrolled the streets since the start of 2024. (Reuters: Vicente Gaibor del Pino)\n\nUNICEF and the UN's Human Rights Representative in South America Jan Jarab equally showed concern over the reported violations.\n\n\"This tragic event should mark a turning point in the way public security policy is conducted in the country,\" Mr Jarab added.\n\nSentence caps off 'tortuous year'\n\nThis December — more than a year after their deaths — 11 of 17 soldiers were found responsible for the abduction and torture of the boys.\n\nThe soldiers were sentenced to 34 years in prison and ordered to pay $US10,000 fines to the families.\n\nThe conviction of the 11 soldiers came more than a year after the boys first disappeared. (Reuters: Santiago Arcos)\n\nThe court also jailed five soldiers who collaborated with the prosecution over the case to two and a half years behind bars.\n\nThe 11 convicted men are now expected to face a murder trial next year.\n\nAnd while the Defence Ministry said it would comply with the ruling, it also may not be its last.\n\nAmnesty International says there are dozens of further cases of potential military enforced disappearances — including that of fellow Afro-Ecuadorian Leonardo Minota Nieves.\n\nA woman cries over the coffin of one of the four boys. (Reuters:Santiago Arcos)\n\nAs the verdict was announced, lawyers for the families said the convictions did not erase the pain of a \"very tortuous year\".\n\nMost were left without concrete answers as to why their boys were singled out that night.\n\nLuis Arroyo was the only one to speak to photographers as he left behind the courtroom that laid bare his sons' brutal, final moments.\n\nTwo boys who had only left home to play a game of football with friends.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/australia-migrant-communities-overrepresented-in-drownings/106097704",
    "title": "Why getting more migrants to swim has benefits for all of Australian society",
    "publish_date": "Sun, 28 Dec 2025 01:28:57 +0000",
    "category": "sports",
    "authors": [],
    "text": "Having never had exposure to open water, putting to sea was \"not the most pleasant\" of ordeals for Ramzi Hussaini, recalling the boat journey from South-East Asia to Australia more than a decade ago.\n\nThe then-teenager had just fled his homeland of Afghanistan and found himself in yet another encounter fraught with peril.\n\n\"Being with so many other bodies or people in the boat where you can't even stretch your legs,\" he said.\n\n\"It's overcrowded. The water is rough. You go to sleep with water around you, and you wake up, still with water around you, spending days in the water and getting the [sun] burns.\"\n\nLike many migrants, Mr Hussaini did not know how to swim and was aquaphobic. He says a sense of foreboding remained with him for those five long days.\n\nNot long ago, Ramzi couldn't swim. Now he teaches other people to be life guards and instructors. (ABC News: Natalie Whiting)\n\n\"So far out in the sea, you never know when you're going to make it, whether you're going to make it or not,\" Mr Hussaini tells the ABC.\n\n\" It was just an experience that I would never want to experience again. \"\n\nFollowing this \"nerve-wracking\" introduction to water, Mr Hussaini entered a pool for the first time after arriving in Melbourne in 2011, coming close to drowning.\n\n\"I think that was the turning point for me,\" says the 31-year-old, who was motivated to take up swimming lessons soon after the incident.\n\nNow a lifeguard in Victoria, life has come full circle for Mr Hussaini, and he has never looked back.\n\nInequities in fatal drownings\n\nMore than a quarter of Australia's population faces a heightened risk of death by drowning.\n\nIt is a staggering pool of 8.2 million and one that grows every year as visitors from around the world make their way down under.\n\nThe figure represents the number of people born overseas, a group that has universally remained among society's most vulnerable to water-related tragedies.\n\nA community learns to swim A 10-week program helps adult migrants learn to swim and enjoy the water on the outskirts of Melbourne, after a spate of drownings on the nearby Bass Coast.\n\nAccording to the latest National Drowning Report — compiled annually by the Royal Life Saving Society Australia (RLSSA) — 34 per cent of all drowning fatalities over the past 10 years were foreign-born people.\n\nOf those, 36 per cent were new arrivals to Australia who had been in the country for less than five years.\n\nThe report notes that the place of birth was known in just over half of all deaths, indicating that the burden borne by migrants may be even greater.\n\nAnalysing data from 2005 to 2024, Canberra-based swim school Aquatots also found that overseas-born people had made up a bigger share of drowning deaths than their share of the total Australian population, in some years accounting for up to 40 per cent of fatal drownings.\n\nSo, why the over-representation?\n\nWhile there are a variety of risk factors, research shows some common threads tying multicultural communities' relationship with water.\n\nFirst, there's the general unfamiliarity with local waterways for those who are new to Australia.\n\nThe report shows that in the year to July, 43 per cent of the 357 fatal drownings took place in coastal locations, including beaches, the ocean or harbour, and rock pools, and 34 per cent occurred at inland locations such as rivers and lakes.\n\n\"We need to be really careful not to assume that people are ignorant or that they haven't had experience before, because a lot of people actually have, but that knowledge doesn't necessarily translate to the conditions here in Australia,\" RLSSA's research and policy manager Stacey Pidgeon told the ABC.\n\nBut many migrants have \"simply not had the exposure or experience\" of being around water before coming to Australia, or the opportunity to learn basic swimming skills in their home countries.\n\n\"A lot of people have just not grown up in a culture where swimming is valued or is important,\" Ms Pidgeon said.\n\n\"Some cultures have a relationship with water that's [perhaps] more around doing the chores or employment.\"\n\nChildren and adults of a low socio-economic status, remote or regional dwellers, Indigenous communities, and males are among the other groups that are at a much greater risk of drowning than the average Australian.\n\nPeople from diverse backgrounds face several barriers that limit their participation in swimming and water safety education, both in their homelands and after coming to Australia.\n\nThey include restrictive cultural or religious attitudes to water activities, lack of access to water bodies or aquatic infrastructure, cost and transportation issues, a fear of water, the absence of community role models, or a sense of indifference to the value of knowing how to swim.\n\nDrowning deaths by place of origin\n\nLong-term trends show that most drowning deaths in Australia are those of migrants from Asian countries.\n\nIn January last year, Victoria saw its deadliest beach tragedy in two decades when four members of an Indian family — Reema Sondhi, Jagjeet Singh Anand, Suhani Anand and Kriti Bedi — lost their lives at an unpatrolled beach in Phillip Island.\n\nThree of the victims were Melbourne locals, and one was visiting from India.\n\nLess than three months later, another Indian family was left shattered after father-son duo Gurjinder Singh and Dharmvir Singh died in a Gold Coast hotel pool while trying to rescue a two-year-old from drowning.\n\nData shows nearly one in five drowning victims in Australia between 2013 and 2023 were people born in India, Nepal and China.\n\nAnd in the 12 months to July this year, the highest number of deaths were people born in the UK, China, India, Malaysia, Nepal and Papua New Guinea.\n\nHarpreet Kandra, a Melbourne academic and Sikh community leader who was motivated to establish a 10-week swim program after the Port Phillip tragedy, said drowning prevention strategies for adult migrants needed to be unconventional, with hands-on training prioritised over awareness.\n\n\"You have to connect with people rather than simply telling them 'this is water safety,'\" he told the ABC.\n\n\"The moment you leave a classroom environment, you forget things … so we thought, we need to get people into water and make them learn swimming.\n\nResearch shows most migrants see swimming as an essential part of assimilating into Australian society. (AAP: Jono Searle)\n\n\"We don't promise that they will become swimming experts, but once people get into water, they understand the force of water. They understand what fun they can have in water. And that's where we start telling them that it's vital for us to engage with water in a safe way.\"\n\nLearning how to swim is typically not a priority in migrants' early years of settlement, unlike, for instance, obtaining a driver's licence, securing housing and employment, or taking English classes.\n\nDr Kandra said a perspective shift was necessary where more people saw swimming not solely as a life skill but a multifaceted activity that enriched the migrant experience.\n\nBridging a cultural disconnect\n\nResearch shows most migrants see swimming as an essential part of assimilating into Australian society, in which water-based activities are central to the way of life.\n\nHaving more multicultural communities engaged in swim programs would make people \"feel welcome\" in the country, said Ms Pidgeon, fostering social cohesion and a sense of belonging.\n\n\"Being around water is such a key part of Australian culture … and adults I spoke to from migrant backgrounds felt like they were almost excluded because they couldn't swim,\" she said.\n\nWith record drownings, here's what experts say will save lives As the country heads into the summer holidays, experts are again warning Australians to be aware of swim safety at beaches, pools and other waterways\n\nBut despite having the desire to attain swimming skills, many from culturally and linguistically diverse communities — particularly adults — face three key barriers to participating: a fear of water, cultural norms, and pragmatic concerns around cost and transport, according to a recent public health study.\n\nFor Sarah Scarce, who runs the Queensland-based Aqua English Project, a program aimed at empowering refugees and new arrivals to Australia through swimming and language, those barriers are opportunities for change.\n\n\"Nobody talks openly about what to do when you're on your period and you swim. Nobody talks openly about children needing to wear swimwear, not a normal nappy,\" she told the ABC.\n\n\"The biggest one is on the front desk. How welcome do you feel when you come to the swimming pool? Does that person's body language indicate 'hey, I'm really happy to have you here'? If they just get frustrated [with you], it's very difficult.\n\n\" That's why we're trying to acculturate the workforce. \"\n\nMs Scarce said ways to deal with cost and transport concerns included delivering swim programs in places easily accessible by train or bus, and offering price concessions for families.\n\nAs for helping people overcome a fear of water, she says being patient, reassuring, setting realistic goals and \"creating a community in the pool\" goes a long way.\n\nOvercoming trauma is a key part of learning how to swim for many migrants and refugees. (ABC Radio Brisbane: Edwina Seselja)\n\n\"Our programming is collectivist because a lot of the cultures we get people from are collectivist, whereas swimming and Australian life in general is actually not of a collectivist mindset. It's an individual mindset,\" she said.\n\n\"Getting someone to the pool isn't always easy, so you have to be really sure that whatever it is that you're delivering makes them want to come back.\n\n\"The art of making someone feel welcome is a really big thing … and that's what will make someone stay.\"\n\nSince its inception nearly 20 years ago, The Aqua English Project has evolved from a drowning prevention initiative to a holistic program that places an emphasis on the value addition swimming offers to various aspects of life.\n\nMs Scarce said having the same shift take place across Australia's aquatic industry would not only improve migrants' personal well-being but bring about broader societal benefits.\n\nSwimming abilities beneficial for self, economy\n\nAside from directly aiding drowning prevention efforts, participation in swim programs helps adult migrants build fitness, improve personal well-being and develop positive social relationships, as per RLSSA research.\n\nFor many new arrivals to Australia, mothers who may be primary caregivers, people from marginalised communities, or those who may be victims of abuse or carrying other trauma, swimming can also act as a social outlet.\n\n\"Women who have suffered domestic violence — if you can get them into a pool, they make friends with each other and start helping each other take care of mental stress,\" said Dr Harpeet Kandra, whose swim programs have 70 per cent female participants.\n\n\"If they learn swimming, they feel very empowered.\"\n\nParticipation in swim programs helps adult migrants. (ABC Riverland: Sam Bradbrook)\n\nSwimming is also a highly recommended form of exercise for older people aged over 65 as it helps with mobility and slows down ageing, thereby reducing the burden on the medical system.\n\nA 2021 report by PwC found that Australia's aquatic industry generates health benefits worth $2.5 billion per year, including through a reduction in the burden of disease, improved mental health outcomes and lesser illness-related absenteeism in the workplace.\n\nThe combined social, health and economic value provided by aquatic facilities annually is $9.1 billion, according to the report, with more than a quarter of that contributing directly to Australia's GDP.\n\nBeing able to swim opens up a host of employment, training and competitive sport opportunities for Australians, and more migrants in the mix means there is more scope for cultural diversification in those spheres.\n\nAs of 2025, Australia's aquatic workforce numbered at around 85,000, of which just 10 per cent of workers identified as having a multicultural background, reflecting the \"need for stronger alignment with community diversity\", according to RLSSA.\n\nThere are also many non-aquatic professions where swimming skills are either mandatory or highly advantageous, including police, the Australian Defence Force, carers, teaching aides and tourism operators.\n\n\"I think we need to have a different set of glasses on and see the broader picture of what swimming does,\" Sarah Scarce said.\n\nMost fatal drownings took place in coastal locations including beaches, the ocean or harbour, and rock pools last year. (AAP: Danney Casey)\n\nMeanwhile, Dr Kandra said better engaging Australia's large migrant population with water was also beneficial for businesses, fighting weather events such as flash flooding, and representation in sport.\n\n\"There are a lot of economic opportunities out of it as well … it's good business for the water sports industry, it's good business for swim centres, for local swimming pools,\" he said.\n\n\"Who knows, maybe in a few years, I might motivate my daughter to learn swimming more, and she might get a gold medal for us at the Olympics.\"\n\nSwimming remains Australia's most successful sport at the Olympics, bringing in 58 of its total 135 medals in the history of the Games.\n\nThe country's second-most popular water-based sport after swimming is surfing, which has been found to inject almost $3 billion into Australia's economy annually.\n\nHow multicultural communities can be made more comfortable around water\n\nAdvocates' call for action in the drowning prevention space ramps up every summer — when fatal drownings tend to surge.\n\nDrowning victims 'nicest people in the world' The family of Dharmvir and Gurjinder Singh, who drowned on Easter Sunday in a hotel pool, say words cannot explain their gratitude for the community support they have received.\n\nIn April, the Albanese government committed $5 million over two years specifically to address the growing number of drownings among overseas-born Australians.\n\nRLSSA's Stacey Pidgeon says while more funding is always welcome, the money needs to be spent in a more focused way.\n\nOne approach, she says, is for universities to offer water safety modules and practical learn-to-swim programs for international students in their orientation semesters.\n\nMs Pidgeon also wants to see water safety messaging tailored to multicultural communities, who she stresses are \"not homogeneous\", and delivered via avenues such as migration and settlement support agencies, local health services, and English language providers.\n\nIn Dr Kandra's view, practical training needs to be prioritised over broad-brush awareness campaigns, and more role models are needed to help attract migrants — particularly those stigmatised — to swim programs through organic community outreach.\n\n\"If you keep learning about water safety in a closed classroom environment, that won't work,\" he said.\n\nOne expert says better engaging Australia's large migrant population with water was beneficial. (AAP: Mick Tsikas)\n\nAnd according to Ms Scarce, aquatic facilities should be culturally sensitive when dealing with migrants learning how to swim, including by offering gender-specific classes, multilingual staff, or inclusive swimwear, and be mindful of individual needs.\n\nOther ways to expand swimming access include offering classes out of hours and at subsidised rates.\n\nIn the new year, refugee boat survivor-turned lifeguard Razmi Hussaini hopes many more Australians overcome their anxieties with water and use it to transform their lives.\n\n\"I think that, for me, even being around the water is a great achievement,\" he said.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/aussie-speedster-brett-lee-given-hall-of-fame-nod/106182682",
    "title": "Aussie speedster Brett Lee given Hall of Fame nod",
    "publish_date": "Sun, 28 Dec 2025 01:27:15 +0000",
    "category": "sports",
    "authors": [],
    "text": "Brett Lee credits fellow fast-bowling legend Dennis Lillee with setting him on the path to greatness in a career that has led to his induction into the Australian Cricket Hall of Fame.\n\nLee, renowned for his express pace, first set his sights on crashing through the 160 kilometres per hour barrier and wearing the baggy green when he was nine years old.\n\nBut it was as a teenager that the NSW South Coast product had his first encounter with Lillee at a fast-bowling camp.\n\n\"You're the quickest here, but if you don't change your [bowling] action, in two years I reckon you'll have a broken back,\" Wollongong-born Lee, now 49, recalls Lillee saying.\n\nAt the time, Lee ignored the advice.\n\n\"When you're 16, you think you're invincible, and two years later, I broke my back,\" he said.\n\nCricket Australia, then known as the Australian Cricket Board, was desperate to nurture Lee's talent and flew the young speedster to Perth to work with Lillee.\n\n\"Throughout my whole career, he's been incredible in modifying my action, changing my action and allowing me to play. I wouldn't say pain-free, but to get to the speeds I did,\" Lee said.\n\nLee went on to become one of the quickest and most feared bowlers in cricket history, claiming 310 wickets in 76 Tests during one of Australia's most formidable fast-bowling eras.\n\nHe was also one of the nation's greatest limited-overs bowlers, taking 380 wickets in 221 ODIs and 28 wickets in 25 T20Is over an international career that spanned 1999-2012.\n\nOne of three brothers, Lee recalls he couldn't bat or bowl leg-spin as a kid, and always dreamed of bowling fast.\n\nHe treated the 160kmh mark like runners did the four-minute mile, idolising the likes of Lillee and Jeff Thomson.\n\nBrett Lee (right) took part in four Ashes series for Australia, including the 5-0 whitewash of the English in 2007. (Getty Images: Cameron Spencer)\n\nLee's fastest delivery in international cricket was clocked at 161.1kmh, among the fastest balls ever bowled.\n\n\"I wanted to bowl quick and to have that thrill of being able to run in and see the stumps fly; it became this obsession,\" Lee said.\n\nLoading...\n\n\"That's what I wanted to do. I think back to the age of nine or 10 and I wanted to break that 160kmh barrier.\n\n\"Jeff Thomson was a guy I looked up to through the 70s and 80s and 160.45kmh was his record.\n\n\"I thought, 'I want to have a crack at that one day', and I was lucky to achieve it.\"\n\nLee was a key figure in an era of Australian dominance, contributing to one-day World Cup titles in 1999, 2003 and 2007, as well as multiple Ashes campaigns.\n\nFittingly, he was unveiled as a Hall of Fame inductee on Sunday at the foot of Lillee's statue outside the MCG, after a Boxing Day Test that was dominated by bowlers.\n\nAAP",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/veteran-train-driver-peter-sawtell-calls-time-after-70-years/106128706",
    "title": "85yo makes final stop after 70 years driving trains",
    "publish_date": "Sun, 28 Dec 2025 01:03:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "They say if you love your job, you never have to work a day in your life.\n\nAnd after seven decades on the train lines Peter Sawtell believes it.\n\n\"My advice to the young ones was, if you don't like your job, get rid of it!\" he said.\n\nThe 85-year-old has been recognised for dedicating his life to the New South Wales railways, and he never left the small North West train community of Werris Creek.\n\n\"[It makes me feel] very old,\" Mr Sawtell said.\n\n\"You make a lot of friends, but you make a lot of enemies.\"\n\nIt is roughly a five-hour train ride from Werris Creek to Central Station in Sydney. (ABC New England North West: Brigitte Murphy)\n\nFrom steam to diesel\n\nMr Sawtell's home town of Werris Creek was built around its heritage railway station, after the site was picked as the best place to continue the state's railway into the North West.\n\nThe town, with a population of 1,700, is about 40 kilometres outside of Tamworth.\n\nMost of the rail station's \"classic Victorian\" facade is still intact from its construction in the late 1800s. (ABC New England North West: Brigitte Murphy)\n\nMr Sawtell moved to Werris Creek in 1955 as a 15-year-old and found work on the railways.\n\nTwo years later he was driving trains at 17.\n\n\"It was steam engines back then, they were good, you were fit all the time,\" he said with a smile.\n\n\"There's a driver and a fireman, the driver knew the lay of the land while the fireman kept the waters up to the boiler.\"\n\n\n\nThe steam engines progressed to diesel-hydraulic operations as the train technology evolved before Mr Sawtell's eyes.\n\nPeter Sawtell says operating a steam train keeps you physically fit. (Supplied: Peter Sawtell)\n\nHis final role before retiring was driving the diesel-powered Xplorer locomotive.\n\n\"[It was a learning curve], the newer trains are about watching [the] rail ahead, making sure they're clear, checking the signals,\" he said.\n\n\"You can make it [an] easy [job], or make it very hard.\"\n\n\n\n\n\nPeter Sawtell driving newer trains towards the tail end of his career. (Supplied: Peter Sawtell) Mr Sawtell was content dedicating his life to the North West and its railway, and never had a reason to leave.\n\nHe said that commitment led to some surprising experiences, such as meeting the now King of the United Kingdom, Charles III.\n\n\"I went to the shop one day in Quirindi to get some ice creams for my kids,\" Mr Sawtell said.\n\n\"Then Charles came out. I didn't know who it was — that would probably never happen again.\n\n\"He bought the ice creams for us!\"\n\nA railway town\n\nWerris Creek station master Natasha Geddes said Mr Sawtell would be sorely missed.\n\n\"I don't think anyone will surpass his 70 years,\" she said.\n\n\n\n\"You would have to start when you're 15, like he did, and you can't do that anymore.\"\n\nNatasha Geddes says her family name has been in the Werris Creek railway since the 1940s. (ABC New England North West: Brigitte Murphy)\n\nMs Geddes has only worked at the railway for four years, but she viewed it as continuing her family legacy with the site, which stretched back to the 1940s.\n\n\"My whole family has worked here, my Mum and my Dad's side,\" she said.\n\n\"There used to be 38 services day and night, including parcel deliveries, even sheep and cattle [were] transported on the trains.\n\n\"Going from 38 services to just a few a day now, it's a big change.\"\n\nWerris Creek Railway Station is a major railway junction for NSW. (ABC New England North West: Brigitte Murphy)\n\nNow, one passenger service arrives in Werris Creek daily before splitting into two services towards Moree and Armidale.\n\nLater that day, one service returns to Sydney.\n\nUnique job\n\nTrain driver Phil Astill has been in the industry for more than 20 years and has been driving out of Werris Creek for the past four years.\n\nPhil Astill says people do not tend to stay in the one job like they used to. (ABC New England North West: Brigitte Murphy)\n\nHe said guiding the train north out of town lights up his day.\n\n\"I love going to Moree. When the sun sets you're on your own up the front there, it's hard to explain [the feeling].\n\n\"I just love it.\"\n\nMr Astill said Mr Sawtell's career was a testament to the industry.\n\n\"These days, people don't stay in the same job like they used to.\n\n\"We have a lot of blokes that hit 60 years, but 70 years — I don't think that will ever happen again.\"\n\nLifetime service recognition\n\nA plaque pays tribute to Peter Sawtell at his home station of Werris Creek. (ABC New England North West: Brigitte Murphy)\n\nIn October, Mr Sawtell was recognised for his service to the NSW railways with a special ceremony in Sydney.\n\nAs part of the celebrations, a plaque was unveiled at his home station of Werris Creek and he was gifted a piece of golden railway track.\n\nPeter Sawtell was given a golden piece of railroad track for his 70-year work anniversary on the rails. (ABC New England North West: Brigitte Murphy)\n\nGwen Hohnke is a volunteer at the Rail Journeys Museum and has known Mr Sawtell for decades.\n\n\n\nShe remembered calling in a favour from the local choir group, which they were both part of, for Mr Sawtell's 50-year work anniversary.\n\nGwen Hohnke says Peter Sawtell is a \"legend\". (ABC New England North West: Brigitte Murphy)\n\n\"[Mr Sawtell] drove the train in from Moree, [and] we stood out on the platform and sang, 'He's been working on the railway,'\" she said.\n\n\"He is full of stories, very nice to talk to, he will get people and talk for hours, he is very polite.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/adult-activity-board-for-dementia-patients/106173414",
    "title": "Spark plugs and an old lawnmower engine are helping dementia patients",
    "publish_date": "Sat, 27 Dec 2025 23:43:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Creating meaningful, sensory activities for people living with dementia can be challenging, particularly when many traditional options feel more suited to children than adults with a lifetime of lived experience behind them.\n\nAt Cooinda Aged Care Facility in Coonabarabran, a specially made activity board is helping bridge that gap, offering residents something familiar, purposeful and real to engage with.\n\nThe idea was brought to life by Mitchell Brain, a Coonabarabran local who recently returned to his hometown and signed up as a volunteer at the facility.\n\n\"I just wanted to create something people would recognise and be engaged in,\" Mr Brain said.\n\nMeasuring 1.8 metres wide and 90 centimetres high, the activity board sits under a shelter in the facility's gardens and is packed with about 30 different hands-on activities.\n\n\"The basic idea is to have people engaged in what's on the board,\" he said.\n\n\"So you push and pull and press things.\"\n\nThe activity board encourages engagement, movement and familiarity for dementia patients. (Supplied: Cooinda Coonabarabran)\n\nWork that still matters\n\nBuilt using real mechanical components, the board includes items such as spark plugs and parts from an old lawnmower engine.\n\nThe materials were chosen to reflect the backgrounds of many residents.\n\n\"I made sure it was safe and wanted it to last forever,\" Mr Brain said.\n\n\"So I made it very strong and sturdy.\"\n\nSharon Edmonstone, lifestyle coordinator at Cooinda, said the idea came from conversations about residents' former working lives.\n\n\"Often we have residents who were farmers and they are still wanting to check on machinery and fix things that need fixing,\" she said.\n\n\"So we discussed an idea of putting something together that would allow our ex-farmers to get up and go to work.\"\n\nWhile commercial activity boards do exist, Ms Edmonstone said many were unsuitable for adults.\n\n\"They are very childlike, so we were more after something that adults could use,\" she said.\n\n\"Our residents can now go out and fix things like spark plugs, an old lawnmower engine; things to replicate what they might have done on the farm.\n\n\"We have a couple of residents who were farmers and they love going out to it to fix things and muck around with it. It sparks their cognition and provides a bit of dignity to our residents because it's real.\"\n\nMany residents at Cooinda are former farmers who like working with their hands. (Supplied: Cooinda Coonabarabran)\n\nWhere memory meets muscle\n\nBruce McDermaid from the Dubbo Dementia Alliance said activities like this play a vital role in supporting people living with dementia.\n\n\"Engaging in any sort of activity is wonderful for people with dementia because it engages the brain,\" he said.\n\n\" A lot of studies have shown that if you use the brain, it extends the use of your brain, your activity and your lifestyle a lot longer. \"\n\nMr McDermaid said hands-on tasks also provide an important sense of achievement.\n\n\"Physical activity and dexterity do deteriorate across the journey with dementia, so being able to do what to us is a normal everyday task, but for people with advancing dementia becomes more of a challenge and gives them a sense of achievement as well,\" he said.\n\nHe said this was particularly important for men who had spent their lives in manual work.\n\n\"Especially for men who have used their hands all their lives and possibly never done a crossword in their life, these are the things that will stimulate them and give them a challenge and a sense of purpose throughout the day.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/truck-driver-hangs-up-keys-after-six-decades-on-the-road/106146694",
    "title": "A career for all ages: Meet the truckies keeping Australia on the road",
    "publish_date": "Sat, 27 Dec 2025 23:05:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "After more than six decades carting grain and sheep across Western Australia, Terry Bairstow has just climbed out of the cab of his enormous truck for the last time.\n\n\"It was pretty emotional … It's like losing a limb really, but never mind,\" he said.\n\n\"I've still got my car licence and light rigid licence to pull a caravan.\"\n\nTerry Bairstow's career in the trucking industry spans more than six decades. (Supplied)\n\nThe Department of Transport and Major Infrastructure requires heavy vehicle drivers to pass a medical assessment annually from the age of 80, as well as an annual road test from the age of 85.\n\nAt 83 years old, Mr Bairstow, who is from Wagin in WA's Wheatbelt, has been told it is finally time to hang up the keys for good.\n\n\"I went down to Perth where I had [a road test] 12 months ago and got through that one, but they did warn me that it was going to be a bit harder this year,\" Mr Bairstow said.\n\nOne of Terry Bairstow's sons has taken the reins of the family business. (Supplied)\n\nDespite the disappointment of giving up his truck licence, Mr Bairstow said the rules are fair.\n\n\"What do you do?\" he said.\n\n\" You just can't drive until you go to sleep on the road … it's one of those things you've got to realise that it comes to the end. \"\n\nTerry credits his wife Maree, who managed the business as well as raising their three kids while he was driving. (Supplied)\n\nA family affair\n\nReflecting on his career of more than 60 years as a truckie, Mr Bairstow said that apart from the purchase of a few dud trucks, there was not much he would change if he had his time over again.\n\nMaree and Terry Bairstow, standing in front of his last truck. (Supplied)\n\nHe credits his contentment with the lifestyle to his wife Maree.\n\nMarried in 1970, they had three children: Todd, Darran and Jodie, all of whom went on to follow in Dad's footsteps and drive trucks in their own businesses.\n\n\"I wouldn't have got anywhere here without my wife, Maree,\" he said.\n\n\" She was the backbone of everything here, doing the book work, bringing up the kids. \"\n\nTerry Bairstow spent more than half a century carting sheep and grain across Western Australia. (Supplied)\n\nAn industry for all ages\n\nWhile Mr Bairstow bids goodbye to the industry that held him for well over half a century, Perth's Marko Savic is at the other end of his trucking career.\n\nMarko Savic works as a trainer-assessor with his family at their truck driver training business in Perth. (ABC Great Southern: Asha Couch)\n\nAt just 26 years old, Mr Savic is a director at Western Roadtrain Driver Training, as well as a truck driving trainer and assessor.\n\nGrowing up in the family business, Mr Savic said he was \"born and bred to be come a trainer\".\n\n\"I was able to get [my training accreditation] basically as soon as I was 22 … making me, I think, one of the youngest ones in the last 40 years,\" he said.\n\nMr Savic said his age often comes as a surprise to the people he teaches, but that is soon forgotten when they see \"how much passion\" he has for the job.\n\n\"I never had any time [to learn] bad habits … a lot of [the training] is just about unlearning bad habits that we do out on the roads,\" he said.\n\nMarko Savic spends most of his time training truckies on how to drive safely. (ABC Great Southern: Asha Couch)\n\nWhat makes a good truckie?\n\nAt their driving school in Wangara, north of Perth, Mr Savic and the team run truck driving courses for heavy rigid, heavy combination and multi combination tickets.\n\nMarko Savic was passionate about trucks from a young age. (ABC Great Southern: Asha Couch)\n\nWhile there are plenty of technical skills to cover, Mr Savic said a large part of what makes a good truckie comes down to attitude, safety and the ability to keep your cool.\n\n\"You've got to be the bigger person … any time there's a 50-50, if there's a narrower street, you've got to be the bigger person in that situation,\" he said.\n\n\" At the end of the day, it's not rocket science, it's not brain surgery, it's driving — but it can feel like that if you're under a lot of pressure. \"\n\nTruckie licence 'as good as a trade'\n\nFor anyone looking for a new career who does not mind long hours, Mr Savic said being a truckie was \"the dream job\".\n\nDriver trainer Marko Savic says people perform better behind the wheel when they feel at ease. (ABC Great Southern: Asha Couch)\n\n\"We get a lot of people in their retirement age wanting to do it because it's a job that pays well, that is not as labour-intensive depending on what you're doing,\" he said.\n\n\"It gives you potentially the opportunity to see the state, see the country, even.\"\n\nAnd while a future rich in electric vehicles may change how the trucking industry works, Mr Savic emphasised the current need for skilled truckies.\n\n\"We're still a ways away from that,\" he said.\n\n\" Without trucks, Australia stops — you've heard the slogan, it's the most true thing in the world. \"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/australias-shaky-batters-face-scg-selection-scrutiny/106182432",
    "title": "Weatherald, Labuschagne, Green under selection pressure after MCG loss",
    "publish_date": "Sat, 27 Dec 2025 22:40:41 +0000",
    "category": "sports",
    "authors": [],
    "text": "The Australian team is facing up to four selection issues in the top seven after crashing to their first home Ashes loss in 15 years.\n\nNew opener Jake Weatherald, number three Marnus Labuschagne and all-rounder Cameron Green were placed in the gun after their double failures at the MCG.\n\nVeteran Usman Khawaja, who batted at number five in the Boxing Day Test, could retire after the end of this series after recently turning 39.\n\nWeatherald and Labuschagne appear certain to make it to the fifth and final Test at the SCG, starting on January 4.\n\nBut Green's spot is under major threat after averaging just 18.66 with the bat this series.\n\nAfter returning from injury for the World Test Championship final in June batting at number three, the 26-year-old has gradually slid back down the order.\n\nGreen has kept fellow all-rounder Beau Webster, who performed strongly in seven Tests this year, out of the team this summer.\n\nLabuschagne ends a difficult 2025 after making just 271 runs at an average 20.84 from eight Tests.\n\nThe 31-year-old was dropped for the tour of the West Indies, but recalled for the Ashes on the back of strong Sheffield Shield form.\n\nHis superb catching has been a feature of the summer, but his returns with the bat have again not been up to scratch.\n\nLabuschagne will need to make runs in Sydney to avoid his spot becoming available for Australia's next Test series.\n\nWeatherald, who debuted in Perth replacing Sam Konstas, could be on his final chance at the SCG.\n\nAfter impressing with 72 in Brisbane, the attacking left-hander has otherwise not performed, with an average of just 20.85.\n\nWeatherald, who came in at number three in Australia's second innings due to Scott Boland opening as a nightwatchman, left a ball from England captain Ben Stokes that cannoned into the stumps.\n\nWhen asked about Labuschagne and Green, stand-in Australia captain Steve Smith described batting as \"not easy\".\n\n\"Marn got dropped, went back to Shield cricket and demanded selection, with a mountain of runs,\" Smith said.\n\n\"He probably hasn't had the output that he's wanted in the last couple.\n\n\"He played some really nice innings in the first two Tests.\n\nLoading...\n\n\"Greeny's had a few nice starts as well, just hasn't been able to go on with it and get the results he's been after.\n\n\"But he's a quality player, he's done it against some good oppositions in the past, and hopefully he can turn it around.\"\n\nAfter running himself out on day one, Green again threw his wicket away in the second innings.\n\nThe 26-year-old tried to guide a Stokes ball away into the off-side, but was caught at second slip in a soft dismissal.\n\nAustralia has relied heavily on Travis Head for runs during this series, with wicketkeeper Alex Carey starring in both innings in Adelaide.\n\nAAP",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/kennedy-centre-criticises-musician-cancelled-performance-rebrand/106182404",
    "title": "Kennedy Center boss demands $1.5m damages after musician cancels show",
    "publish_date": "Sat, 27 Dec 2025 22:16:50 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "The president of the Kennedy Center has demanded $1.5 million in damages from a musician who cancelled a Christmas Eve performance at the venue days after the White House announced it would be renamed the Trump Kennedy Center.\n\nIn a letter to musician Chuck Redd, Kennedy Center president Richard Grenell said Redd's decision to \"withdraw at the last moment\" was \"explicitly in response to the Center's recent renaming, which honors President [Donald] Trump's extraordinary efforts to save this national treasure\".\n\nHe also said Redd's decision was \"classic intolerance and very costly to a non-profit Arts institution\".\n\nIn the letter shared with the Associated Press, Mr Grenell said he would seek $US1 million ($1.5 million) in damages \"for this political stunt\".\n\nThe White House says Donald Trump's hand-picked board approved the renaming. (Reuters: Al Drago)\n\nRedd did not immediately respond to a request for comment.\n\nA drummer and vibraphone player, Redd has presided over holiday \"Jazz Jams\" at the Kennedy Center since 2006, succeeding bassist William \"Keter\" Betts.\n\nRedd told The AP earlier this week he pulled out of the concert in the wake of the renaming.\n\n\"When I saw the name change on the Kennedy Center website and then hours later on the building, I chose to cancel our concert,\" Redd said.\n\nHe said the event has been a \"very popular holiday tradition\" and often featured at least one student musician.\n\n\"[It is] one of the many reasons that it was very sad to have had to cancel,\" he said.\n\nArts centre renamed as Trump Kennedy Center The venue, named after former US president John F Kennedy, is to be renamed the Trump Kennedy Center after a vote by its board — which Mr Trump himself hand-picked this year.\n\nCongress named the centre after former president John F Kennedy in 1964, after his assassination.\n\nMr Grenell was chosen by Mr Trump to head the Kennedy Center after he forced out the previous leadership.\n\nAccording to the White House, Mr Trump's hand-picked board approved the renaming, which scholars have said violates the law.\n\nKennedy's niece Kerry Kennedy has vowed to remove Mr Trump's name from the building once he leaves office, and former House historian Ray Smock is among those who have said any changes would have to be approved by Congress.\n\nThe law explicitly prohibits the board of trustees from making the center into a memorial to anyone else, and from putting another person's name on the building's exterior.\n\nAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/ntfl-umpire-shortage-lower-standards-more-injuries/106171760",
    "title": "Umpire shortage lowering standards, increasing injuries, ex-umpires say",
    "publish_date": "Sat, 27 Dec 2025 21:48:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "Jared Collins moved to Darwin for a six-month stint as an Northern Territory Football League (NTFL) umpire — nearly 30 years later, he still hasn't left.\n\nIn that time, he's become one of the territory's most experienced umpires, tallying close to a thousand games.\n\nBut recently, the former president of the NTFL Umpires Association (NTFLUA), has decided to hang up the whistle and neon greens.\n\n\"There's a change in the way the association is allowed to run,\" he says.\n\n\"We used to have several events each month, social interactions, the opportunity to socialise at our own bar … and that stuff's been taken away.\"\n\nJared Collins says this year's NTFLUA Christmas party had to be held in a rugby union club, across the road from AFLNT's Marrara stadium. (ABC News: Rio Davis)\n\nUmpire training has been reduced from two nights a week to one, their honour boards have been taken down, and they haven't been allowed to use NTFL facilities for social events — all, Mr Collins says, without consultation.\n\n\"It's taken away the social element, and for me having done it for so long, that was the driver for me to still do it,\" he says.\n\n\" A lot of my peer group have moved on out of frustration. \"\n\nHead of AFLNT Sam Gibson says the NTFLUA chose \"not to hold social gatherings at TIO Stadium so they could sell alcohol in lieu of a change in the commercial operator at TIO Stadium\".\n\nWhen Mr Collins was the president of the NTFLUA, the umpires and administration reached a memorandum of understanding (MoU) on pay rates, heat protocols and other working conditions.\n\nThe agreement lapsed in 2022, which Mr Collins says has led to tougher conditions and a lower proportion of local umpires.\n\n\"When you've got more umpires, you're not doing as many games,\" he says.\n\nHonour boards containing 60 years of history in the umpires' facilities in Marrara stadium have been taken down this year - AFLNT says it's for renovations, while a digital replacement is reviewed. (Supplied: Gerry Wood)\n\n\"At the moment I feel like there's fewer umpires, they're expected to do more matches, they're obviously getting fatigued quicker, they get to end-of-season and the standard drops away because they're exhausted.\"\n\nMr Collins started out as an interstate umpire and voiced concern that those new to the Top End were not getting enough support to acclimatise and give back to the culture.\n\n\"It is hot, it is different to interstate, having come from interstate it's something I learnt very quickly, but I had a lot of peer support around me, I just feel like that piece is missing at the moment,\" he says.\n\nUmpires in demand\n\nThe NTFL is the Top End's Australian Football League (AFL) competition, run by AFLNT.\n\nThe ABC obtained this year's NTFL fixtures which requested clubs provide volunteer umpires, a practice coaches have confirmed has been increasing in recent years, especially in lower divisions.\n\nUmpires say tougher conditions mean the NTFL is increasingly reliant on a fly-in, fly-out workforce to officiate games. (ABC South West: Supplied)\n\nDuring the most recent round, clubs were asked to provide at least one umpire for about half of all games played.\n\nIn some cases, umpires are being flown in from interstate for periods as short as two weeks to officiate games.\n\nOne NTFL premier league coach, with friends inside both AFLNT and the NTFLUA, described their relationship as \"broken\".\n\nThe decline in relations between the association and the administration coincides with the lapse in the MoU, and failed negotiations over a new affiliation agreement, which the association rejected.\n\nNTFL player given 20-week suspension for altercation with umpire The PINT Football Club player has been suspended for more than a season and deregistered over the altercation, and could be banned from playing for life.\n\nAFLNT head Mr Gibson says the game has been growing at a significant rate over the past five years, and umpiring had evolved to meet the increasing demand.\n\n\"Our ongoing investment in umpiring has resulted in strong participation growth, higher standards, and some of the best retention rates in the country,\" he says.\n\nHe pointed to statistics for the 2024-25 season that show the NTFL has the lowest national turnover rate at 6 per cent, and strong participation from women and girls, with a 68 per cent growth, season-on-season.\n\nBut he also noted interstate umpires account for a total 19 per cent of registrations, a figure steadily rising in recent years.\n\nRelationship repair\n\nFormer independent NT politician Gerry Wood has been an umpire for 50 years, and he blames the situation on a one-size-fits-all approach to football management.\n\n\"New people coming up after COVID, trying to introduce their ideas based on 'this is the AFL, Melbourne version', and bringing it up to the Northern Territory — I think that's a big mistake,\" he says.\n\nMr Wood penned an open letter to the umpiring community and the NTFL at the start of December, criticising what he called AFLNT's \"autocratic\" approach to consultation.\n\nGerry Wood says the way the NTFL has treated its umpires in recent years is \"really sad\". (ABC News: Roxanne Fitzgerald)\n\n\"The attitude seems to be 'we're in charge, you do as we say', and there's no consultation,\" he says.\n\n\" They want to have full control, what they're doing to the association is really sad. \"\n\nIn a statement, current NTFLUA president Liam Bentley said a meeting in early December had yielded promising signs.\n\n\"The NTFLUA remains confident in coming to a beneficial agreement with the AFLNT that will also improve umpiring in the NTFL,\" he said.\n\n\"We are hopeful that after recent discussions with AFLNT that umpiring in the NTFL will one day return to what it was and be a place that everyone wants to be a part of.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/mentors-gave-me-confidence-to-navigate-life-with-a-disability/106169450",
    "title": "Lily didn't want to be blind. Then she met others like herself",
    "publish_date": "Sat, 27 Dec 2025 21:41:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "Growing up vision-impaired, there were many challenges I faced that sighted people just could not understand.\n\nHow do I know if my makeup is applied evenly?\n\nHow do I sort the cards in my wallet so I know what I am handing over at the shops or doctor's office?\n\nHow will I know what colour clothes I am wearing?\n\nThese problems might seem frivolous. To me, each was a problem that needed to be solved.\n\nSure, I had great family and friends, as well as professionals like occupational therapists, to support me in developing strategies for tackling day-to-day tasks, but they were all sighted.\n\nWhat really made a difference were tips from other people who were blind.\n\nNas Campanella asked her mentors for tips on knowing what was in her wardrobe. (ABC News: Chris Taylor)\n\nOne showed me how to navigate a computer using screen-reading software.\n\nAnother talked me through preparing for university.\n\nWhen I became a mother, I reached out to blind parents for advice on feeding, swaddling and keeping track of my baby's whereabouts.\n\nTheir experiences gave me confidence and reassurance about my own.\n\nLearning strategies from other blind people supported Nas Campanella as she learnt to get about confidently. (ABC News: Brendan Esposito )\n\nMeeting Lily\n\nNow, years later, I've been able to give back.\n\nWhen a teacher's aide from Tasmania reached out asking if I'd connect with a student called Lily, I didn't hesitate.\n\nOver two years, Lily and I spoke on the phone, laughing and swapping stories.\n\n\"(I learnt that) I'm not the only blind person,\" the nine-year-old told me recently when we met for the first time.\n\nThere were squeals of excitement when she greeted me at her front door.\n\nLily Gatehouse said having her mentor visit her home was the best day of her life. (ABC News: Mary Lloyd)\n\nIt might have been the first time we had talked face-to-face, but we felt very familiar with each other.\n\nAs she took my arm to guide me through her house, we could not help but laugh at the idea of the blind leading the blind.\n\nThat is exactly what we have been doing in the years prior; she has been asking me questions about how to tackle different stages of her life, and I have been sharing my experience.\n\n\"Lily meeting other blind people … has probably been one of our most valuable tools,\" said mum Gemma Gatehouse.\n\n\"In those moments, Lily just gets to be blind (and) she gets to talk about things with people who get it.\"\n\nTeacher's aide Judi Kearsley supports Lily to access all the materials she needs for lessons. (ABC News: Mary Lloyd)\n\nLily was born with a genetic condition called Leber Congenital Amaurosis.\n\nShe has two younger siblings, Andy and Eddy, who are also blind.\n\nHer mum said she always wanted her children to have positive role models.\n\n\"Until we started really … bringing a lot of blind people around (Lily), she would say things like, 'I don't want to be blind,'\" she said.\n\n\"Now, that's the total opposite.\"\n\nLily shares her understanding of being blind with her brother Eddy. (ABC News: Mary Lloyd)\n\nUnlike most children with vision impairment, Andy and Eddy do not need to go far to find their own mentor.\n\nLily is leading the way, teaching them to read and write braille and to navigate the world using their other senses.\n\nShe began using a cane at age three, but Eddy, who is now three, has never known life without one.\n\n\"(They) learn from me, whereas I didn't have anyone to learn from,\" she said.\n\nEddy Gatehouse was confidently using a cane by the time he was three. (ABC News: Mary Lloyd)\n\nSupport for young people\n\nSupporting the next generation is a big focus for Sydney sisters Salonee and Simran Goyal.\n\nDuring early morning walks together throughout the pandemic, they hatched a plan to start Eye Empower — a mentoring program now run in partnership with the Save Sight Institute.\n\n\"We wanted to build a mentoring program by young people for young people,\" said Simran.\n\n\"The most important thing that young people need is sharing lived experiences with others, having a place where they can vent or share what they're going through,\" said Salonee.\n\nSimran and Solonee Goyal want young people with changing vision to get the support they need. (ABC News: Mary Lloyd)\n\nBoth women have personal experience with low vision.\n\nThey have each other to lean on and want the same for others.\n\n\"Seeing my sister going through it first, I had almost a benchmark and someone that I could confide in when I wasn't feeling 100 per cent,\" said Simran.\n\nTheir sessions are usually run online on topics like assistive technology, transitioning to university and how to disclose your condition to others.\n\nEye Empower events cover a range of topics about vision and life transitions. (ABC News: Mary Lloyd)\n\nThey hope that by creating a network, no one will feel isolated.\n\n\"We want young people to be as independent as they can and work hard and pursue whatever dreams they have,\" Salonee said.\n\nThat's exactly what Lily plans to do.\n\nShe hopes to travel the world and one day become a paramedic.\n\nEddy and Lily's parents want them to know they can do anything other kids can do. (ABC News: Mary Lloyd)\n\n\"I feel like I can do everything that sighted people can … but just in a different way,\" she said.\n\nTo hear Lily say that is all the confirmation I need to know that our friendship has made a difference for her.\n\nShe now knows makeup is best applied with your fingers, to put different textures on the cards in her wallet and to never buy two items of clothing with similar texture.\n\nLily is not the first young person with vision impairment that I have mentored, and she hopefully will not be the last.\n\nI love walking alongside young people, helping them navigate the ups and downs and supporting their dreams.\n\nI want to give them the same confidence and reassurance so many others have given me.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/matthew-hauser-triathlete-world-champion-olympic-dreams/106179648",
    "title": "Queensland triathlete making history and inspiring a new generation",
    "publish_date": "Sat, 27 Dec 2025 21:01:40 +0000",
    "category": "sports",
    "authors": [],
    "text": "For world triathlete champion Matthew Hauser, a weekly regime of running, riding and swimming hundreds of kilometres is par for the course when there are two Olympic games in sight.\n\n\"[I am] running around 80 kilometres a week, riding 300 to 350 kilometres a week and then swimming about 20 to 25 kilometres in the pool,\" he said.\n\n\"It’s certainly all-encompassing but I wouldn’t have it any other way.\"\n\nIn October, Hauser was the first Australian in 20 years to take out the World Triathlon Championship Series title in Wollongong.\n\nMatthew Hauser's achievements are inspiring the next generation of emerging triathletes in Hervey Bay. (Supplied: World Triathlon and Santara Studios)\n\nHe backed that up a month later taking out the Noosa Triathlon.\n\nHauser’s wins this year come after multiple achievements and accolades on home soil and internationally over the last 15 years.\n\nBut at his seaside hometown in Hervey Bay, three hours north of Brisbane, junior athletes look up to Hauser’s success as a shining beacon of what they could achieve.\n\nBut despite a full-time training schedule and long-term goals to qualify for the Los Angeles and Brisbane Olympics, the 27-year-old is only too willing to give back to the community where it all began.\n\nHumble beginnings\n\nHauser’s triathlete journey began in 2010 at school cross-country and athletics carnivals.\n\nHis life changed when Brian Harrington, the former Queensland school sport triathlon coach, noticed him.\n\n\"He needed me for a school triathlon relay [and] obviously being a bit of a decent runner he knew that I’d be able to help the team in that way,\" Hauser said.\n\nMatthew Hauser competing in the 2013 School Sport Australia Triathlon Championship in Penrith, New South Wales. (Supplied: Matthew Hauser)\n\nMr Harrington said Hauser’s drive made him stand out amongst his peers.\n\n\"He’s a very good listener … he’s smart to say, 'Okay I’ve got a weakness [and] I’ve gotta work on it',\" he said.\n\nHauser worked with his two coaches to improve his abilities in cycling, swimming and running.\n\nMr Harrington said the training schedule for a young triathlete can be a challenge.\n\n\"We probably trained with 10 sessions a week … three bikes, three runs and maybe another session either a bike, run or transition training,\" he said.\n\nMatthew Hauser trained around 10 times a week as a child to improve his skills in swimming, cycling and running. (Supplied: Matthew Hauser)\n\nAfter not achieving his target goal at the 2016 Junior World Triathlon Championship Series in Mexico, Hauser said he spent the rest of the year confronting bad patterns.\n\n\"Probably was a bit too complacent and probably didn’t prepare well … I learned a lot from that and went back to the drawing board,\" he said.\n\nHe acknowledged those lessons led to him taking the 2017 Junior World Triathlon Championship Series (WTCS) title in the Netherlands the following year, aged 19.\n\nWorld champion\n\nHauser was forced to take a break in 2018 after he was involved in a bicycle crash that left him with a dislocated shoulder and a broken hand.\n\nIt was one of several situations which forced him to re-evaluate his future.\n\n\"From then on I knew I needed to step it up a level in my professionalism and make sure my preparation was key,\" he said.\n\nWhile Hauser has made incredible strides in his career, a highlight was winning the WTCS title on home soil.\n\nMatthew Hauser currently holds the dual title of world champion and world mixed relay champion, a rarity in the sporting world. (Supplied: World Triathlon and Santara Studios)\n\n\"The opportunity is rare just to race our home world championships and then having the opportunity to compete for the gold medal is also really special,\" he said.\n\nHauser also holds the dual title for world individual champion and world mixed relay champion.\n\nHe said the rare accomplishment wouldn’t be possible without his teammates.\n\n\"It is something really special and this historic moment [is] for not only myself but for Aus triathlon,\" he said.\n\nOlympic glory\n\nGoing into 2026, Hauser’s training to defend his WTCS title and chase \"that bright North Star\" — the Olympics.\n\nAfter competing in Tokyo and Paris he’s hoping to earn a position on the team for the 2028 Los Angeles Olympics.\n\nThe 27-year-old said the qualifiers were expected to begin in the first half of next year and athletes were required to gain points to secure one of four spots for Australia’s relay team.\n\nMatthew Hauser is vying for a spot in the 2028 Los Angeles and 2032 Brisbane Olympic Games. (Supplied: World Triathlon & Santana Studios)\n\nAthletes need to accumulate points based on the events they compete in on the world circuit and their final position in each race.\n\nBut the allure of competing as a triathlete in the 2032 Brisbane Olympics is the ultimate dream, Hauser said.\n\n\"To have it just down the road in Brisbane … between where I grew up and where I’m now based … it’s a really special occasion I wanna be a part of,\" he said.\n\nGiving back\n\nAway from training at the Gold Coast, where he now lives with his partner, Hauser travels the 350 kilometres north to return to the community which helped him as a junior.\n\n\"To be able to cut time out, to come back home … [and] to get out and about and inspire our juniors is really special to us,\" recent Hervey Bay Triathlon Club president Paul Smith said.\n\nAt the club, Hauser helps coach the kids to improve their abilities and shares life lessons from more than 10 years in competitive sport.\n\nThe 27-year-old can also be found sharing his passion for triathlons at schools in the seaside town.\n\nMatthew Hauser regularly travels back to Hervey Bay to help coach younger athletes and speak about triathlons at local schools.\n\nMr Smith said club enrolments have increased by about 15 per cent since 2023.\n\nHe believed Hauser’s success was a driving factor in the growth.\n\n\"When somebody’s seen on the world stage … and a good old fashioned Australian [is] achieving people get a kick out of that,\" he said.\n\nBut for those hoping to have a long sporting career, Hauser said a strong support network was vital.\n\n\"Just surround yourself with people that love it and are in the journey for the right reasons,\" he said.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/vic-mother-pushes-for-safer-pool-fences-one-year-since-drowning/106085692",
    "title": "Mum of four-year-old who drowned pleads for safer pool fences",
    "publish_date": "Sat, 27 Dec 2025 20:41:32 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "For Morwell mother Rhiannon Egan-Lee, the holiday season, once a time of laughter and family, has been forever marked by trauma.\n\nOn December 17, 2024, her four-year-old daughter, Ivy Bella Roze, managed to shift a faulty panel of a wooden boundary fence, sneak through a gap, and jump into the neighbour's pool.\n\nShe had not yet learnt to swim.\n\nMs Egan-Lee leapt into the pool to try to save her daughter, but within minutes, she had already lost consciousness.\n\nIvy, who had been submerged long enough to suffer severe brain damage, was flown to the Royal Children's Hospital.\n\nAfter fighting for her life for 11 days, Ivy died on December 28, leaving her family heartbroken.\n\nRhiannon Egan-Lee says her life has changed since her daughter Ivy died. (Supplied: Rhiannon Egan-Lee)\n\n\"The moment I saw her [in the pool], I just felt hollow. I still feel hollow,\" Ms Egan-Lee said.\n\n\"I relive it every day, over and over and over again.\n\n\"It has completely devastated not just my household, but my entire immediate family. It has destroyed us; we're hanging on by a thread here.\"\n\nMs Egan-Lee, 38, said the whole dynamic of her life changed since her daughter's death.\n\n\"Ivy was a strong, kind, independent four-year-old. She spent most of her life dressed as Emma Wiggle, often crying at the washing machine waiting to put it [the costume] straight back on,\" she said.\n\n\" Ivy loved everything spooky. She loved snakes. She was love and kindness in a little yellow bow. \"\n\nRhiannon Egan-Lee says her daughter Ivy was her \"little superhero\". (Supplied: Rhiannon Egan-Lee)\n\n'Extremely traumatic', coroner says\n\nA coronial investigation into Ivy's death revealed that in February 2024, a registered building inspector had identified a non-compliant issue where a timber paling boundary fence had some missing and broken palings \"coming away\" from the timber rails.\n\nA week later, the inspector returned to the property and assessed that the pool safety barrier was compliant with the regulations, as the palings had been replaced and securely nailed in place.\n\nThe pool owner was then issued a certificate of barrier compliance.\n\nHowever, the day after Ivy's drowning, a Latrobe City Council building surveyor inspected the boundary fence and discovered the timber palings and horizontal railings of the fence were \"unsupported and liable to collapse\", finding the fence was no longer compliant.\n\nHe further stated the horizontal rails were not properly connected to the concrete posts, and the palings would fall off with the slightest amount of force.\n\n\"I accidentally knocked one over while carrying out a check of the palings; the fence was not serviceable,\" the inspector wrote in a submission to the Coroner's Court.\n\nMother not responsible, coroner finds\n\nIn his findings, Coroner David Ryan said the missing paling of the boundary fence had created a \"dangerous access point\" for Ivy.\n\nHe said pool owners had a responsibility to maintain safety barriers at all times.\n\n\"The Victorian Building Authority provides the following relevant guidance on its website: careful attention should also be taken where the safety barrier relies on a shared boundary fence with an adjoining owner,\" Mr Ryan said.\n\n\"This does not become a shared responsibility with the pool owner's neighbour.\n\n\"This is the sole responsibility of the pool owner to ensure the safety barrier is properly maintained.\"\n\nIvy was able to crawl through a gap into her neighbour's backyard before jumping in the pool. (Supplied: Rhiannon Egan-Lee)\n\nThe coroner said the adjoining owner [Ms Egan-Lee] was not responsible for the compliance and maintenance of the shared fence that the pool owner was relying on as a pool safety barrier.\n\n\"It is also critically important that when considering whether to issue a Certificate of Barrier Compliance under the Regulations, inspectors carefully assess the likelihood of a safety barrier becoming non-compliant with the regulations within the four-year life cycle of that certificate,\" he said.\n\n\"Notwithstanding the inspection and certificate issued in February 2024, I am satisfied that the boundary fence was not compliant with applicable barrier standards less than 10 months later.\n\n\" As a result, Ivy had the opportunity to be able to crawl through a gap in the fence and gain access to the pool. \"\n\nIvy Bella Roze's funeral brochure. (Supplied: Rhiannon Egan-Lee)\n\nPush for tougher pool laws\n\nThe incident has sparked a growing campaign for stricter pool safety laws in Victoria.\n\nMs Egan-Lee started a petition, that has received more than 1,000 signatures, advocating for mandatory four-sided isolation fencing around all private pools and a ban on using boundary fences as part of pool barriers.\n\nData from Life Saving Victoria (LSV) shows that between 2000 and 2024, there were 94 home pool and spa drownings in Victoria, with nearly a third involving children aged under 14.\n\nLSV general manager Andy Dennis said four-sided isolation barriers remained the most effective and \"gold standard\" measure to prevent child drownings.\n\n\"LSV acknowledges the challenges associated with implementing retrospective barrier upgrades across more than 200,000 home pools in Victoria and supports practical, staged approaches that enhance safety without creating undue burden on existing pool owners,\" Mr Dennis said.\n\n\"A concern for Life Saving Victoria is that, despite mandatory registration, less than half of all home pools are registered.\n\n\" This leaves a major gap in ensuring effective backyard pool and spa safety. \"\n\nRhiannon Egan-Lee has created a petition to amend pool fencing laws in Victoria in honour of her daughter Ivy. (Supplied: Rhiannon Egan-Lee)\n\nMs Egan-Lee hopes her advocacy will transform grief into action.\n\nIn the year since Ivy's death, she has raised awareness of the hidden dangers in backyards and the critical need for stringent pool safety measures.\n\n\"The current legislation allows for boundary fences to be used and it is very unsafe, and we are losing children and we will lose more children to this,\" Ms Egan-Lee said.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/renewable-energy-impacts-kentbruck-wind-farm/106157018",
    "title": "Climate a bigger threat to biodiversity than renewables, experts say",
    "publish_date": "Sat, 27 Dec 2025 20:26:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "As aging coal-fired power stations along Australia's east coast reach the end of their lives, the country is looking to transition to renewable energy to secure our energy sources into the future in the face of climate change.\n\nBut what happens when these developments have the potential to hurt sensitive ecosystems or biodiversity?\n\nIs some environmental damage an unfortunate — but unavoidable — casualty in the battle against climate change?\n\nEnergy revolution\n\nThe Victorian Department of Environment, Energy and Climate Action (DEECA) says that in the next 10 years at least an additional 9.5 gigawatts of energy is needed from on-shore renewable energy sources to meet its target of 95 per cent renewable energy by 2035.\n\nThe Kentbruck Green Power Hub near Nelson, about 330 kilometres west of Melbourne, is among the projects that could help the state hit these targets.\n\nIf approved, HMC Capital's project could see up to 105 turbines, standing at 270 metres tall, constructed across a pine plantation.\n\nProject documents for the Kentbruck Green Power Hub near Nelson show what the wind farm would look like above a pine forest. (Supplied: Neoen)\n\nProject documents say it will generate an estimated 600 megawatts of power — or enough to power about 400,000 homes — and is in an area with consistent high winds and a strong grid connection.\n\nIn December 2024, the Commonwealth government gave the project capacity investment funding as part of an underwriting scheme that aims to help Australia meet its renewable energy targets.\n\nThe future of the wind farm lies with Victorian planning minister Sonya Kilkenny, who will decide whether to grant it a permit.\n\nEnvironmental concerns\n\nThe proposed wind farm is adjacent to an internationally significant Ramsar-listed wetland and a number of national parks, sparking concerns it could pose a risk to a number of endangered birds, including the Australasian bittern, orange-bellied parrot and south-eastern red-tailed black cockatoo.\n\nMore than 200 submissions were made on the project during the public consultation period.\n\nAmong the concerns raised by environmental groups was lack of data on how birds used habitat in the area and inadequate plans to monitor and respond to any bird deaths caused by the wind farm.\n\nThe Kentbruck wind farm is proposed to be adjacent to Long Swamp, which is part of an internationally significant and Ramsar-listed wetland. (Supplied)\n\nThe Victorian National Parks Association is among the organisations that wants the wind farm moved to a different location that is less ecologically sensitive.\n\nAssociation campaigner Jordan Crook said on paper it looked good to put wind turbines in a pine plantation, which was already a degraded habitat.\n\n\"But when you zoom out and see that pine plantation is within an [ecologically] important area in the south-west, where there's already limited amounts of habitat because of past clearing, it really doesn't stack up,\" Mr Crook said.\n\nVictorian National Parks Association campaigner Jordan Crook says there is little untouched habitat in Victoria, due to land clearing. (Supplied: Jordan Crook)\n\nVictoria is the most cleared state in Australia, Mr Crook said, with about 70 per cent of native vegetation removed.\n\n\"How we put in new infrastructure should take that into account,\" he said.\n\nHe said the wind farm would fragment the landscape and prevent the free movement of wildlife in the wider area, potentially posing a collision risk to endangered birds and bats.\n\nThe wind farm's project documents said while there was a risk some birds could hit the turbines, birds were unlikely to fly high enough to pose a serious collision risk.\n\nClimate change a bigger threat\n\nAustralian National University professor of environmental and climate change economics Frank Jotzo said renewable energy projects have a \"minimal\" impact on the environment, and while that's unfortunate, they are for the greater good.\n\n\"Whatever we do, there will be some undesirable effects,\" Professor Jotzo said.\n\n\"In the big picture, there's no omelette you can make without breaking any eggs.\n\n\"Climate change is the far bigger threat to biodiversity, to our environment, agricultural systems and economy.\"\n\nFrank Jotzo says climate change is the biggest threat to biodiversity. (Supplied: Frank Jotzo)\n\nBut if renewable energy such as wind and solar is not expanded, then what alternatives are there?\n\n\"We would need to build new gas and coal-fired power stations, which would come at a higher cost than wind and solar,\" Professor Jotzo said.\n\nChris O'Keefe says renewable energy developers have the environment front of mind. (ABC News: Adam Wyatt)\n\nChris O'Keefe is the national spokesperson for the Clean Energy Council, an industry-advocacy group.\n\nHe said renewable energy existed to protect the environment.\n\n\"It was invented because of the major issues that are confronting the world on climate change,\" Mr O'Keefe said.\n\nBut can we perfect the balance between protecting ecosystems and biodiversity, and rolling out these projects?\n\n\"I don't think that's possible to say,\" Mr O'Keefe said.\n\n\"But … there is no renewable energy company in Australia that does not have the environment front of mind.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-28/local-government-inspectorate-rex-theatre-hepburn-hub-probe/106038890",
    "title": "Council watchdog under fire over abrupt end to long investigation",
    "publish_date": "Sat, 27 Dec 2025 20:20:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "Victoria's local government watchdog closed a long and resource-intensive investigation into a botched major council project without producing a final report on its findings.\n\nThe revelation sheds new light on the abrupt conclusion of an extensive investigation into the Hepburn Shire Council's failed redevelopment of a Daylesford theatre under former CEO Aaron van Egmond about a year ago.\n\nAt the time, the watchdog — the Local Government Inspectorate (LGI) — issued a brief media release explaining that there was insufficient evidence to prove any offences and the council had improved its procedures, so no investigation report would be released.\n\nBut calls for its release continued for months afterwards, as stakeholders pushed for transparency around the council's multi-million-dollar loss on the project.\n\n\"The council has called monthly — sometimes fortnightly — for the release of that document,\" former mayor and current long-term councillor Don Henderson said.\n\n\"We've been to ministers, we've been to the premier, we've been everywhere to get the release of that document.\n\n\" The council needs it. We should have it, and people who were involved should be answerable. \"\n\nDon Henderson says the council had repeatedly called for the report to be released. (ABC News: Patrick Rocca)\n\nDespite these calls, the years spent investigating and the creation of two detailed drafts, it can now be revealed that a final report was never produced before the investigation was closed.\n\nAn ABC investigation has uncovered evidence that the LGI determined it did not have the power to publish such a document during the course of its investigation.\n\nCouncil loses millions on bungled redevelopment\n\nOne of the largest buildings on the main street of Daylesford, the Rex Theatre was among eight sites shortlisted during the search for a new, multipurpose council venue in 2014.\n\nThe council's vision was for a \"modest, practical and sustainable\" facility, to be known as the Hepburn Hub, that would refresh key services like the town's library and the council offices.\n\nRating poorly on several criteria, the privately owned Rex was not among the three sites deemed most suitable for the project.\n\nIt would require about $9 million in grant funding to acquire and fit out — the highest price tag of any option shortlisted, and millions more than the council-owned town hall that was initially selected as the preferred site.\n\nThe council's handling of the redevelopment was the subject of a Local Government Inspectorate probe. (ABC News: Patrick Rocca)\n\nIt is unclear exactly what took place before councillors at an August 2016 meeting were told of \"a new opportunity\" to purchase the Rex building following discussions with its owner, according to meeting minutes.\n\nA motion to purchase the building was carried and the council bought the site for $6.34 million later that year, becoming an owner-builder on the major project.\n\nYears later, the council would say it could find no evidence of an independent valuation before the purchase.\n\nMr Henderson — the only still-serving councillor from that era — claimed councillors were not allowed into the site when it was under construction.\n\n\"We kept asking. When I actually got to have a look with all the councillors, I was just shocked,\" he said.\n\n\" I said, 'This can't possibly be done for this amount of money.' \"\n\nEarly analysis suggested the council-owned town hall building would be a more suitable site for the redevelopment. (ABC News: Patrick Rocca)\n\nA trail of council documents shows an initial estimated construction cost of $1.25 million and a 2017 completion date blowing out. The development was eventually suspended amid delays and claims of mismanagement.\n\nStaring down the prospect of as much as $18 million in additional costs to complete the fit-out, according to council documents, a refreshed group of councillors formally abandoned the project in the middle of 2022, and the building was sold for $3.75 million six months later.\n\nThe sale was $2.6 million less than the council had paid for the building years earlier. With $3 million already spent on the project, the shire shouldered a $5.6 million loss.\n\nWhile the Hepburn Shire Council maintains a recent rate cap variation would have been necessary anyway, it has conceded the multi-million-dollar figure, for a small council, was \"significant\".\n\nFinal investigation report does not exist\n\nThe project's failure was the subject of a comprehensive investigation launched by the LGI in 2019, after it was referred a complaint made by the Hepburn Shire Council's new CEO.\n\nAs the integrity agency tasked with investigating local government wrongdoing, the watchdog interviewed key figures and prepared at least two detailed drafts that ran scores of pages.\n\nBut a final report was nowhere to be found years after its expected release by the end of 2020.\n\nWork on the Hepburn Hub project was eventually suspended. (Supplied: Hepburn Matters)\n\nThen, in September 2024 — about five years after the investigation was launched — the LGI announced the probe had concluded with insufficient evidence to prove any breaches of local government legislation.\n\nIn a brief media release, the LGI said its chief municipal inspector (CMI) was also satisfied the council had improved its practices enough to avoid similar issues in future.\n\nLocal government regulator concerns The Local Government Inspectorate began investigating Hepburn Shire's handling of The Rex project in June 2019. The local mayor says it's unacceptable the findings still haven't been delivered.\n\n\"Accordingly, the LGI will not be taking any further action in respect of the investigation. Nor will the LGI be publishing any report,\" the media release said.\n\nWhen an apparent draft report was leaked online earlier this year, the ABC was unable to report on the document for legal reasons.\n\nInstead, it sought a copy of the final document under Freedom of Information (FOI) laws.\n\nMonths later, when the FOI request was finalised, the LGI revealed that the report did not exist.\n\n\"Documents relevant to this part of your request do not exist, as a final report of the investigation into this matter was not produced,\" the LGI wrote in its decision letter.\n\nThe agency reiterated its conclusion that no breaches of local government law could be proven and the council's processes had improved.\n\nIt later declined to answer a series of detailed questions — including why it took so long to finalise its investigation and how much it cost — because of confidentiality, referring the ABC back to its media release.\n\nQuestions over watchdog's powers\n\nA day before the LGI issued its media release, the ABC has since learned, a letter arrived in the mailboxes of several stakeholders privy to the watchdog's investigation.\n\nThe document relayed the investigation's outcome and reasoning behind it.\n\nBut it also suggested an additional reason the report would not be published — one that the LGI would not publicly disclose the following day.\n\n\"LGI has determined that the CMI does not have the power to publicly release or publish the draft report or any other report relating to the investigation under the Local Government Act 1989,\" it is understood the letter said.\n\n\" Accordingly, the inspectorate will not be publishing any report or tabling any report to parliament. \"\n\nRecipients of the letter were warned they could face a hefty fine or three months in prison if they breached an earlier confidentiality agreement over a draft report they had been provided, according to several sources.\n\n\"Further, a person who releases the draft report without the power to release it may be subject to civil claims for damages by those persons affected by the release,\" the letter continued.\n\nThe Hepburn Shire Council oversees several small communities in central Victoria. (ABC News: Patrick Rocca)\n\nIt is understood that the letter came with an A4 envelope to be used to mail the draft back.\n\nAmong people stakeholders the ABC spoke to, several speculated that the LGI had decided that publishing the report carried legal risk.\n\nPages and pages of material identified during the FOI search — which also sought documents related to the decision not to publish the report — were withheld from release because of legal privilege, with the LGI explaining they came into existence for the dominant purpose of obtaining and communicating legal advice.\n\nEmail attachments in some of the released documents also suggest there was extensive legal advice on the matter over several years, including the possible involvement of the Office of the General Counsel in 2023.\n\nDo you know more about this story? Contact Jesse Thompson at jpjt@protonmail.com. If you're sharing sensitive information, read our tips on how to contact us confidentially.\n\nMinutes from an LGI meeting in August 2024 mention a briefing with the attorney-general and raise the next steps for the investigation.\n\n\"Suggested that [redacted] to put a positive position and share the table of the changes they have made around new policies and procedures,\" the minutes say.\n\nThe council later shared a table outlining its progress implementing more than 40 LGI recommendations, but the LGI would not say whether it had encouraged the council to take that step when asked by the ABC.\n\nThe state government last year passed a series of local government reforms that provided the CMI with the power to table reports in parliament, brief ministers and serve infringement notices in relation to council election conduct and personal interest returns.\n\nIntegrity agency 'asleep at the wheel'\n\nSeveral Daylesford locals told the ABC that trust in the council and the LGI had languished in the information vacuum created by the investigation outcome.\n\nOne of the casualties of the saga was the Daylesford cinema, a volunteer-run operation that grew into a kind of community hub in a small town with limited entertainment options.\n\nDisplaced as construction got underway, the cinema is yet to welcome back audiences. Former president Gina Lyons and the entire committee resigned as the delays continued.\n\nMs Lyons was among several people to tell the ABC that their disappointment over the situation had been exacerbated by the LGI's handling of the investigation.\n\n\"It just made me think, 'What is their purpose? What is their value?'\" she said.\n\nGina Lyons says the community deserves transparency about the investigation. (ABC News: Patrick Rocca)\n\n\"They do a lot of stuff on their website about checking over councillors' returns, personal interest returns — that's just a box-ticking, paperwork exercise.\n\n\" Really important governance failures, they were asleep at the wheel. \"\n\nThere is widespread speculation that the LGI, which has about 10 employees, is facing significant resourcing constraints.\n\nThe LGI's website suggests the agency has not published an annual report in three years.\n\nIts most recent avilable annual report, from 2021-22, noted that holding people to account for breaches of local government legislation continued to be one of its greatest challenges because prosecutions are time-consuming and expensive.\n\nA spokesperson for Victoria's attorney-general, who has oversight of the LGI, did not directly answer questions about whether the government had reviewed the legal validity of the body's previous reports or held concerns about the inspectorate's effectiveness.\n\n\"The Local Government Inspectorate plays an important role in Victoria’s integrity landscape, by ensuring Victorian councils comply with the law,\" the spokesperson said.\n\n\"We continue to work with the Inspectorate to ensure they can deliver their important functions efficiently and effectively.\"",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/national/smartwatches-track-plenty-of-health-data-how-much-of-it-is-actually-useful-20251219-p5noz4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Smartwatches track plenty of health data. How much of it is actually useful?",
    "publish_date": "Sun, 28 Dec 2025 13:16:13 +1100",
    "category": "lifestyle",
    "authors": [
      "Liam Mannix"
    ],
    "text": "Loading David Scott, an associate professor at the Institute for Physical Activity and Nutrition, pays close attention to both his heart rate during training and at rest (his Garmin smartwatch tracks it between 45 and 50). A meta-review of 87 studies of resting heart rate, published in 2017, found every 10-beat-per-minute increase in resting heart rate increased the risk of heart disease, stroke, heart failure and cancer by around 10 per cent, and increased all-cause mortality risk by 17 per cent. A fitter heart is a more efficient heart, able to do the work of circulating the blood in less beats. Most types of exercise – including yoga – have been shown to push down resting heart rate by about five beats per minute. But there’s a lot of individual variation within the “average” resting heart rate. Younger, female hearts beat a little slower than older, male hearts, for example.\n\nAnd don’t try to compare your resting heart rate with your friends, Scott says. “We’re all getting older. Maintaining the same resting HR, rather than improving it, is still an improvement.” If you put your finger to your pulse, it feels steady and rhythmic. But under close examination, the rhythm reveals minute variation – literally between every heartbeat. The Apple Watch emits a green light when measuring the wearer's heart rate. Credit: SMH / Supplied Why? Because of the way the heart is wired up. The heart beats in response to electrical signals from the nervous system. The two halves of our nervous system – the sympathetic and parasympathetic – are designed to be in constant tension with each other. The parasympathetic nervous system is our brake, always pulling us towards calmness and tugging our heart rate down (when the parasympathetic nerve is cut during a heart transplant, heart rhythm rapidly accelerates). The sympathetic nervous system is our accelerator, looking for stress, primed to trigger our fight or flight response.\n\nLoading “There’s always a tension between the two. If heart rate variability is high, that’s a really robust nervous system,” says Dr Kegan Moneghetti, head of cardiovascular clinical services at the Baker Heart and Diabetes Institute. “Having a higher heart rate variability is good for the heart, and good for the body.” Higher heart rate variability is a sign both sides of the nervous system are in robust health. As we become more stressed, our sympathetic nervous system grows more active, and our heart rate variability falls: researchers consistently see lower HRV in people who are sick. It’s a sensitive metric, pushed up by exercise and down by alcohol, weight gain, or job stress. And it is an excellent measure of how well your body is adapting to training, says Professor Andrew McKune, senior adviser on recovery to the Australian Institute of Sport. Generally, the average weekend athlete will see their HRV increase after training, as their bodies adapt to stress. But if they approach exhaustion-levels of exercise, their HRV will fall, only rebounding after a big rest-break. “For myself – as much as I can be a bit of a sceptic for these – it does seem to be a pretty good indicator of when I’m going to get sick. I can see it trending down for three or four days, and I’ll say ‘uh oh’ to my wife,” says David Scott.\n\nBut he and other experts caution against reading too much into the exact HRV your smartwatch spits out. McKune typically spends a month monitoring an athlete’s HRV to work out the baseline. Your individual trend – up or down – is what matters. “It’s one component you might look at with interest. But we don’t say your HRV is 20, you need to do this and this,” says Moneghetti. Sekulovski in a hyperbaric oxygen chamber at P3 Recovery. Credit: Justin McManus Sleep, recovery, and readiness scores First-generation smartwatches merely tracked our health metrics. The modern versions try to turn these data points into scores: sleep scores, recovery scores, even readiness scores.\n\nLoading Let’s start with sleep. Scientists use brain electrical activity to monitor our sleep and break it up into phases: light, deep, and rapid-eye-movement (REM) sleep. Smartwatches don’t yet have the ability to eavesdrop on our brains, so they try to replicate that data by measuring how much our bodies move as we sleep, combined with heart rate and heart rate variability data. “It’s all algorithm based,” says Dr Donald Lee, a sleep physician at the Woolcock Institute of Medical Research. “It’s indicative and not authoritative – take it that way.” Not getting enough sleep long-term increases all-cause mortality and the risk of several chronic diseases. There’s a lot of individual variation in how much sleep is enough, but consensus medical guidelines encourage you to aim for seven to nine hours a night. What about sleep quality? That also matters: guidelines suggest the best sleep involves falling asleep 15 minutes after your head hits the pillow, waking one or less times a night, and not having extremely high levels of REM or extremely low levels of deep sleep.\n\nBeyond that, is there an optimal amount of REM or deep sleep we should target? “I hear it all the time: I’m not getting enough REM, or enough slow-wave,” says Lee. “There is no great robust evidence that says increasing or decreasing certain stages is beneficial.” Loading Even with those limitations in mind, Lee sees a role for smartwatch sleep scores, but suggests you focus on the trend, not on how you did in any individual night. “Be fascinated by the data that comes back from the devices,” he says. If there are problems, talk to a sleep doctor. That’s sleep. What about recovery? A small meta-analysis of seven studies on HRV, published in October, concluded heart rate variability did change meaningfully as people went through periods of stress and recovery. A 2023 meta-analysis of 17 studies found various recovery techniques – including massage, cold water immersion, stretching and massage – meaningfully increased HRV.\n\nBut just because HRV is a useful metric, it does not mean “recovery” or “readiness” scores are. HRV is a component of these scores, but they are generally proprietary, and the companies do not share how they are calculated. “We can’t get into them to understand how they are developed,” says David Scott. “The reality is, there’s not a lot of evidence behind them as to do they really predict if we’re prepared for peak performance.” Which leads us to perhaps the most fascinating data-point in recovery: a systematic review by Deakin University researchers looking at what metric best captured how fatigued an athlete was and how well they were recovering. Sekulovski in a pair of compression pants at P3 Recovery Centre. Credit: Justin McManus The researchers looked at heart rate, blood markers, oxygen consumption, HRV and a bunch of other measures. But one surprise metric beat them all: how stressed or recovered the athletes felt. “Your best indicator is how you are feeling physically and mentally,” says Scott. “Don’t become too dependant or get lost in these metrics.”\n\nLoading Recovery: what really matters The AIS’s McKune advocates thinking about your recovery strategies like a pyramid. At the bottom are the foundations that everyone needs to get right. “It’s not going to be anything special,” says McKune. Make sure you’re sleeping seven to nine hours a night. Refuel with carbohydrates and rebuild with protein. Replace lost fluids. As you go higher up towards the point, “they become more specific to the preferences of the individual athletes”, says McKune. The sort of stuff Stefanos Sifandos has at P3.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/sailing/sydney-to-hobart-yacht-race-2025-live-mild-conditions-set-for-the-race-as-master-lock-comanche-the-favourite-20251225-p5nq1c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney to Hobart Yacht Race 2025 LIVE: 33 yachts retire as SHK Scallywag 100 dethroned by Comanche",
    "publish_date": "Sun, 28 Dec 2025 13:14:44 +1100",
    "category": "sports",
    "authors": [
      "Frances Howe",
      "Billie Eder"
    ],
    "text": "Smuggler is sitting in third place in the overall standings now and owner and skipper Sebastian Bohm believes that’s only a temporary spot for the yacht as it seeks to beat Callisto, currently sitting in second.\n\n“We’re pushing hard to try and beat Callisto, obviously they’re our main competition. We want to win our division and we think if we do win that we might be in with a good chance overall but we’ll see.”\n\nBohm said the weather had worsened earlier than expected yesterday, but crew moral is at an all-time high on the other side of it.\n\n“It was a bit lighter than we thought, that first night. But we knew that the big blow was happening down on the South Coast yesterday and that seemed to kick in even earlier than we thought and it was quite full on really,” he said.\n\n“Thankfully the boat got through it, the crew got through it. No injuries, no damage and now we always knew today would be quite pleasant...\n\n“Now everyone’s brushed their teeth and taken their clothes off a bit more, some of the layers. Now we’re getting stuck in to some of the snacks and everything’s going well.”",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/politics/federal/the-31-billion-a-year-threat-to-the-australian-dream-climate-change-20251226-p5nq49.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The $31 billion a year threat to the Australian dream: Climate change",
    "publish_date": "Sun, 28 Dec 2025 12:44:36 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "Councils and state and federal governments are being warned to start spending billions of dollars as soon as possible to protect the nation’s housing stock from the impact of climate change or face a $31 billion a year damage bill.\n\nAs new research suggests Australia is about to enter a water desalination plant building boom to offset the impact of growing demand and climate change, the Productivity Commission says potentially avoidable damage to homes could cost the economy more than $700 billion by the end of the century.\n\nAustralian houses will face greater threats from climate change that will require changes to planning and construction, the Productivity Commission has warned. Credit: Louie Douvis\n\nThe commission has used a series of reports to look at policies that would increase speed at which the economy could grow without adding to inflation pressures.\n\nIn its report on moving to a net zero economy, the commission also conducted modelling into the impact of climate change on the nation’s housing stock.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/business/companies/dollar-bill-the-algorithm-ate-my-broker-but-should-it-20251228-p5nqdc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dollar Bill: The algorithm ate my broker – but should it?",
    "publish_date": "Sun, 28 Dec 2025 12:23:46 +1100",
    "category": "finance",
    "authors": [
      "Bill Mcconnell"
    ],
    "text": "In 2019 Australia had almost 28,000 licensed financial advisers. By mid-2025, fewer than 15,500 remained. To be fair, the AMP scandal of charging dead people advice fees and tighter regulation took a chunk out of the industry. But even allowing for that, the numbers represent a 40 per cent collapse in a little over five years. With the possible exception of taxi drivers, it’s hard to think of another profession that’s been technologically euthanised in such a short space of time.\n\nTreasury’s 2023 report; “Quality of Advice Review” called it a “crisis of accessibility.” Advice hasn’t just become scarcer; it now appears increasingly like a luxury good.\n\nThe human pause - that fragile gap between thought and trade - is being automated out of existence. Retail traders, armed with dashboards and dopamine, can push a junior explorer 40 per cent higher by the time the morning tea trolley swings by at the Club. Often there are no new assays, just new hashtags.\n\nCommSec now boasts over three million users, nearly half under 40, with the vast majority trading without a single conversation. Add Stake, Superhero and a dozen others – most of which Dollar Bill learnt about from his 19 year old son - and Australia now has more than four million app-based accounts driving about three-quarters of retail flow. What used to be a phone call has become a thumb swipe, not all that dissimilar to that Tinder thingy.\n\nToday’s brokers increasingly survive on the oxygen of corporate-finance, raisings, IPOs and placements. Global ETF assets have swollen past US$13 trillion, while Australian ETFs manage nearly A$300 billion. It’s automation over advice, index over instinct.\n\nBut despite all that, some of Dollar Bill’s best trades still come from a hybrid model - a human whisper from a Club member executed cleanly via app. And yes, on occasion, Dollar Bill does still follow the advice of a broker – just not George’s.\n\nASIC’s August 2025 consultation paper on trading systems (Paper 386), proposed kill-switches for runaway algos and the US SEC has floated similar circuit-breaker rules. When the plumbers start worrying about the pipes, you know the water’s running too fast.\n\nThis isn’t to say it’s all bad. Information has never been freer, access never easier, and the new generation of investor is sharper and faster than Dollar Bill’s old-school lot ever was. But the tide has turned and advice givers are now an endangered species.\n\nWhen Dollar Bill ran this thesis past a few learned colleagues at the Club, it rattled more than one cage. While some laughed, a few in particular - brokers and good ones - wanted to know whether Dollar Bill really believed the human adviser was finished. The truth, as we discussed deep into the night, is more complicated.\n\nYes, algorithms dominate the tape. Yes, 80–85 per cent of equity volume globally is now machine-generated. And yes, adviser numbers have collapsed with more than half the country trading through an app while waiting for a flat white.\n\nBut markets aren’t just math. They reflect behaviour, panic, ego, denial, fatigue, optimism and fear and none of those have been automated out of existence. In fact, if anything, they’ve been amplified.\n\nWhen volatility spikes, people don’t open an algorithm; they open a whisky. They call someone who knows the difference between a trade and a tantrum.\n\nAnd this isn’t nostalgia. Three of the largest money managers on the planet - Vanguard, Fidelity and Russell Investments - have all published variations of the same finding: advised clients outperform self-directed ones by 2–3 percentage points a year largely because a human adviser stops them making emotionally catastrophic decisions.\n\nPanic selling, overtrading and momentum chasing require restraint no algorithm can provide. The broker’s greatest value is often preventing a trade, not executing one.\n\nTry getting CommSec to talk you out of a terrible idea. All you get is a pop-up box and a “How was your experience?” survey. Try navigating a placement without a human. Try reading management’s body language on a site visit from an algorithm. Try calling an app after-hours to ask whether a CEO looked nervous or whether the third row of the drill core tray seemed suspiciously light. There are things the machines can do - speed, precision, pattern-recognition - but intuition still lives in the human spine.\n\nThen there’s the long lunch factor; the part the academics never model. Markets are built on relationships; the whisper networks, dinner conversations, misread signals and gossip you hear at the bar. Cities have been bankrupted on rumours and fortunes have been made on a shared hunch over a fillet mignon with a good pinot.\n\nSo maybe the algorithm hasn’t eaten my broker after all but merely swallowed the routine. What remains - judgement, context, restraint and the ability to read the room - still resides with people. And while poor old George was always destined to be replaced, some of his colleagues, admittedly fewer by the year, still offer something machines don’t.\n\nOnly people can provide guidance and a filter to the endless chatter. Only people can stand between investors and their worst impulses. And in a market increasingly driven by algorithms and speed, it’s this service that may be the rarest and most valuable of all.\n\nIs your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/i-was-in-a-state-of-shock-mcc-stands-by-curator-after-two-day-test-debacle-20251228-p5nqcc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I was in a state of shock’: MCC stands by curator after two-day Test debacle",
    "publish_date": "Sun, 28 Dec 2025 10:49:30 +1100",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "The Melbourne Cricket Club is standing by embattled curator Matt Page after this year’s Boxing Day Test finished inside two days, leaving Cricket Australia with a $10 million revenue shortfall.\n\nMCC chief executive Stuart Fox and Page faced the music on Sunday morning to explain why the expected day three crowd of 90,000 would have no cricket to watch due to a pitch that was heavily in favour of the bowlers.\n\nMelbourne Cricket Club curator Matt Page. Credit: Wayne Taylor\n\nThe MCG’s reputation as the best Test pitch in the country has taken a battering after staging just the 27th two-day Test in the format’s 148-year history. A total of 36 wickets fell in 142 overs, and the game finished in the final session of the second day.\n\nFox held discussions with CA chief Todd Greenberg and chair Mike Baird during the game and will chat further after the truncated game cost $10 million in revenue as well as the exposure that comes with the spotlight on the sport’s marquee game of the year.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw18-west-ham-vs-fulham-20251228-p5nqck.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW18: West Ham vs Fulham",
    "publish_date": "Sun, 28 Dec 2025 10:05:04 +1100",
    "category": "finance",
    "authors": [],
    "text": "Rapid Recap | MW18: West Ham vs Fulham\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/curator-in-state-of-shock-after-boxing-day-test-20251228-p5nqcj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Curator in 'state of shock' after Boxing Day Test",
    "publish_date": "Sun, 28 Dec 2025 10:02:59 +1100",
    "category": "finance",
    "authors": [],
    "text": "Curator in 'state of shock' after Boxing Day Test\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw18-nottm-forest-vs-man-city-20251228-p5nqch.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW18: Nott'm Forest vs Man City",
    "publish_date": "Sun, 28 Dec 2025 10:00:51 +1100",
    "category": "finance",
    "authors": [],
    "text": "Rapid Recap | MW18: Nott'm Forest vs Man City\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw18-liverpool-vs-wolves-20251228-p5nqcf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW18: Liverpool vs Wolves",
    "publish_date": "Sun, 28 Dec 2025 09:55:13 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW18: Liverpool vs Wolves\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw18-chelsea-vs-aston-villa-20251228-p5nqcd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW18: Chelsea vs Aston Villa",
    "publish_date": "Sun, 28 Dec 2025 09:49:41 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW18: Chelsea vs Aston Villa\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw18-burnley-vs-everton-20251228-p5nqc8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW18: Burnley vs Everton",
    "publish_date": "Sun, 28 Dec 2025 09:44:32 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW18: Burnley vs Everton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw18-brentford-vs-bournemouth-20251228-p5nqc5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW18: Brentford vs Bournemouth",
    "publish_date": "Sun, 28 Dec 2025 09:39:10 +1100",
    "category": "finance",
    "authors": [],
    "text": "Rapid Recap | MW18: Brentford vs Bournemouth\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/culture/movies/filmmaker-tyler-perry-accused-of-sexual-assault-a-second-time-20251228-p5nqc1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Filmmaker Tyler Perry accused of sexual assault again",
    "publish_date": "Sun, 28 Dec 2025 09:32:38 +1100",
    "category": "entertainment",
    "authors": [
      "Francesca Regalado",
      "Mark Walker"
    ],
    "text": "A second actor has sued filmmaker and media mogul Tyler Perry, accusing him of sexual assault and seeking $US77 million ($115 million) in damages, according to a complaint filed Thursday in the Los Angeles Superior Court.\n\nIn the lawsuit, which also names the production company Lionsgate as a defendant, the actor, Mario Rodriguez, said he was subjected to multiple instances of sexual assault at Perry’s Los Angeles home.\n\nTyler Perry in June, the month he was first accused of sexual assault. Credit: Jordan Strauss/Invision/AP\n\nRodriguez had a small role in the 2016 comedy Boo! A Madea Halloween, a movie that Perry directed and starred in. Rodriguez told Perry that he had never acted before auditioning to get that part, according to the lawsuit.\n\nAccording to the complaint, Rodriguez was approached by a trainer at a Los Angeles Equinox gym in 2015 about meeting with Perry about a possible acting role as a “very good-looking college student” in a new movie that later became Boo! A Madea Halloween.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/the-great-pace-race-inside-brett-lee-s-20-year-quest-to-bowl-160km-h-20251227-p5nq8u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The great pace race: Inside Brett Lee’s 20-year quest to bowl 160km/h",
    "publish_date": "Sun, 28 Dec 2025 09:15:00 +1100",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Brett Lee’s first ball to a Test cricketer swung wide – at a fair clip, of course – and would’ve finished at gully if not for the SCG netting. Some six years before the most storied of Boxing Day Test debuts, when he razed India with 5-47 and a wicket in his first over in 1999, Lee first rose to prominence in Australian cricket circles – once he landed a ball on the pitch. Brett Lee celebrates his debut Test wicket - Indian opener Sadagoppan Ramesh - at the MCG. Credit: Will Burgess Lee is the latest inductee to the Australian Cricket Hall of Fame, some 32 years after accepting an invitation to bowl at modern-day greats Allan Border, Steve Waugh and David Boon as they prepared for the travelling World Series carnival of 50-over cricket. At 16, short and still whippet thin, Lee may have borne a passing resemblance to the champion greyhound that would one day be named after him. He still “had to run around under the shower to get wet”, after all. His mother, Helen, dropped him out the front of the SCG after driving up Mt Ousley in the Mitsubishi Sigma that ferried brothers Shane, Brett and Grant from Mount Warrigal on the NSW South Coast to any number of suburban grounds. He raised eyebrows marking out his run-up, given he marched 15 metres past the mark set by Craig McDermott, then Australia’s foremost fast bowler. His first ball drew guffaws as it cannoned straight into the off-side net, but little more than a grunt from Boon facing up at the other end.\n\nAdvertisement\n\n“Second ball, brand new white ball, it swings to leg, straight into the other side of the net, on the full as well,” Lee laughs. “Blokes are starting to laugh. Boony didn’t say much – just picked the ball up and tossed it back. “I’m at the top of my mark again, full of nerves, I’m all over the shop. And I just think ‘Stuff this. Run in, bowl quick. Back yourself.’ “Third ball, it’s a perfect yorker, rips Boony’s pegs out. I’ve got this big smirk on my face and poor old Boony’s been stitched up with the worst practice you could imagine.” Lee joins a cohort of Australian greats in the Hall of Fame courtesy of more than 700 international wickets, Test and World Cup triumphs and a career spanning more than a decade. His status as one of the game’s unfailingly, infallibly nice guys is a genuine badge of honour. “I loved winning, I loved taking wickets and the teams I played in,” Lee says.\n\nAdvertisement\n\n“But my biggest personal achievement in cricket was bowling fast. Going past the 160km/h barrier – that’s what I’m proudest of.” Brett Lee jumping for joy: a familiar sight throughout the 2000s. Credit: AP ‘An injection of straight adrenaline’: what it takes to bowl truly fast Lee is one of five bowlers to have cracked the fabled 160km/h mark (in front of a speed gun, at least). He swears he told his parents he’d do so, wearing the baggy green, at age nine. Lee will turn 50 next year, and his body has been put through a wringer of 20-odd years of bowling at express pace. Despite two broken backs, six ankle operations, busted shoulders and elbows, his frame has survived remarkably well for all the work Lee put into his craft.\n\nAdvertisement\n\nBrett and Shane Lee as youngsters at their childhood home at Mt Warrigal on the NSW South Coast. “I saw all the videos of Jeff Thomson bowling absolute rockets in the ’70s and ’80s, and I knew straight away that bowling fast was what I wanted to do,” Lee says. “I knew it was going to be the hardest job in the world and I knew there were going to be sacrifices… I played my last Big Bash game when I was 39, and I was working on my bowling action right up until that last game. In my eyes, I never got it absolutely perfect, but I’m a bit of a perfectionist.” Fast-twitch fibres from mum Helen’s sprinting background, his dad Bob’s doggedness and determination, and a childhood sparring in the family’s NSW South Coast backyard make for a fair fast-bowling base. Speed demon: Lee training with NSW in 1999. Credit: Iain Gillespie A ball randomly chased down a hill in Kiama as a teenager had “my legs in overdrive, moving faster than I’d ever moved. And I thought, there’s something here. How do I move as fast as possible, and transfer that into bowling faster?” Soft-sand running. Lean muscle and body weight exercises over mass. Grass sprints and all manner of exercises and training programs cooked up by former Australian strength and conditioning coach Jock Campbell, who most memorably incorporated a parachute into Lee’s resistance training at the 2003 World Cup.\n\nAdvertisement\n\nIt all amounted to more than a decade of Lee sprinting 20-odd metres up to 120 times in a day. Launching his body into the air, snapping roughly 16 times his body weight through his front foot and slinging the ball at blistering pace. Brett Lee puts Jock Campbell’s parachute to work in South Africa. Credit: Getty Images “You think about F1 and how they tune their cars – it’s so many minute things that have to be in sync,” Lee says. “It’s all the training and preparation. It’s the wind, it’s your footmarks, snapping down your front arm and your wrist – it’s all timing and coordination. “But when it all works, and the ball flies through to Gilly [long-time Test wicketkeeper Adam Gilchrist], there’s nothing quite like it. It’s the best feeling in the world. It’s like an injection of straight adrenaline when you can bowl truly fast.” Lee left no stone unturned ensuring his body was fit for fast bowling. Credit: Getty Images ‘Binga, I’m going to kill you’: The great pace race\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/how-young-birdwatchers-are-taking-flight-in-the-digital-age/z429mjnsn",
    "title": "How young birdwatchers are taking flight in the digital age",
    "publish_date": "Sat, 27 Dec 2025 21:02:38 +0000",
    "category": "sports",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nMeeting a three-time premiership winning rugby league player to look at birds on the outskirts of Western Sydney wasn't on my 2025 bucket list, but 27-year-old Penrith Panther's hooker, Mitch Kenny has agreed to show me his new hobby.\n\n\n\n\n\n“I like getting outside anyway and going on walks and stuff like that, so it's probably just an addition to that. I think it started out as a joke, but you can't joke birdwatching. You're either going out and looking for birds or you're not.”\n\n\n\n\n\nAs we walk down the track, which I'm told is a local favorite for the diversity of habitats, you can see in such a short space, he stops frequently to point out the birds we're seeing,\n\n\n\n\n\n“They were just a couple doves. I think they barred shoulder doves, just like pigeon looking birds, which we don't hate, but some we just don't care about that much. What is that? It might be blackface cuckoo shikes.”\n\n\n\n\n\n“How did you get into bird watching?”\n\n\n\n\n\n“Mainly through my brother. He's always been super keen on wildlife and he's always done this sort of stuff since I moved out here and he lives just up the mountains, started going out in these little expeditions and then tried to steal his hobby and make it a bit of my own and bought myself a pair of binoculars this year and started trying to get into this. And yeah, still just learning.”\n\n\n\n\n\nIt was in the Blue Mountains that he saw what's known as a spark bird - the term for a bird that gets someone seriously into bird watching after they see it.\n\n\n\n\n\n“I always used to go to this one lookout in the lower mountains anyway, but there was signage there that said lookout for the peregrine falcon, the world's fastest bird. It's a raptor. So it was pretty cool and I started going and taking my binoculars every time and it probably took me six or seven times before I finally saw it, and that was my first time feeling the rush of getting a good get.”\n\n\n\n\n\nHere's one of a growing number of young people getting into birdwatching. After operating for five years, the inner west based birdwatching group, Sydney Bird Clubs, saw one of its biggest ever turnouts In February, 2020,\n\n\n\n\n\n“Just before COVID, it felt to us like we were on the cusp of a birdwatching boom. So there was a curiosity among people, and then I think during the pandemic it turned into a hardcore passion for a lot of people.”\n\n\n\n\n\nThat’s co-founder Stephanie Chambers, who says the club was set up to break the barriers to getting into birdwatching. The club's seen an influx of younger members in recent years. Environmentalist and host of Death by Birding podcast, Dr Cesar Puechmarin says the pandemic was a catalyst for many new birders.\n\n\n\n\n\n“I think birds have been thrown into our orbit, especially post COVID. So during COVID, a lot of people were stuck indoors. A lot of people were unable to explore, to go outside, and people started noticing the birds in their local environment, their own backyard. You have a generation of people who grew up playing video games or playing games like Pokemon, and this hobby of birdwatching fits perfectly, right. It's a never ending hobby. You can't finish it, you can't complete it. It's not like a video game that you can complete and then that's it. There will always be more birds.”\n\n\n\n\n\nMs Chambers says birdwatching allows people to tap into something that's almost an antidote to the internet.\n\n\n\n\n\n“I view it as a form of resistance against technology and social media. With our modern world, with the internet and social media, we're losing something and when you bird watch, you're not only just watching birds, you're watching seasonal changes, you're observing migrations. And so I think it tunes you into something that you would be without if you didn't. So I think it strikes at the core of who we are as humans.”\n\n\n\n\n\nBut that act of resistance against social media is now popping up online. Senior public relations manager at Bird Life Australia, Sean Dooley says the new generation of birders are turning to social media\n\n\n\n\n\n“And we were certainly worried in the digital age that people were just on their screens and not out in nature. But the sort of, I dunno what you call it, like the nature TikTok or the naturegram bird Instagram has really taken over because birds are so beautiful to look at and you can actually have an adventure seeing them, that it has attracted a whole tribe of digital natives to it.”\n\n\n\n\n\nThat online community has moved into the real world for Mitch Kenny, who's been out on a number of bird dates since he started posting about birds online.\n\n\n\n\n\n“You meet someone, you talk a bit of shit, go for a walk and hopefully see a few birds. It is pretty fun. I think I'm pretty keen to go out with someone who knows what they're looking for. And then some people are pretty keen to meet a footy player and stuff like that, so there's a mutual exchange there. So everyone wins.”\n\n\n\n\n\nMr. Dooley says that transfer of knowledge is important.\n\n\n\n\n\n“When you move into the wild, there is a risk that you were disturbing the natural life cycle of birds. But I think when the community find each other, they do start to, that type of advice is like, Hey dude, you shouldn't really be going up to that nest because that eagle will abandon the chicks if you come too close. That sort of information starts to get shared.”\n\n\n\n\n\nHe says, when people get more interested in birds, it has flow on effects.\n\n\n\n\n\n“Hopefully that in a lot of people's birdwatching journey, they come to the realization that to continue the passion that they love because of the variety we have in Australia, we want to keep that variety and that people are going to have to do something about it to save the things that bring them joy.”\n\n\n\n\n\nSomething Mitch Kenny says he's already experiencing.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/summer-rental-property-market-heating-up/cgrp2mvbv",
    "title": "Inside Australia's rental crunch — and what the numbers say about 2026",
    "publish_date": "Sat, 27 Dec 2025 19:45:01 +0000",
    "category": "finance",
    "authors": [],
    "text": "Summer may bring more rental listings, but with demand still overwhelming supply, experts say soaring prices are cementing housing affordability as one of Australia's biggest economic flashpoints heading into 2026.\n\n\n\n\n\nRents for houses remain at record highs across the country, with unit prices not far behind, as Australia enters the peak lease-changeover period.\n\n\n\n\n\nThe summer months have long delivered the biggest surge in rental listings, but this year's activity has been intensified by the return of international students, new migrant workers, and local renters searching for more affordable options.\n\n\n\n\n\nNicola Powell, chief of research and economics at Domain, told SBS News summer consistently marks the busiest period for new leases and renewals.\n\n\n\n\n\n\"You tend to find that vacancies start to rise towards the end of the year as those listings come onto the rental market,\" she said.\n\n\n\nPowell said this follows a big changeover period early in the new year, when vacancy rates are expected to dip again once that wave of activity passes.\n\n\n\n\n\nShe said this pattern reflects the calendar for universities and graduate hiring, as well as landlords' preference to advertise during the holiday period when they have more time to organise maintenance and inspections.\n\n\n\nStill a 'landlord's market'\n\nEven with the seasonal boost in listings, renters are unlikely to feel real relief, according to Powell.\n\n\n\n\n\nVacancy rates across the country remain below 2 per cent — an exceptionally tight level that continues to favour a \"landlord's market\".\n\n\n\n\n\n\"The rental market is still competitive,\" she said.\n\n\n\n\n\n\"Tenants are going to find there is more choice, but more tenants are looking for rentals at this period of time as well.\"\n\n\n\nLISTEN TO INTERVIEW: Eliza Owen from Cotality on the RBA's impact on the property market SBS News 05:48 English\n\nRecord-low vacancies have also helped push both house and unit rents to new heights in most major cities.\n\n\n\n\n\n\"Some of our major capital cities are better than others, but I think we still have high rents. We still have house rents at record highs across all our capitals,\" Powell said.\n\n\n\n\n\n\"Most capital cities have high unit rents as well.\"\n\n\n\nWeekly rents remain high\n\nData from Domain shows rents for houses and units have steadily increased over the seven years to September 2025.\n\n\n\n\n\nSydney remains the most expensive city for units, averaging $750 a week, while Hobart is the cheapest at $490.\n\n\n\n\n\nFor houses, Sydney again tops the list at $780 a week. Hobart and Melbourne share the lowest average house rents at $580.\n\n\n\n\n\nAcross the combined capitals, the average weekly rent for houses and units sits at $650.\n\n\n\nSydney remains the most expensive city for units, averaging $750 a week, while Hobart is the cheapest at $490, according to Domain's September 2025 Rental Report. Source: SBS News Powell said the government's new first-home buyers' scheme could reduce pressure on the rental market — but not immediately.\n\n\n\n\n\n\"The scheme could take some element of demand away from the rental market, but whether or not it'll be felt as quickly as this changeover season is to be determined,\" she said.\n\n\n\n\n\n\"Over time, we should see more tenants transitioning to being homeowners. That's the aim of this policy.\"\n\n\n\nSydney has the highest average house rent at $780 per week, while Hobart and Melbourne have the lowest average house rents at $580 per week, according to Domain's September 2025 Rental Report. Source: SBS News\n\nNegotiating your rent in a tight market\n\nDespite strong competition, this moment of higher supply may give tenants a brief window to negotiate — particularly those with a reliable payment record or long-term tenancy.\n\n\n\n\n\nLeanne Pilkington, president of the Real Estate Institute of Australia, told SBS News both tenants and landlords should familiarise themselves with their rights, review comparable rental prices and start conversations early.\n\n\n\n\n\n\"Tenants should know their rights and start lease talks early,\" she said.\n\n\n\n\n\n\"Landlords should keep properties in top shape, follow the rules, and give proper notice for rent or lease changes.\"\n\n\n\n\n\nShe said landlords can increase rent according to state and territory rules, but they are required to provide proper written notice to tenants and adhere to the required notice periods.\n\n\n\n\n\nTenants, on the other hand, can negotiate before signing a lease renewal or accepting a rent increase.\n\n\n\n\"They can ask for a lower rent, get more information, or suggest terms based on what's fair in the current market or their personal situation,\" Pilkington said.\n\n\n\nSubletting on the rise — and the risks\n\nWith rising costs prompting some renters to consider subletting for the first time, Pilkington warned failing to follow legal requirements can lead to disputes, fines, or broken leases.\n\n\n\n\n\nIn most states and territories, tenants must obtain their landlord's written permission before subletting or adding occupants.\n\n\n\n\n\nSome leases prohibit subletting altogether, while others allow it with specific conditions.\n\n\n\nREAD MORE 'Unacceptable': The question nearly seven in 10 renters fear asking their landlord\n\n\"When putting the agreement in writing, it should clearly address: rent or contribution to utilities, access to shared spaces, length of stay, notice periods, responsibilities for cleaning, guests, noise and property maintenance and what happens if something is damaged or lost,\" Pilkington said.\n\n\n\nWhat does this mean for 2026?\n\nExperts say this year's supercharged summer market suggests affordability pressures will remain acute in 2026, even as new policies aim to gradually shift some renters into homeownership.\n\n\n\n\n\nKaytlin Ezzy, an economist at property analytics group Cotality, said it is \"unlikely\" property prices will fall in the near term.\n\n\n\n\n\n\"The same factors that have supported value growth over the past few months, including restricted advertised supply, lower borrowing costs and the expansion of the First Home Guarantee scheme, will likely continue to support growth in 2026,\" she said.\n\n\n\n\n\nEzzy said government policies around housing are likely to push values higher, unless they are specifically designed to increase supply or reduce demand.\n\n\n\n\n\n\"The expanded first home guarantee schemes, for example, while great at helping some first-time homeowners get into the market, have placed pressure on home values, not only from said first-time buyers but also from speculative investors chasing capital gains in these areas,\" she said.\n\n\n\n\n\nWhile property prices show no sign of falling, renters may experience some relief in the months following summer, when competition for rentals tends to decline, according to Ezzy.\n\n\n\n\n\n\"After rising on average around 9 per cent between December and March, the rolling 3-month count of new rental listings typically eases into a quieter winter period, declining on average by 8.5 per cent between March and June.\"\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/new-developments-and-old-battles-australias-health-year-in-2025/6tepe42lf",
    "title": "New developments and old battles: Australia's health year in 2025",
    "publish_date": "Fri, 26 Dec 2025 20:30:00 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nCasualty, Grey's Anatomy, New Amsterdam, E-R, House... we all love a medical drama.\n\n\n\n\n\nBut we're not so keen, as a rule, on medical dramas in our own lives.\n\n\n\n\n\nFor a nation still feeling a bit bruised by the aftermath of the COVID pandemic, the news in January that a person in the United States died from H5N1 Bird Flu wasn't exactly comforting.\n\n\n\n\n\nSBS spoke to Michelle Wille, a Senior Research Fellow at the Centre for Pathogen Genomics at the University of Melbourne, to find out whether Australian were in any actual danger.\n\n\n\n\n\nIt turns out Australia is one of the few places in the world where H5N1 is not endemic - but even so, it's wise to take precautions.\n\n\n\n\n\n\"The most recent assessment came out in December. Still suggests that the risk of avian influenza infection to the general public remains low, but it is higher for occupationally exposed workers. Okay, these are people who would infect or interact with infected animals. So for the average person, our risk is quite low. But if you have chickens and they are sick, it's important to get those animals tested and know your risks.\"\n\n\n\n\n\nBut while we seem to be off the hook for bird flu - at least for now - would we be ready for another pandemic, five years after COVID?\n\n\n\n\n\nProfessor Paul Kelly, the man who helped lead Australia's COVID-19 public health response, told SBS he's not so sure.\n\n\n\n\n\nHe worries people may not accept another vaccine program.\n\n\n\n\n\n\"Trust is hard to win and easy to lose. And I think that will be a major issue for us going to the next pandemic. The Australian public was enormously trusting of medical advice and the politicians that were in charge at the national and the state and territory level. I'm not sure that that's the case now.\"\n\n\n\n\n\nAlso in January, the Federal Government unveiled Australia’s first-ever National Autism Strategy—a $42 million plan to improve inclusion, access, and outcomes for Australians with autism.\n\n\n\n\n\nAdvocates are calling it a game-changer, offering hope and much-needed support to families across the country who face unique and daily challenges.\n\n\n\n\n\nMaking the announcement, Minister for Social Services, Amanda Rishworth said communities from migrant backgrounds were identified as a priority cohort, to address unique barriers they face.\n\n\n\n\n\n\"Whether that is through the peer support, whether it is through being very conscious of asking people how they would like to be communicated in different government systems, making sure that we have resources in language is some of the initiatives that we have committed to to make sure there is a priority for linguistically and culturally diverse people.\"\n\n\n\n\n\nWith more than 400,000 Australians identified by the Government as living with dementia, not surprisingly there was interest in a new blood test being trialled in the United Kingdom to detect the early signs of dementia.\n\n\n\n\n\nIn the study at the University of Oxford, blood samples are scanned for a series of proteins – biomarkers, associated with dementia - that can provide early diagnosis.\n\n\n\n\n\nProfessor Kaarin Jane Anstey, from the University of New South Wales, says while medications can assist people in the early stages of dementia, they are not a cure.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/najib-razak-convicted-1mdb/vwrsclib1",
    "title": "Former Malaysian PM Najib Razak jailed for 15 years over 1MDB scandal",
    "publish_date": "Fri, 26 Dec 2025 11:11:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Former Malaysian prime minister Najib Razak has been jailed for a further 15 years after he was found guilty of abusing his power to plunder millions from the 1MDB sovereign wealth fund and launder the proceeds.\n\n\n\n\n\nThe sentence is in addition to the six-year term he is already serving for a separate case related to the now-defunct state investment vehicle.\n\n\n\n\n\nPresiding Judge Collin Lawrence Sequerah convicted the 72-year-old former leader on all four counts of abuse of power, as well as all 21 counts of money laundering, involving around 2.28 billion ringgit (AU$840 million) from the fund.\n\n\n\n\n\nNajib, dressed in a navy blue suit and white shirt, was seen looking down, slumped in his seat as the judge read the verdict.\n\n\n\n\n\nSentences were handed down of 15 years for each count of power abuse and five years for each money laundering charge, to be served concurrently, after Najib's current jail term ends in 2028.\n\n\n\n\n\nNajib was ordered to pay fines of 11.39 billion ringgit (A$4.2 billion), and the court said 2.08 billion (A$762 million) ringgit in assets must be recovered from him. Failure to deliver on both would result in additional jail time, it said.\n\n\n\nREAD MORE Ex-Malaysian PM Najib Razak sentenced to 12 years in jail after first trial over 1MDB scandal\n\nNajib's lawyer Muhammad Shafee Abdullah said he would appeal the ruling on Monday.\n\n\n\n\n\nIn a statement read by his lawyer, Najib urged Malaysians to remain calm and rational and vowed to continue his fight.\n\n\n\n\n\n\"This struggle is not an effort to avoid responsibility,\" he said. \"It is an endeavour to uphold justice, to uphold the integrity of the constitution, and to defend the sovereignty of the rule of law without fear or favour.\"\n\n\n\n\n\nWhile Najib, the son of one of the country's founding fathers, was groomed for leadership from a young age, he experienced a spectacular fall from power as public anger mounted over the corruption scandal.\n\n\n\n\n\nSince his 2018 election loss, investigations under successive governments have ensnared him and his wife Rosmah Mansor in graft allegations.\n\n\n\n\n\nProsecutors say Najib abused his positions as prime minister, finance minister and 1MDB advisory board chairman to move vast sums from the fund into his personal accounts more than a decade ago.\n\n\n\n\n\nAccording to investigators, proceeds from the fund were used to bankroll high-end real estate, a luxury yacht and precious artworks.\n\n\n\n\n\nDelivering the verdict on Friday morning, Judge Sequerah dismissed several of the defence lawyers' arguments, including that Najib had been duped by his close associate, the shadowy businessman Low Taek Jho, better known as Jho Low. Low denies all wrongdoing and his whereabouts are unknown.\n\n\n\nNajib Razak has been in prison since August 2022. Source: AAP Najib has maintained he was misled by Low and other 1MDB officials into believing that funds deposited into his account were donations from the Saudi royal family.\n\n\n\n\n\nHe has apologised for allowing the 1MDB scandal to happen during his tenure, but has consistently denied wrongdoing, maintaining he knew nothing about illegal transfers from the fund.\n\n\n\n\n\nNajib could face maximum jail terms of between 15 and 20 years on each charge, as well as a fine of up to five times the value of the alleged misappropriations.\n\n\n\n\n\nNajib has been in prison since August 2022, when Malaysia's top court upheld a verdict convicting him of corruption for illegally receiving funds from a 1MDB unit.\n\n\n\n\n\nHis 12-year jail sentence in that case was halved last year by a pardons board.\n\n\n\n\n\nHis legal battle was dealt yet another blow on Monday after he lost a bid to serve the remainder of his current jail term at home rather than the Kajang Prison outside Kuala Lumpur.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/video/meet-the-canine-seagull-patrol-specialists-protecting-australias-restaurants/ifur69pax",
    "title": "Meet the canine 'seagull patrol' specialists protecting Australia's restaurants",
    "publish_date": "Fri, 26 Dec 2025 09:29:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Meet the canine 'seagull patrol' specialists protecting Australia's restaurants\n\nPublished 26 December 2025, 9:03 am\n\nA unique initiative which trains dogs to protect al-fresco diners from hungry seagulls is taking off. Active in multiple locations across the country, the furry Seagull Patrol is preparing to expand. Tasked with deterring swooping birds at the new Sydney Fish Markets, it is set to open next month. This story was produced in collaboration with SBS Chinese.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/video/australians-have-taken-advantage-of-this-years-boxing-day-sales-amidst-a-cost-of-living-crisis/bkrh918xd",
    "title": "Australians have taken advantage of this year's Boxing Day sales amidst a cost of living crisis",
    "publish_date": "Fri, 26 Dec 2025 09:16:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australians have taken advantage of this year's Boxing Day sales amidst a cost of living crisis\n\nPublished 26 December 2025, 8:01 am\n\nBudget conscious shoppers and those who like a bargain have taken advantage of a Boxing Day tradition: the sales. Consumers are being warned to be on alert for shopping scams, with this year's Boxing Day sales forecast to rise by about 4 per cent.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/national/smartwatches-track-plenty-of-health-data-how-much-of-it-is-actually-useful-20251219-p5noz4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Smartwatches track plenty of health data. How much of it is actually useful?",
    "publish_date": "Sun, 28 Dec 2025 13:16:13 +1100",
    "category": "lifestyle",
    "authors": [
      "Liam Mannix"
    ],
    "text": "Loading David Scott, an associate professor at the Institute for Physical Activity and Nutrition, pays close attention to both his heart rate during training and at rest (his Garmin smartwatch tracks it between 45 and 50). A meta-review of 87 studies of resting heart rate, published in 2017, found every 10-beat-per-minute increase in resting heart rate increased the risk of heart disease, stroke, heart failure and cancer by around 10 per cent, and increased all-cause mortality risk by 17 per cent. A fitter heart is a more efficient heart, able to do the work of circulating the blood in less beats. Most types of exercise – including yoga – have been shown to push down resting heart rate by about five beats per minute. But there’s a lot of individual variation within the “average” resting heart rate. Younger, female hearts beat a little slower than older, male hearts, for example.\n\nAnd don’t try to compare your resting heart rate with your friends, Scott says. “We’re all getting older. Maintaining the same resting HR, rather than improving it, is still an improvement.” If you put your finger to your pulse, it feels steady and rhythmic. But under close examination, the rhythm reveals minute variation – literally between every heartbeat. The Apple Watch emits a green light when measuring the wearer's heart rate. Credit: SMH / Supplied Why? Because of the way the heart is wired up. The heart beats in response to electrical signals from the nervous system. The two halves of our nervous system – the sympathetic and parasympathetic – are designed to be in constant tension with each other. The parasympathetic nervous system is our brake, always pulling us towards calmness and tugging our heart rate down (when the parasympathetic nerve is cut during a heart transplant, heart rhythm rapidly accelerates). The sympathetic nervous system is our accelerator, looking for stress, primed to trigger our fight or flight response.\n\nLoading “There’s always a tension between the two. If heart rate variability is high, that’s a really robust nervous system,” says Dr Kegan Moneghetti, head of cardiovascular clinical services at the Baker Heart and Diabetes Institute. “Having a higher heart rate variability is good for the heart, and good for the body.” Higher heart rate variability is a sign both sides of the nervous system are in robust health. As we become more stressed, our sympathetic nervous system grows more active, and our heart rate variability falls: researchers consistently see lower HRV in people who are sick. It’s a sensitive metric, pushed up by exercise and down by alcohol, weight gain, or job stress. And it is an excellent measure of how well your body is adapting to training, says Professor Andrew McKune, senior adviser on recovery to the Australian Institute of Sport. Generally, the average weekend athlete will see their HRV increase after training, as their bodies adapt to stress. But if they approach exhaustion-levels of exercise, their HRV will fall, only rebounding after a big rest-break. “For myself – as much as I can be a bit of a sceptic for these – it does seem to be a pretty good indicator of when I’m going to get sick. I can see it trending down for three or four days, and I’ll say ‘uh oh’ to my wife,” says David Scott.\n\nBut he and other experts caution against reading too much into the exact HRV your smartwatch spits out. McKune typically spends a month monitoring an athlete’s HRV to work out the baseline. Your individual trend – up or down – is what matters. “It’s one component you might look at with interest. But we don’t say your HRV is 20, you need to do this and this,” says Moneghetti. Sekulovski in a hyperbaric oxygen chamber at P3 Recovery. Credit: Justin McManus Sleep, recovery, and readiness scores First-generation smartwatches merely tracked our health metrics. The modern versions try to turn these data points into scores: sleep scores, recovery scores, even readiness scores.\n\nLoading Let’s start with sleep. Scientists use brain electrical activity to monitor our sleep and break it up into phases: light, deep, and rapid-eye-movement (REM) sleep. Smartwatches don’t yet have the ability to eavesdrop on our brains, so they try to replicate that data by measuring how much our bodies move as we sleep, combined with heart rate and heart rate variability data. “It’s all algorithm based,” says Dr Donald Lee, a sleep physician at the Woolcock Institute of Medical Research. “It’s indicative and not authoritative – take it that way.” Not getting enough sleep long-term increases all-cause mortality and the risk of several chronic diseases. There’s a lot of individual variation in how much sleep is enough, but consensus medical guidelines encourage you to aim for seven to nine hours a night. What about sleep quality? That also matters: guidelines suggest the best sleep involves falling asleep 15 minutes after your head hits the pillow, waking one or less times a night, and not having extremely high levels of REM or extremely low levels of deep sleep.\n\nBeyond that, is there an optimal amount of REM or deep sleep we should target? “I hear it all the time: I’m not getting enough REM, or enough slow-wave,” says Lee. “There is no great robust evidence that says increasing or decreasing certain stages is beneficial.” Loading Even with those limitations in mind, Lee sees a role for smartwatch sleep scores, but suggests you focus on the trend, not on how you did in any individual night. “Be fascinated by the data that comes back from the devices,” he says. If there are problems, talk to a sleep doctor. That’s sleep. What about recovery? A small meta-analysis of seven studies on HRV, published in October, concluded heart rate variability did change meaningfully as people went through periods of stress and recovery. A 2023 meta-analysis of 17 studies found various recovery techniques – including massage, cold water immersion, stretching and massage – meaningfully increased HRV.\n\nBut just because HRV is a useful metric, it does not mean “recovery” or “readiness” scores are. HRV is a component of these scores, but they are generally proprietary, and the companies do not share how they are calculated. “We can’t get into them to understand how they are developed,” says David Scott. “The reality is, there’s not a lot of evidence behind them as to do they really predict if we’re prepared for peak performance.” Which leads us to perhaps the most fascinating data-point in recovery: a systematic review by Deakin University researchers looking at what metric best captured how fatigued an athlete was and how well they were recovering. Sekulovski in a pair of compression pants at P3 Recovery Centre. Credit: Justin McManus The researchers looked at heart rate, blood markers, oxygen consumption, HRV and a bunch of other measures. But one surprise metric beat them all: how stressed or recovered the athletes felt. “Your best indicator is how you are feeling physically and mentally,” says Scott. “Don’t become too dependant or get lost in these metrics.”\n\nLoading Recovery: what really matters The AIS’s McKune advocates thinking about your recovery strategies like a pyramid. At the bottom are the foundations that everyone needs to get right. “It’s not going to be anything special,” says McKune. Make sure you’re sleeping seven to nine hours a night. Refuel with carbohydrates and rebuild with protein. Replace lost fluids. As you go higher up towards the point, “they become more specific to the preferences of the individual athletes”, says McKune. The sort of stuff Stefanos Sifandos has at P3.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/sailing/sydney-to-hobart-yacht-race-2025-live-mild-conditions-set-for-the-race-as-master-lock-comanche-the-favourite-20251225-p5nq1c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Sydney to Hobart Yacht Race 2025 LIVE: 33 yachts retire as SHK Scallywag 100 dethroned by Comanche",
    "publish_date": "Sun, 28 Dec 2025 13:14:44 +1100",
    "category": "sports",
    "authors": [
      "Frances Howe",
      "Billie Eder"
    ],
    "text": "Smuggler is sitting in third place in the overall standings now and owner and skipper Sebastian Bohm believes that’s only a temporary spot for the yacht as it seeks to beat Callisto, currently sitting in second.\n\n“We’re pushing hard to try and beat Callisto, obviously they’re our main competition. We want to win our division and we think if we do win that we might be in with a good chance overall but we’ll see.”\n\nBohm said the weather had worsened earlier than expected yesterday, but crew moral is at an all-time high on the other side of it.\n\n“It was a bit lighter than we thought, that first night. But we knew that the big blow was happening down on the South Coast yesterday and that seemed to kick in even earlier than we thought and it was quite full on really,” he said.\n\n“Thankfully the boat got through it, the crew got through it. No injuries, no damage and now we always knew today would be quite pleasant...\n\n“Now everyone’s brushed their teeth and taken their clothes off a bit more, some of the layers. Now we’re getting stuck in to some of the snacks and everything’s going well.”",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/politics/federal/the-31-billion-a-year-threat-to-the-australian-dream-climate-change-20251226-p5nq49.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The $31 billion a year threat to the Australian dream: Climate change",
    "publish_date": "Sun, 28 Dec 2025 12:44:36 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright"
    ],
    "text": "Councils and state and federal governments are being warned to start spending billions of dollars as soon as possible to protect the nation’s housing stock from the impact of climate change or face a $31 billion a year damage bill.\n\nAs new research suggests Australia is about to enter a water desalination plant building boom to offset the impact of growing demand and climate change, the Productivity Commission says potentially avoidable damage to homes could cost the economy more than $700 billion by the end of the century.\n\nAustralian houses will face greater threats from climate change that will require changes to planning and construction, the Productivity Commission has warned. Credit: Louie Douvis\n\nThe commission has used a series of reports to look at policies that would increase speed at which the economy could grow without adding to inflation pressures.\n\nIn its report on moving to a net zero economy, the commission also conducted modelling into the impact of climate change on the nation’s housing stock.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/business/companies/dollar-bill-the-algorithm-ate-my-broker-but-should-it-20251228-p5nqdc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dollar Bill: The algorithm ate my broker – but should it?",
    "publish_date": "Sun, 28 Dec 2025 12:23:46 +1100",
    "category": "finance",
    "authors": [
      "Bill Mcconnell"
    ],
    "text": "In 2019 Australia had almost 28,000 licensed financial advisers. By mid-2025, fewer than 15,500 remained. To be fair, the AMP scandal of charging dead people advice fees and tighter regulation took a chunk out of the industry. But even allowing for that, the numbers represent a 40 per cent collapse in a little over five years. With the possible exception of taxi drivers, it’s hard to think of another profession that’s been technologically euthanised in such a short space of time.\n\nTreasury’s 2023 report; “Quality of Advice Review” called it a “crisis of accessibility.” Advice hasn’t just become scarcer; it now appears increasingly like a luxury good.\n\nThe human pause - that fragile gap between thought and trade - is being automated out of existence. Retail traders, armed with dashboards and dopamine, can push a junior explorer 40 per cent higher by the time the morning tea trolley swings by at the Club. Often there are no new assays, just new hashtags.\n\nCommSec now boasts over three million users, nearly half under 40, with the vast majority trading without a single conversation. Add Stake, Superhero and a dozen others – most of which Dollar Bill learnt about from his 19 year old son - and Australia now has more than four million app-based accounts driving about three-quarters of retail flow. What used to be a phone call has become a thumb swipe, not all that dissimilar to that Tinder thingy.\n\nToday’s brokers increasingly survive on the oxygen of corporate-finance, raisings, IPOs and placements. Global ETF assets have swollen past US$13 trillion, while Australian ETFs manage nearly A$300 billion. It’s automation over advice, index over instinct.\n\nBut despite all that, some of Dollar Bill’s best trades still come from a hybrid model - a human whisper from a Club member executed cleanly via app. And yes, on occasion, Dollar Bill does still follow the advice of a broker – just not George’s.\n\nASIC’s August 2025 consultation paper on trading systems (Paper 386), proposed kill-switches for runaway algos and the US SEC has floated similar circuit-breaker rules. When the plumbers start worrying about the pipes, you know the water’s running too fast.\n\nThis isn’t to say it’s all bad. Information has never been freer, access never easier, and the new generation of investor is sharper and faster than Dollar Bill’s old-school lot ever was. But the tide has turned and advice givers are now an endangered species.\n\nWhen Dollar Bill ran this thesis past a few learned colleagues at the Club, it rattled more than one cage. While some laughed, a few in particular - brokers and good ones - wanted to know whether Dollar Bill really believed the human adviser was finished. The truth, as we discussed deep into the night, is more complicated.\n\nYes, algorithms dominate the tape. Yes, 80–85 per cent of equity volume globally is now machine-generated. And yes, adviser numbers have collapsed with more than half the country trading through an app while waiting for a flat white.\n\nBut markets aren’t just math. They reflect behaviour, panic, ego, denial, fatigue, optimism and fear and none of those have been automated out of existence. In fact, if anything, they’ve been amplified.\n\nWhen volatility spikes, people don’t open an algorithm; they open a whisky. They call someone who knows the difference between a trade and a tantrum.\n\nAnd this isn’t nostalgia. Three of the largest money managers on the planet - Vanguard, Fidelity and Russell Investments - have all published variations of the same finding: advised clients outperform self-directed ones by 2–3 percentage points a year largely because a human adviser stops them making emotionally catastrophic decisions.\n\nPanic selling, overtrading and momentum chasing require restraint no algorithm can provide. The broker’s greatest value is often preventing a trade, not executing one.\n\nTry getting CommSec to talk you out of a terrible idea. All you get is a pop-up box and a “How was your experience?” survey. Try navigating a placement without a human. Try reading management’s body language on a site visit from an algorithm. Try calling an app after-hours to ask whether a CEO looked nervous or whether the third row of the drill core tray seemed suspiciously light. There are things the machines can do - speed, precision, pattern-recognition - but intuition still lives in the human spine.\n\nThen there’s the long lunch factor; the part the academics never model. Markets are built on relationships; the whisper networks, dinner conversations, misread signals and gossip you hear at the bar. Cities have been bankrupted on rumours and fortunes have been made on a shared hunch over a fillet mignon with a good pinot.\n\nSo maybe the algorithm hasn’t eaten my broker after all but merely swallowed the routine. What remains - judgement, context, restraint and the ability to read the room - still resides with people. And while poor old George was always destined to be replaced, some of his colleagues, admittedly fewer by the year, still offer something machines don’t.\n\nOnly people can provide guidance and a filter to the endless chatter. Only people can stand between investors and their worst impulses. And in a market increasingly driven by algorithms and speed, it’s this service that may be the rarest and most valuable of all.\n\nIs your ASX-listed company doing something interesting? Contact: mattbirney@bullsnbears.com.au",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/i-was-in-a-state-of-shock-mcc-stands-by-curator-after-two-day-test-debacle-20251228-p5nqcc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I was in a state of shock’: MCC stands by curator after two-day Test debacle",
    "publish_date": "Sun, 28 Dec 2025 10:49:30 +1100",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "The Melbourne Cricket Club is standing by embattled curator Matt Page after this year’s Boxing Day Test finished inside two days, leaving Cricket Australia with a $10 million revenue shortfall.\n\nMCC chief executive Stuart Fox and Page faced the music on Sunday morning to explain why the expected day three crowd of 90,000 would have no cricket to watch due to a pitch that was heavily in favour of the bowlers.\n\nMelbourne Cricket Club curator Matt Page. Credit: Wayne Taylor\n\nThe MCG’s reputation as the best Test pitch in the country has taken a battering after staging just the 27th two-day Test in the format’s 148-year history. A total of 36 wickets fell in 142 overs, and the game finished in the final session of the second day.\n\nFox held discussions with CA chief Todd Greenberg and chair Mike Baird during the game and will chat further after the truncated game cost $10 million in revenue as well as the exposure that comes with the spotlight on the sport’s marquee game of the year.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw18-west-ham-vs-fulham-20251228-p5nqck.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW18: West Ham vs Fulham",
    "publish_date": "Sun, 28 Dec 2025 10:05:04 +1100",
    "category": "finance",
    "authors": [],
    "text": "Rapid Recap | MW18: West Ham vs Fulham\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/curator-in-state-of-shock-after-boxing-day-test-20251228-p5nqcj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Curator in 'state of shock' after Boxing Day Test",
    "publish_date": "Sun, 28 Dec 2025 10:02:59 +1100",
    "category": "finance",
    "authors": [],
    "text": "Curator in 'state of shock' after Boxing Day Test\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw18-nottm-forest-vs-man-city-20251228-p5nqch.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW18: Nott'm Forest vs Man City",
    "publish_date": "Sun, 28 Dec 2025 10:00:51 +1100",
    "category": "finance",
    "authors": [],
    "text": "Rapid Recap | MW18: Nott'm Forest vs Man City\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw18-liverpool-vs-wolves-20251228-p5nqcf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW18: Liverpool vs Wolves",
    "publish_date": "Sun, 28 Dec 2025 09:55:13 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW18: Liverpool vs Wolves\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw18-chelsea-vs-aston-villa-20251228-p5nqcd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW18: Chelsea vs Aston Villa",
    "publish_date": "Sun, 28 Dec 2025 09:49:41 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW18: Chelsea vs Aston Villa\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw18-burnley-vs-everton-20251228-p5nqc8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW18: Burnley vs Everton",
    "publish_date": "Sun, 28 Dec 2025 09:44:32 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW18: Burnley vs Everton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw18-brentford-vs-bournemouth-20251228-p5nqc5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW18: Brentford vs Bournemouth",
    "publish_date": "Sun, 28 Dec 2025 09:39:10 +1100",
    "category": "finance",
    "authors": [],
    "text": "Rapid Recap | MW18: Brentford vs Bournemouth\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/culture/movies/filmmaker-tyler-perry-accused-of-sexual-assault-a-second-time-20251228-p5nqc1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Filmmaker Tyler Perry accused of sexual assault again",
    "publish_date": "Sun, 28 Dec 2025 09:32:38 +1100",
    "category": "entertainment",
    "authors": [
      "Francesca Regalado",
      "Mark Walker"
    ],
    "text": "A second actor has sued filmmaker and media mogul Tyler Perry, accusing him of sexual assault and seeking $US77 million ($115 million) in damages, according to a complaint filed Thursday in the Los Angeles Superior Court.\n\nIn the lawsuit, which also names the production company Lionsgate as a defendant, the actor, Mario Rodriguez, said he was subjected to multiple instances of sexual assault at Perry’s Los Angeles home.\n\nTyler Perry in June, the month he was first accused of sexual assault. Credit: Jordan Strauss/Invision/AP\n\nRodriguez had a small role in the 2016 comedy Boo! A Madea Halloween, a movie that Perry directed and starred in. Rodriguez told Perry that he had never acted before auditioning to get that part, according to the lawsuit.\n\nAccording to the complaint, Rodriguez was approached by a trainer at a Los Angeles Equinox gym in 2015 about meeting with Perry about a possible acting role as a “very good-looking college student” in a new movie that later became Boo! A Madea Halloween.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/the-great-pace-race-inside-brett-lee-s-20-year-quest-to-bowl-160km-h-20251227-p5nq8u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The great pace race: Inside Brett Lee’s 20-year quest to bowl 160km/h",
    "publish_date": "Sun, 28 Dec 2025 09:15:00 +1100",
    "category": "sports",
    "authors": [
      "Dan Walsh"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Brett Lee’s first ball to a Test cricketer swung wide – at a fair clip, of course – and would’ve finished at gully if not for the SCG netting. Some six years before the most storied of Boxing Day Test debuts, when he razed India with 5-47 and a wicket in his first over in 1999, Lee first rose to prominence in Australian cricket circles – once he landed a ball on the pitch. Brett Lee celebrates his debut Test wicket - Indian opener Sadagoppan Ramesh - at the MCG. Credit: Will Burgess Lee is the latest inductee to the Australian Cricket Hall of Fame, some 32 years after accepting an invitation to bowl at modern-day greats Allan Border, Steve Waugh and David Boon as they prepared for the travelling World Series carnival of 50-over cricket. At 16, short and still whippet thin, Lee may have borne a passing resemblance to the champion greyhound that would one day be named after him. He still “had to run around under the shower to get wet”, after all. His mother, Helen, dropped him out the front of the SCG after driving up Mt Ousley in the Mitsubishi Sigma that ferried brothers Shane, Brett and Grant from Mount Warrigal on the NSW South Coast to any number of suburban grounds. He raised eyebrows marking out his run-up, given he marched 15 metres past the mark set by Craig McDermott, then Australia’s foremost fast bowler. His first ball drew guffaws as it cannoned straight into the off-side net, but little more than a grunt from Boon facing up at the other end.\n\nAdvertisement\n\n“Second ball, brand new white ball, it swings to leg, straight into the other side of the net, on the full as well,” Lee laughs. “Blokes are starting to laugh. Boony didn’t say much – just picked the ball up and tossed it back. “I’m at the top of my mark again, full of nerves, I’m all over the shop. And I just think ‘Stuff this. Run in, bowl quick. Back yourself.’ “Third ball, it’s a perfect yorker, rips Boony’s pegs out. I’ve got this big smirk on my face and poor old Boony’s been stitched up with the worst practice you could imagine.” Lee joins a cohort of Australian greats in the Hall of Fame courtesy of more than 700 international wickets, Test and World Cup triumphs and a career spanning more than a decade. His status as one of the game’s unfailingly, infallibly nice guys is a genuine badge of honour. “I loved winning, I loved taking wickets and the teams I played in,” Lee says.\n\nAdvertisement\n\n“But my biggest personal achievement in cricket was bowling fast. Going past the 160km/h barrier – that’s what I’m proudest of.” Brett Lee jumping for joy: a familiar sight throughout the 2000s. Credit: AP ‘An injection of straight adrenaline’: what it takes to bowl truly fast Lee is one of five bowlers to have cracked the fabled 160km/h mark (in front of a speed gun, at least). He swears he told his parents he’d do so, wearing the baggy green, at age nine. Lee will turn 50 next year, and his body has been put through a wringer of 20-odd years of bowling at express pace. Despite two broken backs, six ankle operations, busted shoulders and elbows, his frame has survived remarkably well for all the work Lee put into his craft.\n\nAdvertisement\n\nBrett and Shane Lee as youngsters at their childhood home at Mt Warrigal on the NSW South Coast. “I saw all the videos of Jeff Thomson bowling absolute rockets in the ’70s and ’80s, and I knew straight away that bowling fast was what I wanted to do,” Lee says. “I knew it was going to be the hardest job in the world and I knew there were going to be sacrifices… I played my last Big Bash game when I was 39, and I was working on my bowling action right up until that last game. In my eyes, I never got it absolutely perfect, but I’m a bit of a perfectionist.” Fast-twitch fibres from mum Helen’s sprinting background, his dad Bob’s doggedness and determination, and a childhood sparring in the family’s NSW South Coast backyard make for a fair fast-bowling base. Speed demon: Lee training with NSW in 1999. Credit: Iain Gillespie A ball randomly chased down a hill in Kiama as a teenager had “my legs in overdrive, moving faster than I’d ever moved. And I thought, there’s something here. How do I move as fast as possible, and transfer that into bowling faster?” Soft-sand running. Lean muscle and body weight exercises over mass. Grass sprints and all manner of exercises and training programs cooked up by former Australian strength and conditioning coach Jock Campbell, who most memorably incorporated a parachute into Lee’s resistance training at the 2003 World Cup.\n\nAdvertisement\n\nIt all amounted to more than a decade of Lee sprinting 20-odd metres up to 120 times in a day. Launching his body into the air, snapping roughly 16 times his body weight through his front foot and slinging the ball at blistering pace. Brett Lee puts Jock Campbell’s parachute to work in South Africa. Credit: Getty Images “You think about F1 and how they tune their cars – it’s so many minute things that have to be in sync,” Lee says. “It’s all the training and preparation. It’s the wind, it’s your footmarks, snapping down your front arm and your wrist – it’s all timing and coordination. “But when it all works, and the ball flies through to Gilly [long-time Test wicketkeeper Adam Gilchrist], there’s nothing quite like it. It’s the best feeling in the world. It’s like an injection of straight adrenaline when you can bowl truly fast.” Lee left no stone unturned ensuring his body was fit for fast bowling. Credit: Getty Images ‘Binga, I’m going to kill you’: The great pace race\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://au.news.yahoo.com/action-counter-deadly-trend-233433701.html",
    "title": "Action to counter deadly trend",
    "publish_date": "2025-12-27T23:34:33Z",
    "category": "finance",
    "authors": [],
    "text": "Beefed up Black Spot Program funding will go toward safening nearly 300 of Australia’s most dangerous routes, Labor announced on Sunday as road deaths continue to rise.\n\nMore than 1200 people died on Australian roads in the 12 months to November, according to official figures.\n\nIt was an improvement on the 1353 deaths reported in the period between August 2024 and August 2025, but the overall trend remained the same – the annual death toll has been climbing rapidly for the past five years, leading motor safety advocates to declare the National Road Safety Strategy a failure.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe Albanese government this year boosted annual funding for the Black Spot Program from $110m to $150m.\n\nThe program, which targets sections of roads with high crash rates, reduces deaths and injuries by up 30 per cent after upgrades.\n\nWhile anomalies such as higher pedestrian deaths in part fuelled the rise in 2025, the bulk of fatal incidents happened on regional and remote roads in line with previous years.\n\nRoad deaths in Australia have been climbing for the past five years. Picture: NewsWire / Scott Radford-Chisholm\n\n“In 2024-25 alone, 102 projects in rural, regional and remote Australia shared in $64 million of funding under this program,” Regional Development Minister Kristy McBain said.\n\n“The Black Spot Program delivers improvements that have demonstrated effectiveness in reducing the risk of serious crashes and fatalities on our roads.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“With our increased funding commitment to this long-running program, I again encourage individuals, organisations, and local governments to nominate sites in their local communities for consideration in the next funding round.”\n\nThe government has already announced 180 projects across Western Australia, Victoria, Tasmania and Queensland.\n\nIt added a further 84 in NSW and 20 in South Australia.\n\nSince Labor came to power in 2022, north of 720 black spots have been approved for works.\n\nOf those approved, 453 have been completed.",
    "source": "Yahoo",
    "cluster_id": 36
  }
]