[
    {
        "url": "https://www.9news.com.au/finance/unemployment-rate-june-2025-abs-data-interest-rates/26716d34-ab4d-4bfb-accf-d21bb375235b",
        "title": "Surprise data adds to case for interest rate cut next month",
        "publish_date": "Thu, 17 Jul 2025 02:08:53 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Bullock indicated last week that the call to keep rates on hold – ﻿which was a\n\nsplit, 6-3 decision\n\n– wasn't a case of the RBA saying there won't be further cuts, but that the board wanted fresh data before pulling the trigger on more relief.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/babies-born-through-mitochondrial-donation-landmark-breakthrough-genetic-disease-uk/d4a2d43b-66f9-488a-aaa1-a2ff432830a8",
        "title": "Radical three-way IVF could end horrific disease passed on to babies",
        "publish_date": "Thu, 17 Jul 2025 01:12:31 +0000",
        "category": "lifestyle",
        "authors": [
            "Jul"
        ],
        "text": "A breakthrough three-way IVF treatment in the UK resulted in the birth of ﻿eight babies that showed no signs of mitochondrial DNA disease that their mothers were at high risk of passing on.\n\nMitochondrial DNA mutations can cause devastating disease in one in 5000 babies born around the world.\n\nThe mutations are passed on from mother to child - while male children can be affected, adult males do not pass it on.\n\nA new study could signal a way to avoid incurable mitochondrial disease. (Getty Images/iStockphoto)\n\nHarmful mutations in mitochondrial DNA can result in reduced availability of energy, particularly affecting tissues that have high energy demands – for example, the heart, muscle and brain﻿.\n\nThere is no cure.﻿\n\nBut the University of Newcastle today announced the results of a new procedure, which involves transferring a key \"nuclear\" genome from the ﻿fertilised egg carrying a mitochondrial DNA mutation, to a donated egg without a mutation, and that has had its nuclear genome removed.\n\nREAD MORE: Two teenagers charged with murder over deadly stabbing\n\nPronuclear transfer could mitigate the risks of mitochondrial disease. (Australian Science Media Centre)\n\nThe nuclear genome contains all the genes essential for a person's individual characteristics, such as, hair colour and height, so the child carried from this procedure thus inherits those characteristics from its birth parents, but without the mitochondrial DNA mutation, due to the use of the donor egg.\n\nThe trial saw eight babies, including a pair of identical twins, born to seven women.\n\nAll the babies showed either no signs of mitochondrial DNA mutation or very low levels that were﻿ unlikely to result in disease.\n\n\"After years of uncertainty this treatment gave us hope – and then it gave us our baby,\" one of the mothers said.\n\n\"We look at them now, full of life and possibility, and we're overwhelmed with gratitude. Science gave us a chance.\"\n\nAustralia hopes to follow suit\n\nAbout 60 babies born in Australia every year will develop mitochondrial disease, including disabling and potentially fatal conditions.\n\nAnd about 120,000 Australians carry disease-causing DNA variants that put them at risk of passing it on.﻿\n\nThe passage of Maeve's Law in March 2022 allowed the introduction of mitochondrial donation in Australia, ﻿and the Medical Research Future Fund in 2023 provided $15 million towards a pilot program.\n\nThe mitoHOPE Program's clinical trial will be the first of its kind in Australia to determine the safety and efficacy of mitochondrial donation.\n\nAccording to Professor John Carroll, director of Monash's Biomedicine Discovery Institute and head of mitoHOPE, the UK studies should give Australia momentum to follow suit.\n\n\"We hope to soon obtain our first licence from the NHMRC's Embryo Research Licensing Committee, so that we can begin training our IVF embryologists in the procedure using donated eggs,\" Carroll said.\n\n\"The birth of eight babies with a greatly reduced risk of developing mitochondrial DNA disease provides hope for those waiting to access mitochondrial donation and shines new light on the path toward introducing mitochondrial donation in Australia.\n\n\"The findings published give grounds for optimism. I look forward to continuing this work at Monash University and I hope that the new treatment can soon become available to Australian families affected by these devastating diseases.\"\n\nFederal Health Minister Mark Butler said the government was proud to support the research.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/dogs-in-cars-australia-laws-road-rules-for-pet-owners-explained/eb2c1824-2937-4265-b415-64b1eb56935e",
        "title": "Where your dog sits in the car could cost you thousands in fines",
        "publish_date": "Thu, 17 Jul 2025 00:07:59 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Most Australian dog owners have driven with their pet in the car, not knowing that they could face hundreds of dollars in fines depending on where the dog sits.\n\nLaws around the country require dogs to be safely restrained by a harness or enclosure when travelling in the back of a ute or trailer.\n\nThere are also state and territory laws that dictate exactly where inside a vehicle your dog is allowed to sit.\n\nDogs must be safely secured when riding in the back of a ute or trailer. (Getty Images/iStockphoto)\n\nIn some states, like NSW, it's perfectly legal to put your pooch in the passenger seat provided they won't distract the driver but in Western Australia, it's against the law.\n\n﻿And driving with a dog in your lap could cop you a fine of $228 or $562, depending on where you're caught.\n\nHere are all the ﻿Australian laws and road rules about driving with dogs, by state and territory.\n\nNew South Wales\n\nIt's illegal to drive with a dog on your lap in NSW and those caught breaking the rules face a $562 fine and three demerit points.\n\nThere's no law prohibiting a dog from sitting in the passenger seat, however drivers can still cop penalties if this prevents them from maintaining proper control of their vehicle.\n\n﻿A fine of $562 and three demerit points applies.\n\nDogs transported on the back of a vehicle like a ute must be ﻿restrained for their safety under NSW animal welfare legislation.\n\n﻿There's no legal requirement for dogs to be restrained inside a car while driving, however Transport for NSW does recommend drivers use appropriate restraints or harnesses to keep the dog and everyone else safe.\n\nQueensland\n\n\"A driver must not transport a dog in a vehicle if any part of their body, other than their head, can protrude outside the vehicle,\" a Queensland Transport and Main Roads spokesperson told 9news.com.au.\n\nIt is illegal to drive with a dog in your lap in the Sunshine State.\n\nThose who break the rules could cop a $389 fine.\n\nAnimal protection legislation covers other laws relating to transporting dogs, like requiring any dog transported in the tray of a ute or trailer to be safely secured.\n\nThe maximum court-imposed penalty is up to $10,014.\n\nIf you're caught driving with your dog in your lap in Queensland, you could face a $389 fine. (Getty)\n\nAustralian Capital Territory\n\nIn the ACT, it is illegal to have an unrestrained dog in a ﻿moving vehicle.\n\nDogs must be restrained by a harness or leash, or placed in an enclosure that prevents it from moving around or off the vehicle, or being injured.﻿\n\nFailure to comply attracts a fine of up to $3200.\n\nIt is also illegal to ﻿confine a dog in or on a vehicle if it is likely to cause the dog injury, pain, stress or death.\n\nVictoria\n\nUnder the Prevention of Cruelty to Animals (POCTA) Act and Regulations, it is illegal to transport a dog on the back of ute or trailer unless it is appropriately tethered or caged.\n\nIt is also illegal to ﻿put a dog in the metal tray of a ute or trailer when the temperature is at or above 28 degrees Celsius unless the dog has access to an area of insulating material to protect it from the hotel metal surface.\n\nThe maximum penalty is more than $3050.﻿\n\nDogs can legally be transported in the cabin of a car or in the back of a ﻿wagon or SUV type vehicle, but cannot be put in the boot of a sedan.\n\nThe fine for breaking that rule can exceed $3000.﻿\n\nHaving this sign on your car could land you a $2200 fine View Gallery\n\nSouth Australia\n\n\"To keep everyone safe whilst driving, pets travelling in a vehicle must be securely and comfortably restrained inside the vehicle or secured on the back of an open ute tray,\" SA Police Officer in Charge of Traffic Services Branch, Superintendent Shane Johnson told 9news.com.au.\n\nDriving with an animal in your lap or riding a motorbike with a dog between you and the handlebars in South Australia incurs a fine ﻿of $228.\n\nDogs travelling on an open ute tray must be tethered to the vehicle so they cannot fall or escape.\n\nFailure to do so incurs a maximum penalty of $1250.\n\nLeading an animal while driving incurs a fine of $129.\n\nWestern Australia\n\nUnder the Animal Welfare Act 2002, administered by RSPCA WA, dogs must be transported in a way that prevents unnecessary harm.\n\nGenerally, this means they should be restrained.﻿\n\nDrivers may face fines of up to ﻿$5000 and jail time if their dog is injured while unrestrained in a vehicle.\n\nIt is also against the law for drivers to have a dog in their lap, the passenger seat, or another location or position that may lead to the driver being distracted.﻿\n\nMotorcyclists cannot ride with a ﻿dog between them and the handlebars, or in a position where they can interfere with the rider's ability to control the bike.\n\nDogs being transported on the open back of a vehicle like a ute must also be restrained under WA law.\n\nDogs generally need to be restrained to prevent unnecessary harm when driving in WA. (Getty)\n\nNorthern Territory\n\nThough there is no specific law ﻿mandating pet restraints while driving in the NT, you must not drive with a dog on your lap or in a way that compromises your control of the vehicle.\n\nDoing so may constitute careless driving, which can incur ﻿a $150 fine plus a $58 victims levy.\n\nIt is illegal ﻿to transport an unsecured dog on the back of a ute under the Animal Protection Act 2018.\n\nThe maximum penalty ﻿is 50 penalty units ($9450).\n\nTasmania ﻿\n\nIn Tasmania, it is illegal to drive a vehicle with an animal in the driver's lap per the Road Rules 2019.\n\nFines of up to 10 penalty units ($2050) apply.\n\nThe Dog Control Act 2000 also requires that dogs must be sufficiently restrained while in or on a vehicle, with fines of up to five penalty units ($1025) for failure to comply.\n\nUnder Tasmania's Animal Welfare Act 1993, it is also illegal to drive with a dog in any way \"that subjects or may subject it to unreasonable and unjustifiable pain or suffering\".",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/first-guardian-master-trust-superannuation-lost-asic-investigation-exclusive/7a944ee1-faa0-40c0-8972-011f056c9fee",
        "title": "Christian, JC and Johanna are missing a combined $319k in super",
        "publish_date": "Wed, 16 Jul 2025 22:14:38 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Christian Eriksen was hoping to retire next year.\n\nBut the 59-year-old from NSW is terrified that $140,000 of his superannuation has disappeared without a trace.\n\nMelbourne man JC Sanchez, 41, also faces losing $124,000 from his retirement fund.\n\nAnd single mum Johanna Henderson, 31, said $55,000 of her nest egg is now circling the drain.\n\nChristian Eriksen said he is missing $140,000 in super. (Supplied)\n\nAll three are financial victims of collapsed superannuation fund First Guardian Master Trust, which went into liquidation this year – taking around $446 million from 6000 people with it.\n\nAmong them are business owners, parents and mum and dad investors who are now worried sick about their future.\n\nApproaching 60, Eriksen hoped retirement was in his future.\n\nBut the small business owner said he will have to keep working for years to come to recoup the losses.\n\n\"I intended to retire at the end of the year,\" he told 9news.com.au.\n\n\"I'm just going to have to keep working. It throws all my plans completely out the window.\"\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nHis $140,000 had been frozen since 2024, but recently his balance had returned to zero.\n\nEriksen has started a Facebook group to help others who lost super from First Guardian.\n\nA group of 122 people have come together to ask for help and support.\n\nCorporate regulator ASIC began investigating First Guardian's responsible entity Falcon Capital, First Guardian and director David Anderson in late 2024.\n\nAccording to ASIC, most of the 6000 people accessed First Guardian through superannuation platforms Diversa, Netwealth and Equity Trustees.\n\nIt alleges investors were lured into transferring their super by \"lead generators\" who referred them to personal financial advice providers.\n\nASIC says they were \"advised to roll their superannuation assets into a retail choice superannuation fund, and then invest into First Guardian\".\n\nEriksen is concerned he will never see his money again.\n\nHe said he \"inadvertently\" had money in First Guardian via Netwealth.\n\nJC Sanchez looks set to lose $124,000 in super - 90 per cent of his retirement nest egg. (Supplied)\n\nSanchez, who runs his family business, said he feels the \"Australian dream\" has been ripped away from thousands of people.\n\nHe said Venture Egg convinced him to roll his super from ANZ into First Guardian.\n\nASIC froze the assets of Venture Egg's owner Ferra Merhi in February and cancelled his financial services licence in June.\n\n\"I'm not really near retirement age, so I'm trying to be positive,\" Sanchez said.\n\n\"My grandfather always said, he was a World War II immigrant from Italy, and he said, 'Australia is a lucky country, just work and you'll be looked after, you'll be able to succeed here.'\n\n\"And I just thought super was sacred. I never thought it could be stolen like this.\"\n\nSanchez said the idea that 6000 people simply made a bad investment or are victims of a scam is wrong.\n\n\"You should be protected no matter what. But we feel like idiots,\" he said.\n\n\"Some nights I don't sleep right because I'm up lying in bed thinking about it.\n\n\"There's a lot of hurt people out there.\"\n\nHenderson is a single mum and lost her super after consolidating through Venture Egg following a separation.\n\n\"I've just started studying full-time with the hope of working part-time whilst studying. But now I have to work full time whilst studying to earn more super as I'm stressed I won't have enough,\" Henderson said.\n\n\"It also makes me feel pressure to find a partner to support my retirement.\"\n\nJohanna Henderson is worried she has lost $55,000. (Supplied)\n\nHenderson is also confused as to how it happened.\n\n\"Our super should be protected,\" she said.\n\nAnother 6000 Australians are facing the same uncertainty following the Shield Master Fund collapse.\n\nBoth funds had exposure to failed property developer Paul Chiodo, who ASIC alleges has questionable transactions, including luxury properties, linked to Shield Master.\n\nFormer investors in First Guardian want the government to help.\n\nThey believe they shouldn't be punished for investments they knew nothing about.\n\nThere are also calls for more transparency and regulation in the complex superannuation fund industry.﻿\n\n\"We want to kick up a hornet's nest,\" Sanchez said.﻿\n\nThe Federal Court has made interim travel restraint orders against Falcon Capital Limited directors David Anderson and Simon Selimaj.\n\nThe court also made interim orders freezing the assets of Mr Selimaj until February 27, 2026.\n\nLiquidators from FTI Consulting say the case could take at least a year to resolve.\n\n9news.com.au has contacted FTI Consulting for an update on the liquidation.\n\nA spokeswoman for Assistant Treasurer Daniel Mulino told 9news.com.au the government was concerned for investors.\n\n\"The government is committed to ensuring that investor interests are safeguarded and the regulatory framework governing the investment landscape is fit for purpose,\" the spokeswoman said.\n\n\"ASIC has taken steps to commence enforcement and protect investors, including freezing assets and cancelling financial licences where appropriate.\n\n\"As these matters are before the Federal Court and part of ongoing investigations by ASIC and the liquidators, it would be inappropriate to provide further comments or speculation.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/bereavement-leave-entitlement-rules-australia-mothers-call/db482c4e-2b0f-4fa7-9b40-2f1cf58020bf",
        "title": "When Vicky's daughter died suddenly, she was given just five days off work",
        "publish_date": "Wed, 16 Jul 2025 22:02:22 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "W﻿hen Vicky Sims' daughter Tiffany﻿ suddenly died aged 27, she was devastated.\n\nBut ﻿rather than being able to take her time to grieve and undertake the tasks which need to be done when a loved one passes away, she had to go back to work.\n\nThe 60-year-old's company gave her five days of paid leave - and that's three days more than the just two days which is law.\n\nVicky Sims' daughter Tiffany﻿ suddenly died aged 27. She was given just five days of bereaavement leave. (Supplied)\n\nSims says she then used a week and a half of sick leave until it ran out, followed by the same amount of unpaid sick leave.\n\nBut the Ipswich mother needed the money, so had to return to work at an insurance firm after four weeks.\n\nBut she said it is just not enough.﻿\n\n\"You can't get over it in two days, you can't plan a funeral in two days,\" she said.\n\n\"Two days is an insult.\n\n\"It shouldn't be that you need to use up all your sick leave because you're not sick and you're certainly not having a holiday.\"\n\nSims has launched a petition to change the rules on bereavement leave - also known as compassionate leave - to what she said would be a \"humane\" period of 20 days.\n\nShe said because her daughter took her own life, she wasn't even able to arrange a funeral for ﻿a week and a half.\n\nSims has launched a petition to change the rules on bereavement leave what she say would be a \"humane\" period of at least 20 days. (Supplied)\n\nRules on compassionate and bereavement leave\n\nAccording to the Fair Work Ombudsman , employees can take compassionate leave \"if a member of their immediate family or household dies, or contracts or develops a life-threatening illness or injury, a baby in their immediate family or household is stillborn they have a miscarriage, or their current spouse or de facto partner has a miscarriage\".\n\n\"Employees are entitled to two days compassionate leave each time they meet the criteria,\" it says.\n\nWorkers can also take paid and unpaid leave.﻿\n\nShae McCrystal, professor of labour law at the University of Sydney Law School, said two days is standard.\n\n\"However, a particular employee may have a great entitlement to a longer period of compassionate leave if they have negotiated this in their contract of employment, OR if it has been negotiated and agreed in an enterprise agreement which applies at that workplace,\" McCrystal said.\n\n﻿A spokeswoman for the Fair Work Ombudsman told 9news.com.au: \"Compassionate leave (also known as bereavement leave) and sick and carer's leave (also known as personal/carer's leave) form part of the National Employment Standards (NES) in the Fair Work Act.\n\n\"The NES are minimum employment entitlements that apply to all employees covered by the national workplace relations system .\n\n\"An award, enterprise agreement or other registered agreement, contract of employment or workplace policy can provide additional entitlements to the NES.\"\n\n\"Any worker who has with concerns and/or questions on workplace matters can also contact the Fair Work Ombudsman directly on 13 13 94.\"\n\nWhen Chris Breen and his wife lost their baby when she was just six weeks old, they needed time to grieve. But while Breen, 55, was still able to take his planned three months of parental leave, his wife, who didn't want her name published, was forced back to work. (Nine)\n\nFederal Minister for Employment and Workplace Relations Murray Watt has promised to explore the rules on planned paternity leave when a baby dies.\n\nIn one case, Chris Breen and his wife lost their baby when she was just six weeks old.\n\nBut while he was allowed to take his paid leave, she wasn't.﻿\n\nShe did get government entitlements but Breen said when they contacted the Fair Work Ombudsman, they were told the company did nothing wrong and was allowed to cancel her planned paid paternity leave.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/fire-engulfs-main-stage-of-belgiums-tomorrowland-music-festival-ahead-of-friday-start/2bb911bb-c1e0-4d08-9f94-39b25154331e",
        "title": "Fire engulfs main stage of Belgium's Tomorrowland music festival",
        "publish_date": "Wed, 16 Jul 2025 20:39:28 +0000",
        "category": "entertainment",
        "authors": [
            "Jul"
        ],
        "text": "A huge fire at Belgium's Tomorrowland music festival site has “severely damaged” the main stage two days before the event was due to start, organisers said.\n\nNo one was injured in the incident.\n\nImages shared on local news sites and social media showed flames and plumes of black smoke engulfing the stage and spreading to nearby woodland.\n\nThe annual festival in the town of Boom, north of Brussels, which is scheduled to start on Friday (Saturday AEST), draws tens of thousands of visitors from around Europe. (Nine)\n\nThe annual festival in the town of Boom, north of Brussels, which is scheduled to start on Friday (Saturday AEST), draws tens of thousands of visitors from around Europe.\n\nThe festival's main stage has almost completely burned down, according to Belgium public broadcaster VRT, which added that emergency services were on the scene but the fire was not yet under control.\n\nNo festival-goers were on site at the time of the fire, but about 1000 staff members were present, who have now been evacuated, VRT reported.\n\nOrganisers said in their statement that the site's \"DreamVille\" campsite would open on Thursday as planned and they were \"focused on finding solutions for the festival weekend\".\n\n‘’Due to a serious incident and fire on the Tomorrowland Mainstage, our beloved Mainstage has been severely damaged,'' the organisers posted on the event's website.\n\n‘’We can confirm that no one was injured during the incident.''\n\nImages shared on local news sites and social media showed flames and plumes of black smoke engulfing the stage and spreading to nearby woodland. (Nine)\n\nMorgan Hermans, who lives nearby to the festival site, told CNN that she initially heard fireworks going off, which prompted her to look outside.\n\n\"There was just a big cloud of fireworks and smoke very near us, so that was a bit scary,\" she said.\n\n\"It's one of the biggest events in the entire year. Our town is very small so to welcome people (from) around the entire world, it's crazy and it's so much fun.\"\n\n\"It's a big deal so everyone in Boom was a bit terrified for a few seconds,\" Hermans added.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/technology/donkey-kong-bananza-review-nintendo-switch-2/6adc5a7c-bfd6-4084-988d-9ddb9848af04",
        "title": "Donkey Kong's newest adventure: 'An imperfect masterpiece'",
        "publish_date": "Wed, 16 Jul 2025 18:03:05 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "Donkey Kong Bananza is an imperfect masterpiece.\n\nIts ambition pushes Nintendo's new console — the Nintendo Switch 2 — up to and beyond its limit; serving as both a technical showcase and a reality check.\n\nThankfully, the slowdown and frame stutter doesn't detract from one of the best final boss fights I have ever experienced, nor the fun of what will be a game of the year contender.\n\nDonkey Kong Bananza is coming to Nintendo Switch 2 on July 17. (Nine)\n\nDonkey Kong's first 3D outing in 25 years plays like a power fantasy.\n\nAnd once you get the hang of controlling an ape that's bigger, faster and stronger than Mario, you won't want to stop.\n\nREAD MORE: Australia to feature in major new gaming release ﻿\n\nA Donkey Kong Odyssey\n\nIn case you missed it, Donkey Kong Bananza was crafted by the team that made 2017's incredible Super Mario Odyssey .\n\nThere are a lot of similarities but they are very different games.\n\nBananza 's worlds are comparatively massive and they are destructible.\n\nWithout spoiling anything, these worlds are some of Nintendo's best. There are way more than you might expect, most feature a wonderful gimmick and DK can punch his way through almost all of them.\n\nHe can rip chunks off a wall, the floor and from enemies and then use that chunk as a weapon. You can throw it like a projectile, use it as a platform to double jump with or ride it to \"surf\" across water and spikes.\n\nThis looks very familiar... (Nine)\n\nYou'll need to master all of the above if - like me - you plan on collecting every secret.﻿\n\nAt its heart, Donkey Kong Bananza is an old-school collectathon.\n\nThere are more than 700 \"Banandium Gems\" to collect and hundreds more fossils to find, which can be traded for costumes that give DK buffs like faster swimming or reduced damage from poison or icy water.\n\nYou'll stumble across plenty of both as you naturally progress the story, but you'll have to stray off (and under) the beaten path to find everything.\n\nLike Mario Odyssey, most of these rewards are tied to besting bosses, challenges or environmental puzzles. Almost all of these tasks are unique but some - like finding Cranky Kong or buying a Banandium Gem from the shop - are basically repeated across multiple levels, which I'm not a huge fan of.\n\nDonkey Kong Bananza title screen. (Nine)\n\nAgain, like Mario Odyssey , the names of each Banandium Gem are a cute nod to where it is or how to unlock it. However, unlike Mario Odyssey , there's no way to get those helpful hints from a friendly NPC. You're never told what that name of a gem is until after you find it. Instead, you can bash your way through an environment to find buried treasure maps that pinpoint the location of a gem or fossil on your map but that takes away some of the fun.\n\nJourney to the centre of the Earth\n\nBananza 's story is both wonderfully simple and straight up (sorry for the pun) bananas.\n\nDK just loves and wants bananas.\n\nBut when a villain comes to steal those bananas, DK's mining colony gets squashed underground and he gets partnered with a singing rock that quickly transforms into a shy, 13-year-old called Pauline, who recruits DK on a mission to the earth's core where they can make a wish to return to the surface.\n\nPauline grants DK all new powers. (Nine)\n\nLike with magic, the trick is to not think too hard and just enjoy the show.\n\nNintendo is the master of keeping things ambiguous. Fans will pour over references to Pauline's grandmother and when she calls New Donk City \"my city\" but the game never gives any definitive explanation as to why Pauline is 13, where the story fits on a \"timeline\" or if the story is somehow connected to Super Mario Odyssey .\n\nWhat matters is the charming relationship between a silent ape and his shy companion.\n\nPauline narrates most of what happens on screen and - if you jump into bed for a rest - she'll regale DK with a little story about her hopes as he falls asleep. It's incredibly endearing and that charm extends to cute idle animations like Pauline playing with DK's hair.\n\nThey really feel like a perfect pair. And as DK helps Pauline find her voice, she grants him powers that we'd never imagined.\n\nNow you're playing with power\n\nDonkey Kong is a beefy boy, and Nintendo leans right into that power fantasy.\n\nOn top of DK's standard bone-shattering punches, he can unlock the ability to transform into five super-powered animals. These are called Bananzas.\n\nNintendo has already revealed three of these: the Kong (super strength), Zebra (super speed) and Ostrich (flying) Bananzas.\n\nTo call them overpowered is an understatement. These powers would break most games. Here you're encouraged to break everything. You can trigger each Bananza at any time, anywhere and (because there's so much gold just lying about) the metre required to activate a Bananza is pretty much always full.\n\nREAD MORE: New games and hardware unveiled by PlayStation ﻿\n\nZebra Kong?! (Nine)\n\nThere are specific challenges for each transformation and, like DK himself, each can be levelled up to be even stronger.\n\nNo one is really talking about how amazing the music is when you activate these - but it's incredible. The Zebra one in particular is such a vibe. There's a lot of Splatoon 's DNA in each of these tracks, adding to what is already a stellar, nostalgia-filled soundtrack. Nintendo has been nailing its soundtracks of late and I can't wait for Bananza 's to be added to the Nintendo Music app.\n\nShould I buy it?\n\nIf you've purchased a Nintendo Switch 2, chances are you're going to buy this game.\n\nIt's big, it's beautiful, it's charming and it's fun.\n\nYes, it's disappointing that the game's performance isn't flawless. Typically, I'd expect more from Nintendo - especially when it's the 3D Mario team. Its framerate issues appear to be more pronounced in larger levels - and while I haven't done a frame-by-frame analysis - I think things looked smoother in handheld mode when VRR was enabled.\n\nAI upscaling does a lot of the heavy lifting to make the game look as nice as possible, but its flaws are obvious too. If you spin the camera around fast enough, the hearts in DK's health bar start to blur together, which I've never seen in a Nintendo game before!\n\nRegardless, if you've been waiting for a classic collectathon on the Nintendo Switch 2, look no further.\n\nThe most anticipated video games of 2025 View Gallery",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/terraces-and-townhouses-to-cost-one-dollar-under-state-governments-latest-move/6aa66a73-fffc-4dee-a96e-78f87402232d",
        "title": "The design for this house can be yours for $1 and approved in 10 days",
        "publish_date": "Wed, 16 Jul 2025 02:21:39 +0000",
        "category": "finance",
        "authors": [
            "Jul"
        ],
        "text": "There are hopes cut-price terraces and townhouses that can be approved in just 10 days will help more NSW residents break into the housing market and speed up the time it will take to build homes.\n\nNSW Premier Chris Minns released the state's housing pattern book today, with eight designs chosen from several internationally renowned firms.﻿\n\nThe designs will be available for $1 for the first six months and $1000 after this time, providing the blueprint for townhouses, terraces and manor houses.\n\nThe eight designs will be available for $1 for the first six months. (NSW Government)\n\nThe typical cost for an architectural design is more than $20,000.﻿\n\nThe government hopes the release of the housing pattern book will alleviate cost-of-living pressures for residents and provide a fix to the state's slow housing construction rates.\n\nThe book was released following ﻿a competition held last year for denser developments, including duplexes and terrace houses.\n\nThe typical cost for a custom architectural design is more than $20,000.﻿ (NSW Government)\n\n\"For too long, too many people in NSW have been locked out of the housing market by rising costs and a system that made it too hard to build,\" Minns said.\n\n\"This pattern book is about giving people more choice, faster approvals, and affordable, high-quality homes, whether you're a young person trying to get in, a family needing more space, or a downsizer looking to stay close to the community you know.\n\n\"This is a practical step to make the housing system fairer and make sure NSW remains a place where the next generation can afford to live and thrive.\"\n\nNSW government architect Abbie Galvin said the intention of the housing pattern book was to provide a \"quicker and easier to build new low-rise homes that offer housing diversity for the whole community\".\n\n\"The pattern book offers practical and sustainable designs that can be adapted to suit many neighbourhoods, positively contributing to the character of a street.\"\n\nView the designs here .﻿",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-17/unemployment-rate-australia-june-2025/105540858",
        "title": "Breaking: Unemployment rate rises to 4.3pc in June",
        "publish_date": "Thu, 17 Jul 2025 01:43:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's unemployment rate rose to 4.3 per cent in June, up from 4.1 per cent in May, after the Reserve Bank surprised markets last week by keeping interest rates on hold.\n\n\"The sharp rise in unemployment in June makes the RBA's decision to leave rates on hold earlier this month look like a policy error,\" Abhijit Surya, senior Asia-Pacific economist at Capital Economics, said.\n\n\"We're increasingly convinced that the incoming data flow will prompt the bank to cut rates further than most are currently anticipating,\" he said.\n\nRBA defies expectations of interest rate cut Photo shows Sliding glass doors into a building with the words Reserve Bank of Australia written above. The Reserve Bank had been expected to cut the cash rate to 3.6 per cent, to its lowest since April 2023.\n\nAccording to the Bureau of Statistics data, employment increased by 2,000 people in June, but the number of officially unemployed people jumped by 33,600.\n\nSince employment (+2,000) and unemployment (+33,600) both increased in June, the size of the active labour force grew by 35,600.\n\nThe growth in the labour force helped the participation rate to increase a little, from 67 to 67.1 per cent — putting it just shy of its record-high of 67.2 per cent in January.\n\nBut part-time employment grew by 40,000 people, while full-time employment fell by 38,000 people, which contributed to a noticeable decline in monthly hours worked in all jobs and a slight rise in the underemployment rate.\n\nThe employment-to-population ratio remained at 64.2 per cent in June.\n\nHarry Murphy Cruise, head of economic research for Oxford Economics Australia, said the data suggested the RBA should \"get a wriggle on\" with another rate cut.\n\n\"The weak print follows a meek reading in May,\" he said.\n\n\"Back then, we weren't convinced the data signalled a sharp rise in joblessness was looming. And while we're still not ringing the alarm bells, June's slackening is another good reason for the RBA to get a wriggle on with rate cuts.\n\n\"Looking ahead, the labour market has a number of challenges nipping at its heels.\n\n\"First and foremost, President Trump's tariffs are weighing on business investment and prompting some firms to rethink hiring plans. Even though Aussie businesses are largely out of the direct line of tariff fire, global uncertainty is lapping at our shores,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-17/tobacconist-atms-cut-off-payment-networks-eftex/105539942",
        "title": "Payments to ATMs in tobacconists to be cut off after ABC investigation",
        "publish_date": "Thu, 17 Jul 2025 01:25:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "One of Australia's major payment processors will stop handling transactions from private ATMs sited in tobacco shops and will demand detailed information about the machine owners.\n\nNew South Wales-based EFTEX, which processes transactions for more than 5,500 ATMs, this week told clients that media coverage about ATMs in \"high-risk environments\" like tobacco stores had triggered increased regulatory scrutiny.\n\nSome small tobacco stores were found hosting two ATMs to meet the cash demand. (ABC News)\n\nThe move follows an ABC investigation revealing major private ATM suppliers were fuelling the illegal tobacco industry, placing their machines in tobacconists where they provided an instant source of cash for off the books transactions.\n\nSome tiny stores selling illegal tobacco even hosted two machines concurrently to cope with the huge demand for cash that fuels a black-market trade.\n\nPayment processing company EFTEX has stopped handling transactions from ATMs in tobacco shops.\n\nThe ABC also revealed that criminals, including a drug dealer, were able to own and operate the private ATMs, which offer money laundering opportunities when merchants were able to load them with their proceeds of crime.\n\nEFTEX said — in conjunction with partners Big Four banks Westpac and ANZ — this meant it would stop processing payments from ATMs in tobacconists.\n\nIt would also cull services to other \"high risk\" business operations like the adult entertainment industry from September 15.\n\nThe changes mark a step in the ATM industry, whose backers include prestigious investment bank Macquarie Group, to divorce itself from the illicit sector.\n\nEFTEX says the decision was made amid \"increased regulatory scrutiny\" following the ABC's investigation. (ABC News)\n\n'Increased media coverage'\n\nEFTEX, which helps process payments for ATM companies, this week told clients about an upcoming crackdown.\n\n\"As you are aware there has been increased media coverage of independent ATM operators with ATMs located in high-risk environments,\" it said in correspondence sighted by the ABC.\n\n\"This is leading to increased regulatory scrutiny. In response EFTEX and its acquiring partners have agreed to cease processing ATM transactions linked to high-risk locations that include but are not limited to tobacconists and adult entertainment venues.\"\n\nEFTEX also warned it would be seeking detailed information about client's business structures including the identity of owners, as part of its anti-money laundering duties.\n\n\"This will include information on directors, owners' franchises, sub-ATM deployers (businesses deploying private ATMs) and cash providers etc,'' said the correspondence.\n\n'Understanding underlying risks'\n\nFinancial crime compliance expert Neil Browne said the move was \"absolutely a step in the right direction\" and should be replicated across the industry.\n\n\"EFTEX is beginning to understand who its customers are and any underlying risks associated with those customers,'' said Mr Browne.\n\n\"Other providers should be taking similar steps\".\n\nNeil Browne says other payment processing companies should follow EFTEX's example. (Supplied)\n\nThe company boasts it handles $30 billion worth of transactions annually.\n\nEFTEX was contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-17/pilbara-housing-costs-challenging-residents/105528232",
        "title": "Buying a house in WA's Pilbara easier said than done",
        "publish_date": "Thu, 17 Jul 2025 01:02:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "After recent research identified buying a property as a cheaper option than renting in Western Australia's resources-rich Pilbara, those looking to purchase locally say it is easier said than done.\n\nWhile the mining and energy industries have brought plentiful jobs and high wages to the north-west, they have also driven up the cost of living for the remote region's residents.\n\nWhen lenders are asking for deposits of up to 40 per cent and insurance costs are astronomical, families like Harriette Smith's — even with work-based subsidies — are being left behind.\n\nHarriette Smith says it is difficult to purchase a house in the north west. (ABC Pilbara: Kimberley Putland)\n\nWhile Ms Smith and her family rented through her employer, they were looking for a home to call their own.\n\n\"We want hooks for them to hang school bags, you know? Maybe one day get a pet and just be able to do things,\" she said.\n\n\"One of my kids wants a pink bedroom and a rainbow.\"\n\nHarriette Smith wants to purchase a home for her family without the concern of rental inspections. (ABC Pilbara: Kimberley Putland)\n\nBut Ms Smith and her husband could not afford a home in the current market, even with subsidies provided by their workplaces.\n\n\"[We've been saving] on and off for the past five years,\" Ms Smith said.\n\n\"I feel like we're getting close to having a deposit, and then a trip to Perth comes up or something comes unexpectedly … and we're not able to afford it.\n\n\"It's not even just the house price — it's the stamp duty on top of it, and all those extra hidden things that you're not aware of when you get into housing.\"\n\nBuilding, deposits challenging\n\nThe Pilbara's unique housing problem Photo shows A man stands in front of a grey cement wall of an apartment and looks to his left. Despite a joint effort from governments and the resources sector, rents in a remote WA region have soared well past the nation's capitals.\n\nPilbara Development Commission chief executive Simon Taylor said saving for a deposit in the region was more complex than in the city.\n\nMr Taylor said the region's homebuyers faced additional challenges.\n\n\"Incomes are generally much higher in the Pilbara than, say, Perth, but costs of living are higher and that impacts on people's ability to save a deposit,\" he said.\n\n\"It's very difficult for people to secure finance, even if they would really like to move into home ownership.\n\n\"These factors result in very high deposits being required by lenders — often around 30 to 40 per cent of the cost.\"\n\nSimon Taylor says prospective homebuyers face multiple challenges in the north west. (ABC Pilbara: Kimberley Putland)\n\nBuilding a new home is even more challenging, with the valuation systems employed by banks a limiting factor.\n\n\"The cost of construction and the land generally exceeds the market value of the property,\" Mr Taylor said.\n\n\"That can be by $100,000–$200,000 quite commonly, and banks make an assessment on what they'll lend based on the value, not on the cost.\"\n\nInsurance premiums climbing\n\nProspective buyers also face huge insurance premiums in the state's cyclone-prone north.\n\nInsurance Council of Australia chief executive Andrew Hall said premiums had increased due to more frequent and severe weather events, while some providers had withdrawn from the region altogether.\n\nAndrew Hall says increasingly severe weather events have pushed insurance premiums up. (ABC News: Tobias Hunt)\n\n\"We've seen that on top of inflation, which has flown through the building sector and the motor industry,\" Mr Hall said.\n\n\"We're also seeing global capital, through reinsurance costs and the like, go up.\n\n\"Some insurers provide a lot of coverage in northern Australia, while others don't have the network or the infrastructure to support claims in that region.\"\n\nKarratha residents have told the ABC of quotes for home and contents insurance of up to $8,000 for a two-bedroom house.\n\nChallenge even with work support\n\nThose employed by the resources industry were often eligible for subsidies, but this was something Mr Taylor said lenders did not always account for.\n\n\"You need a high deposit and you're stretched for saving, and then part of your effective income is a housing subsidy — but then it can't be taken into account,\" he said.\n\n\"If you're trying to save for a house and you're paying high costs and the bank doesn't take account of the housing subsidy in the serviceability, you're in a pretty challenging situation.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-17/neurodivergent-university-students-fear-being-labelled/105533038",
        "title": "Neurodiverse uni students say discrimination and lack of support rife",
        "publish_date": "Thu, 17 Jul 2025 00:39:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "For neurodivergent student Aaron Valdes, transitioning to university was difficult.\n\nHe said while Federation University had support available for neurodiverse students, accessing it was tricky.\n\n\"In the neurodiversity community, there comes a lot of shame because we've been told a lot that essentially, 'You're just dumb, why don't you get this already?'\" Mr Valdes said.\n\n\"So, then you try to figure it out yourself without asking people for help because you feel ashamed for not getting it in the first place.\"\n\nTo build on Federation University's initiatives to support its neurodivergent students, Mr Valdes created a club on campus.\n\n\"I felt a sense that there was a community [here], but we were so varied and not represented,\" he said.\n\nAaron Valdes says the Federation University Neurodivergent Club provides support and advocacy. (ABC Ballarat: Gavin McGrath)\n\nThe main goal of the Federation University Neurodivergent Club is to support and advocate for students.\n\n\"We are a demographic that doesn't have much support or agency — there's so much discrimination,\" Mr Valdes said.\n\nMr Valdes has used the club to advocate for a low-sensory space for neurodivergent students dealing with sensory overload, which the university says is under construction.\n\nThe university also has inclusion officers on campus to assist students who seek help and has created \"ND toolkits\" for staff and students, which are online resources featuring advice and strategies for navigating tertiary education.\n\nFederation University study\n\nFederation University has also surveyed its neurodivergent staff and students to identify key barriers to accessing higher education.\n\nAcademic Liam Frost-Camilleri said the results were helping the university work with its neurodivergent cohort.\n\n\"The earlier you engage … the better, because they will be able to suggest things that you haven't even thought of,\" Mr Frost-Camilleri said.\n\nLiam Frost-Camilleri says a neurodivergent student survey is helping Federation University provide better support. (Supplied: Federation University)\n\nThe study showed a lack of clear communication, \"particularly from lecturers\", was a barrier many students identified, and that professional development and training for staff on how best to support neurodivergent students was \"sorely needed\".\n\n\"There are a lot of systems that many of these students feel have never really helped them, or they don't feel safe enough to really even disclose that they have neurodivergence,\" Mr Frost-Camilleri said.\n\nThe survey found 75 per cent of neurodivergent students said they were used to being self-reliant and 62 per cent said they lacked the confidence to ask for help, while two-thirds feared being labelled or stereotyped if they asked for support.\n\n\"Some students say, 'I don't go and ask [for help] because I want to see if I can do it by myself first,' rather than get the support,\" Mr Frost-Camilleri said.\n\n\"So, it is a problem, [but] there are things that we can do to help support these people.\"\n\nWhat are other universities doing?\n\nRMIT University PhD student Jeremy Nagel has created an app called Focus Bear to help neurodivergent students with their studies by detecting when they are distracted.\n\n\"You tell it what you want to do and then it uses AI to check whether the websites that I have open relate to that goal,\" Mr Nagel said.\n\n\"The inspiration for it was my own lived experiences, as someone who's autistic and has ADHD.\n\n\"I found I was getting distracted a lot, and I wanted something that would actually block me from using my computer at night, and also blocked me from accessing emails in the morning until I've done my meditation and my exercise.\"\n\nJeremy Nagel's Focus Bear app helps neurodivergent students detect distraction. (Supplied: Jeremy Nagel)\n\nIn conjunction with this tool, Mr Nagel and other students have access to a wide range of resources and spaces that help them access their studies in a way that suits their needs.\n\n\"[RMIT has] these neurodivergent study groups where you can go and you can be with other people in the same area,\" he said.\n\n\"It uses the principle of body doubling, which is where you are working next to someone else and you tell them what you're going to work on, and that creates some micro-accountability.\n\n\"I use that quite often and it really helps me.\"\n\nMr Valdes reminded people: \"You're not alone.\"\n\n\"There's a community here and we will lift each other up and we will support each other,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-17/former-afl-player-brandon-jack-publishes-debut-novel-pissants/105517366",
        "title": "Ex-AFL player pens debut novel set in debauched AFL fringe",
        "publish_date": "Thu, 17 Jul 2025 00:33:47 +0000",
        "category": "sports",
        "authors": [],
        "text": "When the Western Bulldogs played the Sydney Swans earlier this year, former footballer and author Brandon Jack got a text about the game from an unlikely source.\n\n\"I got this random message from [author] Helen [Garner] saying, 'I don't know about this Tom Papley,'\" he tells ABC Arts. \"[She thought] he was being a bit of an instigator.\"\n\nGarner, an ardent Western Bulldogs fan whose latest book, The Season, followed the fortunes of her grandson's under-16s AFL team, had found a kindred spirit in Jack.\n\n\"It's so funny that we've become friends, but it's nice that this very highly regarded writer approves of [my] work,\" Jack says.\n\nMixing the unlikely worlds of AFL and literature is very much the MO for Jack, whose new novel, Pissants, takes us to the fringes of AFL football.\n\nThe 31-year-old played 28 games for the Sydney Swans over five years before becoming interested in literature and studying creative writing.\n\nJack (pictured) comes from a sporting family; his older brother Kieren served as co-captain of the Sydney Swans and his father Gary played rugby league for Australia. (Getty Images/Paul Kane)\n\nHis 2021 memoir, 28, won praise from Australia's literary establishment for its insights into masculinity and addiction.\n\nBut Jack says he still \"didn't feel like much of an author\" after writing it.\n\n\" I wanted to explore fiction, creating characters and writing voices. \"\n\nThe purgatory of life as a fringe AFL player\n\nPissants, Jack's first novel, sketches out a world he knows well. It follows a ragtag bunch of contracted AFL players who exist on the periphery of the mega-popular sport.\n\nOur antiheroes — who have nicknames like Fangs, Mud, Stick, Shaggers and Big Sexy — don't play much football.\n\n\"Brandon Jack is a talented writer; he can change voices,\" journalist and author James Button tells ABC Radio National's The Bookshelf. (Supplied: Simon & Schuster)\n\nInstead, they train, resent the star players, abuse painkillers to get through an inane sponsor's function, fill out bingo cards of the cliches spouted by the team's ineffective psychologist and get kicked out of nightclubs.\n\nUnderneath all their shenanigans and abrasive behaviour is a deep well of desperation.\n\nBut Jack says he didn't intend Pissants to critique football club culture.\n\n\"I'm sure there are many interpretations of it but, to be completely blunt, I didn't have a message or anything I was trying to solve with this book. I just enjoyed writing it.\"\n\nInstead of mapping out the plot in advance, Jack followed the more freewheeling approach of one of his most admired authors, Booker Prize-winner George Saunders.\n\n\"[Saunders] says that if you try and wrestle back a story from where it's leading you, then you're doing a disservice to it.\"\n\nJune's best books Photo shows A composite image showing eight book covers on a blue and purple background This month our critics hand-pick their top reads, from a queer thriller, new novels from some of Australia's biggest authors and luminous short stories.\n\nPissants departs from traditional novelistic storytelling, including elements such as footnotes, betting slips, Facebook events and transcripts of a kangaroo court the group runs.\n\nSimilarly, we never learn which club the Pissants play for; this information is always blacked out in the text, like a redacted name in a court document.\n\nJack says he was influenced by writers like Irvine Welsh and Jennifer Egan, who use unusual literary devices to flesh out their fictional worlds.\n\nHe also says he used a kaleidoscopic approach out of \"necessity\".\n\n\"To be honest, I'm not the kind of writer who can sustain a single voice for 300 pages. My writing, if I do that, dies on the page, so it made sense for me to bounce around between voices and techniques.\"\n\nBullying as bonding\n\nOne constant in the Pissants group is what looks to outsiders like blatant bullying.\n\nThe players bond through abusing members of their group who step out of line. They also engage in cruel and elaborate pranks at each other's expense.\n\n\"That's definitely very strong in footy clubs,\" Jack says of bullying.\n\nThe group also have scores of elaborate running in-jokes in their group chat.\n\n\"Sometimes, you really want to be in on the joke, even if it's at your expense, because the alternative is loneliness, and that's almost a worse fate,\" Jack says.\n\n\"That's why, in my mind, these players are engaging the way they are. I think they're looking for some sort of meaning and connection to other people, and that's the way they get it.\"\n\nListen to ABC RN's The Bookshelf Photo shows The Bookshelf Podcast Image The latest and best fiction reviewed by a team of dedicated bibliophiles.\n\nNone of the Pissants seem to enjoy their life as footballers. They resent their place in their world but feel powerless to change it.\n\nYet the game is often a large part of their identity and their only developed professional skill.\n\nJack himself had profoundly mixed emotions when the Sydney Swans delisted him, ending his AFL career at just 23.\n\n\"I knew I didn't want to play sport anymore, but I was still f***ing hurt by it,\" he says.\n\n\"I only realised a few years back how lost I was and how much I was struggling.\n\n\" The way I dealt with that was to try and get as far away from football as I could. I didn't watch footy for years, and I didn't really talk about it. \"\n\nFinding solace in humour\n\nJack's characters often deal with their despair through gallows humour. The action often resembles the pitch-black comedy of Quentin Tarantino or the Coen Brothers, especially in a chapter where the players kidnap a teammate's dog for a lark and things go downhill.\n\n\"I'm glad that it's got that humour and that it captures what was, for me, a pretty dark place at times,\" Jack reflects.\n\n\"I'm at a point now where I realise there were things in [that experience] which were seriously funny.\n\n\"The reason for all my searching was that I just wanted somebody else around, to be connected.\n\n\"To be able to write this in a way that conveys both of those things was important.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-17/tomorrowland-music-festival-main-stage-burns-belgium/105540618",
        "title": "Tomorrowland's main stage catches fire days before festival",
        "publish_date": "Wed, 16 Jul 2025 22:58:40 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A huge fire has \"severely damaged\" Belgian music festival Tomorrowland's elaborately decorated main stage.\n\nThe fire broke out on Wednesday, local time, with the festival due to start on Friday.\n\n''Due to a serious incident and fire on the Tomorrowland Mainstage, our beloved Mainstage has been severely damaged,'' the organisers posted on the event's website.\n\nImages shared on local news sites and social media showed flames and plumes of black smoke engulfing the stage.\n\nFireworks could be heard going off in the footage, illuminating the smoke with occasional flashes of colour.\n\nRed fireworks can be seen going off in amongst the smoke in this image, taken near the festival site. (Reuters: Morgan Hermans )\n\nDespite the damage, festival organisers say no-one was injured in the blaze.\n\nIt is unclear what caused the fire.\n\nEach year, the stage is elaborately decorated, which is a major feature of the festival.\n\nHere is a look at how it has been decorated in previous years, to give you a sense of the scale of the set-up:\n\nLoading Instagram content\n\nFootage on social media showed a huge, mountain-like structure with an intricate, multi-level castle design to fit in with this year's theme — which was about melting ice.\n\n\"The festival's brand-new theme 'Orbyz', set in a magical universe made entirely out of ice, will reveal a hidden community that has been existing under a gigantic ice cap for many years,\" the festival's website read.\n\n\"Once the mass of ice and glaciers starts melting, the indigenous community rises to the surface, consisting of a unique source of light, energy, and power that originates from powerful, red-colored crystals and rocks.\"\n\nYou can see parts of the elaborate set design burning in this photo from inside the festival. (AFP: Belga/Stringer )\n\nWhat is Tomorrowland?\n\nTomorrowland is an electronic dance music festival that has been held in Belgium for 20 years.\n\nIt is a major festival on the European calendar, attracting people from around the world to the town of Boom, which is just north of Brussels.\n\nTickets generally sell out within minutes of going on sale.\n\nIt is held across two weekends — this coming weekend and the one after.\n\nThe Tomorrowland website said 400,000 people were expected to attend.\n\nBelgium's King Philippe and Queen Mathilde at Tomorrowland in 2017. (Reuters: Danny Gys)\n\nWill the festival go ahead?\n\nYes.\n\n\"We are focused on finding solutions for the festival weekend,\" organisers wrote on the Tomorrowland website.\n\n\"More updates and detailed information will be communicated as soon as possible.\"\n\nOn Wednesday night, the organisers said the festival's campsite would be opening as planned.\n\nABC with AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-17/norway-winter-olympics-audun-gronvold-dies-struck-by-lightning/105540836",
        "title": "Norwegian Olympic medallist dies after being struck by lightning",
        "publish_date": "Wed, 16 Jul 2025 22:45:46 +0000",
        "category": "sports",
        "authors": [],
        "text": "Olympic ski cross medallist Audun Grønvold has died after being struck by lightning.\n\nThe Norwegian Ski Federation (NSF) confirmed Grønvold's death. He was 49.\n\nGrønvold won bronze at the 2010 Vancouver Games.\n\n\"It is with great sadness that we have received the news of Audun Grønvold's untimely passing,\" an NSF statement read.\n\n\"The former national alpine skier and ski cross athlete was recently struck by lightning during a cabin trip.\"\n\nThe NSF said Grønvold was \"quickly taken to hospital and received treatment for the injuries he sustained in the lightning strike\" but died earlier this week.\n\nGrønvold was a member of Norway's alpine skiing team before he moved into freestyle and ski cross.\n\nHe had one podium finish as a World Cup alpine skier, finishing third in a downhill event in Spain, in 1999.\n\nGrønvold also won bronze in ski cross at the 2005 world championships and at the overall World Cup in 2007.\n\nAfter his career ended, he became a national team coach and a TV commentator.\n\n\"Norwegian skiing has lost a prominent figure, who has meant so much to both the Alpine and freestyle communities,\" NSF president Tove Moe Dyrhaug said.\n\nDyrhaug said Grønvold's death created \"a huge void\".\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-17/federal-politics-live-blog-july-17/105540590",
        "title": "Live: Panda diplomacy on display during PM's final day of China visit",
        "publish_date": "Wed, 16 Jul 2025 21:42:16 +0000",
        "category": "finance",
        "authors": [
            "Courtney Gould",
            "Stephanie Chalmers",
            "Stephen Dziedzic In Chengdu",
            "Bethanie Alderson"
        ],
        "text": "Anthony Albanese is seen with retired Adelaide Zoo panda Fu Ni at a park in Chengdu, China. (AAP: Lukas Coch)\n\nThe prime minister has just visited a breeding centre for giant pandas in the bustling city of Chengdu. These charming creatures are undeniably charismatic and intend to charm almost everyone who sees them.\n\nOn the top of his list at the centre was visiting Fu Ni, a panda who spent many years at Adelaide Zoo as a beloved fixture. The PM visited to say hello and to call her a great ambassador for China. Still, it's worth remembering the Chinese government retains ultimate control of where giant pandas go.\n\nAt the moment, Australia is the only country in the Southern Hemisphere to have a giant panda, although there are 20 or so other countries around the world that have them right now.\n\nThe fact that Premier Li Qiang came to Australia last year to make the announcement that new pandas were to come to Adelaide was taken as a sign that the government's push to stabilise the relationship between Canberra and Beijing was working.\n\nThe fact that the prime minister has come back here essentially to say, \"thank you\", is a sign that Australia wants to recognise that gesture.\n\nAlbanese is going to move on from pandas and head into central Chengdu after this for a lunch focused on medical technology and commerce.\n\nThe pictures won't be nearly as good or charming, but the subject matter is still important, and Australia is really enjoying quite a bit of business success in Chengdu, particularly with companies like Cochlear, which is using the city as a base to export to China's growing middle class.\n\nHowever, at least for the media, and probably for most Australians, the lingering image of this leg of his visit is likely to be these extraordinary creatures, a conservation success story for China, but also a diplomatic tool which it does not hesitate to wield very effectively.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-17/asx-markets-business-live-news-17-july/105540582",
        "title": "Live: Aussie dollar falls as unemployment unexpectedly rises",
        "publish_date": "Wed, 16 Jul 2025 21:30:35 +0000",
        "category": "finance",
        "authors": [
            "Stephanie Chalmers",
            "Business Correspondent David Taylor",
            "Emily Stewart"
        ],
        "text": "Today's ABS unemployment data for June has come as a surprise, but there may be an explanation for that surprise.\n\nThe ABS, we're told, changed who it surveyed for this jobs data.\n\nANZ senior economist Adelaide Timbrell says it's entirely possible more unemployed people, and less full-time employed people, were included in this latest survey.\n\n\"So there was a change in the sample groups of people who were asked about their labour force status.\"\n\n\"In the latest survey, we have to remember, like most economic data, the labour force data is not perfect, and what happened was the people who were being surveyed this month versus last month were more likely to be unemployed before that survey began,\" Adelaide Timbrell said.\n\nNotwithstanding this though, there does seem to be some loosening in the jobs market.\n\n\"So although the data does seem to show some loosening in the labour market, we need to temper that with the idea that part of this increase in the unemployment rate may be because of who was asked.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-17/cast-in-blue-sculpture-arrives-in-mount-gambier/105518754",
        "title": "'Blue blob' or 'beloved new landmark'? It's got this city talking",
        "publish_date": "Wed, 16 Jul 2025 21:16:35 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A sculpture widely criticised for its unusual design and cost has received a positive welcome in Mount Gambier at an unveiling kept quiet until it was complete.\n\nThe sculpture, Cast in Blue, represents a kind of mythical megafauna, like those found in the nearby Naracoorte Caves, in the colour of Mount Gambier's famous Blue Lake.\n\nThe City of Mount Gambier council paid $136,000 for the sculpture, while also raising its rates by 10 per cent last year and 8 per cent this year.\n\nThe cost and the design received backlash online, and Cast in Blue was nicknamed \"the blue blob\".\n\nLynette Martin says the sculpture has already had an impact. (ABC South East SA: Josh Brine)\n\nBut during the unveiling on Wednesday afternoon, Mount Gambier Mayor Lynette Martin said the price was worth it to bring people into the city's CBD and to introduce them to stories about the Limestone Coast's natural history.\n\n\"For some, it has already become a beloved new landmark, for others it might take time,\" she said.\n\n\"But art, like all great things, is meant to challenge us, delight us, and stay with us long after we have seen it.\"\n\nThe Cast in Blue sculpture is lifted off a trailer ahead of its unveiling. (ABC South East SA: Conor Burke)\n\nOpinion mixed on arrival\n\nSocial media posts about the sculpture's unveiling attracted hundreds of negative comments within hours.\n\nBut negative comments were harder to find among those at the unveiling and people walking past.\n\n\"I think I love it. Maybe some people will hate it at first, but they will grow into it,\" Rhisang Alfarid said.\n\nStella, 10, and her friend Bethany, 11, both liked the colour of the sculpture.\n\nStella, 10, and Bethany, 11, were there to see Cast in Blue moved into place. (ABC South East SA: Eugene Boisvert)\n\n\"I like that it's dark blue,\" Stella said.\n\n\"I think it's very big and blue,\" Bethany said.\n\nMelbourne tourist Sarah Smail said it was \"quite striking\" and had an interesting backstory about local history, but she understood why people might baulk at the cost.\n\n\"Well, that's a lot of money, and I can understand that people are probably a bit undecided on whether money could be better spent,\" she said.\n\n\"Art is in the eye of the beholder — not everyone is going to appreciate it.\"\n\nDesigners hope love will grow\n\nMelbourne architects Tom Proctor and Mitch Walker designed the sculpture, which Sculpture Co then fabricated.\n\nDespite its nickname, Mr Proctor said Cast in Blue was not very blob-like and instead represented a real thing that was identifiable as an imagined piece of megafauna.\n\n\"I think that's a pretty unfair characterisation of what it is, I would say,\" he said.\n\n\" We hope that when people can see it in person, they'll be able to actually form a bit of a relationship with it and, particularly children and kids, will be able to fall in love with it. \"\n\nTom Proctor and Mitch Walker designed the Cast in Blue sculpture. (ABC South East SA: Josh Brine)\n\nIn answer to critics of the cost, Mr Walker said it would be more of a waste of money if the project \"faded into the fabric of the city\".\n\n\"We're not trying to be incendiary or reactionary, but I think this project has had a very high impact,\" he said.\n\n\"[It] has gotten a lot of people talking about … what the identity of Mount Gambier is to them, what public art should look like to them and whether they agree with this piece or not, they've been forced to really solidify their position on that.\"\n\nLoading Instagram content\n\nArt can be treasured over time\n\nUniversity of South Australia associate professor of contemporary art Gretchen Coombs said Cast in Blue looked fun, reflected the local history and location, and had a sense of \"come to me\".\n\n\"I think it will be great for the local economy and reflecting the local identity, which is often what public art should do,\" she said.\n\n\" It should give a connecting point, a place to reflect what it is about our area that makes us appealing — it's our history, it's our landscape — and I think this does that very well. \"\n\nDr Coombs says people have come to love sculptures that were once derided, like Vault in Melbourne. (ABC Radio Melbourne)\n\nDr Coombs said people usually warmed to contemporary public art over time, even if it was controversial when first installed, especially if visitors appreciated it.\n\n\"Then people become quite, 'Wow, well, it's not as bad as I thought. My cousin from wherever came and they really thought it was interesting. Maybe it's not so bad,'\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-17/act-pilot-program-allow-some-gps-diagnose-adhd-prescribe-meds/105534784",
        "title": "'Aren't enough': Some Canberra GPs will soon be allowed to diagnose ADHD",
        "publish_date": "Wed, 16 Jul 2025 21:06:28 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "For Deranie Jackson, finding a specialist in Canberra to assess her child for attention deficit hyperactivity disorder (ADHD) was like finding a needle in a haystack.\n\n\"We didn't actually manage to get one in Canberra,\" Ms Jackson said.\n\nInstead, on a friend's recommendation, Ms Jackson made an appointment for Phoebe with a psychologist in Orange, 300 kilometres from home.\n\nWithin weeks, Phoebe had their diagnosis — a moment the Year 12 student, who uses they/them pronouns, described as empowering.\n\n\"For me, the main thing it impacted was my school life,\" they said.\n\nPheobe Jackson says receiving their ADHD diagnosis was empowering. (ABC News: Ian Cutmore)\n\n\"It made me realise that I wasn't really bad at these subjects, I just process slower and need a slower environment.\n\n\" That was so amazing to realise that it wasn't that I couldn't do work, I just needed a different environment. \"\n\nThe diagnosis came in late 2023 but by November last year, it became clear that Phoebe could benefit from medication to treat their ADHD.\n\n\"Phoebe was really struggling with school, despite working so hard,\" Ms Jackson said.\n\n\"There were days when Phoebe just couldn't think properly, and I just knew they couldn't do their HSC under these conditions.\"\n\nPsychologists are unable to prescribe medication for ADHD so the hunt for a specialist — namely, a psychiatrist — began.\n\nCanberra mother Deraine Jackson says trying to organise getting Phoebe prescribed ADHD medication has been distressing. (ABC News: Ian Cutmore)\n\nPhoebe's general practitioner (GP), who specialises in ADHD, gave them and Ms Jackson a list of eight specialists in the ACT to contact.\n\n\"I have spent eight months making phone calls, trying to get in, sending emails — and they've either not got back or their books are closed or they only do under-18s,\" Ms Jackson said.\n\n\"Even though we've got a diagnosis and we've already paid more than $1,000 for that, it was still such a struggle to find a psychiatrist.\n\n\" I was getting so distressed as a parent, it was really heartbreaking. \"\n\nNo one on the list could see Phoebe ahead of the HSC in October, so Ms Jackson called the psychologist in Orange who made the diagnosis and was recommended a psychiatrist in Albury, more than 300km away.\n\nThey have an appointment later this month.\n\nPhoebe said it had felt like they were in a race against time to access medication before the HSC started.\n\nPhoebe Jackson says they want to begin ADHD medication before their HSC. (ABC News: Ian Cutmore)\n\n\"It's just taken so long and such a toll — I see Mum making phone calls all the time and I'm so grateful that she's doing all that for me,\" they said.\n\n\"I really want the medication in time so I don't do really badly on the HSC because I really dislike not doing my best, which is what can happen if I'm not processing properly.\"\n\nAs for Ms Jackson, the single mother doesn't understand why such a common condition is so hard and expensive to diagnose and treat.\n\n\"If I injure my ankle, I call the physiotherapist and I have an appointment the following week,\" she said.\n\n\"This is life and death stuff for our children and it's not that the professionals aren't amazing, they just don't have capacity. There aren't enough of them.\n\n\"I don't know why it's so hard.\"\n\nSoon, it will not be.\n\n'There is a need now': Chief psychiatrist\n\nACT chief psychiatrist Dr Anthony Cidoni says they want to ease the pressure on waiting lists for ADHD treatment and diagnosis. (ABC News: Matt Roberts)\n\nThe ACT's chief psychiatrist, Dr Anthony Cidoni, made a commitment in May last year to improving access to ADHD diagnosis and prescribing within 12 months.\n\nA little beyond that deadline, he has revealed plans for a pilot program that will see GPs given more authority to diagnose the condition and additional powers to prescribe ADHD medication — a task currently only done by paediatricians, neurologists and psychiatrists, who often have lengthy wait lists and charge high fees.\n\nQueensland has had a similar system in place since 2017 for patients aged between four and 18, while New South Wales, Western Australia and South Australia have also committed to rolling out a GP-led ADHD program for young people next year.\n\n\"We know there are a lot of people that are really concerned about the access to diagnosis and the access to prescriptions for ADHD,\" Dr Cidoni said.\n\n\"So, we're really mindful that we need to do something to address the issues that are out there.\"\n\nIn late 2023, a Senate inquiry into ADHD recommended the development of uniform prescribing rules be expedited to ensure consistency between all jurisdictions.\n\nBut Dr Cidoni said it had become evident that achieving that recommendation could take years, and ACT Health decided it could not afford to wait.\n\nGPs are getting new powers to diagnose ADHD and prescribe medication. (ABC News: Maren Preuss)\n\n\"We don't want to wait for that because we think the need is there now,\" Dr Cidoni said.\n\nThe pilot program is slated to start as early as December but no later than January next year, following stakeholder consultation.\n\nCanberra GPs already have some prescribing arrangements, which allow them to prescribe ADHD medication for adolescents for two years and adults for three years, as recommended by a specialist.\n\n\"That is really restricted by what the specialist has determined or the specialist has outlined,\" Dr Cidoni said.\n\n\"What we have planned is two streams — one stream will be for GPs to be able to do the actual diagnosis and prescribing, and the other stream will be to do the prescribing but on a much broader level than we have now.\n\n\"So, I think we're looking at quite a significant change.\"\n\nThe pilot program will allow around 50 doctors to prescribe ADHD medications like Concerta, Vyvanse and Ritalin. (ABC News: Adam Kennedy)\n\nGeneral practitioners will have to apply to take part in the pilot program and, if approved, will need to complete comprehensive training before taking on patients.\n\nThere will be clinical supervision by a specialist and a requirement for a GP to refer complex patients to either a paediatrician, psychiatrist or neurologist.\n\n\"We've already scoped the level of interest in our GPs in the ACT so we're thinking there would be around 70 to 100 that might be interested in participating in a program like this,\" Dr Cidoni said.\n\n\"A smaller proportion in the diagnosing and treatment arm, and then a larger proportion in the prescribing arm.\n\n\"And if we get the parameters right, in terms of the appropriate education, psychiatrist oversight and access to ongoing support, I believe we can do it safely.\n\n\" We need to recognise that we can't meet this need through our private practitioners so we have to have a different way of managing it, but I wouldn't be doing this if it wasn't safe. \"\n\nWeight lifted from paediatricians' shoulders\n\nDr Kim Bland says the pilot program is needed to release the excessive pressure on Canberra specialists. (ABC News: Michael Barnett )\n\nWhen paediatrician Dr Kim Bland was told GPs would soon take on more of the ADHD workload, she breathed a sigh of relief.\n\nAnd Dr Bland suspects specialists across Canberra will do the same when they hear the news.\n\n\"This is coming as a real relief to paediatricians and to families, it is very much needed,\" Dr Bland said.\n\n\"Even with my books closed and that being well-known, we are still getting daily inquiries from families not just looking for care like they would for other medical conditions, but being in crisis.\n\n\"Not just asking for medical care, but asking for help and rescuing because they're really in a desperate and dire situation, and that's the difference with these children.\"\n\nBilly's mum struggled to find a specialist to diagnose ADHD. Now there are calls for GPs to have greater powers Photo shows Beck Collis and Billy Ellery GPs want to be able to help patients like Billy who have ADHD.\n\nDr Bland said every aspect of life is affected for a child living with undiagnosed ADHD, especially their education and self-esteem, plus the pressure on parents can lead to family breakdown.\n\nShe said turning those families away is one of the most difficult parts of her job.\n\n\"For parents, it's one thing to not know what they can do for their children but it's another to know it's right there, help is available, a diagnosis is available and all the support that comes with it, but they can't access it,\" Dr Band said.\n\nAnd for her, to know there will soon be a team of competent GPs to refer those families to feels like a weight being lifted.\n\n\"It takes some of that weight that is sitting on top of us and contributing to our burnout away. It really is a pressure valve for us,\" Dr Bland said.\n\nConfidence in GP take-up\n\nDr Kerrie Aust says it's important people can access timely care for suspected ADHD. (ABC News: Matt Roberts)\n\nDr Kerrie Aust, the ACT president for the Australian Medical Association, said it made perfect sense for general practitioners to play a more significant role in the ADHD space.\n\nShe is hopeful she will get approval to be among the group of GPs able to diagnose ADHD and prescribe medication for the condition.\n\n\"We are seeing an increase in young people and adults coming in to have discussions about whether they might have ADHD and it's really important they access care in a timely manner,\" Dr Aust said.\n\n\"While psychiatrists and paediatricians have really been trying to step up into that space, I think this is a good example where GPs can work to the full of their breadth of scope and get involved in the diagnosis and management, especially where those cases are relatively straightforward and we've got proven treatments.\"\n\nDr Aust said she was confident the take-up by general practitioners would be strong enough to have an affect on patient care.\n\nDr Kerrie Aust believes there will be stong enough take-up of the pilot by general practitioners. (ABC News: Romy Stephens)\n\n\"Every little bit counts — if one doctor can see two or three new patients a week, then that's a huge change to the backlog,\" Dr Aust said.\n\n\"It also creates space for the paediatricians and psychiatrists to focus their attention on some of the more complex diagnostic cases, or where we're having trouble managing the medications.\"\n\nBut she warned potential patients not to expect a diagnosis within a standard quarter-hour consultation.\n\n\"There will still need to be patience around a diagnostic assessment,\" Dr Aust said.\n\n\"It's not going to be a case of booking the 15-minute appointment and coming in and walking out with a diagnosis — it will still take time and patience, and we may need to try a few things before we get it right.\n\n\"But I do think being able to access regular care with your GP is a really positive step.\"\n\nPotential patients have been warned not to expect an ADHD diagnosis within a 15-minute GP appointment. (ABC News: Luke Stephenson)\n\nPilot age limit not yet clear\n\nThere will be an age limit for patients being seen as part of the pilot, with Dr Cidoni still to decide whether 18 or 26 is the most appropriate option.\n\nDr Bland said she would urge him to extend the age to 26.\n\n\"A lot of paediatricians are looking after children after the age of 18 because there is no one to transition their care over to,\" Dr Bland said.\n\n\"Usually by the time they're an adult, they're on a very stable dose, they've got a very good support around them, they know when they need to speak to their therapist, they know when they need to adjust their dose.\n\n\"And if anything, it's slightly more simple diagnosing past that age, so that would be a group I think would benefit greatly from seeing their GP.\"\n\nDr Kim Bland believes the patient age limit for the pilot program should be 26. (ABC News: Adam Kennedy)\n\nDr Aust agreed, adding she had seen a growing gap in care for patients aged between 16 and 24.\n\n\"Often, young people who have been diagnosed when they were in primary school, they may have been lost to follow-up for a long period of time and we don't have access to their previous diagnostic records,\" she said.\n\n\"And in those cases, it's both challenging and expensive to have those assessments.\n\n\"We really find that they run into trouble as they get into the workplace or they're attending university, and that's a group that I would really love to see supported.\"\n\nBoth doctors agreed that it should be a question of complexity, not age, but acknowledged the pilot program had to start with some parameters in place.\n\nDeraine Jackson says school would have been a completely different experience for Phoebe if they'd had access to a diagnosis sooner. (ABC News: Ian Cutmore)\n\nWhen Ms Jackson considers how Phoebe's experience could have been different had their diagnosis come from a general practitioner, she is brought to tears.\n\n\"If we'd been able to go to a GP and they could have done tests the moment the anxiety and depression started, it would have been a totally different journey,\" Ms Jackson said.\n\n\"School would have been a completely different experience for Phoebe, I would have parented differently — so much would have been different.\n\n\"And it would have been so much more affordable. The cost is a really big impact — it is costing thousands of dollars out-of-pocket for these specialist appointments.\n\n\"It's obviously too late for us, but maybe there's a little undiagnosed girl in Year 7 who can be picked up by her GP and find life a much easier journey as a result.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-17/tour-de-france-pogacar-crashes-protester-mars-stage-11-finish/105540540",
        "title": "Pogačar crashes before anti-Israel protester disrupts TDF stage finale",
        "publish_date": "Wed, 16 Jul 2025 21:00:29 +0000",
        "category": "sports",
        "authors": [],
        "text": "Defending champion Tadej Pogačar has been involved in a crash at the Tour de France, moments before a protester disrupted the sprint finish where Norway's Jonas Abrahamsen claimed his first stage victory.\n\nPogačar went down about 5 kilometres from the finish line in stage 11 after touching wheels with another rider.\n\nHe quickly remounted and the peloton eased off to allow the overall race favourite to rejoin.\n\nPogačar thanked the group after crossing the finish line apparently unhurt and without losing time.\n\n\"I'm quite OK, a bit beaten up, but we've been through worse days, so it's been a hectic day actually from start to finish,\" the UAE Team Emirates-XRG leader told reporters.\n\n\"In the end, I had a little bit of a crash, and thanks to the peloton in front, they actually waited. Obviously the race was more or less over back there but, still, they could have taken time.\n\n\"Really big respect to everybody in front. Thanks for your support, guys.\"\n\nTadej Pogačar was able to finish the stage following his crash. (Getty Images: Christophe Petit Tesson)\n\nTeam doctor Adrian Rotunno said Pogačar had been cleared to continue the race.\n\n\"After a full examination post-stage, fortunately Tadej suffered no serious injury,\" Dr Rotunno said.\n\n\"No concussion or fractures. He has some general bruising, and abrasions to his left forearm and hip, but is otherwise OK.\"\n\nIreland's Ben Healy, who retained the overall leader's yellow jersey, explained he had a brief chat with two-time Tour champion Jonas Vingegaard, seen as Pogačar's main rival for the title, and both agreed they should wait for the Slovenian.\n\nProtester mars stage finish\n\nAs the stage reached its dramatic conclusion, a protester wearing a T-shirt reading \"Israel out of the Tour\" and waving a Palestinian keffiyeh scarf ran onto the final straight, less than 25 metres from the line.\n\nHe was swiftly tackled by a security officer as Abrahamsen edged out Swiss national champion Mauro Schmid in a two-man sprint for the win.\n\n\"I broke my collarbone four weeks ago. I cried at the hospital because I thought I wouldn't make it to the Tour de France,\" Abrahamsen said.\n\n\"I hoped and every day I did everything I could to come back. To stand here in the Tour de France and have won a stage is amazing.\"\n\nTour organisers declined to comment on the protest, which came amid rising tensions over Israel's military operations in Gaza.\n\nJonas Abrahamsen claimed his first Tour de France stage win. (Getty Images: Dario Belingheri)\n\nThe day began at a blistering pace, with a five-man breakaway quickly forming ahead of a second group featuring classics specialists Mathieu van der Poel and Wout van Aert.\n\nThe peloton eventually backed off, allowing the front of the race to shape the outcome.\n\nOn the punishing final climb, Abrahamsen and Schmid emerged at the front. Van der Poel launched a fierce pursuit but fell short.\n\nThe focus now shifts to stage 12, which brings the Tour's first high-mountain showdown with a summit finish on the legendary Hautacam.\n\nAll eyes will be on Pogačar the day after his crash.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-07-17/paul-gallen-beats-sonny-bill-williams-in-heavyweight-boxing/105540518",
        "title": "Gallen wins points verdict in hyped fight with SBW",
        "publish_date": "Wed, 16 Jul 2025 20:43:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "Paul Gallen has scored a split-points win over Sonny Bill Williams in their long-awaited heavyweight boxing bout in Sydney.\n\nTwo judges scored the bout 77-74 and 76-75 in favour of Gallen, while a third had Williams winning 77-74 in Wednesday evening's relatively tame affair.\n\nAfter all the spite and verbal barbs landed over the previous decade, the fight simply did not hit the heights as both Gallen and Williams laboured, working to their traditional strengths.\n\nNRL premiership-winning captain Gallen (15-3-1, 8 KOs) attempted to put pressure on from the start, while dual international Williams, who is 12 centimetres taller than his opponent, utilised his jab and movement.\n\nWilliams tried to thwart Gallen's charges by holding and clinching, and was deducted a point by referee Les Fear In the seventh round.\n\nHe was not interviewed in the ring after the fight and declined to attend the post-fight media conference.\n\nSonny Bill Williams (right) lands a blow on Paul Gallen during their bout. (AAP: Dan Himbrechts)\n\n\"I got the win. That's all that matters and it will be there forever,\" said Gallen, who revealed he had come down with COVID-19 two weeks before the bout.\n\n\"I'm 44 years old in less than a month's time.\n\n\"Sonny just came upon to me and said he wants to have a coffee man-to-man and I'm on for that.\n\n\"I've finished my fights. I'm getting with my life.\n\n\"I'm not going to gloat. It's been a long time coming. I got the job done and that's all that matters,\" he added.\n\nWith his father and former world champion Anthony Mundine in his corner, 25-year-old super middleweight Rahim Mundine (2-0, 1 KO) stopped Fijian opponent Joe Vatusaqata (1-5-1, 1 KO) in the second round of their bout on the undercard.\n\nHeavyweight Alex Leapai Jr improved to 5-0-1 (4 KOs) with a first-round knockout of Herve Silu Mata 3-4 (2 KOs).\n\nLeapai's father, also named Alex, unsuccessfully challenged former IBF, IBO and WBO heavyweight world champion Wladimir Klitschko in 2014.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/this-melbourne-creek-has-turned-bright-blue-and-a-big-build-project-is-to-blame-20250717-p5mfj9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "This Melbourne creek has turned bright blue – and a Big Build project is to blame",
        "publish_date": "Thu, 17 Jul 2025 12:19:47 +1000",
        "category": "finance",
        "authors": [
            "Hannah Hammoud",
            "Alexander Darling"
        ],
        "text": "A creek in Melbourne’s north-east turned bright blue after a construction chemical from the North East Link swept into its waters this week.\n\nThe Environment Protection Authority Victoria (EPA) is investigating the discolouration in the Banyule Creek near McCrae Road in Rosanna following a complaint of pollution.\n\nWater in Banyule Creek has turned bright blue. Credit: Eddie Jim\n\nFootage from Wednesday afternoon shows the water’s fluorescent blue hue. A dust suppressant on the North East Link Project (NELP) has been blamed for the bizarre colour.\n\n“NELP is cleaning up the drain and EPA will monitor the project, which will now assess how to ensure such incidents are not repeated,” the EPA said in a statement.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/expert-cannot-believe-womans-30-op-shop-find-20250717-p5mfo0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Expert cannot believe woman's $30 op shop find",
        "publish_date": "Thu, 17 Jul 2025 12:17:58 +1000",
        "category": "finance",
        "authors": [],
        "text": "Expert cannot believe woman's $30 op shop find\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/controversial-send-off-in-nrlw-nrlw-weekly-episode-3-20250717-p5mfnw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Controversial send-off in NRLW: NRLW Weekly - Episode 3",
        "publish_date": "Thu, 17 Jul 2025 12:17:46 +1000",
        "category": "finance",
        "authors": [],
        "text": "Controversial send-off in NRLW: NRLW Weekly - Episode 3\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/the-afl-s-flawed-fixture-needs-repair-here-s-the-solution-20250717-p5mfjs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The AFL’s flawed fixture needs repair. Here’s the solution",
        "publish_date": "Thu, 17 Jul 2025 12:10:59 +1000",
        "category": "sports",
        "authors": [
            "Jake Niall"
        ],
        "text": "That’s three top-eight teams, two of the bottom three, plus Port. Crucially, the Crows have their tougher opponents – the Suns, Hawks and Pies – all at Adelaide Oval. Assuming they maintain form, there’s a fair chance the Crows, who have 12 wins, will finish top two; certainly, they have better prospects, based on their final six games, of winning 17 games than the Lions (who have 12½).\n\nThe problem The Lions’ tough run home wouldn’t be unjust if it was the result of fixturing swings and roundabouts, and it’s true that Geelong have already played and beaten Collingwood, Adelaide, Gold Coast, Hawthorn and Fremantle – the Cats, to a degree, did the harder yards early.\n\nThe primary cause of the fixturing disparity is the double-up games, which have grown from five to six since the introduction of Gather Round. They are allocated with a model that was always flawed, based on a division of the top six, middle six and bottom six. The Lions have been fixtured to play these teams twice this year: Collingwood, Geelong, Hawthorn, the Bulldogs, Gold Coast and the Swans; thus, they were given three teams from last year’s top six (Swans, Cats, Hawks), two from the middle (Dogs and Collingwood) and one from the bottom six, (the Suns as the local rival). Geelong, who finished third last year, were allocated the Lions, GWS and Port Adelaide as their top-six trio for two meetings, were gifted Essendon and St Kilda from the middle-six tier, and – inexplicably – Richmond from the six bottom. The best reflection of how the fixture has treated the Lions much worse is this: Geelong have lost twice to the Lions already, and twice to GWS, yet have at least an even money chance of finishing higher than the 2024 premiers.\n\nLoading Did everyone know that St Kilda and Essendon would be bottom six this year? Certainly, no one of sound mind had either team in their final eight. Those clubs’ decisions to extend their senior coach’s contracts this year underscored that they knew they were still mired in rebuild. Collingwood, for various reasons, finished ninth last year and are counted as “middle third” in the fixturing, despite winning the 2023 flag. They are a much harder ask for double-ups than Port Adelaide, who were fourth last year. Adelaide, meanwhile, are the beneficiary of a poor 2024 season, in which they fell from ninth – deprived of a finals berth by a goal umpiring blunder in 2023 – to the bottom six. Consequently, the Crows were handed the largesse of repeat encounters with West Coast and North Melbourne. The Crows could win the premiership this year after finishing 15th. As with Richmond in 2017 (premiers) and Collingwood in 2018 (lost the grand final by five points), they are gaining impetus from a previous poor season, which earned those clubs easier fixtures and momentum.\n\nThis year, there is a massive gap between getting the bottom three of 2024, compared to two games against Adelaide and Gold Coast.\n\nThe solution? The competition is already equalised by the draft, salary cap and soft cap. It is this column’s unequivocal view that the fixture should not be a tool for equalisation. It is supposed to be a competition, after all, and there is little point talking about “integrity” if the fixture is a handicap. Ideally, the top team, such as the Lions, ought to have a schedule that is no more taxing than the previous year’s wooden spooner (Richmond).\n\nThis, as clubs know, is nigh impossible to achieve and, in fairness to Geelong, they were allocated repeat games against three teams from the 2024 top six – it’s just that one of the teams, Port, didn’t cut the mustard, and their middle six double-ups were poorer performers. The clubs contribute to the unfair fixturing since their desire to generate dollars and interest in games is afforded a higher priority than a level playing field. The fixture is primarily predicated on the AFL as an entertainment product. One way to create a fairer system is to divide the double-up games into six groups, based on the previous year’s ladder, and ensure that every team is fixtured to play just one team from that one sixth of the ladder. So, everyone would get one of Richmond, North and West Coast twice, but no team would get two repeat meetings with the bottom three.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/why-are-x-and-the-esafety-commissioner-back-in-court-20250717-p5mfkg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why are X and the eSafety Commissioner back in court?",
        "publish_date": "Thu, 17 Jul 2025 12:08:09 +1000",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "Australia’s online safety watchdog is back in court this week, battling Elon Musk’s X over issues of AI, free speech and who is ultimately responsible for detecting and removing violent online content.\n\nWhat is Grok AI, and why has it been controversial?\n\nElon Musk’s AI chatbot, dubbed Grok, is embedded in X (formerly Twitter) and has made headlines for numerous controversies – as well as for winning a $US200 million ($300 million) contract with the Pentagon. It’s arguably more capable at present than ChatGPT and Gemini, but has proven much more unpredictable too.\n\nLast week, Grok declared itself a super-Nazi, referring to itself as “MechaHitler”, and made racist, sexist and antisemitic posts that its parent company, xAI, later deleted. Musk has said he wants Grok to “not shy away from making claims which are politically incorrect”, and this seems to be the result.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/unemployment-lifts-to-near-four-year-high-20250717-p5mfnb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Unemployment lifts to near-four-year high",
        "publish_date": "Thu, 17 Jul 2025 12:03:46 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "The Reserve Bank has been given a warning about the state of the economy by the jobless rate climbing to its highest level since the end of the COVID pandemic.\n\nThe Australian Bureau of Statistics this morning reported unemployment lifted by 0.2 percentage points to 4.3 per cent in June.\n\nIt is the highest unemployment rate since November 2021. To two decimal points, it was the fourth successive month that the jobless rate increased.\n\nThere was a 34,000 increase in the number of people out of work, while the total number of people increased by just 2000.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/dan-died-six-weeks-after-our-wedding-i-had-no-idea-he-was-struggling-20250627-p5matw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dan died six weeks after our wedding. I had no idea he was struggling",
        "publish_date": "Thu, 17 Jul 2025 12:00:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Dilvin Yasa"
        ],
        "text": "Three years after I lost Dan, I met Nick, a wonderful man who made space for the love I still have for my first husband. In the years that followed, we had our sons (now seven and five), but this isn’t about a finish line or about equating happiness with finding love. It’s about how you learn to live with the grief. For me, that means keeping Dan’s photos around the house (the boys refer to him as ‘Uncle Dan’) and keeping his memory central to the work that I do. It wasn’t the life I planned, but it’s a beautiful one.” ‘We didn’t have the tough conversations’: Melissa Reader, 50 “Mauro was this gentle giant with beautiful corkscrew curls, but he was also full of personality without a hint of arrogance. We met in a dingy Darlinghurst [Sydney] bar in ’97 and moved through all the major milestones quickly over the next few years. We started a business, got married, bought property and had three beautiful babies. With three kids under seven, life was busy, but it was wonderful. Melissa Reader wishes she and her late husband, Mauro, had more “tough” conversations before he died. Credit: It was only after our youngest was born that I realised Mauro wasn’t quite his usual self. He’d been complaining of constantly feeling unwell, but by the time he finally got around to getting things checked out, an ultrasound revealed a significant tumour in his kidney – advanced renal cancer. While Mauro went into treatment, I dived headfirst into logistics, juggling being the sole income earner with taking care of our children, but also remaining Mauro’s wife and caregiver. I spent that first year of his 15-month battle lying awake at night, gripped with fear. It seems so obvious now that he was dying, but your brain plays tricks on you to allow you to cope.\n\nMauro died in intensive care during one of his many admissions over the final months. I don’t remember much from that period – I was barely coping – but I remember thinking how sad it was that his death was so clinical, and how we never found the strength to have those difficult conversations like, ‘How are you going to raise the children without me?’, and, ‘How will you organise the finances after I’m gone?’ Loading It was a couple of years after Mauro’s death that I saw an opportunity to create Violet, a tech-enabled initiative that helps families talk about, plan for and manage the last chapters of life. At the same time, I met a wonderful man, Mark, who swooped in to love and care for a young family dealing with grief and trauma. I’m a much braver person as a result of what I went through with Mauro – I take bigger risks, and I’m far more decisive – but to be able to work on a legacy piece for Mauro? What a gift, and if I can help others navigate this space a little easier, well, that’s even better.” ‘It was like someone took our world’: Mitch Gibson, 61 “I met Mark online and what was supposed to be a quick drink turned into seven dates in seven days. Mark was instantly likeable and we both knew straight away that this could be the start of something. We ended up having 17 years together, with Mark pouring his creative energy into producing theatre, a comedy festival and countless events in the arts and corporate sectors, while I ran my own yoga studio.\n\nMark was only 52 when he was diagnosed with pancreatic cancer in 2018. Although he’d experienced some niggly back pain for some time, nothing could have prepared us for the phone call that basically said, ‘It’s stage four; unfortunately you’re not a candidate for surgery, good luck with everything.’ It was like someone took our world, turned it upside down and shook it violently. I was already bearing the load of taking care of my elderly parents, and as Mark grew sicker, I had to sell my yoga studio. I just couldn’t be everywhere at once. Mitch Reader lost her husband to cancer after 17 years together. Credit: The grief that hit me when Mark died in 2021 was staggering. Throughout his illness, I’d been receiving psych support at Chris O’Brien Lifehouse [in Sydney]; after his death it took me a year to find the right grief support. That year, alone in lockdown with this fresh grief, was brutal. I longed to speak with someone who’d been through grief and really understood the isolation and disorientation. My friends did what they could to be there for me emotionally, though I still felt isolated within my grief. It’s impossible to comprehend what you go through without lived experience. Curiously, while loved ones try to lift you out of your grief and this pain, a huge part of you wants to stay immersed in it; it’s our connection to our lost person. My decision to become a counsellor specialising in grief and bereavement and caregiving felt purposeful after Mark’s death. I know what it’s like to be a carer at capacity and exhausted, and I know what it’s like when you’ve lost your person – and you’d trade anything to revert to being at capacity and exhausted. Whenever I meet a new client, I can talk with them about what’s happening with their person, discuss their main concerns and priorities, and get them moving forward rather than just spinning. Having been through it myself, I now understand you can never underestimate the importance of an experienced, empathetic ear and a guiding hand.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/out-for-blood-trump-s-witch-hunt-could-trigger-financial-chaos-20250717-p5mfk9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Out for blood: Trump’s reckless witch hunt could trigger financial chaos",
        "publish_date": "Thu, 17 Jul 2025 11:59:05 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Even changes to the design to reduce costs – the Fed has removed some of the more ostentatious features of the original design – are being seized on by Republicans as evidence of unethical behaviour because what’s being built is different to what Powell told Congress would be built. The faux angst about the management of the project is clearly a pretext. A recent US Supreme Court ruling made it clear that, unlike other government agencies, where Trump’s authority to sack leaders and staff has been upheld, the Fed is different. Its chair can’t be removed without cause. Trump is criticising Federal Reserve chair Jerome Powell over the refurbishment of the Marriner S. Eccles Federal Reserve building in Washington, DC. Credit: Bloomberg Trump wanted to sack Powell during his first term, but discovered then that he didn’t have that power. As is now the case, he clashed with Powell over the Fed’s unwillingness to cut interest rates. He’s been repeatedly calling for a three percentage point reduction in the federal funds rate (equivalent to the Reserve Bank’s cash rate), even though the US inflation rate is well above the Fed’s 2 per cent target, at 2.7 per cent, and rising because of Trump’s tariffs.\n\nAfter three 25 basis point cuts last year, the Fed has left the target range for its policy rate at 4.25 to 4.5 per cent while it waits to see the full effects on inflation of Trump’s barrage of tariffs. Trump may say that it’s unlikely that he will fire Powell (while waving around a draft dismissal letter and canvassing congressmen and women for their opinions), but he’s clearly fishing for grounds to do so. Powell has been adamant that he’s going nowhere before his term as chair ends in May next year. The first inkling of what transpired within the White House on Tuesday came via a post on X by Republican congresswoman, Anna Luna, who was at the meeting. She posted, on Tuesday, that she was “hearing that Jerome Powell is getting fired. From a very serious source.”\n\nThe rumours that an attempt to sack Powell might be underway rattled markets, with the sharemarket, longer-term bond prices and the US dollar all falling on Wednesday before recovering some of their ground after Trump’s comments. That provides a directional insight into what might happen if Trump were to move against Powell – or replace him next year with someone clearly prepared to do what Trump wants. Most of the small group of those auditioning for the role, all Trump loyalists, are signalling (naturally, if they really want his endorsement) that they want lower rates. Trump’s antics regarding Powell have markets on edge. Credit: AP On Wednesday, the sharemarket fell nearly a full percentage point before closing down 0.3 per cent for the day. The yields on short-term bonds fell, but those on longer-term bonds rose. Credit spreads widened. The US dollar weakened almost one percentage point against the currencies of America’s major trading partners. That’s a modest preview of what might be in store if Trump were to succeed in installing a loyalist in the Fed’s chair.\n\nLowering rates while inflation is rising within a full-employment environment would be reckless policy, risking inflation. While sharemarket investors might like lower interest rates, and short-term bond yields would reflect a lower-rate environment, the increased inflation risk and the risk of stagflation would see longer-term bondholders demanding increased compensation for their longer exposure to those risks. Loading Trump and his advisers don’t appear to appreciate the potential consequences of trying to replace Powell with a “yes man.” (All those being touted as chair are male). The markets trust the Fed to be independent of politics and political cycles, focusing purely on its twin mandate of price stability (controling inflation) and maximising employment. If that independence is threatened – if they think Trump or some future president can dictate monetary policies – there will be a scramble to exit financial markets. The dollar will dive, the sharemarket will fall and the yield curve will steepen significantly, with the yields on long-term bonds rising even as those on short-term securities fall. It is, given precedents elsewhere (Turkey and Hungary come to mind), likely that America’s credit rating, once AAA, would be lowered again.\n\nThe Fed can provide the anchor for the yield curve and influence short-term rates, but market participants, a substantial proportion of them foreign, determine the shape of the yield curve and how much extra yield they want for the risk of holding bonds for five, or 10, or 30 years. Even a perception that the Fed’s independence had been compromised would probably result in a significantly steeper yield curve – and higher interest rate on consumer and corporate debt. The market establishes those rates, not the Fed. The other problem for Trump is he tries to politicise the Fed and its decision-making is that there is no guarantee that a new chair would be able to impact rate decisions. Trump wanted to sack Powell during his first term, but discovered then that he didn’t have that power. There are 12 members of the Open Market Committee that makes those decisions, so the chair – and the committee elects its own chair, which would be different, if they wished, to the chair of the board of governors – would have to convince a majority of them to do what he and/or Trump wants.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/first-look-this-greek-newcomer-in-south-melbourne-cranks-up-the-creativity-20250715-p5mf57.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First look: This Greek newcomer in South Melbourne cranks up the creativity",
        "publish_date": "Thu, 17 Jul 2025 11:57:50 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Advertisement\n\nEating outJust open First look: This Greek newcomer in South Melbourne cranks up the creativity Humble Greek cooking is having a moment. But at Aegli, a Greek-born chef with experience in Michelin-starred kitchens is remixing dishes from his homeland in unexpected ways. Tomas Telegramma July 17, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nWaves of Greek migration over the past century have brought with them a cuisine and culture that’s now firmly embedded in the fabric of our city. Right now, a soaring number of new restaurants – chief among them Kafeneion – have trained the spotlight on Greek comfort food. Aegli chef Ioannis Kasidokostas with his wife and business partner Maria Tsilfoglou. Wayne Taylor South Melbourne newcomer Aegli is taking a different tack. Traditional Greek recipes are a jumping-off point for dishes that’ll make you say, ‘what is this?’ says chef Ioannis Kasidokostas, who runs Aegli with his wife Maria Tsilfoglou. The pair have taken over the former Lume site in Coventry Street, dormant since that fine diner went into liquidation in 2023. Kasidokostas grew up in Athens, cutting his teeth at Michelin-starred fine diners including the longstanding Spondi, where high-end, high-concept cooking is king. “I’ve seen a glory you don’t see in tavernas [which serve] simple things like meatballs and horta,” he says. He wants to bring that glory to Melbourne.\n\nAdvertisement\n\nWhere the couple’s first restaurant, Sowl in Carnegie, is broadly Mediterranean, the 100-seat Aegli serves dishes you’d find in Greece, executed in ways you might not expect. “It’s not fine dining – or [fine-dining] prices,” says Kasidokostas. “But it is fine food.” Magiritsa is a lamb offal soup usually eaten at Easter time, which the chef has remixed with “offal of the land” – mushrooms. He combines the best Victorian-grown varieties he can find with truffles from Meteora, a mountainous part of Greece. 1 / 5 Magiritsta soup made with Victorian-grown mushrooms and truffles from Meteora in Greece. Wayne Taylor 2 / 5 Youvarlakia, a soup made with rice and fish. Wayne Taylor 3 / 5 Inside Aegli’s casual South Melbourne dining room. Wayne Taylor 4 / 5 The “bougatsa” dessert, combining fried dough, custard and walnuts. Wayne Taylor 5 / 5 Baked cheese with sour cherry and caper relish. Wayne Taylor Previous Slide Next Slide Another soup he’s riffing on is youvarlakia, traditionally bobbing with meatballs made of beef or pork. His seafood spin currently features Corner Inlet snapper minced in-house, rolled into orbs and slowly poached in a rich fish stock.\n\nAdvertisement\n\nExtra care and consideration are given to staples such as bread and cheese. Slow-proved spelt rolls arrive warm, while house-made anthotyro cheese is double-baked to order and served with a relish of sour cherry and capers. Familiar Greek favourites also dot the menu, from taramasalata to brined and slow-roasted lamb shoulder accompanied by house-made tzatziki. Twists on classic desserts include the orange and filo cake portokalopita, served with an ice-cream of anthotyro cheese and olive oil. A melding of bougatsa and diples – fried, honey-dipped sheets of dough – results in a hybrid dish akin to millefeuille. Related Article Melbourne’s Greek wave builds with this sunny new taverna (plus three more to try) Cocktails are just as much a love letter to Greece. A spritz stars kumquat-infused vermouth from Corfu and the margarita is perfumed with aniseed from tsipouro. The wine list balances Greek imports, such as bone-dry Santorini assyrtiko, with Australian bottles.\n\nAdvertisement\n\nAnyone who dined at Lume will notice most of its warm-toned fitout has been retained, from the timber floorboards to the round tables and glass-roofed atrium out back. But there have been some changes. Lemon and lime trees add a Mediterranean tone to the red-brick frontage; some internal walls have been repainted in more neutral colours; and new hanging light fixtures cast a warmer glow at night. Dinner Tue-Sun 226 Coventry Street, South Melbourne, aegli.melbourne\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/prince-harry-walks-in-mother-princess-dianas-footsteps-20250717-p5mfnj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince Harry walks in mother Princess Diana's footsteps",
        "publish_date": "Thu, 17 Jul 2025 11:57:36 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince Harry walks in mother Princess Diana's footsteps\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/syrian-news-anchor-takes-cover-during-israel-strike-20250717-p5mfnp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Syrian news anchor takes cover during Israel strike",
        "publish_date": "Thu, 17 Jul 2025 11:57:35 +1000",
        "category": "finance",
        "authors": [],
        "text": "Syrian news anchor takes cover during Israel strike\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/the-wait-is-over-here-s-your-first-look-at-the-final-season-of-stranger-things-20250717-p5mfke.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The wait is over. Here’s your first look at the final season of Stranger Things",
        "publish_date": "Thu, 17 Jul 2025 11:56:33 +1000",
        "category": "entertainment",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Almost a decade ago, little Will Byers (Noah Schnapp) disappeared into a parallel dimension called the Upside Down. Since then, he and his friends have embarked on a string of dangerous adventures, battling a litany of supernatural monsters – as well as a school bully or two – and protecting their small town of Hawkins.\n\nNow, their adventures are about to end.\n\nStranger Things is coming to a close. Or is it? Credit: Netflix\n\nNetflix released the first teaser trailer for the fifth and final season of its hit series Stranger Things on Thursday morning, offering a glimpse into the decimated town and a looming final battle against the big bad Vecna. This has been a long time coming; the previous season landed in May 2022, but production on season five only began in 2024.\n\nSo, what can we expect from Stranger Things’ last chapter, and why has it taken so long to get here?",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-albanese-to-conclude-china-visit-in-chengdu-trump-dumps-maga-supporters-over-epstein-fallout-20250717-p5mfj4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Albanese to conclude China visit in Chengdu; Trump dumps MAGA supporters over Epstein fallout",
        "publish_date": "Thu, 17 Jul 2025 11:53:30 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "A cockpit recording of dialogue between the two pilots of the Air India flight that crashed last month indicates the captain cut the flow of fuel to the plane’s engines, The Wall Street Journal reported on Wednesday.\n\nThe newspaper cited people familiar with US officials’ early assessment of evidence uncovered in the investigation into the June 12 crash in Ahmedabad, India, that killed 260 people.\n\nThe first officer, who was flying the Boeing 787 Dreamliner, asked the more experienced captain why he moved the fuel switches to the “cutoff” position seconds after lifting off the runway, the report said.\n\nInvestigative officials stand at the site of Air India Boeing 787 which crashed last month in Ahmedabad, India. Credit: Getty Images\n\nThe two pilots involved were Captain Sumeet Sabharwal and First Officer Clive Kunder, who had total flying experience of 15,638 hours and 3403 hours, respectively.\n\nIndia’s AAIB, Directorate General of Civil Aviation, Ministry of Civil Aviation, Boeing and Air India did not immediately respond to Reuters’ requests for comment on The Wall Street Journal report.\n\nA preliminary report into the crash released by India’s Aircraft Accident Investigation Bureau (AAIB) on Saturday said the fuel switches had switched from run to cutoff a second apart just after take-off, but it did not say how they were flipped.\n\nLoading\n\nOne pilot was then heard on the cockpit voice recorder asking the other why he cut off the fuel. “The other pilot responded that he did not do so,” the report said.\n\nWithout fuel flowing to the engines, the London-bound plane began to lose thrust and sink. Almost immediately after the plane lifted off the ground, closed-circuit TV footage showed a back-up energy source called a ram air turbine had deployed, indicating a loss of power from the engines.\n\nAt the crash site, both fuel switches were found in the run position and there had been indications of both engines relighting before the low-altitude crash, the report said. In an internal memo on Monday, Air India chief executive Campbell Wilson said the preliminary report found no mechanical or maintenance faults and that all required maintenance had been carried out.\n\nThe AAIB’s preliminary report had no safety recommendations for Boeing or engine manufacturer GE. After the report was released, the US Federal Aviation Administration and Boeing privately issued notifications that the fuel switch locks on Boeing planes are safe, a document seen by Reuters showed and four sources with knowledge of the matter said.\n\nReuters",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/timelapse-of-hornet-plane-being-installed-20250717-p5mfm8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Timelapse of Hornet plane being installed",
        "publish_date": "Thu, 17 Jul 2025 11:47:46 +1000",
        "category": "finance",
        "authors": [],
        "text": "Timelapse of Hornet plane being installed\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/tuivasa-sheck-s-manager-confirms-r360-discussions-issues-nrl-with-ponga-warning-20250717-p5mflv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tuivasa-Sheck’s manager confirms R360 discussions",
        "publish_date": "Thu, 17 Jul 2025 11:46:54 +1000",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "The competition is yet to get off the ground and needs to hit three major triggers to secure the private equity and reported Saudi-Arabian funding to turn it into a reality. The first trigger is to have the franchises purchased and legally drafted. The second requires the confirmation of a broadcast partner, while the third element of the deal requires competition organisers to secure 200 players. All three targets must be reached by the end of September. Roger Tuivasa Sheck playing for the All Blacks in 2022. Credit: AP Sources with knowledge of the situation, talking on the condition of anonymity due to confidentiality agreements, said that there were close to 140 players committed to the competition. While Ponga hasn’t been directly linked to R360, he has engaged New Zealand-based rugby union agent Kent Hale from Halo Sport to explore his options in the 15-man game.\n\nSharrock said the concept is a threat to the NRL with top-line players expected to earn US$2 million (A$3.1 million) per year. It’s more than double what Ponga is earning ($1.4 million) in 2025 as the highest-paid player in the NRL. Kalyn Ponga is out injured for the remainder of the year. Credit: Getty Images “I think it’s something the NRL should be worried about with their dual-code players who would be capable of playing both codes at a high level,” he said. “They’re really looking at rugby players. Roger has appeal because he’s already been a dual-coder. I think there’s some rugby league players that could do it, and Kalyn Ponga is one of them. There’ll be rugby league players who have attraction, but they won’t have the eyes of the greater global rugby market.\n\n“Let’s face it, in France - where there is a huge rugby audience - who’s Kalyn Ponga? He’s known down here, but he’s not known up there. The audience that are buying in are in the United States and Europe. In saying that, he will be a bloody good target. The money is significant.” While rugby traditionalists and existing bodies and teams are opposed to the idea of the rebel competition, Sharrock has implored the game to rethink its future. “It’s something rugby should really open its eyes to,” Sharrock said. “If it does become something real, they need to all get around the table and reimagine what rugby union could look like globally. That’s where I do see, not the threat, but the opportunity. If someone is willing to invest a lot of money into the game to re-energise it and reinvigorate it, I personally would be getting on the back of it and work out how to capitalise on it.”\n\nTuivasa-Sheck’s brother, Johnny, was only made aware of a potential code switch after being shown this masthead’s report. “Oh, that’s crazy, that’s buzzing. Honestly, I’m surprised. When he was playing rugby he was so keen to come back to the ’Wahs, if you watch him he likes that aggression, he likes to run it hard,” said Johnny, a media personality who was capturing content for Stan at the Paul Gallen-Sonny Bill Williams fight. “Going back to rugby is a massive shock to me, but he will kill it.” Former England rugby international Mike Tindall is the public face of R360. Tindall, who is married to British royal family member Zara Phillips, is in Australia to watch the British and Irish Lions tour. Loading\n\nThe R360 concept will follow a hybrid model of Formula 1 and the Indian Premier League, with private owners to invest in franchises around the world. The players who sign with R360 aren’t signing for specific franchises but rather the competition itself, with the potential for auctions and drafts being floated. One model being discussed will see a joint Australia and New Zealand-based franchise as well as teams based in the United States, France, England, South America, Asia and South Africa in an eight-team competition that could grow to 12 teams. Competition organisers want to launch a one-off tournament next season, potentially from July to September, before adopting a regular format in 2027. The intended format in 2027 will see the competition split into two blocks, with the first half of the tournament played between March and May and the second stage played between September and December. That window is largely in competition with the NRL, which currently runs from March to October.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tour-de-france-abrahamsen-wins-stage-11-pogacar-crashes-and-anti-israel-activist-arrested/zijrjyegk",
        "title": "Tour de France: Abrahamsen wins stage 11, Pogačar crashes and anti-Israel activist arrested",
        "publish_date": "Wed, 16 Jul 2025 20:29:55 +0000",
        "category": "sports",
        "authors": [],
        "text": "Norway's Jonas Abrahamsen has won stage 11 of the Tour de France in Toulouse, while defending champion Tadej Pogačar emerged largely unscathed despite crashing 4km from the finish line.\n\n\n\n\n\nPogačar fell after hitting the back wheel of another rider, but his rivals Jonas Vingegaard and Remco Evenepoel sportingly waited for the Slovenian to catch up after he got back on his bike.\n\n\n\n\n\nIreland's Ben Healy retained the leader's jersey.\n\n\n\n\n\nPogačar sheepishly laughed off the tumble.\n\n\n\n\n\n\"I'm a bit beaten up, I've been through worse days, but yeah that was unexpected,\" he said.\n\n\n\nTadej Pogačar emerged largely unscathed from the crash, saying he was a \"bit beaten up\" but had \"been through worse days\". Source: AAP / Dirk Waem/Belga/Sipa USA He was also swift to thank his rivals. \"Big respect,\" he said of the gesture.\n\n\n\n\n\n\"The race was nearly over but I doubt I would have been able to catch up.\"\n\n\n\n\n\nPogačar said he had feared the worst when Norwegian Tobias Johannessen rode across the front of him.\n\n\n\n\n\n\"He completely cut me off. I saw my head going toward the sidewalk and I was worried I'd get hurt. Luckily I've just lost some skin,\" said the three-time champion.\n\n\n\nRider who caused crash apologises, 'terrified' of online abuse\n\nJohannessen, a Uno-X teammate of stage winner Abrahamsen, apologised for causing the crash.\n\n\n\n\n\n\"I am terribly sorry for what happened,\" he wrote on X. \"I was trying to follow a move and I can see that I was too close,\" he added.\n\n\n\n\n\n\"I made a mistake ... I hope he is as good as he can be after a crash like that.\"\n\n\n\nJohannessen also expressed his horror at the online abuse he was receiving as a result.\n\n\n\n\n\n\"I would not wish anyone the amount of threats I get in my inbox,\" he said. \"I am [terribly] sorry but also terrified of the hate from all the people. This feels very scary.\"\n\n\n\n\n\nPogačar said he felt the fall would hurt him on Thursday's mountain stage.\n\n\n\n\n\n\"We are ready as a team for Hautacam,\" he said of the main obstacle on stage 12. \"But a day after a fall like that you are never at your best.\"\n\n\n\n\n\nPogačar later received the all clear from the team doctor, who said the 26-year-old had \"suffered no serious injury\".\n\n\n\n\n\n\"He has some general bruising and abrasions to his left forearm and hip, but is otherwise okay,\" UAE's medical director Adrian Rotunno confirmed.\n\n\n\n\n\nHealy was next to Pogačar when he fell and narrowly missed coming down with him.\n\n\n\n\n\n\"I didn't see him fall. I'll be honest, I was looking somewhere else. That's possibly what happened to him,\" said the 24-year-old Healy, who took the lead at the end of stage 10 in the Massif Central.\n\n\n\n\n\nHealy retained the overall lead on his first day in the fabled yellow jersey, while Pogačar remains second at 29sec and Evenepoel third, another minute off the pace.\n\n\n\n\n\nThe peloton next heads into the Pyrenees where the first real mountains will test their legs on the legendary Hautacam climb.\n\n\n\n\n\n\"I'm not sure I'll still have the lead tomorrow night,\" said Healy. \"It's a large task but I'll fight all the way. Either way this has been a real whirlwind for me.\"\n\n\n\nThrilling cat-and-mouse duel\n\nAnyone who expected a quiet day was instead treated to a thrilling stage over 156.8km from Toulouse and back, which Abrahamsen unexpectedly won.\n\n\n\n\n\nAbrahamsen also won the combativity award as he was at the origin of the long-range breakaway that foiled the ambitions of the sprinters.\n\n\n\n\n\nAbrahamsen then contested a cat-and-mouse duel down the home straight with Swiss Mauro Schmid as the cunning Mathieu van der Poel crept up on them and finished third.\n\n\n\n\n\nThe Norwegian fractured a collarbone two weeks before the Tour.\n\n\n\n\n\n\"Thanks to the team who did everything to get me ready in time,\" said Abrahamsen. \"They are very good people and I've been here since 2017. \"I like to have pain in my legs, I've been like this since I was 15.\"\n\n\n\n\n\nFollowing Tuesday's rest day, Wednesday's run was billed as a likely sprint finish with 70 points at stake in the sprint standings in Toulouse.\n\n\n\n\n\nThe stage, however, featured five small climbs along the route, ensuring it was constantly fast and nerve-wracking.\n\n\n\n\n\nWhen Pogačar fell late on he struggled to put his chain on after sliding across several metres of tarmac.\n\n\n\n\n\nFrench climber Lenny Martinez is in the king of the mountains polka dot jersey as the race heads into the Pyrenees and will be the focus for home fans all weekend with further blockbuster crowds expected.\n\n\n\nAnti-Israel protester arrested\n\nA protester wearing a T-shirt reading \"Israel out of the Tour\" was arrested after running onto the final straight of the 11th stage.\n\n\n\n\n\nThe protester, who was also holding a Palestinian keffiyeh scarf, got past security barriers and ran towards the finish line in Toulouse as Abrahamsen won the sprint finale.\n\n\n\nThe demonstrator's T-shirt read \"Israel out of the Tour\". Source: AAP / Jasper Jacobs/Belga/Sipa USA The man was intercepted by a race staff member and arrested, the local prefecture said.\n\n\n\n\n\nSeveral police officers have been assigned to protect the Israel-Premier Tech team during the Tour. The team was set up by Israeli-Canadian billionaire Sylvan Adams, but there are no Israeli riders in this year's race.\n\n\n\n\n\nWith the Gaza war causing international controversy, last year the team said it had asked its riders not to wear jerseys with any reference to Israel while out training as a precaution.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/new-homes-are-going-up-but-some-arent-being-finished-us-inflation-reaccelerates/ql6dplw68",
        "title": "New homes are going up, but some aren't being finished & US inflation reaccelerates",
        "publish_date": "Wed, 16 Jul 2025 07:58:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/why-the-hell-did-we-drop-it-ex-treasury-head-calls-for-new-carbon-tax-and-new-measures/5vizpvk8k",
        "title": "'Why the hell did we drop it?': Ex-Treasury head calls for new carbon tax and measures",
        "publish_date": "Wed, 16 Jul 2025 05:39:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Former Treasury head Ken Henry says it \"boggles the mind\" that Australia scrapped the carbon tax, urging the Albanese government to reintroduce the tax measure.\n\n\n\n\n\nThe Australian economist was Treasury secretary from 2001 to 2011, during which time advice for the scheme, introduced by Julia Gillard in 2012, would have been prepared.\n\n\n\n\n\nAddressing the National Press Club in his capacity as chair of the Australian Climate and Biodiversity Foundation on Wednesday, Henry argued improved environmental protection laws were key to unlocking Australia's productivity as well as meeting environmental targets.\n\n\n\n\n\nNewly appointed Environment Minister Murray Watt faces the task of making Australia's nature laws fit for purpose, after changes were shelved during Labor's first term of government.\n\n\n\n\n\nAsked whether the Albanese government should use its majority government and clear mandate to reconsider the carbon tax, Henry responded enthusiastically: \"Of course we need a carbon tax.\"\n\n\n\nLISTEN TO Advocates and MPs say there's something fishy about government's environment legislation SBS News 26/03/2025 06:10 English\n\n\"What do we mean reconsider? Why the hell did we ever drop it? That's the question,\" Henry said.\n\n\n\n\n\n\"It still boggles the mind that we had the world's best carbon policy. And then, for purely political reasons, decided that we can afford to do without it.\"\n\n\n\n\n\nThe carbon tax, repealed by the Abbott government in July 2014, put a price on every tonne of pollution produced.\n\n\n\n\n\nIt hoped to incentivise businesses to adopt cleaner technologies and behaviours, otherwise forcing exporters and manufacturers to buy permits for their emissions.\n\n\n\nHenry supports raising taxes following leaked Treasury advice\n\nEarlier this week, the ABC reported leaked documents show Treasury has advised the government to raise taxes and cut spending after the election.\n\n\n\n\n\nTreasurer Jim Chalmers attempted to downplay the advice, saying the heavily redacted document had not adequately captured the government's brief, which was already being focused on.\n\n\n\n\n\n\"I'm pretty relaxed about it, to be honest, because, of course, Treasury provides advice for incoming governments and no government typically goes into the detail of that,\" Chalmers said on Tuesday.\n\n\n\n\n\nHowever, the suggestion mirrors advice by Treasury in a report published in 2010, which looked into Australian tax reform over a 10 to 20-year period, colloquially referred to as the Henry review.\n\n\n\n\"If the budget is to meet these growing spending pressures, then we've got two options. We either increase taxes, as a share of GDP, or we grow the economy faster,\" Henry told reporters.\n\n\n\n\n\nHe explained average productivity growth has slowed down from 2.31 per cent a year during the 1990s to an average of 0.98 per cent a year.\n\n\n\n\n\n\"That's a pretty fundamental difference, right. If we continue on that trajectory, as we said ... we will have no option but to raise taxes.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/could-it-be-meningococcal-australia-approaches-the-high-risk-diseases-peak-season/a1zvk3b4k",
        "title": "Could it be meningococcal? Australia approaches the high-risk disease's peak season",
        "publish_date": "Tue, 15 Jul 2025 21:30:00 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nTwo years ago, Jacob Blackwell was a fit tradesman with a love of sports - until a devastating bout of meningococcal disease turned his life upside down.\n\n\n\n\n\nWithin two days he went from feeling lethargic to experiencing delusions.\n\n\n\n\n\nIn hospital, doctors put him in an induced coma and saved his life.\n\n\n\n\n\nBut he suffered severe long-term complications, losing the ability to do even basic tasks.\n\n\n\n\n\n\"Everything I had to learn to do again, so eating, talking - back to square one. Think of it as an 18-month-old, just learning to do everything again.\"\n\n\n\n\n\nHis mother Chelsea Blackwell remembers her shock on seeing the illness take hold of her son.\n\n\n\n\n\n\"I actually couldn't comprehend what I'd seen. I opened the door, I looked and I was just like hmmm. Jacob didn't look like Jacob because his brain had already been swollen so his eyes were protruding and his skin was breaking a little bit. So they actually thought initially he had been assaulted.\"\n\n\n\n\n\nMeningococcal disease is caused by bacteria, called neisseria meningitidis, which most people carry in the back of their throat at some point in their lives.\n\n\n\n\n\nBut when that bacteria turns invasive it can enter the brain or the bloodstream, causing potentially life-threatening infection.\n\n\n\n\n\nGeneral Practitioner Dr Sam Hay says the disease can progress dangerously quickly.\n\n\n\n\n\n\"It often starts with a flu-like illness, bit of a cold, bit of a runny nose, a bit of a cough. But then it progresses, fevers and (the patient) becomes very, very sick after that. People can go downhill within 24 to 48 hours.\"\n\n\n\n\n\nAs Australia enters peak season for meningococcal, there's a national campaign ((launched Monday)) to raise awareness of the disease which primarily affects young adults and children.\n\n\n\n\n\nDoctors say the illness is on the rise, with 56 cases already reported this year - 18 of those in New South Wales.\n\n\n\n\n\nDr Sam Hay says infections can have devastating consequences.\n\n\n\n\n\n\"One in 10 people who get the invasive meningococcal can unfortunately pass away. One in five get these significant side-effects, complications, that could be brain damage, loss of limbs, hearing loss, and the list goes on.”\n\n\n\n\n\nParalympic swimmer and bronze medallist Jay Dohnt contracted meningococcal when he was in high school.\n\n\n\n\n\nAfter feeling sick and developing a rash, he went to see a GP.\n\n\n\n\n\nJust 24 hours after developing symptoms, he was in intensive care.\n\n\n\n\n\n\"The ambulance was still in precautionary mode, they didn't even put the lights on to take me to a hospital. At the hospital, it was a different story. They all met me out in the carpark, and took it very seriously. That evening (I was) hooked up to everything in the intensive care unit and given a 97 per chance of dying, or a 3 per cent chance of living. I wasn't conscious for the first two weeks, and I don't remember much from the first two months of a five-and-a-half month hospital stay. But this is essentially the end result - a bilateral knee amputee. Missing my patella (kneecap) in my left leg, lost four fingers on my right hand as well. So very life-changing for a teenager who loved sport.\"\n\n\n\n\n\nIt's these life-altering impacts that lead Karen Quick, CEO of Meningitis Centre Australia, to stress the importance of early detection, urging parents to push for answers.\n\n\n\n\n\n\"It's really important as parents that we're aware of all the signs and symptoms, that we trust our instincts and we get help straight away. Go straight to the hospital, straight to the doctor, and ask the question - could it be meningococcal?\"\n\n\n\n\n\nDr Sam Hay warns people not to wait until they have developed a rash as by then, it could be already too late.\n\n\n\n\n\n\"When it gets into the blood stream, that's when you get the septicaemia and that then goes on to the rash. But the problem is that the rash, while it is dangerous, it happens late. And if you are looking for that, things have gone too far.\"\n\n\n\n\n\nTwo years after his brush with meningococcal, Jay Blackwell is still working on his recovery.\n\n\n\n\n\nInspired by Paralympian and fellow survivor Jay, he has taken up swimming and says, despite many challenges, the future is looking bright.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/expert-cannot-believe-womans-30-op-shop-find-20250717-p5mfo0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Expert cannot believe woman's $30 op shop find",
        "publish_date": "Thu, 17 Jul 2025 12:17:58 +1000",
        "category": "finance",
        "authors": [],
        "text": "Expert cannot believe woman's $30 op shop find\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/controversial-send-off-in-nrlw-nrlw-weekly-episode-3-20250717-p5mfnw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Controversial send-off in NRLW: NRLW Weekly - Episode 3",
        "publish_date": "Thu, 17 Jul 2025 12:17:46 +1000",
        "category": "finance",
        "authors": [],
        "text": "Controversial send-off in NRLW: NRLW Weekly - Episode 3\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/the-afl-s-flawed-fixture-needs-repair-here-s-the-solution-20250717-p5mfjs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The AFL’s flawed fixture needs repair. Here’s the solution",
        "publish_date": "Thu, 17 Jul 2025 12:10:59 +1000",
        "category": "sports",
        "authors": [
            "Jake Niall"
        ],
        "text": "That’s three top-eight teams, two of the bottom three, plus Port. Crucially, the Crows have their tougher opponents – the Suns, Hawks and Pies – all at Adelaide Oval. Assuming they maintain form, there’s a fair chance the Crows, who have 12 wins, will finish top two; certainly, they have better prospects, based on their final six games, of winning 17 games than the Lions (who have 12½).\n\nThe problem The Lions’ tough run home wouldn’t be unjust if it was the result of fixturing swings and roundabouts, and it’s true that Geelong have already played and beaten Collingwood, Adelaide, Gold Coast, Hawthorn and Fremantle – the Cats, to a degree, did the harder yards early.\n\nThe primary cause of the fixturing disparity is the double-up games, which have grown from five to six since the introduction of Gather Round. They are allocated with a model that was always flawed, based on a division of the top six, middle six and bottom six. The Lions have been fixtured to play these teams twice this year: Collingwood, Geelong, Hawthorn, the Bulldogs, Gold Coast and the Swans; thus, they were given three teams from last year’s top six (Swans, Cats, Hawks), two from the middle (Dogs and Collingwood) and one from the bottom six, (the Suns as the local rival). Geelong, who finished third last year, were allocated the Lions, GWS and Port Adelaide as their top-six trio for two meetings, were gifted Essendon and St Kilda from the middle-six tier, and – inexplicably – Richmond from the six bottom. The best reflection of how the fixture has treated the Lions much worse is this: Geelong have lost twice to the Lions already, and twice to GWS, yet have at least an even money chance of finishing higher than the 2024 premiers.\n\nLoading Did everyone know that St Kilda and Essendon would be bottom six this year? Certainly, no one of sound mind had either team in their final eight. Those clubs’ decisions to extend their senior coach’s contracts this year underscored that they knew they were still mired in rebuild. Collingwood, for various reasons, finished ninth last year and are counted as “middle third” in the fixturing, despite winning the 2023 flag. They are a much harder ask for double-ups than Port Adelaide, who were fourth last year. Adelaide, meanwhile, are the beneficiary of a poor 2024 season, in which they fell from ninth – deprived of a finals berth by a goal umpiring blunder in 2023 – to the bottom six. Consequently, the Crows were handed the largesse of repeat encounters with West Coast and North Melbourne. The Crows could win the premiership this year after finishing 15th. As with Richmond in 2017 (premiers) and Collingwood in 2018 (lost the grand final by five points), they are gaining impetus from a previous poor season, which earned those clubs easier fixtures and momentum.\n\nThis year, there is a massive gap between getting the bottom three of 2024, compared to two games against Adelaide and Gold Coast.\n\nThe solution? The competition is already equalised by the draft, salary cap and soft cap. It is this column’s unequivocal view that the fixture should not be a tool for equalisation. It is supposed to be a competition, after all, and there is little point talking about “integrity” if the fixture is a handicap. Ideally, the top team, such as the Lions, ought to have a schedule that is no more taxing than the previous year’s wooden spooner (Richmond).\n\nThis, as clubs know, is nigh impossible to achieve and, in fairness to Geelong, they were allocated repeat games against three teams from the 2024 top six – it’s just that one of the teams, Port, didn’t cut the mustard, and their middle six double-ups were poorer performers. The clubs contribute to the unfair fixturing since their desire to generate dollars and interest in games is afforded a higher priority than a level playing field. The fixture is primarily predicated on the AFL as an entertainment product. One way to create a fairer system is to divide the double-up games into six groups, based on the previous year’s ladder, and ensure that every team is fixtured to play just one team from that one sixth of the ladder. So, everyone would get one of Richmond, North and West Coast twice, but no team would get two repeat meetings with the bottom three.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/technology/why-are-x-and-the-esafety-commissioner-back-in-court-20250717-p5mfkg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why are X and the eSafety Commissioner back in court?",
        "publish_date": "Thu, 17 Jul 2025 12:08:09 +1000",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "Australia’s online safety watchdog is back in court this week, battling Elon Musk’s X over issues of AI, free speech and who is ultimately responsible for detecting and removing violent online content.\n\nWhat is Grok AI, and why has it been controversial?\n\nElon Musk’s AI chatbot, dubbed Grok, is embedded in X (formerly Twitter) and has made headlines for numerous controversies – as well as for winning a $US200 million ($300 million) contract with the Pentagon. It’s arguably more capable at present than ChatGPT and Gemini, but has proven much more unpredictable too.\n\nLast week, Grok declared itself a super-Nazi, referring to itself as “MechaHitler”, and made racist, sexist and antisemitic posts that its parent company, xAI, later deleted. Musk has said he wants Grok to “not shy away from making claims which are politically incorrect”, and this seems to be the result.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/unemployment-lifts-to-near-four-year-high-20250717-p5mfnb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Unemployment lifts to near-four-year high",
        "publish_date": "Thu, 17 Jul 2025 12:03:46 +1000",
        "category": "finance",
        "authors": [
            "Shane Wright"
        ],
        "text": "The Reserve Bank has been given a warning about the state of the economy by the jobless rate climbing to its highest level since the end of the COVID pandemic.\n\nThe Australian Bureau of Statistics this morning reported unemployment lifted by 0.2 percentage points to 4.3 per cent in June.\n\nIt is the highest unemployment rate since November 2021. To two decimal points, it was the fourth successive month that the jobless rate increased.\n\nThere was a 34,000 increase in the number of people out of work, while the total number of people increased by just 2000.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/dan-died-six-weeks-after-our-wedding-i-had-no-idea-he-was-struggling-20250627-p5matw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Dan died six weeks after our wedding. I had no idea he was struggling",
        "publish_date": "Thu, 17 Jul 2025 12:00:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Dilvin Yasa"
        ],
        "text": "Three years after I lost Dan, I met Nick, a wonderful man who made space for the love I still have for my first husband. In the years that followed, we had our sons (now seven and five), but this isn’t about a finish line or about equating happiness with finding love. It’s about how you learn to live with the grief. For me, that means keeping Dan’s photos around the house (the boys refer to him as ‘Uncle Dan’) and keeping his memory central to the work that I do. It wasn’t the life I planned, but it’s a beautiful one.” ‘We didn’t have the tough conversations’: Melissa Reader, 50 “Mauro was this gentle giant with beautiful corkscrew curls, but he was also full of personality without a hint of arrogance. We met in a dingy Darlinghurst [Sydney] bar in ’97 and moved through all the major milestones quickly over the next few years. We started a business, got married, bought property and had three beautiful babies. With three kids under seven, life was busy, but it was wonderful. Melissa Reader wishes she and her late husband, Mauro, had more “tough” conversations before he died. Credit: It was only after our youngest was born that I realised Mauro wasn’t quite his usual self. He’d been complaining of constantly feeling unwell, but by the time he finally got around to getting things checked out, an ultrasound revealed a significant tumour in his kidney – advanced renal cancer. While Mauro went into treatment, I dived headfirst into logistics, juggling being the sole income earner with taking care of our children, but also remaining Mauro’s wife and caregiver. I spent that first year of his 15-month battle lying awake at night, gripped with fear. It seems so obvious now that he was dying, but your brain plays tricks on you to allow you to cope.\n\nMauro died in intensive care during one of his many admissions over the final months. I don’t remember much from that period – I was barely coping – but I remember thinking how sad it was that his death was so clinical, and how we never found the strength to have those difficult conversations like, ‘How are you going to raise the children without me?’, and, ‘How will you organise the finances after I’m gone?’ Loading It was a couple of years after Mauro’s death that I saw an opportunity to create Violet, a tech-enabled initiative that helps families talk about, plan for and manage the last chapters of life. At the same time, I met a wonderful man, Mark, who swooped in to love and care for a young family dealing with grief and trauma. I’m a much braver person as a result of what I went through with Mauro – I take bigger risks, and I’m far more decisive – but to be able to work on a legacy piece for Mauro? What a gift, and if I can help others navigate this space a little easier, well, that’s even better.” ‘It was like someone took our world’: Mitch Gibson, 61 “I met Mark online and what was supposed to be a quick drink turned into seven dates in seven days. Mark was instantly likeable and we both knew straight away that this could be the start of something. We ended up having 17 years together, with Mark pouring his creative energy into producing theatre, a comedy festival and countless events in the arts and corporate sectors, while I ran my own yoga studio.\n\nMark was only 52 when he was diagnosed with pancreatic cancer in 2018. Although he’d experienced some niggly back pain for some time, nothing could have prepared us for the phone call that basically said, ‘It’s stage four; unfortunately you’re not a candidate for surgery, good luck with everything.’ It was like someone took our world, turned it upside down and shook it violently. I was already bearing the load of taking care of my elderly parents, and as Mark grew sicker, I had to sell my yoga studio. I just couldn’t be everywhere at once. Mitch Reader lost her husband to cancer after 17 years together. Credit: The grief that hit me when Mark died in 2021 was staggering. Throughout his illness, I’d been receiving psych support at Chris O’Brien Lifehouse [in Sydney]; after his death it took me a year to find the right grief support. That year, alone in lockdown with this fresh grief, was brutal. I longed to speak with someone who’d been through grief and really understood the isolation and disorientation. My friends did what they could to be there for me emotionally, though I still felt isolated within my grief. It’s impossible to comprehend what you go through without lived experience. Curiously, while loved ones try to lift you out of your grief and this pain, a huge part of you wants to stay immersed in it; it’s our connection to our lost person. My decision to become a counsellor specialising in grief and bereavement and caregiving felt purposeful after Mark’s death. I know what it’s like to be a carer at capacity and exhausted, and I know what it’s like when you’ve lost your person – and you’d trade anything to revert to being at capacity and exhausted. Whenever I meet a new client, I can talk with them about what’s happening with their person, discuss their main concerns and priorities, and get them moving forward rather than just spinning. Having been through it myself, I now understand you can never underestimate the importance of an experienced, empathetic ear and a guiding hand.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/out-for-blood-trump-s-witch-hunt-could-trigger-financial-chaos-20250717-p5mfk9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Out for blood: Trump’s reckless witch hunt could trigger financial chaos",
        "publish_date": "Thu, 17 Jul 2025 11:59:05 +1000",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Even changes to the design to reduce costs – the Fed has removed some of the more ostentatious features of the original design – are being seized on by Republicans as evidence of unethical behaviour because what’s being built is different to what Powell told Congress would be built. The faux angst about the management of the project is clearly a pretext. A recent US Supreme Court ruling made it clear that, unlike other government agencies, where Trump’s authority to sack leaders and staff has been upheld, the Fed is different. Its chair can’t be removed without cause. Trump is criticising Federal Reserve chair Jerome Powell over the refurbishment of the Marriner S. Eccles Federal Reserve building in Washington, DC. Credit: Bloomberg Trump wanted to sack Powell during his first term, but discovered then that he didn’t have that power. As is now the case, he clashed with Powell over the Fed’s unwillingness to cut interest rates. He’s been repeatedly calling for a three percentage point reduction in the federal funds rate (equivalent to the Reserve Bank’s cash rate), even though the US inflation rate is well above the Fed’s 2 per cent target, at 2.7 per cent, and rising because of Trump’s tariffs.\n\nAfter three 25 basis point cuts last year, the Fed has left the target range for its policy rate at 4.25 to 4.5 per cent while it waits to see the full effects on inflation of Trump’s barrage of tariffs. Trump may say that it’s unlikely that he will fire Powell (while waving around a draft dismissal letter and canvassing congressmen and women for their opinions), but he’s clearly fishing for grounds to do so. Powell has been adamant that he’s going nowhere before his term as chair ends in May next year. The first inkling of what transpired within the White House on Tuesday came via a post on X by Republican congresswoman, Anna Luna, who was at the meeting. She posted, on Tuesday, that she was “hearing that Jerome Powell is getting fired. From a very serious source.”\n\nThe rumours that an attempt to sack Powell might be underway rattled markets, with the sharemarket, longer-term bond prices and the US dollar all falling on Wednesday before recovering some of their ground after Trump’s comments. That provides a directional insight into what might happen if Trump were to move against Powell – or replace him next year with someone clearly prepared to do what Trump wants. Most of the small group of those auditioning for the role, all Trump loyalists, are signalling (naturally, if they really want his endorsement) that they want lower rates. Trump’s antics regarding Powell have markets on edge. Credit: AP On Wednesday, the sharemarket fell nearly a full percentage point before closing down 0.3 per cent for the day. The yields on short-term bonds fell, but those on longer-term bonds rose. Credit spreads widened. The US dollar weakened almost one percentage point against the currencies of America’s major trading partners. That’s a modest preview of what might be in store if Trump were to succeed in installing a loyalist in the Fed’s chair.\n\nLowering rates while inflation is rising within a full-employment environment would be reckless policy, risking inflation. While sharemarket investors might like lower interest rates, and short-term bond yields would reflect a lower-rate environment, the increased inflation risk and the risk of stagflation would see longer-term bondholders demanding increased compensation for their longer exposure to those risks. Loading Trump and his advisers don’t appear to appreciate the potential consequences of trying to replace Powell with a “yes man.” (All those being touted as chair are male). The markets trust the Fed to be independent of politics and political cycles, focusing purely on its twin mandate of price stability (controling inflation) and maximising employment. If that independence is threatened – if they think Trump or some future president can dictate monetary policies – there will be a scramble to exit financial markets. The dollar will dive, the sharemarket will fall and the yield curve will steepen significantly, with the yields on long-term bonds rising even as those on short-term securities fall. It is, given precedents elsewhere (Turkey and Hungary come to mind), likely that America’s credit rating, once AAA, would be lowered again.\n\nThe Fed can provide the anchor for the yield curve and influence short-term rates, but market participants, a substantial proportion of them foreign, determine the shape of the yield curve and how much extra yield they want for the risk of holding bonds for five, or 10, or 30 years. Even a perception that the Fed’s independence had been compromised would probably result in a significantly steeper yield curve – and higher interest rate on consumer and corporate debt. The market establishes those rates, not the Fed. The other problem for Trump is he tries to politicise the Fed and its decision-making is that there is no guarantee that a new chair would be able to impact rate decisions. Trump wanted to sack Powell during his first term, but discovered then that he didn’t have that power. There are 12 members of the Open Market Committee that makes those decisions, so the chair – and the committee elects its own chair, which would be different, if they wished, to the chair of the board of governors – would have to convince a majority of them to do what he and/or Trump wants.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/first-look-this-greek-newcomer-in-south-melbourne-cranks-up-the-creativity-20250715-p5mf57.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "First look: This Greek newcomer in South Melbourne cranks up the creativity",
        "publish_date": "Thu, 17 Jul 2025 11:57:50 +1000",
        "category": "finance",
        "authors": [
            "Tomas Telegramma"
        ],
        "text": "Advertisement\n\nEating outJust open First look: This Greek newcomer in South Melbourne cranks up the creativity Humble Greek cooking is having a moment. But at Aegli, a Greek-born chef with experience in Michelin-starred kitchens is remixing dishes from his homeland in unexpected ways. Tomas Telegramma July 17, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nWaves of Greek migration over the past century have brought with them a cuisine and culture that’s now firmly embedded in the fabric of our city. Right now, a soaring number of new restaurants – chief among them Kafeneion – have trained the spotlight on Greek comfort food. Aegli chef Ioannis Kasidokostas with his wife and business partner Maria Tsilfoglou. Wayne Taylor South Melbourne newcomer Aegli is taking a different tack. Traditional Greek recipes are a jumping-off point for dishes that’ll make you say, ‘what is this?’ says chef Ioannis Kasidokostas, who runs Aegli with his wife Maria Tsilfoglou. The pair have taken over the former Lume site in Coventry Street, dormant since that fine diner went into liquidation in 2023. Kasidokostas grew up in Athens, cutting his teeth at Michelin-starred fine diners including the longstanding Spondi, where high-end, high-concept cooking is king. “I’ve seen a glory you don’t see in tavernas [which serve] simple things like meatballs and horta,” he says. He wants to bring that glory to Melbourne.\n\nAdvertisement\n\nWhere the couple’s first restaurant, Sowl in Carnegie, is broadly Mediterranean, the 100-seat Aegli serves dishes you’d find in Greece, executed in ways you might not expect. “It’s not fine dining – or [fine-dining] prices,” says Kasidokostas. “But it is fine food.” Magiritsa is a lamb offal soup usually eaten at Easter time, which the chef has remixed with “offal of the land” – mushrooms. He combines the best Victorian-grown varieties he can find with truffles from Meteora, a mountainous part of Greece. 1 / 5 Magiritsta soup made with Victorian-grown mushrooms and truffles from Meteora in Greece. Wayne Taylor 2 / 5 Youvarlakia, a soup made with rice and fish. Wayne Taylor 3 / 5 Inside Aegli’s casual South Melbourne dining room. Wayne Taylor 4 / 5 The “bougatsa” dessert, combining fried dough, custard and walnuts. Wayne Taylor 5 / 5 Baked cheese with sour cherry and caper relish. Wayne Taylor Previous Slide Next Slide Another soup he’s riffing on is youvarlakia, traditionally bobbing with meatballs made of beef or pork. His seafood spin currently features Corner Inlet snapper minced in-house, rolled into orbs and slowly poached in a rich fish stock.\n\nAdvertisement\n\nExtra care and consideration are given to staples such as bread and cheese. Slow-proved spelt rolls arrive warm, while house-made anthotyro cheese is double-baked to order and served with a relish of sour cherry and capers. Familiar Greek favourites also dot the menu, from taramasalata to brined and slow-roasted lamb shoulder accompanied by house-made tzatziki. Twists on classic desserts include the orange and filo cake portokalopita, served with an ice-cream of anthotyro cheese and olive oil. A melding of bougatsa and diples – fried, honey-dipped sheets of dough – results in a hybrid dish akin to millefeuille. Related Article Melbourne’s Greek wave builds with this sunny new taverna (plus three more to try) Cocktails are just as much a love letter to Greece. A spritz stars kumquat-infused vermouth from Corfu and the margarita is perfumed with aniseed from tsipouro. The wine list balances Greek imports, such as bone-dry Santorini assyrtiko, with Australian bottles.\n\nAdvertisement\n\nAnyone who dined at Lume will notice most of its warm-toned fitout has been retained, from the timber floorboards to the round tables and glass-roofed atrium out back. But there have been some changes. Lemon and lime trees add a Mediterranean tone to the red-brick frontage; some internal walls have been repainted in more neutral colours; and new hanging light fixtures cast a warmer glow at night. Dinner Tue-Sun 226 Coventry Street, South Melbourne, aegli.melbourne\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/prince-harry-walks-in-mother-princess-dianas-footsteps-20250717-p5mfnj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Prince Harry walks in mother Princess Diana's footsteps",
        "publish_date": "Thu, 17 Jul 2025 11:57:36 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Prince Harry walks in mother Princess Diana's footsteps\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/syrian-news-anchor-takes-cover-during-israel-strike-20250717-p5mfnp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Syrian news anchor takes cover during Israel strike",
        "publish_date": "Thu, 17 Jul 2025 11:57:35 +1000",
        "category": "finance",
        "authors": [],
        "text": "Syrian news anchor takes cover during Israel strike\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/the-wait-is-over-here-s-your-first-look-at-the-final-season-of-stranger-things-20250717-p5mfke.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The wait is over. Here’s your first look at the final season of Stranger Things",
        "publish_date": "Thu, 17 Jul 2025 11:56:33 +1000",
        "category": "entertainment",
        "authors": [
            "Nell Geraets"
        ],
        "text": "Almost a decade ago, little Will Byers (Noah Schnapp) disappeared into a parallel dimension called the Upside Down. Since then, he and his friends have embarked on a string of dangerous adventures, battling a litany of supernatural monsters – as well as a school bully or two – and protecting their small town of Hawkins.\n\nNow, their adventures are about to end.\n\nStranger Things is coming to a close. Or is it? Credit: Netflix\n\nNetflix released the first teaser trailer for the fifth and final season of its hit series Stranger Things on Thursday morning, offering a glimpse into the decimated town and a looming final battle against the big bad Vecna. This has been a long time coming; the previous season landed in May 2022, but production on season five only began in 2024.\n\nSo, what can we expect from Stranger Things’ last chapter, and why has it taken so long to get here?",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-albanese-to-conclude-china-visit-in-chengdu-trump-dumps-maga-supporters-over-epstein-fallout-20250717-p5mfj4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Albanese to conclude China visit in Chengdu; Trump dumps MAGA supporters over Epstein fallout",
        "publish_date": "Thu, 17 Jul 2025 11:53:30 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "A cockpit recording of dialogue between the two pilots of the Air India flight that crashed last month indicates the captain cut the flow of fuel to the plane’s engines, The Wall Street Journal reported on Wednesday.\n\nThe newspaper cited people familiar with US officials’ early assessment of evidence uncovered in the investigation into the June 12 crash in Ahmedabad, India, that killed 260 people.\n\nThe first officer, who was flying the Boeing 787 Dreamliner, asked the more experienced captain why he moved the fuel switches to the “cutoff” position seconds after lifting off the runway, the report said.\n\nInvestigative officials stand at the site of Air India Boeing 787 which crashed last month in Ahmedabad, India. Credit: Getty Images\n\nThe two pilots involved were Captain Sumeet Sabharwal and First Officer Clive Kunder, who had total flying experience of 15,638 hours and 3403 hours, respectively.\n\nIndia’s AAIB, Directorate General of Civil Aviation, Ministry of Civil Aviation, Boeing and Air India did not immediately respond to Reuters’ requests for comment on The Wall Street Journal report.\n\nA preliminary report into the crash released by India’s Aircraft Accident Investigation Bureau (AAIB) on Saturday said the fuel switches had switched from run to cutoff a second apart just after take-off, but it did not say how they were flipped.\n\nLoading\n\nOne pilot was then heard on the cockpit voice recorder asking the other why he cut off the fuel. “The other pilot responded that he did not do so,” the report said.\n\nWithout fuel flowing to the engines, the London-bound plane began to lose thrust and sink. Almost immediately after the plane lifted off the ground, closed-circuit TV footage showed a back-up energy source called a ram air turbine had deployed, indicating a loss of power from the engines.\n\nAt the crash site, both fuel switches were found in the run position and there had been indications of both engines relighting before the low-altitude crash, the report said. In an internal memo on Monday, Air India chief executive Campbell Wilson said the preliminary report found no mechanical or maintenance faults and that all required maintenance had been carried out.\n\nThe AAIB’s preliminary report had no safety recommendations for Boeing or engine manufacturer GE. After the report was released, the US Federal Aviation Administration and Boeing privately issued notifications that the fuel switch locks on Boeing planes are safe, a document seen by Reuters showed and four sources with knowledge of the matter said.\n\nReuters",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/timelapse-of-hornet-plane-being-installed-20250717-p5mfm8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Timelapse of Hornet plane being installed",
        "publish_date": "Thu, 17 Jul 2025 11:47:46 +1000",
        "category": "finance",
        "authors": [],
        "text": "Timelapse of Hornet plane being installed\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/tuivasa-sheck-s-manager-confirms-r360-discussions-issues-nrl-with-ponga-warning-20250717-p5mflv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tuivasa-Sheck’s manager confirms R360 discussions",
        "publish_date": "Thu, 17 Jul 2025 11:46:54 +1000",
        "category": "sports",
        "authors": [
            "Michael Chammas"
        ],
        "text": "The competition is yet to get off the ground and needs to hit three major triggers to secure the private equity and reported Saudi-Arabian funding to turn it into a reality. The first trigger is to have the franchises purchased and legally drafted. The second requires the confirmation of a broadcast partner, while the third element of the deal requires competition organisers to secure 200 players. All three targets must be reached by the end of September. Roger Tuivasa Sheck playing for the All Blacks in 2022. Credit: AP Sources with knowledge of the situation, talking on the condition of anonymity due to confidentiality agreements, said that there were close to 140 players committed to the competition. While Ponga hasn’t been directly linked to R360, he has engaged New Zealand-based rugby union agent Kent Hale from Halo Sport to explore his options in the 15-man game.\n\nSharrock said the concept is a threat to the NRL with top-line players expected to earn US$2 million (A$3.1 million) per year. It’s more than double what Ponga is earning ($1.4 million) in 2025 as the highest-paid player in the NRL. Kalyn Ponga is out injured for the remainder of the year. Credit: Getty Images “I think it’s something the NRL should be worried about with their dual-code players who would be capable of playing both codes at a high level,” he said. “They’re really looking at rugby players. Roger has appeal because he’s already been a dual-coder. I think there’s some rugby league players that could do it, and Kalyn Ponga is one of them. There’ll be rugby league players who have attraction, but they won’t have the eyes of the greater global rugby market.\n\n“Let’s face it, in France - where there is a huge rugby audience - who’s Kalyn Ponga? He’s known down here, but he’s not known up there. The audience that are buying in are in the United States and Europe. In saying that, he will be a bloody good target. The money is significant.” While rugby traditionalists and existing bodies and teams are opposed to the idea of the rebel competition, Sharrock has implored the game to rethink its future. “It’s something rugby should really open its eyes to,” Sharrock said. “If it does become something real, they need to all get around the table and reimagine what rugby union could look like globally. That’s where I do see, not the threat, but the opportunity. If someone is willing to invest a lot of money into the game to re-energise it and reinvigorate it, I personally would be getting on the back of it and work out how to capitalise on it.”\n\nTuivasa-Sheck’s brother, Johnny, was only made aware of a potential code switch after being shown this masthead’s report. “Oh, that’s crazy, that’s buzzing. Honestly, I’m surprised. When he was playing rugby he was so keen to come back to the ’Wahs, if you watch him he likes that aggression, he likes to run it hard,” said Johnny, a media personality who was capturing content for Stan at the Paul Gallen-Sonny Bill Williams fight. “Going back to rugby is a massive shock to me, but he will kill it.” Former England rugby international Mike Tindall is the public face of R360. Tindall, who is married to British royal family member Zara Phillips, is in Australia to watch the British and Irish Lions tour. Loading\n\nThe R360 concept will follow a hybrid model of Formula 1 and the Indian Premier League, with private owners to invest in franchises around the world. The players who sign with R360 aren’t signing for specific franchises but rather the competition itself, with the potential for auctions and drafts being floated. One model being discussed will see a joint Australia and New Zealand-based franchise as well as teams based in the United States, France, England, South America, Asia and South Africa in an eight-team competition that could grow to 12 teams. Competition organisers want to launch a one-off tournament next season, potentially from July to September, before adopting a regular format in 2027. The intended format in 2027 will see the competition split into two blocks, with the first half of the tournament played between March and May and the second stage played between September and December. That window is largely in competition with the NRL, which currently runs from March to October.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/boxing/why-boxing-chumps-move-the-needle-more-than-champs-20250717-p5mfl2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why boxing chumps move the needle more than champs",
        "publish_date": "Thu, 17 Jul 2025 11:45:27 +1000",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "Tim Tszyu and Jai Opetaia, potentially both world champions by the end of the weekend, are Australia’s best boxers.\n\nBoth have had to lean on Paul Gallen at various stages of their career for relevance locally. When Tszyu and Gallen fought on the same night, the stories about the former footballer generated more clicks. For the purists, it’s an indictment of the fight game, that a footballer can attract more attention than genuine pugilists competing against the world’s best.\n\nHowever, that’s the harsh reality in a celebrity-obsessed age, where punters would rather fork out $70 to watch two footbrawlers than a genuine championship bout.\n\nGallen’s controversial split-decision win against Sonny Bill Williams at Qudos Bank Arena on Wednesday night lasted just 16 minutes, but lined their pockets with paydays of up to $1 million each. In their pomp as professional footballers on the field, it would take an entire season to earn as much.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/job-figures-fresh-piece-bank-173000565.html",
        "title": "Surprise jump as unemployment rate rises in June",
        "publish_date": "2025-07-17T01:51:15Z",
        "category": "finance",
        "authors": [
            "Kat Wong",
            "Andrew Brown"
        ],
        "text": "The jobless rate has risen to 4.3 per cent, surpassing expectations, as the number of unemployed Australians jumped.\n\nFinancial markets had expected the rate to remain steady at 4.1 per cent in June, however, there was a 34,000 increase in people without work, according to the Australian Bureau of Statistics.\n\nLabour force figures for June come after the Reserve Bank unexpectedly kept interest rates on hold. (Dan Himbrechts/AAP PHOTOS)\n\nEmployment rose by 2,000, up two per cent compared to the same month last year, after part-time employment grew by 40,000 and full-time employment fell by 38,000.\n\nUntil this result, the unemployment rate had sat at 4.1 per cent for three consecutive monthly readings.\n\nThe Reserve Bank will closely monitor the labour market before its next monetary policy meeting in August, NAB's head of Australian economics Gareth Spence said.\n\nADVERTISEMENT\n\n\"The focus for the RBA will be ensuring the labour market remains healthy going forward,\" he said.\n\nA leading economist says ensuring the labour market remains healthy will be a focus of the RBA. (James Ross/AAP PHOTOS)\n\n\"The timing of (rate) cuts is not super important.\n\n\"It's more about where do they end up.\"\n\nIn a move that shocked analysts and disappointed mortgage holders, the RBA in July kept the cash rate steady at 3.85 per cent.\n\nMost economists had pencilled in a 25 basis point cut on the back of slowing inflation growth.\n\nThe availability of labour remains a constraint for a range of employers, the Reserve Bank noted. (James Ross/AAP PHOTOS)\n\nMr Spence still expected the jobless rate to climb to 4.4 per cent by the end of 2025, but said economic indicators point to the labour market still being in a strong position.\n\nThe Reserve Bank said in its latest monetary policy decision that labour market conditions remained tight.\n\n\"Measures of labour under-utilisation are at relatively low rates and business surveys and liaison suggest that availability of labour is still a constraint for a range of employers,\" the bank said.\n\n\"Alternatively, labour market outcomes may prove stronger than expected, given the signal from a range of leading indicators.\"",
        "source": "Yahoo"
    }
]