[
    {
        "url": "https://www.9news.com.au/national/energy-bill-rebate-comments-treasurer-jim-chalmers-inflation/51fa0981-73dc-447e-803b-53c9f5eefe58",
        "title": "$5 billion early Christmas gift could be on the cards for every Aussie",
        "publish_date": "Wed, 26 Nov 2025 08:39:39 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Treasurer Jim Chalmers has kept the door open for another round of electricity rebates, saying the government is yet to rule out what would be a second extension of its key cost-of-living relief policy.\n\nThe rebates were introduced in the 2024 federal budget, providing all households with $300 off their bills over the course of a year at a cost of $3.5 billion.\n\nChalmers then found an extra $1.8 billion to extend the measure in this year's budget for another two quarters – or $150 per household – taking the total spend to more than $5 billion.\n\nREAD MORE: Final nail in the coffin for rate cut hopes ﻿\n\nAustralians could receive another bout of energy bill relief, but have been warned the rebates won't be around forever. (Edwina Pickles/SMH)\n\nBut with the rebates due to expire at the end of the year, and inflation rising – driven in large part by electricity prices – the government has been facing questions about whether they will be extended once again.\n\nChalmers said today that that decision was yet to be made, and suggested that an announcement on the policy will be made as part of the mid-year economic and fiscal outlook (MYEFO).\n\n\"The mid-year budget update will be towards the middle of December, as it has been on the last couple of occasions,\" the treasurer told reporters this afternoon.\n\n\"We'll take a decision about electricity rebates in the context of finalising that mid-year budget update.\"\n\nJim Chalmers said a decision on the policy will be made in the coming weeks. (Alex Ellinghausen)\n\nChalmers warned, though, that regardless of the decision made over the next fortnight or so, the rebates will eventually come to an end.\n\n\"They are a really important way that we are helping Australians with the cost of living, taking some of the edge off these electricity price pressures that people are encountering,\" he said.\n\n\"They're a really important part of our budget, but they're not a permanent feature of our budget, and we've made that clear.\"\n\nChalmers' comments came after fresh data showed inflation has reached its highest level in more than a year , with rising electricity prices, caused in part by the end of state-level energy bill relief, a significant contributing factor.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/showpo-ceo-jane-lu-secrets-to-success/52e5a566-b5fa-494e-8010-21cf530b149e",
        "title": "Jane quit a corporate job to chase her dream. It makes $100 million in sales a year",
        "publish_date": "Wed, 26 Nov 2025 18:25:20 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Exclusive: In this nine.com.au series, we'll be talking to some of Australia's smartest and sharpest ﻿entrepreneurs, founders and CEOs to find out what makes them tick - and what advice they'd have for anyone starting out.\n\nIn 2010, Jane Lu left her corporate accounting job to start an online fashion brand﻿; today Showpo does more than $100 million in sales a year.\n\nShe was drowning in debt from a failed business when she began the ﻿humble start-up from her ﻿garage.\n\nNow it's a global e-commerce business and one of the most popular online fashion retailers in Australia.\n\nThese are her secrets to success.\n\nShowpo founder and CEO Jane Lu left her corporate accounting job to start an online fashion brand﻿. (Supplied)\n\nHow do you start the day to set yourself up for success?\n\nI live by my calendar - if it's not in there, it's not happening.\n\nIt's the only way to stay on top of a busy day and make sure I'm spending time on what actually matters, not just what's loudest.\n\nWhat are three daily habits you always stick to?\n\nIf I'm being honest, I don't have the best habits - I don't get nearly enough sleep, I hate reading books and my screen time is out of control.\n\nBut I've learned not to beat myself up over it.\n\nWhat I do stick to is staying adaptable, doing what works for me, and remembering that productivity isn't about being busy - it's about being effective.\n\nLeaving the corporate world to start her own business was a huge risk. (Instagram/@thelazyceo)\n\nLots of Aussies are looking for a career change — what small action can help them get ahead of other candidates?\n\nBring ideas, not just answers.\n\nAnyone can tell you what they'd do in theory - stand out by showing you've thought about the specific company or role.\n\nAsk sharp, curious questions that show you've done your homework and that you genuinely care about adding value.\n\nEnergy and curiosity go a long way.\n\nWhat financial myth do you wish you never bought into?\n\nThat owning a home is the ultimate marker of success.\n\nBusiness owners need to value the importance of liquidity.\n\nPrioritising liquidity over owning a home early on gave me the freedom and flexibility to take risks and move quickly when opportunities came up.\n\nLu wants to dispel the myth that owning a home is the ultimate marker of success. (Getty)\n\nWhat do you wish you could tell your 20-year-old self?\n\nDon't be afraid to fail - your first business probably will. Mine did.\n\nBut that \"failure\" taught me more than any business degree ever could.\n\nEvery setback is just data - take the lesson, not the loss.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/technology/social-media-creators-react-to-upcoming-under-16-ban/1c45ad48-77de-46b6-aced-903bb437924a",
        "title": "Aussie content creators react to social media ban",
        "publish_date": "Wed, 26 Nov 2025 06:25:53 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Ahead of the impending under-16 social media ban, nine.com.au has spoken with a number of young content creators to find out what they think about the upcoming changes.\n\nSome describe it as a \"double-edged sword\". Others believe that removing under-16s from their audience will have long-lasting effects on their engagement, audience reach and, subsequently, their livelihoods.\n\nMackenzie McIntyre is a creator from Queensland﻿ who creates relatable-style observational content, amassing a huge audience in the process.\n\nMcIntyre has garnered over 27 million YouTube views and has over 400,000 TikTok followers. Those numbers could soon take a huge hit once the restrictions come into effect on December 10.\n\n\"I've had a lot of friends, especially who make content for high school, people in high school, pretty concerned recently because it's obviously going to have a huge impact on their engagement.\" Mackenzie McIntyre said.\n\nWhat's your take on the upcoming ban? Let us know at joseph.sahyoun@nine.com.au.\n\nThe new laws are set to come into effect early December. (Nine)\n\n\"The freedom to create as a young person is being really stripped away,\" McIntyre said.\n\n\"Not just like someone who's already creating for viewers, but for people who want to create.\"\n\n\"When I was 15 years old, all I wanted to be was a content creator, so I think that plays a big role in it too.\"\n\nWestern Australia's Empire Family revealed their decision in a video posted to their main channel. (YouTube)\n\nCreators like Western Australia's Empire Family announced to their 1.8 million followers in October that they moved to the UK to avoid the upcoming social media ban. ﻿\n\n\"I've got a lot of friends who have already, in preparation for the ban or just the regulations that are coming in, have moved to America or moved to Bali, or Indonesia keep that younger audience,\" said Josiah Young .\n\nJosiah is a creator who has been posting relatable content skits since he was 18 and believes that creators will have to adapt to the changes.\n\n\"I will definitely have to start tailoring some of my content.\"\n\n\"I've even started thinking about maybe pushing up that age to kind of end of high school, early university days sort of relatability.\"\n\n\"It might end up being a double-edged sword where kids just end up in these really unsafe places because they are just scrambling to find somewhere that they can continue consuming the content that they've grown up with.\"\n\n\"I think it's almost like it hasn't really sunk in for a lot of creators that there will need to be some sort of change.\"\n\nDane Clarke is the creator of Clarkey's Rugby League Column\n\nClarke's daily rugby league content posted to his Instagram account has fostered an audience of nearly 150,000 followers, including a mix of people who are set to have their accounts wiped on December 10.\n\n\"It will certainly affect my engagement numbers, as the younger generation is a highly engaged portion of my followers,\" Clarke said.\n\nMany creators believe young people will find loopholes to access social media. (CNN)\n\n\"Whenever I meet someone under the age of 18 or looking like they're in high school, they usually tell me that they love my page and get all their news from it daily.\n\n\"I suspect plenty of them will just find an alternate method to access social media. Kids are resourceful, and I am sure they are going to find hundreds of ways to loophole this ban.\"\n\nThe government has placed the responsibility of enforcing the laws into the hands of the social media platforms included in the ban.\n\nThis includes removing and deactivating any accounts used by anyone under the age of 16, as well as preventing the creation of any additional accounts and preventing workarounds that may allow children to bypass the restrictions.\n\n﻿The platforms set to be age-restricted include: Facebook, Instagram, Snapchat, Threads, TikTok, X, YouTube, Kick, Twitch and Reddit.\n\nHowever, there are no penalties for under-16s who access age-restricted platforms, ﻿with the government stating that the purpose is to protect young Australians rather than punishing and isolating them.\n\nOther creators have echoed this sentiment, believing that ﻿under-16s will find their way around the new legislation.\n\n\"I really don't think a lot of them will settle for just not being able to do it,\" McIntrye said.\n\n\"These young people are going to have to find alternative ways to watch this content, whether by using their parents' account, then that messes up all the demographics. statistics and everything.\"\n\nThe ban is set to come into effect on December 10. (Getty)\n\n\"That can also create a dangerous environment because then they may be shown more adult content because the age range is a lot higher.\"\n\nSocial media influencer agencies ﻿have been preparing for months in the lead-up to the new laws.\n\n\"Under-16s often drive trends and virality, though their direct purchasing power is limited,\" said Head of Brand and Partnerships at Sticki and DataSauce, Rachael Webb.\n\n﻿\"Over the last few months, our focus has been on education, helping brands understand that this legislation represents a delay in when young audiences can legally participate, rather than the disappearance of youth influence online.\"\n\n\"The key challenge for creators is understanding how this will affect their analytics. With Influencer marketing now highly data-driven, engagement metrics may fluctuate as under-16 accounts are removed or restricted.\"\n\nWebb is urging creators to be proactive and use the new laws as a way to test new approaches and formats to see what works as the social media landscape continues to evolve rapidly.\n\n\"﻿Test new angles of content, explore what resonates with your other audience segments, and experiment with new creative styles.\"\n\n\"It's rare for a creator's audience to be made up entirely of under-16s, but many will see shifts in their community makeup.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/gambling-advertising-spam-text-messages-rules-regulations-betting-companies-how-they-can-message-you-explainer/e4c69943-2fd0-4d3d-8d50-08d44ed6f75a",
        "title": "These dangerous texts are flooding millions of Aussies' phones",
        "publish_date": "Wed, 26 Nov 2025 01:38:33 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "More than three million Australians who have self-identified as being problem or at-risk gamblers could be vulnerable to a proliferation of text messages sent by betting companies.﻿\n\nWhile there are strict laws governing gambling ads on TV, radio or online, the rules when it comes to texts are much looser.\n\nSo how often can a gambling company send an SMS message, and what are the rules around the practice?﻿\n\nA phone showing a text from a gambling company to a customer. (Getty)\n\nAll direct communication must include a disclaimer﻿\n\nLegally, gambling companies are required to include just two things in direct marketing material like texts: consistent ﻿messaging about the risks and potential harm of gambling, and a way for consumers to opt out.\n\nThat means all texts must include specific taglines like \"chances are you're about to lose'\"and a link or instructions to unsubscribe.\n\nBetting companies can also only send direct marketing materials to ﻿customers who provide \"express consent\" to receive it, per the National Consumer Protection Framework for Online Wagering.\n\nCompanies that send texts after a consumer has unsubscribed are in breach of the Australian Communications and Media Authority's spam rules\n\nEarlier this year ﻿ Tabcorp copped a $4 million fine for spamming VIP customers with thousands of messages without any way to unsubscribe.\n\nIn 2022, Sportsbet was ordered to pay ﻿$3.7 million in fines for sending more than 150,000 texts and emails to about 37,000 customers who had tried to unsubscribe.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nTabcorp was found to have breached the Australian Communications and Media Authority's spam rules. (Supplied)\n\nWhy are text messages treated differently to other media, such as TV ads?﻿\n\nBut because texts count as private messages﻿, they can skirt around most public gambling advertising restrictions.\n\n\"One of the big issues here is the rise of smartphones,\" associate professor at CQUniversity's Experimental Gambling Research Laboratory Alex Russell told 9news.com.au.\n\n\"Everyone's got a smartphone in their pocket all the time, and you can bet on that all the time.\"\n\nAnd betting companies can reach customers all the time via texts.\n\nTexts which have been shown to influence consumers to place more bets, larger bets, and riskier bets according to Australian research.\n\nIn a 2018 survey from the ﻿Victorian Responsible Gambling Foundation, sports bettors received an average of 2.3 texts per week and race bettors averaged ﻿4.3 texts per week.\n\nSports bettors received an average of 2.3 texts per week from gambling operators. (Getty)\n\nThe texts often included incentives to bet, such as bonus bets and reward points.﻿\n\nIn most cases, bettors who received a text responded by placing a bet with the operator that sent it.\n\nThey were also influenced to place more bets, place unplanned bets, make ﻿impulsive betting decisions and bet more than planned.\n\n\"We do see that people are targeted more if they are more likely to lose,\" Russell added.\n\n\"So if you're getting offers, it's probably because it's good value for them [gambling companies] to send it to you, because you're going to bet and lose.\"\n\nHow much money are Aussies gamblers losing?\n\nAustralians are the biggest gambling losers in the world per capita, losing about $32 billion annually; more than governments spend on aged care in Australia.\n\nNearly 3.5 million Aussies admitted they are problem or at-risk gamblers in a recent study\n\nThe number of problem gamblers has also risen by 22 per cent since last year.\n\nAnd the losses don't just affect the individual who is gambling.\n\n\"A hell of a lot more people are harmed by gambling,\" Russell said.\n\nBut he questions how Aussi﻿es are supposed to break free from gambling addiction when betting companies are able to reach them with targeted texts any hour of the day.\n\nCalls grow for greater regulation around SMS messages﻿\n\nGambling reform advocates have called for more transparency and regulation around direct digital marketing materials like texts encouraging bets.\n\nLast year, more than 70 prominent Australians, including former prime ministers,﻿ signed an open letter calling on the federal government to ban gambling advertising in accordance with the Murphy Report parliamentary inquiry's recommendations.\n\nIndependent Senator David Pocock was one of the signatories.﻿\n\n\"The evidence shows that partial advertising bans do not work,\" he told 9news.com.au.\n\n\"The Murphy Report was clear, the Government should immediately ban direct inducements, such as the bonus bets people are offered via personalised texts.\"\n\nSenator David Pocock was one of many prominent Aussies who signed an open letter calling on the federal government to ban gambling advertising in 2024. (Alex Ellinghausen)\n\nHe called it \"predatory marketing\" that targets Aussies on a losing streak and highlighted the government's inaction in the two years since the Murphy Report was released.\n\n\"There is wide support in the Parliament to ban gambling ads and to ban inducements, but it won't happen while the Prime Minister continues to bow to pressure from the gambling companies and the powerful vested interests who are making too much money off of the suffering of Australians,\" Pocock said.\n\nThe Albanese government has not committed to a ban on gambling advertising.\n\nLast week, the AFR reported the government is actually expected to abandon plans for a total ban on online gambling advertising.\n\nRussell fears it will only do more harm to already struggling Australians.\n\n\"How are you meant to not experience a problem when gambling is so saturated and everywhere?\" Russell said.\n\n\"How are you meant to get away from this?\"﻿\n\nThe Albanese government has not committed to a ban on gambling advertising. (Getty)\n\nHow to stop or unsubscribe from ﻿betting company texts in Australia\n\nGambling companies are legally required to include a way for consumers to unsubscribe from text marketing in any texts they send.\n\nIn some cases, consumers must text 'STOP' or a similar phrase to a specific number.\n\nIn others, they can click an unsubscribe link in the text and follow the prompts to opt out of text message marketing.\n\nAustralians can also register with BetStop , a free government initiative that blocks all licensed Australian online and phone gambling providers.﻿\n\nAfter joining the National Self-Exclusion Register﻿, online and phone gambling providers will not be able to send you marketing messages.\n\nHow to report spam texts from gambling companies\n\nIf you think a betting company has broken Australia's spam rules, you can report it to the ACMA by submitting a complaint form.\n\nSpecific spam texts can also be forwarded to the ﻿ACMA on 0429 999 888.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-27/boxing-huseyin-cinkara-vs-jai-opetaia-threat-fight-preview/106072532",
        "title": "Fiery German threatens to 'knock Opetaia senseless' in title fight",
        "publish_date": "Thu, 27 Nov 2025 01:58:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "Huseyin Cinkara reckons Jai Opetaia's last victim was \"too nice\" to the Australian and has vowed to attack the world cruiserweight champion, declaring he's the harder puncher of the pair.\n\nIBF and The Ring champion Opetaia will defend his belts against the unbeaten Turkey-based German talent on the Gold Coast next Saturday.\n\nThe pair were meant to meet about a year ago before Cinkara's (23-0, 19 knockouts) late withdrawal due to injury.\n\nThe 30-year-old Opetaia (28-0, 22 KOs) instead pulverised David Nyika, then broke Claudio Squeo's jaw, adding to his list of devastating stoppages since first claiming the titles three years ago.\n\nLoading Instagram content\n\nBut 40-year-old Cinkara poked the bear on his arrival in the country, saying Opetaia would be foolish to trade blows with him.\n\n\"Look, I've got respect for Opetaia, he's earned his place,\" Cinkara said.\n\n\"But respect don't win fights. Power does, and I'm the harder puncher between us.\n\n\"If he wants to dance, I won't be surprised. I don't think he wants to trade with me. I hit harder, I hit faster.\"\n\nOpetaia knocked out Italy's Claudio Squeo in June this year to move his career record to an impressive 28-0 with 22 KOs. (AAP Image: Dave Hunt)\n\nOpetaia has unsuccessfully chased unification bouts since first winning his belts, forcing him to proceed with a high-risk, low-reward mandatory defence.\n\n\"I've been training like a man possessed,\" Cinkara said.\n\n\"I'm not here to play nice — I'm here to take the belts.\n\n\"Squeo seemed to be too polite. I'm coming over to knock Opetaia senseless in front of his own fans.\n\nABC Sport will live blog the entire Jai Opetaia vs Huseyin Cinkara card on December 6.\n\n\"I'm not asking for respect. I'm demanding it. And I'll get it the only way I know how.\n\n\"I know people write me off, but I will prove them wrong. I believe vulnerability is real, I see cracks, I see chinks in his armour.\n\n\"I'm not blind. December 6, those belts change hands.\"\n\nThe pay-per-view card, to be streamed on Stan Sport in a new deal struck by Tasman Fighters boss Mick Francis, will also feature recently dethroned world champion Jason Moloney, Paul Fleming, Teremoana Teremoana Jnr and Justis Huni.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-27/asbestos-wind-turbines-renewables-import-goldwind/106058220",
        "title": "Second company confirms asbestos in imported wind turbine lift brake pads",
        "publish_date": "Thu, 27 Nov 2025 01:39:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "A second company has confirmed the presence of white asbestos in wind turbine lift brake pads imported from Chinese company 3S Industry.\n\nInternational renewable energy company Vestas, which has 44 wind farms across the country, recorded a positive test for asbestos in brake pads at its Golden Plains wind farm in regional Victoria, about 130 kilometres west of Melbourne.\n\nIt was previously revealed energy company Goldwind Australia, responsible for about 5 per cent of the country's renewable energy, had found asbestos in lift brake pads used across its wind farms.\n\nThe brake pads are used in lifts that enable technicians to travel up and down turbine towers.\n\nGoldwind Australia turbines exist all over Australia. (ABC Capricornia: Katrina Beavan)\n\nIn a statement, a Vestas spokesperson said 3S Industry told Vestas the lift pads it supplied may contain asbestos.\n\n\"Vestas has taken immediate action to ensure that the limited number of turbines that may have a risk of exposure to asbestos are quarantined, and hoists potentially replaced while further investigations are carried out,\" the spokesperson said.\n\n\"Vestas maintains a zero-tolerance policy on the use of asbestos in our purchase specification, and the supplier has taken responsibility for not adhering to our policy.\n\n\" We're working with the supplier and partners to remove any risk of exposure to asbestos. \"\n\nThe importation of asbestos or goods containing asbestos, has been illegal in Australia since 2003.\n\nThe ABC understands Chinese supplier 3S Industry provides lift brake pads to the majority of wind turbine operators in Australia.\n\nGoldwind Australia and 3S Industry have been contacted for comment.\n\nGovernment defends response\n\nClimate Change and Energy Minister Chris Bowen has defended the federal government's response amid claims more renewable energy companies are implicated.\n\nIn question time on Wednesday, Mr Bowen rejected the suggestion the government had been complacent describing the asbestos breach as a \"very serious matter\".\n\n\"A program of checks is underway by state regulators to determine if other wind farms are impacted,\" Mr Bowen told parliament.\n\nIt follows Coalition frontbencher Tim Wilson accusing the government of dragging its feet on its safety response.\n\nChris Bowen has defended the government's response. (AP: Fernando Llano)\n\nMr Wilson, the Shadow Minister for Industrial Relations and Employment, wrote to the federal government urging a national audit and a pause on the installation of the problematic part.\n\nTim Wilson says the federal government is acting too slowly. (ABC News)\n\nMr Wilson also called for stricter supply chain checks on imports related to renewable energy products.\n\nIn the letter, he said the brake pads posed \"broader reputational and operational risks\" to Australia's clean energy roll out.\n\nMr Bowen told parliament there were a number of wind farms using 3S Industry lift brake pads.\n\n\"They don't just do wind turbines, they provide industrial lifts for high infrastructure,\" Mr Bowen told parliament.\n\n\" Obviously, they apply in wind turbines but can also apply in other industrial facilities. \"\n\nTurbines at Goldwind's Clarke Creek Wind Farm, north of Rockhampton in central Queensland. (ABC News: Nathan Morris)\n\nAsbestos removal\n\nAfter white asbestos was found in brake pads at its Cattle Hill wind farm in Tasmania, Goldwind Australia said it disabled access to the inside of all its Australian turbines, excluding asbestos removalist professionals.\n\nThe company said asbestos removal teams would be engaged to safely swap out the brake pads.\n\nState regulators launched investigations in a national response to the incident.\n\nGoldwind Australia said occupational hygienists had deemed the asbestos brake pads were a low risk to the public.\n\nZach Smith says companies have \"flouted\" the asbestos bans. (Supplied CFMEU)\n\nIn a statement, the CFMEU said the asbestos breach was \"beyond belief\".\n\n\"Despite importing asbestos being banned for more than 20 years, these companies have flouted the ban and put workers at risk of serious disease, illness, cancer and death by bringing these dodgy components here,\" CFMEU national secretary Zach Smith said.\n\nThe CFMEU claimed multiple wind energy companies were under investigation after the scare including Goldwind Australia, Vestas and Beijing Energy.\n\nBeijing Energy has been contacted for comment.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-27/motherly-love-produces-sweet-jujube-crop-mildura/106033130",
        "title": "Victorian grower finds success in relatively unknown sweet crop",
        "publish_date": "Thu, 27 Nov 2025 01:31:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "A regional Victorian grower's tribute to his mum has become the most successful venture of his life.\n\nMildura grower Mick Costa's mother grew up in Italy and would fondly recall a small sweet fruit — the jujube.\n\nJujubes come in various sizes, have a sweet-tart flavour and are often compared to apples.\n\nThe fruit, which is also known as a Chinese date, is thought to have originated in south-west Asia and comes from one of the oldest cultivated fruit trees in the world.\n\nIt was only after moving to regional Victoria that Mr Costa encountered the fruit again — and in memory of his mother planted several trees.\n\nJujubes grow well in Mildura's hot, sunny climate. (Supplied: Jujubes Australia)\n\nNow, Mr Costa said if he had his time again he would pursue the fruit more aggressively.\n\n\"I've been in several industries, I've done grapes, I've done vegetables, construction as well … tried a lot of things, and the most successful has been these jujubes,\" he said.\n\n\" For the love of my mother, I wanted to have a look at jujubes and it's the best thing I ever done in my life. \"\n\nMr Costa said the \"honey-sweet\" fruit was easy to grow and he was surprised it was not more popular in Sunraysia.\n\n\"They're very easy to grow, the only time they require work is during picking — which you don't mind, that's when the money comes in,\" he said.\n\n\"Other than that, I give them a prune which is much easier than vines and that's it.\n\n\"As far as spraying goes, there are no diseases we worry about, we only spray for fruit fly.\"\n\nJujubes are like a cross between an apple and a nashi pear. (ABC Landline: Kerry Staight)\n\nMr Costa said there was strong domestic demand for jujubes in Australia.\n\n\"There's a lot of Asians in Australia now, so the demand for them is there,\" he said.\n\n\"If you had a volume, you could also export them.\n\n\"If I was 20 years younger, I'd go and whack in 50 acres or 100 acres, because I've been asked if I'd pick some for export.\"\n\nStrong domestic demand\n\nIn 2023, Australia's largest producer of kiwi fruit and nashi pears, Seeka Australia, took a bet on the jujube — planting 40,000 trees near Shepparton in Victoria.\n\nJonathan Van Popering says harvesting is the most expensive part of jujubes. (ABC Landline: Kerry Staight)\n\nSeeka Australia general manager of operations Jonathan Van Popering said the trees had been a worthwhile investment.\n\n\"Demand has been pretty strong, last year was probably one of our best years,\" he said.\n\n\"We had great fruit quality and sold through really well — no issues at all.\n\n\"Jujubes price better than our kiwifruit, nashi, or stone fruit. We're definitely satisfied with where it sits.\"\n\nJujube trees grow quickly and within about a year are ready for harvesting. (ABC Landline: Kerry Staight)\n\nMr Van Popering said as the trees mature and produce more fruit Seeka Australia would consider its options.\n\n\"We're investigating export markets and expect to export some fruit this coming season, we haven't exported yet simply because of the low volumes,\" he said.\n\n\"Local demand has been really strong, so we haven't needed to; as volumes increase, we'll start looking outward to hit the price points we need.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-27/icc-rates-perth-stadium-cricket-pitch-very-good-two-day-finish/106071812",
        "title": "Spotlight on England's poor batting as ICC rates Perth pitch 'very good'",
        "publish_date": "Thu, 27 Nov 2025 01:07:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "The pitch at Perth Stadium for the first Ashes Test has been rated as \"very good\" under the International Cricket Council's (ICC) four-tier rating system.\n\nThe surface was characterised as having \"good carry, limited seam movement, and consistent bounce early in the match, allowing for a balanced contest between batters and bowlers\".\n\nThis comes despite the opening Test between Australia and England finishing inside two days, a result which is expected to cost Cricket Australia millions of dollars.\n\nCricket Australia's chief of cricket, James Allsopp, welcomed the ICC's assessment of the Perth pitch.\n\nAustralia's Travis Head was one of only three players to register a score of 50 or more in the first Test. (Getty Images: Robbie Stephenson)\n\n\"The match referee's 'very good' rating justifies our belief Perth Stadium produced a pitch that provided a fair balance between bat and ball,\" Allsopp said in a statement on Thursday.\n\n\"The dominance of some brilliant pace bowling from both sides and the frenetic nature of the contest meant the match lasted only two days.\n\n\"This was disappointing for fans holding tickets for days three and four, but we saw some incredible moments which captivated huge viewing audiences and will inspire even more kids to pick up a bat and ball this summer.\n\n\"As always, we want to ensure pitches across Australia have their own characteristics and we're looking forward to another enthralling contest under lights at the Gabba starting next Thursday.\"\n\nThe ICC's assessment follows criticism of the Perth pitch by Indian commentator Harsha Bhogle after the first Test.\n\n\"There were 60000 people expected in Perth today,\" Bhogle posted on X after the match. \"They would have looked forward to a great Sunday for weeks.\n\n\"Even if the batting was unusually frenetic, and the game was extraordinarily gripping, a track that allows a game to end in 2 days isn't fair to the stakeholders of the game.\"\n\nIndian cricket journalist Boria Majumdar also echoed a similar sentiment, claiming there were \"clear double standards\" when assessing pitches in India and around the world.\n\nThe ICC's assessment places more pressure on the poor performance from England's batting line-up, which lasted 32.5 overs in the first innings and 34.4 overs in the second innings. Australia's 45.2-over first innings was the longest of the entire Test.\n\nDespite their failure to adjust to Australian conditions in the first Test, England's players have opted to skip a tour match under lights against the Prime Minister's XI in Canberra beginning Saturday, ahead of next week's pink ball Test in Brisbane.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-27/white-wine-oversupply-set-to-deepen-grower-crisis/106049916",
        "title": "White wine grape growers already in crisis suffer 'another kick in the guts'",
        "publish_date": "Thu, 27 Nov 2025 00:58:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "There are fears farmers in Australia's largest wine grape growing region will be forced to walk off the block as white wine grape prices are expected to drop due to an oversupply this upcoming vintage season.\n\nThe wine industry across Australia has been battling a global oversupply of red wine grapes due to international market changes and shifting consumer behaviour for the past five years.\n\nIn South Australia's Riverland, early price indicators for the 2026 vintage show shiraz prices as low as $80 to $120 per tonne.\n\nThat is according to Riverland Wine, which also said the cost of producing grapes exceeded $350 per tonne.\n\nWhile low prices were expected, the industry is preparing for white grape prices to also plummet.\n\nIt is a blow for growers like Amanda Dimas who has had grapes growing on her family block for three generations.\n\nAmanda Dimas said growers are running out of places to turn to pull them through the tough market conditions. (ABC Riverland: Shannon Pearce)\n\n\"We don't have any more capital left to diversify, change plantings, and even if we [could], whites have taken a turn for the worst,\" she said.\n\n\"We've removed all of our shiraz and planted chardonnay, so it's just another kick in the guts.\n\n\"You've spent that hard-earned money to reinvest and it's not got us anywhere.\"\n\nBrigid Nolan said prices for chardonnay and sauvignon blanc are the white varieties under the most pressure. (ABC News: James Wakelin)\n\nThe Wine Group, based in Loxton and which processes grapes, said white varieties including chardonnay and sauvignon blanc had been touted as a transition option for growers who were trying to survive the decline of reds in recent years.\n\nThat had now backfired.\n\n\"Due to the downturn in the reds we've found some growers have planted whites and we're finding that they're now coming into that oversupply situation as well,\" general manager Brigid Nolan said.\n\n\"Unfortunately, unlike some of the other agricultural industries in Australia, it doesn't seem to be as cyclical.\n\n\" It comes to a point where it's just not economically viable and we are going to start seeing the devastation of that with some pretty sad looking vines and vineyards. \"\n\nIndustry in crisis\n\nRiverland Wine has penned an \"urgent letter\" to Premier Peter Malinauskas describing the region as being \"in the grip of a severe economic and social crisis\".\n\nIt has called for a government-led crisis meeting with industry, peak bodies and grower representatives before the end of January.\n\n\"While this may sound like a familiar call for help, please understand that the risk of your inaction is now catastrophic,\" the letter read.\n\n\" Right now, the Riverland is breaking. \"\n\nRiverland Wine is pleading for the state government to step in and help growers exit the industry. (ABC Riverland: Will Hunter)\n\nBoard member Peter Hill said South Australia's identity as a wine state will be at risk if action is not taken by government in some form.\n\n\"The outlook is catastrophic … not just for the industry, it's for this whole community, the whole state,\" he said.\n\n\"You don't have to go too far and you can talk to people in the Barossa or Clare or McLaren Vale, Langhorne Creek — they're all in trouble.\n\n\"The wine industry is a big industry in this state and you would think it would attract the premier for help.\"\n\nThe state government said Riverland Wine's request had been received and is under consideration.\n\nIt acknowledged the current industry conditions and said the Department of Primary Industries had established multiple programs totalling $15 million in investment.\n\nThe programs include a $2.5 million South Australian Wine Recovery Program to support vineyard waste management of abandoned or removed vineyards and a national vineyard register to inform supply and demand decisions.\n\nLast week the state government also announced a third round of rebates to encourage growers to \"rest\" their vines this season.\n\nWine grape growers could lose up to $270 per tonne on red wine grapes this vintage. (ABC Riverland: Shannon Pearce)\n\nDiversification might be too late\n\nDiversifying crops had been suggested within the industry as a way of mitigating growers' reliance on wine grapes.\n\nAshley Ratcliff, owner of Ricca Terra Wines in Barmera, has been expanding his crops to include olives and agave.\n\nHe said while it was an option, it had risks of causing oversupply in other industries too.\n\n\"You put in too many things like olives or almonds or pistachios and also flood the market,\" he said.\n\nMr Hill said it is also not simple to transition crops.\n\n\"Whatever you do costs a lot of money to replant,\" he said.\n\n\"Growers' financial resources are now exhausted because it's been three years of below cost of production pricing.\n\n\"Without any help, the next step will be growers walking off properties.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-27/regional-kids-swimming-skills-lack/105981516",
        "title": "Swimming skills gap from lack of facilities in regional WA",
        "publish_date": "Thu, 27 Nov 2025 00:48:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "Parents in Western Australia's south-west say they are struggling to get their children into swimming lessons, blaming long waitlists and a lack of pool infrastructure.\n\nIt comes as new data reveals a 30 per cent increase in drowning deaths in WA over the last 10 years.\n\nKate Cutler from Dalyellup, 180 kilometres south of Perth, said her two children had been on a waitlist at her nearest public pool in the City of Bunbury for 11 months.\n\nMs Cutler said she enquired about the waitlist length and was told there were hundreds of children waiting for lessons.\n\nShe said not being able to access lessons was more than frustrating.\n\nThe ABC has contacted The City of Bunbury for the latest data on swimming lesson waitlists.\n\nKate Cutler's son, Billy, has been waiting for lessons for almost a year. (ABC South West: Anna Cox)\n\n\"It's infuriating and scary … I don't have the skill set to teach my two-year-old what to do if he falls into a pool,\" Ms Cutler said.\n\n\"We're doing private lessons now, which is about double the price.\"\n\nThe neighbouring City of Busselton said it was common for families from nearby areas such as Margaret River, Dunsborough and Yallingup to travel to its facility in order to access swimming lessons.\n\nThe City said it had 700 current enrolments with another 31 on its waitlist.\n\nDemand for private lessons\n\nLiz Fowler has increased lessons to meet demand. (ABC South West: Anna Cox)\n\nIn response to the lack of availability for swimming lessons in public pools, some people are turning to private swim schools.\n\nIn Busselton, Liz Fowler runs a private swimming school with 400 students.\n\nShe said despite employing several teachers, she had increased the number of classes she taught each week to meet demand.\n\n\"I used to teach twice a week, now I teach eight lessons a week,\" Ms Fowler said.\n\nHeidi Breeyt says the process of opening a swim school is costly and long. (ABC South West: Anna Cox)\n\nHeidi Breeyt opened a private swimming school at her home in nearby Australind in June.\n\nMs Breeyt has reached her 80-person capacity, but still receives \"at least three inquiries from parents\" every day.\n\n\"It's quite sad … people are becoming quite desperate,\" Ms Breeyt said.\n\n\"I have kids coming from Busselton and Harvey … There is a need for more swim schools.\"\n\nPeak Body Concern\n\nRoyal Life Saving Australia's National Drowning Report reveals 49 drowning deaths in WA over 2024-25.\n\nRoyal Surf Lifesaving WA chief executive Peter Leaversuch said the national drowning report highlighted the disparity between regional and metropolitan swimming skills.\n\nHe said the skill gap was widening due to accessibility, with inner regional West Australians 1.26 times more likely to drown compared to people in metropolitan areas.\n\nPeter Leaversuch says the population is growing, but school capacity is not. (ABC News: Ruby Littler)\n\nMr Leaversuch said the number of aquatic facilities in WA had remained \"relatively static\", while the population continued to grow.\n\n\"We've gone backward in that regard,\" Mr Leaversuch said.\n\n\"It is concerning to us that in some parts, we have a real demand that isn't being met, and action is required there.\"\n\nMore pools are needed to meet the demand for swimming lessons. (ABC South West: Anna Cox)\n\nCalls for investment\n\nMr Leaversuch said communities needed to plan ahead to curb the problem.\n\n\"We need to long-term plan out where we have safe places to swim … whether that's a pool … or local coastline … we have to find a way,\" Mr Leaversuch said.\n\nInvestment in building new swimming pools was also identified as a solution, a sentiment echoed by private swim school owners.\n\n\"It's a shame it's such an expense, but it is an expense that is for the better of the community,\" Ms Fowler said.\n\n\"These statistics are never going to get better.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-27/labor-and-greens-agree-on-extra-abc-kids-funding/106058638",
        "title": "Labor and Greens agree on extra ABC funding for kids' programs",
        "publish_date": "Thu, 27 Nov 2025 00:32:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "The ABC will receive an extra $50 million in funding as part of a deal between Labor and the Greens to pass legislation forcing streaming services to produce a minimum amount of Australian content.\n\nGreens Senator Sarah Hanson-Young said the party had obtained the $50 million funding commitment from the government as part of negotiations over the local content requirement, which she said would allow the broadcaster \"to invest in Australian stories, in our kids' content, in our local drama\".\n\n\"It's a good win for our broadcaster, it's a good win for our kids' television and kids' entertainment and it's a good win for Australian jobs,\" she said.\n\nThe legislation will require streaming platforms such as Netflix, Disney+, Amazon Prime and others to commit at least 10 per cent of their local expenditure, or 7.5 per cent of revenue, on Australian content.\n\nThe laws were meant to be in place by July last year, but were delayed due to concerns over how they would interact with a free trade agreement with the US.\n\nEarlier this month, Arts Minister Tony Burke said the laws would improve current inequity, where free-to-air and pay television providers were required to produce Australian content, but the same obligation did not apply to streaming services.\n\n\"Since their introduction in Australia, streaming services have created some extraordinary shows. This obligation will ensure that those stories — our stories — continue to be made,\" Mr Burke said earlier this month.\n\nSenator Hanson-Young said the ABC was \"the heart of Australian storytelling\".\n\n\"By strengthening its capacity to make more children's and drama content, we're ensuring that heart keeps beating strongly.\n\n\"Bluey, Bananas in Pyjamas, Play School and many other successful shows have entertained and educated our kids for decades. This is the new chapter of quality kids' content that parents can trust.\"\n\nMr Burke and the ABC have been contacted for comment.\n\nThe government has confirmed the $50 million figure, which was mentioned by Senator Katy Gallagher at a press conference on Thursday, but has not provided a breakdown of the funding.\n\nSenator Hanson-Young said it was for \"Australian-made children's and drama content\", and Senator Gallagher said it was for \"the production of local content\".\n\nThe Screen Producers Association welcomed the news the bill would likely pass.\n\n\"Today is a landmark day for Australian screen storytelling. It finally puts in place a strong starting point ... that responds to the enormous changes that digital streaming platforms have made to our industry dynamics and viewing habits,\" chief executive Matthew Deaner said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-27/permanent-psychiatrist-roma-rural-queensland-farzin-rezaei/106050574",
        "title": "First permanent psychiatrist appointed in south-west Queensland",
        "publish_date": "Thu, 27 Nov 2025 00:30:25 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Whether you're in Tehran or Thargomindah, Farzin Rezaei says the way the human brain responds to life is essentially the same.\n\n\"Fears and hopes in human beings everywhere are the same,\" Dr Rezaei said.\n\n\"The way frustrations and trauma impact the mind is universal.\"\n\nIt’s just as well because he is the South West Hospital and Health Service's first permanent psychiatrist.\n\nThe search for the role, based in Roma, 480 kilometres west of Brisbane, went global and eventually found the right candidate in a lecture hall at the Tehran University of Medical Sciences.\n\nDr Rezaei will be based out of Roma but will service an area larger than the state of Victoria. (Supplied: Queensland Health)\n\nDr Rezaei said he scored the job after being attracted to Australia following the recommendations of fellow Iranian doctors.\n\n\"They told me Australia is very welcoming and a good place to flourish,\" Dr Rezaei said.\n\n\"The attitude among many people here is that life is as important as work — they don’t forgo connections and relationships at the cost of achievement.\"\n\nDr Rezaei brings more than 20 years’ experience as a psychiatrist and rural GP in Iran.\n\nAlthough his new patients are on the other side of the world from his old ones, Dr Rezaei said he’s excited to use his experience to help people across south-west Queensland.\n\nSouth West Hospital and Health Service acting director of Mental Health Louisa Dufty said the appointment was timely with the mental health crisis in the south-west seemingly getting worse.\n\nLouisa Dufty said Dr Rezaei's appointment will be a \"game changer\" for patients. (ABC Southern Queensland: Dan McCray)\n\n\"I was in a meeting the other day with other mental health service directors, and there seems to be a lot more community members presenting to emergency departments in crisis,\" she said.\n\n\"It’s so good to be able to respond rapidly.\"\n\nThe latest data from the Queensland Mental Health Commission shows there has been a broad decline in the number of suspected suicides over the last five years, however, rates appear to be climbing again.\n\nQueensland Suicide Data, Monthly Report, September 2025. (Supplied: Queensland Mental Health Commission)\n\nFounder of regional mental health initiative Are You Bogged Mate?, Mary O’Brien, said Dr Rezaei’s appointment was a \"huge benefit\" to the region, but there is still a wider problem.\n\n\"I have personally taken people to Roma Hospital who sat there for a week before they could see a psychiatrist — it was horrendous,\" Ms O’Brien said.\n\n\"So being able to access those services in their own area is good.\"\n\nMs O'Brien said men, in regional areas in particular, still dislike discussing their mental health.\n\nShe said some are still dealing with the stigma around seeking help and feel like they need to \"tough it out\".\n\nMary O’Brien said some men in regional areas still don't like discussing their mental health.\n\n\"They just need to know there are male-friendly services out there — that’s why I’m a big advocate for call or text services, so they don’t have to sit in an office and be stared in the eye and asked about their feelings.\"\n\nLouisa Dufty said having a permanent psychiatrist in the region meant patients will get to know and trust a familiar face.\n\n\"In the past we’ve had visiting psychiatrists supporting our communities, but now we have the opportunity for continuous care,\" Ms Dufty said.\n\n\"Access to mental health is so important — it’s the same as having access to a GP for physical health.\"\n\nAlthough Dr Rezaei will be based in Roma, he will service patients across the far-flung corners of south-west Queensland in towns including St George, Cunnamulla and Charleville.\n\nDr Rezaei acknowledged the challenges of mental health in regional Queensland but remained positive about the future.\n\n\"I chose Roma and the south-west because I love working in rural and regional areas,\" he said.\n\n\"In rural areas, you can see directly the impact of your work. People value connection and relationships, and you get to know each other as a team.\n\n\"I hope it will be very rewarding.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-27/ebike-regulation-changes-to-halt-overpowered-bikes/106050674",
        "title": "The rule change that could stop 'overpowered' e-bikes being brought into Australia",
        "publish_date": "Thu, 27 Nov 2025 00:14:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Planned changes to import rules are expected to cut down on the number of illegally overpowered e-bikes, a form of transport that has taken off in popularity in Sydney's coastal areas.\n\nIndustry experts say \"poor quality products\" have been allowed to flood the Australian market because import controls were relaxed in 2021, which has led to many e-bikes that exceed the 25km/h speed limit being on city streets, and to e-bike battery fires.\n\nFederal Transport Minister Catherine King has announced e-bike import standards will be raised back to the stronger European standard by the end of the year.\n\n\"Good, clear rules around e-bikes are critical to ensuring Australians are safe on the road and riding a compliant bike that isn’t dangerously overpowered,\" Ms King said.\n\nThe European standard, also known as EN-15194, requires that imported e-bikes have a motor that cuts off at 25km/h, a 250-watt limit on power, and for the motor to only assist when pedalling rather than relying on a throttle.\n\nAn estimated 200,000 e-bikes were imported into Australia in 2021. (ABC News: Abubakr Sajid)\n\nThe European standard also introduces an anti-tampering protocol, meaning brands have to do whatever is practical to prevent their bikes from being modified by consumers.\n\nMs King announced the changes after a meeting of state and territory transport ministers last week.\n\nE-bike boom cashed in on relaxed regulations\n\nE-bikes are a common sight in Sydney's Sutherland Shire and Northern Beaches, particularly among high school-aged children and food delivery riders.\n\nIndustry figures suggest the number of e-bikes imported into Australia rose from 9,000 e-bikes in 2017 to 200,000 in 2021.\n\nBefore 2021, the European import standard applied, but regulations were changed to simplify the definition of e-bikes, according to Bicycle Industries Australia general manager Peter Bourke.\n\nE-bikes have become popular with school-aged children in Sydney's coastal suburbs. (ABC Radio Sydney: Declan Bowring)\n\nMr Bourke said the 2021 changes meant importers no longer had to demonstrate that the bikes met any minimum safety standard or notify that they were importing e-bikes.\n\n\"What that did is it effectively removed the safeguards and opened the door for poor quality products that didn't meet minimum standards for speed and power,\" he said.\n\n\"There are some requirements to meet basic electrical standards, but these of course weren't a mandatory requirement to prove they met it.\n\n\"There were also no mechanical standards, because under Australian consumer law, all e-bikes are exempt from meeting basic bicycle standards anyway.\n\n\" So what we've done is we've got a bicycle standard and e-bike standard, and the federal government effectively said you don't need to meet either. \"\n\nMr Bourke said his organisation would lobby for the newly announced changes to be adopted into road regulations by state governments to make it easier for police to enforce rules against modified e-bikes.\n\nAre there speed limits for e-bikes? Noticing a lot of e-bikes around lately? Here's a state-by-state breakdown of the laws about them.\n\n\"They [riders] will not only have to meet the speeding power restrictions, but they will also have to meet safety restrictions,\" he said.\n\nThe number of children injured while riding e-bikes has risen as e-bikes have become more popular.\n\nRecent data from the Sydney's Children's Hospital Network shows 94 children have presented to hospitals in Sydney because of injuries from riding e-bikes this year, almost triple the figure in 2023.\n\nBicycle NSW chief executive Peter McLean welcomed the changes and said he hoped to see the impact on the ground soon.\n\n\"[The 2021 changes] have allowed for the mass importation of illegal devices,\" Mr McLean said.\n\n\"Certainly fixing up this standard will ensure that things will change reasonably quickly.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-27/social-media-ban-regional-remote-students-boarding-school/106044168",
        "title": "What the social media ban means for rural boarding school students",
        "publish_date": "Wed, 26 Nov 2025 23:47:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "The timing of the national social media ban for children under age 16 has left boarding schools scrambling for ways to help their students navigate being cut off from their friends as the new restrictions come into force over the school holidays.\n\nAustralian Boarding Schools Association (ABSA) members have discussed the implications of the ban, being introduced by the federal government to protect young people from online risks of harmful content.\n\nChief executive officer Richard Stokes said the association's 201 boarding houses already practised mobile phone restrictions with phones taken off students overnight to help with sleep.\n\nThe initial impact of the ban will be felt in mid-December when 76 per cent of Australia's 21,000 boarders head home for the summer holidays — with about 12,460 boarders in year 10 and below cut off from social media.\n\nAustralian Boarding Schools Association chief executive Richard Stokes. (Supplied)\n\n\"I think the timing, it hasn't been thought of well, because the 10th of December is when kids are going home from school, they're on holidays,\" Mr Stokes said.\n\n\"We're a bit worried about that whole mental health issue in that space.\n\n\"They're away from all of their friends, so they can't even talk to them — they'll have to find ways to do it.\"\n\nThe laws will make companies potentially liable if they do not take steps to block young users' access to TikTok, Snapchat, Instagram, Facebook, Threads, Reddit, X, YouTube, Kick and Twitch.\n\nStaying connected while disconnected\n\nFifteen-year-old South Australian student Anabell Bowey lives in Lock, in central Eyre Peninsula, and boards an hour-and-a-half away in Port Lincoln.\n\nShe said most of her friends agreed the ban was a good step but it was inconvenient to have social media taken away until they were 16.\n\n\"It'll be good for a lot of these very younger ones because I know a lot of younger, maybe 10 year olds, who have social media who aren't particularly mature enough for that,\" Anabell said.\n\n\"There's definitely people who have had bad experiences with social media, and I think that the ban will bring those numbers down a lot.\n\n\"But everyone's sort of annoyed that, for our age group, that has birthdays a few months after the ban comes in.\"\n\nWhile Anabell will only be subject to the ban for around two months due to her turning 16 in February next year, she and her friends have discussed how they will stay in touch over the holidays.\n\nBoarding school student Anabell Bowey has exchanged phone numbers with friends to keep in contact over the school holidays when she is home at Lock. (Supplied)\n\n\"We're all going to swap numbers and stuff and still talk, but I know a lot of people who don't like using messenger,\" she said.\n\n\"I think it'll be a good experience to see how I cope without having social media.\n\n\"I might go to my grandma and grandpa's farm a lot more and do a lot more jobs around the house, hopefully, stuff like that.\"\n\nMr Stokes said there were good resources on the eSafety Commissioner's website about the social media ban but said today's teens needed to be taught how to stay connected with each other through alternative platforms.\n\nFrom December 10 companies will be potentially liable if they do not take steps to block young users' access to social media apps. (ABC Eyre Peninsula: Jodie Hamilton)\n\n\"When I grew up, it was the phone in the middle of the house that Mum and Dad could listen to, no matter who I was talking to,\" Mr Stokes said.\n\n\"That's definitely not the life of a teenager today.\n\n\"We're going to have to actually teach them some of the skills to make sure that they can be in contact with their friends during the holidays.\n\n\" Otherwise they're going to be quite lonely. \"\n\nOnline decision could 'follow you years later'\n\nMother of four Kirsty Williams, from Peake Station on the Oodnadatta Track in outback South Australia, said only her eldest child had a mobile phone, as it was a requirement at her Adelaide boarding school.\n\nBut as parents they have not allowed her social media.\n\nLenny, George and Jack Williams have little need for mobile phones on their outback station, keeping busy outdoors after daily screen time for School of the Air. (Supplied: Kirsty Williams)\n\n\"My daughter is the only one without Snapchat and she's not part of the messages and she's asked a few times,\" Ms Williams said.\n\n\"Kids are not mentally mature enough for it [advertising and scrolling] and the uploading of photos can affect them down the future.\n\n\" A decision you make when you are 13 will still follow you 10 years later. \"\n\nShe said her children used the outdoors to fill their time.\n\n\"My three at home have enough screen time with school of the air, so they spend time on their motorbikes, playing cricket on the lawn or they find something to do.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-27/banking-regulator-apra-imposes-home-loan-caps/106058604",
        "title": "Banking regulator APRA to impose home loan caps amid housing boom",
        "publish_date": "Wed, 26 Nov 2025 23:42:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "The banking regulator will impose restrictions on home loans from early next year to limit the number of \"high-risk\" large loans being issued to customers, which could have major implications for home prices.\n\nThe Australian Prudential Regulation Authority (APRA) will impose so-called macroprudential restrictions on home loans from February 1, meaning that no more than 20 per cent of a bank's new loans can have a debt-to-income (DTI) ratio of more than six.\n\nFor example, a household with an annual household income of $100,000 a year receiving a loan greater than $600,000 would be counted towards that limit.\n\nThe regulator says the 20 per cent cap will apply separately to investor and owner-occupier loans, to avoid the risk of investors \"crowding out\" owner-occupier buyers.\n\nAPRA said the 20 per cent cap was expected to bite harder for investors, who tended to borrow more relative to their incomes.\n\nThe Australian Prudential Regulation Authority's chair, John Lonsdale, said the banking regulator was acting pre-emptively to head off risks generated by a booming housing market.\n\n\"One of the key structural risks to system stability that APRA has long been concerned about is high household indebtedness,\" he noted in a statement.\n\n\" Rising indebtedness has in the past often been associated with an increase in riskier lending and rapid growth in property prices. \"\n\nGovernment welcomes move, Greens call for tougher investor limits\n\nWhen asked in a media briefing whether the treasurer, Reserve Bank and other regulators had been consulted about the move, Mr Lonsdale confirmed they had.\n\nTreasurer Jim Chalmers released a statement this morning backing the regulator's action.\n\n\"These are important changes that will help with financial resilience and housing affordability,\" he argued.\n\n\" It's about managing emerging risks in our financial system and will help people into the market. \"\n\nHowever, Greens Senator Barbara Pocock, who recently wrote to the treasurer and APRA calling for macroprudential intervention in home lending, said the limits were not tough enough.\n\nHow Australia's housing market spun out of control Property investment is ingrained in the Australian psyche, but is it too easy to cast landlords as the villain in our housing crisis?\n\n\"$40 billion has gone to investors in the last three months, and APRA and Chalmers need to stop the tens of billions flowing to investors,\" she said.\n\n\"APRA must use all the tools in their toolbox to rein in investor lending that is exacerbating the housing affordability crisis.\"\n\nAustralia's bank regulator has never imposed a cap on high debt-to-income lending before but other nations, such as the UK and New Zealand, have had similar restrictions for many years.\n\nAPRA did impose a 10 per cent per annum limit on investor lending growth in 2014 and added a cap limiting interest-only lending to 30 per cent of new loans in 2017, both of which were removed during 2018.\n\nAustralia's largest recent home price correction occurred during this period from late 2017 to early 2019, where values fell 8.2 per cent nationally, led by an even steeper decline in Sydney.\n\nFew banks and borrowers likely to be affected\n\nThe regulator said, overall, only about 4 per cent of new owner-occupier loans and 10 per cent of new investor loans were above the six-times income threshold, but added that there was a small number of institutions that were already near or above the 20 per cent cap.\n\n\"Although broader risks are contained, we have seen in the past that they can build rapidly when interest rates are low or declining, borrowers extend themselves and competition among banks for new mortgage lending intensifies, which can lead to easing lending standards,\" Mr Lonsdale warned.\n\n\" We will consider additional limits, including investor-specific limits, if we see macrofinancial risks significantly rising or a deterioration in lending standards. \"\n\nAPRA said bridging loans and loans for the construction of new dwellings would be excluded from the cap to avoid wider disruptions across the home building sector and keep out of the way of federal and state government ambitions to increase new home building.\n\nAustralian Banking Association CEO Simon Birmingham welcomed APRA's \"targeted and considered approach\".\n\n\"It is important that settings maintain access to safe financing through banks and not create any barriers that could unduly push borrowers into higher-risk non-bank lenders,\" he said.\n\n\"Whilst macroprudential policy settings are important for financial stability, the best way to address housing affordability is to boost supply, and we therefore welcome APRA's exemption of loans for new dwellings.\"\n\nAPRA does have powers to impose macroprudential controls on entities that it does not normally regulate, such as non-bank lenders, if it believes that their behaviours are creating vulnerabilities for the broader financial system.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-27/uefa-champions-league-wrap-liverpool-loss-arsenal-mbappe/106058376",
        "title": "Liverpool crashes to 72-year first after shocking Champions League loss",
        "publish_date": "Wed, 26 Nov 2025 22:51:52 +0000",
        "category": "sports",
        "authors": [],
        "text": "What might have been deemed a wobble appears to be a full-blown crisis for Arne Slot at Liverpool, with the beleaguered English champions getting thrashed for the third straight game.\n\nIt is now nine defeats in its last 12 games for Liverpool after PSV Eindhoven left Anfield with a 4-1 win in the Champions League. The Reds were coming off 3-0 losses in the Premier League to Manchester City before the international break and Nottingham Forest on Saturday.\n\nThe run of form is Liverpool's worst since 1953-54, and has placed manager Arne Slot under increasing pressure — an inconceivable scenario, given Liverpool cruised to the Premier League title a matter of months ago — and defensive mistakes again led to his team's downfall against PSV.\n\nThe loss made it three consecutive losses by three or more goals for Liverpool for the first time since December 1953.\n\nFirstly, Virgil van Dijk's raised hand touched the ball at a corner to give away a penalty, converted by 36-year-old Ivan Perisic for the opener to the Dutch champions.\n\nDominik Szoboszlai equalised 10 minutes later but after Guus Til regained the lead for PSV, Liverpool centre-back Ibrahima Konate — a target for criticism from fans and pundits alike in recent months — missed the ball completely to let the visitors in on goal again.\n\nAmerican forward Ricardo Pepi shot against the post and Couhaib Driouech was there to convert the rebound.\n\nDriouech added a fourth in stoppage time to complete the humiliation.\n\nMbappé scores a hat-trick in seven minutes\n\nKylian Mbappé (right) scored a hat-trick inside just seven minutes as Real Madrid recorded a comfortable win against Olympiakos. (Getty Images: Alex Pantling)\n\nReal Madrid star Kylian Mbappé has scored the second-fastest hat trick in Champions League history by netting three times in just under seven minutes at Olympiakos on Wednesday in his side's chaotic 4-3 win.\n\nMbappé scored in the 22nd, 24th and 29th minutes — after Chiquinho had put Olympiakos ahead in the eighth. The France international also scored a fourth goal in the 60th after Mehdi Taremi had scored for the hosts in the 52nd.\n\nMohamed Salah's hat-trick for Liverpool at Rangers in 2022 had broken the record for the quickest ever scored in the Champions League, according to UEFA. The Egypt forward needed six minutes, 12 seconds to score his goals after entering the match seven minutes before his opening strike.\n\nIt was Mbappé's fifth hat trick in the Champions League — and second this season. He had scored three times against Kairat in the second round of the league phase.\n\nLionel Messi and Cristiano Ronaldo have eight hat-tricks each in the Champions League, while Robert Lewandowski has six.\n\nMbappé now leads the Champions League in scoring this season with nine goals, three more than Galatasaray's Victor Osimhen.\n\nArsenal top after winning heavyweight clash\n\nArsenal has beaten Bayern Munich for the first time in a decade to maintain its perfect record in this season's Champions League with a 3-1 victory, sending them top of the table.\n\nJurrien Timber headed Mikel Arteta's side in front from a corner after 22 minutes only for Bayern teenager Lennart Karl to equalise in style before half-time.\n\nArsenal dominated the second half and showed their immense squad depth as substitutes Noni Madueke and Gabriel Martinelli scored the goals to make it five wins from five.\n\nThursday's major Champions League results Arsenal 3-1 Bayern Munich\n\n3-1 Bayern Munich Atletico Madrid 2-1 Inter Milan\n\n2-1 Inter Milan Liverpool 1-4 PSV Eindhoven\n\nOlympiakos 3-4 Real Madrid\n\nPSG 5-3 Tottenham\n\nIt proved a quiet return to north London for prolific Bayern striker Harry Kane as his side suffered their first defeat of the season in all competitions.\n\nWith Inter Milan dropping points, Arsenal are now the only team in the competition with a maximum 15 points and look all but assured of a place in the last 16.\n\nSix points clear at the top of the Premier League and Bundesliga respectively and boasting flawless records after four games in the Champions League, Arsenal and Bayern Munich have been Europe's stand-out teams this season.\n\nThe sides met in the quarterfinals two years ago with Bayern coming out on top, but Arsenal have moved to another level since that clash and went into Wednesday's game on a 15-match unbeaten run in all competitions.\n\nWith last-16 spots already looking safe for both clubs, the 15th meeting between them lacked jeopardy, but bragging rights and psychological blows were up for grabs.\n\nIt was Arsenal who emerged with both, thanks to a win that will reverberate around Europe.\n\nAP/Reuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-27/cricket-matt-renshaw-backs-usman-khawaja-amid-test-battle/106058068",
        "title": "Contender for Khawaja's Test spot calls him one of Australia's best ever",
        "publish_date": "Wed, 26 Nov 2025 22:02:13 +0000",
        "category": "sports",
        "authors": [],
        "text": "Matt Renshaw has declared Usman Khawaja one of the best batters Australia has ever produced, backing his Queensland teammate to prevent him from being recalled to the Test team.\n\nAfter struggling with back spasms in Perth, Khawaja is under pressure to save his career, given he has been out of form and turns 39 in December.\n\nBut Renshaw, fresh off a match-winning century for the Bulls against Victoria in the Sheffield Shield, believes Khawaja still has what it takes to face England's fast and furious pace attack in the Ashes.\n\n\"He's got an average over 40 in Test cricket, he's played 85 games, he's one of our best batters,\" Renshaw told reporters at the Australian PGA pro-am at Royal Queensland on Wednesday.\n\nMatt Renshaw has been in tremendous form for Queensland in the Sheffield Shield this season. (Getty Images: Albert Perez)\n\n\"He's one of the best cricketers that Australia's ever produced.\"\n\nKhawaja was supposed to be the Queensland cricketer at the pro-am, but his back issues meant he was replaced by Renshaw.\n\nThe 38-year-old is being assessed further now that he is back in Brisbane, as the back problems are unusual and only flared up on day one.\n\nKhawaja's spasms forced to him bat at number four in the first innings, then he was not required in the stunning day two run chase.\n\n'Breathtaking' Head knock gives Australia chance to solve batting headache Travis Head awes multiple cricket legends with a stunning century in the first Test against England, offering Australia hope that he may well fill what looked like a gaping hole at the top of the batting order.\n\nTravis Head's extraordinary 123 when replacing Khawaja as opener in the second innings has prompted calls for the number five to move up the order permanently.\n\nBut if Australia replace Khawaja and do want a traditional long-form opener, then Renshaw is perfectly placed to do the job.\n\nRenshaw played the last of his 14 Tests in February 2023, when he was a concussion replacement for David Warner during a giant collapse against India in Delhi.\n\nThe left-hander made 112 against the Vics under lights at the Gabba this week, which followed a century and a 51 in his previous Shield outing.\n\nAustralia's next Test will be played with a pink ball in Brisbane, starting December 4.\n\nSince 2021, Renshaw has fired in day-night first-class matches, scoring 312 runs at 62.40 with two centuries from three games.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I'm happy the Queensland selectors probably saw that,\" he said of his latest Shield century.\n\n\"Knowing that we won the game for Queensland was something that was pretty special.\n\n\"We had a few guys missing in that Test squad, so knowing that, as a senior batter for Queensland, standing up and doing my job and getting the win at midnight on day three was pretty nice.\"\n\nHaving two children — Charlotte and Edward — has helped take the stress off wondering if he will receive another Test call-up.\n\n\"Definitely handling it a lot better nowadays, there's a lot more calm in my life,\" Renshaw said.\n\n\"Old Matt Renshaw wouldn't have had to go home and change nappies or wake up in the morning and go to a kids sport game.\n\n\"Stuff like that definitely changes your perspective on a lot of things, so just enjoying where my life is at the moment.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/world/asia/hong-kong-fire-multiple-dead-hundreds-missing-in-fire-engulfing-apartment-buildings-20251127-p5nisj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hong Kong fire live updates: Three men arrested over Tai Po apartment blaze believed to have been ‘grossly negligent’ as death toll rises, hundreds still missing",
        "publish_date": "Thu, 27 Nov 2025 13:00:17 +1100",
        "category": "finance",
        "authors": [
            "Alexander Darling",
            "Daniella Miletic",
            "Josefine Ganko"
        ],
        "text": "Live feeds from the scene in Hong Kong show flames still billowing from several units in three of the eight towers.\n\nThe fire services’ high-rise water cannons are dousing the mid-levels – but below where flames are visible.\n\nFirefighters continue working to extinguish the flames. Credit: AP\n\nCNA’s reporter on the ground has reported firefighters are finding it difficult to put out the flames on higher levels and that the effort may have to continue into the evening.\n\n“One neighbour said he could still not find his wife,” a resident told CNA, a popular broadcaster based in Singapore.\n\n“I know some are still inside the building. Why is no one saving them?”\n\nSmoke is still rising on Thursday morning. Credit: AP\n\nThe air around the Tai Po estate was filled with a burning smell Thursday morning, as explosions were heard on the top floors of 31-story high-rises where water hoses couldn’t reach. Smoke billowed from the complex close to the city’s border with China, which has close to 2,000 units and was undergoing a lengthy renovation.\n\nThree towers remained on fire.\n\nThe aftermath on Thursday morning. Credit: AP\n\nPeter Leung, 71, who lives in the estate and has three friends missing, said he’d paid HK$170,000 (AU $33,000) for the upgrading work.\n\n“The building management told us the exterior walls had damage and needed to be repaired,” he said, after spending the night at a shelter with 100 people.\n\n“But many residents were unwilling to pay that high a price and had filed complaints.”\n\nFirefighters work to extinguish the fire which broke out at Wang Fuk Court on Wednesday afternoon (local time). Credit: AP\n\nThe footbridge linking Tai Po Market MTR station to Kwong Fuk Estate — one of the closest points where the public can see the fire — is packed with residents and reporters, teh South China Morning Post says.\n\nFirefighters survey the scene on Thursday morning (local time). Credit: AP\n\nKwong Fuk Estate, to the north, has at least three shelters open.\n\nStaff at the Hong Kong Children & Youth Service Centre say around 20 affected residents are resting there, while the community hall is hosting more people.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-death-toll-climbs-as-hundreds-missing-in-hong-kong-apartment-blaze-australia-records-biggest-annual-drop-in-emissions-outside-of-pandemic-20251127-p5nisz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Death toll climbs as hundreds missing in Hong Kong apartment blaze; Environment law reforms package will pass Senate today; Joyce to resign from the Nationals",
        "publish_date": "Thu, 27 Nov 2025 12:55:56 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "New journeys will become possible for Melburnians on Sunday, when the Metro Tunnel opens. Other trips will be faster and easier.\n\nFrom February, some Melburnians face slightly longer commutes, or will need to learn a new way of getting around.\n\nFor Harveen Johar, visitor experience officer at the Shrine of Remembrance, the most significant change to the city’s public transport system in 40 years is a welcome one, as his daily commute will be cut by 20 minutes each way.\n\nNow he either drives all the way from Truganina in the outer west or takes two trains and a tram to work.\n\nWhen the tunnel opens, he will drive to a nearby V/Line station, travel to Footscray and change to a Metro train to Anzac station in the Metro Tunnel opposite his workplace.\n\n“It will give me more time to read books, which I can’t do while I’m driving, so it makes even my travel time productive,” he says.\n\nLimited Metro Tunnel services through summer will precede full services on February 1.\n\nClick here to view interactives on how the Metro Tunnel will change the way you travel.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/fast-and-furious-perth-pitch-handed-highest-possible-rating-20251127-p5niw3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Perth’s Ashes pitch was rated ‘very good’. It puts the spotlight back on England’s batting",
        "publish_date": "Thu, 27 Nov 2025 12:40:43 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig",
            "Andrew Wu"
        ],
        "text": "Perth’s fast and furious pitch for the first Ashes Test has been handed the best possible rating by the International Cricket Council, placing further spotlight on England’s poor batting to allow the game to finish inside two days.\n\nMatch referee Ranjan Madugalle, the most senior officiator on the ICC panel, rated the pitch “very good”, which is the highest praise available under the global governing body’s system for pitch assessment.\n\nTravis Head turned the first Test, and the series, on their head. Credit: Getty Images\n\nThe Sri Lankan official’s endorsement of the conditions in Perth will likely rankle many in India – who, led by batting great Sunil Gavaskar, have been critical of what they perceive to be the double standards in commentary regarding bowler-friendly pitches in Australia compared to the subcontinent.\n\nICC regulations state that a “very good” pitch can be characterised as having “good carry, limited seam movement, and consistent bounce early in the match, allowing for a balanced contest between batters and bowlers”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-with-wall-street-on-track-to-extend-winning-streak-20251127-p5nisk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gold stocks and tech lift ASX after Wall Street keeps rising",
        "publish_date": "Thu, 27 Nov 2025 12:39:08 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket stayed higher at lunchtime, extending this week’s winning streak after US stocks rose for a fourth straight day, led by solid gains for technology companies.\n\nThe S&P/ASX 200 rose 26.1 points, or 0.3 per cent, to 8632.60 as of 12.36pm AEDT, led by tech stocks and gold miners. The gains come after the bourse added 0.8 per cent on Wednesday, despite a report showing inflation was higher than expected last month, which further dimmed chances of rate cuts over the coming months. The Australian dollar was trading at US65.29¢.\n\nWall Street’s bright week has continued. Credit: AP\n\nGold producers boosted the mining sector as gold prices advanced on rising expectations of further monetary easing by the Federal Reserve, making the precious metal more attractive to investors to assets with the prospects of paying lower yield. Gold typically benefits when rates are low, as it doesn’t pay interest, so the rate cuts don’t diminish returns.\n\nNorthern Star shares rose 1.7 per cent, Evolution Mining gained 2.1 per cent and Newmont jumped 2.6 per cent. Gold has consolidated above the $US4000-an-ounce threshold after retreating from last month’s peak above $US4380 an ounce. The metal — on track for its best annual performance since 1979 — has risen more than 55 per cent this year.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/high-court-challengers-of-teen-social-media-ban-want-musk-google-to-fund-case-20251127-p5niu6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "High Court challengers of teen social media ban want Musk, Google to fund case",
        "publish_date": "Thu, 27 Nov 2025 12:21:38 +1100",
        "category": "finance",
        "authors": [
            "Brittany Busch"
        ],
        "text": "The backer of a High Court challenge to the government’s teen social media ban has called for the likes of Elon Musk and Google to fund the legal bid, while Labor says it won’t be deterred from pursuing the world-first restrictions.\n\nThe Digital Freedom Project, a campaign group established to oppose the government’s under-16 social media ban, filed a challenge to the nation’s highest court on Wednesday on behalf of two teenage plaintiffs, 15-year-olds Noah Jones and Macy Neyland, who are children of members of the group.\n\nMacy Neyland and Noah Jones are the plaintiffs in the High Court challenge.\n\nThe group’s president and NSW parliamentarian, John Ruddick, said they were seeking an injunction to stop the ban from beginning as planned on December 10, and ultimately hoped to get it thrown out as unconstitutional.\n\n“We’re hoping to get an injunction, which means that the law won’t take effect until the High Court makes its decision, which we expect will be about March next year,” Ruddick said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-wrap-pixies-20251120-p5nh1r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lyrics are king at a Doja Cat show – it’s a shame we can’t hear most of them",
        "publish_date": "Thu, 27 Nov 2025 12:17:41 +1100",
        "category": "entertainment",
        "authors": [
            "Nell Geraets",
            "Andrew Fuhrmann",
            "Thuy On",
            "Karl Quinn"
        ],
        "text": "Prior criticism around the tour’s lack of visuals, structure and outfits are technically warranted – the stage remains unchanged throughout and Doja wears just one costume. But such simplicity keeps all eyes on the so-called queen of rap-pop, whose exaggerated facial expressions offer all the theatrics needed. And when you aren’t looking at Doja, you’re watching her tiger-striped band, many of whom do the robot or roll around on the floor during instrumental interludes. Loading For someone who’s known for sending the occasional barb to fans online (remember when she told us to “get a job”?), there sure is a lot of love in the room. The crowd – many of whom are dressed in ’80s workout gear and inflatable cow costumes – carry Doja through each track, particularly Take Me Dancing and Boss Bitch, singing so loudly it practically drowns out the backing tracks. This clearly tickles Doja, who smiles ear-to-ear each time she holds the mic out. Her commitment to the fans shines brightest when she stops the show to ask the crowd to help get a fan who has fainted to safety. It may not be her strongest gig, but you know you have a star on your hands when a singer who is losing their voice can still make a packed crowd purr.\n\nReviewed by Nell Geraets\n\nDANCE\n\nPieces ★★★\n\nUMAC, Parkville, until November 28 Choreographer Jo Lloyd’s Post Hoc is the standout contribution to this year’s edition of Pieces, the annual Lucy Guerin Inc showcase of short works. It’s a nervy, almost frantic composition, very stark in its arrangement, but with a strange kind of delicacy. Post Hoc by Jo Lloyd. Credit: Georgia Haupt There’s a pleasing sense of return here, since Lloyd also appeared in the inaugural Pieces program 20 years ago. In the decades since, she has emerged as one of her generation’s most prolific, influential and determinedly avant-garde choreographers. Here she works with two recent VCA graduates, Flynn Dakis and Jesper Harrison, who appear small and exposed on the vast UMAC stage. Dressed in bizarre skimpy underwear – one buttock hanging free – they skitter across the space like paper scraps.\n\nThey periodically force themselves together, a brief shove-and-grapple that sends them spiralling to the back of the stage. Duane Morrison’s hectic sound design – full of explosions and muttered curses – creates a sense of impending disaster. The title means “after the fact”, and you can imagine the two dancers scurrying through the remnants of Lloyd’s earlier works, quoting stray forms and phrases, before collapsing together in a heap, as if in imitation of all that gets left behind. Hush by Siobhan McKenna. Credit: Gregory Lorenzutti Two other works complete the program. The first, Siobhan McKenna’s Hush, neatly demonstrates how not-quite-linguistic vocalisations – sighs, hums, gasps and other small breathy noises – operate as meaningful utterances, conveying attitude and affect without words.\n\nThese sounds are bound to physical gestures, which McKenna uses as material for a well-shaped – if not terribly interesting – movement score. McKenna is an accomplished choreographer, but in this piece, I think she might have pushed further into the ambiguities and occasional failures of these non-words. The other work, Lip by Jenni Large, is memorable for its costuming, if nothing else. Large herself appears in a scarlet cap-a-pie outfit designed by Jarred Dewey, with suggestive references to Atsuko Kudo, Martin Margiela and those unsettling fantasy figures associated with Eiko Ishioka. Lip by Jenni Large. Credit: Gregory Lorenzutti It’s a strong statement of aesthetic preferences – part cosplay, part fetishwear – but as a performance, it feels underdone, particularly in its attempt to fold composer Anna Whitaker into the action. The program notes frame the work as a study of revenge cycles, which is plausible: Large is like a spirit of blind red fury, a demon that takes possession of Whitaker. Yet the gradual stripping back of the costume to reveal the real person beneath opens more questions than the piece ultimately resolves.\n\nReviewed by Andrew Fuhrmann\n\nMUSIC\n\nDaniel Müller-Schott with Konstantin Shamray ★★★★★\n\nMelbourne Recital Centre, November 25 German cellist Daniel Müller-Schott has returned to Melbourne, filling Elisabeth Murdoch Hall with the glorious resonance and many-splendoured lyricism of his 1727 “Ex Shapiro” Matteo Goffriller cello. Cellist Daniel Müller-Schott Noting his instrument is almost exactly contemporaneous with Bach’s Cello Suite No. 3 in C major, BWV 1009, Müller-Schott brought an expansive, larger-than-life feeling to this classic. Like the rest of the suite, the Prelude was flexible yet rhythmic, powered by artistic and technical assurance. Other movements were beautifully characterised, with especially telling contrasts between the sprightly Courante and the intense yet subtly coloured Sarabande, while the well-known Bourée and the rustic Gigue were buoyed by joyous rhythmic energy.\n\nTogether with Russian-born, Australian-based pianist Konstantin Shamray, Müller-Schott offered great insights into Shostakovich’s Cello Sonata in D minor, Op. 40. Once again proving himself to be an extraordinary colourist, Müller-Schott gave the opening two themes a life of their own, with exchanges between instruments deftly handled. Loading At the centre of the work, the third-movement Largo became a soul-searing expression of heartache. This vividly etched lament was surrounded by remarkable vigour, both in the second-movement Allegro and in the impish finale. Throughout, the artists harnessed Shostakovich’s formidable array of technical demands to memorable musical ends. From the outset, Brahms’ Cello Sonata No. 2 in F major, Op. 99 overflowed with grandeur and ardent passion. Thanks to the superb instrument, the pizzicato in the Adagio had an unusual depth, while the middle section of the Allegro passionato was yet another instance of the cello’s voice taking on an almost-human quality. The cheerful, hope-giving finale set the seal on arguably one of the best concerts of the year. How wonderful to see Müller-Schott’s generous, open personality and poetic musicianship garner him quite a following of young fans, teeming in the audience and listening with rapt attention.\n\nReviewed by Tony Way\n\nCABARET\n\nMeow Meow’s The Red Shoes ★★★\n\nMalthouse Theatre, until December 6 The original Hans Christian Andersen’s tale involves a girl enamoured with a pair of red shoes. As punishment for her vanity, the shoes are cursed, and she’s forced to dance in them forever. Meow Meow’s The Red Shoes is a retelling of the Hans Christian Anderson classic. Credit: Brett Boardman Even when her feet are amputated, the shoes still dance tauntingly before her. Yes, it’s grim, as a lot of these unvarnished fairytales are wont to be, but this is Meow Meow’s Red Shoes, and she has her own ideas about the classic story. It’s the third iteration in her fairytale series, after The Little Matchstick Girl and The Little Mermaid. The show opens on a comic note with the performer (otherwise known as Melissa Madden Gray) being dragged on stage by her legs. This self-confessed “eternal showgirl” has lost her muse; she’s a marionette slackened with existential angst and more attuned to the sorry, lustreless state of the world.\n\nIndeed, Dann Barber’s set contributes to the post-apocalyptic mood with its mountain of debris and a plastic curtain. Meow Meow climbs up and down this graveyard of rubbish, singing and emoting and resplendent in a black mini dress, bouffant hair and even bigger plumed headgear. The musicians (Mark Jones, Dan Witton and Jethro Woodward) are in distressed tuxedoes, and between them play an astonishing array of instruments including piano, guitar, double bass, drums and tuba. Dann Barber’s set contributes to the post-apocalyptic mood. Credit: Brett Boardman Meow Meow’s energy is unflagging: aside from the actual dancing (sometimes lopsidedly with different footwear), she also hops, crawls and does the splits. She can be vulnerable one moment (hobbling around trying to find her missing red shoe), and brazen the next, in an interactive aside with the audience to “redistribute the wealth”. There’s a lot going on in this digressive show with its various sprays against communism, capitalism and world greed in general. It’s a springboard of ideas, but it’s difficult to find the skein of narrative about the titular red shoes in between all the play and hijinks.\n\nMeow Meow does challenge Andersen (Kanen Breen) at one point about the fairytale’s punitive corrective against a girl who simply wanted to dance. Maybe dancing isn’t the problem, but the cure? Maybe we need more art in our lives? The ambiguities are open to interpretation. Could Red Shoes also be a self-reflexive comment about diva narcissism seeking external validation or the peripatetic career path of artists? Kanen Breen and Meow Meow in Meow Meow’s The Red Shoes. Credit: Brett Boardman In the movie of The Wizard of Oz, after a series of (mis)adventures, Dorothy’s ruby shoes took her home; in this story they have the opposite effect: they’re a talisman of the dangers of creative ambition, of the neverending desire to prove oneself, even if that aspiration can take you (like Meow Meow’s career) far away from home. For those hoping or expecting linearity and cohesion, you’d leave bewildered with this rag-tag assortment of song, dance and spectacle but if you’re a fan of cabaret with a twist of the absurd, Meow Meow’s charisma and rich honeyed tones, Breen’s operatic tenor, and the trio of musicians provide theatrical ballast.\n\nReviewed by Thuy On\n\nMUSIC\n\nRyman Healthcare Spring Gala: Joyce DiDonato ★★★★★\n\nMelbourne Symphony Orchestra, Hamer Hall, November 21 Making her first major Australasian tour, American mezzo-soprano Joyce DiDonato confirmed her reputation as one of this generation’s most compelling classical singers in a memorably sophisticated account of Berlioz’ song cycle Nuits d’été (Summer Nights) with the Melbourne Symphony Orchestra under chief conductor Jaime Martín. American mezzo-soprano Joyce DiDonato performs with the Melbourne Symphony Orchestra. Credit: Laura Manariti DiDonato took evident delight in revealing the elegant sensuality and profound emotion flowing from this supreme expression of French romanticism. Charting a journey from innocence through loss to new life, the six songs were a perfect vehicle for her vocal versatility. Keenly alive to musical and textual nuance, DiDonato’s voice of liquid gold brought simple delight to Villanelle, exquisitely contrasted by the ruminative ecstasy of The Spectre of the Rose in which the climactic line, “I come from paradise” was superbly seductive. Contemplating isolation and death, On the Lagoons, Absence and At the Cemetery brought out the alluring, expressive qualities of her lower range, before radiant enthusiasm marked her sailing to The Unknown Isle.\n\nA generous performer, DiDonato offered two encores: a steamy Habanera from Bizet’s Carmen and then, making a link between her native Kansas and the Land of Oz, a heartwarming rendition of Somewhere Over the Rainbow. Beginning with Rossini’s William Tell overture may seem hackneyed but the initial rapturous cello solo brilliantly delivered by David Berlin offset the all-too-familiar gallop. Jaime Martín conducts the Spring Gala. Credit: Laura Manariti After interval came two-thirds of Respighi’s Roman trilogy: The Fountains of Rome and The Pines of Rome. While the latter undeniably ends in a blaze of glory, such unimaginative programming forfeited the opportunity of introducing a large audience to the least heard and arguably the best of the three suites, The Festivals of Rome. That said, the orchestral playing was consistently engaging and the Berlioz especially was sensitively accompanied. However, the night belonged to DiDonato, who hopefully can dazzle Melbourne again soon.\n\nReviewed by Tony Way\n\nMUSIC\n\nPixies ★★★★\n\nMelbourne Festival Hall, November 19 Female bass players are to the Pixies as drummers are to Spinal Tap: they’ve had a lot of them. Kim Deal (1987-2012), Kim Shattuck (briefly in 2013), Paz Lenchantin (2014-2023) have all come and gone. Black Francis of Pixies performs onstage at Festival Hall, November 19, 2025. Credit: Richard Clifford Now it’s Emma Richardson’s turn to provide the driving bass and sweet harmonies that are so crucial to the Boston-born band’s loud-quiet-loud dynamic. And she stands tall, literally and figuratively, towering over frontman Black Francis, guitarist Joey Santiago and drummer Dave Lovering when the four embrace and take a well-earned bow at the end of their blistering 32-song two-hour set on Wednesday night. This is the back-to-back album show, in which the band play Bossanova (1990) and Trompe le Monde (1991) track by track, throwing in a handful of faves at the end for good measure. On this tour, they alternate set lists across two-night engagements, with the second set featuring a best-of collection from across their catalogue, plus some songs from their new album, The Night the Zombies Came.\n\nPixies are, and always have been, a no-nonsense noise machine. As they take the stage – unadorned, apart from a winged P and four spheres that morph from planets to eyes over the course of the show (nods to the respective albums’ cover art) – Francis takes a sip from a mug and says “hello time travellers” before offering some background on the origins of Cecilia Ann, the opening track on Bossanova (a cover of a Surftones song recorded in 1964 but not released until 1988, its origins are in French composer Gabriel Faure’s Sicilienne … apparently). It’s the fourth time I’ve seen the Pixies live (the first was at their absolute peak in 1989), and before they’ve played a note, Francis has already said a lot more than in the three other shows combined. Pixies are, and always have been, a no-nonsense noise machine. Credit: Richard Clifford He’s in a good mood, and no wonder. The band is tight as, ripping through songs at a rate of knots. “Thank you. The songs are kind of short, I know,” he says at one point. And he’s right. Some barely pass the 90-second mark. His voice is different than it was in 1987, when their debut mini-album Come On Pilgrim blasted onto the world. It’s gruffer, scarred by the screams that litter many tracks, but the counterpoint upper register is still intact. It works.\n\nSantiago’s guitar work is as good as ever, searing, surfy, scintillating, and on Velouria, Allison, Is She Weird and Dig For Fire, the band sounds as good as they ever did. The energy kicks up a notch when they trip into the Trompe set, with barely a pause to note the transition. This is a punkier set of songs, fast and furious, and the crowd becomes more energised as the set wears on. Loading The influence of Pixies, who recorded just four studio albums in their first wave of mutilation before breaking up in 1993 (and another five since reforming in 2004), has been well noted, with Nirvana and Weezer among the many to have paid homage. But on this night, with this set list, the backward lineage was apparent too: a cover of Jesus and Mary Chain’s Head On, the aforementioned Surftones track (and a general infusion of surf-guitar sounds throughout), and, in the final bracket of non-album tracks, Neil Young’s Winterlong. It was a welcome reminder that although it sometimes felt like they’d arrived from nowhere – or, maybe, from outer space – the Pixies were indeed born of this world. They’re strange, jarring, at times unfathomable, but on this form they remain as vital as ever.\n\nReviewed by Karl Quinn\n\nDANCE\n\nBrigid ★★★\n\nDancehouse, until November 22 The room fills with haze while the dancers lie prone, hiding their faces. It’s an opening scene that recalls those old images of Celtic romance: an orange twilight glow, frothing vapours and ancient figures half-buried in the earth. Brigid is an evocation of the pagan Irish goddess of the same name Credit: Agustín Farías Brigid, created by Alice Heyward and Oisín Monaghan, is an evocation of the pagan Irish goddess of the same name, one of the folk divinities of that legendary age before recorded history – the imagined time of the Tuatha Dé Danann. We actually know very little about this daughter of the Dagda. Her story has been partly obscured by the later Saint Brigid of Kildare, the famous abbess and miracle-worker, the so-called Mary of the Gael who turned dirty bathwater into beer.\n\nIn looking back to the older Brigid, Heyward and Monaghan seem to take her obscurity as a cue. This is a work full of uncertainties and strange vacancies amid the rattling, racketing old-style jigging that fills the space. Loading The three performers – Heyward, Monaghan and Oonagh Slater – slowly raise themselves. You feel the heaviness of it, the work of dragging something old and earth-loving back into motion. They fall and fall again, landing with real weight. The dancing arrives gradually. At first, they fall into step together: a fleeting suggestion, perhaps, of the goddess’s triple aspect. Then they separate, moving with apparent freedom across the long, windy gap between lights set at either end of the studio. Monaghan’s boots slap the boards like antique flat irons. Or maybe hammers. Is this a vision of Brigid in her role as patroness of blacksmiths? The loud percussive steps follow closely the work of sound designer Gregor Kompar, who also performs live.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/do-what-s-best-for-your-family-d-day-approaches-in-haas-tug-of-war-20251127-p5niv0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Do what’s best for your family’: D-Day approaches in Haas tug-of-war",
        "publish_date": "Thu, 27 Nov 2025 12:04:59 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "“At the end of the day, you have to do what’s best for your family.”\n\nThat was the declaration of Broncos strike weapon Kotoni Staggs, who refused to be drawn into a multimillion tug-of-war for marquee prop Payne Haas’ signature.\n\nHaas has been linked to a shock defection come the end of his 2026 NRL contract to R360, the renegade rugby union competition that has drawn the ire of sporting bodies around the globe.\n\nBrisbane’s Payne Haas in action during the 2025 grand final. Credit: Getty Images\n\nThe privately funded competition, not sanctioned by World Rugby, is yet to unveil initial recruits, with the concept now reportedly on shaky ground as rugby league and union governing entities desperately seek to keep their talent away from the financial incentives.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/mbappes-champions-league-heroics-20251127-p5niw9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mbappe's Champions League heroics",
        "publish_date": "Thu, 27 Nov 2025 12:04:55 +1100",
        "category": "sports",
        "authors": [],
        "text": "Mbappe's Champions League heroics\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/stranger-things-final-season-is-here-and-it-s-much-darker-than-you-imagined-20251125-p5ni9a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Stranger Things’ final season is here – and it’s much darker than you imagined",
        "publish_date": "Thu, 27 Nov 2025 12:01:00 +1100",
        "category": "entertainment",
        "authors": [
            "Karl Quinn"
        ],
        "text": "Stranger Things (season five, episodes 1-4) ★★★★\n\nAfter more than 9½ years, we are finally in the home stretch of Stranger Things, a show that was as zeitgeisty in its prime as anything so self-consciously not-of-its-time can be.\n\nIt was, and is, the epitome of what LCD Soundsystem’s James Murphy called “borrowed nostalgia for the unremembered ’80s”. Steeped in references to video nasties, synth music, John Hughes movies and, above all, the dark imagination of Stephen King, it remains a masterful interplay of light and dark, funny and tense, playful and deeply serious.\n\nGang of not-such-youths (from left): Gaten Matarazzo as Dustin Henderson, Finn Wolfhard as Mike Wheeler, Caleb McLaughlin as Lucas Sinclair, and Noah Schnapp as Will Byers. Credit: Netflix\n\nYes, there’s a massive suspension of disbelief required to get past the fact our teenage heroes are now played by adults – at least one of whom is now a parent – but look past the disconcerting five o’clock shadow on the face of Lucas (Caleb McLaughlin), and block your ears to the undeniably adult voice and world-weary demeanour of Dustin (Gaten Matarazzo), and it’s still a hell of a ride.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/trump-is-about-to-pick-the-winner-of-his-beauty-parade-20251127-p5niu4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The one credential Trump craves more than anything",
        "publish_date": "Thu, 27 Nov 2025 11:59:03 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Where once Hassett, then regarded as a mainstream economist, advocated a carbon tax on coal and petrol and was pro-immigration and anti-protectionism, now he echoes Trump’s aversion to “green” policies (he, too, lambasts wind turbines for killing birds), is an enthusiastic supporter of the administration’s harsh treatment of immigrants and of Trump’s tariffs. Like Bessent, he says an economic bonanza from the whirlwind of the administration’s policies, particularly the tariffs and Trump’s One Big Beautiful Bill, with its tax cuts for the wealthy and cuts to health and other services for the not-so-wealthy, is just over the horizon. US government deficits and debt, Hassett has claimed, are declining because of Trump’s tariffs. Jerome Powell may make life difficult for Trump by staying on the Fed’s board after his term as chair ends. Credit: AP The deficit has reduced, from $US1.82 trillion ($2.8 trillion) in the 2023-24 financial year under Joe Biden, to $US1.8 trillion. Government debt, however, has risen from $US36.2 trillion at the end of last year to $US38.1 trillion this year and is still climbing, despite the tariff revenues. The administration never lets the facts get in the way of the story.\n\nLoading Hassett fits Trump’s bill for the next chair of the Fed better than any of the other candidates and it will be Trump who makes the final call on who is presented to the Senate for confirmation. That he is favoured by betting markets and Fed watchers and those closest to the administration doesn’t mean his appointment is inevitable, however. As White House spokesperson Karoline Leavitt said this week: “No one really knows what President Trump is going to do until he does it.” What we do know is that the next Fed chair will only be chosen if they agree to do what Trump wants, which means he’ll expect them to get the Fed to slash interest rates. He will also want them to shake up the Fed and its processes, which most of the candidates have signalled they would.\n\nWhether they’d be prepared to do to the Fed what the administration has done to other key US agencies like the Department of Justice – purging the existing staff, replacing them with MAGA people and making it subservient to Trump’s whims – is a more open question, although Hassett, the closest of the candidates to Trump and the Trumpist agenda, might be more willing to pursue that objective than the others. Powell’s term as the Fed’s chair doesn’t end until next May, but his preferred successor will be nominated well before then – Bessent has signalled that it will be before the end of the year – because the administration believes the confirmation process for such a powerful and sensitive position could be protracted. Sharemarkets would welcome Hassett’s appointment but bond investors wouldn’t be quite as enthusiastic. Credit: Bloomberg A chairman-elect, waiting in the wings, could also put pressure on the Fed’s board and members of the 12-person committee that actually sets US monetary policy, the Federal Open Market Committee (FOMC), to fall more into line with Trump’s wishes. Hassett, if he is Trump’s choice, would, of course, be only one of seven Fed governors, albeit the first among equals, and only one of the 12 FOMC’s voting members. (There are another seven regional Fed bank presidents who attend and participate in meetings, but don’t vote.)\n\nThose FOMC members have, unusually for an institution that has generally been consensus-driven, shown increasingly divergent views this year. There is no guarantee that they will fall into line with the new chair’s wishes. Loading It is also possible that the FOMC members might break with the tradition of appointing the Fed’s chair as chair of their committee. They appoint their chair from within their ranks and could vote for someone else, perhaps even Powell. While Powell’s term as chair ends in May, his term as a governor doesn’t end until 2028. His predecessors have tended to quit the Fed entirely once they have completed their terms at the head of the boardroom table, but there’s no requirement that they do so. Powell hasn’t provided any indication of his intentions but, if he were to hang on, not only would he deny Trump the opportunity to appoint another governor – the new chair would have to be slotted into the seat being kept warm until February by another Trump loyalist, Stephen Miran – but there would potentially be a countervailing influence within the Fed and FOMC to Trump’s chair.\n\nThere’s another potential source of opposition. What we do know is that the next Fed chair will only be chosen if they agree to do what Trump wants, which means he’ll expect them to get the Fed to slash interest rates. Sharemarket and crypto investors and the artificial intelligence companies investing increasingly expensive trillions of dollars of capital would love Hassett to be appointed. Lower interest rates are supportive of equity and crypto values. Rates as low as those Trump wants would potentially turbocharge risk assets, boost near-term economic growth and (which is another reason for Trump’s advocacy of slashing rates) significantly lower the interest costs of the US government’s debt. Investors in bonds wouldn’t be quite as enthusiastic. Inflation is their bete noir and slashing rates while the US inflation rate (3 per cent and edging up as the effects of Trump’s tariffs are starting to show up) is well above the Fed’s 2 per cent target is a recipe for accelerating inflation.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/broncos-not-rushing-mega-haas-decision-20251127-p5nixx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Broncos not rushing mega Haas decision",
        "publish_date": "Thu, 27 Nov 2025 11:55:50 +1100",
        "category": "sports",
        "authors": [],
        "text": "Broncos not rushing mega Haas decision\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/tax-free-ev-s-run-out-of-road-as-britain-drops-a-budget-bombshell-20251127-p5nisi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tax-free EVs run out of road as Britain drops a budget bombshell",
        "publish_date": "Thu, 27 Nov 2025 11:53:34 +1100",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "And all of this is on top of tax increases worth £40 billion in last year’s budget. Labour is making no bones about its targets. The chancellor, Rachel Reeves, told parliament on Wednesday afternoon (about midnight, AEDT) that she wanted to lift tax rates on income from property, savings and dividends. Loading “I will make further reforms to our tax system today to make it fairer – and to ensure the wealthiest contribute the most,” she said. The new property tax will hit many parts of London and the wealthier regional cities, where families already struggle to buy a home. The “high-value council tax surcharge” will start at £2500 per year in England for residential properties worth £2 million or more.\n\nThe benchmark is very high for most workers, but the base level is about the price of a modern three-bedroom flat in Notting Hill or a two-bedroom in Chelsea – which goes to show that looking for property in fashionable London is only a game for the wealthy. Reeves, again, is unapologetic about making some people pay more. In her budget speech, she said a landlord with income of £25,000 currently pays about £1200 less in tax each year than a tenant who gets the same income as a salary. Does that make her a modern Robin Hood? Not at all. Most workers who pay tax are not getting money back from the government for the simple reason that there is no money to spare. The fact is that Britain’s finances are in a dire state after years of deficits. Despite the tax grabs in this week’s budget, the national debt will be slightly higher as a percentage of the economy than projected in March, says the independent Office for Budget Responsibility (OBR). That is partly because the OBR expects the economy to grow more slowly over the next few years, eking out 1.5 per cent a year compared to the earlier outlook for 1.8 per cent.\n\nGloom on the streets The official forecast matches the gloom on the streets, where small stores complain about shoplifting. While the restaurants are full in the glitzier parts of London, things are quieter in areas where tourists do not roam. Britain’s net financial debt will reach £2.6 trillion this year – and Reeves is warning that 10 per cent of government spending now goes on the interest bill. In Australia, according to the Parliamentary Budget Office, the bill is 3.6 per cent of outlays. This highlights a far more dangerous dynamic for Britain than Australia. Put simply, the markets are dictating terms to London in a way Canberra is yet to see. The more Britain borrows, the edgier the markets get. Liz Truss resigned after just 49 days in office, making her Britain’s shortest-serving prime minister. Credit: Bloomberg\n\nWhile Australia has an AAA credit rating, the UK is considered AA and has a troubled history with the markets. Liz Truss and Kwasi Kwarteng, as prime minister and chancellor of the exchequer, triggered a crisis in October 2022 with their budget plans; both were gone soon afterwards. Reeves could not keep the markets calm without her tax hikes. She could, in theory, slash spending, but the Labour backbench is already restive about the leadership and rebelled against welfare cuts in July. It wanted more spending on welfare, not less. Starmer and Reeves chose not to argue. And this produced the big winners on budget day: families on income support with more than two children. The Conservatives stopped families getting benefits for more than their second child, but Labour will reinstate the old regime. Low-income families will receive more money for their children, funded by higher taxes on workers. Reeves says she is proud to be acting on child poverty, but the debate will grow about the scale of the tax burden and the size of the welfare state. If productivity is lower than the government assumes, the deficits will continue for the decade ahead. And the fact is that British productivity is in the doldrums.\n\nIn the end, the markets seemed to welcome the new plan. The pound rose against the US dollar and the euro. The borrowing costs on British government bonds fell. This was the most important reaction to the budget, given the size of the British debt, but it has no visibility for most of the British media or the public. The run-up to the budget has been dominated by ferocious complaints about tax increases and spending cuts, with scant mention of the size of the interest bill on years of carefree borrowing. Reeves had a glowing forecast for parliament. She said the deficit would be £28.8bn in 2026-27 and then shrink to £4.6 billion the following year. By the subsequent year, she said, Britain would be posting a £3.9 billion surplus, with much bigger ones after that. The forecasts, of course, hardly ever turn out to be true. There is a warning in the analysis from the independent OBR about how it could all go wrong. If productivity is lower than the government assumes, the deficits will continue for the decade ahead. And the fact is that British productivity is in the doldrums. Starmer and Reeves need an economic revival to deliver the budget recovery they promise. The soundtrack to their budget comes from Dusty Springfield, who lived near Notting Hill in the days it was affordable: wishing and a-hoping.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/seven-magic-minutes-from-mbappe-as-liverpool-suffer-another-anfield-horror-show-20251127-p5niut.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Seven magic minutes from Mbappe, while Liverpool suffer another Anfield horror show",
        "publish_date": "Thu, 27 Nov 2025 11:44:03 +1100",
        "category": "sports",
        "authors": [
            "Graham Dunbar"
        ],
        "text": "On a wild Champions League night where teenagers starred, Kylian Mbappé also struck four, including the second-fastest Champions League hat-trick.\n\nArsenal took Bayern Munich’s top spot in the pool standings with a 3-1 win, titleholders Paris Saint-Germain romped to a 5-3 win over Tottenham, while Liverpool slumped to another loss at Anfield, 4-1 against PSV Eindhoven.\n\nThe 26-year-old Mbappé scored three times for Real Madrid between the 22nd and 29th minutes, and again in the 60th, of a 4-3 win at Olympiakos.\n\nAt 17 – the same age Mbappé was when he launched his Champions League career for Monaco – Lennart Karl (Bayern Munich) and Viktor Dadason (FC Copenhagen) scored on Wednesday, and so did 18-year-old Geovany Quenda (Sporting).",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/video/employment-summit-aims-to-boost-opportunities-in-film-industry-for-disabled-australians/ag6wu2hs2",
        "title": "Employment summit aims to boost opportunities in film industry for disabled Australians",
        "publish_date": "Thu, 27 Nov 2025 00:17:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Employment summit aims to boost opportunities in film industry for disabled Australians\n\nPublished 26 November 2025, 6:32 am\n\nSecuring a job in any industry can be a challenge, let alone in film and television. An Australian disability employment summit is seeking to boost representation and provide opportunities for people with disability, both behind, and in front of the camera.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/rising-headline-inflation-and-energy-prices-raise-questions-for-the-government/ipjbnpieq",
        "title": "Rising headline inflation and energy prices raise questions for the Government",
        "publish_date": "Thu, 27 Nov 2025 00:13:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "Rising headline inflation and energy prices raise questions for the Government\n\nPublished 26 November 2025, 6:30 am\n\nThere are fears the next move on interest rates will be up following a stronger than expected rise in inflation which climbed to 3.8 per cent in October. That is above the Reserve Bank's 2 to 3 per cent target band and a 16-month high.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/five-years-in-the-making-environment-laws-to-pass-parliament-albanese-says/jynwe51dr",
        "title": "Major environmental laws are about to pass after 'tough' negotiations, so what are they?",
        "publish_date": "Wed, 26 Nov 2025 21:38:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "Labor has struck a deal with the Greens to pass the largest reforms to Australia's environmental laws in 26 years.\n\n\n\n\n\nPrime Minister Anthony Albanese announced at a press conference on Thursday morning that the government's law reforms would pass parliament later in the day.\n\n\n\n\n\nIt comes more than five years after professor Graeme Samuel delivered his landmark review of Australia's Environment Protection and Biodiversity Conservation Act in 2020.\n\n\n\n\n\n\"This is a landmark day for the environment in this country,\" Albanese told reporters in Canberra.\n\n\n\n\n\nThe seven bills are set to pass the Senate on the final sitting day of the parliamentary year, after passing the lower house last month.\n\n\n\nWhat is in the bill?\n\nThe reforms include new environmental standards to guide project decisions based on environmental impacts and changing the thresholds for accepting or rejecting high-polluting projects.\n\n\n\n\n\nA national Environment Protection Agency (EPA) will be set up, and there will be higher penalties for serious breaches of environmental law.\n\n\n\n\n\nThe environment minister will retain approval powers over the EPA.\n\n\n\nStricter rules will be imposed on land clearing and native forest logging, and companies will need to disclose the greenhouse gas emissions expected from projects when they submit them for approval.\n\n\n\n\n\nCoal and gas projects will not be eligible for \"fast-tracking\" and will also require federal approval for their water use.\n\n\n\n\n\nAlbanese said the government would also establish a $300 million forestry growth fund to support jobs in the industry.\n\n\n\n'Tough' negotiations\n\nEnvironment Minister Murray Watt said the passage of the laws had been \"years in the making\".\n\n\n\n\n\nOn Wednesday, Watt had a flurry of negotiation meetings with both the Greens and the Coalition, having offered both sides a different set of amendments the previous day to get them across the line.\n\n\n\n\n\nIn the concessions sent on Tuesday, seen by SBS News, Labor addressed the Greens' concerns about coal and gas expansion by limiting the fast-tracking of fossil fuel projects and excluding the expansion of coal and gas from the national interest exemption.\n\n\n\n\n\nGreens senator Sarah Hanson-Young told ABC on Thursday morning that there had been \"tough negotiation\" with Labor over the reforms.\n\n\n\n\n\n\"We've put a stop to the fossil fuel industry getting fast track and easy access to environmental approvals.\"\n\n\n\nWhen asked about negotiations with the Coalition, Watt told reporters the Opposition is \"in shambles\" when it comes to policy.\n\n\n\n\n\n\"The Coalition is a shambles, and they've been a shambles on these negotiations as well,\" he said.\n\n\n\n\n\n\"You can't strike a deal with someone who doesn’t know what they want.\"\n\n\n\n\n\nWatt said he has \"great confidence\" in the laws after working with the Greens.\n\n\n\n\n\n\"That gives me confidence that these laws will work for both the environment and for business,\" he said.\n\n\n\n\n\nOpposition leader Sussan Ley described the Labor-Greens partnership as a \"dirty deal\" that will impact cost of living.\n\n\n\n\n\n\"This is going to put energy prices up and provide further pressure on electricity bills for struggling households and families, for the simple reason that the Greens have got what they want,\" Ley said.\n\n\n\n\n\nShe said \"good faith\" conversations between the Coalition and Labor had been taking place until 9:30pm on Wednesday night.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-new-widespread-scam-to-watch-out-for-this-black-friday/2jqkmgtef",
        "title": "The new 'widespread' scam to watch out for this Black Friday",
        "publish_date": "Wed, 26 Nov 2025 18:35:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "While Black Friday officially starts on Friday, sales are already rolling out online as brands jump onto one of the busiest retail periods of the year.\n\n\n\n\n\nBut it can also be a tricky time for consumers navigating impulse buys and trying to work out whether a deal is actually as good as it seems.\n\n\n\n\n\nMore than half (53 per cent) of surveyed shoppers have regretted a purchase or had a negative experience during the Black Friday sales, according to a poll of 1,009 Australians from consumer advocacy group CHOICE.\n\n\n\n\n\nAt least 47 per cent said Black Friday marketing made them feel pressured to buy, while 52 per cent said they spent more than they intended. Some 28 per cent said the goods they received were of lower quality than expected.\n\n\n\nThat last one could be a sign of a new \"widespread\" scam operating in Australia — \"ghost stores\".\n\n\n\n\n\nCatriona Lowe, deputy chair at the Australian Competition and Consumer Commission (ACCC), told SBS World News: \"Increasingly, scammers are utilising technology very effectively.\"\n\n\n\n\n\n\"They are creating websites or emails that can look very convincing, very like a legitimate business or website.\"\n\n\n\nSome 28 per cent of those surveyed said they'd bought something in Black Friday sales that were lower quality than they expected. Source: SBS News Here's what ghost stores are — and how to avoid them this Black Friday.\n\n\n\nWhat are 'ghost stores'?\n\nGhost stores look and feel like legitimate businesses — but they're actually a new type of scam that has the ACCC on alert.\n\n\n\n\n\n\"They're a relatively new type of scam that we've been hearing about more over the last year or so,\" CHOICE's Liam Kennedy said.\n\n\n\n\n\n\"Instead of impersonating established big-name brands, scammers are building these websites which pretend to be local businesses.\"\n\n\n\nREAD MORE What Black Friday sales shopping does to your brain, and how to stay in control\n\nBut they rarely — if ever — send consumers the product they paid for.\n\n\n\n\n\nProfessor Gary Mortimer, retail marketing researcher at the Queensland University of Technology, told SBS News: \"You tend to find that what you're buying either never turns up at your door or what turns up is basically a poor quality product, despite these ghost stores online looking like top-tier local brands.\"\n\n\n\nTelltale signs of a ghost store\n\nBecause ghost stores are designed to look legitimate, they can be difficult to spot at first glance. But there are a few red flags.\n\n\n\n\n\nThey typically sell clothing and shoes, often advertise through social media, and frequently rebrand under names that use Australian suburbs or cities to appear local.\n\n\n\n\n\n\"They craft a story where they're this long-running business selling good quality products at a small scale, but they've had to close down … there's usually a sob story involved,\" Kennedy said.\n\n\n\nThey also tend to offer unusually steep discounts — often between 70 and 80 per cent — and use countdown timers or language like \"time is running out\" to create urgency, Mortimer said.\n\n\n\n\n\nA quick search on social media can help uncover whether a business is legitimate.\n\n\n\n\n\n\"The ghost stores we saw that were still active on Facebook had just a handful of likes and followers,\" Kennedy said.\n\n\n\n\n\n\"Any sort of local business selling good quality products for a decent amount of time will have much more than that.\n\n\n\n\n\n\"If there's no physical address on its website, that's also a big red flag.\"\n\n\n\nRise of ghost stores\n\nThe consumer watchdog has in recent times warned of a rise in so-called ghost stores — and the urgency of Black Friday sales could make shoppers more susceptible, though the scam operates year-round.\n\n\n\n\n\nIn a July statement, the ACCC said an estimated 360 complaints had been made about 60 online retailers since the beginning of the year.\n\n\n\n\n\nBut the conduct \"appears to be widespread\" with many more likely in operation.\n\n\n\nCanstar spokesperson Eden Radford said Black Friday is a \"prime time for scammers\", who often create a sense of urgency to prey on shoppers.\n\n\n\n\n\n\"Scams, unfortunately, are nothing new to Australians. Canstar data shows 31 per cent receive at least one scam message a day,\" she told SBS News.\n\n\n\n\n\n\"Of those who've fallen victim to a scam, 18 per cent have bought from a ghost store, or a seller that didn't exist.\"\n\n\n\n\n\nKennedy said complaints about ghost stores have increased over the past year, though he notes impersonation scams — where scammers copy big brands — are still more likely to flood the market this Black Friday.\n\n\n\nWhat to do if you've been caught by a ghost store?\n\nWhile ghost stores don't typically steal credit card details, consumers can still lose money if they fall for them.\n\n\n\n\n\nIf you suspect you've been scammed, contact your bank to stop the transaction or lodge a claim for a chargeback, Kennedy said.\n\n\n\n\n\nBut don't bother trying to send poor-quality products back for a refund.\n\n\n\n\n\n\"You end up losing more money on postage — the return addresses that ghost stores provide are often unreliable or fake,\" he said.\n\n\n\nREAD MORE What Black Friday sales shopping does to your brain, and how to stay in control\n\nGhost stores may refuse refunds, offer only partial refunds, or ignore complaints entirely, the ACCC warns.\n\n\n\n\n\nLowe encourages consumers to act quickly: \"If something doesn't feel right, stop the contact. If you have paid money, contact your bank as soon as possible and report the matter to [the ACCC's] ScamWatch.\"\n\n\n\n\n\nMortimer warns consumers to take extra caution during Black Friday and to resist the urge to impulse buy.\n\n\n\n\n\n\"The cautionary note around sales periods is that we're all rushing … We jump onto these sites, put in our credit card details and our order never turns up because it's a ghost store or the quality is incredibly poor,\" he said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/zero-chance-of-interest-rate-cut-soaring-prices-drive-inflation/ko2g8lruo",
        "title": "Was housing the problem in Australia's 'surprising' economic check up?",
        "publish_date": "Wed, 26 Nov 2025 07:07:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Hopes have been dashed for an interest rate cut before Christmas after inflation across the 12 months to October jumped 3.8 per cent, up from 3.6 per cent in September.\n\n\n\n\n\nAustralian Bureau of Statistics (ABS) data released on Wednesday found that while inflation remained flat in the month of October, the annualised jump in consumer price index (CPI) was above the Reserve Bank of Australia's (RBA) goal of 2-3 per cent.\n\n\n\n\n\nThe trimmed mean CPI, a measure of underlying inflation that removes the biggest price swings, also rose, from 3.2 to 3.3 per cent.\n\n\n\n\n\nEconomist Shane Oliver said the figures were \"disappointing\".\n\n\n\n\n\n\"I was a bit surprised the numbers were so high,\" he told SBS News.\n\n\n\n\n\n\"Everything is increasing across the board.\"\n\n\n\n\n\nThe largest contributing factor to rising inflation was housing inflation, which rose 5.9 per cent, followed by food and non-alcoholic beverages at 3.2 per cent, and recreation and culture, which rose 3.2 per cent.\n\n\n\n\n\nEconomists pointed out that rising housing inflation may have been driven by an increase in electricity over the past 12 months, not just the increased costs of purchasing or renting a home.\n\n\n\nWhat's driving housing inflation\n\nIn October, the federal government expanded its Home Guarantee Scheme, which sought to level the playing field for first-home buyers, offering 5 per cent deposits to eligible Australians. At the time, analysts predicted the scheme could drive up house prices.\n\n\n\n\n\nOliver said it was \"too soon to tell\" whether the scheme had contributed to rising inflation, but warned that we could be seeing early effects.\n\n\n\n\n\n\"We've seen both rents and new dwelling prices edge up. We were seeing a nice downtrend in both, but they now seem to be hooking back up again, and that's certainly a concern,\" he said.\n\n\n\n\n\n\"The basic problem is that we have an ongoing shortage of housing, low vacancy rates, and rapidly rising home prices.\n\n\n\n\"When you've got a lack of supply, then you've got strong levels of demand, you end up with rising prices.\"\n\n\n\n\n\nBut former director of economic research at property advertising firm REA Group, Cameron Kushner, said the scheme was \"unlikely\" to have had an impact on inflation.\n\n\n\n\n\n\"It was the first month in which the scheme was available, and the CPI only measures purchasing of new homes by owner-occupiers — I suspect most first home buyers are choosing to purchase established homes,\" he told SBS News.\n\n\n\nHe said monthly housing inflation was low, with a 0.8 per cent fall recorded in October.\n\n\n\n\n\n\"Annual growth in rents and new purchasers by owner-occupiers is lower than a year ago and monthly changes have been steady for some time,\" he said.\n\n\n\nElectricity prices soar\n\nThe ABS \"housing group\" data comprises three elements: the cost of building new dwellings, rents and electricity prices.\n\n\n\n\n\nDiana Mousina, deputy chief economist at AMP, said while rent and the cost of building new dwellings were \"elevated\", the hike was mostly driven by a 37.1 per cent rise in electricity costs, due to the implementation and then removal of electricity rebates from state and territory governments.\n\n\n\n\n\n\"It will even out, but it will take some time,\" Mousina told SBS News.\n\n\n\nLISTEN TO As power prices surge, David has found ways to cut running costs by thousands SBS News 05:34 English\n\nKushner also pointed to the take-up of energy rebates in Queensland and Western Australia.\n\n\n\n\n\n\"The introduction of and then the removal of energy rebates is really what is driving housing inflation,\" he said.\n\n\n\nCash rate disappointment\n\nData insights director at financial comparison site Canstar, Sally Tindall, said inflation was moving in the wrong direction.\n\n\n\n\n\n\"It’s taken the prospect of another rate cut completely off the table. The Board won’t just dismiss a December cut, it’s unlikely it’ll even entertain the idea,\" she said in a statement.\n\n\n\n\n\n\"Consumers were hoping for a bit more relief next year, but this latest CPI read has poured cold water over expectations. If anything, the conversation is now shifting to whether the cutting cycle has already run its course, and potentially, what it would take for the central bank to revert back to hikes.\n\n\n\n\n\n\"While the jump in annual electricity and rent inflation was amplified by the timing of government rebates, once you strip out this volatility, it’s clear these essential costs are still climbing.\"\n\n\n\nWhile the inflation rate was far from the RBA's target between two and three per cent, economists were sure it would not provoke a cash rate increase.\n\n\n\n\n\n\"I'd like to think not,\" Oliver said.\n\n\n\n\n\n\"The figures further reduce the chance of a rate cut, and ensure there's zero chance of a December cut.\"\n\n\n\n\n\n\"But we have to wait for the December data to come out in full. I think the economy's recovery will be slower than the RBA is planning for. But that's probably a 2027 story.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/stronger-inflation-dashes-hopes-of-any-more-interest-rate-cuts/iq21qh7an",
        "title": "Stronger inflation dashes hopes of any more interest rate cuts",
        "publish_date": "Wed, 26 Nov 2025 06:56:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/total-impunity-how-israeli-lawlessness-in-the-west-bank-destroys-the-livelihoods-of-palestinian-farmers/sqhi3yymr",
        "title": "\"Total impunity\": How Israeli lawlessness in the West Bank destroys the livelihoods of Palestinian farmers",
        "publish_date": "Wed, 26 Nov 2025 05:54:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "This story was produced in collaboration with SBS Arabic.\n\n\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"In the end, this is our land, and we must take care of it so that it takes care of us — and we are a stubborn people.\"\n\n\n\n\n\nFor winemaker Sari Kassis, the anxious uncertainty of tomorrow has become a constant part of life.\n\n\n\n\n\nLike others in the West Bank, his family's property has become the target of violent Israeli settler attacks.\n\n\n\n\n\nMoving from Sydney to his family-run vineyard near Birzeit, north of Ramallah, Sari Kassis returned to the land where his family has been growing grapes since the 1990s and olives for much longer.\n\n\n\n\n\nSpeaking to SBS Arabic, Mr Kassis says that a few months ago, Israeli forces in the West Bank announced the creation of a new military security zone in his area.\n\n\n\n\n\n\"We’ve been suffering for months. A few months ago, we received a letter from the Israeli army informing us that the area had been declared a security zone — about seven thousand square meters — which includes our vineyards, agricultural areas, and at the centre of this zone is a new settlement outpost that follows the ideology of Meir Kahane and is supported by the Israeli Minister of Interior. What’s more dangerous is that it also has the backing of the Israeli Minister of Finance.\"\n\n\n\n\n\nLife as a Palestinian in the West Bank has become even more precarious in recent years.\n\n\n\n\n\nFor farmers around the world, forecasting things like the weather can be crucial to a successful yield.\n\n\n\n\n\nBut for farmers in the West Bank, who live under strict and constantly evolving security measures, planning ahead is not so simple.\n\n\n\n\n\n\"Part of the security zone overlaps with our farms. We are required to obtain a permit from the Israeli army to access these areas, under certain conditions. This law depends entirely on the army’s mood. Some days they see us entering our own land and say nothing. Other days, at any moment, they can block access. You go down not knowing what to expect, unsure of the future. For example, we built a water pool on our land — the army waited until we invested everything, finished it, and then they came and destroyed it. So you think twice, three times, ten times before planting anything there.\"\n\n\n\n\n\nIn the centre of the security zone, members of a violent settler group known as 'Hilltop Youth' set up an illegal outpost.\n\n\n\n\n\nAn extremist religious Zionist group, Hilltop Youth follow the teachings of Rabbi Meir Kahane, who taught that all non-Jewish people should be expelled from Israel.\n\n\n\n\n\nSanctioned by Australia, the UK and the European Union, Hilltop Youth are known for their violent extremism and attacks.\n\n\n\n\n\n\"The outpost consists of about seven or eight young Israeli settlers — I think the oldest is in his early twenties. Their main goal is to change the balance between Palestinians and Israelis in the West Bank by forcing Palestinians to flee their farms and lands by any means.\"\n\n\n\n\n\nMeir Kahane advocated for a strict separation of Jewish and non-Jewish people in Israel and proposed a bill saying that any non-Jew in Israel will be forced into slavery or forcibly deported.\n\n\n\n\n\nAccording to the Jerusalem Post*, when Kahane's party was elected in 1984, most of Israeli society was embarrassed by his election and 118 members of the Knesset boycotted him, leaving anytime he spoke.\n\n\n\n\n\nIn recent decades, his influence has grown.\n\n\n\n\n\nThe Jewish Power party, now a major part of Israel's governing coalition, has been described as a \"legal rendition\" of Kahane's party.\n\n\n\n\n\nSarit Michaeli is the International Director at Israeli human rights group B'Tselem.\n\n\n\n\n\nSpeaking to SBS, she says settler attacks are not a fringe phenomenon.\n\n\n\n\n\n\"It's important that people acknowledge that settler violence isn't just some crazy Hilltop Youth running around setting fire to things. We're talking about a group of people who are acting essentially as the informal arm of the Israeli government. They're supported, they're funded, they get political support and backing from the Israeli government, and they're operating on the ground with impunity.\"\n\n\n\n\n\nOften masked, armed and travelling in groups, these gangs of men and boys carry out attacks with almost total impunity.\n\n\n\n\n\nData from Israeli rights group Yesh Din shows that of the 1,701 police investigations into settler attacks in the West Bank between 2005 and 2024, over 93 per cent of cases ended without indictment.\n\n\n\n\n\nSarit Michaeli says there is an unspoken understanding that Israeli forces are not expected to intervene in settler violence.\n\n\n\n\n\n\"Since the establishment of this government, the way Israel has moved to even in deepen its annexation and also signaled both the Army and the police that law enforcement is not warranted, and on the contrary that they shouldn't protect Palestinians from Israeli settlers, that has really created just an absolute free-for-all, when it comes to total impunity of Israeli perpetrators for virtually any, any type of violence against Palestinians. This includes killing as well as daylight robbery, land theft, terrorizing communities, brutalising them.\"\n\n\n\n\n\nSari Kassis says if authorities do show up, their response is often slow and apathetic.\n\n\n\n\n\n\"All we can really do is film them — you take out your phone and just keep recording. They are armed, and they wait for any moment, any excuse to attack you. So you can’t get close — otherwise you give them a pretext. And this specific group has shot at people before, aside from burning cars, homes, and more. We always record and call the Israeli army, informing them that these people have entered our land and they should come remove them. If they do come, it's usually hours later — one patrol says a word or two to the settlers and they leave. But of course the damage is done.\"\n\n\n\n\n\nThe United Nations says the total number of Palestinians killed by Israeli security forces and settlers since October 2023 in the West Bank is now over 1,000.\n\n\n\n\n\nAccording to the UN Office for the Coordination of Humanitarian Affairs, October 2025 saw over 260 settler attacks, an average of eight per day.\n\n\n\n\n\nIn a recent briefing, UN Deputy Special Coordinator for the Middle East Peace Process Ramiz Alakbarov said it was the highest number since monitoring began.\n\n\n\n\n\n\"The settler violence has reached emergency levels. In October, during the olive harvest season, the UN recorded the highest number of settler attacks on Palestinians since the UN monitoring began, an average of eight per day. The olive harvest is an economic and cultural lifeline. These attacks have injured farmers, destroyed olive trees and decimated livelihoods.\"\n\n\n\n\n\nAfter settlers attacked Israeli security forces for dismantling an illegal outpost, Israeli Prime Minister Benjamin Netanyahu offered a rebuke of settler attacks.\n\n\n\n\n\nOpen criticism of settlers from top Israeli officials is extremely rare.\n\n\n\n\n\nFollowing international pressure to address violence in the West Bank, Israeli government spokesperson Shosh Bedrosian says Israel doesn't tolerate the attacks.\n\n\n\n\n\n“Any incidents of lawlessness are dealt with to the full extent of the law. The IDF operates under strict ethical guidelines and international law in Judea and Samaria.\"\n\n\n\n\n\nSarit Michaeli says that such condemnations from high level Israeli officials are not followed by meaningful change.\n\n\n\n\n\n\"When Israeli spokespeople say that this is either a small and unimportant phenomenon or that Israel is doing something to tackle it, they are, they're basically lying, because what Israel is doing is funding, is helping, is enhancing the ability of these settlers, who are organised, who are well established, to do these things, to take these violent actions that we see on a daily basis throughout the West Bank, to simply change irreversibly what we have, you know, the control of the land in reality.\"\n\n\n\n\n\nIn a landmark opinion last July, the International Court of Justice declared Israel’s occupation of Palestinian territory illegal and called for the evacuation of all settlements in the West Bank and East Jerusalem.\n\n\n\n\n\nIn September of 2025, Australia formally recognised Palestinian territories as an independent and sovereign State of Palestine.\n\n\n\n\n\nWith the Israeli Knesset now passing a draft bill that, if approved, will allow Israelis to purchase land in the occupied West Bank, there are fears of further annexation of Palestinian territory.\n\n\n\n\n\nReflecting on his family's deep and historic connections to the land, Sari Kassis says leaving is not an option.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/government-and-coalition-trade-blame-over-higher-inflation-figures-evening-news-bulletin-26-november-2025/0vper5vmx",
        "title": "Government and Coalition trade blame over higher inflation figures | Evening News Bulletin 26 November 2025",
        "publish_date": "Wed, 26 Nov 2025 05:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nVandalism blamed for the latest Optus outage in Melbourne;\n\nAdvocates cheer an EU court ruling on same-sex marriages in the bloc;\n\nMore charges laid over an alleged suspicious betting ring for the Brownlows.\n\nAustralia's inflation rate has officially reached its highest level in 16 months.\n\n\n\n\n\n\n\nThe Australian Bureau of Statistics says the monthly consumer price index is now at 3.8 percent, with electricity increases of just over 37 percent and a rise in housing rents and new dwelling prices contributing to the new tally.\n\n\n\n\n\nThe opposition's Ted O'Brien has told the National Press Club that government policies are to blame.\n\n\n\n\n\n\"I refer to it as Jim-flation or the Jim-flation effect. It is a direct consequence of the spending spree by the Treasurer Jim Chalmers. And it's also why living standards by the way have fallen more sharply in Australia than in any other advanced economy.\"\n\n\n\n\n\nThe Federal Treasurer though says today's higher figure doesn't make Australia different to any other country.\n\n\n\n\n\n\"We won't be taking lectures from the Coalition about responsible economic management. If they'd had their way if they won the election, Australians would be earning less, paying higher income taxes, and there'd be bigger deficits and more debt.\"\n\n\n\n\n\n.\n\n\n\n\n\nOptus says coverage is fully restored after an outage this morning in Melbourne that affected an estimated 14,000 people in Frankston and the Mornington Pensinsula.\n\n\n\n\n\nOptus spokeswoman Jane McNamara says all six impacted sites are back online, and the telco does not believe triple zero calls were disrupted.\n\n\n\n\n\nThe telco says an act of vandalism is the reason for the outage - citing photographic evidence of criminals cutting fibre and removing copper from an aerial line.\n\n\n\n\n\nStill, Victorian Premier Jacinta Allan has told Sky News she is seeking urgent advice on the situation, because the failure is the fourth time in months there has been a major Optus outage.\n\n\n\n\n\n\" Clearly, with this particular telecommunications company, this is another incident that is putting great concern in the community about their ability to connect to emergency services.\"\n\n\n\n\n\n.\n\n\n\n\n\nThe European Union's highest court has ruled that same-sex marriages must be respected throughout the bloc.\n\n\n\n\n\nThe EU Court of Justice has delivered the binding ruling at the request of a Polish court handling the case of two men who were married in Berlin in 2018.\n\n\n\n\n\nThe couple had sued after a Polish registry had refused to transcribe their German marriage certificate on the grounds that Polish law does not allow marriage between people of the same sex.\n\n\n\n\n\nThe lawyer representing the couple, Pawel [ Knut, says the judgement is historic and marks a new beginning.\n\n\n\n\n\n\"Today's decision by the Court of Justice does not introduce marriage equality in Poland, we need to be clear about that. What it does is require recognition of these foreign marriages so that the spouses can claim the rights and obligations that, under various rulings of international courts, already belong to them. It is the opening of a door, the start of a new chapter in the ongoing struggle for equal rights.\"\n\n\n\n\n\n.\n\n\n\n\n\nA WARNING THAT THIS STORY CONTAINS CONTENT THAT MAY BE DISTRESSING FOR SOME LISTENERS\n\n\n\n\n\nA mother who murdered her two young children and put their bodies into suitcases in a storage locker has been sentenced to life in prison in New Zealand.\n\n\n\n\n\nHigh Court Justice Geoffrey Venning says the 45 year old will begin her sentence as a patient in a locked psychiatric facility under New Zealand's compulsory mental health treatment law.\n\n\n\n\n\nHakyung Lee will then return to prison when she is deemed well enough.\n\n\n\n\n\n.\n\n\n\n\n\nDraft laws are being introduced into parliament to ban the use of genetic testing in insurance underwriting.\n\n\n\n\n\nThe current legal framework allow insurers to request and use a life insured’s genetic testing results when considering whether, and on what terms, to offer life insurance to individuals.\n\n\n\n\n\nBut Financial Services Minister Daniel Mulino says there have been cases where people are foregoing potentially lifesaving, clinically relevant genetic testing for fear of the negative impacts on policies.\n\n\n\n\n\n\"People getting genetic tests is on the rise. And that is a good thing. Hundreds of thousands of people are currently getting tests. But what we're also aware of is that there are situations in which some people are not getting tested where it could be to their benefit. So we want to make sure that we boost that overall upward trend by taking away any fear that people might have there would be an impact on their life insurance premiums.\"\n\n\n\n\n\n.\n\n\n\n\n\nA new study has revealed why former Liberal and opposition leader Peter Dutton lost the last election.\n\n\n\n\n\nData from the Australian Election Study has found Peter Dutton was the least popular candidate for prime minister in at least four decades.\n\n\n\n\n\nStudy co-author Ian McAllister says he was the least popular major party leader the AES has ever polled.\n\n\n\n\n\n.\n\n\n\n\n\nTo sport,\n\n\n\n\n\nA fifth man has been arrested over an alleged suspicious A-F-L betting ring.\n\n\n\n\n\nThe 34 year old has been charged by Sports Integrity detectives with 21 counts in relation to gambling on the 2021 and 2022 Brownlow Medal awards.\n\n\n\n\n\nFormer AFL umpire Michael Pell is also facing additional accusations.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-death-toll-climbs-as-hundreds-missing-in-hong-kong-apartment-blaze-australia-records-biggest-annual-drop-in-emissions-outside-of-pandemic-20251127-p5nisz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Death toll climbs as hundreds missing in Hong Kong apartment blaze; Environment law reforms package will pass Senate today; Joyce to resign from the Nationals",
        "publish_date": "Thu, 27 Nov 2025 13:01:35 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "New journeys will become possible for Melburnians on Sunday, when the Metro Tunnel opens. Other trips will be faster and easier.\n\nFrom February, some Melburnians face slightly longer commutes, or will need to learn a new way of getting around.\n\nFor Harveen Johar, visitor experience officer at the Shrine of Remembrance, the most significant change to the city’s public transport system in 40 years is a welcome one, as his daily commute will be cut by 20 minutes each way.\n\nNow he either drives all the way from Truganina in the outer west or takes two trains and a tram to work.\n\nWhen the tunnel opens, he will drive to a nearby V/Line station, travel to Footscray and change to a Metro train to Anzac station in the Metro Tunnel opposite his workplace.\n\n“It will give me more time to read books, which I can’t do while I’m driving, so it makes even my travel time productive,” he says.\n\nLimited Metro Tunnel services through summer will precede full services on February 1.\n\nClick here to view interactives on how the Metro Tunnel will change the way you travel.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/fast-and-furious-perth-pitch-handed-highest-possible-rating-20251127-p5niw3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Perth’s Ashes pitch was rated ‘very good’. It puts the spotlight back on England’s batting",
        "publish_date": "Thu, 27 Nov 2025 12:40:43 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig",
            "Andrew Wu"
        ],
        "text": "Perth’s fast and furious pitch for the first Ashes Test has been handed the best possible rating by the International Cricket Council, placing further spotlight on England’s poor batting to allow the game to finish inside two days.\n\nMatch referee Ranjan Madugalle, the most senior officiator on the ICC panel, rated the pitch “very good”, which is the highest praise available under the global governing body’s system for pitch assessment.\n\nTravis Head turned the first Test, and the series, on their head. Credit: Getty Images\n\nThe Sri Lankan official’s endorsement of the conditions in Perth will likely rankle many in India – who, led by batting great Sunil Gavaskar, have been critical of what they perceive to be the double standards in commentary regarding bowler-friendly pitches in Australia compared to the subcontinent.\n\nICC regulations state that a “very good” pitch can be characterised as having “good carry, limited seam movement, and consistent bounce early in the match, allowing for a balanced contest between batters and bowlers”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-with-wall-street-on-track-to-extend-winning-streak-20251127-p5nisk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Gold stocks and tech lift ASX after Wall Street keeps rising",
        "publish_date": "Thu, 27 Nov 2025 12:39:08 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket stayed higher at lunchtime, extending this week’s winning streak after US stocks rose for a fourth straight day, led by solid gains for technology companies.\n\nThe S&P/ASX 200 rose 26.1 points, or 0.3 per cent, to 8632.60 as of 12.36pm AEDT, led by tech stocks and gold miners. The gains come after the bourse added 0.8 per cent on Wednesday, despite a report showing inflation was higher than expected last month, which further dimmed chances of rate cuts over the coming months. The Australian dollar was trading at US65.29¢.\n\nWall Street’s bright week has continued. Credit: AP\n\nGold producers boosted the mining sector as gold prices advanced on rising expectations of further monetary easing by the Federal Reserve, making the precious metal more attractive to investors to assets with the prospects of paying lower yield. Gold typically benefits when rates are low, as it doesn’t pay interest, so the rate cuts don’t diminish returns.\n\nNorthern Star shares rose 1.7 per cent, Evolution Mining gained 2.1 per cent and Newmont jumped 2.6 per cent. Gold has consolidated above the $US4000-an-ounce threshold after retreating from last month’s peak above $US4380 an ounce. The metal — on track for its best annual performance since 1979 — has risen more than 55 per cent this year.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/high-court-challengers-of-teen-social-media-ban-want-musk-google-to-fund-case-20251127-p5niu6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "High Court challengers of teen social media ban want Musk, Google to fund case",
        "publish_date": "Thu, 27 Nov 2025 12:21:38 +1100",
        "category": "finance",
        "authors": [
            "Brittany Busch"
        ],
        "text": "The backer of a High Court challenge to the government’s teen social media ban has called for the likes of Elon Musk and Google to fund the legal bid, while Labor says it won’t be deterred from pursuing the world-first restrictions.\n\nThe Digital Freedom Project, a campaign group established to oppose the government’s under-16 social media ban, filed a challenge to the nation’s highest court on Wednesday on behalf of two teenage plaintiffs, 15-year-olds Noah Jones and Macy Neyland, who are children of members of the group.\n\nMacy Neyland and Noah Jones are the plaintiffs in the High Court challenge.\n\nThe group’s president and NSW parliamentarian, John Ruddick, said they were seeking an injunction to stop the ban from beginning as planned on December 10, and ultimately hoped to get it thrown out as unconstitutional.\n\n“We’re hoping to get an injunction, which means that the law won’t take effect until the High Court makes its decision, which we expect will be about March next year,” Ruddick said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-wrap-pixies-20251120-p5nh1r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lyrics are king at a Doja Cat show – it’s a shame we can’t hear most of them",
        "publish_date": "Thu, 27 Nov 2025 12:17:41 +1100",
        "category": "entertainment",
        "authors": [
            "Nell Geraets",
            "Andrew Fuhrmann",
            "Thuy On",
            "Karl Quinn"
        ],
        "text": "Prior criticism around the tour’s lack of visuals, structure and outfits are technically warranted – the stage remains unchanged throughout and Doja wears just one costume. But such simplicity keeps all eyes on the so-called queen of rap-pop, whose exaggerated facial expressions offer all the theatrics needed. And when you aren’t looking at Doja, you’re watching her tiger-striped band, many of whom do the robot or roll around on the floor during instrumental interludes. Loading For someone who’s known for sending the occasional barb to fans online (remember when she told us to “get a job”?), there sure is a lot of love in the room. The crowd – many of whom are dressed in ’80s workout gear and inflatable cow costumes – carry Doja through each track, particularly Take Me Dancing and Boss Bitch, singing so loudly it practically drowns out the backing tracks. This clearly tickles Doja, who smiles ear-to-ear each time she holds the mic out. Her commitment to the fans shines brightest when she stops the show to ask the crowd to help get a fan who has fainted to safety. It may not be her strongest gig, but you know you have a star on your hands when a singer who is losing their voice can still make a packed crowd purr.\n\nReviewed by Nell Geraets\n\nDANCE\n\nPieces ★★★\n\nUMAC, Parkville, until November 28 Choreographer Jo Lloyd’s Post Hoc is the standout contribution to this year’s edition of Pieces, the annual Lucy Guerin Inc showcase of short works. It’s a nervy, almost frantic composition, very stark in its arrangement, but with a strange kind of delicacy. Post Hoc by Jo Lloyd. Credit: Georgia Haupt There’s a pleasing sense of return here, since Lloyd also appeared in the inaugural Pieces program 20 years ago. In the decades since, she has emerged as one of her generation’s most prolific, influential and determinedly avant-garde choreographers. Here she works with two recent VCA graduates, Flynn Dakis and Jesper Harrison, who appear small and exposed on the vast UMAC stage. Dressed in bizarre skimpy underwear – one buttock hanging free – they skitter across the space like paper scraps.\n\nThey periodically force themselves together, a brief shove-and-grapple that sends them spiralling to the back of the stage. Duane Morrison’s hectic sound design – full of explosions and muttered curses – creates a sense of impending disaster. The title means “after the fact”, and you can imagine the two dancers scurrying through the remnants of Lloyd’s earlier works, quoting stray forms and phrases, before collapsing together in a heap, as if in imitation of all that gets left behind. Hush by Siobhan McKenna. Credit: Gregory Lorenzutti Two other works complete the program. The first, Siobhan McKenna’s Hush, neatly demonstrates how not-quite-linguistic vocalisations – sighs, hums, gasps and other small breathy noises – operate as meaningful utterances, conveying attitude and affect without words.\n\nThese sounds are bound to physical gestures, which McKenna uses as material for a well-shaped – if not terribly interesting – movement score. McKenna is an accomplished choreographer, but in this piece, I think she might have pushed further into the ambiguities and occasional failures of these non-words. The other work, Lip by Jenni Large, is memorable for its costuming, if nothing else. Large herself appears in a scarlet cap-a-pie outfit designed by Jarred Dewey, with suggestive references to Atsuko Kudo, Martin Margiela and those unsettling fantasy figures associated with Eiko Ishioka. Lip by Jenni Large. Credit: Gregory Lorenzutti It’s a strong statement of aesthetic preferences – part cosplay, part fetishwear – but as a performance, it feels underdone, particularly in its attempt to fold composer Anna Whitaker into the action. The program notes frame the work as a study of revenge cycles, which is plausible: Large is like a spirit of blind red fury, a demon that takes possession of Whitaker. Yet the gradual stripping back of the costume to reveal the real person beneath opens more questions than the piece ultimately resolves.\n\nReviewed by Andrew Fuhrmann\n\nMUSIC\n\nDaniel Müller-Schott with Konstantin Shamray ★★★★★\n\nMelbourne Recital Centre, November 25 German cellist Daniel Müller-Schott has returned to Melbourne, filling Elisabeth Murdoch Hall with the glorious resonance and many-splendoured lyricism of his 1727 “Ex Shapiro” Matteo Goffriller cello. Cellist Daniel Müller-Schott Noting his instrument is almost exactly contemporaneous with Bach’s Cello Suite No. 3 in C major, BWV 1009, Müller-Schott brought an expansive, larger-than-life feeling to this classic. Like the rest of the suite, the Prelude was flexible yet rhythmic, powered by artistic and technical assurance. Other movements were beautifully characterised, with especially telling contrasts between the sprightly Courante and the intense yet subtly coloured Sarabande, while the well-known Bourée and the rustic Gigue were buoyed by joyous rhythmic energy.\n\nTogether with Russian-born, Australian-based pianist Konstantin Shamray, Müller-Schott offered great insights into Shostakovich’s Cello Sonata in D minor, Op. 40. Once again proving himself to be an extraordinary colourist, Müller-Schott gave the opening two themes a life of their own, with exchanges between instruments deftly handled. Loading At the centre of the work, the third-movement Largo became a soul-searing expression of heartache. This vividly etched lament was surrounded by remarkable vigour, both in the second-movement Allegro and in the impish finale. Throughout, the artists harnessed Shostakovich’s formidable array of technical demands to memorable musical ends. From the outset, Brahms’ Cello Sonata No. 2 in F major, Op. 99 overflowed with grandeur and ardent passion. Thanks to the superb instrument, the pizzicato in the Adagio had an unusual depth, while the middle section of the Allegro passionato was yet another instance of the cello’s voice taking on an almost-human quality. The cheerful, hope-giving finale set the seal on arguably one of the best concerts of the year. How wonderful to see Müller-Schott’s generous, open personality and poetic musicianship garner him quite a following of young fans, teeming in the audience and listening with rapt attention.\n\nReviewed by Tony Way\n\nCABARET\n\nMeow Meow’s The Red Shoes ★★★\n\nMalthouse Theatre, until December 6 The original Hans Christian Andersen’s tale involves a girl enamoured with a pair of red shoes. As punishment for her vanity, the shoes are cursed, and she’s forced to dance in them forever. Meow Meow’s The Red Shoes is a retelling of the Hans Christian Anderson classic. Credit: Brett Boardman Even when her feet are amputated, the shoes still dance tauntingly before her. Yes, it’s grim, as a lot of these unvarnished fairytales are wont to be, but this is Meow Meow’s Red Shoes, and she has her own ideas about the classic story. It’s the third iteration in her fairytale series, after The Little Matchstick Girl and The Little Mermaid. The show opens on a comic note with the performer (otherwise known as Melissa Madden Gray) being dragged on stage by her legs. This self-confessed “eternal showgirl” has lost her muse; she’s a marionette slackened with existential angst and more attuned to the sorry, lustreless state of the world.\n\nIndeed, Dann Barber’s set contributes to the post-apocalyptic mood with its mountain of debris and a plastic curtain. Meow Meow climbs up and down this graveyard of rubbish, singing and emoting and resplendent in a black mini dress, bouffant hair and even bigger plumed headgear. The musicians (Mark Jones, Dan Witton and Jethro Woodward) are in distressed tuxedoes, and between them play an astonishing array of instruments including piano, guitar, double bass, drums and tuba. Dann Barber’s set contributes to the post-apocalyptic mood. Credit: Brett Boardman Meow Meow’s energy is unflagging: aside from the actual dancing (sometimes lopsidedly with different footwear), she also hops, crawls and does the splits. She can be vulnerable one moment (hobbling around trying to find her missing red shoe), and brazen the next, in an interactive aside with the audience to “redistribute the wealth”. There’s a lot going on in this digressive show with its various sprays against communism, capitalism and world greed in general. It’s a springboard of ideas, but it’s difficult to find the skein of narrative about the titular red shoes in between all the play and hijinks.\n\nMeow Meow does challenge Andersen (Kanen Breen) at one point about the fairytale’s punitive corrective against a girl who simply wanted to dance. Maybe dancing isn’t the problem, but the cure? Maybe we need more art in our lives? The ambiguities are open to interpretation. Could Red Shoes also be a self-reflexive comment about diva narcissism seeking external validation or the peripatetic career path of artists? Kanen Breen and Meow Meow in Meow Meow’s The Red Shoes. Credit: Brett Boardman In the movie of The Wizard of Oz, after a series of (mis)adventures, Dorothy’s ruby shoes took her home; in this story they have the opposite effect: they’re a talisman of the dangers of creative ambition, of the neverending desire to prove oneself, even if that aspiration can take you (like Meow Meow’s career) far away from home. For those hoping or expecting linearity and cohesion, you’d leave bewildered with this rag-tag assortment of song, dance and spectacle but if you’re a fan of cabaret with a twist of the absurd, Meow Meow’s charisma and rich honeyed tones, Breen’s operatic tenor, and the trio of musicians provide theatrical ballast.\n\nReviewed by Thuy On\n\nMUSIC\n\nRyman Healthcare Spring Gala: Joyce DiDonato ★★★★★\n\nMelbourne Symphony Orchestra, Hamer Hall, November 21 Making her first major Australasian tour, American mezzo-soprano Joyce DiDonato confirmed her reputation as one of this generation’s most compelling classical singers in a memorably sophisticated account of Berlioz’ song cycle Nuits d’été (Summer Nights) with the Melbourne Symphony Orchestra under chief conductor Jaime Martín. American mezzo-soprano Joyce DiDonato performs with the Melbourne Symphony Orchestra. Credit: Laura Manariti DiDonato took evident delight in revealing the elegant sensuality and profound emotion flowing from this supreme expression of French romanticism. Charting a journey from innocence through loss to new life, the six songs were a perfect vehicle for her vocal versatility. Keenly alive to musical and textual nuance, DiDonato’s voice of liquid gold brought simple delight to Villanelle, exquisitely contrasted by the ruminative ecstasy of The Spectre of the Rose in which the climactic line, “I come from paradise” was superbly seductive. Contemplating isolation and death, On the Lagoons, Absence and At the Cemetery brought out the alluring, expressive qualities of her lower range, before radiant enthusiasm marked her sailing to The Unknown Isle.\n\nA generous performer, DiDonato offered two encores: a steamy Habanera from Bizet’s Carmen and then, making a link between her native Kansas and the Land of Oz, a heartwarming rendition of Somewhere Over the Rainbow. Beginning with Rossini’s William Tell overture may seem hackneyed but the initial rapturous cello solo brilliantly delivered by David Berlin offset the all-too-familiar gallop. Jaime Martín conducts the Spring Gala. Credit: Laura Manariti After interval came two-thirds of Respighi’s Roman trilogy: The Fountains of Rome and The Pines of Rome. While the latter undeniably ends in a blaze of glory, such unimaginative programming forfeited the opportunity of introducing a large audience to the least heard and arguably the best of the three suites, The Festivals of Rome. That said, the orchestral playing was consistently engaging and the Berlioz especially was sensitively accompanied. However, the night belonged to DiDonato, who hopefully can dazzle Melbourne again soon.\n\nReviewed by Tony Way\n\nMUSIC\n\nPixies ★★★★\n\nMelbourne Festival Hall, November 19 Female bass players are to the Pixies as drummers are to Spinal Tap: they’ve had a lot of them. Kim Deal (1987-2012), Kim Shattuck (briefly in 2013), Paz Lenchantin (2014-2023) have all come and gone. Black Francis of Pixies performs onstage at Festival Hall, November 19, 2025. Credit: Richard Clifford Now it’s Emma Richardson’s turn to provide the driving bass and sweet harmonies that are so crucial to the Boston-born band’s loud-quiet-loud dynamic. And she stands tall, literally and figuratively, towering over frontman Black Francis, guitarist Joey Santiago and drummer Dave Lovering when the four embrace and take a well-earned bow at the end of their blistering 32-song two-hour set on Wednesday night. This is the back-to-back album show, in which the band play Bossanova (1990) and Trompe le Monde (1991) track by track, throwing in a handful of faves at the end for good measure. On this tour, they alternate set lists across two-night engagements, with the second set featuring a best-of collection from across their catalogue, plus some songs from their new album, The Night the Zombies Came.\n\nPixies are, and always have been, a no-nonsense noise machine. As they take the stage – unadorned, apart from a winged P and four spheres that morph from planets to eyes over the course of the show (nods to the respective albums’ cover art) – Francis takes a sip from a mug and says “hello time travellers” before offering some background on the origins of Cecilia Ann, the opening track on Bossanova (a cover of a Surftones song recorded in 1964 but not released until 1988, its origins are in French composer Gabriel Faure’s Sicilienne … apparently). It’s the fourth time I’ve seen the Pixies live (the first was at their absolute peak in 1989), and before they’ve played a note, Francis has already said a lot more than in the three other shows combined. Pixies are, and always have been, a no-nonsense noise machine. Credit: Richard Clifford He’s in a good mood, and no wonder. The band is tight as, ripping through songs at a rate of knots. “Thank you. The songs are kind of short, I know,” he says at one point. And he’s right. Some barely pass the 90-second mark. His voice is different than it was in 1987, when their debut mini-album Come On Pilgrim blasted onto the world. It’s gruffer, scarred by the screams that litter many tracks, but the counterpoint upper register is still intact. It works.\n\nSantiago’s guitar work is as good as ever, searing, surfy, scintillating, and on Velouria, Allison, Is She Weird and Dig For Fire, the band sounds as good as they ever did. The energy kicks up a notch when they trip into the Trompe set, with barely a pause to note the transition. This is a punkier set of songs, fast and furious, and the crowd becomes more energised as the set wears on. Loading The influence of Pixies, who recorded just four studio albums in their first wave of mutilation before breaking up in 1993 (and another five since reforming in 2004), has been well noted, with Nirvana and Weezer among the many to have paid homage. But on this night, with this set list, the backward lineage was apparent too: a cover of Jesus and Mary Chain’s Head On, the aforementioned Surftones track (and a general infusion of surf-guitar sounds throughout), and, in the final bracket of non-album tracks, Neil Young’s Winterlong. It was a welcome reminder that although it sometimes felt like they’d arrived from nowhere – or, maybe, from outer space – the Pixies were indeed born of this world. They’re strange, jarring, at times unfathomable, but on this form they remain as vital as ever.\n\nReviewed by Karl Quinn\n\nDANCE\n\nBrigid ★★★\n\nDancehouse, until November 22 The room fills with haze while the dancers lie prone, hiding their faces. It’s an opening scene that recalls those old images of Celtic romance: an orange twilight glow, frothing vapours and ancient figures half-buried in the earth. Brigid is an evocation of the pagan Irish goddess of the same name Credit: Agustín Farías Brigid, created by Alice Heyward and Oisín Monaghan, is an evocation of the pagan Irish goddess of the same name, one of the folk divinities of that legendary age before recorded history – the imagined time of the Tuatha Dé Danann. We actually know very little about this daughter of the Dagda. Her story has been partly obscured by the later Saint Brigid of Kildare, the famous abbess and miracle-worker, the so-called Mary of the Gael who turned dirty bathwater into beer.\n\nIn looking back to the older Brigid, Heyward and Monaghan seem to take her obscurity as a cue. This is a work full of uncertainties and strange vacancies amid the rattling, racketing old-style jigging that fills the space. Loading The three performers – Heyward, Monaghan and Oonagh Slater – slowly raise themselves. You feel the heaviness of it, the work of dragging something old and earth-loving back into motion. They fall and fall again, landing with real weight. The dancing arrives gradually. At first, they fall into step together: a fleeting suggestion, perhaps, of the goddess’s triple aspect. Then they separate, moving with apparent freedom across the long, windy gap between lights set at either end of the studio. Monaghan’s boots slap the boards like antique flat irons. Or maybe hammers. Is this a vision of Brigid in her role as patroness of blacksmiths? The loud percussive steps follow closely the work of sound designer Gregor Kompar, who also performs live.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/do-what-s-best-for-your-family-d-day-approaches-in-haas-tug-of-war-20251127-p5niv0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Do what’s best for your family’: D-Day approaches in Haas tug-of-war",
        "publish_date": "Thu, 27 Nov 2025 12:04:59 +1100",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "“At the end of the day, you have to do what’s best for your family.”\n\nThat was the declaration of Broncos strike weapon Kotoni Staggs, who refused to be drawn into a multimillion tug-of-war for marquee prop Payne Haas’ signature.\n\nHaas has been linked to a shock defection come the end of his 2026 NRL contract to R360, the renegade rugby union competition that has drawn the ire of sporting bodies around the globe.\n\nBrisbane’s Payne Haas in action during the 2025 grand final. Credit: Getty Images\n\nThe privately funded competition, not sanctioned by World Rugby, is yet to unveil initial recruits, with the concept now reportedly on shaky ground as rugby league and union governing entities desperately seek to keep their talent away from the financial incentives.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/mbappes-champions-league-heroics-20251127-p5niw9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mbappe's Champions League heroics",
        "publish_date": "Thu, 27 Nov 2025 12:04:55 +1100",
        "category": "sports",
        "authors": [],
        "text": "Mbappe's Champions League heroics\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/stranger-things-final-season-is-here-and-it-s-much-darker-than-you-imagined-20251125-p5ni9a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Stranger Things’ final season is here – and it’s much darker than you imagined",
        "publish_date": "Thu, 27 Nov 2025 12:01:00 +1100",
        "category": "entertainment",
        "authors": [
            "Karl Quinn"
        ],
        "text": "Stranger Things (season five, episodes 1-4) ★★★★\n\nAfter more than 9½ years, we are finally in the home stretch of Stranger Things, a show that was as zeitgeisty in its prime as anything so self-consciously not-of-its-time can be.\n\nIt was, and is, the epitome of what LCD Soundsystem’s James Murphy called “borrowed nostalgia for the unremembered ’80s”. Steeped in references to video nasties, synth music, John Hughes movies and, above all, the dark imagination of Stephen King, it remains a masterful interplay of light and dark, funny and tense, playful and deeply serious.\n\nGang of not-such-youths (from left): Gaten Matarazzo as Dustin Henderson, Finn Wolfhard as Mike Wheeler, Caleb McLaughlin as Lucas Sinclair, and Noah Schnapp as Will Byers. Credit: Netflix\n\nYes, there’s a massive suspension of disbelief required to get past the fact our teenage heroes are now played by adults – at least one of whom is now a parent – but look past the disconcerting five o’clock shadow on the face of Lucas (Caleb McLaughlin), and block your ears to the undeniably adult voice and world-weary demeanour of Dustin (Gaten Matarazzo), and it’s still a hell of a ride.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/trump-is-about-to-pick-the-winner-of-his-beauty-parade-20251127-p5niu4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The one credential Trump craves more than anything",
        "publish_date": "Thu, 27 Nov 2025 11:59:03 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Where once Hassett, then regarded as a mainstream economist, advocated a carbon tax on coal and petrol and was pro-immigration and anti-protectionism, now he echoes Trump’s aversion to “green” policies (he, too, lambasts wind turbines for killing birds), is an enthusiastic supporter of the administration’s harsh treatment of immigrants and of Trump’s tariffs. Like Bessent, he says an economic bonanza from the whirlwind of the administration’s policies, particularly the tariffs and Trump’s One Big Beautiful Bill, with its tax cuts for the wealthy and cuts to health and other services for the not-so-wealthy, is just over the horizon. US government deficits and debt, Hassett has claimed, are declining because of Trump’s tariffs. Jerome Powell may make life difficult for Trump by staying on the Fed’s board after his term as chair ends. Credit: AP The deficit has reduced, from $US1.82 trillion ($2.8 trillion) in the 2023-24 financial year under Joe Biden, to $US1.8 trillion. Government debt, however, has risen from $US36.2 trillion at the end of last year to $US38.1 trillion this year and is still climbing, despite the tariff revenues. The administration never lets the facts get in the way of the story.\n\nLoading Hassett fits Trump’s bill for the next chair of the Fed better than any of the other candidates and it will be Trump who makes the final call on who is presented to the Senate for confirmation. That he is favoured by betting markets and Fed watchers and those closest to the administration doesn’t mean his appointment is inevitable, however. As White House spokesperson Karoline Leavitt said this week: “No one really knows what President Trump is going to do until he does it.” What we do know is that the next Fed chair will only be chosen if they agree to do what Trump wants, which means he’ll expect them to get the Fed to slash interest rates. He will also want them to shake up the Fed and its processes, which most of the candidates have signalled they would.\n\nWhether they’d be prepared to do to the Fed what the administration has done to other key US agencies like the Department of Justice – purging the existing staff, replacing them with MAGA people and making it subservient to Trump’s whims – is a more open question, although Hassett, the closest of the candidates to Trump and the Trumpist agenda, might be more willing to pursue that objective than the others. Powell’s term as the Fed’s chair doesn’t end until next May, but his preferred successor will be nominated well before then – Bessent has signalled that it will be before the end of the year – because the administration believes the confirmation process for such a powerful and sensitive position could be protracted. Sharemarkets would welcome Hassett’s appointment but bond investors wouldn’t be quite as enthusiastic. Credit: Bloomberg A chairman-elect, waiting in the wings, could also put pressure on the Fed’s board and members of the 12-person committee that actually sets US monetary policy, the Federal Open Market Committee (FOMC), to fall more into line with Trump’s wishes. Hassett, if he is Trump’s choice, would, of course, be only one of seven Fed governors, albeit the first among equals, and only one of the 12 FOMC’s voting members. (There are another seven regional Fed bank presidents who attend and participate in meetings, but don’t vote.)\n\nThose FOMC members have, unusually for an institution that has generally been consensus-driven, shown increasingly divergent views this year. There is no guarantee that they will fall into line with the new chair’s wishes. Loading It is also possible that the FOMC members might break with the tradition of appointing the Fed’s chair as chair of their committee. They appoint their chair from within their ranks and could vote for someone else, perhaps even Powell. While Powell’s term as chair ends in May, his term as a governor doesn’t end until 2028. His predecessors have tended to quit the Fed entirely once they have completed their terms at the head of the boardroom table, but there’s no requirement that they do so. Powell hasn’t provided any indication of his intentions but, if he were to hang on, not only would he deny Trump the opportunity to appoint another governor – the new chair would have to be slotted into the seat being kept warm until February by another Trump loyalist, Stephen Miran – but there would potentially be a countervailing influence within the Fed and FOMC to Trump’s chair.\n\nThere’s another potential source of opposition. What we do know is that the next Fed chair will only be chosen if they agree to do what Trump wants, which means he’ll expect them to get the Fed to slash interest rates. Sharemarket and crypto investors and the artificial intelligence companies investing increasingly expensive trillions of dollars of capital would love Hassett to be appointed. Lower interest rates are supportive of equity and crypto values. Rates as low as those Trump wants would potentially turbocharge risk assets, boost near-term economic growth and (which is another reason for Trump’s advocacy of slashing rates) significantly lower the interest costs of the US government’s debt. Investors in bonds wouldn’t be quite as enthusiastic. Inflation is their bete noir and slashing rates while the US inflation rate (3 per cent and edging up as the effects of Trump’s tariffs are starting to show up) is well above the Fed’s 2 per cent target is a recipe for accelerating inflation.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/broncos-not-rushing-mega-haas-decision-20251127-p5nixx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Broncos not rushing mega Haas decision",
        "publish_date": "Thu, 27 Nov 2025 11:55:50 +1100",
        "category": "sports",
        "authors": [],
        "text": "Broncos not rushing mega Haas decision\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/tax-free-ev-s-run-out-of-road-as-britain-drops-a-budget-bombshell-20251127-p5nisi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tax-free EVs run out of road as Britain drops a budget bombshell",
        "publish_date": "Thu, 27 Nov 2025 11:53:34 +1100",
        "category": "finance",
        "authors": [
            "David Crowe"
        ],
        "text": "And all of this is on top of tax increases worth £40 billion in last year’s budget. Labour is making no bones about its targets. The chancellor, Rachel Reeves, told parliament on Wednesday afternoon (about midnight, AEDT) that she wanted to lift tax rates on income from property, savings and dividends. Loading “I will make further reforms to our tax system today to make it fairer – and to ensure the wealthiest contribute the most,” she said. The new property tax will hit many parts of London and the wealthier regional cities, where families already struggle to buy a home. The “high-value council tax surcharge” will start at £2500 per year in England for residential properties worth £2 million or more.\n\nThe benchmark is very high for most workers, but the base level is about the price of a modern three-bedroom flat in Notting Hill or a two-bedroom in Chelsea – which goes to show that looking for property in fashionable London is only a game for the wealthy. Reeves, again, is unapologetic about making some people pay more. In her budget speech, she said a landlord with income of £25,000 currently pays about £1200 less in tax each year than a tenant who gets the same income as a salary. Does that make her a modern Robin Hood? Not at all. Most workers who pay tax are not getting money back from the government for the simple reason that there is no money to spare. The fact is that Britain’s finances are in a dire state after years of deficits. Despite the tax grabs in this week’s budget, the national debt will be slightly higher as a percentage of the economy than projected in March, says the independent Office for Budget Responsibility (OBR). That is partly because the OBR expects the economy to grow more slowly over the next few years, eking out 1.5 per cent a year compared to the earlier outlook for 1.8 per cent.\n\nGloom on the streets The official forecast matches the gloom on the streets, where small stores complain about shoplifting. While the restaurants are full in the glitzier parts of London, things are quieter in areas where tourists do not roam. Britain’s net financial debt will reach £2.6 trillion this year – and Reeves is warning that 10 per cent of government spending now goes on the interest bill. In Australia, according to the Parliamentary Budget Office, the bill is 3.6 per cent of outlays. This highlights a far more dangerous dynamic for Britain than Australia. Put simply, the markets are dictating terms to London in a way Canberra is yet to see. The more Britain borrows, the edgier the markets get. Liz Truss resigned after just 49 days in office, making her Britain’s shortest-serving prime minister. Credit: Bloomberg\n\nWhile Australia has an AAA credit rating, the UK is considered AA and has a troubled history with the markets. Liz Truss and Kwasi Kwarteng, as prime minister and chancellor of the exchequer, triggered a crisis in October 2022 with their budget plans; both were gone soon afterwards. Reeves could not keep the markets calm without her tax hikes. She could, in theory, slash spending, but the Labour backbench is already restive about the leadership and rebelled against welfare cuts in July. It wanted more spending on welfare, not less. Starmer and Reeves chose not to argue. And this produced the big winners on budget day: families on income support with more than two children. The Conservatives stopped families getting benefits for more than their second child, but Labour will reinstate the old regime. Low-income families will receive more money for their children, funded by higher taxes on workers. Reeves says she is proud to be acting on child poverty, but the debate will grow about the scale of the tax burden and the size of the welfare state. If productivity is lower than the government assumes, the deficits will continue for the decade ahead. And the fact is that British productivity is in the doldrums.\n\nIn the end, the markets seemed to welcome the new plan. The pound rose against the US dollar and the euro. The borrowing costs on British government bonds fell. This was the most important reaction to the budget, given the size of the British debt, but it has no visibility for most of the British media or the public. The run-up to the budget has been dominated by ferocious complaints about tax increases and spending cuts, with scant mention of the size of the interest bill on years of carefree borrowing. Reeves had a glowing forecast for parliament. She said the deficit would be £28.8bn in 2026-27 and then shrink to £4.6 billion the following year. By the subsequent year, she said, Britain would be posting a £3.9 billion surplus, with much bigger ones after that. The forecasts, of course, hardly ever turn out to be true. There is a warning in the analysis from the independent OBR about how it could all go wrong. If productivity is lower than the government assumes, the deficits will continue for the decade ahead. And the fact is that British productivity is in the doldrums. Starmer and Reeves need an economic revival to deliver the budget recovery they promise. The soundtrack to their budget comes from Dusty Springfield, who lived near Notting Hill in the days it was affordable: wishing and a-hoping.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/seven-magic-minutes-from-mbappe-as-liverpool-suffer-another-anfield-horror-show-20251127-p5niut.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Seven magic minutes from Mbappe, while Liverpool suffer another Anfield horror show",
        "publish_date": "Thu, 27 Nov 2025 11:44:03 +1100",
        "category": "sports",
        "authors": [
            "Graham Dunbar"
        ],
        "text": "On a wild Champions League night where teenagers starred, Kylian Mbappé also struck four, including the second-fastest Champions League hat-trick.\n\nArsenal took Bayern Munich’s top spot in the pool standings with a 3-1 win, titleholders Paris Saint-Germain romped to a 5-3 win over Tottenham, while Liverpool slumped to another loss at Anfield, 4-1 against PSV Eindhoven.\n\nThe 26-year-old Mbappé scored three times for Real Madrid between the 22nd and 29th minutes, and again in the 60th, of a 4-3 win at Olympiakos.\n\nAt 17 – the same age Mbappé was when he launched his Champions League career for Monaco – Lennart Karl (Bayern Munich) and Viktor Dadason (FC Copenhagen) scored on Wednesday, and so did 18-year-old Geovany Quenda (Sporting).",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/albo-strikes-historic-deal-greens-213730379.html",
        "title": "‘Dirty’: Shock claim on new Aussie laws",
        "publish_date": "2025-11-27T01:26:02Z",
        "category": "finance",
        "authors": [],
        "text": "The Coalition has lashed the government’s negotiation tactics after Labor struck a last-minute deal with the Greens to pass historic changes to Australia’s environmental laws.\n\nAmendments to the government’s Environment Protection and Biodiversity Conservation Act will receive the support of the Greens in the Senate, Environment Minister Murray Watt confirmed on Thursday.\n\n“These reforms will deliver a modern, fit for purpose set of national environmental laws for Australia for a long time to come,” Mr Watt said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAlongside Mr Watt, Anthony Albanese confirmed crucial changes in the EPBC Act would include the establishment of a federal environmental protection agency, national environmental standards, and higher penalties for the most significant breaches of environmental law.\n\nThe Bill will pass on the last sitting day of the year.\n\nHowever, Sussan Ley criticised the Bill being pushed out on the final day of parliament and hit out at the Prime Minister for a “lack of good faith negotiations” with the Coalition.\n\nSussan Ley criticised the EPBC Act changes, describing it as a ‘bad Bill’. Picture: NewsWire / Martin Ollman\n\nAside from the Greens, the Coalition was the other contender to lock in a deal that would pass the EPBC Act changes.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“There actually was no rush to get this done today, and that’s because, in my view, the Labor Party never wanted to do any deal with us,” Ms Ley said.\n\n“They wanted the optics of concluding something, anything on the last sitting day, to cover up their massive, massive failures in terms of the energy projects.”\n\nMs Ley further criticised the deal and claimed it was rushed to pass before the end of the year.\n\n“I come back to the point about the lack of good faith in negotiations because we know that this could have gone into next year,” she said.\n\n“We could have all taken the time to get it right, and the evidence is what you see before you: a dirty deal done with the Greens party.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Any deal done with the Greens that involves our industries that make our country strong, that pay our bills, is not going to be in their interests.”\n\nAs part of working towards a deal, the Coalition provided a list of seven issues with the prospective changes to the EPBC Act – several of these issues were highlighted as areas of improvement in Labor’s announcement earlier that morning.\n\nThe deal means Australia’s environmental laws will be overhauled. Picture: NewsWire / Martin Ollman\n\nAsked whether the Coalition should have conceded to strike a deal, Ms Ley said: “Industry and ourselves were on the same page.\n\n“Now there were seven critical areas, and the fact that the government might have come halfway to meeting half of the things that we wanted them to is not addressing the problem here, which is that this is a bad Bill operating against the interests of industry and business in Australia.”\n\n$300m forestry fund\n\nMr Albanese also announced Labor would establish a $300m forestry growth fund to back forestry and timber workers.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“(It will) deliver a bigger forestry industry that supports more secure jobs, better pay and high value output,” he said.\n\nFor business, Mr Watt said the reforms would respond to the community’s major requests, “which are all designed to speed up decision making and lift productivity by getting business faster yeses and faster nos”.\n\n“These reforms include a new, streamlined assessment pathway to significantly reduce the time frame for proponents who provide sufficient information upfront, new and improved bilateral agreements with states and territories to remove duplication for the assessment and approval of projects,” he said.\n\nEnvironment Minister Murray Watt confirmed a deal had been struck. Picture: NewsWire / Martin Ollman\n\nDespite receiving support from the Greens, Mr Albanese said he still hoped the Coalition would back the Bill but expressed frustration with negotiations with the opposition.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“The problem that we have with the Coalition was that their final letters had in it ‘and there are other things to come’,” he said.\n\n“Now, parliament stops today.\n\n“You can’t, the day, before parliament say, ‘Oh, well, we’ve got some other things, but we can’t tell you what they are yet’.\n\n“It made it impossible.”\n\nMr Albanese said Coalition amendments that were “straight from the business community” had been adopted, including more clarity on the definitions of net gain and unacceptable impacts.\n\nOpposition environment spokeswoman Angie Bell led the Coalition’s case on the EPBC changes. Picture: NewsWire / Martin Ollman\n\nHe said the Greens “showed maturity” in terms of the “things they want (that) they didn’t get”.\n\n“There are a range of things we put forward that I said were not negotiable … And I must say that the Greens were very constructive in those negotiations yesterday, and I thank them for it,” Mr Albanese said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhile the laws are now set to pass, Mr Watt was grilled by reporters on the longevity of the legislation – namely, under a prospective Coalition government.\n\nAsked whether he was concerned the decision to go with the Greens could threaten the lifespan of the new laws, Mr Watt said: “No, I’m not.\n\n“I have made the point that there were some benefits in being able to reach a deal with the Coalition in terms of the enduring nature of the reforms.\n\n“But as all of you can see, every single day for Coalition is a shambles and they’ve been a shambles on these negotiations as well.\n\n“So you can’t strike a deal with someone who doesn’t know what they want.”",
        "source": "Yahoo"
    }
]