[
    {
        "url": "https://www.abc.net.au/news/2026-01-24/fortescue-begins-construction-on-pilbaras-first-wind-farm/106245178",
        "title": "Fortescue hopes Pilbara wind farm will be the 'first of many'",
        "publish_date": "Sat, 24 Jan 2026 01:53:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "Mining giant Fortescue hopes its new wind farm in Western Australia's Pilbara will be the \"first of many\" for the region.\n\nThe construction of 17 wind turbines for a 133 megawatt farm near Nullagine, 1,360 kilometres north east of Perth, officially began this month as part of Fortescue's plan to offset the emissions from its iron ore production by using renewable energy sources.\n\nThe project is expected to be completed in 2027.\n\nFortescue CEO Dino Otranto said the design of the turbines was a \"world first\", and he expected the wind farm to be the first of many for the region.\n\n\"We need lower-cost electricity to stay competitive, and that is what this [wind farm] does,\" he said.\n\nHowever, a renewable energy consultant says while Fortescue is a \"best practice leader\" in operational decarbonisation, he does not expect an influx of new wind farms in Western Australia's north.\n\nWhy wind?\n\nThe Pilbara's mining industry is a significant contributor to WA's carbon footprint, accounting for more than 40 per cent of the state's total emissions.\n\nFrom pit to port, iron ore mining generally involves the use of diesel-powered vehicles like dump trucks, excavators and trains.\n\nCompanies across the region's mining sector have begun investing in renewable energy projects to decarbonise — predominantly solar — and in Fortescue's case, to power electric heavy vehicles.\n\nAn electric excavator trialled by Fortescue in its move towards transitioning to an electric fleet. (Supplied: Fortescue Metals)\n\nYet less than 2 per cent of energy generated in the Pilbara is renewable, according to the state government.\n\nUnlike solar, wind in certain areas has the potential to produce energy during the evening.\n\nMr Otranto said that was why the Nullagine wind farm would complement solar energy.\n\n\"What people don't understand is that we have a huge amount of great wind in the Pilbara as well, and the wind actually blows at night or in the late afternoon and early evening,\" he said.\n\nDino Otranto says the wind farm's design is a \"world first\". (Supplied: Fortescue Metals)\n\n\" For us it's a no-brainer in the Pilbara. \"\n\nThe China-made turbines will have an estimated height of 277 metres, making them taller than any others in Australia.\n\nMr Otranto said taller turbines produced more energy, which meant fewer were required to make the same amount of power.\n\nRenewable energy cost high\n\nFuture Smart Strategies managing director Ray Wills said Fortescue was a \"global, best practice leader\" in operational decarbonisation.\n\nHowever, he said the Nullagine project was \"ambitious\".\n\nRay Wills is a researcher, academic, consultant and futurist with a focus on sustainability and technology. (ABC News: Nicholas Martyr)\n\n\"The Pilbara is a difficult location to work for two reasons — one is the heat and cyclones,\" Professor Wills said.\n\n\"And the second reason is that your workforce has to be more expensive because you're FIFO.\"\n\nThe futurist said he did not think there would be an influx of new wind farms in Northern WA because it was still too expensive compared to the main alternative — solar.\n\nThe capacity of large-scale wind and solar power stations approved by the Clean Energy Regulator in Australia over the last five years. (Source: Clean Energy Regulator)\n\n\"Most certainly, wind has not reduced its price as quickly as solar has,\" he said.\n\n\"It can't be expensive energy, otherwise it will be expensive iron ore and on from there on to green iron.\n\n\"So we need to get the energy price continuously downwards.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-24/inside-the-great-moscow-circus-in-1990/106258358",
        "title": "Malnutrition and the KGB: Running away with the circus in 1990",
        "publish_date": "Sat, 24 Jan 2026 01:17:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "For most people, running away to join the circus is a fantasy or a joke.\n\nBut after graduating from Rosny College in Hobart in 1990, Dave Wellington's joke turned into reality.\n\nWhat was meant to be a few days working for a show in Hobart turned into four months touring around Australia.\n\nAt 18, he and his mates, Gus and Joe, had no idea joining the circus would lead to malnutrition and being watched by the KGB.\n\nDave Wellington pulls a rope in 1990 as a worker with the Great Moscow Circus. (Supplied: Dave Wellington)\n\nWorking 17 hours a day, every day\n\nMr Wellington and his friends responded to an advertisement for labouring work with The Great Moscow Circus performing at the Derwent Entertainment Centre.\n\nThe job involved setting up and packing down the bell tents, stages and circus equipment.\n\nThere were bears, horses, dogs, and lots of Russian performers walking around them.\n\nAfter a few days, they were asked whether they would like to join and travel with the circus as it toured Victoria, New South Wales, and Southeast Asia.\n\nHis mum and dad were less than impressed with his choice to join, as they were hoping he would apply to work at insurance companies or banks.\n\n\"You can imagine the look on both their faces when I said I'm hopping on a plane … and running away with the Moscow circus,\" he told ABC Afternoons.\n\n\"We worked for 17 hours a day on average for 7 days a week … [and] we were paid 2.81 per hour.\n\n\"It was hard work, but it was so enjoyable, and we met so many characters.\"\n\nTrained bears performed for crowds. (Supplied: Dave Wellington)\n\nMalnutrition and exhaustion\n\nAfter a long day's work, Mr Wellington would head back to a caravan he shared with four others.\n\nAs a footy player at the time, he was physically active but said his fitness \"suffered\" over the next few months with the circus.\n\n\"We were living on hamburgers and Cornetto ice creams,\" he said.\n\n\"We just didn't have the ability to go and get fresh food nor did we have any cooking facilities.\n\n\"Despite working hard we didn't look after ourselves too well back then.\n\n\"The rule was in the caravan, we weren't allowed to have any food in the fridge, it was always beers.\n\n\" After around three and a half months, Gus was in hospital with malnutrition, and we were exhausted. \"\n\nDave Wellington told his story on Tasmania Afternoons with ABC Radio Hobart. (Supplied: Dave Wellington)\n\nThe organisers would hire 100 to 200 labourers at each country town to help put the show on, according to Mr Wellington.\n\n\"There were a lot of people who were on the run,\" he said.\n\n\"A lot of blokes would turn up and not even give names, as I can imagine they were on bail and things like that.\n\n\"It was a bit of an eye opener at 18 years of age.\"\n\nThe Great Moscow Circus has been Australian-owned since the Soviet Union collapsed. (Supplied: Great Moscow Circus Facebook)\n\nWatchful eye of the KGB\n\nIn 1990, the Great Moscow Circus was owned and run by the Soviet Union.\n\nThe KGB, or the Komitet Gosudarstvennoi Bezopanosti, were a feared security service for the Soviet Union.\n\n\"The KGB were the security … they were immaculately dressed every day, black shoes, black suit, black tie with a white shirt and scary looking big men,\" Mr Wellington said.\n\n\" The performers were not allowed to roam free, they were not allowed out of the area that was fenced off. \"\n\nHe recalled a night they all snuck out with \"Sasha the bear trainer\", who had too much to drink and they all had to carry him back to the caravans without waking the KGB.\n\nLooking back, he said it was very risky as Sasha would have been sent back to the Soviet Union if caught.\n\nMr Wellington would call his parents from a phone box and remembered his mum threatening to get on a plane to come get him.\n\n\"I said mum there's KGB, and she said, 'Well, they're not going to stop me,'\" he said.\n\nThe Great Moscow Circus tours around Australia. (ABC Wide Bay: Scott Lamond)\n\nBeautiful bonds along the road\n\nIt was a sad goodbye when the time came for the three Tasmanian boys to go home.\n\nMany great relationships were made on the road, but one that stood out to Mr Wellington was a with another performer named Sasha, who was deaf.\n\n\"We were leaving on a bus at 6am and he had the KGB with him at the bus station and we gave him a hug,\" he said.\n\n\"As we drove off, and he was waving, it was just one of those moments where you look back and you think it's amazing to have a bond like that with someone that not only spoke a different language to you, but was also deaf.\"\n\nThe trademark name of the Great Moscow Circus was purchased by an Australian family after the collapse of the Soviet Union in December 1991.\n\nThe circus is still touring Australia today, but has changed since the early 90s, with new performances and regular security guards.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-24/jackson-irvine-returns-for-st-pauli/106265074",
        "title": "Irvine returns for St Pauli in major boost for Socceroos",
        "publish_date": "Sat, 24 Jan 2026 01:17:09 +0000",
        "category": "sports",
        "authors": [],
        "text": "Socceroos midfielder Jackson Irvine has made a quick return from injury to help struggling St Pauli in the Bundesliga.\n\nIn a massive boost for Australian head coach Tony Popovic, Irvine came on as a substitute in the 63rd minute to earn his team a crucial point in their goalless draw against Hamburg on Friday night (Sat AEDT).\n\nBarely 10 days ago, the relegation-threatened German outfit announced Irvine had suffered a foot injury and would be out indefinitely.\n\nHe subsequently missed the losses to Borussia Dortmund (3-2) and Wolfsburg (2-1), which plunged Kiezkicker (Neighbourhood Kickers) to joint-last position in the league.\n\nIrvine has struggled for fitness and form in recent months. (Getty Images via Bundesliga: Boris Streubel )\n\nEarlier this week, though, St Pauli's head coach Alexander Blessin said his skipper was a chance of playing.\n\n\"We are still in the testing phase. So we just have to see how his foot reacts,\" he told a news conference.\n\nThe point against derby rivals Hamburg lifted St Pauli to 16th spot — the relegation play-off position — but Blessin knows they face an uphill struggle.\n\n\"We did too little. We were very inactive, we were too slow. That's why we have to be happy with the point today,\" Blessin said after their lacklustre performance.\n\nOn the fight against relegation, he added: \"It will be difficult. We need to start collecting points.\"\n\nIn August, Hamburg and St Pauli staged the first Hamburg derby in the Bundesliga in 14 years after both teams had stints in the second division. St Pauli won 2-0.\n\nIrvine, who had to undergo foot surgery shortly before the end of last season and was out for a long time, has become a valued and respected member of the team since joining in 2021.\n\nBut he had made only eight appearances before Friday's clash given his injury hassles.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"He's the captain, he's the extended arm of the coaching team, and he's just extremely important,\" Blessin said.\n\nHis speedy return is bound to please the St Pauli faithful and also bring a sigh of relief to Popovic, just five months out from the World Cup to be jointly staged by the United States, Canada and Mexico.\n\nAustralia will play a European qualifier on June 14 (2pm) in Vancouver before meeting the United States on June 20 (5am) in Seattle. The Socceroos then take on Paraguay on June 26 (12pm) in Santa Clara in their final Group D match.\n\nBefore that Popovic's men will play friendlies against Cameroon at the Sydney Football Stadium in Sydney (March 27) and Curacao at AAMI Park in Melbourne (March 31).\n\nIrvine is a vital cog in the Socceroos midfield and with 80 caps and 14 goals will add plenty of experience to the national team.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-24/john-williamson-last-tamworth-country-music-festival-performance/106260430",
        "title": "John Williamson takes his final bow at Tamworth Country Music Festival",
        "publish_date": "Sat, 24 Jan 2026 00:30:27 +0000",
        "category": "sports",
        "authors": [],
        "text": "John Williamson's first memories of Tamworth weren't the famous country music festival, but rather the pain he felt during a rugby match.\n\n\"My earliest memory is playing rugby against one of the Tamworth teams … I actually broke my shoulder and I've still got a wire in it,\" he said.\n\nSince then, his memories of the country music capital have changed to be filled with golden guitars, cowboy boots and plenty of music.\n\nJohn Williamson says 2026 will be his last year performing at Tamworth. (ABC New England: Peter Sanders )\n\n\"I remember the old legends were still going, Slim Dusty and Buddy Williams performing, that's where it all started,\" he said.\n\nAfter nearly 54 years at the festival, the Australian country music legend will headline the Tamworth stage for a final time.\n\n\"I was very much involved from the beginning. I was one of the five that started the Country Music Association of Australia and I've been part of getting it back to belonging to the musicians themselves,\" he said.\n\nThe Tamworth Country Music Festival hosts more than 300,000 attendees every year. (ABC News: Kemii Maguire)\n\n\"I think about all the different things that have happened over the years in Tamworth, all the different friends I've made.\n\n\" I just want everyone to know that I appreciate what Tamworth has done for Aussie songs. \"\n\nAlthough he's stepping away from the festival stage, Williamson said he would continue to write and record music, but he was ready for some time with family.\n\nJohn Williamson describes returning to Tamworth each year as \"nostalgic\". (Supplied: Matt Williams)\n\n\"It's my 56th year in the business and I'm just a bit tired of being away from home,\" he said.\n\n\"I might do the odd local gig … it's just the travelling away and flying on aeroplanes, I'm sick of aeroplanes and sick of airports.\"\n\nWilliamson said he was not sure how he would feel after his final festival show, but he wanted to finish on a high note.\n\n\"I think it's good to pull out while I'm still doing good shows and I'm not having to read the lyrics or have monitors on the stage,\" he said.\n\n\"We'll see how I feel afterwards, but I mean, just about everybody that retires wants to come back and do it again.\"\n\nJohn WIlliamson will say thank you to Tamworth at his final gig. (ABC Western Qld: Grace Nakamura)\n\nWilliamson is ready to hand the reins of Australian country music to the next generation; all he asks is they take care of them.\n\n\"It's time to let the young ones in and do what they want to do,\" he said.\n\n\"Make sure you keep it Australian, be yourself, and sing about what you know in this country.\n\n\"Aussie stories, we want to keep that going. Let's hope we don't let that fade in the future.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-24/triple-j-hottest-100-2025-live-updates/106256428",
        "title": "Live: triple j's Hottest 100 of 2025 is here, but who will be #1?",
        "publish_date": "Sat, 24 Jan 2026 00:24:55 +0000",
        "category": "entertainment",
        "authors": [
            "Velvet Winter",
            "Dan Condon"
        ],
        "text": "It's the biggest day of the musical calendar. Join us as we count down the 100 best songs of 2025 as chosen by triple j listeners.\n\nWill Olivia Dean be the artist we need? Will Keli Holiday be dancing to the #1 spot? Or will it be a wild card that throws us off completely? Only time will tell.\n\nFollow the latest updates in our live blog.\n\nHow to listen:",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-24/perth-film-studios-government-and-industry-hopes-for-success/106259442",
        "title": "Perth's $290m film studios are finished, but there's nothing to shoot yet",
        "publish_date": "Sat, 24 Jan 2026 00:01:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Perth Film Studios appear almost as a mirage on the city's north-eastern fringe, backing onto largely undeveloped bushland as far as the eye can see.\n\nThe 16-hectare site on the fringes of Whiteman Park sits quiet for now, as the spacious buildings are put through their paces to make sure everything is right for the all-important first production.\n\nThe construction of Perth Film Studios was completed this week. (ABC News: Keane Bourke)\n\nMore than $233 million has already been spent creating four sound stages, two annexes and the southern hemisphere's biggest backlot in the hopes of attracting big name productions to the most isolated capital city in the world.\n\nThere's also hair, makeup and costume facilities, workshops to build sets and production offices.\n\nLoading...\n\nAnother $57 million will be spend funding the management and operation of the facility, on top of $32 million of government subsidies dangled in front of prospective projects to lure them west.\n\n\"Around the world there's demand for screen content, whether that's for TV, streaming services, but also the big screen as well, and that's not going anywhere,\" Creative Industries Minister Simone McGurk said on Tuesday, announcing practical completion of the project.\n\nOne of Perth Film Studios' four sound stages. (ABC News: Keane Bourke)\n\n\"So we want to make sure that Western Australia is in a position to lean into that production demand.\"\n\nThe studio is yet to sign its first client — but it's coming soon, the studio's chief Tom Avison promises.\n\nPerth Film Studios CEO Tom Avison says he has \"tremendous confidence\" the studios will be a success. (ABC News: Keane Bourke)\n\n\"Where we are with the conversations right now is exactly where I would expect to be and it gives me tremendous confidence,\" he said.\n\nDiversification plan\n\nThe idea of building a film studio to help diversify WA's mining-reliant economy was floated before the 2021 election.\n\nThen-Premier Mark McGowan had hoped to built it for around $100 million at Fremantle's Victoria Quay.\n\nAn artist's impression of what the film studios in Fremantle at Victoria Quay could have looked like. (Supplied)\n\nBut just over a year later those plans were put on ice after a closer look raised a range of potential problems at the same time construction costs were rising.\n\nMs McGurk was very keen this week to point out the second attempt came in on time and on budget.\n\nThe ultimate hope is for the studios to help grow Western Australia's screen industry by providing local work and training opportunities.\n\nSimone McGurk speaking at the facility's unveiling. (ABC News: Keane Bourke)\n\nMr Avison acknowledged there would always be a need — particularly with the facility's early projects — to bring in experience from interstate and overseas.\n\nBut it's hoped that will change over time.\n\n\"We also want to bring back people, West Australians who felt they've had to move abroad or move elsewhere to work in this industry, they don't have to now, they can come back,\" he said.\n\nAttracting international attention is also in the blueprint.\n\n\"Our dollar is incredibly great for projects not from Australia at the moment, from international, looking to make things on a budget,\" Screenwest CEO Rikki Lea-Bestall said.\n\n\"And the rest of Australia is full most of the time, there is limited infrastructure in Australia and there's limited infrastructure around the world.\n\nRoger Cook described the studio as \"world class\". (ABC News: Keane Bourke)\n\n\"We were only talking to someone this week that is looking at something for eight months down the track and they cannot get into a film studio anywhere else in the entire world.\n\n'A lot riding on it'\n\nRichard Sowada is director of the Revelation Perth International Film Festival and is also optimistic about the studio's potential.\n\n\"When I started working in the WA screen sector more than 30 years ago, there was one feature film produced in WA every three years,\" he said.\n\nCreative Industries Minister Simone McGurk, Perth Film Studios CEO Tom Avison and Premier Roger Cook hope to draw top-tier talent to the new facility. (ABC News: Keane Bourke)\n\n\"Now, it's really, really hard for the production crews to keep up with the work there's so much going on, which is really fantastic.\"\n\nHis one concern is the possibility that incentivising major projects to use the facility will come at the expense of lower-budget productions.\n\n\"Because there's a lot riding on it, and it takes a lot to feed,\" Mr Sowada said.\n\nRichard Sowada has high hopes for what the studio will mean for the local film industry. (Supplied)\n\n\"Because the grassroots in Western Australia, the independent sector, is really doing it on their own — it would be good to see something like this be much more integrated.\"\n\nMs Lea-Bestall was confident the studios would benefit the local independent scene.\n\nAlmost $300 million has been invested in the facility. (ABC News: Keane Bourke)\n\n\"It's going to be a great couple of years,\" she said.\n\n\"It feels like it might have been a long time coming, and we're there.\n\n\"And we all want to make sure we have those opportunities for our kids and future generations to be in diverse industries, so we're very excited about that.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-24/flannel-shirt-deemed-appropriate-council-meeting-attire/106167948",
        "title": "Rural council decides 'flanno' fashion is fine as business attire",
        "publish_date": "Fri, 23 Jan 2026 23:11:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Mark Dal Bon said the community he represents wouldn't recognise him if he dressed in anything other than his black and white plaid shirt.\n\n\"That's how they've always seen me … it makes me feel confident in bringing the issues of the community up there [at council meetings] as well.\"\n\nBut the Griffith City councillor's choice of work attire was put under scrutiny when there were moves to change the dress code for councillors attending meetings late last year.\n\nMark Dal Bon is a councillor in Griffith in southern NSW, who campaigned in his flannel. (ABC Riverina: Nicola Ceccato )\n\nIt was proposed the standard dress code would be 'business casual,' and blazers would be provided for councillors to wear at meetings.\n\nOne submission suggested a councillor attending in a \"clean flannelette shirt and jeans\" may not meet the standard.\n\nCouncil ultimately voted in favour of allowing flannelette shirts at meetings, but the debate has sparked broader discussion in the community about the changing nature of work wardrobes.\n\nFlannelette shirts will now be considered appropriate business attire at Griffith City Council meetings. (ABC News: Jessica Clifford )\n\nA changing landscape\n\nEconomic research released in August 2025 by employment site Indeed, shows job advertisements promoting relaxed dress standards have increased considerably in recent years.\n\nThe research shows employers in the ACT and Queensland are more likely to promote casual dress policies in job advertisements, with remote work driving demand for more comfortable workplace attire.\n\nMr Dal Bon said professionalism should be judged by cleanliness and presentation, rather than formality.\n\n\"You can't just go up in there [council meetings] in singlets, thongs, and shorts. In my flannelette shirt, I feel comfortable, and I personally think I look neat and tidy. I haven't gotten any complaints from the community.\"\n\nCorporate stylist Kim Crowley says work attire standards have become a 'grey area'. (Supplied)\n\nCorporate stylist Kim Crowley said people in politics are in a unique position to strike a balance between reliability and professionalism.\n\n\" For people out in rural areas, I think there is something really key about being able to reflect your people back at you. \"\n\nThe trouble is with old-fashioned menswear suits is that it looks very assertive but can also look too assertive in and amongst people who are outdoors all day, working on farms.\"\n\nMs Crowley pointed to research around 'enclothed cognition,' which suggests clothing can influence performance.\n\n\"If we dress more professionally and like we're going to perform better, our cognitive behaviour actually increases. If you want to be able to be taken seriously and succeed in your workplace, you should dress the part,\" she said.\n\nA 'grey area'\n\nMs Crowley said employers have broadly embraced business casual in recent years, but unclear expectations can cause confusion and even tension.\n\n\"There are always a few people in office environments where they're not getting it right,\" Ms Crowley said.\n\n\"There's a middle ground that could be more relaxed than a suit, but maybe not as relaxed as a flannelette shirt.\n\n\"And the nuances, that's what people miss,\" she said.\n\nMs Crowley said first impressions still mattered, particularly in front-facing roles, where people could be judged \"in the blink of an eye\".\n\nEtiquette expert Amanda King said work attire standards have become too casual over the years. (Supplied. )\n\nAmanda King from the Australian Finishing School said people's work attire standards have changed.\n\n\"I know Australia has a reputation for being quite a casual society, but there is still a level of respect for yourself and for everyone else to put on something clean and decent for the day and put in the effort.\"\n\nShe believes a more formal approach to workwear can help people have more impact and influence in their positions.\n\n\"If you're dressed well and you're dressed appropriately, people treat you better and they respect you. They trust what you're saying a little bit more,\" she said.\n\nBut for Mr Dal Bon, given he's been cleared to wear his beloved flannelettes in council meetings, he won't be changing up his gear anytime soon.\n\n\"As long as people feel comfortable in what they're wearing, I think that's what really brings out the professionalism in them,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-24/australian-open-2026-live-sinner-djokovic-osaka-inglis/106264358",
        "title": "Live: Early start to beat heatwave in Melbourne, as Sinner, Djokovic, Osaka set for centre court",
        "publish_date": "Fri, 23 Jan 2026 23:03:54 +0000",
        "category": "sports",
        "authors": [
            "Andrew Mcgarry",
            "Luke Pentony"
        ],
        "text": "As Melbourne and much of Australia braces for heatwave conditions, day seven of the Australian Open has an early start to maximise play before temperatures peak, as Jannik Sinner, Novak Djokovic and Naomi Osaka feature in matches on centre court.\n\nTemperatures are expected to reach the low 30s by the middle of the day, peaking at 40 degrees later in the afternoon.\n\nTonight, Djokovic will continue his quest for an 11th Australian Open title against Botic van de Zandschulp on Rod Laver Arena, followed by Naomi Osaka taking on Australian qualifier Maddison Inglis.\n\nOthers in action on day seven include women's second seed Iga Świątek, fifth seed Elena Rybakina and Swiss veteran Stan Wawrinka — the latter up against American Taylor Fritz in what could be his last Australian Open match.\n\nFollow all the latest from Melbourne Park in our live blog below.\n\nKey Events Eliot Spizzirri stuns Jannik Sinner taking first set 2 minutes ago Machac takes first set off fifth seed Musetti 39 minutes ago Jannik Sinner next up on RLA 49 minutes ago Show all key events When is Maddison Inglis playing? A By Andrew McGarry There is only one Australian in action in the singles on day seven of the Australian Open, with qualifier Maddison Inglis taking on 16th seed Naomi Osaka in the second match tonight on Rod Laver Arena. Eliot Spizzirri stuns Jannik Sinner taking first set A By Andrew McGarry Eliot Spizzirri is looking right at home at Rod Laver Arena right now (Getty Images) Well, well, well, what have we here? American underdog Eliot Spizzirri is bringing the heat against second seed Jannik Sinner - and he's taken the first set on Rod Laver Arena! Spizzirri is just looking stronger right now, putting Sinner's serve under fierce pressure and more than holding his own. Some great play forced the key break at 5-4. And then Spizzirri swept through his service game to love to take the set 6-4 in 43 minutes. Sinner is not coping with the heat - or Spizzirri's energy. Could we be on for a huge upset? This article contains content that is not available. Heat rising on RLA as Sinner broken again A By Andrew McGarry There is a fascinating encounter on Rod Laver Arena, with American Eliot Spizzirri taking things to two-time champion Jannik Sinner. Spizzirri was broken early, but brought things back to 2-2. However Sinner regained the advantage with a forehand winner to take the sixth game and break for 4-2. But his opponent is going toe-to-toe right now, breaking back again and then holding for 4-4 - Spizzirri has taken the last eight points. Sinner has appeared to be taking his time between points on serve to maximise his time in the shade and recovery from the heat. Like everyone else out here today, he doesn't want to be out here for too long, so it's vital for him to break and take the first set. Take shade wherever possible L By Luke Pentony (AP) Musetti levels things up against Machac A By Andrew McGarry Over on John Cain Arena, we might be in for a long, hot afternoon, as Lorenzo Musetti and Tomas Machac are locked together at a set apiece after two hours of play. Machac took the first set 7-5, but the second set was a roller-coaster affair with five breaks of serve, before Musetti held to take the set 6-4. Musetti will be keen to rip through the next couple of sets as the heat increases, but Machac is not going away. Games are on serve in the third, with Machac leading 1-0. Amanda Anisimova takes the first set against Peyton Stearns A By Andrew McGarry Amanda Anisimova has made a fast start against fellow American Peyton Stearns (Getty Images) On Margaret Court Arena, things are moving rapidly, with fourth seed Amanda Anisimova taking the first set in an all-American matchup with Peyton Stearns. The stats don't suggest a one-sided encounter, with Anisimova hitting just three winners and having 14 unforced errors, but her experience and court sense has helped her sweep through the opening set 6-1 in 32 minutes. Early exchange of breaks between Sinner and Spizzirri A By Andrew McGarry On Rod Laver Arena, second seed Jannik Sinner has got off to a mixed start against American Eliot Spizzirri. Spizzirri, the world number 85, started off well by winning the opening point on Sinner's serve, but the Italian held serve and then broke his opponent for 2-0. However Spizzirri did not look too concerned, and he has hit straight back, forcing Sinner into a string of errors and breaking the two-time champion to love. Early days, but things might not be as straightforward as expected for the Italian. Hot day at the office L By Luke Pentony Players have been doing everything they can to keep cool on court. (AP) (AP) (AP) (AP) Machac takes first set off fifth seed Musetti A By Andrew McGarry Tomas Machac is not here to make up the numbers against Lorenzo Musetti (Getty Images) On John Cain Arena, we have the first hint of an upset today, with Czechia's Tomas Machac taking the first set against Italian fifth seed Lorenzo Musetti. In a tight contest, momentum swung both ways in the opening set, before Machac took the set with a clean backhand winner to take it 7-5 in one hour 19 minutes. The second set has been swings and roundabouts as well, with a number of breaks of serve - but Machac will be eyeing another scalp here after his win over Stefanos Tsitsipas. Games are on serve at 4-4 in the second. Jannik Sinner next up on RLA A By Andrew McGarry Next up on Rod Laver Arena will be Italian second seed Jannik Sinner against American Eliot Spizzirri. Sinner, who is seeking a hat-trick of Australian Open titles, took care of veteran Australian player James Duckworth in straight sets in round two. He looked in fine touch the other night, and Spizzirri, who had a five-setter in round two, will be up against it. Defending champion Keys through to fourth round A By Andrew McGarry Defending champion Madison Keys has gone through to the fourth round, beating Czechia's Karolína Plíšková on Rod Laver Arena. Keys won 6-3, 6-3 in one hour and 15 minutes, and apart from a brief period in the first set, she looked untroubled against the former world number one. She will next face fellow American Jessica Pegula. Update on the heat scale L By Luke Pentony As of midday at Melbourne Park, the AO's heat stress scale has reached a reading of 2.2. If the scale hits 5, play will be suspended in women's and men's singles and doubles matches. The AO will apply what it describes as cooling strategies at a reading of 3 and use an extended break during matches at 4. Jessica Pegula breezes through to round four A By Andrew McGarry The first result of day seven is in the books, with American sixth seed Jessica Pegula defeating Oksana Selekhmeteva, 6-3, 6-2 on Margaret Court Arena. The American didn't serve particularly well, getting only 57 per cent of first serves in, but the ones she did land she won nearly 90 per cent of the time. The key stat was the unforced errors, where Pegula made half the number of unforced errors as her opponent. She finished the match in 66 minutes, with the added bonus of getting out of the growing heat. Pegula will next face the winner of Madison Keys versus Karolína Plíšková. It's heating up at Melbourne Park! L By Luke Pentony (Getty) (Getty) (Getty) (Getty) (Getty) (Getty) (Getty) Keys takes the opening set against Plíšková A By Andrew McGarry She had a bit of a wobble mid-set, but Madison Keys has clinched the first set against Karolína Plíšková on Rod Laver Arena. Plíšková had looked like she was in the mix when she pulled herself back to 4-3 down, but Keys held serve and then produced a brilliant return effort in the ninth game. She ripped three backhand winners to leave Plíšková without an answer, breaking serve to take the first set 6-3 in 43 minutes. Machac's top form continues against Musetti A By Andrew McGarry On John Cain Arena, Tomas Machac is taking it to Italian fifth seed Lorenzo Musetti. Machac made headlines when he knocked out Stefanos Tsitsipas in the previous round, and he started the day well, breaking Musetti to go to 2-0 in the first. The Italian answered back, and games are on serve at 4-3 to Machac, but the Czechian is producing some great athletic tennis and not looking overawed by any means, and Musetti would not want to take this match for granted. Karolína Plíšková finally on the board against Madison Keys A By Andrew McGarry Karolína Plíšková is finding things difficult on Rod Laver Arena against Madison Keys. She beat American qualifier Sloane Stephens in round one, and Indonesia's Janice Tjen in round two, but Keys' challenge is a definite step up. Plíšková has had two surgeries after breaking her ankle a year ago. She is back on tour, but has said her ankle is still \"very stiff\", and court movement is an issue. She held serve to trail 4-1, but it took eight deuces to do it. Plíšková then went out and broke Keys, suggesting she is beginning to settle - but she still has the task ahead. Pegula takes first set against Selekhmeteva A By Andrew McGarry On Margaret Court Arena, sixth seed Jessica Pegula is well on her way against Oksana Selekhmeteva. Selekhmeteva has sent down three aces, and is getting 76 per cent of first serves in, but everything else is the issue, particularly the 16 unforced errors. Pegula has taken the first set 6-3 in 33 minutes, and she looks dominant and well on her way to the fourth round. Keys in control early A By Andrew McGarry Madison Keys is playing like a defending champion on day seven (Getty Images) Madison Keys is in rhythm here, hitting winners from everywhere against Karolína Plíšková. She has seven winners already, and has broken Plíšková for a second time, to race out to a 3-0 lead. What's happening elsewhere A By Andrew McGarry On Margaret Court Arena, sixth seed Jessica Pegula is up against Oksana Selekhmeteva. Over on John Cain Arena, Italian fifth seed Lorenzo Musetti will be taking to the court against Czechia's Tomas Machac, who caused a big upset in the previous round beating 31st seed Stefanos Tsitsipas. And on Kia Arena, men's 15th seed Karen Khachanov is underway against Italian Luciano Darderi, seeded 22. Show more posts",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-24/darwin-home-largest-kalymnian-greek-expat-community-in-world/106251702",
        "title": "The history behind the largest Kalymnian Greek expat community in the world",
        "publish_date": "Fri, 23 Jan 2026 22:53:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "Born and raised in Darwin, I've always longed for a place I've never known.\n\nStories of my family's migration from Greece followed me throughout my childhood. How Darwin came to be for us has been a defining narrative.\n\nOur Australian chapter began with my late father at Fremantle Port walking off the Cyrenia, after a 28-day journey from Greece in 1956.\n\nAlone at 18, wearing his only pair of shoes and carrying a suitcase, he made his way to Darwin to work as a carpenter.\n\nIraklis Roussos worked as a carpenter in Australia, after his migration from Greece in 1956. (ABC News: Pete Garnish)\n\nFour years later at age 12, my mother left Greece with her family bound for Darwin.\n\nThere in the classroom of Parap Primary School she sat, confused by a language she didn't understand.\n\nEleni Roussos's mother Irene Roussos (nee Hatzigeorgiou) remembers feeling displaced when she started school in Darwin. (Supplied)\n\nWhile working at a cafe run by her auntie, my mother met my father and a few years later they married, going on to have seven children, with me their youngest.\n\nBoth my parents are from Kalymnos in the Dodecanese (near Türkiye) that is home to 16,000 people.\n\nIt's an island of only 100 square kilometres known for its sponge diving and limestone rock climbing.\n\nAbout 16,000 people live on the Greek island of Kalymnos. (ABC News: Eleni Roussos)\n\nIt shares a sister-city relationship with Darwin, where 10 per cent of the city's population is of Greek heritage, with the majority hailing from the same island as my parents.\n\nIn a city that's home to so many Greeks, getting to know my culture has come easy.\n\nGrowing up, weekends were spent attending cultural name days under troppo homes, mammoth weddings in suburban halls or at the one Orthodox church that has united Darwin's Kalymnians for generations.\n\nIrene Roussos, Eleni's mother has lived in Darwin for the past 65 years. (ABC News: Pete Garnish)\n\nA bronze statue of a water bearer that stands on a plinth in Darwin's main mall — that marks the city's strong ties to Kalymnos — has been a signpost to my history all my life.\n\nThe statue, made in Greece, was inspired by my great grandmother, whose name I share, Eleni Roussou (nee Troumouliaris).\n\nShe was a refugee, whose husband was killed in a skirmish during the Ottomon Empire's decline in what is now Türkiye.\n\nExpelled, she fled to Kalymnos with her five children, where she worked as a housemaid for a wealthy family.\n\nA bronze Kalimnia statue, which was inspired by journalist Eleni Roussos's great grandmother, stands at Darwin's main mall. (ABC News: Pete Garnish)\n\nTo supplement her income as a single mother, she delivered fresh spring water in clay pots to homes for a fee, becoming the first woman to sell water on the island.\n\nHer story of survival inspired local artist George Economou to create a painting of a water bearer in her honour.\n\nKalymnian sculptor Michael Kokkinos and his daughter Erini were later commissioned to turn the image into sculptures, known as the \"Kalimnia\", which to this day can be found all across the island.\n\nA refugee during the Ottomon Empire's decline, Eleni Roussos's story of survival was memorialised by statues across Kalymnos island. (ABC News: Eleni Roussos)\n\nDarwin-Kalymnos connection\n\nI arrived in Kalymnos for the summer of 2025, after navigating a health scare that brought my mortality to the fore.\n\nI ran into familiar faces from back home at every cafe, tavern and beach and stopped the car to take a pic of \"Darwin Street\".\n\nOn the Greek island of Kalymnos, there is a place called 'Darwin street'. (ABC News: Eleni Roussos)\n\nTalking to locals, it became clear the role migration has had on Kalymnos's identity and how central my hometown has been to the island's economic prosperity.\n\nKatie and George Tavlarios ran a successful hotel in Kalymnos before Greece's 2009 economic collapse crippled the business.\n\nA return to Darwin, where Katie was born, became the only viable option.\n\n\"In the beginning it was hard because I had to leave my children behind for three years and that was the most difficult part,\" Katie said.\n\nGeorge and Katie Tavlarios, on holiday in Kalymnos, are the owners of Meraki Greek tavern in Darwin. (ABC News: Eleni Roussos)\n\nThe couple spent a decade working in labouring and hospitality jobs before opening their own Greek tavern in Darwin with their children.\n\nThey say the city has given them a lifeline.\n\n\"Life was really hard, it was stressful, thank God I had the possibility to go to Australia, if not, I don't know what we were going to do in Greece,\" George said.\n\n'A lot to thank Darwin for': Post-war migration boom\n\nThe post-World War II period saw a massive wave of impoverished Kalymnians leave the island for foreign shores.\n\nThe story of their departure and subsequent contribution was nowhere to be seen in the public displays of Kalymnian history.\n\nOver the last several decades many Kalymnians have left their home in search for better economic opportunities. (ABC News: Eleni Roussos)\n\nThis absence prompted me to meet with Deputy Mayor Popi Koutouzi, who, like most on the island had a Darwin family connection.\n\n\"This island has a lot to thank Darwin for,\" Ms Koutouzi said.\n\n\"If you take into consideration that 90 per cent of the people that left Kalymnos to immigrate in Australia went to Darwin, you can imagine how big the role of Darwin is in everyday life in Kalymnos.\n\nPopi Koutouzi is the Deputy Mayor of Kalymnos island in Greece. (ABC News: Eleni Roussos)\n\n\"The male members of the family went to Darwin to work, and they would send money to Kalymnos to support their mothers, wives and sisters.\n\n\" Without that financial support coming from Darwin, the families could not live here. \"\n\nOther Greek islands heavily rely on tourism. Kalymnos is different thanks to its large diaspora.\n\n\"July and August is packed with second and third generation Kalymnians who are coming back to the island on holiday … this is financial support for the island,\" she said.\n\nMany Kalymnians return to their Greek hometown for a summer holiday. (ABC News: Eleni Roussos)\n\nMs Koutouzi says migration is a \"big part of Kalymnian life\" that warrants more attention on the island.\n\n\"I see exhibitions and photographs of the sponge divers and photographs of other topics, but never one that celebrates the people who left to go somewhere else … the ones who never got to come back at all\".\n\nFrom Aegean waters to the Arafura Sea\n\nThe first group of Kalymnians — some 12 men — were brought to Darwin and Broome in the 1950s to collect pearl shell.\n\nBut the murky tropical waters and huge tidal waves made the Australian government's diving experiment with Kalymnians short lived.\n\nKalymnian shipwrights working on a pearl lugger in Darwin in the 1950s. (Supplied: Paspaley)\n\nSeeing the opportunity for land-based work, thousands of Kalymnians came to Darwin, making the city home to the largest Kalymnian expat community in the world.\n\nFormer NT administrator John Anictomatis left Piraeus in Athens with his mother and brothers in 1955 when he was nine to join his father in Darwin.\n\nHe has borne witness to the impact of Greek migration on Darwin throughout his 35 years as the Honorary Greek Consul for the NT.\n\nJohn Anictomatis says Greek migrants played an integral role in Darwin’s growth as a modern city. (ABC News: Michael Franchi)\n\n\"I think Darwin would be a different place if it wasn't for the Greek involvement in the industries that they were involved in — fishing, pearling, mining, construction — you name it,\" Mr Anictomatis said.\n\nHe remembers how the handful of Greek students at his primary school — which was also my mother's — made sense of their new home.\n\n\"I was told many times: 'Don't speak to any newcomers in Greek, speak to them in English'. We couldn't help it, we'd converse in Greek,\" he said.\n\nEleni Roussos has been reflecting on her family's migration history, and looking at old photos with her mother. (ABC News: Pete Garnish)\n\nSince the trip to Greece, I have been contemplating place and cultural identity.\n\nWhile there is no official monument recognising the people who left Kalymnos — to me — my great grandmother's statue embodies all the immigrants who toil in foreign lands.\n\nTo me, she represents the migrant experience of holding onto the dream that their children may one day know the place their ancestors once called home.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-24/heatwave-australian-open-explainer/106261014",
        "title": "How the Australian Open keeps its cool during a heatwave",
        "publish_date": "Fri, 23 Jan 2026 22:39:17 +0000",
        "category": "sports",
        "authors": [],
        "text": "With temperatures set to soar across the long weekend, there's a chance play at the Australian Open could be suspended.\n\nMatches will start an hour earlier than usual on day seven in an attempt to avoid as much of the heat as possible.\n\nThe tournament has already seen some impacts of heat after a ball girl collapsed on court when Zeynep Sönmez took on 11th seed Ekaterina Alexandrova.\n\nZeynep Sonmez helped a ball kid after they collapsed due to heat during her first round match. (Reuters: Edgar Su)\n\nVictoria, along with much of the country's south east, will experience a prolonged severe heatwave from Saturday, which has the potential to break all-time temperature records.\n\nMelbourne is tipped to hit 40 degrees Celsius on Saturday, with a total fire ban declared for the entire state.\n\nA cool change will then move through, but it won't last long. The heat will ramp up again on Tuesday, with the temperature forecast to reach 44C in the outer suburbs of Melbourne.\n\nIt will be unavoidable for athletes and revellers at the tennis, but there are some things they can do to keep cool in the heat.\n\nHow does the heat affect players?\n\nThermal physiologist Matt Brearley said while well-trained athletes were able to better tolerate heatwaves, they still had limits.\n\n\"Our bodies are like internal combustion engines — the harder we work, the harder we play, the more heat we produce,\" Dr Brearley said.\n\n\"For some people, getting up into the high 38s, low 39s, they'll start to see symptoms such as headache, fatigue, irritability and nausea.\n\n\"If it gets much higher, they'll probably see some central nervous system impairments such as confusion, delirium … [It's] extremely dangerous at that point, because the body and the brain is impacted.\"\n\nHe said athletes were \"extremely heat acclimatised\" as a result of their training, but could still experience heat stroke, which could be deadly.\n\nIt's why heat policies exist.\n\nNovak Djokovic needed some cooling off during his first round match against Pedro Martinez. (AAP Image: James Ross)\n\nWhat is Tennis Australia doing about the heat?\n\nExtreme heat at the Australian Open is not uncommon. Every year, there are at least a few days where temperatures are above 30C during the tournament.\n\nIn 2014, a four-day heatwave — which melted bottles courtside — saw a record number of players pull out of the tournament and led to many complaints from athletes and spectators.\n\nThe Australian Open introduced a new heat policy in 2018 determined by a measure called the Heat Stress Scale.\n\nIt takes into account four climate factors which determine heat stress — the temperature, radiant heat, humidity and wind speed.\n\nThese factors are recorded by a device called an environmental management unit, or EMU by the side of courts at Melbourne park, and are put into an algorithm which creates a five-point scale.\n\nThe Australian Open's heat stress scale ranges from one to five. (Supplied: University of Sydney)\n\nThe scale, which looks similar to the fire danger rating scale, then triggers certain rules in relation to heat for players.\n\nIf the scale reaches five, matches will be called off.\n\nAll-time attendance records were shattered at the Australian Open this year. (AAP Image: Lukas Coch)\n\nTennis Australia chief executive Craig Tiley said there may be a break in the tennis on Saturday in the late afternoon due to the heat.\n\n\"Our Bureau of Meteorology experts are telling us probably sometime [on Saturday] afternoon … between 3 and 6pm, we could be at that point,\" he said.\n\nHow can spectators stay cool?\n\nWater misters are littered throughout the grounds and there are plenty of shady places, particularly near hydration stations.\n\nDr Brearley said while hydration was essential on hot days, by itself it may not be enough for a lot of people.\n\n\"Most people want to cool down when they get hot,\" he said.\n\n\"But what you can do is actually cool our body before you get hot and give yourself a greater window for heat storage and [for athletes] improved performance early in the match.\"\n\nHow to do that, he said, was by pre-cooling.\n\nAthletes will often jump into an ice bath or ingest crushed ice drinks before they expose themselves to heat and spectators at the tennis can achieve the same effect by eating icy-poles or slushies.\n\n\"Melting ice in your body, changing it from a solid to a liquid, requires a phenomenal amount of heat,\" he said.\n\n\"That's our body heat that melts the ice and so basically, by transferring body heat to the ice, you're creating a heat sink internally.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-24/range-tennis-club-toowoomba-membership-boom/106254320",
        "title": "Queensland's oldest tennis club grows from 12 members to 600 in six years",
        "publish_date": "Fri, 23 Jan 2026 21:59:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "Membership at Queensland's oldest continuous tennis club has jumped nearly 5,000 per cent in the past six years.\n\nBut to be fair, the growth came off a pretty low base, says Toowoomba's Range Tennis club president Paul Mooney.\n\n\"In 2020 there were a dozen or so members,\" Mr Mooney said.\n\n\"This year we're just shy of 600, which has been phenomenal.\"\n\nPaul Mooney is the coach and club president of the Range Tennis Club. (ABC Southern Qld: Grace Nakamura)\n\nMr Mooney said the club, founded in 1893, had bucked a trend in declining participation rates.\n\nIts rapid growth defies the well-worn narrative of regional sports clubs that struggle from dwindling populations and lack of volunteers.\n\nNew players sign in and pay for two hours of social tennis. (ABC Southern Qld: Grace Nakamura)\n\nMr Mooney said the key to changing the trajectory of the four-court club was to build a strong junior membership base by coordinating tournaments for kids.\n\n\"Kids now start off with coaching, they will hire courts, and then morph into playing tournaments and fixtures,\" Mr Mooney said.\n\nThere are now 300 juniors signed up to the club, compared to none in 2019.\n\nThere are now 300 junior members at the Range Tennis Club. (ABC Southern Qld: Grace Nakamura)\n\nNext generation takes the court\n\nPatrick Freeman, 13, can be found smacking back forehands to the often-adult players at the other end of the court four times a week.\n\n\"There are a lot of kids around my age that play here,\" Patrick said.\n\nPatrick Freeman is one of 300 juniors now playing at the Range Tennis Club. (ABC Southern Qld: Grace Nakamura)\n\n\"Over my Christmas holidays, I've seen so many new faces here who I've never seen before.\"\n\nHis mother, Annabel Freeman, joined the club as treasurer after seeing how much Patrick enjoyed playing.\n\n\"I thought I'd do what I could to keep the club going,\" Ms Freeman said.\n\n\" I don't think you could oversell the importance of [community clubs], especially these ground-level clubs that are happy to take on kids at any level and grow them up. \"\n\nPatrick and Annabel Freeman are at the club multiple times a week for tennis training and fixtures. (ABC Southern Qld: Grace Nakamura)\n\nGrowth in membership\n\nRange Tennis Club secretary Tony Brown, 84, said Toowoomba's tennis landscape had been in dire straits a decade ago.\n\nAnother Toowoomba tennis club Mr Brown played at folded due to a lack of members, so he transferred to the Range club in 2013.\n\nTony Brown has been the club secretary for about a decade. (ABC Southern Qld: Grace Nakamura)\n\n\"I came here and there were a whole 12 members — whoopee,\" he said.\n\n\"Where do you go with us oldies if you don't have a follow-up brigade with the parents of the children, and the children themselves to take [tennis] to the next generation?\"\n\nSurprisingly, he said it was the COVID-19 pandemic that helped to revive the club because it turned out tennis was the perfect sport to play while socially distanced.\n\nPlayers fill up the synthetic grass courts at the Range Tennis Club. (ABC Southern Qld: Grace Nakamura)\n\nKeeping overheads low\n\nMr Mooney, a former nationally ranked player, saw an opportunity for growth when he joined as the club president and coach in 2020.\n\n\"Toowoomba is Australia's second-largest inland city, and our tennis participation numbers were pretty low for a city that size,\" he said.\n\n\" We had the perfect storm just based on the size of the city and the lack of people playing tennis. \"\n\nMore young families with children have joined the tennis club since the pandemic. (ABC Southern Qld: Grace Nakamura)\n\nToowoomba has a population of 173,304, according to the 2021 census.\n\nMr Mooney's expertise as a coach and his lifelong dedication to the sport attracted $60,000 in sponsorships from local businesses, which helped keep the cost of court hire and annual memberships low, to just $10 an hour and $35 a year respectively.\n\nHe said an arrangement with the Queensland government to lease the land for $1 per year was also a saviour.\n\nThursday night is social night for club members. (ABC Southern Qld: Grace Nakamura)\n\n'Think outside the box'\n\nCommunity groups and sports clubs in regional and rural towns across the country struggle to retain members.\n\nLa Trobe University senior sports lecturer Pam Kappelides said what the Range club had accomplished was rare because fewer people were volunteering at clubs after the pandemic.\n\nThe social tennis season has begun for 2026. (ABC Southern Qld: Grace Nakamura)\n\n\"It goes back to that ageing population and population decline in smaller towns, so the number of people available to support the clubs are not there,\" she said.\n\n\"The financial pressures for rural communities, often farming communities, means they're unable to prioritise sport.\"\n\nShe said the survival of regional sport clubs hinged on their ability to \"think outside the box\".\n\n\"Don't just think 'That's how it's always run,'\" she said.\n\n\"Think about perhaps how the population is changing in their needs and what they want from the club.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-24/calls-to-make-financial-literacy-mandatory-in-schools/106257050",
        "title": "Should financial literacy be mandatory in schools?",
        "publish_date": "Fri, 23 Jan 2026 21:25:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "In an increasingly complex financial world of buy-now-pay-later schemes, scams, and social media marketing designed to encourage spending over saving, there are renewed calls for financial literacy to become a mandatory part of the school curriculum.\n\nIt comes amid concerns students are leaving school without basic financial knowledge about tax, superannuation, and budgeting.\n\n\"Along with women, young people between the ages of 12 and 24 are the most financially illiterate demographic,\" Financial Basics Foundation chief executive Katrina Samios said.\n\nTasmanian Labor Senator Richard Dowling has been pushing for the need to strengthen financial literacy for young people and across the wider community.\n\n\"Forty years ago, sex education moved from taboo to essential,\" he said.\n\n\"Financial literacy deserves the same whole-of-society focus.\"\n\nKatrina Samios says young people between the ages of 12 and 24 are the most financially illiterate demographic. (ABC News: Richard Sydenham)\n\nWith the cost of living continuing to rise, being able to manage money will be more important than ever for younger generations, according to Ms Samios.\n\n\"They're working and living as part of the gig economy, a cashless society,\" she said.\n\n\" So they're managing digital payments without actually understanding the basics even [those] such as simple bank account products. \"\n\nEducating students through 'side hustle'\n\nAlyssia Kennedy, 29, felt she had missed out on some important life lessons around money when she left school.\n\n\"I know how lost I felt,\" Ms Kennedy said.\n\n\"I ended up with very unexpected bills.\n\n\"I found myself wondering, 'how am I going to pay for this bill?' because I didn't budget for it, and I didn't know how to budget either, so I was navigating a lot.\"\n\nNow working full-time, Ms Kennedy has decided to share her knowledge about all things financial — as well as some general life lessons — with a younger generation.\n\nAlyssia Kennedy visits schools around Tasmania, talking about tax, superannuation, renting and insurance. (ABC News: Mackenzie Heard)\n\nDescribing it as a \"side hustle\", Ms Kennedy visits schools around Tasmania, talking about concepts like tax, superannuation, renting and insurance.\n\nStudents are encouraged to weigh up the costs of buying groceries versus take-away food, they're given meal-planning tips, and basic budgeting lessons.\n\n\"With this knowledge, I really want to be able to empower young people to be able to make these decisions and have a conversation about it now, so when they do leave school, they are prepared,\" she said.\n\nAlyssia Kennedy says she wants to empower young people to make savvy financial decisions. (ABC News: Mackenzie Heard)\n\nStudents 'surprised' by expenses\n\nFor year 10 students at Marist Regional College in Burnie in Tasmania's North West, taking part in Ms Kennedy's Life After School Program has been eye-opening.\n\n\"I was definitely surprised by all the expenses,\" Harry Hodgetts said.\n\n\"Even renting a house — like sharing with others — there's a lot of hidden expenses.\"\n\nMarist Regional College students say the Life After School Program has been eye-opening. (ABC News: Mackenzie Heard)\n\nOlivia Wyllie said: \"We're all starting to get jobs and get cars and life's starting to get a bit more serious and I feel we don't know as much as we think we do.\"\n\nHow financial literacy changed this high school Four years ago almost half of the students left this Brisbane high school without plans for work or study — financial literacy has turned that around.\n\nJobe Pringle said he was interested to learn more about budgeting.\n\n\"I definitely spend more than I make, I chip into my parents' money a bit more,\" he said.\n\nMarist deputy principal Emily Sass said the program helped fill a gap in an already packed curriculum.\n\n\"Some of us adults have learnt these things the hard way so we've had some conversations about 'wouldn't it be great to have known some of this beforehand',\" she said.\n\n\"The more we can equip them, especially in the current climate, the better off they'll be.\"\n\nEmily Sass says the program helps fill a gap in an already packed curriculum. (ABC News: Mackenzie Heard)\n\nHalf of Australian adults considered financially illiterate\n\nSome financial concepts are taught in schools across a range of different subjects, but there are calls for it to be a mandatory stand-alone subject.\n\n\"When we have it as a non-compulsory elective stream … It means that it's not delivered consistently and it's optional.\n\n\" Which is why we're still seeing young people come out of secondary school without having learnt any of these important topics. \"\n\nHow to involve your kids in back-to-school budgeting Managing back-to-school costs, especially when kids want expensive brand name items, can cause a lot of stress for families. But including children in the budgeting process is key to helping everyone get on the same page.\n\nMs Samios said young people were increasingly sourcing information about money from social media.\n\n\"It's difficult to navigate what is real and correct information and financial advice ... and also it's not personalised.\"\n\nAccording to the 2020 Household, Income and Labour Dynamics in Australia Study (HILDA), only around half of Australian adults can demonstrate an understanding of at least three basic financial literacy concepts.\n\n\"That's a striking indicator of how widespread the gap is,\" Senator Dowling said.\n\nHe said he was lobbying relevant ministers about the need for financial literacy to be taught in schools.\n\nRichard Dowling has been pushing for the need to strengthen financial literacy among young people. (ABC News: Luke Bowden)\n\n\"Progress in education reform never happens overnight and requires agreement across jurisdictions, but I am encouraged by the momentum we have — both within the parliament and right across the community,\" he said.\n\nIn New Zealand, financial education will be embedded in the curriculum for students from year 1 to 10, starting this year.\n\nIn the United States, the majority of states require students to complete a stand-alone personal finance course before graduating from high school.\n\nEducation Minister Jason Clare said financial literacy was part of the curriculum, but some students were left behind.\n\n\"The most important thing we can do for financial literacy is make sure that school students are getting the basics in maths and numeracy,\" he said.\n\n\"It's really important you get the basics early. If you don't get the basics right, you can't build on them.\n\n\"It's why we've brought forward work on the current maths curriculum for K-2 [kinder to year 2 students].\"\n\n\"This is the first targeted review of the curriculum as part of the new curriculum review cycle.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-24/black-mountain-tower-indigenous-cultural-site-stalled/106263224",
        "title": "Future of Canberra's Black Mountain Tower in limbo as Ngunnawal cultural site plans stall",
        "publish_date": "Fri, 23 Jan 2026 21:09:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "The future of Canberra's iconic Black Mountain Tower is under the spotlight again, with concerns a commitment to transform it into a Ngunnawal cultural tourism venue has been put on ice.\n\n\n\n\n\nRichie Allan and Aunty Violet Sheridan says Ngunnawal people feel excluded. (ABC News: Monte Bovill) The 195-metre tower continues to act as a telecommunications facility, but the site has been closed to the public since 2021.\n\nIn 2023, Telstra announced plans to restore the site as a \"premier destination\" that celebrates Ngunnawal culture.\n\nBut Ngunnawal custodian Richie Allan said there had been little movement.\n\n\"Telstra did make a promise to the Ngunnawal people that it will be a Ngunnawal cultural centre,\" Mr Allan said.\n\n\" We are going to make Telstra accountable … they made a promise, and we are going to make sure they stick to that promise. \"\n\nMr Allan said Ngunnawal people had felt excluded from key conversations about the future of the tower, particularly since the ACT government and Telstra signed an agreement in mid-2024 to work together on the site's reopening.\n\n\"Ngunnawal people get pushed aside, Ngunnawal culture gets put under the rug … we are sick of it,\" he said.\n\nIndependent MLAs join push to honour traditional owners\n\nThe calls for more certainty around the project have been backed by independent ACT senator David Pocock and independent MLA Thomas Emerson.\n\n\"This is a Canberra icon that we could and should be using to celebrate the traditional owners of this land,\" Mr Emerson said.\n\n\n\n\n\nDavid Pocock says the Canberra icon should be used to celebrate the region's traditional owners. (ABC News: Monte Bovill) \"Let's take advantage of that opportunity and not let this opportunity fall by the wayside.\"\n\nTalks between ACT government, Telstra continue\n\nIn a statement, an ACT government spokesperson said they wanted to ensure the tower's reopening delivered \"meaningful cultural opportunities\" and that there had already been \"positive discussions\" with traditional custodians.\n\n\"Community feedback to date supports a staged, transparent process, with formal engagement to commence once commercial negotiations between Telstra and the government are finalised,\" the spokesperson said.\n\n\"While Telstra has previously consulted traditional custodians on potential future uses of the site, including a cultural centre, those outcomes remain a matter for Telstra as the facility owner.\"\n\n\n\n\n\nAndrew Barr says he was unsatisfied with Telstra's offers last November. (ABC News: Matt Roberts) Earlier this week, the Chief Minister met with Aunty Violet Sheridan as a representative of Traditional Custodians, to discuss the future of the tower.\n\nThe spokesperson said over the next 12 months, the government would \"work with Telstra to finalise commercial arrangements and refurbishment planning for the first stage of the tower re-opening project with the available budget\".\n\nIn November last year, Chief Minister Andrew Barr said the territory was not satisfied with offers from Telstra, as part of negotiations for the redevelopment of the tower.\n\nStaged tower reopening planned for 2027\n\nThe reopening of the tower is expected to be done in stages, with late 2027 the current target period for stage one.\n\n\n\n\n\nA Telstra spokesperson says the company is committed to engaging with traditional custodians. (ABC News: Monte Bovill) \"This remains subject to ongoing commercial negotiations, the successful procurement of a construction partner and the construction works proceeding smoothly,\" the ACT government spokesperson said.\n\nA Telstra spokesperson said it was \"critically important\" that Ngunnawal traditional custodians were a part of the planning process.\n\n\"The ACT government is leading this engagement and is in the process of developing its engagement plan with the support of its specialist advisors,\" Telstra said.\n\n\"We've appreciated the positive conversations to date and are committed to continuing this engagement.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-24/zebrafish-research-helps-children-with-rare-genetic-variants/106243868",
        "title": "Queensland researchers are using a popular pet fish to test rare genetic variants",
        "publish_date": "Fri, 23 Jan 2026 21:04:42 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Two tiny babies born on different sides of the world have avoided medical treatment costing millions of dollars, thanks to an Australian-based scientist and his tanks of zebrafish.\n\nThe babies — a boy in NSW and a girl in Germany — were born in 2023 with unusual variants of the gene that causes spinal muscular atrophy (SMA), detected in newborn screening.\n\nNeither newborn had a family history of the condition, affecting an estimated one in 10,000 babies worldwide.\n\nBoth babies were born with variants that were previously unknown to science, making it impossible for their doctors to know whether they would develop the condition — or not.\n\nGriffith University biomedical scientist Jean Giacomotto holds up a tank of Zebrafish in his lab at the Institute for Biomedicine and Glycomics. (Supplied: Griffith University)\n\nThat created a dilemma. Should medical specialists start treatment, risking unnecessary intervention, with potential side effects? Or, should they delay therapy, risking irreversible harm?\n\nThe Australian Functional Genomics Network, established to enhance the understanding of genetic variants, turned to Griffith University biomedical scientist Jean Giacomotto, and his zebrafish, for clarity.\n\nSpinal muscular atrophy is caused by mutations in the SMN1 (survivor motor neuron 1) gene, leading to a lack of a protein, which is needed for motor neuron survival.\n\nIn the past, children with the most common form of the genetic condition, SMA type 1, have died before the age of two.\n\nHowever, three treatments have emerged in the past decade, including a one-off gene therapy drug, Zolgensma, which costs about $2 million.\n\nAll must be initiated before symptoms appear to avoid irreversible motor neuron death and the long-term effects of the treatment are unknown.\n\nDr Giacomotto, of Griffith University's Institute for Biomedicine and Glycomics, used zebrafish to show both babies' SMN1 variants would not result in the disorder.\n\nDr Giacomotto injected the babies' SMN1 variants into zebrafish embryos that were bred without the gene. (Supplied: Griffith University)\n\nHe did so in less than six weeks, replicating the results.\n\nZebrafish are a home aquarium favourite with eye-catching stripes. But they are also proving to be a useful tool for researchers studying neurological conditions, such as spinal muscular atrophy.\n\nDr Giacomotto said zebrafish bred without a SMN1 gene, developed a form of the neuromuscular condition, resulting in degeneration of the spine, progressive loss of motor function and premature death.\n\nThey die within about six days, rather than the usual zebrafish life span of about two years.\n\nBut when he used a precision injection technique to introduce the babies' SMN1 variants into zebrafish embryos bred without the gene, he found they survived.\n\n\"We were able to functionally test each baby's exact mutation and show it was not harmful,\" Dr Giacomotto said.\n\nA developing zebrafish viewed from the side, with muscle fibres in red and motor neurons in white, helping researchers track disease progression and study the impact of genetic variants. (Supplied: Griffith University)\n\n\"This research provides the clearest demonstration to date that zebrafish can play a decisive role in clinical variant interpretation, particularly in newborns flagged through expanding genomic screening programs.\n\n\"With genomic sequencing rising worldwide, clinicians are encountering more and more uncertain variants.\n\n\" This tiny fish offers a fast and affordable way to help resolve these cases and reduce distress for families. \"\n\nThe children at the centre of the research are more than two years old and are developing normally.\n\nDr Giacomotto's research features on the front cover of the latest edition of the scientific journal EMBO Molecular Medicine.\n\nUniversity of NSW-based paediatric neurologist Michelle Farrar, who was also part of the research, described it as a \"game-changer\".\n\nZebrafish in the lab. (Supplied: Griffith University)\n\n\"It really is the first time this model's been used in a timely way that really supports clinical decision making to get the best management for the child and certainty for the families,\" Professor Farrar said.\n\nShe said gene therapy for babies with spinal muscular atrophy was only subsidised in Australia on the Pharmaceutical Benefits Scheme for children with a definitive diagnosis.\n\n\"Our newborn screening guidelines say that if you have an uncertain result, that they need to be followed up until it's clarified and so, this research was really important,\" she said.\n\nThe luminous bodies of zebrafish larvae make it easy for researchers to observe specific particular features. (Supplied: Griffith University)\n\nThe researchers suggest zebrafish could become a \"valuable model\" for testing genetic variants of uncertain significance, not only for spinal muscular atrophy, but for human disease generally.\n\n\"We are seeing an explosion of new gene variants associated with a diversity of disorders,\" they wrote in the scientific journal. \"The determination of their functional consequences is posing a significant challenge, and this problem will continue to grow with the development and need for precision/personalised medicine. \"The zebrafish can help address this translational need.\"\n\nLoading...\n\nAustralian Regenerative Medicine Institute director of research Peter Currie, who was not involved in the study, described the breakthrough as a \"huge success story for modern medicine\".\n\nProfessor Currie, who uses zebrafish to research muscular dystrophy, said zebrafish were a \"well-established\" model for the study of human disease, with the freshwater fish sharing 70 per cent of its genes with humans.\n\nZebrafish embryos are also translucent, allowing scientists to study internal biological processes, including neuromuscular development.\n\nAustralian Regenerative Medicine Institute director of research, Professor Peter Currie, who uses zebrafish to study muscular dystrophy. (Supplied)\n\nThe Monash University-based researcher described Professor Giacomotto's zebrafish work as a \"really clever way to use the model to speed up the diagnostic process\".\n\nProfessor Currie said zebrafish were also a useful model to screen experimental drugs for the treatment of human disease, including cancer.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/australian-open-live-updates-osaka-inglis-sinner-djokovic-shelton-and-keys-to-feature-as-the-mercury-soars-20260123-p5nwnf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open live updates: Shock as Sinner drops first set in scorching heat; ‘Rowdy’ superfan booted out by police",
        "publish_date": "Sat, 24 Jan 2026 13:10:23 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly",
            "Roy Ward"
        ],
        "text": "American mates Jessica Pegula and Madison Keys have taken advantage of a 10.30am start to beat the heat and set up a Monday clash in the round of 16.\n\nPegula downed Oksana Selekhmeteva 6-3, 6-2 on Margaret Court Arena and Keys put paid to Karolina Pliskova 6-3, 6-3 on Rod Laver Arena.\n\nMadison Keys is through to the next round. This is a double exposure image. Credit: Eddie Jim\n\nBoth matches were finished by midday with the mercury hovering around a respectable 30 degrees (to be honest, it almost feels cool as we anxiously await the Mars-like heatwave hitting us later today).\n\nBut the earlier start was not all straightforward for 31-year-old Pegula.\n\nShe revealed it meant an earlier bedtime, an earlier wake-up call and some extra coffee to prepare.\n\n“It sounds kind of funny, but 30 minutes, it feels so much earlier,” she said.\n\n“Everyone was kind of slightly panicking because we’re like, ‘Oh my God, we have to be there early’.\n\n“But no, it was nice to be on first today. Obviously, it was not a super long match, but I didn’t have to kind of kill myself in the heat.”\n\nBoth Pegula and Keys admitted they were accustomed to playing in the hotter conditions, being from Florida.\n\n“I was excited for the heat today,” Keys said. “I’m a Floridian, so I was ready for it.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/hundreds-injured-in-melbourne-s-e-scooter-trial-new-data-shows-20260122-p5nw9y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hundreds injured in Melbourne’s e-scooter trial, new data shows",
        "publish_date": "Sat, 24 Jan 2026 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Patrick Hatch"
        ],
        "text": "Advertisement\n\nExclusive NationalVictoriaPublic transport Hundreds injured in Melbourne’s e-scooter trial, new data shows Patrick Hatch January 24, 2026 — 1:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nMore than 500 people reported being injured – including 17 seriously – in crashes while riding or being hit by a hired e-scooter during Melbourne’s controversial two-and-a-half-year experiment with hire scheme operators Lime and Neuron. Data obtained by The Age reveals for the first time the number of injured riders and pedestrians recorded after the e-scooter trial was launched across inner Melbourne in early 2022. A Neuron scooter in South Melbourne on Friday. The scheme is still operating in the Port Phillip council area. Luis Enrique Ascui The City of Melbourne abruptly cancelled its contract with Lime and Neuron in August 2024, with Lord Mayor Nick Reece saying scooters were “creating havoc” on CBD footpaths. Lime and Neuron withdrew from the City of Yarra in March last year after the council increased its daily fee to from $1 to $5 per scooter to cover the cost of managing the scheme, but they continue to operate in the City of Port Phillip.\n\nAdvertisement\n\nThe state government declared the hire-scooter trial a success and legalised both hire schemes and privately owned e-scooters in July 2024. But it refused at the time to release information on the number of crashes and injuries recorded. Data obtained by The Age via a freedom-of-information request shows Lime and Neuron received 558 reports of injuries involving its scooters across the three local council areas between February 2022 and August 2024. Of those injuries, 180 people required medical treatment. Sixteen were admitted to hospital for more than 24 hours, and one scooter rider suffered life-threatening injuries. There were no fatal crashes. Pedestrians and other third-parties hit by hire scooter riders accounted for 37 injuries, including 15 who needed medical treatment and four who were admitted to hospital treatment for more than 24 hours.\n\nAdvertisement\n\nThe data shows Lime and Neuron also received 4837 complaints about poorly parked scooters and recorded 407 “water vehicles” – meaning scooters that were dumped in rivers, lakes or the ocean. Lime and Neuron said the injury data showed their scooters were a relatively safe form of transport, considering customers took 9.4 million trips over that period, with 99.994 per cent of journeys ending safely and 0.073 serious injuries reported per 100,000 kilometres travelled. However, Reece said ending the e-scooter contract was “absolutely the right decision”. “Too many people were being injured, and we acted to put safety first,” he said. “Unsafe riding and abandoned scooters blocking footpaths created real risks for pedestrians.” The data does not capture privately owned e-scooters, which have been involved in fatal crashes in Victoria and have become the focus of public concern along with high-powered e-bikes.\n\nAdvertisement\n\nWill Peters, head of Asia Pacific for Lime, said that unlike privately owned e-scooters, its devices were speed-limited to 20km/h, insured and operated with public oversight. Related Article E-Scooters The e-scooter loophole that left crash victim struggling to get by “We are proud of the e-scooter service we provided in Melbourne, helping tens of thousands of residents and visitors travel more sustainably throughout the city,” he said. A spokesperson for Neuron said Melbourne was one of its busiest cities worldwide for e-scooter trips before the City of Melbourne suspended its partnership. “The vast majority of riders were behaving responsibly,” they said. But for those injured, the harm has been significant and long-lasting.\n\nAdvertisement\n\nAdelaide woman Julia Miller suffered a broken shoulder and elbow when she was hit by a Lime scooter rider near the MCG in April 2022. Almost four years later, the 63-year-old still has limited use of one arm and sometimes uses a walker because of difficult balancing and related neck pain. “It’s been a major impact on my life in terms of everyday function,” she said. Julia Miller, who was hit by a hire scheme scooter near the MCG, pictured in 2022. Ben Searcy Miller said she was glad to see the City of Melbourne eventually ended the scooter schemes, but said councils should have put more resources into ensuring they were used safely. “These are big, heavy machines. If you jump on a bicycle you know how to ride it, but anyone can ride a scooter without knowing how to use it,” she said. Miller is pursuing compensation from Lime for her injuries.\n\nAdvertisement\n\nPedestrians hit by hire scooters early in the trial found they were unable to claim on Lime and Neuron’s insurance policies if the rider was not wearing a helmet or breaking other road rules. Nick Mann, principal at compensation firm Polaris Lawyers, said his firm had received numerous inquiries from people seriously injured by e-scooters. Mann said the insurance policies had improved but still had “critical gaps which are likely to leave people without coverage if they are injured by a rental scooter”. “We continue to recommend that Lime and other private rental companies should be required to pay to register e-scooters with the TAC scheme to provide better protection for injured Victorians,” he said. Port Phillip Mayor Alex Makin said he was comfortable continuing to work with Lime and Neuron, with hire scooters providing a valuable service to cover gaps in the public transport network. Makin said there were 31,000 hire scooter trips and five reported minor incidents in December. “E-scooter usage appears to be unequivocally responsible,” he said.\n\nAdvertisement\n\nMakin said safety and amenity concerns had been addressed by Lime and Neuron implementing footpath-riding detection technology, slow-riding and no-go zones and no-parking zones. “There’s a greater level of comfort with how e-scooters are used in our community,” Makin said. “Hopefully, that serves as a benchmark for if the state government looks at a whole-of-Melbourne approach in terms of what should be implemented.” Loading Victoria Walks chief executive Sarah Pilgrim said the hire scheme should only be expanded if there were effective measures to keep scooters off footpaths, along with enforceable parking rules, better on-road riding infrastructure, national safety standards and no-fault insurance for injured third-parties. “When fast, heavy devices are introduced into [footpaths], even a small number of crashes can have very serious outcomes,” Pilgrim said. “When people don’t feel safe in public space, they walk less, and that has serious consequences for physical health, mental wellbeing and social connection.”\n\nAdvertisement\n\nThe injury data is based only on reports made to Lime and Neuron by riders or third parties, and could include false reports but also may not include injuries that were unreported. Lime and Neuron included the injury data in monthly reports to each council during the trial. Related Article Road safety Pedestrian fatalities reach 17-year-high. This trend could be why The Age lodged a freedom-of-information request to the City of Melbourne seeking those monthly reports in July 2024. The council agreed to provide the documents but Lime and Neuron took action in the Victorian Civil and Administrative Tribunal to prevent their release, arguing they contained sensitive commercial information. During mediation at VCAT, the two companies agreed to release a combined incident dataset. Transport Accident Commission data shows that across the same February 2022 to August 2024 period, there were 13 road deaths in the Melbourne, Yarra and Port Phillip council areas, all of which were pedestrians hit by vehicles.\n\nAdvertisement\n\nLime and Neuron said “water vehicles” were remotely deactivated and thoroughly tested before returning to service. Get news and reviews on technology, gadgets and gaming in our Technology newsletter. Sign up to receive it every Friday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/ryan-wedding-a-former-olympic-snowboarder-on-the-fbis-most-wanted-list-has-been-arrested-20260124-p5nwp4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ryan Wedding, a former Olympic snowboarder on the FBI's 'Most Wanted' list, has been arrested",
        "publish_date": "Sat, 24 Jan 2026 12:59:26 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/keys-pegula-to-film-podcast-before-clash-20260124-p5nwp3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Keys, Pegula to film podcast before clash",
        "publish_date": "Sat, 24 Jan 2026 12:42:15 +1100",
        "category": "finance",
        "authors": [],
        "text": "Keys, Pegula to film podcast before clash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/not-quite-flawless-but-loveliness-abounds-at-david-byrne-show-20260122-p5nw3y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Am I the only one who thinks Nick Cave would be better indoors?",
        "publish_date": "Sat, 24 Jan 2026 12:40:17 +1100",
        "category": "entertainment",
        "authors": [
            "George Palathingal",
            "John Shand",
            "Bernard Zuel",
            "Harriet Cunningham"
        ],
        "text": "Advertisement\n\nMUSIC\n\nNick Cave And The Bad Seeds\n\nThe Domain, January 23\n\nReviewed by BERNARD ZUEL\n\n★★★½ There were so many moments on this night that were sublime, transcendent or just plain marvellous and there was a section of the show which did almost everything you’d want with almost nothing in the way of tools. Connection and collaboration between on-stage and off-stage was instinctive as well as physical, and at least one song that had borne a heavy emotional load on record now felt as if weight had been lifted from it, for us as much as Nick Cave. Nick Cave and the Bad Seeds performing in London in an earlier show on this tour. Megan Cullen With 150 minutes and 23 songs, a loosened and then discarded tie up front and three of the four backing singers in glittering silver robes up back, and at least one droll self-mocking moment (20 minutes into the show which had begun in twilight, Cave, who cliché would have it does not surface in sun or shorts, offered to chuckles from all of us, “I’m unbelievably pleased it’s starting to get dark”), it might feel churlish to find fault. After all, Bright Horses was a ghostly splendour, like the memory of a feast spread out before us in shadows, and easily the song of the night to that point, only to be matched by Joy, an astonishing song in so many ways, from its tale of a dead son appearing at the foot of the bed declaring we’ve had enough sorrow, now is the time for joy, to the way it didn’t become joy but admitted there was room for it. Then I Need You, performed solo at the piano, followed them, all pain and need and emptiness waiting to be filled with the repetition of “just breathe, just breathe, and Carnage completed this quartet, elevating with sorrow’s weight and a sparseness of sound. But that last point was not a coincidence.\n\nAdvertisement\n\nThis 11-piece version of the Bad Seeds was for a good portion of the show not given the clarity of sound to do them justice. Song Of The Lake was sonically murky and bass player Colin Greenwood lost, Jubilee Street built from nothing to a barrelling locomotive careering down a mountainside but its individual elements disappeared, and even Long Dark Night, whose simplicity of arrangement gave welcome space to piano and Warren Ellis’ violin to lead, showed us the vibraphone being played by Jim Sclavunos but declined to let us hear it. Nick Cave performing in London with the Bad Seeds in an earlier show on this tour. Megan Cullen Missing too was some of the power in Red Right Hand and From Her To Eternity, the latter’s devilish dervish rhythm relentless but thin even as Ellis contorted himself and Cave danced in echo. Was I the only one grumbling that this might have been better indoors?(Incidentally, staging a Nick Cave show outdoors as night falls in a Sydney summer and not playing Release The Bats is a missed comic opportunity. Hands up who wants to die for missing that?) Yet, so much of that could almost be forgotten and forgiven by show’s end as White Elephant closed the set with an almost incongruous violence at its core balanced by gospel redemption, as the joyful energy and crowd involvement in Weeping Song opened out the encore for Cave reclaiming the beauty of Skeleton Tree, and as Into My Arms showed again it as hymnal and tender a farewell as one could ask for. Nick Cave and The Bad Seeds also play The Domain , January 24.\n\nAdvertisement\n\nCABARET\n\nBARBRA\n\nHayes Theatre, January 22, until February 14\n\nReviewed by JOHN SHAND\n\n★★★½ Now here’s a puzzle. The Hayes’ Theatre artistic directors, Richard Carroll and Victoria Falconer, wanted a show celebrating Barbra Streisand, and asked Brittanie Shipway to direct it as well as perform in a cast of four. The creative team Shipway assembled has resulted in a sumptuous stage design from Brendan de la Hay (defined by meticulously swagged fabrics and an avalanche of hydrangeas), superbly lit by Peter Rubie, and with well-chosen songs expertly played by Nicholas Gentile and his band. Brittanie Shipway, Laura Murphy, and Stellar Perry in Barbra at Hayes Theatre. John McRae The glaring question is: Why wasn’t the singing as good as everything else?\n\nAdvertisement\n\nThe show’s subtitled The Greatest Star, which sounds hyperbolic until you try to name another to match Streisand as a titan of recordings, concerts, stage and screen – smashing glass ceilings and sales statistics along the way. In celebrating her, surely nailing the singing should be central, and while no one would expect Shipway, Laura Murphy, Tana Laga’aia or Stellar Perry to match up to one of the last century’s most acclaimed singers, they could have avoided certain pitfalls. Tana Laga’aia and Stellar Perry. John McRae One of the wonders of a singer of Streisand’s stature is an effortlessness that remains in place across her range. She’s a belter who doesn’t shout, and when she goes high, she doesn’t screech: there is no harshness to her top notes. Furthermore, she brings the emotional story of a song to life without resort to overstatement. Shipway, Murphy and Perry, by contrast, used every opportunity they could to be big and brassy. Like too many female singers in Australian musical theatre, the imperfections in their technique were exposed when they were loud and high simultaneously. Their voices’ inherent appeal was the first casualty of this, and careful calibration of the differentiation between the drama of the songs was another. Brittanie Shipway, Laura Murphy, Stellar Perry and Tana Laga’aia. John McRae\n\nAdvertisement\n\nLaga’aia’s instincts were sounder, and he sweetly understated Bewitched (Bothered and Bewildered), but the pitching of his falsetto was not always accurate. He was better on The Way We Were, which felt like the first time that the show’s freneticism truly unwound, and yet we were already halfway through its 75 minutes’ duration. Shipway duetted prettily with Gentile on You Don’t Bring Me Flowers, but, even then, they didn’t quite locate the song’s emotional truth. More convincing were Perry and Laga’aia being soulful on Guilty. Murphy was at her best on the Streisand-composed Evergreen (the love theme from A Star Is Born), ably accompanied by Laga’aia on acoustic guitar. The concluding songs were sung by the full company, the vocal harshness partially disguised when there was such genuine excitement in the air, compounded throughout by band, in which Gentile’s piano was joined by Matt Reid’s keyboards, Michael Napoli’s bass and Sam Evans’ drums. If the singers could trust themselves to back off a little more often, they would instantly sound better, and do infinitely more justice to the Streisand legacy.\n\nBarbra also shows at Riverside Theatres from February 26-28. LACRIMA\n\nRoslyn Packer Theatre, January 22, until January 25\n\nReviewed by HARRIET CUNNINGHAM\n\n★★★★ Caroline Guiela Nguyen’s LACRIMA is a dense, tense and ravishly beautiful play of ideas.\n\nAdvertisement\n\nWe are watching the making of a wedding dress for a royal princess, destined to be an instant museum piece. As the dress takes shape, the action unravels the multifarious threads which make up this icon of maximalism: the veil, from a famous lace-making workshop; the jewel-encrusted train, hand-stitched in Mumbai; the dress, constructed in a Paris fashion house. And the non-material threads: the weight of perfection; the rampant costs of globalisation, and the price of secrecy. Performers in the Sydney Festival show LACRIMA. Wendell Teodoro Will they complete the impossible dress in time? And will they survive the ordeal? LACRIMA speaks to an audience well-versed in modern storytelling. The opening scene, for example, is the essential attention-grabber, an adrenalin shot of anguish, sirens and paramedics. Then, on the screen which hangs centre stage, we see the caption, “three months earlier”. From here, LACRIMA plays out across multiple storylines, acted out on different parts of the cavernous stage, and compiled on the big screen, in a Netflix collage of talking heads and cutaways.\n\nAdvertisement\n\nWe meet the lacemakers as they are interviewed for a podcast, and sit in on the embroiderer’s compulsory eye test. We see the atelier, the bolts of fabric, the dressmaker’s dummies tricked out in haute couture fantasies and hear people converse in multiple languages. It’s simultaneously a documentary and drama, a live performance and a movie, flicking between formats like a restless couch-surfer flicking between channels. From the cacophony, ideas and questions emerge like pearls. The silence of workers bent over tasks is interwoven with the silence of family secrets, domestic violence and 100-year non-disclosure agreements. The demands of royal clients and rabid creatives are matched by the obsessive quest for perfection of the artisans, who will only stop working when they stop breathing. Meanwhile, Nguyen salts the action with loaded questions – why use jewels, when crushed CDs are lighter and brighter? Why impose ethical working practices on a slave economy from which you benefit? Nguyen and her small army of technicians and cast members weave a world of ideas, metaphors and storylines into one intense work of art. The performances, often direct to camera, are utterly compelling, while the staging, which involves the split-second dance of movable partitions to create multiple spaces, is visually spectacular. Add to that the visceral heft of a soundtrack which ramps up the tension with low growls and pulses. It’s all too much: too many jewels, too many hours of work, and too much going on. Even the play’s length – three hours, with a three-minute break where the audience is instructed not to leave the room – is almost too much to endure, drowning us in an embodied state of overwhelm. But that is the point: this work, which is one of the international showpieces of Sydney Festival, is meant to be too much. Too much to take in, but so much to take away. MUSIC\n\nDavid Byrne\n\nTikTok Entertainment Centre (ICC), January 21\n\nReviewed by GEORGE PALATHINGAL\n\n★★★★½\n\nAdvertisement\n\nLoveliness abounds at a David Byrne show. We know this from our extraordinary shared experience in this same room in 2018 but, you know, some stuff has happened since then. We learn on this night, to some extent, how the pandemic affected the former frontman of Talking Heads, the band that all but defined NYC art rock from the late ’70s to the mid-’80s. Byrne clearly tried to process some of those feelings on last year’s Who Is the Sky? album, so here he continues the exercise, with some of those songs joining the tried-and-true favourites from his brilliant career. David Byrne in full flight at the TikTok Entertainment Centre. Pete Dovgan In a nutshell, he’s still seeking connection, and seeing him perform remains among the most life-affirming ways to find it. Thanks to his exquisite use of screens and lights, we spend time on the moon, looking down at Earth (for the maudlin but warm Heaven); in neon-hued streets to a seamy funk soundtrack of Houses in Motion; at the (hardly hellish, unsurprisingly stylish) abode where Byrne was stuck during lockdown (the jaunty folly of My Apartment Is My Friend); and more cleverly realised locales.\n\nAdvertisement\n\nDavid Byrne with a few members of the 12-strong band. Pete Dovgan There’s other visual trickery, and sometimes the gimmicks supersede the songs (and distract you from the lesser ones; hello, Independence Day) – but more often than not the aesthetics emphatically enhance them. Related Article David Byrne Talking Heads legend David Byrne on embracing life’s smaller moments This includes the band, a riveting, dozen-strong collective roaming the stage along with Byrne in perfectly choreographed harmony, variously playing their assigned instruments and/or dancing with infectious joy. We join them on our feet, of course, especially for the Talking Heads classics: the meticulously, blissfully building This Must Be the Place; the ever-dizzying perfection of Once in a Lifetime; the cathartic euphoria of Burning Down the House. At the risk of being That Guy, this tour is not quite as spectacular as the flawless 2018 show – a version of which you can see in Spike Lee’s 2020 concert film American Utopia – though that’s an opinion largely based on my feelings on the likeable but merely fine songs of Who Is the Sky? ousting others I’d rather see and hear. But a David Byrne performance is still quite like nothing else out there, in most of the very best ways. Get fascinating insights and explanations on the world’s most perplexing topics. Sign up for our weekly Explainer newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/hottest-100-follow-the-countdown-20260123-p5nwi6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hottest 100: follow the countdown",
        "publish_date": "Sat, 24 Jan 2026 11:51:29 +1100",
        "category": "finance",
        "authors": [
            "Nell Geraets"
        ],
        "text": "A seriously hot day is about to get even hotter because triple j’s Hottest 100 will shortly kick off.\n\nThe annual countdown, which lists Australians’ favourite songs from the past year, will begin at 12pm (AEDT), and I will be following each and every track along the way, offering some (hopefully) hot takes on the biggest hits of 2025. You can also bop along to the tracks yourself by tuning into triple j on the radio, online or via the triple j app.\n\nPrepare for even more heat today because the Hottest 100 is upon us. ABC/triple j\n\nThis year, Aussies were able to vote for any songs released between December 1, 2024 and November 30, 2025. Though the results are kept firmly under wraps, we know that 26 acts featured in the countdown are making their Hottest 100 debut this year, and some kind of significant record is set to fall… What that record is exactly, only time will tell.\n\nGood Luck, Babe! by Chappell Roan took home the top position last year, but what song will reign supreme this time around? Will it be a classic oldie or a new hit, a local tune or a global heavy-hitter? Grab a cold one and get comfortable because we’re about to find out.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/ufc-star-collapses-after-making-weight-20260124-p5nwon.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "UFC star collapses after making weight",
        "publish_date": "Sat, 24 Jan 2026 09:57:04 +1100",
        "category": "sports",
        "authors": [],
        "text": "UFC star collapses after making weight\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/waratah-faces-suspension-after-fight-club-erupts-at-pre-season-training-20260120-p5nvgc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Waratahs enforcer suspended for pre-season punch-up",
        "publish_date": "Sat, 24 Jan 2026 09:57:03 +1100",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Giant Waratahs lock Miles Amatosero has been slapped with a four-match ban after a flurry of five punches on the training field left new teammate Angus Scott-Young with a fractured eye-socket and in doubt for the opening round of Super Rugby next month.\n\nRugby Australia and the Waratahs announced the sanction on Saturday morning after an investigation into a skirmish between Amatosero and Scott-Young during a Waratahs’ pre-season training session two weeks ago.\n\nMiles Amatosero, pictured after a Waratahs’ loss in 2025. Credit: Getty Images\n\nScott-Young arrived at the Waratahs in December, after the former Queensland backrower – and son of former Wallaby Sam Scott-Young – had been recruited back to Australia from English Premiership club Northampton.\n\nWitnesses said Amatosero had tangled with Scott-Young at a training session in early January, which resulted in the 23-year-old throwing five punches at his teammate, in two separate moments.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/why-papenhuyzen-s-retirement-was-no-shock-to-storm-star-20260122-p5nw1s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Papenhuyzen’s retirement was no shock to Storm star",
        "publish_date": "Sat, 24 Jan 2026 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "After suffering a broken hand, broken arm and dislocated shoulder last season, Jahrome Hughes knows what is required, physically and mentally, for an NRL player to keep braving the pain.\n\nSo when his long-time Melbourne Storm teammate Ryan Papenhuyzen revealed in a podcast this week that “I think I’m retired” - as opposed to merely taking a year off - Hughes understood better than most how and why he reached that decision.\n\nStorm halfback Jahrome Hughes and his former teammate Ryan Papenhuyzen. Credit: Getty\n\n“I’ve been pretty close with ‘Paps’ and I’ve seen what he’s been through,” Hughes said.\n\n“All the injuries, and then the mental stuff he had to go through, I know it can take a toll on people.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/fashion/who-is-this-dress-for-the-problem-with-menswear-on-the-runway-20260122-p5nw2b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Who is this dress for? The problem with menswear on the runway",
        "publish_date": "Sat, 24 Jan 2026 09:30:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "Advertisement\n\nLifestyleFashionMenswear Opinion Who is this dress for? The problem with menswear on the runway Damien Woolnough Fashion editor January 24, 2026 — 9:30am\n\nJanuary 24, 2026 — 9:30am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA sequinned purple and silver top with a low-cut neckline can be expected at a Dior runway show, along with puffy floral capes, and knitted dresses. The clothing confusion begins when you realise that its men’s fashion week in Paris. Models, built like gently muscled pipe cleaners, should give the game away, but looking at the clothes, it’s unclear whether the menswear shows are for female or male customers. Dior menswear, designed by Jonathan Anderson at Paris Fashion Week. Getty Images A model on the Dior menswear runway in Paris. Getty Images\n\nAdvertisement\n\nCelebrities such as Jacob Elordi, Josh O’Connor and A$AP Rocky manage to eloquently and elegantly speak to menswear trends on the red carpet, but something is getting lost in translation on the runway. Who is buying the fluffy pink scarf on the Feng Chang runway, the wrap skirts at Dior and the white square neck cotton tops worn with chunky red earrings at Prada? These beautiful pieces look ready to be championed by women and fashion-forward members of the LGBTQ community such as Troye Sivan, Billy Porter and Colman Domingo, but the broader male consumer is being left behind. Delicate cottons and bold earrings on the Prada runway in Milan. Gamma-Rapho via Getty Images The number of female models on the runway in Giorgio Armani suits, Dsquared2 distressed denim and Auralee plaid shirts at adds to the co-ed confusion. This is not the time to give up on the majority of male shoppers. A study by Italian fashion industry group Altagamma shows that the number of luxury consumers shrunk to about 340 million people in 2025 from 400 million people in 2022.\n\nAdvertisement\n\nIf anyone can bring millions of men back its fashion hot property Jonathan Anderson, who reinvented Spanish brand Loewe. It’s early days for Anderson at Dior but at his second menswear runway show this week, Monsieur Dior looks an awful lot like mademoiselle. Editor's pick Fashion designers From Jackie O to Julia Roberts: Five Valentino dresses for the history books Male models wearing Bar jackets, a womenswear staple introduced by Christian Dior in 1947, and full skirts, appear dressed for female customers. Louche wide lapel grey flannel suits, hybrid sailor and cargo jeans and whimsical polo shirts, with or without epaulettes, offered some relief and shouldn’t confuse store staff wondering where to hang them when they arrive in boutiques this year. Prada’s trench coats, with contrasting cropped ponchos, forest green coats and narrow double-breasted suits were also clearly for the boys.\n\nAdvertisement\n\nUnfortunately, compared to the excitement and execution of more female-friendly pieces, the masculine clothing came up short. At Dolce & Gabbana, Louis Vuitton and Zegna, silhouettes, suiting and separates suffered from a case of aesthetic arrested development. If we can’t find a happy medium, where menswear shows generate excitement, without relying on female, non-binary and LGBTQ customers, why have them? Maya Hawke at the Prada menswear show. Getty Images for Prada This might be why Alexander McQueen’s creative director, Sarah Burton, has removed menswear from all runway shows, Gucci’s shows now combine menswear and womenswear, and luxury labels continue to drop from the men’s fashion week calendar. It’s becoming increasingly clear why London Menswear Fashion Week was cancelled last year.\n\nAdvertisement\n\nClothes don’t have a gender, but it would be great for a man to have more exciting options, other than a sequin top and full skirt, to wear to the office on Monday. Make the most of your health, relationships, fitness and nutrition with our Live Well newsletter. Get it in your inbox every Monday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/consumer-affairs/getting-married-there-s-a-new-chart-to-check-before-buying-a-ring-20260123-p5nwfv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Getting married? There’s a new chart to check before buying a ring",
        "publish_date": "Sat, 24 Jan 2026 09:00:00 +1100",
        "category": "finance",
        "authors": [
            "Nick Toscano"
        ],
        "text": "Advertisement\n\nBusinessConsumer affairsGold Getting married? There’s a new chart to check before buying a ring Nick Toscano January 24, 2026 — 9:00am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nAustralian jewellers are having to get used to a new daily routine: checking the wild gains in the price of gold. “I have to now,” said Timothy Sung, director of Melbourne’s Janai Jewellery. If bombs have dropped somewhere, or US President Donald Trump has unleashed new chaos with threats of tariffs, the past year has shown that a jump in the price of gold will invariably follow. This could add hundreds or even thousands of dollars to the cost of an item of jewellery, pressuring retailers’ profit margins. More so than ever before, anxious investors and central banks have been piling into gold, the yellow metal that has been prized by civilisations for thousands of years for its lustre but which is now more often favoured as a safe haven for storing wealth during uncertain times. In an era defined by geopolitical tensions, inflation fears, erratic policymaking and an erosion of trust in the US dollar, gold’s value ballooned 64 per cent last year, its biggest annual gain since 1979. Janai Jewellery director Timothy Sung. Paul Jeffers Predicting the next price shock had proven a “bit of a challenge” lately, said Sung, as he looped around the showroom of his store on Collins Street in Melbourne’s CBD. The latest jolt arrived earlier this week with fears Trump’s plan to take over Greenland could set off fresh diplomatic and trade crises, which spooked financial markets and boosted gold’s appeal. On Wednesday, it hit an all-time high above $US4800 ($7000) an ounce.\n\nAdvertisement\n\n“As soon as I hear news, I have to be brave enough to buy gold,” said Sung, who sources gold from Australian producers, processes it at his factory in Vietnam and fabricates it into jewellery in Melbourne. He estimated that he spent tens of thousands of dollars each month last year to lock in supplies of the metal before prices marched even higher Demand for jewellery had remained resilient, Sung said, especially for engagement rings. “Everyone still needs one – no ring, no wedding,” he said. Janai sells about 300 rings a month, forcing Sung to try to keep one step ahead of any major fluctuations. But as rising costs have crunched retail margins and forced jewellers to reset prices, consumer preferences have also begun shifting in favour of pieces containing less gold. Jewellers report that more people are asking for nine carat or 14 carat, instead of 18 carat gold, or a different metal altogether, like platinum, which used to sell at a discount. Male wedding bands with widths of 5 millimetres or 4.5 millimetres, rather than 6 millimetres, have also gained popularity. So steep were last year’s gold price rises that some heavier pieces of jewellery ended up being hundreds of dollars more expensive between the time of quoting and delivery, said Talitha Cummins, founder and director of The Cut Jewellery, which has two stores in Sydney and is launching its first in Melbourne next month. “You have to keep a really close eye on the numbers and think ahead a little bit when you are quoting to try to anticipate where prices are going,” Cummins said.\n\nAdvertisement\n\nTalitha Cummins is founder and design director of The Cut Jewellery. “There is a perception that jewellers are making a lot of money out of these price rises, but that’s not the case unless you’ve got stock on hand that you’ve held for a long time.” Naturally, higher prices had deterred people from buying as much gold as before, she said. Last Christmas, for example, fewer customers purchased gold chains with pendants than a year earlier. “Some people might opt just for a pendant to wear on their own chain now,” she said. “People are becoming crafty and thinking a little differently.” What the coming 12 months might hold for the gold price remains to be seen, but some money managers are already betting that private-sector investors won’t be selling their gold stocks anytime soon. They cite worries such as high debt levels in the US and Japan, tensions over Greenland and Trump’s escalating efforts to exert control over the US central bank.\n\nAdvertisement\n\n“Nothing has changed. If anything, Trump has gone crazier than ever,” said AMP chief economist Shane Oliver. “This chips away at faith in the US, and the worries about the Federal Reserve are only ramping up. I think it will go on for a while yet.” Further price rises would not be linear, Oliver said. “We will get pullbacks, as gold gets to the point that it is technically over-bought, and traders unwind their positions, but the trend will remain up,” he said. “That’s the nature of a bull market, and gold is in a clear bull market.” Cummins was bracing for challenging times to continue. “I don’t see world peace or a global stabilisation happening anytime soon,” she said. “It’s not looking promising, but we will have to go with what is thrown at us.” The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/hobart-teammates-clash-in-bbl-playoff-20260124-p5nwod.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hobart teammates clash in BBL playoff",
        "publish_date": "Sat, 24 Jan 2026 08:57:56 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-day-heat-puts-emergency-crews-on-edge-20260124-p5nwo9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia Day heat puts emergency crews on edge",
        "publish_date": "Sat, 24 Jan 2026 07:30:21 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/uk-pm-prince-harry-slam-trumps-afghanistan-comments-20260124-p5nwo8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "UK PM, Prince Harry slam Trump's Afghanistan comments",
        "publish_date": "Sat, 24 Jan 2026 07:28:59 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/after-a-night-out-men-and-women-face-very-different-heart-health-risks/fp2srcqjf",
        "title": "After a night out, men and women face very different heart health risks",
        "publish_date": "Fri, 23 Jan 2026 21:25:01 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "New research has found that your sex and alcohol intake could be related to your risk of developing a \"major\" condition called atrial fibrillation, which could lead to stroke or heart failure.\n\nAustralian and Swedish analyses of past studies have found that while one standard drink a day affects both men and women the same, between one and four standard drinks a day increased the risk of the condition for men only.\n\nHowever, at higher levels of consumption of six standard drinks a day, women had a significantly higher risk to their heart health when compared to men.\n\nMohammad Hossein Hadi, a research fellow at the University of Melbourne, was an author of the study.\n\n\"The sex-specific pattern we observed may reflect a mix of factors, including biological differences, such as alcohol metabolism, hormonal influences, and body composition,\" he told SBS News.\n\nAustralian health guidelines recommend no more than 10 standard drinks a week for men and women, while other experts have told SBS News there is \"no safe amount\" of alcohol consumption.\n\nThere is a daily recommended limit of no more than four standard drinks a day.\n\nWhat is atrial fibrillation?\n\nAlcohol consumption can lead to a range of health issues, including atrial fibrillation, a common heart rhythm disorder.\n\nHadi described it as a \"major heart condition\" that presents similar symptoms in men and women.\n\n\"Some people are asymptomatic, while others have persistent symptoms that affect daily functioning,\" he said.\n\n\"Some people notice palpitations, shortness of breath, fatigue, dizziness, or reduced exercise tolerance, while others have no symptoms and are diagnosed incidentally.\"\n\nHe said that atrial fibrillation can increase a person's morbidity and mortality, often requiring ongoing management.\n\n\"It is associated with a substantial health burden.\"\n\nWhile the relative risk of atrial fibrillation differed between men and women based on intake, risk increased across the board among people who drink more frequently.\n\nDifferences in men and women\n\nRachel Visontay, a postdoctoral research fellow at the University of Sydney, explained that different groups of people break down alcohol at varying rates.\n\nMen are more efficient at metabolising alcohol for a few reasons, according to Visontay.\n\n\"One, they've got a higher amount of water, which is what disperses alcohol,\" she said.\n\n\"And they've also got higher concentrations of the enzymes in the stomach that do the first part of breaking down the alcohol, which means you've got less of it going into the liver and less of it going into the bloodstream.\"\n\nTypically, this means men are less likely to experience the short and long-term health impacts of drinking when compared to women consuming a comparable amount.\n\nVisontay explained that Australia has a set guideline — recommending no more than 10 standard drinks a week for men and women — whereas in some countries, the threshold for men is higher, reflecting a greater ability to tolerate alcohol.\n\nGeneric variations in different ethnicities can also affect a person's capacity to break down alcohol.\n\nOne group that is often less able to break down acetaldehyde — one of the first byproducts the body makes when processing alcohol — is people of East Asian background, who can be more likely to experience what is colloquially termed 'Asian flush'.\n\n\"They'll start to get quite red quite quickly, and they might get some uncomfortable side effects like heart palpitations and nausea,\" she said.\n\n\"That will not just cause problems in the short term, like making drinking unpleasant, but in the long term as well.\"\n\nLong-term harms of alcohol are \"numerous\" and include an increased risk of cancers, dementia and cognitive impairment.\n\n\"There's really strong evidence for the relationship between alcohol and increased risk for cancers, and in particular the parts of the body where alcohol is making contact,\" she said.\n\nNo safe amount of alcohol\n\nClaire Gardner, manager of food and nutrition at the Australian Heart Foundation, told SBS News that following the Australian guidelines helps lower the risk of alcohol-related harm, but it does not remove all risk.\n\n\"There is no completely safe level of alcohol consumption,\" she said.\n\n\"High-quality studies, including those looking at just one standard drink, have found that even low levels of alcohol can raise the risk of heart disease.\n\nEven small amounts of alcohol increase the risk of developing neck, throat, colorectal or liver cancer.\n\nREAD MORE From cheers to fears: This is what happens to your body when you have a hangover\n\nGardner and Visontay also explained that past studies saying alcohol like red wine can be good for heart health are now outdated, and have been disproved by newer research.\n\n\"The supposed benefits of light drinking were likely influenced by the fact that light drinkers often have healthier lifestyles overall, not because alcohol itself is protective,\" Gardner said.\n\n\"Alcohol is not a defining feature of heart‑healthy eating patterns, even in the Mediterranean diet, where benefits come from the overall diet, not the wine.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/heats-on-for-aussie-survivor-against-two-time-australian-open-champ-naomi-osaka/pt0ac3ckj",
        "title": "Heat's on for Aussie survivor against two-time Australian Open champ Naomi Osaka",
        "publish_date": "Fri, 23 Jan 2026 21:23:04 +0000",
        "category": "sports",
        "authors": [],
        "text": "The last remaining home hope in the Australian Open women's draw is gearing up to leave everything on the court, chasing another dream win as extreme heat grips Melbourne Park.\n\nWest Australian qualifier Maddison Inglis is ready to \"lock-in\" when she steps onto Rod Laver Arena on Saturday night to face Naomi Osaka, who's been turning heads more for her fashion statements than her tennis.\n\nAlthough soaring temperatures are creating challenges for both officials and players, the day's play will start earlier and practice sessions may be halted with the mercury forecast to climb to 40 degrees.\n\nIt will be difficult conditions for Inglis, who has already spent 13 hours and 24 minutes on court across her singles, doubles and mixed doubles matches.\n\nBut the 28-year-old, who has advanced to the third round for a second time, is savouring every moment of her journey.\n\nNaomi Osaka turns heads with her on-court fashion Source: AAP / Dita Alangkara\n\n\"I know it will be a tough match,\" said Inglis, the world No.168, who would shoot up the rankings by more than 50 places should she beat four-time grand slam champ Osaka.\n\n\"But right now I'm going to soak it all in. You're not in the third round of a grand slam every day.\"\n\nGates open at Melbourne Park at 9am, while play has shifted forward to 10.30am, as tournament organisers make moves to ensure the safety of players and off-court staff.\n\nExtreme heat\n\n\"We expect pleasant conditions tomorrow morning, in the mid-20s, and will start play earlier and take advantage of the more temperate conditions,\" Australian Open tournament director Craig Tiley said.\n\nThe tournament implemented an extreme heat protocol using a \"heat stress\" scale in 2019, which factors in air temperature, radiant heat, humidity and wind speed to generate a reading between one and five.\n\nIf the scale hits five, play is suspended on outdoor courts, while the roofs are closed on the Rod Laver, John Cain and Margaret Court arenas.\n\nA 10-minute cooling break will be allowed between the second and third sets for women's matches, and between the third and fourth sets for men's singles, while the ballkids will work on a 45-minute shift rotation, instead of an hour.\n\nWorld No.1 Aryna Sabalenka will be grateful to avoid Saturday's extreme heat, but could face scorching conditions on Tuesday if she can get past rising star Victoria Mboko in their fourth round clash on Sunday.\n\nThe two-time Open champion is thankful for the heat policy.\n\n\"I think it's too much on our bodies,\" Sabalenka said.\n\n\"The weather is being crazy. It's a lot of adjustment on the strings, your approach to the match.\n\n\"It depends on the weather because it's going like a rollercoaster.\"\n\nThe heat could also impact the practice schedule for world No.12 Daniil Medvedev, who is locked into another battle with Learner Tien on Sunday.\n\n\"I will practice in the heat. Then worst case, if it's too hot, we can always go indoors. I would prefer outdoors,\" the three-time Australian Open finalist said.\n\n\"We try outdoors, see how it goes. Of course, not easy for the guys to play.\n\n\"That's what happens in Australia.\"\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/50-years-since-concordes-first-commercial-flight-memories-linger-on/9u9bcpqfw",
        "title": "50 years since Concorde's first commercial flight, memories linger on",
        "publish_date": "Fri, 23 Jan 2026 20:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nConcorde's occasional visit to Australia made headline news.\n\nThis report was from Channel Nine's John Collis in 1985, who watched Concorde set off on a record-breaking trip from Sydney to London.\n\n“She received the all clear and huge jets roaring bulleted down the runway. Concorde soared rapidly to 5,000 feet, turned left through 180 degrees and set necks craning again as she swept above the harbour in a farewell salute to Sydney. She should be on the ground at Heathrow just 17 hours after takeoff, meaning yet another record for Concorde. Because no one has bothered to claim a new record for the Sydney to London flight since 1938, it still stands at 130 hours.”\n\nWhile there were ambitious plans, consistent, profitable commercial routes to Australia were never established.\n\nIt was Just nine years earlier, in January 1976, that Concorde made its maiden commercial flight.\n\nNewsreel commentators waxed lyrical about the revolutionary aircraft.\n\n“Concorde's paper dart appearance promises performance and it keeps its promise. It's twice the plane in more than looks. It can fly twice as fast and twice as high as other airliners and can cut journeys in half. “\n\nConcorde combined raw power with a sleek elegance that made it unlike any passenger aircraft before or since.\n\nIt was the aircraft that carried royalty, celebrities and business leaders across the Atlantic at unheard-of speed.\n\nDeveloped through a joint project between Britain and France in the 1960s by the British Aircraft Corporation and Sud Aviation, later Aérospatiale, Concorde was designed to cruise at more than twice the speed of sound and at altitudes of nearly 60,000 feet, on the edge of space, far above conventional airliners.\n\nPeter Archer is the chairman of Duxford Aviation Society in Britain.\n\n“Concorde design, it was in 1962, both the French and British governments had people working on it. They couldn't afford to do it separately so it came in a combined operation and over the next seven years, British designers and French designers and engineers all worked together. And it was pretty remarkable because they didn't have a lot of computing power, not like we have today. And one lot were working in metric system and the other lot in imperial, and they were building it in two factories but they all joined together and it worked.”\n\nAir France and British Airways wanted to fly Concorde to the US on the lucrative trans-Atlantic route.\n\nBut American authorities were reluctant, citing sonic booms and environmental impact, banning Concorde because it was the world's noisiest plane - though many believed the ban was really because the plane had not been built by a US manufacturer.\n\nThe Europeans argued that the ban was discriminatory and detrimental to Concorde’s operations - and in August 1977, the US Supreme Court agreed and the ban was lifted.\n\n“The famous nose scents a victory that a few weeks ago seemed defeat. With the skies clear to New York for supersonic flight, it's felt the rest of the world will go Concorde.”\n\nThere was no getting away from the fact that Concorde looked beautiful but was, indeed very noisy.\n\nFormer chief engineer John Britton says, however, the engines were revolutionary.\n\n“One of the first things I started working on at that time, so we're talking about 1968, we were building the prototypes, so I was actually working on the engine. The engine we called the power plant because it's the engine (controls) the air intake and then the primary and the secondary nozzle. So there's three main bits of it. And the whole of it goes to make up the power plant.”\n\nConcorde only ever had one crash - but it grounded the supersonic jet forever.\n\nOn the 25th of July 2000, a piece of metal dropped from a Continental Airlines DC10 on to the runway at Charles De Gaulle airport in Paris.\n\nAir France Flight 4590 ran over the debris, causing a tyre to explode and disintegrate. Tyre fragments, launched upwards at great speed damaged parts of the landing gear and ruptured a fuel tank.\n\nThe images of Concorde with flames streaming behind it in the seconds before it crashed were hard to forget.\n\nAll nine crew and one hundred passengers on board were killed, as well as four people on the ground.\n\nJohn Britton again.\n\n“The next morning we were on the crash site in Gonesse and that was a terrible experience because all our training and experience was aimed at keeping aircraft in perfect airworthiness condition and that is my responsibility. I held the airworthiness signature to the CAA in the UK for our work share of the Concorde fleet. And so to be confronted with something that we thought we would never see that was a Concorde crash was absolutely terrible and it was a real low point in our career.”\n\nThe entire fleet was grounded and later returned to service after extensive and costly safety modifications, including strengthened fuel tanks and reinforced tyres.\n\nFlights resumed after 18 months, but passenger numbers never fully recovered, and maintenance requirements increased significantly.\n\nIn 2003, both British Airways and Air France permanently retired Concorde, citing rising costs, ageing aircraft and declining demand.\n\nJohn Britton says for those who worked on it, Concorde remains unmatched.\n\n“My son says, ‘How am I going to tell the grandchildren that their grandpa flew to New York in three hours 20 minutes and it takes us if we want to go to Disneyland in Florida it’s going to take us eight hours to get there?’ And the answer to that is Concorde.”",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/life-for-afghan-women-under-taliban-rule/vbxloya9s",
        "title": "Mariam wants to go to high school like other girls her age. Her government won't let her",
        "publish_date": "Fri, 23 Jan 2026 19:54:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "When the Taliban took control of Afghanistan in August 2021, millions of Afghan women and girls saw their futures disappear.\n\nUnder the regime, they have been denied access to secondary education and universities, excluded from most jobs and faced severe restrictions on their freedom and mobility.\n\nAccording to the United Nations, nearly 80 per cent of young women aged 18 to 29 are not currently in education, employment or training in Afghanistan. Restrictions have now become the norm, with not a single decree restricting the rights of women and girls having been repealed in the four years of Taliban rule.\n\nRoya was in her final year of university in 2021 and among the last women to graduate before the regime closed the doors of higher education to women. SBS News has changed her name for safety reasons.\n\nDuring her studies, she also held down jobs in various industries including education and media, aspiring to independence.\n\nShe graduated in 2022, but since then has been \"unemployed and unable to work\" and forced to stay at home.\n\n\"The Taliban's restrictions didn't just take away my job, I think they took away my identity and a part of my future because I was an independent girl, standing on my own feet and making my own decisions,\" she tells SBS News.\n\n\"Anyone who finds themselves in these circumstances feels worthless; a sense of fear and despair arises in them. And the hardest part is knowing that a person has the ability to do something but unfortunately is not allowed to do it, which is the most painful of all.\n\nThis situation has not only destroyed my life, but I think it has also silently destroyed the future of a generation of Afghan women.\n\n'Erased from public space'\n\nAfghan women experienced harsh suppression under the first Taliban rule in the 1990s.\n\nThe post-Taliban era, starting in 2001, saw significant gains for women, including access to education and employment, as well as positions in prominent political roles.\n\nZaki Haidari, a strategy campaigner at Amnesty International Australia, says after 2001, when NATO and its allies went into Afghanistan, Afghan women had access to certain freedoms and rights, particularly in major cities.\n\n\"They could go to university. [Afghanistan] had a parliament where we had women MPs ... and ministers. We had women in all sorts of government offices and public spaces,\" he says.\n\n\"In rural Afghanistan, again, there were some restrictions because the movement of the Taliban and some parts of Afghanistan were still controlled by the Taliban.\"\n\nDespite progress over the following decade, in 2011, Afghanistan was named the most dangerous place in the world to be a woman by a Thomson Reuters Foundation survey, which cited the country's high levels of violence, poor healthcare and poverty as primary factors.\n\nAnother decade on, in August 2021, the US withdrew its troops after 20 years of war and the Taliban regained power.\n\nThe rights of women and girls were rapidly rolled back. Women are now prohibited from travelling more than 75km without a male guardian, barred from public spaces such as parks and gyms, and forced to comply with strict dress codes that limit their presence in public life.\n\nHaidari tells SBS News that under the Taliban, women in Afghanistan have been \"completely erased from public space\".\n\nWhen the Taliban took over Afghanistan, all the rights were taken away from women and they were forced to stay home.\n\n\"Afghanistan is one of the only countries in the world which deprived women from having access to their basic rights.\"\n\nMore than 1,500 days without education\n\nAccording to a 2025 UN Women report, 92 per cent of Afghans support girls continuing their education beyond year 6. Yet for many high school-aged women, four out of a potential six years of secondary education has now lapsed.\n\nMariam (not her real name) was in Year 5 when the Taliban banned girls from secondary school. She was allowed to continue her studies until she completed primary education but was not allowed to progress further. She says it's a difficult reality to accept.\n\nWomen on the Ghazni highway, Afghanistan in 2025. Source: Getty / Image digitally altered\n\n\"When the school doors closed and they said girls could not study after year 6, it had a bad impact not only on me, but on all Afghan girls,\" she says.\n\n\"It is truly a great inequality that in foreign countries girls can pursue education and build a bright future, while in Afghanistan there are many girls who have no hope for the future to work for it and achieve it.\"\n\nAfghanistan is the only country in the world where girls are banned from secondary education and most forms of work, but they can still be seen on the streets begging to financially support their families.\n\nMariam, who is now 14, says she is deeply disappointed by the ongoing injustice in Afghanistan, but still hopes the international community can help make education possible for girls.\n\n\"Seeing women begging while they do not have the right to go to school is an injustice,\" she says.\n\n\"My request to the international community is to reach an agreement with the Afghan government through negotiations so that they can open schools for girls and allow girls to continue their education.\"\n\nSBS News contacted the Taliban for comment on the situation for women and girls in Afghanistan but did not receive a response.\n\nIn an August 2025 interview with SBS Pashto, the Taliban's spokesperson, Zabiullah Mujahid, stated that work has been done on women's rights, noting women are employed in various government sectors, including health, education and security.\n\nHe added restrictions on women's education are \"temporary\", and they are trying to address the existing challenges.\n\n\"Women have now found a place for themselves that was their rightful [Sharia-based] right, from which they had been deprived for many years. Nowadays, they have access to it, they can easily obtain their rights, make their own decisions, and determine their own destiny in life,\" he told SBS Pashto.\n\n\"It was initially stated that this is a temporary decision and that the needs would be assessed. We want to find a way that respects our Sharia principles and also achieves consensus in society.\"\n\nAustralian aid to Afghanistan\n\nSince 2001, the Australian government has provided more than $1.7 billion in development and humanitarian assistance to Afghanistan.\n\nThis support continued even after the country fell under Taliban control in 2021, with Australia contributing more than $260 million to support the Afghan people in the years since. The Department of Foreign Affairs and Trade (DFAT) says this funding has a strong focus on women and girls.\n\nAs Australia has no diplomatic presence in Afghanistan, SBS News understands the funding has been instead distributed to UN agencies such as the United Nations Office for the Coordination of Humanitarian Affairs and the World Food Programme.\n\nA spokesperson for DFAT says the Australian government is \"committed to supporting the people of Afghanistan\" during \"one of the world's most protracted humanitarian crises\".\n\n\"We also recently established the world's first autonomous sanctions framework for Afghanistan, which enables Australia to directly impose its own sanctions and travel bans to increase pressure on the Taliban, targeting the oppression of the Afghan people, particularly women and girls.\"\n\nAccording to the spokesperson, a further $50 million is allocated for 2025/26.\n\nSBS News understands aid is also provided in line with autonomous and UN Security Council sanctions, ensuring it does not directly benefit the Taliban. It is delivered through trusted partners, including UN agencies, to reach those most in need, including minority groups such as the Hazara.\n\nAfghan women look at the skyline of Kabul, Afghanistan in September 2020. Source: AP / Image digitally altered\n\nArafat Jamal is the United Nations High Commissioner for Refugees' (UNHCR) country representative in Afghanistan. He explains that Australian aid is delivered through the UNHCR's \"people-to-people approach\", avoiding bureaucracies and adhering to the UN's policy prohibiting assistance to the Taliban.\n\n\"The overall picture for women is very bleak, whether it's in education or jobs. At the same time, I think this is really the strength of the United Nations and why the funding that Australia and others provide is so essential, is that with that funding, we do have leverage,\" Jamal says.\n\n\"We try to ensure that every dollar that we spend in Afghanistan goes to the people ... Wherever we can, whether it's in entrepreneurship, whether it is in community centres, whether it is in counselling, gender-based violence, we do focus on women.\n\n\"And in fact, in our statistics, we end up providing more assistance to women and children than we do to men.\"\n\nAfghanistan's secret schools\n\nAlongside the Australian government, Afghan communities in Australia are also contributing to humanitarian efforts. They are providing aid and helping to run secret education programs to support women and girls in Afghanistan.\n\nDr Nilofar Ibrahimi was a gynaecologist in Afghanistan and served as a member of parliament before the Taliban's return to power. After resettling in Australia in 2021, she has remained deeply committed to advocating for Afghan women and girls.\n\n\"Women in Afghanistan are living in the darkest period of history, and the world should not remain silent in the face of this darkness,\" Ibrahimi tells SBS News.\n\nDr Nilofar Ibrahimi founded the ZamZam Foundation to support and empower vulnerable women and girls. Credit: SBS News.\n\nIn 2019, she founded the ZamZam Foundation to support and empower vulnerable women and girls, particularly orphans and widows.\n\nFollowing the fall of Afghanistan two years later, the Canberra-based foundation also started helping newly arrived Afghan refugees in Australia.\n\nIbrahimi says the focus of the foundation's work now is running secret schools in Afghanistan, where girls take risks to attend classes and learn.\n\n\"We gathered these girls very carefully and our classes focus mainly on the English language and science,\" she says.\n\n\"Through fundraising here, we send money to them to cover teachers' salaries and some expenses for the girls who travel from distant areas to different places where they study. Of course, their locations are confidential.\"\n\nBut she says the foundation's reach is limited.\n\nAccording to the United Nations Population Fund, as of 2025 Afghanistan's population is estimated to be 43.8 million. Approximately half are women, according to World Bank statistics from 2024.\n\n\"If Afghanistan has a population of 40 million, certainly 20 million of them are women,\" Ibrahimi says.\n\n\"Among these 20 million women, who are deprived of the right to work, the right to education, and even the most basic human rights, our services are very insignificant.\"\n\nThe Afghan embassy in Australia — staffed by diplomats appointed by the previous Afghan government — continues to work with the Afghan community to organise programs supporting women.\n\nAfghan ambassador in exile Wahidullah Waissi told SBS News in November 2025: \"Afghanistan is an isolated land under the Taliban regime\", adding that the embassy is \"providing a platform for people\" to come together.\n\nHe says its greatest responsibility is to \"enable an environment for greater advocacy for the girls and women of Afghanistan who are under the biggest repressive regime\".\n\nWe call it 'gender apartheid'.\n\n\"That's the biggest responsibility on us, when we are thinking about a free Afghanistan, to do something and be the voice of the silenced girls and women in Afghanistan and make the noise in a way that we see them and we are caring about their future, and we are caring about the future of our country.\"\n\nThis story was produced in collaboration with SBS Pashto.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/japans-prime-minister-dissolves-parliament-ahead-of-snap-election-morning-news-bulletin-24-january-2026/0y4xagudk",
        "title": "Japan's Prime Minister dissolves parliament ahead of snap election | Morning News Bulletin 24 January 2026",
        "publish_date": "Fri, 23 Jan 2026 19:12:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\nJapan's Prime Minister dissolves parliament ahead of a snap election\n\nMillions brace for severe heat over the long weekend\n\nCanadian teen Victoria Mboko advances to a fourth-round match-up with Aryna Sabalenka in the Australian Open.\n\nJapan's Prime Minister, Sanae Takaichi, has dissolved the lower house of parliament, paving the way for a snap election on February 8.\n\nElected in October as Japan's first female leader, Ms Takaichi has been in office only three months, but she has seen strong approval ratings of about 70 per cent.\n\nBut her decision to dissolve parliament will delay a vote on a budget that aims to boost a struggling economy and address soaring prices.\n\nThe Speaker of the House of Representatives, Fukushiro Nukaga, announced the formalities.\n\n\"I am reading out the prime minister's announcement. Following Article 7 of Japan's Constitution, the House of Representatives is dissolved.\"\n\nThe Danish Prime Minister is visiting Greenland as officials from Denmark, Greenland and the United States met in Washington DC.\n\nUS President Donald Trump told the World Economic Forum in Davos on Wednesday that the US would not use force to acquire Greenland and dropped his threat of tariffs against European countries.\n\nPresident Trump said a framework of a deal for the arctic territory had been established with NATO.\n\nDanish Prime Minister described the situation as 'serious' during her visit.\n\nMillions of Australians are bracing for severe heat over the long weekend, with experts urging people to stay hydrated and be aware of heat-related health impacts.\n\nBureau of Meteorology senior meteorologist Kevin Parkin says a so-called \"heat dome\" could bring record-breaking temperatures and fire danger to parts of the nation.\n\nSouth Australia is first in the firing line as heatwave conditions drift eastwards, bringing 40-degree Celsius days to capitals along Australia's southeast.\n\nTemperatures will start to build across Victoria, inland New South Wales, the ACT and southern Queensland from Saturday and into next week.\n\nDirector of the heat and health research centre at the University of Sydney, Professor Ollie Jay, says heat can contribute to a number of dangerous health outcomes.\n\n\"People get hospitalised for a variety of different reasons. Heat exhaustion, but often cardiovascular complication, people with heart disease and having heat related complications due to that, and also people with kidney disorders, people with respiratory disorders so lung disease also struggle in the heat.\"\n\nHome Affairs Minister Tony Burke and Multicultural Affairs Minister Anne Aly have described the sending of a threatening letter to the Lakemba Mosque in western Sydney as disgraceful.\n\nThe letter, delivered on Thursday, reportedly contained explicit threats of violence targeting multiple communities.\n\nIn a joint statement, Minister Burke - whose electorate of Watson covers the Lakemba Mosque - and Minister Aly - who is Muslim - says the Albanese government takes these threats extremely serious and they \"have no place in Australia\".\n\nThe Lebanese Muslim Association confirmed the mosque had received a letter containing a very serious threat and says in a statement that Muslim communities have \"become accustomed to receiving such disgusting and dangerous threats\".\n\nNew South Wales Police tells SBS News it is aware of the incident and has started an investigation.\n\nThe impact of war in Sudan on children's education has been revealed in data analysed by aid agency Save the Children.\n\nNearly half of Sudan’s 17 million school-aged children [[more than eight million students]] have now spent around 484 days without stepping into a classroom over the last three years.\n\nThe agency's CEO Inger Ashing says the international community is failing the children of Sudan.\n\n\"Children in Sudan are now facing one of the world's worst education crises and in the midst of conflict and hunger and displacement, education is often seen as something that cannot wait. But for children, that is not the case for them, education is a lifeline. It is not something that you can wait for. It's not luxury. It is about their wellbeing, their ability to build a future here and now. And education provides safety, stability and hope for the future. And right now, the international community is failing the children of Sudan.\"\n\nVictoria Mboko did not place any expectations on herself coming into her first Australian Open, but the Canadian teen ticked off another milestone by reaching the fourth round of a Grand Slam for the first time.\n\nThe 19-year-old's reward for a 7-6 5-7 6-3 win over Clara Tauson at Melbourne Park is a first career meeting against world number one Aryna Sabalenka with a place in the quarterfinals on the line.\n\nMboko shot into the spotlight when she became the youngest player since Serena Williams to beat four major winners in a tournament enroute to claiming last year's Canadian Open in Montreal and has continued to impress in Australia.\n\nMboko's win over 14th-seeded Dane, Tauson, marks her best result at a Grand Slam.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/made-right-here-new-20m-campaign-urges-australians-to-buy-local/gb8p2k768",
        "title": "'Made Right Here' : New $20m campaign urges Australians to buy local",
        "publish_date": "Fri, 23 Jan 2026 09:06:15 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/japan-sanae-takaichi-calls-snap-election/u7osllcix",
        "title": "Japanese PM Sanae Takaichi dissolves parliament after three months in office",
        "publish_date": "Fri, 23 Jan 2026 08:40:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "Japan's Prime Minister Sanae Takaichi has dissolved the lower house of parliament, paving the way for a snap election on February 8.\n\nThe move is viewed as an attempt to capitalise on her popularity to help the governing party regain ground after major losses in recent years.\n\nTakaichi's conservative Liberal Democratic Party (LDP) and its coalition had a slim majority in the lower house, and did not form a majority in the upper house. The coalition relies on winning votes from opposition members to pass its agenda.\n\nThe dissolution of the 465-member lower house paves the way for a 12-day campaign that officially starts on Tuesday.\n\nTakaichi, who became Japan’s first female prime minister when she was elected by parliament in October, said the move was for the interest of Japanese people.\n\n\"I believe that the only option is for the people, as sovereign citizens, to decide whether Sanae Takaichi should be prime minister,\" she told a news conference Monday when announcing plans for the election.\n\n\"I'm staking my career as prime minister (on it).\"\n\nOpposition criticises delay of economic policies\n\nDespite only being in office for three months, Takaichi has seen a strong approval rating of about 70 per cent, with particularly high support from young people.\n\nHer government enjoys around 90 per cent support among those under 30, according to a poll published at the end of December by the conservative Sankei Shimbun newspaper and Fuji Television.\n\nAs the snap election approaches, Takaichi told voters to judge her fiscal spending moves, further military build-up and tougher immigration policies to make Japan \"strong and prosperous\".\n\nHowever, opposition leaders have criticised Takaichi for delaying the passage of a budget needed to fund key economic measures.\n\nJapan has faced a surge in living costs and a chronically weak yen that has made imports more expensive.\n\n\"It's not clear if high public support for the Takaichi cabinet will actually lead to support of the LDP,\" Hidehiro Yamamoto, a politics professor at the University of Tsukuba, told the Agence France-Presse news agency.\n\n\"What the public are concerned about is measures to address inflation.\"\n\nPublic discontent over rising prices largely contributed to the downfall of Shigeru Ishiba, whom Takaichi succeeded in October.\n\nAlthough Takaichi has made her party more appealing to young voters, many traditional LDP voters have also shifted to emerging far-right populist opposition parties, such as the anti-globalist Sanseito.\n\nMeanwhile, Japan faces escalating tensions with China, after Takaichi made remarks suggesting that Japan could become involved if China takes military action against Taiwan, a self-governing island that Beijing claims as its own.\n\nFor the latest from SBS News, download our app and subscribe to our newsletter.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/is-the-a-headed-for-70usc/p39j3btfv",
        "title": "Is the A$ headed for 70USc?",
        "publish_date": "Fri, 23 Jan 2026 06:37:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/what-next-if-anything-for-the-coalition/4issvcfu7",
        "title": "What next - if anything - for the Coalition?",
        "publish_date": "Fri, 23 Jan 2026 06:03:24 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\nTRANSCRIPT\n\n“The door between a Coalition, between our two parties, from my point of view, is still open. But I'm not looking at that door. I'm looking at the Australian people, because they're counting on us to deliver for them. They're counting on us to work hard for them, and that's what I will do every single day.”\n\nThat was Opposition Leader Sussan Ley insisting the Coalition remains viable, despite the Nationals officially splitting from the Liberal Party this week.\n\nWith whispers of potential challenges from Andrew Hastie and Angus Taylor, she is dismissing concerns of a leadership spill.\n\n\"I am absolutely confident in the leadership that I have delivered, the leadership I will deliver and the strength of effort that my party and I are making every single day on behalf of the people. The millions of Australians who sent us to Canberra. But what is really going on here is the business of opposition. And it matters. And the government has made mistakes and will continue to make mistakes.”\n\nNow, the National Party Leader David Littleproud is countering Ms Ley's friendly rhetoric, saying the alliance has collapsed after she cancelled joint party meetings and ignored his party's concerns over the new legislation.\n\nHe put the blame solely on Ms Ley's leadership, claiming that his party acted with transparency and integrity while defending their right to vote according to their values.\n\n“When she accepted those resignations, and effectively accepted, therefore accepting the resignations of our entire ministry, that disbanded the coalition, and we could not come back and serve until those three were reinstated, that's that's where we were. The leadership of the Liberal Party is a matter for them, not for me.”\n\nDr Jill Sheppard is senior lecturer in the School of Politics and International Relations at the Australian National University.\n\nShe says following previous splits and re-unifications of the Coalition, there are two things are different about this split.\n\nOne is it's the second serious split, but the third notional split that's come since the election, which was only in May last year.\n\nSecondly, she notes that while Ms Ley’s popularity has failed to rebound since the last two splits, One Nation’s support is surging.\n\n“It's almost impossible for the Liberals to form government by themselves. It's happened a couple of times in history and under really unusual circumstances. On the other hand, I think it's really impossible for the Nats to run alone. They don't have the funding sources of the Liberal Party. They have a viable brand in the bush, but they don't really have a viable brand in the city.”\n\nAs far as Liberal party cohesion goes, deputy leader Ted O'Brien is backing Ms Ley's leadership, but others like Senator Jacinta Price are using the opportunity to re-hash old wounds.\n\nMs Price told Sky News that there has been a terminal breakdown in her relationship with Ms Ley, following the formal collapse of the Coalition.\n\nThis rift dates back to 2025, when Ms. Price was removed from the frontbench after making controversial remarks about Indian migrants.\n\nSenator Price argues the Liberals made a tactical error by backing the government's rushed legislation - leaving the question of leadership in the hands of a fractured party room.\n\n“I think I made it very clear that obviously the leader had lost trust in me, lost faith in me, and I suppose I felt the same at that time. I don't feel like things have improved to that effect....and this is a decision for the party room ultimately.”\n\nSo with all this chaos in the Coalition, what does the future hold for major party politics in a Westminster democracy?\n\nDr Sheppard compares the current instability in the Coalition with the insurgent rise of the UK’s Reform and Green parties, noting a growing worldwide disillusionment with major party politics.\n\n“I think two things are happening at once. One is that voters, on the whole are becoming a little bit more progressive, and so we're seeing a lot of governments become more more progressive try to capture that voter base. On the other hand, there are lots of voters who feel like they're getting left behind by things like globalization, free trade, and the liberalization of, you know, domestic industries. And it's really hard for governments to find a line that can speak to both of those groups of voters. And I think that's why we're seeing rises in support of parties like reform one nation.”\n\nShe says voters appreciate smaller parties that are a bit more nimble, who are able to speak to very contemporary concerns in a relatable way.\n\n“Major parties, by definition, are very big, and they're very hard to change trajectory. If they can see voters going off in another direction, they find it really difficult to chase them. So what we end up with are major parties that sometimes feel like they are out of date, like they are relics from a past era.”\n\nDr Sheppard suggests this fragmentation reflects a broader shift in how voters worldwide are engaging with power.\n\nShe argues that as voters abandon traditional party memberships, they are instead pouring their energy into grassroots activism and union movements, things that are political in nature, but not necessarily party political.\n\nThey want to find the representation the major parties have failed to provide.\n\n“I think that has been a warning bell that the political parties here have ignored, because we have compulsory voting. Even if we're not joining those parties, we're still turning up to vote. And for our major parties, that's been good enough, and I think we're now seeing the consequence of that.”\n\nAs for the prospect of a new alliance between One Nation and the Nationals, Dr Sheppard says that while the political landscape is shifting, One Nation currently lacks the formal party infrastructure required to sustain a governing coalition.\n\n“One Nation still struggles to win seats in the House of Representatives, even with preferential voting. It's a little bit easier here than it is, to say in the UK or the US, but it's still an almighty challenge. Where they do benefit in Australia is by being able to win seats in the Senate, and that means that you have a visible presence. Now, Reform in the UK is a little bit different, because even though they have huge support among voters at the moment, they only have four seats in the House of Commons there.”",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/australian-open-live-updates-osaka-inglis-sinner-djokovic-shelton-and-keys-to-feature-as-the-mercury-soars-20260123-p5nwnf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australian Open live updates: Shock as Sinner drops first set in scorching heat; ‘Rowdy’ superfan booted out by police",
        "publish_date": "Sat, 24 Jan 2026 13:10:23 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly",
            "Roy Ward"
        ],
        "text": "American mates Jessica Pegula and Madison Keys have taken advantage of a 10.30am start to beat the heat and set up a Monday clash in the round of 16.\n\nPegula downed Oksana Selekhmeteva 6-3, 6-2 on Margaret Court Arena and Keys put paid to Karolina Pliskova 6-3, 6-3 on Rod Laver Arena.\n\nMadison Keys is through to the next round. This is a double exposure image. Credit: Eddie Jim\n\nBoth matches were finished by midday with the mercury hovering around a respectable 30 degrees (to be honest, it almost feels cool as we anxiously await the Mars-like heatwave hitting us later today).\n\nBut the earlier start was not all straightforward for 31-year-old Pegula.\n\nShe revealed it meant an earlier bedtime, an earlier wake-up call and some extra coffee to prepare.\n\n“It sounds kind of funny, but 30 minutes, it feels so much earlier,” she said.\n\n“Everyone was kind of slightly panicking because we’re like, ‘Oh my God, we have to be there early’.\n\n“But no, it was nice to be on first today. Obviously, it was not a super long match, but I didn’t have to kind of kill myself in the heat.”\n\nBoth Pegula and Keys admitted they were accustomed to playing in the hotter conditions, being from Florida.\n\n“I was excited for the heat today,” Keys said. “I’m a Floridian, so I was ready for it.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/hundreds-injured-in-melbourne-s-e-scooter-trial-new-data-shows-20260122-p5nw9y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hundreds injured in Melbourne’s e-scooter trial, new data shows",
        "publish_date": "Sat, 24 Jan 2026 13:00:00 +1100",
        "category": "finance",
        "authors": [
            "Patrick Hatch"
        ],
        "text": "Advertisement\n\nExclusive NationalVictoriaPublic transport Hundreds injured in Melbourne’s e-scooter trial, new data shows Patrick Hatch January 24, 2026 — 1:00pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nMore than 500 people reported being injured – including 17 seriously – in crashes while riding or being hit by a hired e-scooter during Melbourne’s controversial two-and-a-half-year experiment with hire scheme operators Lime and Neuron. Data obtained by The Age reveals for the first time the number of injured riders and pedestrians recorded after the e-scooter trial was launched across inner Melbourne in early 2022. A Neuron scooter in South Melbourne on Friday. The scheme is still operating in the Port Phillip council area. Luis Enrique Ascui The City of Melbourne abruptly cancelled its contract with Lime and Neuron in August 2024, with Lord Mayor Nick Reece saying scooters were “creating havoc” on CBD footpaths. Lime and Neuron withdrew from the City of Yarra in March last year after the council increased its daily fee to from $1 to $5 per scooter to cover the cost of managing the scheme, but they continue to operate in the City of Port Phillip.\n\nAdvertisement\n\nThe state government declared the hire-scooter trial a success and legalised both hire schemes and privately owned e-scooters in July 2024. But it refused at the time to release information on the number of crashes and injuries recorded. Data obtained by The Age via a freedom-of-information request shows Lime and Neuron received 558 reports of injuries involving its scooters across the three local council areas between February 2022 and August 2024. Of those injuries, 180 people required medical treatment. Sixteen were admitted to hospital for more than 24 hours, and one scooter rider suffered life-threatening injuries. There were no fatal crashes. Pedestrians and other third-parties hit by hire scooter riders accounted for 37 injuries, including 15 who needed medical treatment and four who were admitted to hospital treatment for more than 24 hours.\n\nAdvertisement\n\nThe data shows Lime and Neuron also received 4837 complaints about poorly parked scooters and recorded 407 “water vehicles” – meaning scooters that were dumped in rivers, lakes or the ocean. Lime and Neuron said the injury data showed their scooters were a relatively safe form of transport, considering customers took 9.4 million trips over that period, with 99.994 per cent of journeys ending safely and 0.073 serious injuries reported per 100,000 kilometres travelled. However, Reece said ending the e-scooter contract was “absolutely the right decision”. “Too many people were being injured, and we acted to put safety first,” he said. “Unsafe riding and abandoned scooters blocking footpaths created real risks for pedestrians.” The data does not capture privately owned e-scooters, which have been involved in fatal crashes in Victoria and have become the focus of public concern along with high-powered e-bikes.\n\nAdvertisement\n\nWill Peters, head of Asia Pacific for Lime, said that unlike privately owned e-scooters, its devices were speed-limited to 20km/h, insured and operated with public oversight. Related Article E-Scooters The e-scooter loophole that left crash victim struggling to get by “We are proud of the e-scooter service we provided in Melbourne, helping tens of thousands of residents and visitors travel more sustainably throughout the city,” he said. A spokesperson for Neuron said Melbourne was one of its busiest cities worldwide for e-scooter trips before the City of Melbourne suspended its partnership. “The vast majority of riders were behaving responsibly,” they said. But for those injured, the harm has been significant and long-lasting.\n\nAdvertisement\n\nAdelaide woman Julia Miller suffered a broken shoulder and elbow when she was hit by a Lime scooter rider near the MCG in April 2022. Almost four years later, the 63-year-old still has limited use of one arm and sometimes uses a walker because of difficult balancing and related neck pain. “It’s been a major impact on my life in terms of everyday function,” she said. Julia Miller, who was hit by a hire scheme scooter near the MCG, pictured in 2022. Ben Searcy Miller said she was glad to see the City of Melbourne eventually ended the scooter schemes, but said councils should have put more resources into ensuring they were used safely. “These are big, heavy machines. If you jump on a bicycle you know how to ride it, but anyone can ride a scooter without knowing how to use it,” she said. Miller is pursuing compensation from Lime for her injuries.\n\nAdvertisement\n\nPedestrians hit by hire scooters early in the trial found they were unable to claim on Lime and Neuron’s insurance policies if the rider was not wearing a helmet or breaking other road rules. Nick Mann, principal at compensation firm Polaris Lawyers, said his firm had received numerous inquiries from people seriously injured by e-scooters. Mann said the insurance policies had improved but still had “critical gaps which are likely to leave people without coverage if they are injured by a rental scooter”. “We continue to recommend that Lime and other private rental companies should be required to pay to register e-scooters with the TAC scheme to provide better protection for injured Victorians,” he said. Port Phillip Mayor Alex Makin said he was comfortable continuing to work with Lime and Neuron, with hire scooters providing a valuable service to cover gaps in the public transport network. Makin said there were 31,000 hire scooter trips and five reported minor incidents in December. “E-scooter usage appears to be unequivocally responsible,” he said.\n\nAdvertisement\n\nMakin said safety and amenity concerns had been addressed by Lime and Neuron implementing footpath-riding detection technology, slow-riding and no-go zones and no-parking zones. “There’s a greater level of comfort with how e-scooters are used in our community,” Makin said. “Hopefully, that serves as a benchmark for if the state government looks at a whole-of-Melbourne approach in terms of what should be implemented.” Loading Victoria Walks chief executive Sarah Pilgrim said the hire scheme should only be expanded if there were effective measures to keep scooters off footpaths, along with enforceable parking rules, better on-road riding infrastructure, national safety standards and no-fault insurance for injured third-parties. “When fast, heavy devices are introduced into [footpaths], even a small number of crashes can have very serious outcomes,” Pilgrim said. “When people don’t feel safe in public space, they walk less, and that has serious consequences for physical health, mental wellbeing and social connection.”\n\nAdvertisement\n\nThe injury data is based only on reports made to Lime and Neuron by riders or third parties, and could include false reports but also may not include injuries that were unreported. Lime and Neuron included the injury data in monthly reports to each council during the trial. Related Article Road safety Pedestrian fatalities reach 17-year-high. This trend could be why The Age lodged a freedom-of-information request to the City of Melbourne seeking those monthly reports in July 2024. The council agreed to provide the documents but Lime and Neuron took action in the Victorian Civil and Administrative Tribunal to prevent their release, arguing they contained sensitive commercial information. During mediation at VCAT, the two companies agreed to release a combined incident dataset. Transport Accident Commission data shows that across the same February 2022 to August 2024 period, there were 13 road deaths in the Melbourne, Yarra and Port Phillip council areas, all of which were pedestrians hit by vehicles.\n\nAdvertisement\n\nLime and Neuron said “water vehicles” were remotely deactivated and thoroughly tested before returning to service. Get news and reviews on technology, gadgets and gaming in our Technology newsletter. Sign up to receive it every Friday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/ryan-wedding-a-former-olympic-snowboarder-on-the-fbis-most-wanted-list-has-been-arrested-20260124-p5nwp4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ryan Wedding, a former Olympic snowboarder on the FBI's 'Most Wanted' list, has been arrested",
        "publish_date": "Sat, 24 Jan 2026 12:59:26 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/keys-pegula-to-film-podcast-before-clash-20260124-p5nwp3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Keys, Pegula to film podcast before clash",
        "publish_date": "Sat, 24 Jan 2026 12:42:15 +1100",
        "category": "finance",
        "authors": [],
        "text": "Keys, Pegula to film podcast before clash\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/not-quite-flawless-but-loveliness-abounds-at-david-byrne-show-20260122-p5nw3y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Am I the only one who thinks Nick Cave would be better indoors?",
        "publish_date": "Sat, 24 Jan 2026 12:40:17 +1100",
        "category": "entertainment",
        "authors": [
            "George Palathingal",
            "John Shand",
            "Bernard Zuel",
            "Harriet Cunningham"
        ],
        "text": "Advertisement\n\nMUSIC\n\nNick Cave And The Bad Seeds\n\nThe Domain, January 23\n\nReviewed by BERNARD ZUEL\n\n★★★½ There were so many moments on this night that were sublime, transcendent or just plain marvellous and there was a section of the show which did almost everything you’d want with almost nothing in the way of tools. Connection and collaboration between on-stage and off-stage was instinctive as well as physical, and at least one song that had borne a heavy emotional load on record now felt as if weight had been lifted from it, for us as much as Nick Cave. Nick Cave and the Bad Seeds performing in London in an earlier show on this tour. Megan Cullen With 150 minutes and 23 songs, a loosened and then discarded tie up front and three of the four backing singers in glittering silver robes up back, and at least one droll self-mocking moment (20 minutes into the show which had begun in twilight, Cave, who cliché would have it does not surface in sun or shorts, offered to chuckles from all of us, “I’m unbelievably pleased it’s starting to get dark”), it might feel churlish to find fault. After all, Bright Horses was a ghostly splendour, like the memory of a feast spread out before us in shadows, and easily the song of the night to that point, only to be matched by Joy, an astonishing song in so many ways, from its tale of a dead son appearing at the foot of the bed declaring we’ve had enough sorrow, now is the time for joy, to the way it didn’t become joy but admitted there was room for it. Then I Need You, performed solo at the piano, followed them, all pain and need and emptiness waiting to be filled with the repetition of “just breathe, just breathe, and Carnage completed this quartet, elevating with sorrow’s weight and a sparseness of sound. But that last point was not a coincidence.\n\nAdvertisement\n\nThis 11-piece version of the Bad Seeds was for a good portion of the show not given the clarity of sound to do them justice. Song Of The Lake was sonically murky and bass player Colin Greenwood lost, Jubilee Street built from nothing to a barrelling locomotive careering down a mountainside but its individual elements disappeared, and even Long Dark Night, whose simplicity of arrangement gave welcome space to piano and Warren Ellis’ violin to lead, showed us the vibraphone being played by Jim Sclavunos but declined to let us hear it. Nick Cave performing in London with the Bad Seeds in an earlier show on this tour. Megan Cullen Missing too was some of the power in Red Right Hand and From Her To Eternity, the latter’s devilish dervish rhythm relentless but thin even as Ellis contorted himself and Cave danced in echo. Was I the only one grumbling that this might have been better indoors?(Incidentally, staging a Nick Cave show outdoors as night falls in a Sydney summer and not playing Release The Bats is a missed comic opportunity. Hands up who wants to die for missing that?) Yet, so much of that could almost be forgotten and forgiven by show’s end as White Elephant closed the set with an almost incongruous violence at its core balanced by gospel redemption, as the joyful energy and crowd involvement in Weeping Song opened out the encore for Cave reclaiming the beauty of Skeleton Tree, and as Into My Arms showed again it as hymnal and tender a farewell as one could ask for. Nick Cave and The Bad Seeds also play The Domain , January 24.\n\nAdvertisement\n\nCABARET\n\nBARBRA\n\nHayes Theatre, January 22, until February 14\n\nReviewed by JOHN SHAND\n\n★★★½ Now here’s a puzzle. The Hayes’ Theatre artistic directors, Richard Carroll and Victoria Falconer, wanted a show celebrating Barbra Streisand, and asked Brittanie Shipway to direct it as well as perform in a cast of four. The creative team Shipway assembled has resulted in a sumptuous stage design from Brendan de la Hay (defined by meticulously swagged fabrics and an avalanche of hydrangeas), superbly lit by Peter Rubie, and with well-chosen songs expertly played by Nicholas Gentile and his band. Brittanie Shipway, Laura Murphy, and Stellar Perry in Barbra at Hayes Theatre. John McRae The glaring question is: Why wasn’t the singing as good as everything else?\n\nAdvertisement\n\nThe show’s subtitled The Greatest Star, which sounds hyperbolic until you try to name another to match Streisand as a titan of recordings, concerts, stage and screen – smashing glass ceilings and sales statistics along the way. In celebrating her, surely nailing the singing should be central, and while no one would expect Shipway, Laura Murphy, Tana Laga’aia or Stellar Perry to match up to one of the last century’s most acclaimed singers, they could have avoided certain pitfalls. Tana Laga’aia and Stellar Perry. John McRae One of the wonders of a singer of Streisand’s stature is an effortlessness that remains in place across her range. She’s a belter who doesn’t shout, and when she goes high, she doesn’t screech: there is no harshness to her top notes. Furthermore, she brings the emotional story of a song to life without resort to overstatement. Shipway, Murphy and Perry, by contrast, used every opportunity they could to be big and brassy. Like too many female singers in Australian musical theatre, the imperfections in their technique were exposed when they were loud and high simultaneously. Their voices’ inherent appeal was the first casualty of this, and careful calibration of the differentiation between the drama of the songs was another. Brittanie Shipway, Laura Murphy, Stellar Perry and Tana Laga’aia. John McRae\n\nAdvertisement\n\nLaga’aia’s instincts were sounder, and he sweetly understated Bewitched (Bothered and Bewildered), but the pitching of his falsetto was not always accurate. He was better on The Way We Were, which felt like the first time that the show’s freneticism truly unwound, and yet we were already halfway through its 75 minutes’ duration. Shipway duetted prettily with Gentile on You Don’t Bring Me Flowers, but, even then, they didn’t quite locate the song’s emotional truth. More convincing were Perry and Laga’aia being soulful on Guilty. Murphy was at her best on the Streisand-composed Evergreen (the love theme from A Star Is Born), ably accompanied by Laga’aia on acoustic guitar. The concluding songs were sung by the full company, the vocal harshness partially disguised when there was such genuine excitement in the air, compounded throughout by band, in which Gentile’s piano was joined by Matt Reid’s keyboards, Michael Napoli’s bass and Sam Evans’ drums. If the singers could trust themselves to back off a little more often, they would instantly sound better, and do infinitely more justice to the Streisand legacy.\n\nBarbra also shows at Riverside Theatres from February 26-28. LACRIMA\n\nRoslyn Packer Theatre, January 22, until January 25\n\nReviewed by HARRIET CUNNINGHAM\n\n★★★★ Caroline Guiela Nguyen’s LACRIMA is a dense, tense and ravishly beautiful play of ideas.\n\nAdvertisement\n\nWe are watching the making of a wedding dress for a royal princess, destined to be an instant museum piece. As the dress takes shape, the action unravels the multifarious threads which make up this icon of maximalism: the veil, from a famous lace-making workshop; the jewel-encrusted train, hand-stitched in Mumbai; the dress, constructed in a Paris fashion house. And the non-material threads: the weight of perfection; the rampant costs of globalisation, and the price of secrecy. Performers in the Sydney Festival show LACRIMA. Wendell Teodoro Will they complete the impossible dress in time? And will they survive the ordeal? LACRIMA speaks to an audience well-versed in modern storytelling. The opening scene, for example, is the essential attention-grabber, an adrenalin shot of anguish, sirens and paramedics. Then, on the screen which hangs centre stage, we see the caption, “three months earlier”. From here, LACRIMA plays out across multiple storylines, acted out on different parts of the cavernous stage, and compiled on the big screen, in a Netflix collage of talking heads and cutaways.\n\nAdvertisement\n\nWe meet the lacemakers as they are interviewed for a podcast, and sit in on the embroiderer’s compulsory eye test. We see the atelier, the bolts of fabric, the dressmaker’s dummies tricked out in haute couture fantasies and hear people converse in multiple languages. It’s simultaneously a documentary and drama, a live performance and a movie, flicking between formats like a restless couch-surfer flicking between channels. From the cacophony, ideas and questions emerge like pearls. The silence of workers bent over tasks is interwoven with the silence of family secrets, domestic violence and 100-year non-disclosure agreements. The demands of royal clients and rabid creatives are matched by the obsessive quest for perfection of the artisans, who will only stop working when they stop breathing. Meanwhile, Nguyen salts the action with loaded questions – why use jewels, when crushed CDs are lighter and brighter? Why impose ethical working practices on a slave economy from which you benefit? Nguyen and her small army of technicians and cast members weave a world of ideas, metaphors and storylines into one intense work of art. The performances, often direct to camera, are utterly compelling, while the staging, which involves the split-second dance of movable partitions to create multiple spaces, is visually spectacular. Add to that the visceral heft of a soundtrack which ramps up the tension with low growls and pulses. It’s all too much: too many jewels, too many hours of work, and too much going on. Even the play’s length – three hours, with a three-minute break where the audience is instructed not to leave the room – is almost too much to endure, drowning us in an embodied state of overwhelm. But that is the point: this work, which is one of the international showpieces of Sydney Festival, is meant to be too much. Too much to take in, but so much to take away. MUSIC\n\nDavid Byrne\n\nTikTok Entertainment Centre (ICC), January 21\n\nReviewed by GEORGE PALATHINGAL\n\n★★★★½\n\nAdvertisement\n\nLoveliness abounds at a David Byrne show. We know this from our extraordinary shared experience in this same room in 2018 but, you know, some stuff has happened since then. We learn on this night, to some extent, how the pandemic affected the former frontman of Talking Heads, the band that all but defined NYC art rock from the late ’70s to the mid-’80s. Byrne clearly tried to process some of those feelings on last year’s Who Is the Sky? album, so here he continues the exercise, with some of those songs joining the tried-and-true favourites from his brilliant career. David Byrne in full flight at the TikTok Entertainment Centre. Pete Dovgan In a nutshell, he’s still seeking connection, and seeing him perform remains among the most life-affirming ways to find it. Thanks to his exquisite use of screens and lights, we spend time on the moon, looking down at Earth (for the maudlin but warm Heaven); in neon-hued streets to a seamy funk soundtrack of Houses in Motion; at the (hardly hellish, unsurprisingly stylish) abode where Byrne was stuck during lockdown (the jaunty folly of My Apartment Is My Friend); and more cleverly realised locales.\n\nAdvertisement\n\nDavid Byrne with a few members of the 12-strong band. Pete Dovgan There’s other visual trickery, and sometimes the gimmicks supersede the songs (and distract you from the lesser ones; hello, Independence Day) – but more often than not the aesthetics emphatically enhance them. Related Article David Byrne Talking Heads legend David Byrne on embracing life’s smaller moments This includes the band, a riveting, dozen-strong collective roaming the stage along with Byrne in perfectly choreographed harmony, variously playing their assigned instruments and/or dancing with infectious joy. We join them on our feet, of course, especially for the Talking Heads classics: the meticulously, blissfully building This Must Be the Place; the ever-dizzying perfection of Once in a Lifetime; the cathartic euphoria of Burning Down the House. At the risk of being That Guy, this tour is not quite as spectacular as the flawless 2018 show – a version of which you can see in Spike Lee’s 2020 concert film American Utopia – though that’s an opinion largely based on my feelings on the likeable but merely fine songs of Who Is the Sky? ousting others I’d rather see and hear. But a David Byrne performance is still quite like nothing else out there, in most of the very best ways. Get fascinating insights and explanations on the world’s most perplexing topics. Sign up for our weekly Explainer newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/hottest-100-follow-the-countdown-20260123-p5nwi6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hottest 100: follow the countdown",
        "publish_date": "Sat, 24 Jan 2026 11:51:29 +1100",
        "category": "finance",
        "authors": [
            "Nell Geraets"
        ],
        "text": "A seriously hot day is about to get even hotter because triple j’s Hottest 100 will shortly kick off.\n\nThe annual countdown, which lists Australians’ favourite songs from the past year, will begin at 12pm (AEDT), and I will be following each and every track along the way, offering some (hopefully) hot takes on the biggest hits of 2025. You can also bop along to the tracks yourself by tuning into triple j on the radio, online or via the triple j app.\n\nPrepare for even more heat today because the Hottest 100 is upon us. ABC/triple j\n\nThis year, Aussies were able to vote for any songs released between December 1, 2024 and November 30, 2025. Though the results are kept firmly under wraps, we know that 26 acts featured in the countdown are making their Hottest 100 debut this year, and some kind of significant record is set to fall… What that record is exactly, only time will tell.\n\nGood Luck, Babe! by Chappell Roan took home the top position last year, but what song will reign supreme this time around? Will it be a classic oldie or a new hit, a local tune or a global heavy-hitter? Grab a cold one and get comfortable because we’re about to find out.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/ufc-star-collapses-after-making-weight-20260124-p5nwon.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "UFC star collapses after making weight",
        "publish_date": "Sat, 24 Jan 2026 09:57:04 +1100",
        "category": "sports",
        "authors": [],
        "text": "UFC star collapses after making weight\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/waratah-faces-suspension-after-fight-club-erupts-at-pre-season-training-20260120-p5nvgc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Waratahs enforcer suspended for pre-season punch-up",
        "publish_date": "Sat, 24 Jan 2026 09:57:03 +1100",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Giant Waratahs lock Miles Amatosero has been slapped with a four-match ban after a flurry of five punches on the training field left new teammate Angus Scott-Young with a fractured eye-socket and in doubt for the opening round of Super Rugby next month.\n\nRugby Australia and the Waratahs announced the sanction on Saturday morning after an investigation into a skirmish between Amatosero and Scott-Young during a Waratahs’ pre-season training session two weeks ago.\n\nMiles Amatosero, pictured after a Waratahs’ loss in 2025. Credit: Getty Images\n\nScott-Young arrived at the Waratahs in December, after the former Queensland backrower – and son of former Wallaby Sam Scott-Young – had been recruited back to Australia from English Premiership club Northampton.\n\nWitnesses said Amatosero had tangled with Scott-Young at a training session in early January, which resulted in the 23-year-old throwing five punches at his teammate, in two separate moments.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/why-papenhuyzen-s-retirement-was-no-shock-to-storm-star-20260122-p5nw1s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why Papenhuyzen’s retirement was no shock to Storm star",
        "publish_date": "Sat, 24 Jan 2026 09:30:00 +1100",
        "category": "sports",
        "authors": [
            "Robert Dillon"
        ],
        "text": "After suffering a broken hand, broken arm and dislocated shoulder last season, Jahrome Hughes knows what is required, physically and mentally, for an NRL player to keep braving the pain.\n\nSo when his long-time Melbourne Storm teammate Ryan Papenhuyzen revealed in a podcast this week that “I think I’m retired” - as opposed to merely taking a year off - Hughes understood better than most how and why he reached that decision.\n\nStorm halfback Jahrome Hughes and his former teammate Ryan Papenhuyzen. Credit: Getty\n\n“I’ve been pretty close with ‘Paps’ and I’ve seen what he’s been through,” Hughes said.\n\n“All the injuries, and then the mental stuff he had to go through, I know it can take a toll on people.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/fashion/who-is-this-dress-for-the-problem-with-menswear-on-the-runway-20260122-p5nw2b.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Who is this dress for? The problem with menswear on the runway",
        "publish_date": "Sat, 24 Jan 2026 09:30:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Damien Woolnough"
        ],
        "text": "Advertisement\n\nLifestyleFashionMenswear Opinion Who is this dress for? The problem with menswear on the runway Damien Woolnough Fashion editor January 24, 2026 — 9:30am\n\nJanuary 24, 2026 — 9:30am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nA sequinned purple and silver top with a low-cut neckline can be expected at a Dior runway show, along with puffy floral capes, and knitted dresses. The clothing confusion begins when you realise that its men’s fashion week in Paris. Models, built like gently muscled pipe cleaners, should give the game away, but looking at the clothes, it’s unclear whether the menswear shows are for female or male customers. Dior menswear, designed by Jonathan Anderson at Paris Fashion Week. Getty Images A model on the Dior menswear runway in Paris. Getty Images\n\nAdvertisement\n\nCelebrities such as Jacob Elordi, Josh O’Connor and A$AP Rocky manage to eloquently and elegantly speak to menswear trends on the red carpet, but something is getting lost in translation on the runway. Who is buying the fluffy pink scarf on the Feng Chang runway, the wrap skirts at Dior and the white square neck cotton tops worn with chunky red earrings at Prada? These beautiful pieces look ready to be championed by women and fashion-forward members of the LGBTQ community such as Troye Sivan, Billy Porter and Colman Domingo, but the broader male consumer is being left behind. Delicate cottons and bold earrings on the Prada runway in Milan. Gamma-Rapho via Getty Images The number of female models on the runway in Giorgio Armani suits, Dsquared2 distressed denim and Auralee plaid shirts at adds to the co-ed confusion. This is not the time to give up on the majority of male shoppers. A study by Italian fashion industry group Altagamma shows that the number of luxury consumers shrunk to about 340 million people in 2025 from 400 million people in 2022.\n\nAdvertisement\n\nIf anyone can bring millions of men back its fashion hot property Jonathan Anderson, who reinvented Spanish brand Loewe. It’s early days for Anderson at Dior but at his second menswear runway show this week, Monsieur Dior looks an awful lot like mademoiselle. Editor's pick Fashion designers From Jackie O to Julia Roberts: Five Valentino dresses for the history books Male models wearing Bar jackets, a womenswear staple introduced by Christian Dior in 1947, and full skirts, appear dressed for female customers. Louche wide lapel grey flannel suits, hybrid sailor and cargo jeans and whimsical polo shirts, with or without epaulettes, offered some relief and shouldn’t confuse store staff wondering where to hang them when they arrive in boutiques this year. Prada’s trench coats, with contrasting cropped ponchos, forest green coats and narrow double-breasted suits were also clearly for the boys.\n\nAdvertisement\n\nUnfortunately, compared to the excitement and execution of more female-friendly pieces, the masculine clothing came up short. At Dolce & Gabbana, Louis Vuitton and Zegna, silhouettes, suiting and separates suffered from a case of aesthetic arrested development. If we can’t find a happy medium, where menswear shows generate excitement, without relying on female, non-binary and LGBTQ customers, why have them? Maya Hawke at the Prada menswear show. Getty Images for Prada This might be why Alexander McQueen’s creative director, Sarah Burton, has removed menswear from all runway shows, Gucci’s shows now combine menswear and womenswear, and luxury labels continue to drop from the men’s fashion week calendar. It’s becoming increasingly clear why London Menswear Fashion Week was cancelled last year.\n\nAdvertisement\n\nClothes don’t have a gender, but it would be great for a man to have more exciting options, other than a sequin top and full skirt, to wear to the office on Monday. Make the most of your health, relationships, fitness and nutrition with our Live Well newsletter. Get it in your inbox every Monday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/consumer-affairs/getting-married-there-s-a-new-chart-to-check-before-buying-a-ring-20260123-p5nwfv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Getting married? There’s a new chart to check before buying a ring",
        "publish_date": "Sat, 24 Jan 2026 09:00:00 +1100",
        "category": "finance",
        "authors": [
            "Nick Toscano"
        ],
        "text": "Advertisement\n\nBusinessConsumer affairsGold Getting married? There’s a new chart to check before buying a ring Nick Toscano January 24, 2026 — 9:00am Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share A A A\n\nAustralian jewellers are having to get used to a new daily routine: checking the wild gains in the price of gold. “I have to now,” said Timothy Sung, director of Melbourne’s Janai Jewellery. If bombs have dropped somewhere, or US President Donald Trump has unleashed new chaos with threats of tariffs, the past year has shown that a jump in the price of gold will invariably follow. This could add hundreds or even thousands of dollars to the cost of an item of jewellery, pressuring retailers’ profit margins. More so than ever before, anxious investors and central banks have been piling into gold, the yellow metal that has been prized by civilisations for thousands of years for its lustre but which is now more often favoured as a safe haven for storing wealth during uncertain times. In an era defined by geopolitical tensions, inflation fears, erratic policymaking and an erosion of trust in the US dollar, gold’s value ballooned 64 per cent last year, its biggest annual gain since 1979. Janai Jewellery director Timothy Sung. Paul Jeffers Predicting the next price shock had proven a “bit of a challenge” lately, said Sung, as he looped around the showroom of his store on Collins Street in Melbourne’s CBD. The latest jolt arrived earlier this week with fears Trump’s plan to take over Greenland could set off fresh diplomatic and trade crises, which spooked financial markets and boosted gold’s appeal. On Wednesday, it hit an all-time high above $US4800 ($7000) an ounce.\n\nAdvertisement\n\n“As soon as I hear news, I have to be brave enough to buy gold,” said Sung, who sources gold from Australian producers, processes it at his factory in Vietnam and fabricates it into jewellery in Melbourne. He estimated that he spent tens of thousands of dollars each month last year to lock in supplies of the metal before prices marched even higher Demand for jewellery had remained resilient, Sung said, especially for engagement rings. “Everyone still needs one – no ring, no wedding,” he said. Janai sells about 300 rings a month, forcing Sung to try to keep one step ahead of any major fluctuations. But as rising costs have crunched retail margins and forced jewellers to reset prices, consumer preferences have also begun shifting in favour of pieces containing less gold. Jewellers report that more people are asking for nine carat or 14 carat, instead of 18 carat gold, or a different metal altogether, like platinum, which used to sell at a discount. Male wedding bands with widths of 5 millimetres or 4.5 millimetres, rather than 6 millimetres, have also gained popularity. So steep were last year’s gold price rises that some heavier pieces of jewellery ended up being hundreds of dollars more expensive between the time of quoting and delivery, said Talitha Cummins, founder and director of The Cut Jewellery, which has two stores in Sydney and is launching its first in Melbourne next month. “You have to keep a really close eye on the numbers and think ahead a little bit when you are quoting to try to anticipate where prices are going,” Cummins said.\n\nAdvertisement\n\nTalitha Cummins is founder and design director of The Cut Jewellery. “There is a perception that jewellers are making a lot of money out of these price rises, but that’s not the case unless you’ve got stock on hand that you’ve held for a long time.” Naturally, higher prices had deterred people from buying as much gold as before, she said. Last Christmas, for example, fewer customers purchased gold chains with pendants than a year earlier. “Some people might opt just for a pendant to wear on their own chain now,” she said. “People are becoming crafty and thinking a little differently.” What the coming 12 months might hold for the gold price remains to be seen, but some money managers are already betting that private-sector investors won’t be selling their gold stocks anytime soon. They cite worries such as high debt levels in the US and Japan, tensions over Greenland and Trump’s escalating efforts to exert control over the US central bank.\n\nAdvertisement\n\n“Nothing has changed. If anything, Trump has gone crazier than ever,” said AMP chief economist Shane Oliver. “This chips away at faith in the US, and the worries about the Federal Reserve are only ramping up. I think it will go on for a while yet.” Further price rises would not be linear, Oliver said. “We will get pullbacks, as gold gets to the point that it is technically over-bought, and traders unwind their positions, but the trend will remain up,” he said. “That’s the nature of a bull market, and gold is in a clear bull market.” Cummins was bracing for challenging times to continue. “I don’t see world peace or a global stabilisation happening anytime soon,” she said. “It’s not looking promising, but we will have to go with what is thrown at us.” The Business Briefing newsletter delivers major stories, exclusive coverage and expert opinion. Sign up to get it every weekday morning.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/hobart-teammates-clash-in-bbl-playoff-20260124-p5nwod.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hobart teammates clash in BBL playoff",
        "publish_date": "Sat, 24 Jan 2026 08:57:56 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-day-heat-puts-emergency-crews-on-edge-20260124-p5nwo9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia Day heat puts emergency crews on edge",
        "publish_date": "Sat, 24 Jan 2026 07:30:21 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/uk-pm-prince-harry-slam-trumps-afghanistan-comments-20260124-p5nwo8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "UK PM, Prince Harry slam Trump's Afghanistan comments",
        "publish_date": "Sat, 24 Jan 2026 07:28:59 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/autopsy-points-teen-surrounded-dingoes-163000815.html",
        "title": "Family launches GoFundMe to bring teen's body home",
        "publish_date": "2026-01-24T00:12:52Z",
        "category": "finance",
        "authors": [],
        "text": "A grieving Canadian family is preparing to travel to Australia to bring their daughter home after her death at an iconic tourist destination.\n\nBackpacker Piper James, 19, was working on Queensland's K'gari, formerly known as Fraser Island, when she went for an early morning swim on Monday.\n\nHer body was discovered surrounded by dingoes near a popular tourist site, the wreck of the SS Maheno, a short time later.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nPreliminary autopsy results found physical evidence consistent with drowning.\n\nHowever, it also found evidence of \"pre-mortem\" dingo bites, raising the possibility that Ms James attempted to escape the pack by fleeing into the surf.\n\nThere were extensive post-mortem bite marks.\n\nThe coroner is now awaiting pathology results to further assist in determining the cause of death, a process expected to take several weeks.\n\nRangers have increased dingo patrols across the island following the tragedy. (James Shrimpton/AAP PHOTOS)\n\nMs James' father Todd told the Canadian Press that he hoped his daughter had succumbed to the surf, considering the alternative.\n\n\"We know her body was messed with (by) dingoes. It's one or the other,\" he told the Press on Friday, citing the possibility of drowning.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"We've just got to wait, and it could be one to two months.\"\n\nOn Thursday, the family shared a GoFundMe page to raise money to bring their daughter home. It had raised almost $6000 by Saturday morning.\n\nMr James and his wife Angela, Piper's mother, have also been invited to a smoking ceremony by the Butchulla people, K'gari's traditional custodians, which he said they hoped to attend.\n\nGlobal Affairs Canada has said officials were providing consular assistance to the family.\n\nAn autopsy found evidence consistent with drowning and injuries consistent with dingo bites. (HANDOUT/Todd James)\n\nIn an earlier social media tribute, Mr James said the family would always remember his daughter's infectious laugh and kind spirit, and her determination to go after her dreams.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMs James had been living and working at a backpackers on K'gari with a friend from Canada for about six weeks.\n\nWeeks before the tragedy, there were reports of wild dogs ripping tents and stealing food. (HANDOUT/Todd James)\n\nRangers increased patrols across the island following the tragedy, which came just weeks after a warning about aggressive dingo behaviour near where Ms James was found.\n\nRangers warned of \"heightened dingo activity\" in the area where Ms James died only weeks before the tragedy, after reports of wild dogs ripping tents, approaching campers and stealing food and property.\n\nThe warning remains in place on K'gari for the summer holiday period until January 31.\n\nQueensland Premier David Crisafulli has ruled out restrictions on visitor numbers to K'gari, the world's largest sand island.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe Butchulla Aboriginal Corporation and environmental groups have been calling for a cap on tourists, due to mounting safety concerns and damage to the World Heritage site's fragile environment.\n\nDingoes are culturally significant to the Butchulla people, who know them by the traditional name wongari.",
        "source": "Yahoo"
    }
]