[
  {
    "url": "https://www.9news.com.au/national/jacinta-allan-husband-drink-driving-victorian-premier-license-disqualified-crime-news/ed70752d-5faf-44b1-a363-f19a96c1b6e9",
    "title": "Victorian Premier reveals husband charged with drink driving after fender bender",
    "publish_date": "Fri, 19 Dec 2025 00:00:44 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "V﻿ictorian Premier Jacinta Allan has revealed her husband Yorick Piper was caught drink-driving on his way to a supermarket in Bendigo yesterday morning.\n\nPiper blew a blood alcohol concentration of 0.05 per cent in a random breath test and was issued an on-the-spot fine and had his licence disqualified for three months from January 16.﻿\n\nAllan said her husband had been celebrating their son's birthday with family at a local pub the evening prior, before heading home around 8pm.\n\nLIVE UPDATES: Incredible scenes as hundreds paddle out at Bondi Beach\n\nJacinta Allan speaks to media this morning. (Nine)\n\n\"I was shocked,\" Allan said.\n\n\"I was shocked yesterday ﻿when Yorick told me yesterday morning what had happened.\"\n\nShe said the alcohol had mixed with medication Piper takes for a health issue.\n\n﻿\"As a result of the medication mixing with the alcohol from the night before, he simply shouldn't have been driving the following morning,\" Allan said.\n\n\"He understands that, I understand that and for this we are both truly sorry.\n\nShe said Piper was also involved in a minor collision prior to being stopped at the RBT, rear-ending another vehicle at the T-intersection of Spring Gully Road and Carpenter Street.﻿\n\nShe said neither driver was injured and the pair exchanged details.﻿\n\n﻿The couple have made a $1000 donation to Amber Community, a non-profit that provides support and information around road trauma.\n\n\"Drink driving is an incredibly serious issue and so is road trauma﻿, we recognise that and I am truly sorry,\" Allan said.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/donald-trump-latest-news-renames-kennedy-centre-family-angry-washington-dc-usa-live-updates/a3f54777-01ec-4c8e-a698-36fd673a216b",
    "title": "Iconic DC venue renamed in honour of Donald Trump by board he apponted",
    "publish_date": "Fri, 19 Dec 2025 00:24:45 +0000",
    "category": "entertainment",
    "authors": [
      "Dec"
    ],
    "text": "The board of trustees of the John F. Kennedy Centre for the Performing Arts voted to rename the facility after both the former president and President Donald Trump .\n\n\"The Kennedy Centre Board of Trustees voted unanimously today to name the institution The Donald J. Trump and The John F. Kennedy Memorial Centre for the Performing Arts,\" spokeswoman Roma Daravi said in a statement, adding that the name honours Trump's work at the centre since taking over early in his second term.\n\nThe move quickly raised legal concerns as to whether the board has the authority to rename the arts institution, which Congress designated in 1964 as a memorial to the Democratic president, and met backlash from the Kennedy family.\n\nDonald Trump is the new namesake of the Kennedy Centre. (AP)\n\nTrump, who was elected chair by a newly constituted board in February, has frequently joked about calling the performing arts centre the \"Trump Kennedy Centre.\" The president's handpicked board approved his wishes at Thursday's board meeting, according to a source familiar with the matter, during which Trump also called in.\n\nAt an Oval Office event later in the day, Trump said he was \"honoured\" and \"surprised\" by the vote.\n\n\"This was brought up by one of the very distinguished board members, and they voted on it, and there's a lot of board members, and they voted unanimously,\" he said.\n\nBy Thursday afternoon, the centre's website header was updated to read \"The Trump Kennedy Centre.\"\n\n\"Congratulations to President Donald J. Trump, and likewise, congratulations to President Kennedy, because this will be a truly great team long into the future,\" White House press secretary Karoline Leavitt said in a post on X. \"The building will no doubt attain new levels of success and grandeur.\"\n\nWhile the White House said the vote was unanimous, Democratic Rep. Joyce Beatty, an ex-officio member of the board, said that was not the case.\n\n\"I was on that call and as I tried to push my button to voice my concern, to ask questions, and certainly not to vote in support of this, I was muted. Each time I tried to speak, I was muted,\" she said in a video posted to X.\n\nLegality concerns and Kennedy family pushback\n\nQuestions remain, however, about the legality of the board's move to rename the building, and members of the Kennedy family condemned the effort on Thursday.\n\n\"The Kennedy Centre is a living memorial to a fallen president and named for President Kennedy by federal law,\" Joe Kennedy III, a former congressman and the great-nephew of the late president, said on X. \"It can no sooner be renamed than can someone rename the Lincoln Memorial, no matter what anyone says.\"\n\nJack Schlossberg, a Kennedy grandson currently running for the US House in New York, also expressed concerns on social media with reports of muting during the vote.\n\nJack Schlossberg is the grandson of John F Kennedy. (AP)\n\nCongress renamed the arts centre after former President John F. Kennedy in legislation passed after his 1963 assassination, and federal law requires that the board \"assure that after December two, 1983, no additional memorials or plaques in the nature of memorials shall be designated or installed in the public areas of the John F. Kennedy Centre for the Performing Arts.\"\n\nExperts told CNN that while the board's decision Thursday was likely unlawful, it's unclear whether someone looking to challenge the move would have the legal right – known as \"standing\" – to even pursue such a case.\n\n\"There is absolutely no way they can do this legally,\" said David Super, a professor at Georgetown Law who specialises in legislation. But, he added, \"the administration is not concerning itself with laws unless it has a realistic prospect of getting sued.\"\n\nSuper said it's possible that an employee of the centre could try to bring a case challenging the renaming by pointing to a \"reputational harm\" that stems from having to put the new name on their resume, which they may claim has the potential to confuse prospective employers.\n\n\"I would not be optimistic that a court would accept that case,\" he said.\n\nThe same goes for descendants of the late 35th president, Super told CNN. \"If he were living, then he probably could sue, but I don't think it's clear that his heirs would have any right to sue on his behalf,\" he said.\n\nREAD MORE: Trump hurls outrageous slur at female reporter\n\nMaria Shriver, the former first lady of California. (Getty)\n\nMaria Shriver , Kennedy's niece, called the effort to rename the memorial after Trump \"beyond comprehension\" as she spoke of her uncle's efforts to support the arts.\n\n\"He was a man who was interested in the arts, interested in culture, interested in education, language, history. He brought the arts into the White House, and he and my Aunt Jackie amplified the arts, celebrated the arts, stood up for the arts and artists,\" she said in a post on X. \"It is beyond comprehension that this sitting president has sought to rename this great memorial dedicated to President Kennedy.\"\n\nInside Trump's transformation of the arts centre\n\nThursday's vote marks the latest effort to leave Trump's mark on the Kennedy Centre.\n\nDays after returning to office, Trump announced an aggressive plan to gut the existing board of trustees and oust its chairman, the billionaire philanthropist David Rubenstein. Since then, he's led an effort to reshape the institution to his taste: reshaping its leadership, securing multimillion-dollar congressional funding for renovations, and reimagining its programming.\n\nHe installed a who's who of loyalists — including new president Richard Grenell, his ambassador to Germany during his first term, who's been re-evaluating programming and targeting it \"for the masses.\" Grenell has cut the existing staff, hired political allies and mandated a \"break-even policy\" for every performance and facility rental.\n\nTrump has also touted restoration of the building's exterior marble, the interior chairs and \"fully\" renovated stages, which he says will be complete within a year.\n\nPresident Donald Trump tours the John F. Kennedy Center for the Performing Arts in Washington, DC. (AP)\n\nThe changes extend to what's onstage too, as the president has sought to enact a \"Vision for a Golden Age in Arts and Culture,\" saying the \"Trump Kennedy Centre\" is \"not going to be woke.\"\n\nTrump's impact on the institution was evident earlier this month at the 2025 Kennedy Centre Honours. The president has said he was \"98 per cent\" involved\" in picking the awardees, who ranged from Sylvester Stallone to the rock band KISS and Gloria Gaynor, among others.\n\nTrump on Thursday said that under his administration the centre has seen \"record-setting numbers\" in donors and previewed plans to get Congress to invest more money in the centre.\n\n\"We're saving the building. We saved the building. The building was in such bad shape, both physically, financially and every other way. And now it's very solid, very strong,\" he said.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/multiple-deaths-reported-in-fiery-business-jet-crash-at-regional-airport-in-north-carolina/8183001a-47be-429d-a610-2b3c83e2e613",
    "title": "NASCAR driver, family killed in US plane crash",
    "publish_date": "Thu, 18 Dec 2025 23:37:21 +0000",
    "category": "sports",
    "authors": [
      "Dec"
    ],
    "text": "Retired NASCAR driver Greg Biffle and family members are among the seven people killed in a plane crash in North Carolina, police said.\n\nA business jet crashed Thursday at a regional airport in North Carolina used by NASCAR teams and Fortune 500 companies, erupting in a large fire and killing multiple people, authorities said.\n\nFlight records show the plane was registered to a company run by Biffle.\n\nFlight records show the plane was registered to a company run by retired NASCAR driver Greg Biffle. (Supplied)\n\nA business jet crashed Thursday at a regional airport in North Carolina used by NASCAR teams and Fortune 500 companies. (Provided)\n\n\"Although the post-crash fire prevents us from releasing a definitive list of the occupants at this time, it is believed that Mr. Gregory Biffle and members of his immediate family were occupants of the airplane,\" state police said.\n\nHe was on the plane with his wife, Cristina, and children Ryder and Emma. Others on the plane were identified as Dennis Dutton, his son Jack, and Craig Wadsworth.\n\nBiffle, 55, won more than 50 races across NASCAR's three circuits, including 19 at the Cup Series level. He also won the Truck Series championship in 2000 and the Xfinity Series title in 2002.\n\nNASCAR said it was devastated by the news.\n\n\"Greg was more than a champion driver; he was a beloved member of the NASCAR community, a fierce competitor, and a friend to so many,\" NASCAR said.\n\n\"His passion for racing, his integrity, and his commitment to fans and fellow competitors alike made a lasting impact on the sport.\"\n\nIn 2024, Biffle was honoured for his humanitarian efforts after Hurricane Helene struck the US, even using his personal helicopter to deliver aid to flooded, remote western North Carolina.\n\nThe Cessna C550 crashed while landing at Statesville Regional Airport, about 72 kilometres north of Charlotte, the Federal Aviation Administration said.\n\nGolfers playing next to the airport were shocked as they witnessed the disaster, even dropping to the ground at the Lakewood Golf Club while the plane was overhead. The ninth hole was covered with debris.\n\n“We were like, ‘Oh my gosh! That’s way too low,’” said Joshua Green of Mooresville. “It was scary.”\n\nThe National Transportation Safety Board and the FAA were investigating. AccuWeather says there was some drizzle and clouds at the time of the crash.\n\nThis screengrab made from video provided by WSOC shows firefighting crews responding to a reported plane crash at a regional airport in Statesville, N.C. (AP)\n\nThe plane took off from the airport shortly after 10 a.m. but then returned and was attempting to land there, according to tracking data posted by FlightAware.com.\n\nThe plane had planned to fly later from Sarasota, Florida, to Treasure Cay International Airport in the Bahamas before returning to Fort Lauderdale, Florida, and then to Statesville by evening, data showed.\n\nVideo from WSOC-TV showed first responders rushing onto the runway as flames burned near scattered wreckage from the plane.\n\nThe airport’s website states that it offers corporate aviation facilities for Fortune 500 companies and several NASCAR teams.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/general-pants-missing-orders-customer-service-christmas-cut-off/ff4de524-596b-4075-b2f3-7147dfefcd19",
    "title": "Sophie ordered a Christmas gift weeks ago and it still hasn't been shipped. She's not alone",
    "publish_date": "Fri, 19 Dec 2025 00:21:48 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Exclusive: ﻿Sophie ordered her boyfriend's Christmas present from General Pants Co. on December 1, but almost three weeks later, it still hadn't arrived.﻿\n\nIt hadn't even been sent off for shipping yet.\n\nSophie told 9news.com.au every attempt to contact the major Australian fashion retailer has gone unanswered, which is almost as frustrating as her missing order.\n\nLIVE UPDATES: Incredible scenes as hundreds paddle out at Bondi Beach\n\nShoppers like Sophie are fuming after major Aussie retailer 'ignored' emails about missing orders. (Supplied)\n\nAnd she's not the only one.\n\nMultiple customers told 9news.com.au that orders they placed ﻿with General Pants Co. online in the first week of December have not been shipped by December 18.\n\nThey claimed emails to the brand's customer service ﻿address receive nothing more than auto-generated replies promising to get back to them soon.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nBendigo local Sophie, who asked not to have her surname published, said she could not get a response from General Pants Co. about her missing order on social media.\n\nShe left a frustrated comment under one of the retailer's Instagram ﻿posts on Wednesday asking for answers.\n\nOne post was still up on the General Pants Co. Instagram account with frustrated comments under it on Thursday morning. (Instagram/@general_pants)\n\nHours later, the post and comments had vanished from the General Pants Co. ﻿profile.\n\nShe placed her order at the start of the month and got a confirmation email, but no message saying it had been shipped.\n\nAfter waiting several days for ﻿an update, she tried contacting General Pants Co. ﻿customer service.\n\nEmails and social media messages went unanswered, she claimed.﻿\n\n\"I feel super frustrated,\" she said.\n\n\"They are obviously aware of an issue and they are avoiding taking any accountability.\"\n\nSophie placed her order on December 1 and received a confirmation email. She reached out on December 12 when it hadn't been shipped but only got a generic reply. (Supplied)\n\nAdelaide local Christina, who also asked not to have her surname published, placed an order on December 7 that also hasn't shown up.\n\nLike Sophie, she received no updates after the initial order confirmation email.\n\nShe tried to reach General Pants Co. ﻿customer service five times via email, live chat and social media but was unsuccessful.\n\nShe said it wasn't until she left an angry comment on the brand's Instagram page that she finally got a response.\n\nAn Instagram direct message from the ﻿retailer's account, ﻿which has been sighted by 9news.com.au, said her order hadn't been shipped.\n\n\"The item is being fulfilled from one of our stores, which has caused the delay,\" it read.﻿\n\n\"We apologise that this hasn't met expectations.\"\n\nREAD MORE: Heavily armed police make several arrests on Sydney street\n\n﻿Christina was told she could have the order cancelled and refunded, or escalated again.\n\nShe was disappointed but unsurprised.\n\n\"Considered they've been dodging providing an update for so long, I knew something must be going on﻿,\" she told 9news.com.au.\n\n\"I'm just struggling to understand how a company this big can promote and list shipping times on their site and not adhere to them, especially during Black Friday and Christmas period when they know it's going to be busy.\"\n\nSophie believes the brand should have proactively notified impacted customers of any delays.\n\nA ﻿General Pants Co. ﻿spokesperson told 9news.com.au that a small number of deliveries may take longer at this busy time of year, after Black Friday and Cyber Monday.\n\n\"While we are proud that delays are extremely minimal, we fully understand how important timely deliveries are to our customers,\" they said.\n\n\"Whilst our expected delivery times are clearly outlined in the shipping terms on our website, our dedicated customer care team is always on hand to provide support.\n\n\"We continually review and improve our operations to ensure the best possible service.\"\n\nREAD MORE: Teen girl takes bullet while shielding two toddlers in Bondi attack\n\nAccording to the General Pants Co. website, Christmas cut-off dates range from as early as December 12 to as late as December 22 depending on the location.\n\nThe 'delivery' page on the retailer's site also bears a warning that delivery times may be slightly delayed due to a high volume of orders.\n\nIt asks customers to allow five to seven business days for orders to be ﻿dispatched, after which standard delivery timeframes apply.\n\nSophie and Christina both placed their orders well before even the earliest holiday cut-off date and even with a seven day dispatch delay ﻿and the longest standard delivery time, Sophie should have received her order on Wednesday.\n\nInstead, she received an alert from Afterpay today saying the order had been cancelled.\n\nShe said she didn't receive any communication from General Pants Co. about it.\n\n﻿Now she's scrambling to find a replacement Christmas gift.﻿\n\n\"It's really poor that they aren't being transparent and haven't contacted customers directly or at least posted on their socials that they are experiencing delays,\" Sophie said.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/atar-results-how-to-check-score-release-dates-login-guides-state-by-state-explained/92af77b7-bc57-4a27-9232-d5d746f97644",
    "title": "Anxious ATAR wait over for several states as scores released",
    "publish_date": "Thu, 18 Dec 2025 02:27:28 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Most of the country's 2025 Year 12 students have finally received their ATAR results, with just one state left still waiting on tenterhooks.\n\nThe Australian Tertiary Admission Rank (ATAR) ranks students from a scale of zero to 99.95 and is used to help year 12 students enrol in their preferred university course.\n\nI﻿t is calculated by combining the best scaled subjects (two units of English and eight other units) to create an aggregate, which then ranks a student against their year group.\n\nREAD MORE: ﻿ Aussie university to offer qualifications for dropouts\n\nThe moment group of nine Melbourne High boys open their ATAR results together in 2024. (Joe Armao)\n\nATAR results come out on different days across the country and can be accessed on the tertiary admissions centre used by the state or territory.\n\nHere is a complete breakdown on how and when to find your ATAR score. Note that all times are local.\n\nNSW and the ACT\n\nResults were released at 9am today and can be found on the Universities Admissions Centre (UAC) website. ﻿\n\nStudents received an email ﻿with a quick link to the ATAR login, which required either their UAC PIN or Year 12 student number.\n\nNorth Sydney Boys High School students after finishing their HSC exams. (Dion Georgopoulos)\n\nVictoria\n\nVCE and ATAR results came out earlier this month via the Victorian Tertiary Admissions Centre (VTAC).\n\nQueensland\n\nStudents were able to access their results at 12pm today via the ATAR Portal.\n\nThey need their ﻿full name, date of birth, LUI number, and personal email ready to set up their ATAR account to log into the portal.\n\nSouth Australia and the Northern Territory\n\nATAR res﻿ults were released at 8.30am on December 15.\n\nStudents can view their rank on the South Australian Certificate of Education (SACE) online portal using their registration number and four-digit PIN.\n\nSouth Australia calculates the ATAR for students in the Northern Territory. ﻿\n\nATAR results can help students enrol into their dream university course. (Getty Images/iStockphoto)\n\n﻿Western Australia\n\nStudents can see their ATAR results on December 21.\n\nThe Education Department does not specify what time, so it is best to keep checking throughout the day.\n\n﻿They can find it via the School Curriculum and Standards Authority (SCSA) student portal using their student number and password.\n\nTasmania ﻿\n\nResults came out yesterday and were progressively emailed to all students. ﻿\n\nThey can also access their ATAR on the ﻿Tasmanian Assessment, Standards and Certification (TASC) website.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/australia-monsoon-before-christmas/aee18fb5-8696-4151-8f53-dabb12ab3b0d",
    "title": "Early season monsoon burst to drench Australia's Top end before Christmas",
    "publish_date": "Wed, 17 Dec 2025 22:51:42 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Australia's staring down the barrel of an earlier-than-expected monsoon season and it may arrive before\n\nChristmas\n\n, though not all states and territories will be affected.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/oporto-ceo-therese-frangie-secrets-to-success/5562562c-8a5d-43de-9b15-48199c8633bb",
    "title": "Three words this CEO swears will help you land a better job",
    "publish_date": "Wed, 17 Dec 2025 18:40:03 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Exclusive: In this nine.com.au series, we'll be talking to some of Australia's smartest and sharpest ﻿entrepreneurs, founders and CEOs to find out what makes them tick - and what advice they'd have for anyone starting out.\n\nTherese Frangie graduated high school with no university offers; now she's the chief executive of restaurant giant Oporto.\n\nThough she didn't do well in her HSC, Frangie went on to complete a master of business administration while also working as Mad Mex's chief operating officer.\n\nNow she's in charge of running a business that rakes in tens of millions in profits each year and swears by the words 'be, do, have'.\n\nThese are her secrets to success.\n\nTherese Frangie graduated high school with no university offers; now she's chief executive of Oporto. (Supplied)\n\nHow do you start the day to set yourself up for success?\n\nWith a morning routine. I am a big believer in managing your cognitive load and eliminating decision fatigue.\n\nI have a morning routine that is posted on my wardrobe that I've been following for years now. I no longer look at it, I just go into auto-pilot. I kick off the day at 5am, as this gives me 'me time' and allows plenty of time to set myself up for a good day, between parenting and work.\n\nBy starting my day in this way I am setting myself up for success because I am reliving my brain from making even micro-decisions before the day really starts.\n\nWhat are three daily habits you always stick to?\n\nMorning routine: it sends me straight into autopilot so I don't waste time or energy thinking about what comes next.\n\nEat breakfast: I need food to function — this one is non-negotiable.\n\nGo to bed early: I usually crash when the kids do. I learned a long time ago that every hour of sleep before midnight is worth two!\n\nBarrier tape cordons off tables to enforce social distancing inside an Oporto chicken shop on Bondi Beach in Sydney, Australia, on Sunday, July 4, 2021. Sydney residents are being urged to comply with lockdown rules for another week amid encouraging signs Australias largest city is getting on top of its delta-variant coronavirus outbreak. Photographer: Brendon Thorne/Bloomberg (Bloomberg via Getty Images)\n\nLots of Aussies are looking for a career change. What small action can help them get ahead of other candidates?\n\n'Be, do, have'.\n\nKnow what you want to be [and] do what you need to do, whether that's studying, volunteering, or networking, to have what you want.\n\nI'm a big believer in networking. It opens doors, builds confidence, and helps you learn about industries and people you might never have crossed paths with otherwise. You also never know who's hiring next, or who knows someone who is. There's no stronger resume than a genuine word of mouth recommendation.\n\nWhat financial myth did you previously believe that you wish you never bought into?\n\nI used to think all debt was bad. Over time, I've learned it's how you use it that matters.\n\nThere's bad debt that drains you, and good debt that helps you grow, like investing in education, property, or your business. The key is knowing the difference and making sure your money is working for you, not against you.\n\nSurprise entrant to top 10 most trusted brands in Australia View Gallery\n\nWhat do you wish you could tell your 20 year old self?\n\n\"This too shall pass.\"\n\nThere will be great days, and not-so-great days. When you're going through challenges, whether family, relationships or work, remember that everything in life is temporary.\n\nLife will go on. Focus on what you can control. Stay positive. Keep your eyes on your goal. Admit when you're wrong.\n\nLean into the discomfort and remind yourself, 'this is just a speed hump. Life will go on.'\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-19/meta-suspends-small-business-socials-account/106153840",
    "title": "Child abuse falsely detected in bakery's social media",
    "publish_date": "Fri, 19 Dec 2025 01:43:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "A bakery owner says she is devastated the business's social media account was shut down after being falsely flagged for child abuse material.\n\nThe Instagram profile of the Forbes Bakehouse in the NSW Central West — which mainly posts photos of food and staff — was suspended at the end of November.\n\nThe Forbes Bakehouse social media page shows mainly images of food and staff. (Supplied: Giselle Taunton )\n\nManager Giselle Taunton said the suspension was \"heartbreaking\".\n\n\"If I thought about it for too long, I could cry,\" she said.\n\nA few weeks later the owners also lost access to their Facebook account, although it remained public.\n\n\"Everything starts running through your head because our entire business relies on those platforms for everything,\" Ms Taunton said.\n\n\"I still can't wrap my head around the fact that our business was 1000 per cent reliant on a [social media] platform.\"\n\nThe bakery manager said she had just posted a picture of a smoothie when she saw the notification that the account was blocked.\n\n\"I thought, 'This will be fine. We'll have it back tomorrow.'\"\n\nMs Taunton said seeing the account blocked was \"heartbreaking\". (Supplied: Giselle Taunton )\n\n'No apparent human oversight' in suspensions\n\nThe Australian Small Business and Family Enterprise Ombudsman (ASBFEO), Bruce Billson, said in a statement a growing number of small businesses were noticing their accounts had been blocked by the host platform.\n\nMr Billson said the suspensions seemed to be occurring \"without any apparent human oversight\".\n\nThis year, the ASBFEO has supported 482 small businesses in disputes with social media companies.\n\nHe said it could have a \"devastating\" impact on the time and resources of a small business and cost them thousands.\n\n\"In some cases, a small business may never be able to recover the information they stored on a digital platform,\" Mr Billson said.\n\nMs Taunton said the bakery's Instagram page had about 2,500 followers.\n\n\"It took me a long time to get that,\" she said.\n\nAI commonplace in moderation\n\nKerrie Hodder and her family operate the Forbes Bakehouse. (Supplied: Facebook )\n\nRahat Masood, a senior lecturer at the University of New South Wales's School of Engineering and Computer Science, said there were multiple ways accounts could get taken down, including if the account was reported.\n\n\"Pushing that one report button can take a business down,\" Dr Masood said.\n\nShe said AI was also part of the decision-making process for multiple social media companies and false suspensions could happen even with highly accurate AI-models.\n\nDr Masood said training AI worked similarly to training the human brain.\n\nThrough repetition of words or images associated with inappropriate content, such as hate speech or nudity, AI learns to identify similar content in another post.\n\n\"The more information they see, the more they get trained,\" Dr Masood said.\n\nShe explained mistakes could happen if the AI system detected key words that were linked to child exploitation, such as using \"child\" and \"free\" in the same sentence.\n\nFight to overturn suspension\n\nSoon after Ms Taunton realised the accounts had been suspended, she started an appeal process which could take up to 180 days.\n\nWithin 24 hours of the ABC contacting Meta for comment, Ms Taunton received an email from the company outlining her account had been reinstated.\n\nThe family-run Forbes Bakehouse celebrated its 35-year anniversary this year. (Supplied: Giselle Taunton )\n\nIt did not confirm how the suspension occurred.\n\nA spokesperson for Meta said in a statement to the ABC, \"We take action on accounts that violate our policies and people can appeal if they think we've made a mistake.\"\n\nThe ABC understands Meta relies on a combination of AI and reports to enforce guidelines.\n\nOmbudsman calls for better oversight\n\nThe ombudsman said the federal government needed to have better oversight of social media companies suspending accounts.\n\n\"There is a clear need for proper governance and platform oversight where technology is deciding what accounts warrant shut down for allegedly not meeting community standards and has the effect of denying a small business the opportunity to operate on a digital platform,\" Mr Billson said.\n\nThe federal government planned to develop dispute resolution requirements for social media companies, but it was not clear when they would be finalised.\n\nIn a statement, the federal Department of Communications said, \"Companies must ensure their processes are fair and if mistakes are made there are proper procedures in place for users to address suspended accounts.\"\n\nMs Taunton supported the call for more oversight on account suspensions.\n\n\"There should be far more accountability on companies who have that grasp on people's lives and their livelihoods and are able to rip it out from underneath them.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-19/cricket-union-snicko-adelaide-faulty/106162676",
    "title": "'Careers are at risk': Cricketers union demands Snicko overhaul",
    "publish_date": "Fri, 19 Dec 2025 01:10:52 +0000",
    "category": "sports",
    "authors": [],
    "text": "Careers are at risk because of failing Snicko technology, Australian cricket's players' union says.\n\nThe Australian Cricketers' Association (ACA) is demanding an urgent review into the technology, which has caused controversy in the Ashes.\n\nACA chief executive Paul Marsh says it is \"nonsensical\" that decision review technology rests with host broadcasters instead of cricket governing bodies.\n\nDRS shambles in Adelaide A series of strange decisions by umpires further erodes any trust in the DRS process as day two at the Adelaide Oval devolves into \"shambles\" and \"chaos\".\n\n\"The players are frustrated,\" Marsh said on Friday.\n\n\"Careers are on the line with this sort of stuff.\n\n\"If you go back to why it was brought in, it was to get the decisions right.\n\n\"And clearly we have had some issues in this match and other matches where it's not right so it's something that should be looked at urgently.\"\n\nThe Snicko technology — provided and operated by BBG Sports — being used in the Ashes is deployed and paid for by host broadcaster Fox Sports.\n\nThe broadcaster is using Snicko in Australia rather than the more accurate and more expensive UltraEdge technology, pioneered by Hawk-Eye Innovations and owned by Sony that is used everywhere in the world except Australia and New Zealand.\n\nMarsh said the sport's global body, the International Cricket Council (ICC), or home-nation boards should pay for the technology.\n\n\"It doesn't actually make any sense that it's on the broadcasters to carry the cost of this,\" he said.\n\n\"Their interests aren't aligned, they're different, they're about producing the broadcast for people watching.\n\n\"The game is the one that should be making sure that the right technology is making the right decisions.\n\n\"It's nonsensical that it doesn't sit with the ICC or the home boards.\"\n\nCricket Australia has distanced the organisation from the ongoing furore, leaving it as a matter for host broadcasters.\n\nA Fox Sports spokesman declined to comment on Friday.\n\n\"People are seeing there is an issue here that needs to be looked at,\" Marsh said.\n\n\"We have got other parts of the world that are doing it differently and better so it's not like there's not a model out there to have a look at.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nEngland and Australian camps have become increasingly agitated at Snicko during the third Ashes Test in Adelaide.\n\nThere have been several Snicko flashpoints, including Australia's Alex Carey surviving a caught-behind appeal on day one when replays showed a spike on Snicko before the ball even reached his bat.\n\nCarey admitted he edged the ball and BBG Sports conceded human error was behind the Snicko mistake.\n\nTwo more Snicko incidents when England's Jamie Smith was batting on Thursday enraged both teams.\n\n\"Snicko needs to be sacked,\" Australian paceman Mitchell Starc was heard saying on stump microphones on Thursday.\n\n\"That's the worst technology there is.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-19/broken-hill-garbage-truck-driver-mark-mitchell-retires/106141468",
    "title": "Beloved outback 'garbo' collects final bins after 45 years on the job",
    "publish_date": "Fri, 19 Dec 2025 00:01:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "On a warm summer morning, Broken Hill City council worker Mark Mitchell journeys down a dusty outback street, stopping every few metres to empty the contents of a kerbside rubbish bin.\n\nAlthough some may consider his job the dirtiest in town, it is a role he has remained passionate about for decades, since his very first bin run in 1980 as a 21-year-old.\n\nBut 45 years later, the now 65-year-old is making his final run this week, deciding to retire just in time for Christmas.\n\nMark Mitchell is doing his final rubbish collections this week after 45 years in the job. (ABC News: Oliver Brown)\n\nFinding fun in the job\n\nMr Mitchell said he would miss many things about being a garbage truck driver, particularly the close connections he had built through conversations with locals over the years.\n\n\"If [older people] are out, we have a chat and it's just unbelievable how you get a rapport with them,\" he said.\n\nLoading...\n\n\" It makes their day when you pull up for a chat … might get you behind in your run, but [I] wouldn't have it any other way. \"\n\nHe said another highlight had been the many colourful costumes he had donned behind the wheel, including the distinctive red suit and beard of Santa Claus during the festive season.\n\n\"It puts a bit of fun in the job, people laugh and the kids just love it, they come out and wave,\" he said.\n\n\"One young lass [gave] me a [homemade] Christmas card last week … it's going to stick in my mind for the rest of my life.\"\n\nMark Mitchell says he is proud of the many connections he has made over the decades behind the wheel. (ABC News: Oliver Brown)\n\nMr Mitchell has also dressed up to commemorate local causes, including wearing a pink wig in October in recognition of breast cancer awareness and the local support group.\n\nCommunity connections\n\nBroken Hill City Council waste services coordinator Lyle Maguire said it was clear Mr Mitchell and his fellow \"garbos\" were key members of the outback town, making things run smoothly.\n\n\"There's a lot of people that ring up admin if the garbo's 10 minutes late,\" he said.\n\n\" A lot of people sit and wait for their garbage truck driver to come through. \"\n\nMr Maguire, who is coming up to 40 years of service with the local council himself, said Mr Mitchell's passion for the job and connection with his colleagues and community would be missed.\n\nMark Mitchell's supervisor Lyle Maguire (right) says the garbage crew will not be the same without him. (ABC News: Oliver Brown)\n\n\"I think the time that's put in over those 45 years, there's some stories for him to tell,\" he said with a knowing chuckle.\n\nCouncil general manager Jay Nankivell said while the town's isolated location was often seen as a disadvantage, it also meant staff had a genuine investment in their work.\n\n\"We're all part of the Broken Hill community, and everyone naturally wants to see things done right for the city they live in,\" he said.\n\nJay Nankivell believes regional council staff enjoy a closer relationship with their communities. (ABC News: Oliver Brown)\n\nGarbo for a day\n\nBroken Hill resident Liam McLaughlin, 10, has been obsessed with garbage trucks since he was a toddler.\n\nHe has developed a close relationship with Mr Mitchell over the years, with hopes of following in his footsteps one day.\n\nLiam's mother, Rebecca, said even as a young child, he would eagerly wait for the tell-tale rumble and clank of the garbage truck on their weekly bin day.\n\n\"He started a bit of a bin obsession with one toy bin, that grew into many [bins] and a very close friendship with [Mr Mitchell],\" she said.\n\n\"Over the years, [Liam] started bringing out an iPad and videoed me doing the bins [and I would] take him for a couple of rides,\" Mr Mitchell said.\n\nAs a last hurrah, Liam joined Mr Mitchell on a final bin run this week, picking up some tricks of the trade from the seasoned garbage truck driver.\n\n\"I like that [rubbish] truck … it has the [metal arm] to empty the bins, and it also has the four cameras where you can see where the rubbish gets emptied,\" Liam said.\n\n\"It's pretty cool.\"\n\nLiam McLaughlin is fascinated by Mark and his fellow garbage truck drivers. (ABC News: Oliver Brown)\n\nMs McLaughlin said seeing her son grow up idolising an essential community service was a testament to the garbage truck drivers in town.\n\n\"All of [the drivers] have been really good with [Liam] over the years ... to have that attention and focus and connection with him has been really lovely to see,\" she said.\n\n\" I think our Wednesdays are going to be very different moving forward, [there's some] big shoes to fill. \"\n\nMeanwhile, Mr Mitchell, who is looking forward to a few more sleep-ins and golf days in the near future, said his secret to building close connections between council and community was mutual respect.\n\nMark Mitchell says he has plenty to look forward to in retirement. (ABC News: Oliver Brown)\n\n\"Just give [others] a fair go, and they'll give you a fair go,\" he said.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-19/qld-puberty-blockers-pause-trans-teenagers-to-continue/106161908",
    "title": "Queensland pause on puberty blockers for trans adolescents to continue",
    "publish_date": "Thu, 18 Dec 2025 23:33:32 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "The Queensland government has announced it will continue its pause on puberty blockers and cross-sex hormones for new adolescent trans patients in the public system, after considering an independent review into the evidence surrounding the treatments.\n\nHealth Minister Tim Nicholls said the pause will continue until the completion of a trial being undertaken by the National Health Service in the UK, which is not due to finish until 2031.\n\nMr Nicholls said the 530-page independent review by Victoria's former chief psychiatrist Professor Ruth Vine was considered by cabinet in recent weeks.\n\nHe said it found the evidence base underlying the use of puberty blockers and hormones in adolescents with gender dysphoria was \"extremely limited\".\n\nIt also found that puberty blockers impacted patients' bone health and fertility was negatively affected.\n\nMr Nicholls said the Vine review did acknowledge \"low quality\" preliminary evidence that the treatments could alleviate \"some symptoms of gender dysphoria\".\n\n\"Some people will disagree with the government's decision,\" Mr Nicholls said at a press conference on Friday.\n\n\"We understand that. This is a hotly contested area.\"\n\nPublic hospitals to continue to provide support services, minister says\n\nIn January, Mr Nicholls announced an \"immediate pause\" on new adolescent patients with gender dysphoria receiving puberty blockers or gender-affirming hormones in the public health system, pending the outcome of the review into the evidence base of such treatments.\n\nQld facing fresh legal challenge over puberty blocker ban The action is being taken on behalf of the same mother of a transgender teenager who previously successfully fought the state's first ban.\n\nHe told journalists today public hospitals in Queensland would continue to provide support services for children presenting with gender dysphoria, including \"psychosocial and other supports other than the prescription of puberty blockers\".\n\n\"I note that this follows significant tightening of the rules in relation to the use of these therapies in France, Finland, Norway, Denmark and Sweden, and they have all strengthened and tightened the prescription and use and availability of the hormone therapies in those countries,\" Mr Nicholls said.\n\nBut the minister said the review said \"nothing to or about the transgender community, about their value or their participation or their role in society\".\n\n\"All people are expected to be respected and their feelings and their positions taken into account,\" Mr Nicholls said.\n\n\"But this review goes to a particular medical treatment for which there is no long-term evidence.\n\n\"We believe that it's in the safety and interests of children that these drugs not be made available though the public system until such time as there is better evidence available.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-19/polly-pony-sale-aged-care-home/106123742",
    "title": "Pony brings Christmas cheer to aged care home",
    "publish_date": "Thu, 18 Dec 2025 23:31:04 +0000",
    "category": "finance",
    "authors": [],
    "text": "Polly the pony leads a busy life.\n\nThe 15-year-old Welsh Shetland cross pony usually spends her days with five young children.\n\nHowever, this festive season, she has taken on a new role — spreading Christmas cheer at an aged care centre in eastern Victoria.\n\nPolly recently stopped by the Sale Gardens Care Community centre as part of a program connecting residents with the local community.\n\nPolly the pony has brought some Christmas cheer to residents and visitors at Sale Gardens Care Community centre. (ABC News: Danielle Pope)\n\nHer owner, Caz Driscoll, signed her \"perfect pony\" up for a visit after hearing the centre was looking for new ways to connect its residents with the community.\n\n\"She's just brought such joy to the residents,\" Ms Driscoll said.\n\nPolly the pony receives some pats from resident Jock. (ABC News: Danielle Pope)\n\nPony therapy\n\nMs Driscoll helped guide Polly into the home during her first visit, much to the delight of the residents.\n\n\"She's got a lot of trust in you so she was happy to walk into tight spaces, into the residents' rooms and see the ones that were bedridden and just back out carefully,\" Ms Driscoll said.\n\nA pony wandering the corridors of an aged care facility is an unusual sight — and one that sparked memories of earlier lives spent around horses.\n\nPolly the pony made friends with Jim. (Supplied: Caz Driscoll )\n\nMs Driscoll said Polly's gentle nature provided her with the intuition to know what residents needed.\n\n\"The ones [residents] that want to give her a hug, she's happy for that or she's happy to stand quietly and pop her nose in their lap,\" she said.\n\nSale Gardens Care Community acting general manager Julie Moss said it was wonderful to see the residents transform.\n\n\"A lot of them have grown up on farms or have always had horses in their lives, so it's great to be able to have Polly in the home,\" Ms Moss said.\n\nFor those residents needing a quieter touch, Polly has also proven to be a calming force.\n\nNancy, who is non-verbal, shares some special time with Polly the pony. (ABC News: Danielle Pope)\n\n\"One of our residents who doesn't communicate a lot, Polly came along, put her head in her lap, and this resident just lit up,\" Ms Moss said.\n\n\"It was the highlight. We all had tears it was so beautiful.\"\n\nNot your average horse\n\nTim Young is a resident at the home and an avid horse racing fan.\n\n\"I love them … my daughter owns eight horses,\" he said.\n\nPolly has even helped him place a few bets, though Mr Young is not too sure how she would fare herself on the track.\n\nPolly the pony helps Tim with some racing tips when he puts on his bets. (Supplied: Caz Driscoll)\n\n\"I don't think she'd make the distances,\" he joked.\n\n\" She's doing alright though, she might enjoy it if there was a carrot at the end. Or two or three. \"\n\nMs Moss said Polly's visits were part of a wider program.\n\n\"She just brings so much joy to the residents. It's beautiful to have her on site and the residents love seeing her,\" she said.\n\nJulie Moss says Polly brings so much joy to residents. (ABC News: Danielle Pope)\n\n\"We love having animals in our home.\"\n\nPolly the pony has found herself a regular visitor at the Sale Gardens aged care facility. (Supplied: Caz Driscoll )\n\nMs Driscoll said she hoped others would consider similar ways to connect with aged care residents.\n\n\"It's so rewarding, it's no time out of our day, really,\" she said.\n\n\"And if we can break up the day or the week a little bit and bring some joy it's great.\"",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-19/life-on-remote-cattle-station-adria-downs-edge-of-simpson-desert/106113634",
    "title": "Life on a remote cattle station where 'people leave a little bit better'",
    "publish_date": "Thu, 18 Dec 2025 23:28:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "In a far-flung corner of Queensland, past long roads, endless dust and beyond the last flicker of phone reception sits a homestead with bright green lawns, a peacock and river views.\n\nIt is an unlikely oasis in the desert — the heart of station life.\n\nAt Adria Downs, an 875,000-hectare organic cattle property 135 kilometres from Birdsville, work is the rhythm of life.\n\nIt is hard work that shapes those who take it on.\n\nCattle are trucked out of the station almost every week of the year. (ABC Western Qld: Hannah Walsh)\n\nYoung ringers from across the country and overseas rise before sunrise, move cattle through the heat and roll back in at dusk.\n\nAfter five years of generous rain and consistent floods, spirits are high at Adria Downs as staff come together to celebrate Christmas.\n\nAdria Downs has its own golf course. (ABC Western Qld: Hannah Walsh)\n\nWaterholes are full, feed is plentiful, and cattle have been trucked out of the station almost every week this year.\n\nThe station is also challenging industry stereotypes, having the same number of male and female workers for the first time.\n\nIt is a world 21-year-old Sophie Bruce, from Bathurst in New South Wales, stepped into a year and a half ago.\n\nSophie Bruce finished school and worked as a governess before coming to Adria Downs. (ABC Western Qld: Hannah Walsh)\n\n\"I'd seen heaps of things on Instagram or social media so came out here and I absolutely love it,\" she said.\n\n\"It's so different when you're actually living in the lifestyle.\"\n\nRingers pushing cattle to a paddock in the east. (ABC Western Qld: Hannah Walsh)\n\nThe Georgina River snakes through Adria Downs. (ABC Western Qld: Hannah Walsh)\n\nStation life\n\nAbout 10 ringers and station hands make up the backbone of Adria Downs, steered by manager Don Raymont, kept organised by his wife Judy, and fed by station cook Rhonda Heslin.\n\nMs Bruce said with such a large crew, it was not isolating, but could be testing.\n\n\"You definitely get annoyed at each other from time to time — that's just how it is living, breathing and working in the same space.\"\n\nHorses and motorbikes are used to muster on Adria Downs. (ABC Western Qld: Hannah Walsh)\n\nKnocking off work. (ABC Western Qld: Hannah Walsh)\n\nIn summer, temperatures can reach the high 40s, part and parcel of living in far western Queensland.\n\n\"We live in the heat … same as people live in north Queensland with cyclones,\" Mr Raymont said.\n\nA Sunday off is often spent swimming or in the aircon.\n\n\"If it's too hot, we'll sit in our rooms, watch some shows and we play a lot of card and board games,\" Ms Bruce said.\n\nRiverfront views at the staff dongas on Adria. (ABC Western Qld: Hannah Walsh)\n\n\"We've got Starlink so everyone can call their parents.\n\n\"It's kind of like a boarding school, I suppose.\"\n\nStorm Foxwell, 23, hopped off a plane from New Zealand last year and drove straight into station life.\n\nStorm Foxwell outside staff quarters at Adria. (ABC Western Qld: Hannah Walsh)\n\n\"I think the fact that it's a big desert and people still live here, I was intrigued,\" she said.\n\n\" It's so hard to describe this place, how big it is, what you see in a day … being out here has changed so much for me. \"\n\nThe Muncoonie Lakes system includes two major lakes that fill when the Georgina River flows. (ABC Western Qld: Hannah Walsh)\n\n\"We always eat together it's like going and having dinner with your family … lots of steak believe it or not.\"\n\nUK backpacker Matthew Carter said he was drawn to rural work after coming to Australia three years ago.\n\n\"It's hard work, it's early mornings, it's hot days and I think that's what brings people … people that want to prove to themselves they can do hard work and people that love that kind of work,\" he said.\n\n\"I think station work is the essence of Australia.\"\n\nMatthew Carter has also worked on stations in north Queensland. (ABC Western Qld: Hannah Walsh)\n\nIt is still work head stockman Wilson Love enjoys, after being at Adria since 2022.\n\n\"There's everything I love here … the people, the lifestyle that comes with it,\" he said.\n\n\"We get a lot of backpackers come out … we've had seven different nationalities this year.\n\n\" People normally leave here a little bit better than what they came; makes it rewarding. \"\n\nWilson Love is from Toowoomba. (ABC Western Qld: Hannah Walsh)\n\nAnd of course, it is only natural plenty of romance kicks off — blame the sunsets and solitude.\n\n\"When you work so closely with people, it's very easy to see it as a Love Island type of scene or after one too many beers,\" Mr Carter joked.\n\nThe homestead\n\nAdria Downs is one of several properties owned by the Brook family.\n\nThe collection of houses and accommodation that make up the homestead has been developed over the past two decades.\n\nBefore that, station operations were run out of Birdsville.\n\nThe homestead has been running since 2005. (ABC Western Qld)\n\nAdria Downs is 875,000 hectares bordering the Munga-Thirri Simpson Desert. (ABC Western Qld)\n\nDavid Brook's great-grandfather purchased the pastoral lease in 1939.\n\n\"We've been through the whole process of bringing the first homestead in and then slowly building up around that,\" Nell Brook said.\n\n\"It's a perfect spot.\"\n\nThe Brook family owns 3 million hectares spanning several properties in Queensland and South Australia. (ABC Western Qld: Hannah Walsh)\n\nDonny and Judy Raymont have been there since it became a working homestead in 2005.\n\n\"It's come along way, we've done a lot of work with the Brook family,\" Mr Raymont said.\n\n\"We've never had to advertise for staff.\"\n\nCanoe races became a feature of the Adria Downs Christmas party this year. (ABC Western Qld: Hannah Walsh)\n\nTeaching young people about the industry is what Mr Raymont said motivated him to get out of bed every morning.\n\n\" To know you've played a small part in guiding those kids, boys and girls, to be better people is what keeps me going every day. \"\n\nWhile some will stay to keep the station running over Christmas, most will escape the heat and head to their respective homes.\n\nBut for Sophie Bruce, she has decided it is time to leave the desert behind … for now.\n\nSophie Bruce has been living and working on Adria Downs for a year and a half. (ABC Western Qld: Hannah Walsh)\n\n\"I've learnt so many things from in the shed, to out mustering and a lot with how to interact with people too,\" she said.\n\n\"I will miss it so much.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-19/whistleblower-alleges-university-of-wollongong-corrupt-inquiry/106156988",
    "title": "Whistleblower tells inquiry she reported suspected corruption at Wollongong university",
    "publish_date": "Thu, 18 Dec 2025 23:21:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "The University of Wollongong (UOW) is facing renewed scrutiny after a long-serving staff member told a NSW parliamentary inquiry she had flagged suspected corruption with the NSW Independent Commission Against Corruption (ICAC).\n\nThe ABC understands ICAC officials attended the campus in recent weeks.\n\nIn a statement, the commission said it \"makes no comment in response to the specific matters raised\".\n\nLisa Simmons, who worked at the university for 24 years, told the Legislative Council Standing Committee on Social Issues on Wednesday that decision-making at the university had become increasingly centralised.\n\nShe said it created a culture of fear that discouraged staff from raising concerns and undermined transparency and accountability.\n\n\"For professional staff like me, appearing before an inquiry like this is seen as the nuclear option,\" Ms Simmons said.\n\n\" It carries very real personal and professional risk. \"\n\nLisa Simmons gave evidence to a NSW parliamentary inquiry after making a protected disclosure to ICAC. (Supplied: NSW Parliament)\n\nThe Upper Housing inquiry is investigating the NSW university sector after concerns were raised about restructuring and job cuts at a number of campuses, in a petition received by the parliament earlier this year.\n\nThe inquiry is examining whether university governance, financial oversight and accountability frameworks are failing to protect the public mission of universities amid widespread job cuts, commercialisation and concerns about transparency.\n\nMs Simmons told the inquiry she made a voluntary disclosure to the ICAC in March, alleging suspected corrupt conduct, and she was granted whistleblower protections under the Public Interest Disclosures Act.\n\nShe said the concerns related to the management of conflicts of interest at senior levels, including allegations involving council members and the governance division.\n\n\"These conditions didn't happen overnight,\" Ms Simmons said.\n\n\"They developed over many years when accountability structures were weakened, risk and assurance functions stopped being able to protect the public interest, and silence became the suffocating norm.\"\n\nFinancial missteps exposed\n\nThe inquiry also examined the Wollongong university's financial management, including a failed public-private partnership for student accommodation that left the university with an estimated $160 million shortfall.\n\nThe deal, which involved guaranteed occupancy levels and a co-payment contribution to developer Lendlease, collapsed after the COVID-19 pandemic reduced student numbers.\n\nThe agreement was ultimately terminated, with the university repurchasing the assets and taking on debt that remains on its books.\n\nChancellor Michael Still was pressed over his role in former Vice-Chancellor Patricia Davidson's resignation and confirmed he had initiated discussions that led to her departure in April 2024.\n\nMichael Still told a NSW parliamentary inquiry he initiated discussions that led to the resignation of former vice-chancellor Patricia Davidson. (Supplied: NSW Parliament)\n\nWhen asked why he told local media the resignation \"came as a shock\", he rejected the account, saying: \"No, I didn't say that … the reporting was incorrect,\" he told the inquiry.\n\nAt the time, in an ABC interview, he described the resignation as \"a surprise\" and \"very sad\".\n\nNSW Governor Margaret Beazley at the installation ceremony for chancellor Michael Still. (Supplied: Governor of NSW)\n\nChancellor Still told the inquiry he was encouraged to consider the role by former UNSW chancellor David Gonski, and confirmed his installation ceremony cost about $62,000, the first such event at UOW since 1975.\n\nProfessors warn of crisis\n\nThe inquiry also heard from academics who accused university management of prioritising property development over teaching.\n\nAdam Lucas provided evidence to a NSW parliamentary inquiry. (Supplied: NSW Parliament)\n\nFormer academic Adam Lucas said many university councils were dominated by members from finance, property and big-four consulting firms.\n\n\"[They] help executives create paper financial crises, recommend slash-and-burn solutions, then profit from auditing the outcomes … while staff are sacked, disciplines cut, and students get a thinner, more precarious education.\"\n\nMore than $29 million has been paid in redundancies over 18 months, which is part of a major restructure that cut over 130 positions.\n\nFiona Probyn-Rapsey and Susan Engel appearing before the inquiry. (Supplied: NSW Parliament)\n\nFormer academic Fiona Probyn-Rapsey described UOW's transformation as \"bizarre and chaotic,\" with Chancellor Still assuming powers normally held by a vice-chancellor.\n\nShe said after Professor Davidson departed, the university appointed interim vice-chancellor John Dewar.\n\nProfessor Probyn-Rapsey said Mr Dewar was a partner at consultancy KordaMentha and was appointed while the same firm conducted operational reviews that led to further job cuts.\n\n\"Many of us who love UOW are still wondering how council and the chancellor effectively handed over a public institution to a private consultancy,\" she said.\n\nChancellor Still rejected suggestions of a conflict of interest, telling the inquiry Mr Dewar was barred from any involvement with KordaMentha during his interim vice-chancellor role and there was no ongoing engagement.\n\nAcademic and National Tertiary Education Union branch president Susan Engel said the changes had had devastating effects on students, with one describing it as the \"worst year of her life\".\n\nDeputy Chancellor Warwick Shanks confirmed during questioning that the university had flown staff to the UK as part of a partnership with Tottenham Hotspur.\n\nFormer prince, Andrew Mountbatten-Windsor, visited Wollongong 2017. (Supplied: UOW)\n\nHe also confirmed that executive bathrooms were upgraded ahead of a visit from former prince, Andrew Mountbatten-Windsor, but could not recall the costs involved for either.\n\nUOW said it was unable to comment, with a spokesperson saying, \"Any enquiries about the existence or status of investigations by integrity agencies should be directed to the relevant agency.\"\n\nSpeaking after the hearing, Dr Engel said the inquiry \"was useful in showing the chaos over the last couple of years, but also concerning, as it shed light on so many issues that are still not fully addressed\".",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-19/tiktok-deal-to-sell-us-unit-to-investors-oracle-silver-lake/106161968",
    "title": "TikTok to sell US unit to American investors, including Oracle",
    "publish_date": "Thu, 18 Dec 2025 23:19:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "TikTok has signed a deal to sell its US business to three American investors — Oracle, Silver Lake and MGX — ensuring the popular social video platform can continue operating in the United States.\n\nThe deal is expected to close on January 22, according to an internal memo seen by The Associated Press.\n\nChief executive Shou Zi Chew said in the memo that ByteDance and TikTok had signed binding agreements with the three investors.\n\nThe new TikTok US joint venture will be 50 per cent held by a consortium of new investors, including Oracle, Silver Lake and MGX with 15 per cent each.\n\nAnother 30.1 per cent will be held by affiliates of existing ByteDance investors and 19.9 per cent will be retained by ByteDance, according to the memo.\n\nThe US venture would have a new, seven-member American-majority board of directors, the memo said.\n\nIt will also be subject to terms that \"protect Americans' data and US national security.\"\n\nUS user data will be stored locally in a system run by Oracle.\n\nTikTok's algorithm — the secret sauce that powers its addictive video feed — would be retrained on US user data to \"ensure the content feed is free from outside manipulation,\" the memo said.\n\nThe US venture will also oversee content moderation and policies within the country.\n\nLegal challenges\n\nThe deal marks the end of years of uncertainty about the fate of the popular video-sharing platform in the US.\n\nAfter wide bipartisan majorities in Congress passed — and former president Joe Biden signed — a law that would ban TikTok in the US if it did not find a new owner in the place of China's ByteDance, the platform was set to go dark on the law's January 2025 deadline.\n\nFor several hours, it did.\n\nBut on his first day in office, President Donald Trump signed an executive order to keep it running while his administration tried to reach an agreement for the sale of the company.\n\nThree more executive orders followed, as Mr Trump, without a clear legal basis, continued to extend the deadline for a TikTok deal.\n\nThe second was in April, when White House officials believed they were nearing a deal to spin off TikTok into a new company with US ownership that fell apart after China backed out following Trump's tariff announcement.\n\nThe third came in June, then another in September, which Trump said would allow TikTok to continue operating in the US in a way that met national security concerns.\n\nAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-19/jacinta-allan-victoria-premier-husband-drink-driving/106161956",
    "title": "Victorian premier's husband caught drink driving",
    "publish_date": "Thu, 18 Dec 2025 23:16:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Victorian Premier Jacinta Allan has apologised after her husband was caught drink driving, saying the incident left her \"disappointed and embarrassed\".\n\nMs Allan said Yorick Piper was driving to the supermarket in Bendigo on Thursday morning when he rear-ended another car at an intersection.\n\nHe was later pulled over for a random breath test and blew the blood alcohol concentration limit of 0.05.\n\nMr Piper received an on-the-spot fine and has lost his licence, which she said would take effect from January 16.\n\nMs Allan said she and her family had celebrated their son's birthday at a local pub the night before and medication he was taking might have contributed to the incident.\n\nJacinta Allan said she and her husband Yorick Piper (left) had made a donation to a charity that helps people impacted by road trauma. (Instagram: Jacinta Allan)\n\n\"As a result of the medication mixing with the alcohol from the night before, he simply shouldn't have been driving the following morning,\" she said.\n\n\"He understands that, I understand that and for this we are both truly sorry.\"\n\nMs Allan said she and her husband had made a donation of $1,000 to the Amber Community charity, which supports people affected by road trauma.\n\n\"Drink driving is an incredibly serious issue, so is road trauma. We recognise that and I am truly sorry,\" she said.\n\n\"I was shocked when Yorick told me yesterday what had happened.\"",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-19/ashes-adelaide-test-day-three-live-blog/106161670",
    "title": "Live: England strikes early with fortuitous LBW call after Stokes' batting finally ends",
    "publish_date": "Thu, 18 Dec 2025 23:02:38 +0000",
    "category": "sports",
    "authors": [
      "Simon Smale",
      "Henry Hanson"
    ],
    "text": "As overcast skies begin to clear in Adelaide, Jake Weatherald and Travis Head enter the field of play.\n\nHow will the Australian pair play the new ball?\n\nJofra Archer, fresh from five wickets in the first innings and a 50 with the bat, is at the top of his mark...\n\nHe's coming around the wicket to Head and is immediately extracting some extra bounce from the surface. Head plays the ball into his body then into the turf, before scampering through for a single.\n\nWeatherald is defending as Archer is called for a front foot no ball.\n\nArcher angles in a bouncer towards Weatherald's shoulder - a delivery similar to the one that dismissed the Australian opener in the first innings. Weatherald sways out of its path.\n\nPoor from Archer. Full, leg slide and sliding further down, it evades a diving Jamie Smith and races to the boundary for four byes.\n\nArcher oversteps as Weatherald is leaving outside off. That's the second no ball of the over.\n\nWeatherald is happy to be shouldering arms once more.\n\nHe gets off the mark with a flick off the hips for a single.\n\nEight runs from the first over - and just two off the bat.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-19/home-building-bgc-class-action/106160084",
    "title": "Home owners could claim millions if class action against builder succeeds",
    "publish_date": "Thu, 18 Dec 2025 22:36:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Almost two years after the slab went down on Jo and David Dimov's \"forever home\", it is still unfinished.\n\nThey are among thousands of Western Australians who could benefit from a class action accusing one of WA's biggest builders of unreasonable delays.\n\nTwo years ago, a class action was launched against BGC Housing, claiming the company had oversold and underdelivered houses.\n\nSince then, more homebuilders in Perth and the state's South West have signed up to the legal proceedings and lawyers say they are aiming for a payout of more than $100 million.\n\nA class action is underway claiming some BGC customers have experienced unreasonable delays with their home build. (ABC South West WA: Jacqueline Lynch)\n\nJo and David Dimov signed up with a subsidiary of Perth builder BGC Housing Group in late 2022.\n\nThey were \"pretty excited\" when the slab went down on their block, north of Bunbury, in January last year.\n\n\"It was exciting to see the earthworks happen … [and] to see the bobcat get in there and start digging it up,\" said Mr Dimov.\n\n\"It started to take some shape and looked like things were going to kick off pretty quick.\"\n\nBut nearly two years later, they are still waiting to move in.\n\n\"I have seen entire subdivisions go up in the time our house has been built,\" he said.\n\nJo and David Dimov say it has been a stressful two years building their home, north of Bunbury. (ABC South West WA: Jacqueline Lynch)\n\nMs Dimov said it had been a stressful couple of years trying to build what she described as their \"forever home\".\n\n\"It's been disheartening, there has been tears … The stress and the pressure on our family unit, it's been pretty hard,\" she said\n\n\" They need to be accountable as a big company for what they've done by overselling houses. \"\n\nMs Dimov has described having to fight \"every step of the way\" to get the work done correctly.\n\nShe said they had joined the class action in the hope it would bring about change, but said more needed to be done to keep builders in check.\n\n\"Even if it's just a spot check, 'Surprise, we're here to check to make sure that you're doing the right job' … then I feel like maybe some of these builders would be a little bit more accountable,\" she said.\n\nThe WA government has committed to mandatory building inspections in apartment builds from next year but is yet to set a timeline for bringing them in for home builds.\n\nDavid Dimov says he has seen \"entire subdivisions go up\" while his home is being built. (ABC South West WA: Jacqueline Lynch)\n\nDelays 'shouldn't have happened'\n\nLawyer Spencer Lieberfreund, who is supporting the claimants in the class action, said customers had dealt with alleged delays and cost increases \"that shouldn't have happened\".\n\n\"We started to get a number of people coming to see us individually with complaints about delays in their construction, we saw they were all BGC home owners and it snowballed from there,\" he said\n\n\" Our estimate was that there were between six and seven thousand customers that BGC had that were affected by this. \"\n\nHe said he ultimately wanted to see people compensated for the time they spent waiting.\n\n\"You might have had to pay additional rent, [or] if you already owned a home you might have had to pay additional interest payments, [or] if you were an investor, you might have lost rent because you were unable to rent your home when you should have been able to do so,\" he said.\n\nIf a class action is successful, the payout to home builders could be up to $100 million. (ABC South West WA: Jacqueline Lynch)\n\nBGC still working through backlog\n\nIn 2023, BGC limited taking on new home orders to focus on its existing jobs, including home builds picked up after the McGowan government's COVID-19 \"Building Bonus Grants\".\n\nIn a statement, the company confirmed it was still working through the backlog, but said it was getting closer to handover on each build.\n\n\"BGC confirms it currently has 61 residential homes for retail customers remaining to be completed in Western Australia, including one in the South West of the state,\" a spokesperson said.\n\nBGC has confirmed it is stil working on dozens of unfinished homes around WA. (ABC News: James Carmody)\n\n\"Each of these homes is continuing to achieve progress towards key handover every day.\n\n\"The company stopped taking sales of new residential homes in April 2023 and has not recommenced.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-19/nascar-driver-greg-biffle-dies-in-plane-crash/106161496",
    "title": "Former NASCAR driver Greg Biffle dies after private jet crashes in US",
    "publish_date": "Thu, 18 Dec 2025 22:33:10 +0000",
    "category": "sports",
    "authors": [],
    "text": "Former race driver Greg Biffle and members of his family were among seven people who died in a plane crash Friday morning in North Carolina, state police said.\n\nThe business jet erupted when it hit the ground while trying to land at Statesville Regional Airport, about 72 kilometre north of Charlotte.\n\nFlight records show the plane was registered to a company run by Biffle.\n\n\"Although the post-crash fire prevents us from releasing a definitive list of the occupants at this time, it is believed that Mr Gregory Biffle and members of his immediate family were occupants of the airplane,\" state police said.\n\nA screen grab from video provided by WSOC shows firefighting crews responding to the plane crash. (Supplied: WSOC)\n\nBiffle, 55, won more than 50 races across NASCAR's three circuits, including 19 at the Cup Series level. He also won the Trucks Series championship in 2000 and the Xfinity Series title in 2002.\n\nGolfers playing next to the airport were shocked as they witnessed the disaster, even dropping to the ground at the Lakewood Golf Club while the plane was overhead. The ninth hole was covered with debris.\n\n\"We were like, 'Oh my gosh! That's way too low,'\" Joshua Green of Mooresville said. \"It was scary.\"\n\nThe National Transportation Safety Board and the FAA were investigating.\n\nGreg Biffle (right) takes a selfie with US President Donald Trump at the Daytona 500 in February 2025. (Getty Images: Chris Graythen)\n\nThe plane took off from the airport shortly after 10am local time, but then returned and was attempting to land there, according to tracking data posted by FlightAware.com.\n\nThe plane had planned to fly later from Sarasota, Florida, to Treasure Cay International Airport in the Bahamas before returning to Fort Lauderdale, Florida, and then to Statesville by evening, data showed.\n\nWith 2025 almost over, there have been 1,331 US crashes this year investigated by the NTSB, from two-seat planes to commercial aircraft, compared to a total of 1,482 in 2024.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-19/prince-and-princess-of-wales-release-christmas-card-2025/106161436",
    "title": "Prince William and Princess Catherine release 2025 Christmas card",
    "publish_date": "Thu, 18 Dec 2025 22:28:23 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "The Prince and Princess of Wales have released a new family portrait to coincide with their annual Christmas card.\n\nThe royal couple published the image on social media with the caption: \"Wishing everyone a very Happy Christmas.\"\n\nThe portrait was taken by photographer Josh Shinner in Norfolk in April this year.\n\nIn the image, Prince William and Princess Catherine are joined by their three children: 12-year-old Prince George, 10-year-old Princess Charlotte and Prince Louis, who is seven.\n\nThey smile and pose in a lush green field dotted with yellow daffodils — which is considered the national flower of Wales.\n\nThe Christmas card marks another year in Catherine's gradual return to public life, as she continues her recovery from cancer and chemotherapy treatment.\n\nKing's Christmas portrait\n\nLast week, King Charles gave a rare health update and announced his cancer treatment would be reduced in the new year.\n\nThe monarch described the milestone as a \"blessing\" and a testament to remarkable medical advances.\n\nIt has been almost two years since the king's diagnosis was publicly revealed, and in that time, Buckingham Palace has seldom released details about his condition and prognosis.\n\nLoading...\n\nIt has never been revealed what type of cancer the king was diagnosed with, although it has been confirmed that he does not have prostate cancer.\n\nWhile it is understood the 77-year-old king's treatment will be significantly reduced next year, it will continue.\n\nEarlier this month, Buckingham Palace released King Charles and Queen Camilla's official Christmas card.\n\nThe card features a portrait taken of the royal couple in April, where they marked their 20th wedding anniversary during a trip to Rome to visit then-pope Francis at the Vatican.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/the-ashes-2025-live-stokes-england-bat-on-day-three-as-australia-chase-early-wickets-after-more-snicko-dramas-20251219-p5noyg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Ashes 2025 LIVE: ‘Big mistake’: Weatherald misses out on reprieve after choosing not to challenge lbw",
    "publish_date": "Fri, 19 Dec 2025 13:10:08 +1100",
    "category": "sports",
    "authors": [
      "Roy Ward",
      "Tom Decent",
      "Dan Walsh",
      "Daniel Brettig"
    ],
    "text": "Devon Conway reached a double century for the first time since his first test innings four years ago, leading New Zealand to 424-3 at lunch Friday on the second day of the third test against the West Indies.\n\nNew Zealand lost the nightwatchman Jacob Duffy (17) and an out-of-sorts Kane Williamson (31) in the first session but Conway was immovable and reached 224 not out by lunch. Rachin Ravindra was 4 not out.\n\nNew Zealand’s Devon Conway. Credit: Getty Images\n\nNew Zealand leads the three-match series 1-0 after the first test was drawn and the Black Caps won the second by nine wickets.\n\nConway resumed at 178 after batting through all of the first day on which he shared a 323-run opening partnership with Tom Latham who made 137.\n\nHe reached his double century after more than seven hours at the crease, from 316 balls and with 28 fours.\n\nConway made a double century in the first innings of his first test against England in June 2021, immediately after qualifying to play for New Zealand on residential grounds. That remained his highest score through 58 innings until he finally surpassed it on Friday.\n\nDevon Conway and Rachin Ravindra of New Zealand avoid a bird during day two. Credit: Getty Images\n\nNew Zealand was 334-1 when the second day began, with Duffy 9 not out. Duffy hit two early boundaries before being caught by wicketkeeper Tevin Imlach off Jayden Seales when the total was 350.\n\nThat brought out Williamson who was padded up for all of the first day and in total for 93.5 overs, waiting for his turn to bat. When it came, he was rusty at times, playing and missing and battling timing issues early in his innings. But he survived 60 balls and hit five boundaries in his 31 until he was out driving at a ball on a tempting length which just moved away and flicked the outside edge.\n\nConway also had trouble at times against a depleted West Indies attack. Kemar Roach is out of action at least for the rest of the second day with a hamstring issue.\n\nConway was dropped on 206 by Kavem Hodge at short cover off Roston Chase and took chances at times by leaving on length balls which passed close to or over his off stumps. Still, New Zealand’s total passed 400 in 111 overs.\n\nConway spoke to media after stumps on the first day after the difficult task of opening the batting, especially in New Zealand.\n\nOpening “is a very underappreciated job around the world, not just here,” Conway said. “Yeah, it has been a tough ride. Quite often you rock up day one of a test match and you see it’s pretty green.\n\n“Already mentally you think, well, it’s going to do bits here on this pitch. I think a lot of credit needs to go to a guy like Tom Latham, who’s played 90-odd tests and has done so well.”\n\nA short time ago New Zealand were 5-485.\n\nAP",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/business/companies/tiktok-signs-deal-to-sell-us-unit-to-group-led-by-trump-s-billionaire-friend-20251219-p5nozv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The ‘secret sauce’ in TikTok’s US deal led by Trump’s billionaire friend",
    "publish_date": "Fri, 19 Dec 2025 12:54:14 +1100",
    "category": "finance",
    "authors": [
      "Barbara Ortutay"
    ],
    "text": "TikTok has signed agreements with three major investors — Oracle, Silver Lake and MGX — to form a new TikTok US joint venture, ensuring the popular social video platform can continue operating in the United States.\n\nThe deal is expected to close on January 22, according to an internal memo seen by The Associated Press. In the communication, CEO Shou Zi Chew confirmed to employees that ByteDance and TikTok signed the binding agreements with the consortium.\n\nOutspoken Oracle co-founder Larry Ellison is a close confidante of Donald Trump. Credit: AP\n\n“I want to take this opportunity to thank you for your continued dedication and tireless work. Your efforts keep us operating at the highest level and will ensure that TikTok continues to grow and thrive in the US and around the world,” Chew wrote in the memo to employees.\n\n“With these agreements in place, our focus must stay where it’s always been—firmly on delivering for our users, creators, businesses and the global TikTok community.”",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/national/queensland/ban-on-kids-gender-care-in-queensland-public-hospitals-extended-20251219-p5nozf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ban on kids’ gender care in Queensland public hospitals extended",
    "publish_date": "Fri, 19 Dec 2025 12:53:28 +1100",
    "category": "lifestyle",
    "authors": [
      "Matt Dennien",
      "Courtney Kruk"
    ],
    "text": "Queensland’s ban on gender-affirming care for transgender children will continue until at least 2031, the state government announced, as it prepares to release a long-awaited review into public hospital gender services.\n\nThe Crisafulli government called an immediate halt to hormone treatments for children under 18 delivered through public hospitals in January, and ordered an independent clinical review of all services to be conducted by Victoria’s former chief psychiatrist Professor Ruth Vine.\n\nHealth Minister Tim Nicholls said on Friday the pause on stage one and two hormone therapies would continue until the end of the United Kingdom’s Pathways trial in 2031.\n\nQueensland Health Minister Tim Nicholls speaks to media outside state parliament. Credit: Matt Dennien\n\nStage one therapies refers to the use of puberty blockers, medications that temporarily stop a young person’s body developing physical characteristics. Stage two therapies include hormone replacement therapy (HRT) such as estrogen or testosterone.",
    "source": "SMH",
    "cluster_id": 10
  },
  {
    "url": "https://www.smh.com.au/lifestyle/crown-duels-is-queen-mary-the-a-role-model-for-kate-the-princess-of-wales-20251219-p5np1w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Crown Duels: Is Queen Mary the a role model for Kate, the Princess of Wales?",
    "publish_date": "Fri, 19 Dec 2025 12:53:09 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Crown Duels: Is Queen Mary the a role model for Kate, the Princess of Wales?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/lifestyle/crown-duels-the-comparisons-between-queen-mary-and-the-princess-of-wales-20251219-p5np1x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Crown Duels: The comparisons between Queen Mary and the Princess of Wales",
    "publish_date": "Fri, 19 Dec 2025 12:52:15 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Crown Duels: The comparisons between Queen Mary and the Princess of Wales\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/starc-jaffa-knocks-stokes-over-20251219-p5np1p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Starc jaffa knocks Stokes over",
    "publish_date": "Fri, 19 Dec 2025 12:42:06 +1100",
    "category": "finance",
    "authors": [],
    "text": "Starc jaffa knocks Stokes over\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/weatherald-refuses-review-in-huge-mistake-20251219-p5np1q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Weatherald refuses review in huge mistake",
    "publish_date": "Fri, 19 Dec 2025 12:42:04 +1100",
    "category": "finance",
    "authors": [],
    "text": "Weatherald refuses review in huge mistake\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/superquiz-friday-december-19-20251218-p5noqb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Superquiz, Friday, December 19",
    "publish_date": "Fri, 19 Dec 2025 12:41:52 +1100",
    "category": "finance",
    "authors": [],
    "text": "By Andrew Brooks\n\nTry our new Mini Crossword\n\nTen clues. Twenty-five squares. How quickly can you solve this bite-sized puzzle? Track your win streaks and challenge family and friends by sharing your results.\n\nPremium subscribers to The Age can play the Mini Crossword (and all our puzzles, including Target Time) here and premium subscribers to The Sydney Morning Herald can play them here.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/the-noodles-are-all-made-by-hand-at-this-indonesian-eatery-in-melbourne-s-southeast-20251219-p5np1c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The noodles are all made by hand at this Indonesian eatery in Melbourne’s southeast",
    "publish_date": "Fri, 19 Dec 2025 12:29:00 +1100",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nPBK Noodles owner Michael Samsir has honed his craft, making dishes from scratch at the Clayton eatery.\n\n1 / 7 PBK Noodles owner Michael Samsir makes Indonesian-style noodles by hand. Joe Armao 2 / 7 PBK Noodles in Clayton serves up specialty coffee and handmade noodles. Joe Armao 3 / 7 A generous bowl of mie medan at PBK Noodles. Joe Armao. 4 / 7 Upside down coffee. Joe Armao 5 / 7 Noodles are all made by hand. Joe Armao 6 / 7 Shoestring noodle with chicken and mushroom. Joe Armao 7 / 7 Fried wontons. Joe Armao Previous Slide Next Slide\n\nIndonesian$$$$\n\nThere’s so much to love at this daytime spot. Owner Michael Samsir imports coffee from Aceh and roasts it for his Indonesian special brews. The upside-down coffee that you drink by blowing it with a straw has to be seen to be believed. Then there are the noodles, made out the back to various thicknesses and served with house-made broth and wontons. PBK can just be lunch, but it can also be a connoisseur’s paradise.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/business/companies/macquarie-cops-35m-fine-for-misleading-conduct-on-millions-of-short-sales-20251219-p5noz5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Macquarie cops $35m fine for misleading conduct on millions of short sales",
    "publish_date": "Fri, 19 Dec 2025 12:26:06 +1100",
    "category": "finance",
    "authors": [
      "Colin Kruger",
      "Dominic Powell"
    ],
    "text": "Macquarie Group has agreed to a $35 million fine after reaching a settlement with the corporate watchdog over misleading conduct relating to its failure to properly report at least 73 million short sales over 15 years.\n\nThe settlement with the Australian Securities and Investments Commission (ASIC) relates to legal action commenced in May this year and is still subject to court approval. Macquarie admits to multiple systems failures, many of which remained undetected for more than a decade.\n\nMacquarie chairman Glenn Stevens, and chief executive Shemara Wikramanayake.\n\nThey include its failure to correctly report at least 73 million short sales between December 11, 2009, and February 14, 2024. ASIC said it is estimated that the group misreported as many as 1.5 billion short sales.\n\n“Accurate and reliable data underpins confidence in our financial markets. ASIC and the market rely on short sale and regulatory reporting data – especially during periods of volatility – to understand market activity and make informed decisions,” ASIC chairman Joe Longo, said.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/bondi-hero-ahmed-al-ahmed-speaks-from-his-hospital-bed-20251219-p5np03.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bondi hero Ahmed al Ahmed speaks from his hospital bed",
    "publish_date": "Fri, 19 Dec 2025 12:07:15 +1100",
    "category": "finance",
    "authors": [],
    "text": "Bondi hero Ahmed al Ahmed speaks from his hospital bed\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/snicko-is-used-in-the-ashes-but-ultraedge-in-the-bbl-the-quirks-of-cricket-technology-explained-20251219-p5noym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Snicko is used in the Ashes, but UltraEdge in the BBL. The quirks of cricket technology explained",
    "publish_date": "Fri, 19 Dec 2025 12:02:38 +1100",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "Cricket can be a difficult game to explain to those not familiar with the quirks of the sport. The explanation for the use of technology is not straightforward, either.\n\nMany of the one million-plus viewers who settled in to watch the Big Bash League after the Ashes on Thursday may be wondering why there is different technology used for the Tests in this country and for Cricket Australia’s Twenty20 competition.\n\nRealtime Snicko has become a well-known component of Test match decision-making. Credit: Twitter\n\nPlayers have lost faith in Snicko after it returned controversial decisions during the Adelaide Test, but UltraEdge is being used for a lower level of cricket despite being considered by some experts, including Ricky Ponting, to be the superior technology.\n\nEven to seasoned cricket viewers, it seemed an additional absurdity in the technology debate that has exploded during this Ashes summer.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/article/banks-warning-could-mean-renewed-cost-of-living-crisis/bmw0vwr4u",
    "title": "Fears of further financial pain for Australians after major banks' forecasting",
    "publish_date": "Thu, 18 Dec 2025 18:37:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "With many Australians hoping for further interest rate cuts and more potential relief from the cost of living crisis, a new forecast has raised fears financial struggles could be exacerbated next year.\n\n\n\n\n\nAll of Australia's 'big four' banks have dismissed the possibility of a rate cut in 2026, with two of them forecasting at least one increase early in the year.\n\n\n\n\n\nCommonwealth Bank has predicted cash rates will rise by 0.25 per cent in the Reserve Bank of Australia's (RBA) first meeting next year in February, while National Australia Bank has predicted a 0.5 per cent rise in two separate hikes in February and May.\n\n\n\n\n\nSally Tindall, data insights director at financial comparison website Canstar, told SBS News: \"[It] will be important to see how inflation is tracking, if it's still tracking in the wrong direction ... Then the RBA could choose to hike the cash rate based on that.\"\n\n\n\n\n\nBut she also reminded Australians \"It's important to remember that these are just forecasts. They're not set in stone.\"\n\n\n\n\n\nThe 'big four' banks have dismissed the possibility of a rate cut next year. Source: SBS News Westpac, which previously forecast one rate cut in 2026, is the last major bank to rule out the possibility, forecasting, along with ANZ, that rates will remain unchanged.\n\n\n\n\n\nAfter the RBA meeting in December, when rates were left unchanged, governor Michele Bullock also warned about a possible hike next year.\n\n\n\n\n\n\"[Bullock] was putting Australian borrowers on notice, particularly those with a variable mortgage, that their mortgage rates and their monthly repayments could potentially be on the way up rather than on the way down in 2026,\" Tindall said.\n\n\n\n'Renewed' cost of living crisis\n\nBullock's announcement came as many banks and economists expected further rate cuts before the surprise inflation number, which was released in late November.\n\n\n\n\n\nAustralian Bureau of Statistics data showed inflation across the 12 months to October jumped 3.8 per cent, up from 3.6 per cent in September.\n\n\n\n\n\nMortgage holders may have been negatively affected by the element of surprise.\n\n\n\n\n\nAMP chief economist Shane Oliver told SBS News: \"People with mortgages were feeling more optimistic about things because they'd seen three rate cuts and there were expectations for more.\"\n\n\n\nBut now mortgage holders will be feeling pessimistic, he said.\n\n\n\n\n\nSince 2022, interest rates have increased 13 times, while there have only been three rate cuts, leading to larger mortgages for homeowners.\n\n\n\n\n\n\"Mortgage these days is, in many cases, the biggest component in a household budget,\" Oliver said.\n\n\n\n\n\n\"If the interest rates start going back up again, then they can have a big dampening impact on spending and lead to renewed talk about a cost of living crisis.\n\n\n\n\n\n\"As interest rates go up, you would feel your cost of living rising again.\"\n\n\n\nPaying more in the supermarkets\n\nBut mortgage holders will not be the only group that might be impacted with experts warn a potential rise in interest rates could affect consumer goods.\n\n\n\n\n\nAndrew Grant, an associate professor of finance at the University of Sydney Business School, suggests higher inflation may lead to a cycle of rising interest rates, forcing businesses to pass those costs on to consumers.\n\n\n\n\n\n\"The real question is around the degree to which this happens,\" he told SBS News.\n\n\n\n\"For people who are just not worried about the cost of housing, whether they own their house already or they're not intending to participate in the rental market, it will just mean that probably the inflation is gonna flow through to the cost of everyday items,\" Grant said.\n\n\n\n\n\n\"Rents go up for business owners, and they'll have to charge more for customers, as they need to overcome the cost of living themselves.\"\n\n\n\n\n\nHe said this pattern might impact \"a large proportion of the population that are living pay cheque to pay cheque\".\n\n\n\n\n\n\"Increasing interest rates or increasing inflation might mean that they're paying a little bit more at the supermarket each week, they're paying a little bit more for their electricity and energy bills, and other utilities,\" Grant said.\n\n\n\nCost pressures push more Australians into hardship\n\nFinder's Cost of Living Pressure Gauge — which tracks the financial burden on Australian households monthly — shows a significant jump in financial stress from 57 per cent in October 2019 to 77 per cent in October 2025.\n\n\n\nA June report from Anglicare Australia also paints a stark picture of how little is left after basic expenses for some workers. A full-time minimum wage worker has just $33 remaining after paying for rent, food and transport, according to the report. A single parent on the minimum wage is left with just $1, even with government assistance, while a household with two full-time workers and two children has only $5 left each week.\n\n\n\n\n\nKasy Chambers, executive director of Anglicare Australia, said any increase in the cost of living will \"affect people on the lowest incomes\".\n\n\n\n\n\n\"We are basically seeing poverty climbing the income ladder ... And that's the difficulty that we're seeing, and that's what we'll see more of,\" she told SBS News.\n\n\n\n\n\n\"I think we'll be seeing this get worse for more families before we see it get better, because the only thing we can really rely on to make a big difference is housing costs, and they don't seem to be going anywhere quickly.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/video/school-leavers-across-the-country-receive-atar-results/gvssqdtor",
    "title": "School leavers across the country receive ATAR results",
    "publish_date": "Thu, 18 Dec 2025 08:19:57 +0000",
    "category": "finance",
    "authors": [],
    "text": "School leavers across the country receive ATAR results\n\nPublished 18 December 2025, 7:07 am\n\nAround 160,000 Year 12 students across the country have received their Australian Tertiary Admission Rank or ATAR. School leavers in Queensland, New South Wales and the Australian Capital Territory were the first to view their rank, the final milestone after 13 years of schooling.",
    "source": "SBS",
    "cluster_id": 4
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/environmental-laws-not-settled-yet/bji0tvg2m",
    "title": "Environmental laws not settled yet",
    "publish_date": "Thu, 18 Dec 2025 07:25:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe last week of parliament delivered the first major overhaul of Australia's environment laws in over two decades - but stakeholders like Innes Willox say the work has just begun.\n\n\n\n\n\n\"This is a lot like a drawing, where we've got the outline, and now we need to fill in the colours.\"\n\n\n\n\n\nHe's the CEO of the Australian Industry Group.\n\n\n\n\n\n\"We're at that point where we now do have an outline, we have a structure, a road map of where to go from here.\"\n\n\n\n\n\nThat new structure includes Australia's first National Environment Protection Agency, and a new body called Environment Information Australia, responsible for collecting and sharing data.\n\n\n\n\n\n\"But there is an enormous amount of detail that has to be worked through and the old saying is always that the devil is in the detail.\"\n\n\n\n\n\nThe detail includes a set of regulations known as National Environmental Standards.\n\n\n\n\n\nEnvironmental Justice Australia CEO Nicola Rivers says they'll be the key test for the practical impact Australia's new laws will have on the ground.\n\n\n\n\n\n\"When we're talking about national environmental standards, we're talking about a universal set of rules that set minimum expectations for decisions affecting nature and the environment in Australia. So they're intended to be a clear line in the sand that says anything below this isn't good enough.\"\n\n\n\n\n\nLis Ashby spent 15 years working within state and federal governments on biodiversity policy and regulation.\n\n\n\n\n\nShe's now the Biodiversity and Innovation Lead at the Biodiversity Council, which brings together experts from 11 universities.\n\n\n\n\n\nMs Ashby says the legally-enforcable standards are designed to provide the clarity conservation groups and business groups have been calling for.\n\n\n\n\n\n\"So if you are a developer or a proponent who's going to have a large impact on biodiversity, a really clear standard might make you go, 'oh, it's not worth my time preparing an application or buying this property to develop it because the biodiversity impact is so significant that I know that it's going to be rejected.\"\n\n\n\n\n\nNational Environmental Standards were the cornerstone of Professor Graeme Samuel's review into the omnibus Environmental Protection and Biodiversity Conservation (or EPBC) Act.\n\n\n\n\n\nThis landmark review formed the blueprint for the reforms, which aim to protect nature while speeding up project approvals, partly by reducing duplication between jurisdictions.\n\n\n\n\n\nDraft documents outlining two of five promised standards have now been published.\n\n\n\n\n\nInnes Willox says the Australian Industry group is happy with where the conversation is headed.\n\n\n\n\n\n\"Well, the first two standards we've seen, the drafts are looking directionally okay. There is more to come. There'll be the subject of further consultation among different groups and interest groups. As we work through the process. We don't think this is easy or straightforward.\"\n\n\n\n\n\nHe's right. Environmental groups have raised concerns with the draft standard that covers Matters of National Environmental Significance - like threatened species and ecological communities.\n\n\n\n\n\nProfessor Brendan Wintle is an ecologist with the University of Melbourne Biodiversity Institute, and a lead councillor with the Biodiversity Council.\n\n\n\n\n\n\"So one of the things that was suggested or recommended through the decadal review of the EPBC Act is that we actually have outcomes based standards, and that we require environment-related outcomes, and those need to be measurable outcomes.\"\n\n\n\n\n\nHe says the draft standard for Matters of National Environmental Significance - which include things like threatened species and world heritage properties - are too subjective.\n\n\n\n\n\n\"At the moment, the wording under the draft standards for MNES, for example, says things like 'provide for the protection and conservation' or 'contribute to the enhancement of a matter' - you know, habitat for a threatened species, for example - but you can provide a way, you can contribute all sorts of things and never actually improve the outcome for the species or for the ecosystem.\"\n\n\n\n\n\nProfessor Wintle says the wording needs to be clearer and more quantitative.\n\n\n\n\n\n\"I mean, these are incredibly vague concepts. We can do much better than that.\" TEE: \"Give me some examples of how you quantify that and make it tight.\" WINTLE: \"Yeah. So we would say if you are reducing the abundance of a threatened or critically endangered species, if you are reducing the area of a threatened ecological community, if you are degrading the condition of a threatened ecological community - and these things we can measure. They're areas of habitat, they're areas of ecological community, they're numbers of animals, there's areas of habitats for those critically endangered animals, and we can set thresholds on what's an unacceptable loss, and then we can measure whether or not you've achieved a positive outcome in the area and condition of those matters.\"\n\n\n\n\n\nMany conservationists worry the new laws leave too much to the discretion of the environment minister, who ultimately determines whether a project gets approved.\n\n\n\n\n\nANU ecologist Davide Lindenmayer says he's doing work with the government to support the new standards, but he's deeply concerned they won't be effective.\n\n\n\n\n\n\"It's not clear to me what a national environmental standard actually will be because we are dealing with very diverse systems in Australia, often with many endangered species and threatened species, and often the process of logging has multiple threats associated with it. For example, when we log a forest, we make it more flammable and that means that animals and plants are threatened not only by the logging itself, but also by the extra fire risk.\"\n\n\n\n\n\nInnes Willox says that business, on the other hand, doesn't want the laws to be too prescriptive.\n\n\n\n\n\n\"There will always be those who want rigidity as it were, and others who want a little bit of flexibility. I think from business's perspective, we have to understand that each scenario or each case where this law is going to be applied will be different. There will be some very clear obvious cases around what is and isn't permissible, but there's always in this going to be some shades of grey and we would caution against being too prescriptive because each case is different and each scenario is different.\"\n\n\n\n\n\nAustralian Climate and Biodiversity Foundation Executive Director Lyndon Schneiders accepts there are limits to how prescriptive the test in the standard can be.\n\n\n\n\n\nBut he believes the compromise Labor and the Greens reached to pass the laws also elevated important elements beyond the status of regulations.\n\n\n\n\n\n\"Some of the key concepts have now been hardwired into the legislation itself. Probably one of the most important is this idea around unacceptable impacts of development on the MNES, and that has now been put in the primary legislation.\"\n\n\n\n\n\nThe definition of 'unacceptable' has been criticised as overly ambiguous from both sides - which Environment Minister Murray Watt argues means the government got it right.\n\n\n\n\n\nEnvironment groups have also raised concerns there are loopholes in the offset standard - which provides a pathway to compensate for damage that can't be avoided.\n\n\n\n\n\nStandards for information and data, First Nations engagement and community consultation will be put out for consultation once they've been developed.\n\n\n\n\n\nLyndon Schneiders says the real work starts now.\n\n\n\n\n\n\"We've got a new framework, we've got the resources in place, we've got the institutions in place, we've got a new rule set, but the real work is now going to be translating that into concrete action, and that's ahead of everyone over the next 18 months 24 months as we set up a system that's going to work.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/optus-triple-zero-failures/hhrjaifgb",
    "title": "Optus failed to act on early warning signs during triple-zero outage, review finds",
    "publish_date": "Thu, 18 Dec 2025 07:10:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "Optus failed to act on initial warning signs during a triple-zero outage linked to two deaths, according to a review which has raised broader questions about the emergency phone service .\n\n\n\n\n\nThe 14-hour outage during a network upgrade in September hit South Australia, Western Australia, the Northern Territory and parts of far-west NSW.\n\n\n\n\n\nOf 605 emergency calls in that time, 455 failed to connect.\n\n\n\n\n\nAn independent review, released by Optus on Thursday, found there were at least 10 mistakes by the company and its contractor Nokia during the upgrade.\n\n\n\n\n\nIt took Optus and Nokia 13 hours to understand the problem, with an Optus call centre not escalating early concerns from five people who said their triple-zero calls weren't working.\n\n\n\nREAD MORE Optus says vandals cutting fibre behind latest major outage\n\nOptus and Nokia also \"astoundingly\" attributed early alerts about the problem at a networks operations centre to the fact upgrades were happening, the report by experienced executive Kerry Schott said.\n\n\n\n\n\nOnce Optus was aware of the issue it was fixed within minutes.\n\n\n\n\n\n\"The real tragedy here was the duration of the triple-zero call outage and the failure of Optus and its contractors to deal immediately with the warning signals they received,\" Schott said.\n\n\n\n\n\nThe origin of the outage was a failure to divert voice calls, including emergency calls, before closing a gateway at an exchange station in South Australia.\n\n\n\n\n\nThe first of the 10 mistakes was incorrect instructions being sent to Nokia about the upgrade process, the report said.\n\n\n\nREAD MORE Optus executives step down as triple-zero disaster fallout continues\n\nThe mistakes could only be explained by a lack of care and lack of adherence to procedure, Schott said.\n\n\n\n\n\nOptus has pledged to swiftly implement all 21 recommendations of the report, including for better processes around upgrades and addressing the siloed nature of work at the company.\n\n\n\n\n\nThe telco's chairman, John Arthur, said the failures were unacceptable and the board was taking further action against individuals, including financial penalties and potentially sackings.\n\n\n\n\n\n\"We are deeply sorry for the 18 September outage that impacted triple-zero services and the consequences for any Australians who were trying to reach emergency services,\" he said.\n\n\n\n\n\nSchott said it was puzzling only 66 callers were able to \"camp-on\" — a process where emergency calls are redirected through another network.\n\n\n\nLISTEN TO Optus pays six-figure fine for breaking anti-scam rules SBS News 00:50 English\n\nSome devices took 40-60 seconds to be redirected to another network.\n\n\n\n\n\n\"In an emergency, people are unlikely to hang on for this length of time, especially when the only response they are getting is silence on the line,\" Schott said.\n\n\n\n\n\n\"This delay is something that customers at all telecommunications companies should be informed about.\"\n\n\n\n\n\nStandards and requirements for devices and carriers to ensure emergency calls are successful may not have kept up with technological changes, she said.\n\n\n\nPolitical response\n\nThe Greens have called for a government review into camp-on provisions and a review of Optus' licence and licence conditions.\n\n\n\n\n\nThe federal government has helped establish the National Telecom Resilience Centre, which tests emergency calling scenarios, including camp-on.\n\n\n\n\n\nThe outage was unacceptable and the nation's independent communications regulator was continuing its investigation, a spokesman for Communications Minister Anika Wells said.\n\n\n\n\n\n\"Access to triple zero is one of the most critical requirements for mobile carriers and work is continuing to improve the system's resilience.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/woodsides-ceo-leaves-for-bp/dzd8ihoe9",
    "title": "Woodside's CEO leaves for BP",
    "publish_date": "Thu, 18 Dec 2025 06:47:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/terror-at-bondi-fragile-hope-in-ukraine-trumps-wmd-gamble/a0o28s6su",
    "title": "Terror at Bondi, Fragile Hope in Ukraine & Trump’s ‘WMD’ Gamble",
    "publish_date": "Thu, 18 Dec 2025 06:38:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/the-ashes-2025-live-stokes-england-bat-on-day-three-as-australia-chase-early-wickets-after-more-snicko-dramas-20251219-p5noyg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Ashes 2025 LIVE: ‘Big mistake’: Weatherald misses out on reprieve after choosing not to challenge lbw",
    "publish_date": "Fri, 19 Dec 2025 13:10:08 +1100",
    "category": "sports",
    "authors": [
      "Roy Ward",
      "Tom Decent",
      "Dan Walsh",
      "Daniel Brettig"
    ],
    "text": "Devon Conway reached a double century for the first time since his first test innings four years ago, leading New Zealand to 424-3 at lunch Friday on the second day of the third test against the West Indies.\n\nNew Zealand lost the nightwatchman Jacob Duffy (17) and an out-of-sorts Kane Williamson (31) in the first session but Conway was immovable and reached 224 not out by lunch. Rachin Ravindra was 4 not out.\n\nNew Zealand’s Devon Conway. Credit: Getty Images\n\nNew Zealand leads the three-match series 1-0 after the first test was drawn and the Black Caps won the second by nine wickets.\n\nConway resumed at 178 after batting through all of the first day on which he shared a 323-run opening partnership with Tom Latham who made 137.\n\nHe reached his double century after more than seven hours at the crease, from 316 balls and with 28 fours.\n\nConway made a double century in the first innings of his first test against England in June 2021, immediately after qualifying to play for New Zealand on residential grounds. That remained his highest score through 58 innings until he finally surpassed it on Friday.\n\nDevon Conway and Rachin Ravindra of New Zealand avoid a bird during day two. Credit: Getty Images\n\nNew Zealand was 334-1 when the second day began, with Duffy 9 not out. Duffy hit two early boundaries before being caught by wicketkeeper Tevin Imlach off Jayden Seales when the total was 350.\n\nThat brought out Williamson who was padded up for all of the first day and in total for 93.5 overs, waiting for his turn to bat. When it came, he was rusty at times, playing and missing and battling timing issues early in his innings. But he survived 60 balls and hit five boundaries in his 31 until he was out driving at a ball on a tempting length which just moved away and flicked the outside edge.\n\nConway also had trouble at times against a depleted West Indies attack. Kemar Roach is out of action at least for the rest of the second day with a hamstring issue.\n\nConway was dropped on 206 by Kavem Hodge at short cover off Roston Chase and took chances at times by leaving on length balls which passed close to or over his off stumps. Still, New Zealand’s total passed 400 in 111 overs.\n\nConway spoke to media after stumps on the first day after the difficult task of opening the batting, especially in New Zealand.\n\nOpening “is a very underappreciated job around the world, not just here,” Conway said. “Yeah, it has been a tough ride. Quite often you rock up day one of a test match and you see it’s pretty green.\n\n“Already mentally you think, well, it’s going to do bits here on this pitch. I think a lot of credit needs to go to a guy like Tom Latham, who’s played 90-odd tests and has done so well.”\n\nA short time ago New Zealand were 5-485.\n\nAP",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/business/companies/tiktok-signs-deal-to-sell-us-unit-to-group-led-by-trump-s-billionaire-friend-20251219-p5nozv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The ‘secret sauce’ in TikTok’s US deal led by Trump’s billionaire friend",
    "publish_date": "Fri, 19 Dec 2025 12:54:14 +1100",
    "category": "finance",
    "authors": [
      "Barbara Ortutay"
    ],
    "text": "TikTok has signed agreements with three major investors — Oracle, Silver Lake and MGX — to form a new TikTok US joint venture, ensuring the popular social video platform can continue operating in the United States.\n\nThe deal is expected to close on January 22, according to an internal memo seen by The Associated Press. In the communication, CEO Shou Zi Chew confirmed to employees that ByteDance and TikTok signed the binding agreements with the consortium.\n\nOutspoken Oracle co-founder Larry Ellison is a close confidante of Donald Trump. Credit: AP\n\n“I want to take this opportunity to thank you for your continued dedication and tireless work. Your efforts keep us operating at the highest level and will ensure that TikTok continues to grow and thrive in the US and around the world,” Chew wrote in the memo to employees.\n\n“With these agreements in place, our focus must stay where it’s always been—firmly on delivering for our users, creators, businesses and the global TikTok community.”",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/national/queensland/ban-on-kids-gender-care-in-queensland-public-hospitals-extended-20251219-p5nozf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ban on kids’ gender care in Queensland public hospitals extended",
    "publish_date": "Fri, 19 Dec 2025 12:53:28 +1100",
    "category": "lifestyle",
    "authors": [
      "Matt Dennien",
      "Courtney Kruk"
    ],
    "text": "Queensland’s ban on gender-affirming care for transgender children will continue until at least 2031, the state government announced, as it prepares to release a long-awaited review into public hospital gender services.\n\nThe Crisafulli government called an immediate halt to hormone treatments for children under 18 delivered through public hospitals in January, and ordered an independent clinical review of all services to be conducted by Victoria’s former chief psychiatrist Professor Ruth Vine.\n\nHealth Minister Tim Nicholls said on Friday the pause on stage one and two hormone therapies would continue until the end of the United Kingdom’s Pathways trial in 2031.\n\nQueensland Health Minister Tim Nicholls speaks to media outside state parliament. Credit: Matt Dennien\n\nStage one therapies refers to the use of puberty blockers, medications that temporarily stop a young person’s body developing physical characteristics. Stage two therapies include hormone replacement therapy (HRT) such as estrogen or testosterone.",
    "source": "TheAge",
    "cluster_id": 10
  },
  {
    "url": "https://www.theage.com.au/lifestyle/crown-duels-is-queen-mary-the-a-role-model-for-kate-the-princess-of-wales-20251219-p5np1w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Crown Duels: Is Queen Mary the a role model for Kate, the Princess of Wales?",
    "publish_date": "Fri, 19 Dec 2025 12:53:09 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Crown Duels: Is Queen Mary the a role model for Kate, the Princess of Wales?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/lifestyle/crown-duels-the-comparisons-between-queen-mary-and-the-princess-of-wales-20251219-p5np1x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Crown Duels: The comparisons between Queen Mary and the Princess of Wales",
    "publish_date": "Fri, 19 Dec 2025 12:52:15 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Crown Duels: The comparisons between Queen Mary and the Princess of Wales\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/starc-jaffa-knocks-stokes-over-20251219-p5np1p.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Starc jaffa knocks Stokes over",
    "publish_date": "Fri, 19 Dec 2025 12:42:06 +1100",
    "category": "finance",
    "authors": [],
    "text": "Starc jaffa knocks Stokes over\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/weatherald-refuses-review-in-huge-mistake-20251219-p5np1q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Weatherald refuses review in huge mistake",
    "publish_date": "Fri, 19 Dec 2025 12:42:04 +1100",
    "category": "finance",
    "authors": [],
    "text": "Weatherald refuses review in huge mistake\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/superquiz-friday-december-19-20251218-p5noqb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Superquiz, Friday, December 19",
    "publish_date": "Fri, 19 Dec 2025 12:41:52 +1100",
    "category": "finance",
    "authors": [],
    "text": "By Andrew Brooks\n\nTry our new Mini Crossword\n\nTen clues. Twenty-five squares. How quickly can you solve this bite-sized puzzle? Track your win streaks and challenge family and friends by sharing your results.\n\nPremium subscribers to The Age can play the Mini Crossword (and all our puzzles, including Target Time) here and premium subscribers to The Sydney Morning Herald can play them here.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/the-noodles-are-all-made-by-hand-at-this-indonesian-eatery-in-melbourne-s-southeast-20251219-p5np1c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The noodles are all made by hand at this Indonesian eatery in Melbourne’s southeast",
    "publish_date": "Fri, 19 Dec 2025 12:29:00 +1100",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nPBK Noodles owner Michael Samsir has honed his craft, making dishes from scratch at the Clayton eatery.\n\n1 / 7 PBK Noodles owner Michael Samsir makes Indonesian-style noodles by hand. Joe Armao 2 / 7 PBK Noodles in Clayton serves up specialty coffee and handmade noodles. Joe Armao 3 / 7 A generous bowl of mie medan at PBK Noodles. Joe Armao. 4 / 7 Upside down coffee. Joe Armao 5 / 7 Noodles are all made by hand. Joe Armao 6 / 7 Shoestring noodle with chicken and mushroom. Joe Armao 7 / 7 Fried wontons. Joe Armao Previous Slide Next Slide\n\nIndonesian$$$$\n\nThere’s so much to love at this daytime spot. Owner Michael Samsir imports coffee from Aceh and roasts it for his Indonesian special brews. The upside-down coffee that you drink by blowing it with a straw has to be seen to be believed. Then there are the noodles, made out the back to various thicknesses and served with house-made broth and wontons. PBK can just be lunch, but it can also be a connoisseur’s paradise.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/business/companies/macquarie-cops-35m-fine-for-misleading-conduct-on-millions-of-short-sales-20251219-p5noz5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Macquarie cops $35m fine for misleading conduct on millions of short sales",
    "publish_date": "Fri, 19 Dec 2025 12:26:06 +1100",
    "category": "finance",
    "authors": [
      "Colin Kruger",
      "Dominic Powell"
    ],
    "text": "Macquarie Group has agreed to a $35 million fine after reaching a settlement with the corporate watchdog over misleading conduct relating to its failure to properly report at least 73 million short sales over 15 years.\n\nThe settlement with the Australian Securities and Investments Commission (ASIC) relates to legal action commenced in May this year and is still subject to court approval. Macquarie admits to multiple systems failures, many of which remained undetected for more than a decade.\n\nMacquarie chairman Glenn Stevens, and chief executive Shemara Wikramanayake.\n\nThey include its failure to correctly report at least 73 million short sales between December 11, 2009, and February 14, 2024. ASIC said it is estimated that the group misreported as many as 1.5 billion short sales.\n\n“Accurate and reliable data underpins confidence in our financial markets. ASIC and the market rely on short sale and regulatory reporting data – especially during periods of volatility – to understand market activity and make informed decisions,” ASIC chairman Joe Longo, said.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/bondi-hero-ahmed-al-ahmed-speaks-from-his-hospital-bed-20251219-p5np03.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bondi hero Ahmed al Ahmed speaks from his hospital bed",
    "publish_date": "Fri, 19 Dec 2025 12:07:15 +1100",
    "category": "finance",
    "authors": [],
    "text": "Bondi hero Ahmed al Ahmed speaks from his hospital bed\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/snicko-is-used-in-the-ashes-but-ultraedge-in-the-bbl-the-quirks-of-cricket-technology-explained-20251219-p5noym.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Snicko is used in the Ashes, but UltraEdge in the BBL. The quirks of cricket technology explained",
    "publish_date": "Fri, 19 Dec 2025 12:02:38 +1100",
    "category": "sports",
    "authors": [
      "Andrew Wu"
    ],
    "text": "Cricket can be a difficult game to explain to those not familiar with the quirks of the sport. The explanation for the use of technology is not straightforward, either.\n\nMany of the one million-plus viewers who settled in to watch the Big Bash League after the Ashes on Thursday may be wondering why there is different technology used for the Tests in this country and for Cricket Australia’s Twenty20 competition.\n\nRealtime Snicko has become a well-known component of Test match decision-making. Credit: Twitter\n\nPlayers have lost faith in Snicko after it returned controversial decisions during the Adelaide Test, but UltraEdge is being used for a lower level of cricket despite being considered by some experts, including Ricky Ponting, to be the superior technology.\n\nEven to seasoned cricket viewers, it seemed an additional absurdity in the technology debate that has exploded during this Ashes summer.",
    "source": "TheAge",
    "cluster_id": 27
  }
]