[
  {
    "url": "https://www.9news.com.au/national/bondi-shooting-memorial-to-be-cleared-after-national-day-of-mourning/35023698-6b5e-4304-8a89-e1942734ea7c",
    "title": "Bondi tributes to be cleared to make way for permanent vigil",
    "publish_date": "Sat, 20 Dec 2025 19:14:43 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "Last night was no different – on the eve of the\n\nNational Day of Reflection\n\n, hundreds gathered, turning on their phone lights to shine brightness during the dark time.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/queensland-communitys-only-childcare-centre-set-to-close/702688eb-c9ae-4402-9633-bdca6800125b",
    "title": "Queensland community's plea as only childcare centre to close",
    "publish_date": "Sat, 20 Dec 2025 08:20:06 +0000",
    "category": "finance",
    "authors": [
      "Dec"
    ],
    "text": "A regional Queensland community is calling for a lifeline with its only childcare centre set to close at the end of the year.\n\nYoung families in Quilpie are calling for an experienced operator to step in to prevent essential workers from leaving the region after the centre abruptly decided to close its doors on December 31.\n\nThe regional town, located 1000 kilometres west of Brisbane, has a population just shy of 1000 people.\n\nREAD MORE: Official Christmas Day forecast revealed\n\nYoung families in Quilpie are calling for an experienced operator to step in to prevent essential workers from leaving the region. (9News)\n\nMother-of-four and the local hospital's director of nursing Jenna Nunn is among those who are stranded with no daycare options.\n\n\"I've got a one-year-old, so I'm returning to work in January,\" Nunn said.\n\n\"It is so heartbreaking, it is just mind boggling that they've pulled out, what do we do now?\"\n\nCouncil and the community were caught off guard when privately-owned operator Mulga Mates only notified them this month.\n\n\"They were just highlighting that they were having staff retention issues,\" Quilpie Shire Council mayor Ben Hall said.\n\n\"It isn't a council-run facility, so we are at arm's length from it, so it came as a surprise to us.\"\n\nREAD MORE: Lifesavers hold silent vigil at Bondi Beach to honour victims of terror attack ﻿\n\nThe regional town, located 1000 kilometres west of Brisbane, has a population just shy of 1000 people. (9News)\n\nThe announcement has sparked fears the closure could trigger an exodus of essential workers from the regional town, a situation which Nunn said would be \"catastrophic\".﻿\n\n\"I was talking to one mum the other day, had to go back to work for three months and now she's had to stop working because there's no daycare options,\" she said.\n\nHall estimates that 42 per cent of the community's workforce is made up of working women.\n\n\"If we take 42 per cent of those people out of our workforce, it's going to be devastating,\" he said.\n\nMums in the community want a city lifeline if a new provider can't be sourced.\n\nThe Department of Education will explore introducing a state-delivered kindergarten program.\n\nREAD MORE: Cancer drug set to be added to Pharmaceutical Benefits Scheme ﻿\n\nMother-of-four and the local hospital's director of nursing Jenna Nunn is among those who are stranded with no daycare options. (9News)\n\nThe process to find a new childcare provider to take over the existing licence is underway.\n\n\"There have been a few providers contacted, to date we have no takers,\" Hall said.﻿\n\n\"We anticipate this may take upwards of 90 days to actually get resolved.\"\n\nThe small community is now sending out an urgent SOS.\n\n\"I'm begging someone to please come forward and help us out,\" Nunn said.\n\n﻿\"Please reach out to the council, we will roll out the red carpet to help in any way we can,\" Hall said.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/nathan-lyon-out-of-ashes-third-test-adelaide-oval/106167622",
    "title": "Nathan Lyon out of third Test after injuring hamstring",
    "publish_date": "Sun, 21 Dec 2025 02:05:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "Nathan Lyon has left the field with an apparent right hamstring injury on the fifth day of the third Ashes Test in Adelaide.\n\nLyon, 38, chased down a ball and dived to save a ball on the boundary and pulled up short, feeling at his right leg before stepping off the ground.\n\nCricket Australia said the spinner has been sent for scans to ascertain the extent of the injury and he would play no further part in the Test.\n\n\"It's a big one with the Ashes,\" Darren Lehmann said on ABC Sport.\n\n\"Big, I mean it's huge coming into the rest of the series. Now the result [here] becomes even bigger.\"\n\nHe is unlikely to bowl again in the match and, with just five days before Boxing Day, could be a doubt for the fourth Test in Melbourne, too.\n\nAfter bowling just two overs in the opening Test in Perth and being left out in Brisbane, Lyon had been given plenty of work in Adelaide.\n\nHe bowled 28 overs, with 2-70 in the first innings, and had got through 25 overs in the second innings, taking 3-77.\n\nNathan Lyon was operating for most of the morning until he was hurt while fielding. (Getty Images: Santanu Banik/MB Media)\n\nLyon suffered an injury to his right calf that ended his series in the 2023 Ashes at Lord's.\n\nIt was his three-wicket burst on day four that put England on the brink of defeat, accounting for Harry Brook, Ben Stokes and Zak Crawley in the space of 20 balls.\n\nHe had gone wicketless in seven overs on the fifth day with 0-13 as England pair Jamie Smith and Will Jacks edged towards the most unlikely of victories.\n\nLyon's injury added to a list of potential issues facing the Aussies as the English edged their way towards the nominal target of 435, which would be the highest successful run chase in history.\n\nLyon dove in the field and got up clutching at his right hamstring. (Getty Images: Gareth Copley)\n\nMitch Starc received two warnings for running on the pitch on day four. If he is warned again, he will be removed from the attack and unable to bowl.\n\nThere are questions over the fitness of returning skipper Pat Cummins too as he recovers from a back injury.\n\nBut the skipper did take the new ball alongside Starc, assisting in claiming the valuable scalp of Smith.\n\nThe wicketkeeper departed after a dastardly swipe across the line off Starc, with Cummins catching him at wide mid on.\n\nIf Lyon is unable to play in Melbourne, his spot could be filled by Victorian off spinner Todd Murphy.\n\nHe took 2-7 and 1-57 against England Lions at Allan Border Field and has taken 10 wickets at 23.70 in his four Shield matches this season.\n\nOther options include Western Australian offy Corey Rocchiccioli, who has taken 20 at 28.20 in his six Shield matches this year, or Queensland legspinner Mitch Swepson (21 wickets at 36.04 this season).\n\nTravis Head has bowled 12 overs, 0-45 with his part-time spin bowling in the second innings, while Marnus Labuschagne also bowled a single over of leg spin on Sunday.\n\nIt was arguably the loss of Lyon that helped England launch its recovery in the 2023 series, going from 2-0 down to salvaging a 2-2 draw on home soil.\n\nLyon, who passed Glenn McGrath in this third Test as Australia's second-top wicket taker, made his Test debut against Sri Lanka in 2011, in a team captained by Michael Clarke.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/indra-brown-claims-world-cup-silver-in-freeski-halfpipe/106167810",
    "title": "Teen sensation Indra Brown claims historic silver in freeski halfpipe",
    "publish_date": "Sun, 21 Dec 2025 01:28:47 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian teenage sensation Indra Brown has secured back-to-back freeski halfpipe medals in her World Cup debut.\n\nAfter claiming bronze last week in China, the 15-year-old went one better in the US, taking home silver at Copper Mountain in an impressive performance.\n\nThe youngest Australian to ever score a podium finish at a winter sports World Cup, Brown crashed on her second run while trying a new trick, after putting up a strong 80-point run on her opener.\n\nBrown's podium run included a leftside 900, rightside 900, leftside 720, switch rightside 540, switch leftside 720, and finished with an alley-oop, with grabs in all but one jump.\n\nBrown in action during the women's freeski halfpipe final. (Getty Images: Sean M. Haffey)\n\nGreat Britain's Zoe Atkin won gold with 89.25 points, while China's Kexin Chang claimed bronze on 77.50 points.\n\nBrown now sits second in the World Cup standings with 140 points, trailing Atkin (180) and ahead of Chang (105).\n\nHer next event will be the Calgary World Cup on January 3.\n\nThe Melbourne-based teen has appeared as a dark horse to medal at the Winter Olympics, which begins in February.\n\nBrown spent five years in Canada as a child, where she picked up skiing.\n\n\"That was the thing all winter, seven months long. The only thing you really could do is go up to your local ski hill and join a club or just ski around with your family,\" she said last week.\n\n\"I joined a local ski hill club [in Canada], and they would do some mountains, some park, and when I started getting into the terrain park, the halfpipe, I realised how much I enjoyed it, how much I excelled at a young age, and I just went from there.\"",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/nt-government-defunds-puberty-blockers-gender-affirming-hormones/106167676",
    "title": "NT government pulls funding for puberty blockers, hormones for children",
    "publish_date": "Sun, 21 Dec 2025 01:28:31 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Children in the Northern Territory will no longer have access to publicly-funded puberty blockers or gender-affirming hormones after Health Minister Steve Edgington announced the government would follow Queensland's lead in suspending the treatments.\n\nIn a statement released on Sunday, Mr Edgington said that — along with Queensland — the NT's government's new policy was consistent with jurisdictions such as New Zealand and some European countries.\n\nHe said the changes would affect \"a handful of young teenagers\" who had been accessing the treatments through the NT's public health system.\n\nQueensland pause on puberty blockers for trans teenagers to continue The Queensland government says it made the decision after considering a 530-page independent review into the evidence surrounding the treatments.\n\n\"Territory kids deserve to grow up free from these dangerous, ideologically-driven practices with irreversible consequences,\" he said.\n\n\"The Territory's public health focus will remain on adolescent mental health services.\"\n\nThe move follows pressure from the Australian Christian Lobby, which presented a petition to the government in October 2024, calling on it to \"suspend all medical and surgical transitioning for children in the NT\".\n\nIn a letter in response to the petition tabled in parliament in April, Mr Edgington said NT Health did not provide surgical treatments for young people with gender dysphoria.\n\n\"NT Health provides evidence based clinical and support services and care in line with the policy and the Australian Standards of Care and Treatment Guidelines for Trans and Gender Diverse Children and Adolescents,\" he wrote at the time.\n\n\"NT Health provides a specialised adolescent gender clinic for young people up to 18 years of age.\"\n\nTop End Pride committee member Bhushan Joshi was among those to sign the statement against suspending adolescent gender treatments. (ABC News: Lillian Rangiah)\n\nIn a joint statement in response to the 2024 petition, transgender advocates — including Top End Pride — said being trans or gender diverse \"does not represent a mental health condition\".\n\n\"There is powerful evidence that gender affirming support, including affirming medical care, when required, protects the mental and physical wellbeing of transgender, gender diverse, and non-binary individuals,\" they said.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/orange-100-agnes-water-museum/106158496",
    "title": "Taking the pith? Locals claim ancient orange is 100 years old",
    "publish_date": "Sun, 21 Dec 2025 00:30:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "Daryl Jones will look you dead in the eye and tell you this orange is old enough to get a letter from King Charles III.\n\n\"It's hanging in there,\" said the treasurer of Agnes Water Museum.\n\n\" It's a little shrunken and a little grey like we all get when we get old. \"\n\nHe says the orange encased in glass inside the volunteer-run museum is 100 years old.\n\n\"Most people say, 'No way,'\" he said.\n\nThe geriatric orange is proudly displayed at the front of the museum. (ABC Capricornia: Jasmine Hines)\n\nAs far as Mr Jones is concerned, the citrus has not been carbon dated, examined by experts or even weighed.\n\nBut it is accompanied by a type-written label apparently dating it to 1925.\n\nAgnes Water Museum treasurer Daryl Jones says the orange has stirred up some interest in the community. (ABC Capricornia: Nandini Dhir)\n\nMr Jones said the fruit had been kept in a cabinet for years, before staff decided to commemorate its centenary in March with a birthday party, cards and gift boxes.\n\n\" We had a party for it, we dressed it up and we had a barbecue. \"\n\nHe said it was understood the fruit originally belonged to a man named Arthur Jeffery.\n\nArthur Jeffery (right) with his brother Tom. (Supplied: Sue Stirrat)\n\nMr Jones said Mr Jeffery was known for his passion for collecting and habit of walking barefoot around Agnes Water in the early days of the township.\n\nHe said he amassed \"all sorts of things\" that made their way into the museum's initial collection, which he started, in 1952.\n\n\"He collected things off the beach and out of the bush, things he thought were interesting,\" Mr Jones said.\n\n\"… he must have decided [with] the orange, maybe it had started aging and he wanted to see how it went,\" Mr Jones said.\n\nFran Connolley's poem dedicated to the orange, made with the help of AI technology. (ABC Capricornia: Jasmine Hines)\n\nAlongside the orange the museum has a range of items linked to shipwrecks and relating to Captain James Cook, who made his first landing in Queensland nearby in 1770.\n\nA potential clue about the orange's provenance was that Mr Jeffery's brother Tom was a grazier, who had citrus trees on properties in Agnes Water and nearby in Miriam Vale.\n\nHowever, Mr Jones said it was not clear where the orange came from.\n\nThe geriatric orange is one of many historical pieces in the museum. (ABC Capricornia: Jasmine Hines)\n\nMummification questions\n\nThe orange's age is at least theoretically possible, according to food preservation expert Elisabeth Prabawati.\n\nThe lecturer from the University of Queensland's School of Agriculture and Food Sustainability had not inspected or analysed the citrus in person.\n\nBut she said the fruit appeared to be \"very old\".\n\n\"From what I can see, it looks like the fruit is mummified, it's dried out already,\" Dr Prabawati said.\n\nShe said for fruit with thick skin, like citrus, it was possible they could dry out and remain intact like that for years.\n\nWhether the fruit is damaged and the climate it is kept in can influence how it spoiled or was preserved.\n\nA birthday card and gift for the orange. (ABC Capricornia: Jasmine Hines)\n\n\"We can even see some evidence from archaeological sites from other countries, that some of the fruit have been in the dried condition for years, even a hundred years,\" Dr Prabawati said.\n\nShe said typically fruit would dry out or mummify if kept above 40 degrees Celsius with humidity below 50 per cent.\n\n\"If it's below that temperature the drying out or mummification may still happen, especially if the fruit itself or the orange itself still has intact skin, so there's no crack … but it might be slower,\" Dr Prabawati said.\n\nMr Jones said while the orange might not be front and centre in the museum next year (as 101 will not be a milestone), he expected further birthdays would follow.\n\n\"It survived, it outlasted him [Arthur Jeffery] and it'll outlast us by the look of things,\" he said.",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/transport-industry-warns-price-hikes-fremantle-bridge-shutdown/106158628",
    "title": "'Thrown us under the bus': Transport industry slams Fremantle traffic plans",
    "publish_date": "Sun, 21 Dec 2025 00:05:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "Plans to mitigate traffic congestion when the Fremantle bridge shuts in six weeks could push up transport costs and consumer prices, the transport industry is warning.\n\nThe 86-year-old Fremantle Bridge will close on February 1 for up to a year and be rebuilt at a cost of $430 million to create a higher clearance for boats, with traffic to be diverted to the nearby Stirling Bridge.\n\nConcept designs for the new Fremantle Traffic Bridge over the Swan River. (Supplied: Main Roads)\n\nTransport authorities predict it will have a \"severe\" impact on the road network and create significant delays, with Transport Minister Rita Saffioti flagging the possibility of limiting truck movements across Stirling Bridge during the morning peak.\n\nBut industry leaders oppose the idea.\n\n\"It's thrown us under the bus pretty close to go time,\" said Brian Hack, the Managing Director of EES Shipping, a medium sized, family-owned trucking company based in Cockburn.\n\nHigher consumer costs\n\nThe government has already announced measures aimed at reducing the congestion, including changing the road network, free public transport through Fremantle, extra train and bus services, and permanent incident response teams on Stirling Highway.\n\nBut with six weeks to go, the transport industry wants certainty and said it was running out of time to prepare for potential truck limits.\n\nBrian Hack says limiting trucks on Stirling Highway at peak times would drive up costs. (ABC News: Nicolas Perpitch)\n\nMr Hack said if trucks were banned for two hours in the morning peak and two hours in the afternoon peak, freight would need to to be delivered later in the day or at night, creating bottlenecks and higher costs across the supply chain.\n\nHe said drivers would need to be paid penalty rates, and extra drivers and other staff hired for night shifts.\n\n\"So in the end, there's just going to be more costs for the end consumer,\" he said.\n\n\"Everyone that I've spoken to in the last couple of days has thought it's been a joke, because it's just not tenable, especially this far out.\"\n\nThe transport industry says it's running out of time to prepare for potential truck limits on Stirling Bridge. (ABC News: Nicolas Perpitch)\n\nUp to 30 per cent hike\n\nCam Dumesny, the chief executive of road transport peak body Western Roads Federation, estimated it would push trucking costs up by 20 to 30 per cent.\n\n\"Everything that we bring into the port, you know, a lot of building materials we bring in for housing, bars, whatever, all that's going to go up,\" he said.\n\n\"A lot of the grocery lines we buy come from overseas, all of that's going to go up.\"\n\nCam Dumesny says costs could increase by up to 30 per cent. (ABC News: Nicolas Perpitch)\n\nMs Saffioti said some companies were already planning to self-regulate and change their times of operation.\n\n\"It may be something that industry, in a sense, undertakes its own changes in its own way to make sure that they're not contributing or caught up in any unnecessary congestion,\" she said.\n\nRita Saffioti has flagged the possibility of limiting truck movements across Stirling Bridge during the morning peak. (ABC News: Nicholas Martyr)\n\nAvoiding 'carmageddon'\n\nRather than restricting port access, industry wants to be allowed to move more freight with fewer trucks.\n\nThe Fremantle Traffic Bridge is being rebuilt at a cost of $430 million. (ABC News: Nicolas Perpitch)\n\nAlong with Fremantle Mayor Ben Lawver and the Greens, freight companies want permission to use modern trucks, called High Productivity Freight Vehicles (HPFV), to and from the port.\n\nThey argued these trucks were more efficient, quieter and able to carry more containers, resulting in fewer and cleaner trucks on the roads.\n\n\"If you allow us to run the same east coast combinations, which are higher productivity, more efficient, we can actually reduce the number of trucks by say, 30 per cent,\" Mr Dumesny said.\n\nMr Lawver said most truck operations to the port were during business hours — but these could be spread further.\n\n\"If we could just shift from only using that one third of available hours during the week, to the two other thirds, I think we'll see a huge relief of pressure on people when they're trying to commute and get across the river during the day,\" Mr Lawver said.\n\nBen Lawver says the use of High Productivity Freight Vehicles could alleviate some potential issues. (ABC News: Nicolas Perpitch)\n\nHe said it was not too late to avoid \"carmageddon\".\n\n\"If we can encourage that night-time running for the trucks with HPFVs, cleaner, quieter ... I think we'll see a real shift in us and how we get through the bridge closure.\"\n\nThe transport industry supports working at night and weekends but wants incentives, like cheaper port access.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/seafood-companies-launch-legal-challenge-of-wa-fishing-ban/106166174",
    "title": "Trawling companies launch legal action over WA demersal fishing ban",
    "publish_date": "Sat, 20 Dec 2025 23:59:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "Two seafood companies that conduct trawling in WA's Pilbara region have launched legal action in the WA Supreme Court against the state government's new demersal fishing restrictions.\n\nEarlier this month, the WA government announced a suite of reforms to commercial and recreational fishing of demersal species in an effort to recover the state's at-risk fish stocks.\n\nThe new reforms include a permanent ban on demersal trawling in the Pilbara, the only zone in WA where the practice takes place.\n\nDemersal fish, also known as ground fish, live and feed on or near the bottom of the ocean and include popular species like dhufish, pink snapper and red emperor.\n\nThe measures are aimed at protecting demersal fish stocks like pink snapper. (ABC Midwest & Wheatbelt: Joanna Prendergast)\n\nThe legal action against the government's reforms was launched by Sea Harvest Pty Ltd, an Australian subsidiary of South African global fishing and food company, Sea Harvest Group, alongside West Australian seafood company, Seafresh Holdings Pty Ltd, which trades as Westmore Seafoods.\n\nBoth companies are involved in trawling in the Pilbara, where about 40 per cent of all demersal fish in the state are caught by three trawling licence holders.\n\n'Unexpected decision'\n\nIn a statement, the two companies said the legal action was \"… not about resisting sustainability measures but about ensuring fisheries management decisions are evidence-based, consultative and proportionate, and do not casually devastate regional jobs, local food supply and long-standing commercial investment\".\n\nShock demersal fishing ban impact New fishing rules come into effect in Western Australia next month, significantly reducing the amount of local fish available in the state.\n\n\"The unexpected decision by the minister [Jackie Jarvis], despite proactive engagement with her and offering practical solutions, came as a complete surprise,\" Sea Harvest Australia chief executive Danie du Toit said in the statement.\n\n\"The decision effectively means that a legitimate and approved foreign direct investment has been expropriated without consultation or compensation, which raises some serious concerns regarding sovereign risk, protection of property rights and Australia as an investment destination for global companies.\n\n\"Banning a fishing method that's globally recognised and certified as most efficient and sustainable in the context of food security considerations simply makes no sense.\"\n\nSeafood supply chain risk\n\nSea Harvest Marine executive director Richard Duncan said the government's decision would affect \"far more than fishing vessels\".\n\nFishing industry 'drowning' amid ban Concerns are being raised over the emotional toll of some commercial fishing licences being revoked.\n\n\"It has significant flow-on impacts across the seafood supply chain — including fish processors, wholesalers, retailers, transport and logistics operators, refrigeration and cold-storage businesses — and ultimately the many Western Australians who rely on locally caught seafood,\" he said.\n\nMr Duncan said it also undermined an active demersal recovery plan for the region introduced in 2024, designed to stabilise and, over the medium term, regenerate stocks while allowing businesses to continue operating.\n\n\"The plan was less than 15 months old and still in phase one,\" Mr Duncan said.\n\n\"Yet a permanent closure has been imposed without any public assessment of whether the agreed recovery measures are working.\"\n\nTrawling 'no longer acceptable'\n\nTrawling is a commercial fishing method where a large net is dragged along the sea floor to catch fish.\n\nThe practice was thrust into the spotlight in David Attenborough's documentary, Ocean, in which the naturalist rails against the large-scale destructive impact of bottom trawling on marine ecosystems.\n\nWhen making the announcement about the reforms, Fisheries Minister Jackie Jarvis said she believed most West Australians would agree trawling was no longer acceptable.\n\n\"Trawling for demersals also results in the death of various marine life including a number of dolphins each year, as well as the critically endangered sawfish species,\" Ms Jarvis said at the time.\n\nMarine life like dolphins can die as a result of trawling. (AAP: WA Department of Environment and Conservation)\n\nWA Fishing Industry Council chief executive Melissa Haslam has said repeatedly that trawling in WA was already operating under strict conditions.\n\nMs Haslam also took offence by the way it was portrayed in Attenborough's documentary, arguing it overlooked the strict regulations and sustainable practices of Australia's trawl fisheries.\n\n\"When they show footage of trawling over the ocean floor that's causing terrible damage, I will guarantee you that footage was not taken in Australia or any other world-leading country that has highly regulated fishing practices,\" she said earlier this year.\n\nLegal action last resort\n\nThe demersal trawling ban is set to take effect on January 1 — and while restrictions had been looming for some time, many in the industry said the extent of the government's bans were unexpected.\n\nCritics claim the restrictions will drive up the price of demersal fish such as red emperor. (ABC News: Mark Leonardi)\n\nIn its media statement, Sea Harvest said it tried to engage with the government after the new restrictions were announced, \"but no consultation process was made available before the ban was formally gazetted\".\n\n\"We are asking the government/minister to make decisions that are grounded in current science, honour existing agreements, and recognise the importance of fishing to the social and economic fabric of regional Western Australia,\" Mr Duncan of Sea Harvest said.\n\n\"Sea Harvest had no option but to seek to overturn the ban through the court before the holiday period to mitigate immediate and irreversible impacts on workers, businesses and supply chains.\"\n\nA spokesperson for the state government said it could not comment on the matter that was before the courts.\n\nStrict fishing bans for Perth, WA beginning this month Strict bans limiting commercial and recreational fishing in Perth and WA are announced in an effort to save some under-threat fish species from the brink of collapse.\n\nBut the spokesperson provided \"further information\" on the fishing reforms, saying they were announced following the latest stock assessment, which revealed demersal fish species like dhufish and snapper were at risk and severely over-fished in some parts of WA.\n\n\"These reforms were developed after extensive consultation with industry and the community, including the State Government Fishing Forum, and at follow up meetings since,\" the response stated.\n\n\"The state government is also providing a $29.2 million Fisheries Support Package to assist the commercial and recreational sectors across the state adapt to the reforms and offer alternatives for fishers.\"\n\nThe matter is listed to be heard in the WA Supreme Court on Monday.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/horse-riding-melbourne-pakenham-upper-riding-club/106167500",
    "title": "Approaching her 80th birthday, Joan Jeffery is still riding high",
    "publish_date": "Sat, 20 Dec 2025 23:29:57 +0000",
    "category": "sports",
    "authors": [],
    "text": "Queen Elizabeth inspired equestrians the world over by continuing to ride into her 90s. But at Pakenham Upper Riding Club, south-east of Melbourne, an ageless Joan Jeffery is leading the way.\n\nJoan turns 80 next year and rides her 27-year-old quarter horse appaloosa mare, Ribana, at least once a week and is a regular at the club's twice-monthly rallies, joining lessons and occasionally entering Horse Riding Club Association of Victoria (HRCAV) dressage competitions.\n\nQueen Elizabeth continued to ride into her 90s. (AP: Steve Parsons/Pool )\n\n\"I love riding,\" Joan says.\n\n\"I love the connection with a horse. I've had Ribana since she was four and she neighs when she sees me — probably because she's after food — but she's a very affectionate horse and I just love her.\"\n\nHorse and rider are both remarkably fit and healthy for their ages. A horse's average life span is 30 years, but at 27, Ribana shows no signs of slowing down, as she trots and canters around the arena.\n\nJoan loves the connection she has with horses, particularly her own mare. (ABC News: Natasha Johnson)\n\nAnd while many people entering their 80s are struggling with physical or mental limitations, Joan still manages to do all the heavy lifting of caring for a horse, including shovelling poo in the paddock four days a week, hooking up her horse float and towing it from the property where she agists to the club grounds, saddling up and riding for an hour-long lesson.\n\n\"I go to the gym and do weights to keep in shape. I just feel so relaxed and happy when I am in the saddle,\" she says.\n\nJoan is the oldest member of the Pakenham Upper Riding Club, which boasts about 60 members.\n\nNext year, the club celebrates its half century and has appointed Joan as its 50th-anniversary ambassador. She was presented with an embroidered blazer and a rug for Ribana, recognising her commitment to horse riding and the club.\n\nMany members of Pakenham Upper Riding Club are inspired by Joan, who turns 80 next year. (ABC News: Natasha Johnson)\n\n\"Joan is an extraordinary lady,\" says club president Leanne McLean.\n\n\"At nearly 80, she continues to do something many would think is reserved for 'the young' and proves that horse riding is a sport for a lifetime.\n\n\" She teaches us to never stop chasing your dreams and embrace things that bring you joy because when we do this, we are not only adding years to our lives we are adding life to our years. Be like our Joan. \"\n\nGeorgie Campbell, who runs the Friday rallies, says Joan is one of the club's most enthusiastic members.\n\n\"Joan is an inspiration to me and many others at the club,\" she says.\n\n\"She comes to every rally with her beautiful mare and always has a big smile on her face. I just love her.\n\n\"We are all passionate about riding and hope to be just like Joan, still riding into our 80s and beyond.\"\n\nJoan has loved horses for as long as she can remember. (ABC News: Natasha Johnson)\n\nJoan says she's loved horses since childhood. She grew up in Brisbane near the Eagle Farm racecourse and while she was never allowed to go to the races, often saw the thoroughbreds being walked down the road near her house.\n\n\"When I was a kid, I was always drawing horses on a blackboard with chalk. So, I always had a love and interest in horses.\"\n\nIn her 20s, she started going on trail rides with her two sisters and hoped that one day she might get a horse of her own.\n\nThat opportunity didn't arise until a couple of decades later when she and her husband and two sons moved to Melbourne and at the age of 46, Joan decided to finally buy herself a horse.\n\nOver four decades, Joan has owned seven horses.\n\nShe started out learning dressage then took up show jumping and loved it.\n\nShe's won a few ribbons over the journey, but her riding highlight was taking out the jackpot in an HRCAV dressage competition on a horse called Phoenix and winning a rug.\n\n\"He was a beautiful horse, and he won a very nice rug,\" Joan says.\n\n\"But a few months after that he got colic and I had to get him put down. It broke my heart. I buried him with that rug because I thought he won that rug and it's going to go with him.\"\n\nJoan's husband Peter admires her passion, even if it causes him to worry. (ABC News: Natasha Johnson)\n\nHer husband, Peter, was on hand to see Joan honoured by the club and while he admires her passion, it does cause him a lot of worry.\n\n\"I sometimes wish she'd stop,\" he says.\n\n\"Because she's had so many broken bones over the years, but I don't think she'll retire. It's what keeps her going.\"\n\nAnd if the queen's example is anything to go by, Joan has at least another decade of riding ahead of her. Or maybe more.\n\n\"As long as I'm standing upright, I'll keep riding,\" she says with a laugh.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/first-paraplegic-engineer-in-space/106167430",
    "title": "Paraplegic engineer becomes the first wheelchair user to blast into space",
    "publish_date": "Sat, 20 Dec 2025 23:16:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "A paraplegic engineer from Germany has become the first wheelchair user in space, launching from West Texas with Jeff Bezos's company Blue Origin on Saturday.\n\nThe flight was just 10 minutes but the capsule still managed to soar 105 kilometres up, skimming into space.\n\nMichaela Benthaus, 33, was able to float in space for more than 3 minutes, leaving her wheelchair behind, which she has used since being severely injured in a mountain bike accident seven years ago.\n\nThe Blue Origin capsule floated back to the ground with parachutes on Saturday. (AP: Blue Origin)\n\nMs Benthaus said she laughed all the way up.\n\n\"It was the coolest experience,\" she said shortly after landing.\n\nMs Benthaus shared the ride with five other passengers including business executives, investors and a computer scientist, raising Blue Origin's list of space travellers to 86.\n\nOne passenger was retired SpaceX executive Hans Koenigsmann, who helped organise and sponsor her trip with Blue Origin.\n\nTheir ticket prices were not divulged.\n\nMaking space accessible for disabled people\n\nMs Benthaus was part of the European Space Agency's graduate trainee program in the Netherlands, so she had experienced snippets of weightlessness in test flights previously.\n\nIn 2022 Ms Benthaus was on a parabolic aeroplane flight out of Houston, but says she never thought going to space would be possible.\n\n\"I never really thought that going on a spaceflight would be a real option for me because even as like a super healthy person, it's like so competitive, right?\" she told The Associated Press ahead of the flight.\n\n\"There is like no history of people with disabilities flying to space,\" she said.\n\nMichaela Benthaus has been in a wheelchair for seven years, after a mountain bike accident. (AP: Blue Origin)\n\nWhen Mr Koenigsmann approached her last year about the possibility of flying on Blue Origin and experiencing more than 3 minutes of weightlessness on a space hop, Ms Benthaus thought there might be a misunderstanding.\n\nBut there wasn't, and she immediately signed on.\n\nHer goal is to now make not only space accessible to the disabled, but to improve accessibility on Earth too.\n\n\"I really hope it's opening up for people like me, like I hope I'm only the start,\" she said.\n\nMinor adjustments to space capsule\n\nAn injured spinal cord means Ms Benthaus can't walk at all, but the autonomous New Shepard capsule required only minor adjustments to accommodate her, according to the company.\n\nBlue Origin's flight engineer, Jake Mills, said that was because it was designed with accessibility in mind, \"making it more accessible to a wider range of people than traditional spaceflight\".\n\nBlue Origin launched its first passenger spaceflight in 2021. (AP: Blue Origin)\n\nAn elevator was in place at the launch pad to ascend the seven storeys to the capsule perched atop the rocket.\n\nBlue Origin added a patient transfer board so Ms Benthaus could scoot between the capsule's hatch and her seat.\n\nThe recovery team also unrolled a carpet on the desert floor following touchdown, providing immediate access to her wheelchair, which she left behind at lift-off.\n\nFollowing touchdown Ms Benthaus said: \"You should never give up on your dreams, right?\"\n\nAP",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/nick-kyrgios-handed-wildcard-entry-into-brisbane-international/106167614",
    "title": "Kyrgios earns wildcard to Brisbane International as he eyes Aus Open",
    "publish_date": "Sat, 20 Dec 2025 23:14:51 +0000",
    "category": "sports",
    "authors": [],
    "text": "Nick Kyrgios has been given a wildcard entry into the Brisbane International in a pointer to his determination to play in the Australian Open.\n\nKyrgios will feature in the January 4-11 tournament in Queensland ahead of being granted another possible wildcard into the grand slam in Melbourne.\n\nKyrgios, beset by injuries and four rounds of knee and wrist surgeries, has played just six ATP Tour matches in more than three years.\n\nThe 2018 Brisbane International champion was today confirmed as an entrant to the tournament's next edition.\n\n\"Nick has long been a favourite with Brisbane crowds and will be a major drawcard for fans,\" Brisbane International tournament director Cameron Pearson said in a statement.\n\n\"We're thrilled to welcome him back to Brisbane and can't wait to watch him perform in front of a passionate home crowd.\"\n\nThe 30-year-old will follow his Brisbane appearance by contesting the round-robin Kooyong Classic in Melbourne from January 13-15.\n\nAustralian Open organisers are expected to lock in all wildcards just before qualifying starts on January 12.\n\nThe former Wimbledon finalist said last month he had been training as well as his career-best year in 2022, when he lost the grass-court final in London to Novak Djokovic in four sets and also reached the US Open quarter-finals.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I don't know whether to call it a miracle or anything, but my knee feels like it's gotten younger by a couple of years,\" Kyrgios said.\n\n\"I really didn't have hope to be able to play AO or just ever get back to that point of where I felt comfortable and competing and really letting my body go.\n\n\"But something in the last month, I don't know what it is. I was with my masseuse and physio last night and something really has changed with my knee.\n\n\"Like it's not swelling, it's not feeling bad after a session.\"\n\nKyrgios is in the midst of a raft of exhibition matches, including the so-called Battle of the Sexes against women's world number one Aryna Sabalenka in Dubai on December 28.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/ashes-third-test-day-five-live-updates/106167504",
    "title": "Live: 'What are you doing?' First English wicket falls after Lyon injured",
    "publish_date": "Sat, 20 Dec 2025 22:49:41 +0000",
    "category": "sports",
    "authors": [
      "Jon Healy",
      "Henry Hanson"
    ],
    "text": "(Getty Images)\n\nWow, what an unbelievable session for England.\n\nSomehow, they head to lunch still well in this game.\n\nJamie Smith and Will Jacks began the session very positively, with Smith smashing two big sixes before a rain delay paused play for 40 minutes.\n\nThe England batters returned to the crease and continued to play with determination. Smith raced to 50, smashing Mitchell Starc for consecutive boundaries before holing out with one shot too many.\n\nIt was a poor dismissal for Smith, but one that has in no way ended England.\n\nJacks has continued to apply himself, reaching the break on 38 not out, while Brydon Carse has settled and played some attractive shots himself.\n\nHowever, that session was defined by one image - Nathan Lyon, Australia's second highest Test wicket taker and fourth innings trump card - limping off the field after diving in the outfield.\n\nHe felt something straightaway, grasping at his hamstring.\n\nIt didn't look good, and since then, we've received word the star tweaker has left the Adelaide Oval for scans.\n\nIf there was ever an opportunity for England to pull off an Ashes miracle, this is it.\n\nThe tourists require a further 126 runs to keep this series alive.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/vanuatu-workers-sunday-worship-in-bundaberg/106128564",
    "title": "Song, hugs and devotion help workers thrive 2,000km from home",
    "publish_date": "Sat, 20 Dec 2025 22:13:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "An entire ocean separates Rosina Mana from her four children, but she finds comfort when gathering with fellow Pacific workers who have made similar sacrifices to come to Australia.\n\nTheir voices come together in harmony, singing to the upbeat sounds of a piano and the lapping turquoise waters of Queensland's Elliott Heads beach, 4 and a half hours' drive north of Brisbane.\n\nIntrigued beachgoers watch as the woman in the red dress dances and claps along to the music before holding her hands high to join the group in prayer.\n\nVanuatu workers at Elliott Heads. (ABC News: Johanna Marie)\n\n\"My heart is very happy for what we are doing,\" Ms Mana said.\n\n\" When I'm with my friends we are happy and hugging each other, talking and sharing. \"\n\nThe softly spoken mother is from the Vanuatu island of Tanna where she left her family two years ago.\n\nIt was the prospect of better life that brought her to Australia under the Pacific Labour Mobility (PALM) Scheme.\n\n\"My husband died in 2013 and left me with four kids,\" she said.\n\n\"I made up my mind, I saw people coming to Australia and they helped their families.\"\n\nShe earns about $1,000 per week as a cleaner in a Bundaberg hostel which was \"much more\" than she could earn as a housekeeper in her home country.\n\nLeaving her then-14-year-old daughter in the care of her cousins, and three sons aged in their early 20s, Ms Mana said it was difficult to be away from them.\n\n\"It was hard to be separated from them while I was in Australia, but I'm happy to be here, to help them,\" she said.\n\n\"I tried my best.\"\n\nSunday worship is important in Vanuatu culture. (ABC News: Johanna Marie)\n\nIn October this year there was 31,885 workers participating in the PALM scheme across Australia, including approximately 11,690 workers in Queensland.\n\nThe biggest portion are from Vanuatu, followed by Fiji, and 55 per cent are employed in agriculture.\n\nAnother worker, Eric Pong, said he often spoke with his colleagues about the cultural differences between the countries.\n\n\"It's not an easy choice to make to leave your family … but we have to sacrifice to come over and work hard,\" he said.\n\nSome workers can struggle adapting to Australian culture. (ABC News: Johanna Marie)\n\n\"I look at the culture and try to adapt myself into the culture.\n\n\"Once we come into that community then we are part of that community.\"\n\nMore support needed\n\nFarmgate Backpackers East Bundaberg hostel manager Jules Ramsay, who is also the company's pastoral support person, says it can be difficult for the PALM workers to adjust to life in Australia.\n\nJules Ramsay said the Sunday worship brings the workers joy. (ABC News: Johanna Marie)\n\nShe organised a generator through the Rotary Club which allows the group of Vanuatu nationals to take their Sunday worship outdoors to Elliott Heads beach.\n\n\"It's just an uplifting experience,\" Ms Ramsay said.\n\n\"They spend so much time here. Even the short-term visa holders are here for nine months, so it's really hard for them.\n\n\" [They're] away from their family, away from their friends, and because they're not from here they find it hard to put roots down. \"\n\nMs Ramsay said she did not believe there was enough mental health support available to the PALM workers in Australia.\n\n\"I think there needs to be a lot more support from the government, particularly in regions like this where we're so dependent on them,\" she said.\n\nMr Pong agreed the transition of cultures is challenging for many workers.\n\n\"When you [initially] come from your country you can find it difficult,\" Mr Pong said.\n\nThe group of Vanuatu workers come together in prayer. (ABC News: Johanna Marie)\n\nA spokesperson for the Department of Employment and Workplace Relations (DEWR) said there were \"welfare obligations\" under the PALM scheme deed and guidelines, including for approved employers to appoint a wellbeing support person.\n\n\"The purpose of this role is to check on workers' progress, wellbeing, and to provide a safe space for them to raise concerns,\" the spokesperson said.\n\nRelying on PALM workers\n\nBundaberg sweet potato farmer Andrew Greensill said the region's agriculture industry relied on the scheme and he was pleased to see the workers enjoying the Sunday gatherings.\n\n\"We see that at work, their spirit and love for each other, and it's great to see here as well,\" he said.\n\nJules Ramsay and Andrew Greensill (centre) with the Vanuatu workers. (ABC News: Johanna Marie)\n\nMs Mana said the group is planning to spend Christmas together in their hostel where she would wear a special dress and share food and conversations.\n\n\"I love Australia,\" she said.\n\n\"I am so happy that I can come to make some money and help my kids back home.\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/mining-pilbara-towns-left-out-of-battery-rebate-schemes/106025508",
    "title": "Residents on mining grids not afforded same discounts as rest of WA",
    "publish_date": "Sat, 20 Dec 2025 22:01:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Western Australia's Pilbara region is the sunniest in Australia, with an annual average of 10 hours of sunlight a day.\n\nThe region is synonymous with mining industry giants who tout a future of renewables, green iron and net zero targets.\n\nBut residents say their actions are failing to match their words.\n\nEarlier this year, the WA and federal governments both launched home battery rebate schemes for those on solar power.\n\nWA's Pilbara region is sunniest region in the country. (ABC News: Chris Lewis)\n\nHome batteries can cost anywhere between $5,000-$25,000, with the state rebates on offer between $5,000-$7,500 depending on supplier.\n\nBut these rebates are only available to customers on Horizon or Synergy grids, leaving customers in small mining towns like Dampier, Newman, Paraburdoo, Tom Price, Pannawonica and Wickham — where the grids are run by mining companies — feeling left out.\n\nEarth, wind and fire\n\nThe power grid in Dampier, 1,500km north of Perth, has been managed by Rio Tinto since the town was established in 1965.\n\nKen Mulvaney has been a resident for 21 years and was keen to purchase his own battery system — but after finding out he was not eligible for the rebate, he said the system was unfair.\n\n\"It flies in the face of their stated concerns of wanting to work and have good relationships with community that they work in,\" he said.\n\nKen Mulvaney says mining companies should front up the costs of a battery rebate in Dampier. (ABC Pilbara: Kelsey Reid)\n\n\"They continue to give subsidies in power to all their employees, but anybody who's not within Rio Tinto, they seem to just treat as absolute dirt.\"\n\nHe would like Rio Tinto to encourage the government to offer a rebate, or for the company to offer its own rebate instead.\n\n\"Rio Tinto has been making at least $12 billion profit a year for basically the last 10 years when you look at their annual statements and yet they cannot pay the equivalent subsidy that the state government has offered,\" he said.\n\nRio Tinto has directed its customers to the federal rebate should they comply with eligibility requirements.\n\nDampier is a small community with a population of 1,282 people in the 2021 Census. (ABC Pilbara: Kelsey Reid)\n\nExtending to the east\n\nNewman resident Sammi Ryder was shocked to see a 95 per cent decrease in the cost of her electricity bill after the installation of solar panels and a battery at her home this year.\n\nThe family's two-month power bill dropped from $2,000 to just $63.\n\n\"I know that everyone can't afford it, but if you can, it's literally life-saving,\" Ms Ryder said.\n\n\" You can notice the difference in your pocket. \"\n\nNewman, 1,200km north-east of Perth, sits on an electricity micro-grid powered by BHP.\n\nSammi Ryder with her three kids Charlize Lockyer, 16, Peter Lockyer, 8 and Faith Lockyer, 10. (Supplied: Sammi Ryder)\n\nMs Ryder received a government rebate for her solar panels but not for the battery.\n\nHouses on these micro-grids are also not compensated for sending electricity they have generated back to the grid as Synergy and Horizon customers are.\n\nBHP's Mt Whaleback mine near Newman produces around 78 million tonnes of ore annually. (ABC Pilbara: Alistair Bates)\n\nMs Ryder said she would like to see BHP consider introducing such credits.\n\nBHP have stated it does not supply buyback credit for excess energy because large volumes could create potential instability on the small grid.\n\nTime to go green\n\nCurtin University sustainability professor Peter Newman said it was the responsibility of these companies to adapt to the future.\n\n\"I think the mining companies have made a very big case for a long time that they run those towns,\" he said.\n\nHe said if they cannot handle the responsibility, they should hand the systems to state-owned providers.\n\nA home battery system costs between $5,000 and $15,000, with a federal subsidy coming off the price via the supplier. (ABC News: Rhiannon Shine)\n\n\"This is part of what their responsibility now is to demonstrate how to do this and it's not that hard — they've just got to get on and do it,\" he said.\n\n\"It would be a pity I think because it's an opportunity for those companies to show that they are part of this future.\"\n\nSlow take-up of scheme\n\nUptake of the WA rebate has been slow, with only 4,500 batteries installed since July.\n\nA spokesperson for energy Minister Amber-Jade Sanderson said it was only available to eligible customers supplied by Synergy or Horizon Power as they are on the VPP.\n\nAmber-Jade Sanderson says the scheme is limited to Synergy and Horizon customers. (ABC News: Keane Bourke)\n\nMeanwhile, the federal government is set to overhaul its battery rebate system amid reports the $2.3 billion funding has almost been drained only six months into the scheme due to demand.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/ashes-2025-zak-crawley-says-there-is-still-plenty-to-play-or/106167428",
    "title": "'They were the favourites': Crawley defends England's Ashes disaster",
    "publish_date": "Sat, 20 Dec 2025 21:42:15 +0000",
    "category": "sports",
    "authors": [],
    "text": "England batter Zak Crawley says it's too soon to sift through the ashes of a wrecked Australian tour.\n\n\"Obviously very disappointing,\" Crawley told reporters on Saturday as the tourists digest the near certainty of going 3-0 down against Australia.\n\n\"We came here to win the Ashes and, yeah, obviously we're staring down the barrel now.\n\n\"But there will still be plenty to play for.\"\n\nJust not the coveted urn.\n\nEngland enters today's final day of the third Test in Adelaide needing a miracle: 228 more runs to win, four wickets in hand.\n\nAlex Carey celebrates as Ben Stokes is bowled out by Nathan Lyon. (Getty Images: Quinn Rooney)\n\nAfter torching England by eight-wicket margins in the opening two Tests, the Australians are on the cusp of retaining the Ashes for a fifth consecutive series — in just 11 days of cricket.\n\n\"They're a very, very good side,\" Crawley said.\n\n\"It was always going to be tough coming up here against them.\n\n\"And they were the favourites going into it and they have proven why — they have played very, very well and made it very hard for us.\n\n\"Obviously we have been slightly short of our best. But a lot of credit has to go to them, they have not allowed us to be our best really.\n\n\"They have bowled very well and haven't given us a lot … it's hard to play that way that we have in the past, perhaps — and to their credit for that.\n\nOllie Pope watches as Josh Inglis dives to stop the ball at the Adelaide Oval. (Getty Images: Robert Cianflone)\n\n\"They have set good fields and it is just an attritional style of cricket over here, it's not easy to score quickly.\"\n\nCrawley, who made 85 on the fourth day of play, accepted that explanation sounded simplistic.\n\nBut he didn't accept criticism of some underperforming teammates.\n\nHis opening partner, Ben Duckett, can't appear to leave the ball, caught in slips again — he has 97 runs at 16.16 this series.\n\nThe world's number one-ranked batsman Joe Root (219 at 43.80) and captain Ben Stokes (165 at 27.50) fumed after Saturday's failures — 39 and five respectively.\n\nVice-captain Harry Brook (173 at 28.83) went to water again, bowled attempting a bizarre reverse sweep.\n\nAnd first-drop Ollie Pope (125 at 20.83) faces excommunication from the team but Crawley bristled at the criticism heaped on his mate.\n\nFor comparison, Australian fast bowler and number eight batter Mitchell Starc has 150 runs at an average of 50.\n\n\"That is just cricket to be honest,\" Crawley said of the lean returns from Pope, who averages 16 from 12 Test innings in Australia.\n\n\"I have had lots of tough times, so has everyone in that change room, so has everyone who has ever played cricket.\n\n\"I feel like Popey gets a hard time sometimes, I'm trying to work out why.\n\n\"He has played really well in the last year, he has got big hundreds when we needed him to against tough opposition.\n\n\"Yeah, he's had a couple of quiet games. But I think he's an unbelievably good player and he plays a really hard role.\n\n\"Obviously he's wanting more for himself than he has got, but you can't underestimate some of the good knocks he has played.\"\n\nCrawley also all but admitted defeat despite the four wickets in hand in today.\n\n\"The last two (Tests) — we haven't won a Test here in a while so it's a chance to win those two Tests,\" he said.\n\nBazball or no, England no match for Australia England's belated abandonment of Bazball gives it temporary life, but reveals a painful truth — no version of this team is a match for the soon-to-be victorious Australians.\n\n\"If we can get it back to 3-2, suddenly it's a pretty good series. We were this close.\"\n\nIt was a comment that didn't sit well with ABC Sport's Jason Gillespie and Darren Lehmann.\n\n\"I just found the words a bit staggering. You're gonna be 3-0 down, 'but if we win the last two Tests it's 3-2 and that's a pretty good tour',\" Gillespie said.\n\n\"No, I'm sorry. You lost the Ashes. That's just nonsense talk.\"\n\nLehmann agreed that it sounded like Crawley had almost given up on the Adelaide Test.\n\n\"It was surprising,\" Lehmann said.\n\n\"Yes it's going to be tough work. I'm not saying they're going to get there but what I was surprised about is they almost admitted defeat.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/toyota-landcruiser-4wd-clocks-up-one-million-kilometres/106072806",
    "title": "After a million kilometres, stock agent retires LandCruiser 4WD",
    "publish_date": "Sat, 20 Dec 2025 21:32:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "After 1 million kilometres on country roads, a western Victorian stock agent has finally parked his faithful four-wheel drive for good.\n\nNhill local Gary Driscoll averaged more than 180 kilometres a day in his 2009 Toyota LandCruiser, travelling to properties across the Wimmera to inspect livestock.\n\n\"It's sometimes 3 to 4 hours a day in the car, but then there are days where you might be in the car for up to 14 hours,\" Mr Driscoll said.\n\n\" That's why we call it the mobile office. \"\n\nThe odometer of his LandCruiser, which is now on display in the Horsham Toyota dealership, actually reads 999,999 kilometres. The decision was made not to click it over to 1 million kilometres, as that would reset the odometer to zero.\n\nMr Driscoll began his career driving a HZ Holden Kingswood between Stawell and the Newmarket Saleyards in Melbourne's inner north-west.\n\nOver the years he has traversed Victoria's country roads in a range of Holden, Mitsubishi and Ford sedans — a far cry from the larger vehicles now more commonly used in agricultural professions.\n\nHe said he preferred the higher, smoother drive of a four-wheel drive, especially when navigating potholes.\n\n\"There are plenty of those around our roads today, and when you get a smaller vehicle, wow, they're rough.\"\n\nThe odometer showing 999,999 kilometres on Gary Driscoll's LandCruiser. (ABC News: Rebekah Lowe)\n\nIn good nick\n\nMr Driscoll kept his milestone car regularly serviced at the Horsham dealership where he bought it in 2009.\n\nService manager Tim Barnett said the vehicle had been serviced almost 100 times and that it was the most travelled he had seen.\n\n\"I've been here at the dealership for 15 years and in automotive for over 20 years.\n\n\"This is the first time I've seen one hit a million, particularly with the original engine and driveline,\" Mr Barnett said.\n\nMr Driscoll's car will be displayed at his local dealership for the next two months according to Toyota Australia.\n\nThe manufacturer was unable to confirm the highest mileage Toyota vehicle in Australia.\n\n\"However, we are aware of several customers whose Toyota vehicles have passed the million-kilometre mark,\" a spokesperson said.\n\nGary Driscoll's 2009 LandCruiser in full work mode. (Supplied: Gary Driscoll)\n\nCars lasting longer\n\nAutomotive journalist Toby Hagon said it was rare to find a car with more than 1 million kilometres on the odometer.\n\n\"I had a look online to see how many cars were being sold with more than 1 million kilometres. There were 41 listings, but I couldn't see one that was genuine.\"\n\nHe said rising prices in both new and used car markets meant owners were increasingly keeping vehicles longer.\n\n\" In Australia, the cars on our roads tend to be pretty old, so I think as a nation we're pretty good at stretching it out. \"\n\nMr Hagon said popular models were easier to maintain because parts were readily available.\n\n\"If the manufacturer doesn't have those parts anymore, the aftermarket suppliers will step in for things like headlights and major mechanical components.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-12-21/the-new-gungahlin-cricket-club-growing-at-an-exponential-rate-/106166592",
    "title": "The new Gungahlin cricket club growing at an 'exponential rate'",
    "publish_date": "Sat, 20 Dec 2025 21:23:42 +0000",
    "category": "sports",
    "authors": [],
    "text": "It was a modest start for the Yerrabi Cricket Club in Gungahlin's north.\n\n\"We had a young committee at that time, not a lot of people who had any experience whatsoever in cricket, so we just started from scratch,\" club president Sumeet Panesar said.\n\nHowever within five years, the junior club has grown from two teams to having close to 200 players and has plans to become Canberra's first new Premier Cricket club in decades.\n\nClub secretary Brooke Bligh came to Yerrabi two years ago when her daughter joined the club.\n\nThe Yerrabi Cricket Club says it has been working hard to grow and raise funds. (Supplied)\n\n\"It's fantastic, it's a very, very close-knit community club, we really, really love being part of it,\" Ms Bligh said.\n\n\"Both of our children now play for Yerrabi, we find it really well managed and we're enjoying being part of it and helping it grow.\n\n\"I think everyone really does appreciate having a local Gungahlin club. All of the parents are in that sort of Amaroo, Taylor, Ngunnawal area [and] there's such a big growing community out this way.\"\n\n'A lot of Bunnings barbecues'\n\nThis season Yerrabi has 16 teams, including two girls's teams, two male Colts teams and for the first time a side in 6th grade of the men's Premier Cricket competition.\n\nThe cricket club at Yerrabi is hoping to build a strong reputation. (Supplied)\n\nPresident Sumeet Panesar said the rapid rise is down to the dedication of the club's parents and volunteers.\n\n\"We've been doing a lot of Bunnings barbecues and putting the word out there, posting in a lot of Facebook groups,\" Mr Panesar said.\n\n\" We've been running a lot of flyers to schools, at the local shops as well, so as much as we can do from our side. \"\n\nHe said Yerrabi had also forged relationships with Gungahlin Aussie Rules and netball clubs too.\n\n\"It's just all volunteer work that all of these people are doing is just, you know a selfless job. We're just doing it for the kids,\" Mr Panesar said.\n\n\"The passion for the sports and the passion for the community is what's been pushing all of us and I think that's why we're shining at the moment.\"\n\nCricketers playing on the Yerrabi Cricket Club pitch in Gungahlin. (Supplied)\n\nMs Bligh said forging a good reputation in the area has helped.\n\n\"The kids really enjoy the environment of the club. They're feeling supported, they tell their friends — it's growing in that respect,\" she said.\n\n\"We've got obviously a large Indian community out here as well and the word I think has spread through a lot of those organisations, so I think we've got a really good reputation.\n\n\"We're really growing at quite an exponential rate.\"\n\nYerrabi eyes off Premier Cricket\n\nYerrabi has aspirations to grow even further, targeting more girls's teams, including a senior side and ultimately a place in Canberra's Premier Cricket Club competition.\n\n\"It's a big focus for us to be able to create pathways for our junior cricketers, keep them involved and see them grow all the way through to senior cricket in Canberra,\" Mrs Bligh said.\n\nIt would be a significant change for ACT club cricket which has had the same eight clubs for decades.\n\nThere are some hurdles to overcome as North Canberra-Gungahlin is already competing in Premier Cricket, and the area would need more turf pitches for the teams to play on.\n\nYerrabi secretary Brooke Bligh wants the club to expand into senior cricket. (Supplied)\n\nMr Panesar said the club wanted to expand but was aware of the hurdles.\n\n\"We've been talking to Cricket ACT in regards to having a senior club and there's been a little bit of chat about putting a business case up, but you know it's still the early stages for that,\" he said.\n\n\" We don't know how it's going to pan out, but we're trying our best from the committee point of view. \"\n\nHe suggested there could be room for both clubs in Gungahlin.\n\n\"North Canberra Gungahlin is itself an established club and they've been in Gungahlin here for quite a while now,\" he said.\n\n\"Even having North Gungahlin, we at Yerrabi still have a lot of teams now, so you can see the amount of numbers that we've got at the moment and the future looks bright for us.\n\n\"I still get a lot of inquiries and my team still gets a lot of emails having their kids want to play and some of the seniors who want to come and join as well.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/national/starc-claims-crucial-breakthrough-20251221-p5npbe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Starc claims crucial breakthrough",
    "publish_date": "Sun, 21 Dec 2025 12:52:57 +1100",
    "category": "finance",
    "authors": [],
    "text": "Starc claims crucial breakthrough\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/sorry-sight-injury-rocks-lyons-ashes-dream-20251221-p5npba.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Sorry sight': Injury rocks Lyon's Ashes dream",
    "publish_date": "Sun, 21 Dec 2025 12:23:00 +1100",
    "category": "sports",
    "authors": [],
    "text": "'Sorry sight': Injury rocks Lyon's Ashes dream\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/lyon-injury-rocks-australia-on-final-day-of-adelaide-test-20251221-p5npai.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lyon injury rocks Australia on final day of Adelaide Test",
    "publish_date": "Sun, 21 Dec 2025 12:22:56 +1100",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Nathan Lyon is likely to take no further part in the Ashes after injuring his hamstring while fielding on the final day of the third Test in Adelaide.\n\nAs Australia searched for wickets in pursuit of an Ashes victory, Lyon clutched at his right hamstring after fielding a ball at fine leg on Sunday. He will take no further part in the match.\n\nNathan Lyon has injured himself on day four of the Adelaide Test. Credit: Getty Images\n\nThe spinner, who’d taken 3-77 off 25 overs in England’s second innings, walked off the field after throwing the ball back.\n\nMarnus Labuschagne had a brief conversation with Lyon as he walked towards the dressing room and patted the off-spinner on the back.",
    "source": "SMH",
    "cluster_id": 2
  },
  {
    "url": "https://www.smh.com.au/national/nsw-premier-chris-minns-urges-protesters-to-avoid-gathering-today-20251221-p5npaz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NSW Premier Chris Minns urges protesters to avoid gathering today",
    "publish_date": "Sun, 21 Dec 2025 11:52:55 +1100",
    "category": "finance",
    "authors": [],
    "text": "NSW Premier Chris Minns urges protesters to avoid gathering today\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/walker-secures-back-to-back-world-cup-wins-20251221-p5npat.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Walker secures back-to-back World Cup wins",
    "publish_date": "Sun, 21 Dec 2025 11:40:48 +1100",
    "category": "sports",
    "authors": [],
    "text": "Walker secures back-to-back World Cup wins\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw17-leeds-vs-crystal-palace-20251221-p5npah.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW17: Leeds vs Crystal Palace",
    "publish_date": "Sun, 21 Dec 2025 10:31:27 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW17: Leeds vs Crystal Palace\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw17-everton-vs-arsenal-20251221-p5npag.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW17: Everton vs Arsenal",
    "publish_date": "Sun, 21 Dec 2025 10:28:12 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW17: Everton vs Arsenal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/what-christmas-day-weather-will-be-like-around-australia-20251221-p5npae.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What Christmas Day weather will be like around Australia",
    "publish_date": "Sun, 21 Dec 2025 10:23:37 +1100",
    "category": "finance",
    "authors": [],
    "text": "What Christmas Day weather will be like around Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/ashes-cricket-live-australia-look-to-go-3-0-up-on-day-five-in-adelaide-20251220-p5np94.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ashes cricket LIVE UPDATES | England need 126 runs to pull off miracle win with three wickets in hand at lunch. Lyon out injured.",
    "publish_date": "Sun, 21 Dec 2025 10:03:08 +1100",
    "category": "sports",
    "authors": [
      "Peter Ryan",
      "Daniel Brettig",
      "Tom Decent",
      "Dan Walsh"
    ],
    "text": "England have reduced the target to 128 runs with three wickets in hand after bringing up the 300 for the second time this series. They have batted well and added 40 runs since the new ball was taken. Smith will be regretting his shot but he did enough to build the tension. Starc and Cummins are on and looking dangerous but the runs are still flowing.\n\nNathan Lyon has been taken from the ground for scans on that right hamstring of his. Meantime, the rain earlier this session has pushed lunch back half an hour to 1pm AEDT. If England are nine down at any point before that an extra half hour’s play for the game to be wrapped up can be taken.\n\nEngland 7-307 Target 435",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/world/north-america/girls-as-young-as-14-recruited-for-sexual-massages-second-batch-of-epstein-files-reveals-20251221-p5np9c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Girls as young as 14 recruited for sexual massages, second batch of Epstein files reveals",
    "publish_date": "Sun, 21 Dec 2025 10:01:49 +1100",
    "category": "finance",
    "authors": [
      "Michael Koziol",
      "Ellen Connolly"
    ],
    "text": "The person, whose name was redacted, said she ended up bringing seven to 10 “pretty girls” to Epstein’s mansion, including friends from high school and other acquaintances. “I asked them if they were interested in making extra money and that I knew an older wealthier man in Palm Beach who liked to have massages, and they would get paid $200,” she said. Jeffrey Epstein’s home in Palm Beach, Florida. Credit: AP “I would explain to them in detail what was expected of them when they showed up at the house. And I also told them that if they are underage just lie about it and tell him that you are 18.” The Epstein victim told the grand jury that she once brought a 23-year-old woman to the house, but Epstein didn’t like her. “He thought she was kind of too old.”\n\nShe also said: “The more you did … the more [money] you make. Basically, the more clothes that come off, the more you let him touch you, the more you just let him have his way with you … the more that you would make. Otherwise, you would be demoted down to bringing girls over and just making money that way.” One of the victims who was giving massages to Epstein from age 16, said Epstein gave her a vibrator for her 18th birthday. “She was very, very embarrassed,” the FBI agent who interviewed her told the grand jury. He also gave her on occasions “three sets of bra and underwear, panties, Victoria’s Secret bra and underwear sets”. He also rented her a car for several months. Jeffrey Epstein, in court in 2008, died in jail in 2019 while awaiting trial on sex-trafficking charges. Credit: AP A handwritten document contained in the files appears to be written by one of his victims, who was 16. She refers to Epstein as “JE” and being offered $200.\n\n“Met my friend Jeff. Big house,” she writes. A handwritten note from one of his victims. Credit: US Department of Justice Another teenage girl gave evidence that during the 45-minute massage, Epstein asked her if she wanted to earn an extra $100 for performing a sex act. Following the massage, Epstein handed her $300. She noticed on the walls of the room “a mural or pictures of naked girls either exposing their breasts or completely naked.” In another transcript, an FBI agent told the jury about a girl identified as Jane Doe 3, who first encountered Epstein when she was 17.\n\n“She was aware she was one of Epstein’s favourites, according to several of the other girls,” the FBI agent testified. There were 125 phone calls between her and Epstein from December 2004 to October 2005. During the massages, they spoke about what grade she was in and the prom she was going to. She was also given gifts, including Victoria’s Secret underwear. “She did not tell him how old she was, but she did tell him where she planned on going to school,” the agent said. “She stated that when it came to her age, that Mr Epstein didn’t care.” Loading Despite the evidence of widespread criminality given to the grand jury, the indictment was abandoned for a favourable plea deal cut between Epstein’s lawyers and then US attorney in the Southern District of Florida, Alexander Acosta, who would later become labour secretary in the first Trump administration.\n\nUnsealed transcripts from the 2019/20 grand jury investigation into Maxwell also shed light on how Epstein’s friend and accomplice aided and abetted his activity. An FBI agent described how one of Epstein’s victims said her visits to Epstein’s home were “strange”, but that “Maxwell normalised it for her”. “She was like a cool older sister and made comments like: ‘This is what grown-ups do,’” the agent testified. They recounted a story from one victim – who had by then turned 18 – who said Maxwell had shown her to a bedroom at Epstein’s house, where a schoolgirl outfit was lying on the bed. Loading",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/culture/music/this-band-just-scored-an-aria-1-next-week-they-re-busking-for-loose-change-20251219-p5nozb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This band just scored an ARIA #1. Next week, they’re busking for loose change",
    "publish_date": "Sun, 21 Dec 2025 10:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "Karl Quinn"
    ],
    "text": "Two weeks ago, The Pierce Brothers – 35-year-old twins Patrick and Jack – had the No.1 Australian album on the ARIA Chart. On Tuesday, they’ll be busking for spare change in Melbourne’s City Square.\n\nFor once, though, this isn’t a story about the fickle nature of the music industry. It’s a tale of going back to where it all began … give or take a few hundred metres.\n\nTwins Pat (left) and Jack Pierce – aka The Pierce Brothers – first attracted attention busking near Bourke Street Mall. They’re now a global touring act with two ARIA #1 albums to their name. Credit: Jason South\n\n“We started busking just there – just there,” says Jack, pointing excitedly from the portico of the former GPO building where we’re having coffee to a spot on the Elizabeth Street footpath, just a few metres from Bourke Street.\n\n“We weren’t allowed to play in the mall yet because you have to be busking for six months before you can apply to audition for a spot there.”",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/business/companies/elon-musk-wins-legal-fight-to-keep-210-billion-pay-deal-20251221-p5npa6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Elon Musk wins legal fight to keep $210 billion pay deal",
    "publish_date": "Sun, 21 Dec 2025 09:55:48 +1100",
    "category": "finance",
    "authors": [
      "Emmett Lindner",
      "Peter Eavis",
      "Rebecca F. Elliott"
    ],
    "text": "Elon Musk secured a major victory on Friday when the Delaware Supreme Court reinstated his 2018 pay plan at Tesla, now worth $US139 billion ($209.9 billion).\n\nIt was Musk’s second significant financial win at the carmaker in two months. He will retain the Tesla stock options he earned for managing the company over the past several years, while remaining eligible for a new package that could make him the world’s first trillionaire.\n\nElon Musk will get to keep the Tesla stock options he earned for managing the company over the past several years. Credit: AP\n\nThe 2018 package was struck down last year by a Delaware Court of Chancery judge, who ruled that shareholders had not been properly informed about the plan and that Tesla’s board had not acted independently of Musk when making the award. The judge said Musk had effectively overseen his own compensation plan.\n\nTesla and Musk appealed that ruling, arguing that Delaware courts should honour a subsequent vote by shareholders that reaffirmed the package.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/culture/celebrity/bbc-under-pressure-to-axe-david-walliams-shows-over-alleged-behaviour-20251221-p5np9o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "BBC under pressure to axe David Walliams’ shows over alleged behaviour",
    "publish_date": "Sun, 21 Dec 2025 09:38:00 +1100",
    "category": "finance",
    "authors": [
      "Fiona Parker",
      "Martin Evans",
      "Amy Gibbons"
    ],
    "text": "The BBC has refused to drop David Walliams from its Christmas schedule despite pledging to cut ties with him.\n\nWalliams, who is one of the country’s most successful children’s authors, was dropped by his publisher HarperCollins on Friday following a London Telegraph investigation into alleged inappropriate behaviour towards young women.\n\nDavid Walliams at the London film festival in London in October. Credit: Scott A Garfitt/Invision/AP\n\nHe was accused of harassing a female member of staff at the firm. The employee subsequently left with a five-figure payout.\n\nFollowing the allegations, the BBC announced it was planning no future projects with the former Little Britain star. But the corporation will broadcast an episode of the panel show Would I Lie To You? on Boxing Day, with Walliams appearing as a guest. The BBC is also set to show two adaptations of his children’s books, Mr Stink and The Boy in the Dress, on December 21.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw17-newcastle-vs-chelsea-20251221-p5npa5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW17: Newcastle vs Chelsea",
    "publish_date": "Sun, 21 Dec 2025 09:08:22 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW17: Newcastle vs Chelsea\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.sbs.com.au/news/article/uk-man-cycle-from-england-to-australia-for-father-legacy/whq9oboc5",
    "title": "Jamie followed his dad's 14,000km England-to-Australia bike ride — here's how it went",
    "publish_date": "Sun, 21 Dec 2025 00:38:06 +0000",
    "category": "sports",
    "authors": [],
    "text": "Growing up in Manchester, United Kingdom, Jamie Hargreaves and his brother were captivated by stories of their father, Phil, who cycled more than 14,000 kilometres from England to Australia in 1984.\n\n\n\n\n\n\"He had the most amazing experiences on his journey, and he raised me and my brother on those stories and how we should have similar experiences,\" Hargreaves told SBS News.\n\n\n\n\n\nSo when Hargreaves turned 22 — the same age his father started the journey — he decided to follow in his footsteps, revisiting some of the places his dad had passed through.\n\n\n\n\n\nHe set off from Derby in England in May 2024, pedalling through Europe to Russia, before heading to Pakistan and Indonesia.\n\n\n\n\n\nAfter flying to Brisbane, he resumed his ride, ultimately completing the journey at a pub in The Rocks, Sydney, where he was greeted by a crowd of followers from his Instagram account, where he had been documenting the adventure.\n\n\n\n\"I actually can't believe it, it's been a mad old journey!\" Hargreaves wrote on his Instagram on Monday, with Sydney Opera House in the background.\n\n\n\n\n\n\"This trip has changed me [in] so many different ways.\"\n\n\n\nA 40-year father-son legacy\n\nRecalling the day when he told his dad about the cycling trip, Hargreaves said Phil wasn't surprised about his decision.\n\n\n\n\n\n\"I think he always sort of knew [about the trip], because I've always said since I was young that I was gonna cycle across the world as well,\" the younger Hargreaves said.\n\n\n\n\n\nHe described being raised in a \"pretty active\" family, and before the cycling journey, he was an active climber who frequently hiked with friends in Germany.\n\n\n\n\n\nThroughout the trip, Hargreaves tried to recreate photos Phil had taken 40 years earlier.\n\n\n\nJamie Hargreaves often recreates photos from his father's cycling trips taken 40 years ago. Source: Supplied / Jamie Hargreaves Hargreaves also rode a 45-year-old steel-framed bike that was the same model that his dad used back in the day.\n\n\n\n\n\nHe said that, ahead of his journey, Phil advised him to take every opportunity to hang out with locals when visiting other countries.\n\n\n\n\n\n\"If somebody invites you to stay and you've got like 20km left to cycle, it's going to be a nicer experience to stay with a local and sort of learn about their culture and their family and stuff,\" Hargreaves said, referencing his father's words.\n\n\n\nHospitality 'remained the same'\n\nOver the past year, the father-son duo often spoke on the phone as Hargreaves followed parts of his father's route, comparing what they had each seen along the way.\n\n\n\n\n\nBut Hargreaves couldn't fully replicate his father's journey, as some countries had become difficult to access.\n\n\n\n\n\n\"Iran, we couldn't get through, whereas my dad could go through,\" he said.\n\n\n\n\n\nAfter arriving in Türkiye, he adjusted his route, travelling to Russia via Georgia, then visiting Kazakhstan, Uzbekistan, and Afghanistan, before rejoining his father's path in Pakistan.\n\n\n\n\n\n\"So there are numerous countries which are harder to get into now, and some which are easier to get into, with the politics of it all, but that's changed dramatically,\" he said.\n\n\n\n\n\nHargreaves said compared to other countries, Australia had more rules on cycling, \"and you just sort of have to adapt with it\".\n\n\n\nThroughout the journey, Jamie Hargreaves (left) said he met many \"kind strangers\". Source: Supplied / Jamie Hargreaves Despite the changes and differences, Hargreaves said the kindness of strangers has \"remained the same\".\n\n\n\n\n\nHe encouraged people to travel and see the world through their eyes.\n\n\n\n\n\n\"When you actually get out there and go to these places that you're warned about, they're the most friendly places on Earth.\n\n\n\n\n\n\"And in actual fact, the world is a much kinder place than it seems to be.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-can-early-education-make-your-children-happy-adults/mmfxffw5a",
    "title": "INTERVIEW: Can early education make your children happy adults?",
    "publish_date": "Sat, 20 Dec 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/what-is-denmarks-not-so-secret-recipe-for-happiness/vpa6gxmjy",
    "title": "What is Denmark's not-so-secret recipe for happiness?",
    "publish_date": "Sat, 20 Dec 2025 20:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe festive season is known as a time to spread kindness and goodwill but in Denmark, learning and practising traits like compassion and empathy is a year-round craft.\n\n\n\n\n\nSince 1993, all Danish students aged six to 16 experience social-emotional learning through the school curriculum.\n\n\n\n\n\nJessica Joelle Alexander is a parenting expert and cultural researcher, with a specific expertise in the Danish parenting approach.\n\n\n\n\n\n“Danes believe that if you don't feel well, you don't learn well. And so they find it's really important that we dedicate time to make sure that the class as a unit is feeling good. And there's also a big belief that our wellbeing is very tied to our sense of belonging and how we get along with others.”\n\n\n\n\n\nThese classes are seen as important developmental building blocks - teaching children skills like emotional intelligence, building resilience, cooperation and active listening.\n\n\n\n\n\n“I think the biggest mind shift I've had is how much kids also need help with their relationships and when they get that help when they're younger, so they don't get into as much bullying, they don't get into as much girl drama - when they go into the work life, there's also more empathy for Moms, and there's more empathy for other situations that if we don't learn that early on, then we kind of grow up to be big kids.”\n\n\n\n\n\nDanish early childhood teacher, Nana Hammer, has grown up with this system.\n\n\n\n\n\n“We sat for maybe one and a half hours and discussed what was happening in the classroom, what were the dynamics, how did something made you feel? Was there anything you were struggling with? Do you find that there's any bullying?And it was actually a beautiful opportunity to touch base with your peers and again, be reminded that you're not the only one struggling with this. There are other people we might help each other.”\n\n\n\n\n\nNow teaching at a kindergarten in Sydney, she is passionate about passing these skills on.\n\n\n\n\n\n“I think something that's just really beneficial when you want to promote empathy within children is to look at it with a way bigger lens kind of, and really expand the term empathy. So being empathetic could be being polite. It could also be being aware of your surroundings.”\n\n\n\n\n\nSome researchers have linked this Danish method of learning empathy to higher levels of emotional resilience, social connectedness and even improved academic results.\n\n\n\n\n\nAccording to the World Happiness Report, Nordic countries once again lead the happiness rankings with Finland, Denmark, Iceland and Sweden sitting in the top four spots.\n\n\n\n\n\nAustralia is placed in 11th place, the United States in 24th, with social isolation one reason cited for declining wellbeing.\n\n\n\n\n\nThis is Jessica Joelle Alexander, again.\n\n\n\n\n\n“The Danish way is very much focused on a sense of happiness that comes from within. And that basically means that you feel good with who you are no matter what your accolades are.”\n\n\n\n\n\nIn Australia, ethics classes are run in hundreds of schools and are facilitated impartially by trained volunteers.\n\n\n\n\n\nFeyza Tuncay is a volunteer teacher with Primary Ethics, an ethics education provider.\n\n\n\n\n\n“They build skills in critical thinking, collaborative thinking, because they think for themselves, but they do it with other students, with their peers. They take away the notion that there are diverse opinions, there are diverse backgrounds. They learn how to have this respectful discussions or disagree respectfully.”\n\n\n\n\n\nUsing age-appropriate scenarios, students are encouraged to discuss their responses.\n\n\n\n\n\n“There are topics like empathy, fairness, we talk about is lying ever okay. We talk about boasting, bragging or sharing. With older ages we talk about jumping to conclusions, voting we talk about AI interacting with AI. So there is a wide range of topics.”\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/santa-elves-under-pressure-as-christmas-eve-nears/0ft4ivo16",
    "title": "Santa, elves under pressure as Christmas Eve nears",
    "publish_date": "Sat, 20 Dec 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nSanta Claus Village sits perched on the edge of the Arctic Circle, about eight kilometres north of Rovaniemi, the capital of Finnish Lapland.\n\n\n\n\n\nAt this time of year, the sun doesn't rise until around 11am, but that doesn't stop Santa and his trusty elves from busily making their final preparations for Christmas Eve.\n\n\n\n\n\n\"The preparations for Christmas are going so good because the elves have been very busy. And they are very skilful. They are hardworking and they have been doing a lot. There's lots to do with the gifts, for example. They have been training the reindeer, of course. And we have been polishing Rudolph’s nose, of course, that's one thing you have to do for Christmas. There has been very much, and we have done almost all.\"\n\n\n\n\n\nWith Santa's list almost complete, he's now able to give his verdict on whether children have been naughty or nice during 2025.\n\n\n\n\n\n\"I think mostly they have been quite good almost all the time, and that's enough. I always say that if you try to do your best, that is enough. There was a rumour that I have been saying that you should be very nice and kind all the time. That's not possible. I think adults know that. It's not possible and that's not a demand. So, please try to do your best, that is enough.\"\n\n\n\n\n\nAccording to the local tourist board, over 700,000 people typically visit the Christmas-themed destination every year to meet Santa, play in the snow and get in the festive spirit.\n\n\n\n\n\nVisitors from Britain, Singapore and Italy say it's been a magical experience.\n\n\n\n\n\n\"It's absolutely magical. It's just once you're here, you're in Father Christmas Land.\"\n\n\n\n\n\n\"For me, it's very magical because it's kind of my second time seeing snow and this is my first time seeing such thick snow, so I feel really happy.\"\n\n\n\n\n\n\"It's hard not to feel Christmas here. You have the snow, you have the lights, you have the elves...\"\n\n\n\n\n\nMeanwhile, for Australians Todd Pattison and Evelyn Morris the snowy white Christmas is a break from their tradition.\n\n\n\n\n\nPATTISON: \"Pretty different. I think it's like 42 degrees Celsius at home at the moment, so we're sending photos to the family and they're pretty shocked.\"\n\n\n\n\n\nMORRIS: \"Yeah, everyone wears their Christmas jumpers but it's in rash vest form, so you can swim in the pool in them. We don't really have the classic Christmas jumpers.\"\n\n\n\n\n\nSanta Claus can be found here every day of the year - even in the middle of summer.\n\n\n\n\n\nSanta says sometimes he has a strange reaction from adults and has even found himself under close scrutiny from sceptics.\n\n\n\n\n\n\"The first question is, 'where is the blue bicycle I wrote to you in my letter about 40 years ago', for example? Or the train set or something like that. It comes quite often they are asking for that. Then we are thinking about it. First thing I ask, did you write me a letter then? And then there's a quiet moment because they remembered that they didn't write me a letter.\"\n\n\n\n\n\nFor those who can't meet Santa in person, there's always good, old-fashioned mail.\n\n\n\n\n\nIn the nearby post office, Santa's elves are busily sorting through thousands of letters sent from all around the world.\n\n\n\n\n\nOne elf, Elina, says times have changed but their jobs remain the same.\n\n\n\n\n\n\"Things like Legos are always popular, books as well. But nowadays, also of course electronics, new phones or laptops and things like that. And this year, I would say, Labubus have been a big, big hit as well.\"\n\n\n\n\n\nThe post office receives over half a million letters and wish-lists every Christmas.\n\n\n\n\n\nAt peak times, it can rise to over 30,000 letters a day.\n\n\n\n\n\nThe most mail comes from Poland, Italy, Taiwan and Japan.\n\n\n\n\n\n\"Even though most people are now sending most of their messages through online ways, they still know that Santa Claus is an old-fashioned person and prefers the actual letters.\"\n\n\n\n\n\nWhen all the letters are read and presents packed, Santa delivers his Christmas message to the world, hoping those who celebrate can share in his wish for peace.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-acccs-new-warning-about-the-dangers-of-ai-for-consumers/nq4e3cfew",
    "title": "INTERVIEW: ACCC’s new warning about the dangers of AI for consumers",
    "publish_date": "Fri, 19 Dec 2025 21:30:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/ben-hasnt-seen-his-loved-ones-for-13-years-this-australian-bakery-offered-him-a-job-and-a-new-family/xfom43s0z",
    "title": "Ben hasn't seen his loved ones for 13 years. This Australian bakery offered him a job and a new ‘family’",
    "publish_date": "Fri, 19 Dec 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Christmas cheer is rolling out at a wholesale bakery in Sydney. And trainee Ben – a recent arrival in Australia - is busy learning on-the-job.\n\n\n\n\n\n“Thank you God for my life because today I'm still alive and I am here and I'm working and is happy thing.”\n\n\n\n\n\nIt’s a fresh start for Ben, who fled Afghanistan 13 years ago and later struggled to survive as a refugee in Asia.\n\n\n\n\n\n“I lived in Indonesia, Jakarta. And that time I don't have any work because refugee there can’t work.”\n\n\n\n\n\nBen is now learning to make fruit mince pies for Christmas, with Samia Salhab a refugee from Syria.\n\n\n\n\n\n“She's my leader so she teach me everything. Yeah. Because I am just working more than two months so I need to more practice.”\n\n\n\n\n\nDespite coming from different cultural backgrounds, Ms Salhab says they communicate well.\n\n\n\n\n\n“We don't speak same language, he's from different nationality, but we speak English. Ben, he's very good person. He try to learn, he want to work.”\n\n\n\n\n\nBoth are grateful for steady jobs at the Bread and Butter Project, a social enterprise bakery in the inner-west suburb of Marrickville. Ms Salhab says the bakery is more than just a workplace.\n\n\n\n\n\n“Yeah, the bread and butter project, they are my second family. We receive good money, we can pay our rent, we can - I bought a car already and I can save some money sent to my family in Syria and it's very good. It's perfect for me!”\n\n\n\n\n\nThe bakery has grown steadily since co-founder Paul Allam started up in 2013. He says it now employs 40 staff producing 1.5 million products each year.\n\n\n\n\n\n“The turnover is around $5 million. I think it's actually a little bit above that at the moment. So we put through thousands and thousands of loaves every week”\n\n\n\n\n\nWith a background in baking, Mr Allam was inspired to start the business after helping to set up a similar project with Karen refugee women in an orphanage on the Thai-Myanmar border.\n\n\n\n\n\n“And I worked with probably 20 to 25 Karen women and we built this little bakery within the orphanage. And the last day we had all this product ready to go out and then the cafe owners came and the restaurant owners came and we signed up, I think it was eight accounts that day. It's very rare that bakers do, sort of, work abroad. We're not doctors, we're not engineers. So this was an opportunity for me to give a little bit back.”\n\n\n\n\n\nHis Sydney bakery is now among 12,000 social enterprises in Australia – and focussed on training new arrivals. Tara Anderson is CEO of leading non-profit industry body, Social Traders.\n\n\n\n\n\n“Every year in Australia, social enterprises like the Bread and Butter project create 16 million hours of employment for people like Ben in their workforce. And across a year that's a total of 85,000 jobs that are created for people that would otherwise struggle to find them.”\n\n\n\n\n\nSo far, the bakery has put 120 new arrivals through its rigorous training scheme. CEO Eva Rabanel explains:\n\n\n\n\n\n“There are many barriers for newly arrived refugees and we are bringing in people from all walks of life. Our program runs for three to six months. Our participants will receive training, hands-on training on how to make bread and pastry products and they'll also receive all sorts of wraparound support while they're here, such as one-on-one English tutoring. Our objective is at the end of the program to ensure they've got an ongoing permanent job offer.”\n\n\n\n\n\nBen dreams of one day opening his own business and says – for now - baking bread is his way to give back.\n\n\n\n\n\n“I make bread with love and people I hope they enjoy when they eat the bread.”\n\n\n\n\n\nBut this holiday season, he feels far from loved ones in Afghanistan’s capital Kabul.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/national/starc-claims-crucial-breakthrough-20251221-p5npbe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Starc claims crucial breakthrough",
    "publish_date": "Sun, 21 Dec 2025 12:52:57 +1100",
    "category": "finance",
    "authors": [],
    "text": "Starc claims crucial breakthrough\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/national/sorry-sight-injury-rocks-lyons-ashes-dream-20251221-p5npba.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Sorry sight': Injury rocks Lyon's Ashes dream",
    "publish_date": "Sun, 21 Dec 2025 12:23:00 +1100",
    "category": "sports",
    "authors": [],
    "text": "'Sorry sight': Injury rocks Lyon's Ashes dream\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/lyon-injury-rocks-australia-on-final-day-of-adelaide-test-20251221-p5npai.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lyon injury rocks Australia on final day of Adelaide Test",
    "publish_date": "Sun, 21 Dec 2025 12:22:56 +1100",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Nathan Lyon is likely to take no further part in the Ashes after injuring his hamstring while fielding on the final day of the third Test in Adelaide.\n\nAs Australia searched for wickets in pursuit of an Ashes victory, Lyon clutched at his right hamstring after fielding a ball at fine leg on Sunday. He will take no further part in the match.\n\nNathan Lyon has injured himself on day four of the Adelaide Test. Credit: Getty Images\n\nThe spinner, who’d taken 3-77 off 25 overs in England’s second innings, walked off the field after throwing the ball back.\n\nMarnus Labuschagne had a brief conversation with Lyon as he walked towards the dressing room and patted the off-spinner on the back.",
    "source": "TheAge",
    "cluster_id": 2
  },
  {
    "url": "https://www.theage.com.au/national/victoria/take-the-age-quiz-20230608-p5df2m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Take The Age quiz",
    "publish_date": "Sun, 21 Dec 2025 12:02:30 +1100",
    "category": "finance",
    "authors": [],
    "text": "WHERE AM I?\n\nWhat is the name of this bridge?\n\nThis city bridge lights up for the holiday season every year, and opened during Moomba celebrations in 1990. Twenty-five years later, the 45-metre structure was renamed in honour of a politician who was integral in the development of its surrounding location. What is the name of the bridge and where is it located? Check the next quiz for the answer.\n\nLast week’s WHERE AM I? St Paul’s Anglican Church is in Westmeadows.",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/national/nsw-premier-chris-minns-urges-protesters-to-avoid-gathering-today-20251221-p5npaz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "NSW Premier Chris Minns urges protesters to avoid gathering today",
    "publish_date": "Sun, 21 Dec 2025 11:52:55 +1100",
    "category": "finance",
    "authors": [],
    "text": "NSW Premier Chris Minns urges protesters to avoid gathering today\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/walker-secures-back-to-back-world-cup-wins-20251221-p5npat.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Walker secures back-to-back World Cup wins",
    "publish_date": "Sun, 21 Dec 2025 11:40:48 +1100",
    "category": "sports",
    "authors": [],
    "text": "Walker secures back-to-back World Cup wins\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw17-leeds-vs-crystal-palace-20251221-p5npah.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW17: Leeds vs Crystal Palace",
    "publish_date": "Sun, 21 Dec 2025 10:31:27 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW17: Leeds vs Crystal Palace\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw17-everton-vs-arsenal-20251221-p5npag.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rapid Recap | MW17: Everton vs Arsenal",
    "publish_date": "Sun, 21 Dec 2025 10:28:12 +1100",
    "category": "sports",
    "authors": [],
    "text": "Rapid Recap | MW17: Everton vs Arsenal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/what-christmas-day-weather-will-be-like-around-australia-20251221-p5npae.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "What Christmas Day weather will be like around Australia",
    "publish_date": "Sun, 21 Dec 2025 10:23:37 +1100",
    "category": "finance",
    "authors": [],
    "text": "What Christmas Day weather will be like around Australia\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/ashes-cricket-live-australia-look-to-go-3-0-up-on-day-five-in-adelaide-20251220-p5np94.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Ashes cricket LIVE UPDATES | England need 126 runs to pull off miracle win with three wickets in hand at lunch. Lyon out injured.",
    "publish_date": "Sun, 21 Dec 2025 10:03:08 +1100",
    "category": "sports",
    "authors": [
      "Peter Ryan",
      "Daniel Brettig",
      "Tom Decent",
      "Dan Walsh"
    ],
    "text": "England have reduced the target to 128 runs with three wickets in hand after bringing up the 300 for the second time this series. They have batted well and added 40 runs since the new ball was taken. Smith will be regretting his shot but he did enough to build the tension. Starc and Cummins are on and looking dangerous but the runs are still flowing.\n\nNathan Lyon has been taken from the ground for scans on that right hamstring of his. Meantime, the rain earlier this session has pushed lunch back half an hour to 1pm AEDT. If England are nine down at any point before that an extra half hour’s play for the game to be wrapped up can be taken.\n\nEngland 7-307 Target 435",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/world/north-america/girls-as-young-as-14-recruited-for-sexual-massages-second-batch-of-epstein-files-reveals-20251221-p5np9c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Girls as young as 14 recruited for sexual massages, second batch of Epstein files reveals",
    "publish_date": "Sun, 21 Dec 2025 10:01:49 +1100",
    "category": "finance",
    "authors": [
      "Michael Koziol",
      "Ellen Connolly"
    ],
    "text": "The person, whose name was redacted, said she ended up bringing seven to 10 “pretty girls” to Epstein’s mansion, including friends from high school and other acquaintances. “I asked them if they were interested in making extra money and that I knew an older wealthier man in Palm Beach who liked to have massages, and they would get paid $200,” she said. Jeffrey Epstein’s home in Palm Beach, Florida. Credit: AP “I would explain to them in detail what was expected of them when they showed up at the house. And I also told them that if they are underage just lie about it and tell him that you are 18.” The Epstein victim told the grand jury that she once brought a 23-year-old woman to the house, but Epstein didn’t like her. “He thought she was kind of too old.”\n\nShe also said: “The more you did … the more [money] you make. Basically, the more clothes that come off, the more you let him touch you, the more you just let him have his way with you … the more that you would make. Otherwise, you would be demoted down to bringing girls over and just making money that way.” One of the victims who was giving massages to Epstein from age 16, said Epstein gave her a vibrator for her 18th birthday. “She was very, very embarrassed,” the FBI agent who interviewed her told the grand jury. He also gave her on occasions “three sets of bra and underwear, panties, Victoria’s Secret bra and underwear sets”. He also rented her a car for several months. Jeffrey Epstein, in court in 2008, died in jail in 2019 while awaiting trial on sex-trafficking charges. Credit: AP A handwritten document contained in the files appears to be written by one of his victims, who was 16. She refers to Epstein as “JE” and being offered $200.\n\n“Met my friend Jeff. Big house,” she writes. A handwritten note from one of his victims. Credit: US Department of Justice Another teenage girl gave evidence that during the 45-minute massage, Epstein asked her if she wanted to earn an extra $100 for performing a sex act. Following the massage, Epstein handed her $300. She noticed on the walls of the room “a mural or pictures of naked girls either exposing their breasts or completely naked.” In another transcript, an FBI agent told the jury about a girl identified as Jane Doe 3, who first encountered Epstein when she was 17.\n\n“She was aware she was one of Epstein’s favourites, according to several of the other girls,” the FBI agent testified. There were 125 phone calls between her and Epstein from December 2004 to October 2005. During the massages, they spoke about what grade she was in and the prom she was going to. She was also given gifts, including Victoria’s Secret underwear. “She did not tell him how old she was, but she did tell him where she planned on going to school,” the agent said. “She stated that when it came to her age, that Mr Epstein didn’t care.” Loading Despite the evidence of widespread criminality given to the grand jury, the indictment was abandoned for a favourable plea deal cut between Epstein’s lawyers and then US attorney in the Southern District of Florida, Alexander Acosta, who would later become labour secretary in the first Trump administration.\n\nUnsealed transcripts from the 2019/20 grand jury investigation into Maxwell also shed light on how Epstein’s friend and accomplice aided and abetted his activity. An FBI agent described how one of Epstein’s victims said her visits to Epstein’s home were “strange”, but that “Maxwell normalised it for her”. “She was like a cool older sister and made comments like: ‘This is what grown-ups do,’” the agent testified. They recounted a story from one victim – who had by then turned 18 – who said Maxwell had shown her to a bedroom at Epstein’s house, where a schoolgirl outfit was lying on the bed. Loading",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/culture/music/this-band-just-scored-an-aria-1-next-week-they-re-busking-for-loose-change-20251219-p5nozb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "This band just scored an ARIA #1. Next week, they’re busking for loose change",
    "publish_date": "Sun, 21 Dec 2025 10:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "Karl Quinn"
    ],
    "text": "Two weeks ago, The Pierce Brothers – 35-year-old twins Patrick and Jack – had the No.1 Australian album on the ARIA Chart. On Tuesday, they’ll be busking for spare change in Melbourne’s City Square.\n\nFor once, though, this isn’t a story about the fickle nature of the music industry. It’s a tale of going back to where it all began … give or take a few hundred metres.\n\nTwins Pat (left) and Jack Pierce – aka The Pierce Brothers – first attracted attention busking near Bourke Street Mall. They’re now a global touring act with two ARIA #1 albums to their name. Credit: Jason South\n\n“We started busking just there – just there,” says Jack, pointing excitedly from the portico of the former GPO building where we’re having coffee to a spot on the Elizabeth Street footpath, just a few metres from Bourke Street.\n\n“We weren’t allowed to play in the mall yet because you have to be busking for six months before you can apply to audition for a spot there.”",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/business/companies/elon-musk-wins-legal-fight-to-keep-210-billion-pay-deal-20251221-p5npa6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Elon Musk wins legal fight to keep $210 billion pay deal",
    "publish_date": "Sun, 21 Dec 2025 09:55:48 +1100",
    "category": "finance",
    "authors": [
      "Emmett Lindner",
      "Peter Eavis",
      "Rebecca F. Elliott"
    ],
    "text": "Elon Musk secured a major victory on Friday when the Delaware Supreme Court reinstated his 2018 pay plan at Tesla, now worth $US139 billion ($209.9 billion).\n\nIt was Musk’s second significant financial win at the carmaker in two months. He will retain the Tesla stock options he earned for managing the company over the past several years, while remaining eligible for a new package that could make him the world’s first trillionaire.\n\nElon Musk will get to keep the Tesla stock options he earned for managing the company over the past several years. Credit: AP\n\nThe 2018 package was struck down last year by a Delaware Court of Chancery judge, who ruled that shareholders had not been properly informed about the plan and that Tesla’s board had not acted independently of Musk when making the award. The judge said Musk had effectively overseen his own compensation plan.\n\nTesla and Musk appealed that ruling, arguing that Delaware courts should honour a subsequent vote by shareholders that reaffirmed the package.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/culture/celebrity/bbc-under-pressure-to-axe-david-walliams-shows-over-alleged-behaviour-20251221-p5np9o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "BBC under pressure to axe David Walliams’ shows over alleged behaviour",
    "publish_date": "Sun, 21 Dec 2025 09:38:00 +1100",
    "category": "finance",
    "authors": [
      "Fiona Parker",
      "Martin Evans",
      "Amy Gibbons"
    ],
    "text": "The BBC has refused to drop David Walliams from its Christmas schedule despite pledging to cut ties with him.\n\nWalliams, who is one of the country’s most successful children’s authors, was dropped by his publisher HarperCollins on Friday following a London Telegraph investigation into alleged inappropriate behaviour towards young women.\n\nDavid Walliams at the London film festival in London in October. Credit: Scott A Garfitt/Invision/AP\n\nHe was accused of harassing a female member of staff at the firm. The employee subsequently left with a five-figure payout.\n\nFollowing the allegations, the BBC announced it was planning no future projects with the former Little Britain star. But the corporation will broadcast an episode of the panel show Would I Lie To You? on Boxing Day, with Walliams appearing as a guest. The BBC is also set to show two adaptations of his children’s books, Mr Stink and The Boy in the Dress, on December 21.",
    "source": "TheAge",
    "cluster_id": 27
  }
]