[
  {
    "url": "https://www.9news.com.au/world/haley-joel-osment-charged-with-cocaine-possession-and-being-drunk-in-public/1b26167c-7d55-4b36-a6fe-3985b3e68524",
    "title": "Haley Joel Osment charged with cocaine possession and being drunk in public",
    "publish_date": "Fri, 18 Apr 2025 01:08:32 +0000",
    "category": "entertainment",
    "authors": [
      "Apr"
    ],
    "text": "Oscar-nominated actor Haley Joel Osment has been charged with public intoxication and cocaine possession after his arrest earlier this month at a Northern California ski resort.\n\nThe Mono County District Attorney's office announced the misdemeanor charges Thursday against the 37-year-old actor, who starred as a child in movies \"The Sixth Sense\" and \"A.I.\"\n\nOsment was arrested April 8 at the Mammoth Mountain ski resort on suspicion of public intoxication, District Attorney David Anderson said in a news release.\n\nREAD MORE: Woman kidnapped from home before body found in burnt out car ﻿\n\nHaley Joel Osment attends a screening of \"Poker Face\" during PaleyFest on Saturday, March 29, 2025, at the Dolby Theatre in Los Angeles. (Photo by Willy Sanjuan/Invision/AP, File) (Willy Sanjuan/Invision/AP)\n\nThe actor is due to be arraigned on July 7.\n\nHis representative did not immediately return a message seeking comment on the charges Thursday.\n\nOsment rose to fame and received a best supporting actor Oscar nomination for starring opposite Bruce Willis in M. Night Shyamalan's thriller \"The Sixth Sense.\"\n\nTwo years later he starred in Steven Spielberg's \"A.I.\" and has worked consistently as a voice actor since then.\n\nHe's also appeared in the television series \"The Kominsky Method\" and \"What We Do in the Shadows.\"\n\nOsment is among the thousands of people who lost their homes in January's devastating Eaton Fire in the Altadena area near Los Angeles.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/restaurant-chain-faces-outrage-after-carving-up-500yearold-oak-tree/d9fa9744-d914-4126-8a40-15c7167e9be1",
    "title": "Restaurant chain faces outrage after carving up 500-year-old oak tree",
    "publish_date": "Thu, 17 Apr 2025 23:50:11 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "A restaurant chain has apologised after sparking outrage when it cut down an oak tree in London that was believed to be up to 500 years old.\n\nDescribed by British conservation charity the Woodland Trust as \"one of London's largest and most significant ancient trees,\" the huge oak was located outside a branch of Toby Carvery, a popular restaurant chain known for its roast dinners, in Whitewebbs Park in the borough of Enfield.\n\nThe tree's remains, surrounded by its severed branches, were discovered by council workers on April 3. Enfield Council owns the land the tree was located on, and it is leased to Toby Carvery.\n\nA centuries-old oak tree in Enfield, London, was cut down earlier this month. (James Veysey/Shutterstock via CNN Newsource)\n\nThe owner of Toby Carvery, Mitchells & Butlers, said the chain was advised by contractors to cut the tree as it \"caused a potential health and safety risk.\"\n\nWith a girth of 6.1 metres, the tree ranked in the top 100 of London's 600,000 oak trees for size, according to the Woodland Trust.\n\n\"I am outraged that the leaseholder has cut down this beautiful ancient oak tree without seeking any permissions or advice from Enfield Council,\" said Ergin Erbil, the leader of Enfield Council, in a statement Wednesday. \"We have evidence that this tree was alive and starting to grow new spring leaves when this action was taken.\"\n\nHe said the council believes the action has \"broken the terms of the lease which requires Toby Carvery to maintain and protect the existing landscape.\"\n\n\"The tree was the oldest one on site and cutting it down seems to be a clear breach of this condition. This tree would have been home to countless wildlife, fungi, and pollinators. This tree is a part of our ecological and cultural heritage,\" he added.\n\nThe council said it is considering legal action.\n\nAccording to the council, when experts inspected the oak in December, it was deemed \"healthy\" and \"posed no risk\" to the neighbouring carpark and its users. An emergency tree preservation order has been imposed on the base of the stump, the Woodland Trust said.\n\nA spokesperson for Mitchells & Butlers said in a statement to CNN that the felling of the tree was \"an important action to protect our employees and guests as well as the wider general public.\"\n\n\"We took necessary measures to ensure any legal requirements were met,\" it added.\n\nPhil Urban, the chain's CEO, later apologized for \"all the anger and upset that this incident has caused.\"\n\n\"Clearly the felling of a beautiful old tree is a very emotive subject and is not something that any of us would undertake lightly,\" said Urban in a letter addressing the incident. \"We cannot undo what has been done,\" he said, adding: \"We need to tighten our protocols.\"\n\nBenny Hawksbee, who lives in Enfield and is a member of the Guardians of Whitewebbs group, said in the Woodland Trust statement that people want \"answers.\"\n\n\"The tree belonged to Enfield and to our national heritage. I am devastated,\" said Hawksbee.\n\nJon Stokes, director of trees, science and research at the Tree Council, said in the trust's statement that ancient oaks can live up to 1,000 years.\n\nDespite the damage, council leader Erbil said the oak \"shows clear signs of life,\" adding: \"We will also do everything we can to help the tree regrow.\"\n\nThe Metropolitan Police Service told CNN in a statement Thursday that it was treating the felling as a civil matter and has closed its investigation.\n\nThis is not the first time that the felling of a tree has sparked outrage in the United Kingdom.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/federal-election-2025-negative-gearing-capital-gains-tax/df15d235-07b5-4b5e-a952-a28db713befb",
    "title": "Election war of words erupts over $180b tax break for investors",
    "publish_date": "Thu, 17 Apr 2025 19:22:02 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "A﻿n election war of words has broken out over negative gearing and the capital gains tax discount as new data reveals the multibillion-dollar cost of the tax breaks.\n\nVoters are split over the controversial concessions and both major parties have been grilled over their plans this federal election.\n\nWhile the Greens have lobbied hard for a reform﻿ and leader Adam Bandt blamed the capital gains discount for the housing crisis, Prime Minister Anthony Albanese and Opposition Leader Peter Dutton have denied there will be any changes made to either.\n\nPeter Dutton said during the second debate that cutting negative gearing would hurt renters. (James Brickwood)\n\nReports first emerged last year that federal Treasury had investigated a potential overhaul of the tax concessions awarded to property owners.\n\n\"It certainly wasn't commissioned by us to do so,\" the PM said when asked during the second debate on Wednesday night about the Treasury modelling.\n\nBut Treasurer Jim Chalmers had publicly stated back in September that he asked Treasury for \"advice\" about the subject, leading Dutton to claim in the debate that Albanese had a \"problem with the truth\".\n\nChalmers yesterday sought to strike a clear difference between that advice and \"modelling\".\n\n\"I've said on a number of occasions now that I sought a view,\" Chalmers said.\n\n\"Now that's different to commissioning modelling. The prime minister was asked about commissioning modelling. I sought a view.\"\n\nChalmers said it was \"normal practice\" to seek advice on such a matter and that the Treasury's view was a change to negative gearing \"wouldn't get the sort of improvement that we desperately need to see in our economy when it comes to supply\".\n\nPrime Minister Anthony Albanese was accused of lying over the Treasury's move to seek advice on negative gearing. (Alex Ellinghausen)\n\nHe said Labor was \"not proposing any changes in this area\".\n\n﻿Shadow treasurer Angus Taylor claimed Albanese \"lied\" about plans to raise housing taxes during the debate.\n\n\"The prime minister last night denied his government had modelled negative gearing changes. The treasurer confirmed in September it had,\" Taylor said.\n\n\"The prime minister lied to the Australian public on camera about his hidden plans to raise taxes on housing.\"\n\nDutton argued cutting negative gearing would worsen the rental market.\n\n\"I have stated very clearly, we want a sustainable housing market, which includes rental stock,\" the opposition leader when debate moderator David Speers asked why his party wouldn't change the capital gains tax discount or negative gearing.\n\n\"If you want to cut out negative gearing, as the Labor Party and the Greens would love to do, you will stop investment taking place for properties that are ultimately rented by young Australians.\"\n\nGreens leader Adam Bandt said the Greens would reform tax concessions for investors. (Alex Ellinghausen)\n\nREAD MORE: When shops will be open and closed this Easter around the country\n\nA report released today by parliament revealed the cost of revenue forgone due to both negative gearing deductions and capital gains discounts was $11.9 ﻿billion in the 2024/25 financial year.\n\nIt's estimated the combined cost will reach $180.5 billion over the next 10 years from 2026/27 until 2035/36.\n\nGreens spokesperson for housing and homelessness Max Chandler-Mather said the Greens would work to abolish \"massive tax handouts\" for property investors.\n\n\"The Greens will right the wrongs of decades of housing failure and end the tax handouts for investors with more than one investment property that are turbocharging house prices and denying renters the chance to buy a home,\" Chandler-Mather said.\n\n\"How is it fair that a young family loses at an auction to an investor buying their 10th property because that investor has massive tax handouts from the government?\"\n\nFormer prime minister Malcolm Turnbull said in a post on X that negative gearing is \"examined by every government\".\n\n﻿\"It is a major tax concession and always contentious and so it is always looked at – what does it cost?\" Turnbull said.\n\n\"What would particular changes mean in terms of revenue and housing affordability.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/easter-long-weekend-2025-can-you-buy-alcohol-good-friday-easter-sunday-explainer/326f1cd3-f646-495e-a540-c397d699e554",
    "title": "Where you can and can't buy alcohol today and over Easter",
    "publish_date": "Fri, 18 Apr 2025 01:42:05 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Many Australians love a drink or two over the Easter holidays , but the country's liquor trading laws restrict what can and can't be sold over the long weekend.\n\nGood Friday and the Easter weekend are some of the only days of the year that have specific restrictions on alcohol sales.\n\nIf you're in the mood for a tipple, here are the best options and what you need to know.﻿\n\nMost states will see restrictions on trading hours for alcohol purchases across venues and retail outlets. (AAP)\n\nNew South Wales\n\nOn Good Friday there is a blanket ban on all takeaway sales, whether you want a bottle from a shop, pub or restaurant - which means most liquor retail outlets will be closed in New South Wales.\n\nMost licensed premises will offer﻿ drinks in-house on Good Friday, though for some you may need to sit down with a meal.\n\nSaturday ﻿will see regular trading hours for licensed premises and retail outlets.\n\nOn Easter Sunday normal trading hours resume for licensed premises but most retail outlets will be restricted again and closed.\n\nVictoria﻿\n\nSimilar to New South Wales, Good Friday closes bottle shops unless specifically permitted otherwise.\n\nOn-premise purchases are allowed﻿ and will be offered at venues, restaurants and cafes.\n\nVenues are generally allowed to top up your glass from noon, but if your local go-to is a brewery or a distiller, you can head over at 10am.\n\nIt's safe to say regular trading hours resume Easter Saturday and Sunday - ﻿ Victoria's liquor laws don't mention any particular restrictions.\n\nREAD MORE:﻿ When shops will be open and closed this Easter around the country\n\nSome states will require you to have a 'sit-down' meal in order to purchase a drink on the venue. (A Current Affair)\n\nQueensland\n\nSimilar to Victoria, ﻿Good Friday affects trading hours of licensed premises in Queensland.\n\nTakeaway alcohol can't be sold, so retail outlets will be closed.\n\nHowever, you can buy drinks at venues from 10am to midnight, but only with a sit-down meal - as per the state government's website .\n\nThey even go as far to specifically tell us what a meal is.﻿\n\n\"A meal is food that can be eaten with cutlery while seated— for example, roast beef with vegetables\"\n\n\"It is not light takeaway food like snacks, hot chips, an entrée or kid's meal.\"\n\nRegular trading hours resume Easter Saturday, Sunday and Monday.\n\nREAD MORE: Almost every state and territory is expecting rain over Easter long weekend\n\nSouth Australia\n\nAfter legal reforms several years ago, South Australia has had all alcohol sale restrictions lifted.\n\nCurrently, South Australia has no restrictions on the sale of alcohol on Good Friday, and for the rest of the weekend.\n\nThis means venues can choose to be open over the weekend for purchases and takeaways.\n\nWestern Australia﻿\n\nIn the west of the nation, ﻿liquor stores will be closed on Good Friday.\n\nHowever, people will be allowed to have a Good Friday drink﻿ with a meal in most clubs, hotels, pubs, and restaurants.\n\nClubs will remain open until 3am.﻿\n\nRegular trading hours resume for the rest of the weekend.﻿\n\nSaturday will see regular trading hours across the country. (Nine)\n\nNorthern Territory﻿\n\nTakeaway sales are restricted on Good Friday.\n\nYou can still buy drinks at venues like restaurants, bars and clubs between 11am to 9pm so long as you buy a full, sit-down meal as well.﻿\n\nNo finger foods, sandwiches and pies for those bargaining for a drink too - the territory's website says.\n\nAustralian Capital Territory\n\n﻿For the territory where you can find the federal government, you would expect there to be harsher restrictions over the quiet, long weekend.\n\nBut patrons can keep partying over the weekend as there are no restrictions on alcohol sales or trading hours﻿ on Good Friday.\n\nTasmania﻿\n\nThe Apple Isle ﻿will see an equally, loosely restricted Easter weekend.\n\nTasmania remains much the same with no restrictions on sales or trading hours over the long weekend.﻿",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/the-highest-paying-jobs-in-construction/7de0e716-a179-44fc-93d1-baf621d6022a",
    "title": "The highest paying jobs in the construction industry",
    "publish_date": "Thu, 17 Apr 2025 19:31:37 +0000",
    "category": "finance",
    "authors": [
      "April"
    ],
    "text": "1 of 9 Attribution: Getty\n\nThe construction industry accounts for almost nine per cent of the total workforce in Australia.\n\nWith some roles in short supply and high demand, there are opportunities to earn high salaries.\n\nN﻿ew data from Hays has which roles attract the most money in the sector.\n\nThe data was compiled based on average salary ranges from 2023 to 2024.\n\nContinue through the gallery to find the highest paying roles.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/ghost-camping-victoria-local-businesses-suffer-during-school-holidays/286b0e7a-c92b-4df4-bf6c-8441aab73220",
    "title": "'Thoughtless' ghost campers costing small businesses big money",
    "publish_date": "Thu, 17 Apr 2025 10:58:38 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "A \"thoughtless\" camping trend in Victoria is costing local communities big money.\n\nThe frustrating practice of \"ghost camping\" – which is when holidaymakers book multiple free camping spots but fail to turn up – is hurting small businesses this Easter.\n\nSome blame Victoria Premier Jacinta Allan for opening the floodgates after she announced campers can stay in every national park and state forest across the state from December 1 last year.\n\nA fully booked camping ground in Tidal River. (Facebook)\n\nThe move wiped out $7.3 million in annual booking fees for campers but it's come at another high cost.\n\nIt might be the middle of the school holidays, but some usually bustling camping grounds are sitting half-empty.\n\n\"People are booking them in advance and just not turning up,\" one camper at Tidal River campground, a popular site in Wilsons Prom in southern Victoria, told 9News.\n\nBrett Beaumont, who operates the Open Air Cinema near the campground, said his business was down 65 per cent on last year.\n\n\"There's 484 campsites, roughly 150 would be occupied at the moment,\" Beaumont said.\n\n\"The consequences are my business, which has struggled.\"\n\nBeaumont claims that, in extreme cases, some families booked out a spot for an entire month when they couldn't decide which weekend to stay.\n\nWhere is the Aussie dollar still good value for travellers? View Gallery\n\nNationals MP Melina Bath said she wasn't pleased to see ghost camping at the popular Tidal River spot.\n\n\"Despite the website showing Tidal River as being fully booked, there are plenty of spare campsites and it appears quite a few 'no shows' or multiple party bookings for space,\" Bath said.\n\n\"Ghost camping looks set to continue harming local businesses and abandoning needed revenue.\"\n\nThe move wiped out $7.3 million in annual booking fees but it's come at another high cost. (Facebook)\n\nBack in January, fellow Nationals MP Danny O'Brien also took aim at the state government's free camping initiative.\n\n\"It's a shame people are so thoughtless but this could've been avoided with some foresight - require a refundable deposit or re-let sites if someone doesn't show up within 24 hours etc,\" he said on Facebook.\n\n\"Several campers stopped me as I had a look tonight to complain at what a waste it is, with international visitors and many others turned away when there are sites sitting unused.\n\n\"This has been repeated around the state and will certainly have robbed many communities of vital summer income as visitor numbers are artificially depressed.\"\n\nVictoria Minister for Environment Steve Dimopoulos said in a statement that Victorians weren't trying to \"abuse\" the system.\n\n\"I don't buy that, Victorians want to do the right thing, that's why Parks Victoria now send out two reminders to people to cancel if they can't make their booking, so that other people don't miss out,\" Dimopoulos said.\n\n\"We introduced free camping to get more Victorian families out having holidays in the regions and putting money back in their pockets.\"\n\n\"We want more Victorians to explore the great outdoors this Easter weekend, in addition to the 131 bookable campgrounds, Victorians can also stay at one of the 1000 free camping areas that are first-come-first-served across the state.\"",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/easter-long-weekend-2025-whats-open-good-friday-trading-hours-coles-woolworths-aldi-explainer/34212232-e6aa-477a-bf68-b7d8d97c9035",
    "title": "When shops will be open and closed today and over Easter weekend",
    "publish_date": "Thu, 17 Apr 2025 19:59:18 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "D﻿ashing to the shops for a quick pick-up will become more complicated than usual this Easter long weekend , with supermarkets and big stores shutting down today around the country.\n\nIt's best to shop early and be prepared, but that can be difficult with different shops shutting at different times depending on where you are in the country.\n\nHere's what you need to know about when and where you can shop.﻿\n\nMajor shops will operate on different schedules over the Easter long weekend. (Alex Ellinghausen)\n\nWhat's open on Good Friday?\n\nWoolworths confirmed it would close stores around the country today with some exceptions.\n\nThose exceptions include the stores at Brisbane Airport in Queensland; Mount Barker, Mount Barker South, and Murray Bridge Marketplace Victor Harbo﻿r in South Australia; Dunsborough, Perth Airport, Eaton Fair, Margaret River, Busselton, and Dalyellup in Western Australia.\n\nColes will close all its stores except for those at Victor Harbor, Murray Bridge Green, and Mount Barker in South Australia.\n\nBunnings and Aldi stores will be shut for the day nationwide.﻿\n\nPeople are urged to get their shopping done early. (Getty)\n\nWhat's open on Easter Saturday?﻿\n\nAll Woolworths stores will reopen tomorrow for Easter Saturday, except for several Metro outlets around the country.﻿\n\nColes will likewise be open nationwide, though some stores will be operating with reduced trading hours.\n\nAldi and Bunnings stores will be open as well.\n\nWhat's open on Easter Sunday?\n\n﻿Aldi stores will all open in Victoria and Western Australia, but it will vary around the rest of the country. Some shops will open, some won't.\n\nBunnings will also be open on Easter Sunday, though trading hours will be reduced in New South Wales.﻿\n\nWoolworths' status will vary state to state. All stores will be open in Queensland, Victoria, Tasmania, and Western Australia, with a couple of exceptions (Esperance in Western Australia, Moama in Victoria, Hervey Bay Pialba and some Metro stores in Queensland).\n\nREAD MORE: The election promises Labor and the Coalition have made to win your vote\n\nShops will be closed for multiple days. (Getty)\n\nIn NSW, the ACT, South Australia, and the Northern Territory, \"a handful\" of Woolies stores will open, with people encouraged to check the opening hours of their local outlet online .﻿\n\n﻿Similarly, Coles stores will operate differently around the country.\n\nShops will be closed in NSW, and open in Tasmania and the ACT.\n\nOutlets in Victoria, Queensland, and Western Australia will be open, but some will operate within reduced trading hours.\n\nAll shops will be open for reduced ours in the NT.\n\nIn South Australia, all stores will be closed except for Port Lincoln, Port Pirie, Port Augusta, Adelaide Rundle Place, Whyalla, Murray Bridge Green, Mount Gambier, Victor Harbor, and Mount Barker.﻿\n\nHonking goose at the centre of high-profile divorce case View Gallery\n\nWhat's open on Easter Monday?\n\nWoolworths will open their doors again for NSW, the ACT, Victoria, Western Australia, and Tasmania.﻿\n\nStores will reopen in Queensland except for Hervey Bay, Pialba.\n\nA handful of stores will be open in South Australia and the NT.﻿\n\nColes will reopen stores in every state and territory except South Australia, though in most areas (NSW, Queensland, Victoria, Western Australia, and the NT) trading hours will be reduced.\n\nTasmania and the ACT will trade unrestricted.\n\nSouth Australian stores will be closed except for Port Lincoln, Port Pirie, Port Augusta, Adelaide Rundle Place, Whyalla, Murray Bridge Green, Mount Gambier, Victor Harbor, Mount Barker, and Berri.﻿\n\nAldi outlets will be open in most states and territories, but it will vary store to store in South Australia.﻿\n\nBunnings stores will be open around the country.\n\nThe provided trading hours and information are subject to change according to individual stores. We highly encourage readers to check the operating hours of their local stores online before making the venture. ﻿",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/lady-gaga-tickets-australia-singer-set-to-tour-australia-for-the-first-time-in-11-years-heres-what-you-need-to-know/d04c176f-8a54-4036-9e31-1bb3de08080b",
    "title": "Final date added to Lady Gaga's Australian tour",
    "publish_date": "Thu, 17 Apr 2025 06:00:00 +0000",
    "category": "entertainment",
    "authors": [
      "Apr"
    ],
    "text": "An extra date has been added to Lady Gaga's Australian tour as the singer prepares to perform her first-ever stadium shows on our shores.\n\nGaga will bring her Mayhem Ball to Melbourne's Marvel Stadium, Brisbane's Suncorp Stadium and Sydney's Accor Stadium in December.\n\nAn additional Sydney show was announced today as tickets went on sale to the public.\n\nLady﻿ Gaga will perform her first-ever Australian stadium shows in December. (Kevin Mazur/Getty Images for Coachella)\n\nThe singer is set to perform at Coachella this weekend before she embarks on a world tour to promote her new album Mayhem .\n\nShe will travel through Mexico City, Singapore, the US, Canada, the UK and Europe before the show reaches Australia.\n\nWhere is Lady Gaga playing in Australia?\n\nLady﻿ Gaga will perform shows in Melbourne, Brisbane and Sydney this December.\n\nThe singer will kick off the Australian leg of Mayhem Ball in Melbourne at Marvel Stadium in Melbourne on December 5 and 6.\n\nThis will be followed ﻿by a show at Suncorp Stadium in Brisbane on December 9 and a show at Accor Stadium in Sydney on December 12.﻿\n\nREAD MORE: When shops will be open and closed this Easter around the country\n\nThe pop star will embark on a world tour following her performance at Coachella. (Kevin Mazur/Getty Images for Coachella)\n\nA fifth and final show was later announced for Accor Stadium on December 13.\n\n\"Due to overwhelming demand, a second stadium date for Sydney has been added to the Australian leg of Lady Gaga's global tour,\" promoter Live Nation said.\n\n\"This will be the final date added to this local run of shows.\"\n\nWhen was the last time Lady Gaga toured Australia?\n\nLady Gaga will touch down on our shores for the first time in 11 years.\n\nGaga last toured Australia in 2014 ﻿for the ArtRave: The Artpop Ball tour.\n\nThe singer performed six concerts in four Australian cities including Perth, Brisbane, Melbourne and Sydney.\n\nWhen do Lady Gaga tickets go on sale?\n\nTickets for the second Sydney new show will be available from Tuesday, April 22.\n\nA pre-sale event, run by Vodafone and Mastercard, will open from 11.30am (AEST).\n\nA second pre-sale event, run by touring company Live Nation, ﻿will start from 11.30am (AEST) on Wednesday, April 23.\n\nGeneral sale tickets will be made available from 12.30pm (AEST) on Thursday, April 24.﻿\n\nTickets to the singer's other dates opened to the public on Thursday, April 17.\n\nWild fashion and on-stage antics during weekend one of Coachella View Gallery\n\nHow much do Lady Gaga tickets cost?\n\nFans who were able to secure tickets in the pre-sale have speculated about the use of dynamic pricing, a system where the price of tickets changes based on demand.\n\nHowever a Ticketmaster spokesperson denied the use of surge pricing.﻿\n\n\"Ticketmaster does not have surge pricing or dynamic algorithms to adjust ticket prices,\" a spokesperson said.\n\n\"Tickets were priced in advance of the sale and set at the individual seat level.\"\n\nAccording to the Ticketmaster , tickets (including VIP packages) have been priced in advance from $118.68 to $1586.76 for the Brisbane and Sydney shows with a handling fee of $7.95 per order.\n\nTickets for the Melbourne shows are priced between $113.06 and $1581.12 and a handling fee of $9.90 per order will apply.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.9news.com.au/national/a-minecraft-movie-moviegoers-choking-after-fire-extinguisher-let-off-in-melbourne-hoyts-cinema/dbdf7ecd-f6d3-48e3-bfce-6a63ab87ac13",
    "title": "Chaos erupts in cinema leaving moviegoers 'choking and crying'",
    "publish_date": "Thu, 17 Apr 2025 01:15:54 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Moviegoers were left \"choking and crying\" after unruly teenagers set off a fire extinguisher inside a cinema in Melbourne's east.\n\nA bizarre trend taking place during screenings of A Minecraft Movie, where cinemas erupt into chaos upon one particular scene, was taken to a new level at Eastland Hoyts in Ringwood.\n\nMelbourne mother Mel told 3AW her kids were left \"terrified\" after teenagers pulled the pin on a fire extinguisher inside a dark cinema.\n\nMelbourne mother Mel told 3AW her kids were left \"terrified\". (TikTok/ finlayw14_)\n\n\"It scared a lot of children, a lot of grandparents,\" Mel told hosts Mark Allen and Jimmy Bartel.\n\n\"You couldn't breathe, you couldn't swallow, the kids were choking, my kids were crying, their eyes were burning.\"\n\nFootage of the fire extinguisher incident was also shared on TikTok.\n\nMel said Hoyts checked the bags of some moviegoers and confiscated items such as flour and toilet paper.\n\nShe claimed several teenagers later snuck out to grab the fire extinguisher mid-film.\n\n\"I don't know where they got it from,\" Mel said.\n\n\"And then, bang. We were completely doused in it.\"\n\nHoyts staff moved the innocent attendees to another room where they continued playing the film.\n\nFootage of the fire extinguisher incident was also shared on TikTok. (TikTok/ finlayw14_)\n\nUsually, fans respond to a scene titled 'Chicken Jockey' by throwing popcorn, clapping and screaming.\n\nThis has become a viral trend on social media, filled with videos of overblown reactions to the popular Jack Black film.\n\nAnother mother of a Hoyts employee told 3AW her son had been a regular witness to this disruptive behaviour.\n\n\"Everyday he comes home with a new story about what kids have smuggled in their bags to try and throw at the screen,\" Helen* said.\n\n\"Yesterday there was roast chicken, some flour.. They've got longer shifts and more cleaning to do.\"\n\nREAD MORE: The election promises Labor and the Coalition have made to win your vote\n\nHelen said workers have been asked to check bags before people enter the cinema for A Minecraft Movie.\n\n\"They're not security guards, they're 15 and 16-year-olds, and this is their part-time job,\" she added.\n\n9news.com.au has contacted Hoyts for comment.\n\n*Not her real name.﻿",
    "source": "9News",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-18/lachie-neale-brisbane-lions-online-trolls-instagram-/105191350",
    "title": "'A stain on society': Brisbane's Lachie Neale condemns online trolls",
    "publish_date": "Fri, 18 Apr 2025 01:26:28 +0000",
    "category": "sports",
    "authors": [],
    "text": "Brisbane premiership captain Lachie Neale has spoken out on the online abuse AFL players face, calling those responsible \"a stain on society.\"\n\nSpeaking in the aftermath of the Lions' heavy loss to Collingwood overnight, Neale took to Instagram to hammer the social media trolling he believes has gotten out of hand.\n\n“People hiding behind keyboards to attack players are the biggest stain on society,” Neale posted.\n\n“It’s getting beyond a joke now, the things I’ve seen sent are some of the most horrific messages I’ve ever seen. It’s a game of football, grow the f**k up.\n\n\"Cowards. Put your face and name to your words.”\n\nNeale's specific concerns remain unknown as of Friday morning but the Lions have confirmed the matter had been reported to the AFL.\n\nThe 31-year old was speaking in the aftermath of the Lions' 52-point loss to Collingwood on Thursday night which doubled as their first defeat of the season.\n\nMore to come.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-18/new-zealand-automation-in-welfare-robodebt-questions/105178948",
    "title": "Could New Zealand be headed for its own Robodebt episode?",
    "publish_date": "Fri, 18 Apr 2025 01:15:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Robodebt scheme is remembered as one of the biggest public policy scandals in modern Australia but there are fears history could repeat itself across the Tasman.\n\nNew Zealand's conservative government is currently trying to expand the use of \"automated decision-making\" in the welfare system as part of a concerted effort to rein in public spending.\n\nBut critics fear the reforms will take crucial decisions about vulnerable people out of the hands of humans and allow algorithms to determine who receives benefits.\n\nSalvation Army social policy advocate Ana Ika understands the government wants to be more efficient \"but efficiency comes at a cost\".\n\n\"This cost has human lives and those are human lives the Salvation Army sees every day,\" she said.\n\nNew Zealand's Ministry of Social Development has moved to allay concerns, arguing the technology will make the welfare system easier for people.\n\n\"Any decision to decline a benefit will always be made by a staff member,\" deputy chief executive of organisational assurance and communications Melissa Gill said.\n\n\"There are also no plans to change this.\"\n\nWhat is 'automated decision-making'?\n\nThe huge public interest in artificial intelligence has prompted questions about how automation is being used by governments and businesses. (Supplied: Jon McCormack)\n\nAutomated decision-making (ADM) describes a broad range of computerised systems that use rules-based processes to assist or replace human choices.\n\nThey range from online forms that determine how much you can borrow from a bank, to real-time, data-driven algorithms that dictate prices on ride share apps.\n\nThe ministry used the technology in 2022 to automatically grant a winter energy subsidy to more than 858,000 people, a process they say would have required about 600 full-time staff members, working for eight weeks straight.\n\n\"This would create extra cost to taxpayers and potentially delays to clients,\" Ms Gill said.\n\nIt now wants to use ADM to check whether welfare recipients have met the requirements to renew their benefits, with those rejected having to speak with a staff member.\n\n\"The wellbeing and dignity of our clients is paramount, and any ADM use must balance efficiency with these values,\" Ms Gill said.\n\nBut some advocates question whether there are enough safeguards in place to ensure the technology won't inadvertently cause a scandal similar to Robodebt.\n\nBad technology, bad decisions\n\nWelfare recipients are often also supported by emergency food services, such as The Waka of Caring in South Auckland. (ABC News: Luke Bowden)\n\nRobodebt was a debt-recovery scheme introduced by Australia's former conservative government in 2016 that promised to use automation to save billions of dollars.\n\nBut serious design flaws created more than 400,000 false debt notices and a royal commission was established amid allegations of political malfeasance and suggestions the fake debts contributed to several suicides.\n\nNew Zealand's government isn't trying to establish a debt-recovery scheme similar to Robodebt but the broad provisions governing the use of automation contained in the Social Security Amendment Bill have legal experts concerned.\n\nThe New Zealand Law Society said the clause regarding automated decision-making \"is not limited in any way and the accompanying documentation for the bill contains no analysis of the proposal\".\n\n\"It is unclear how automated systems are intended to accurately and appropriately operate where evaluative judgement is required,\" it said in a submission to a parliamentary committee considering the legislation.\n\nLearning from Australia's mistakes\n\nCharities fear the expansion of automated decision-making will negatively impact some of New Zealand's most vulnerable. (Reuters: Tomas Cuesta)\n\nIn the months before Australia's Robodebt Royal Commission in 2022, New Zealand's Ministry of Social Development introduced a set of standards to govern the use of ADM, including provisions to ensure transparency and ways to appeal automated decisions.\n\nThe standards are being reviewed this year in consultation with New Zealand's privacy commissioner.\n\nMs Gill said the ministry was \"able to learn from what happened in Australia and other parts of the world\" and ensure its safeguards would \"help to prevent many of the same problems we have seen with the use of AI in other social welfare systems\".\n\n\"MSD's ADM Standard includes additional requirements for the use of complex algorithms,\" she said.\n\n\"These requirements place greater oversight over the algorithm's development and ensure that privacy, human rights, and ethics considerations are addressed before the algorithm can be used.\"\n\nBut the Salvation Army remains wary of the further expansion of automation, as Ms Ika said there were already incidents where miscalculations impacted clients.\n\n\"Introducing additional layers on top of the complexities that are already there in the welfare system will just push people more into hardship,\" she said.\n\nMs Ika fears automation will lead to a \"blanket approach\" for some of New Zealand's most vulnerable people.\n\n\"It actually takes human oversight to be able to understand the context and the complexities of where families are coming from,\" she said.\n\nNavigating the ethics of automation\n\nMany of the clients supported by the Salvation Army have complex backgrounds and circumstances. (ABC Central West: Melanie Pearce)\n\nThe wave of public interest in artificial intelligence has prompted fresh questions about how governments and businesses use automated processes, from complex generative AI models to basic algorithms.\n\nProfessor Nicholas Agar examines the ethical implications of new technology at the University of Waikato and said AI had tremendous potential to solve complex problems and help vulnerable people.\n\nBut \"the amazing upside\" needed to be balanced with the potential risks.\n\n\"Often, when you're using a technology that you don't fully understand, and even those who make it [AI] don't fully understand it, stuff can go wrong and that hurts people,\" he said.\n\n\" People who go into AI cluelessly are going to have a bad ending. It's sort of a Robodebt kind of ending. \"\n\nThe reforms to the welfare system come as the New Zealand government tries to get 50,000 people off Jobseeker payments and into work by 2030.\n\nProfessor Agar said AI technology could be harnessed to help connect vulnerable people with services \"if we really asked it to do the right things\".\n\n\"AI can be great but if you're vague about your goals, and you say, let's make this cheaper, well, then it can be very bad,\" he said.\n\nWill the laws actually improve outcomes?\n\nEconomist Michael Fletcher has concerns about the proposed legislation beyond the expanded use of automation. (Supplied)\n\nLike many public discussions about future technology, the reality will often be very different from the risks and rewards debated today.\n\nEconomist Michael Fletcher, who was a member of the New Zealand government's Welfare Expert Advisory Group, was surprised the Robodebt scandal was not explicitly mentioned in the government's \"regulatory impact statement\".\n\nBut he has broader concerns about the punitive measures included in the legislation, from forcing jobseekers to reapply for benefits every six months instead of annually, to the use of cashless welfare cards.\n\n\"The rhetoric is around, 'Getting into work is the best way to improve outcomes and so'. My problem with this bill is that it doesn't actually do any of that,\" he said.\n\n\"It is all about a suite of measures to make it harder to get on to the benefit and harder to stay on the benefit rather than any assistance for people to go into work.\n\n\"It should really be called the social security 'hoops and hurdles' bill because that is really what it's all about.\"\n\nAs part of the welfare reforms, the government has introduced a new \"traffic light system\" to indicate whether a client is meeting their obligations to receive a benefit.\n\nNon-financial \"sanctions\" can be issued for those who fail to meet them, such as requirements to attend training programs or complete \"job-search activities\".\n\nSocial Development and Employment Minister Louise Upton in February said these sanctions \"will ensure there is accountability in the welfare system for those who aren't taking reasonable steps to seek employment\".\n\n\"It's important that beneficiaries who can work are taking reasonable steps to re-enter the workforce or remain work-ready, and that consequences exist for those who don't,\" she said.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-18/pastoral-station-beloved-surf-spot-ningaloo-reef-sale/105187248",
    "title": "Nervous wait for surfers as station around famous break for sale",
    "publish_date": "Thu, 17 Apr 2025 23:50:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "A much-loved pastoral station and surfing hotspot skirting Western Australia's remote Ningaloo coast has been listed for public sale for the first time since 2005.\n\nSpanning more than 84,000 hectares of land near Carnarvon, almost 900 kilometres north of Perth, the origins of Gnaraloo Station can be traced to the early 1900s.\n\nToday, it is most famous for its high winds and ready access to world-class surf.\n\nGnaraloo Station borders the southern entrance of the Ningaloo World Heritage Site. (ABC Pilbara: Alistair Bates)\n\nPerth realtor Jarrad O'Rourke is overseeing the sale, with both the pastoral and tourism leases carrying a combined asking price of around $17 million.\n\n\"People are very protective of it,\" he said.\n\n\"[The lease holder] doesn't want to sell it to the highest bidder … it is still currently affordable for most, and it's the most amazing place on Earth.\"\n\nThe property's heavy barrelling, left-handed break has earned the moniker Tombstones from locals, captivating and testing some of the country's most seasoned board-riders.\n\nThis surf mecca helped sustain the former sheep station amid a decades-long dispute with WA government authorities over the viability of maintaining stock.\n\nTwist in land stoush\n\nIn 2006, current lease holder Paul Richardson surrendered a 2-kilometre stretch of coastline to the Commonwealth following lengthy negotiations around the Ningaloo Marine Park.\n\nThe pastoralist later alleged the annexed strip was mismanaged by the WA Department of Biodiversity, Conservation and Attractions (DBCA), leading to erosion and the predation of loggerhead sea turtle rookeries.\n\nThe station's Three Mile campground is a popular tourist spot and a short walk from the Tombstones surf break. (ABC News)\n\nHe also said authorities refused him access to water tanks and troughs, undercutting the possibility of a profitable sheep operation.\n\nGoats nevertheless flourished on the property, with 1,500 included in the station's sale as livestock.\n\nPaul Richardson and DBCA previously fought over goats on the property. (ABC Pilbara: Alistair Bates)\n\nBut these too flared tensions between Mr Richardson and wildlife officials as distinctions between authorised and feral animals blurred.\n\nMr Richardson declined to comment on the sale.\n\nSurfers cross fingers\n\nCarnarvon local Scotty Bauer has spent years surfing and taking photos off Gnaraloo Station.\n\n\"It's essentially in my blood, being raised in the north-west,\" he said.\n\nMr Bauer welcomed a possible change in ownership, noting surfers were too often caught in the middle of Mr Richardson's stoush with the state government.\n\n\"I hope it's a fresh start for that coastline; it would be great to get someone in there that has some knowledge about running a camp of that nature mindfully,\" he said.\n\nThe surf photographer called for the station's goats to be removed, saying they had driven the World-Heritage listed coastline \"into the ground\".\n\n\"The coast is dying, it's [already] dead is some places — that is a real concern,\" he said.\n\nThe remote station is surrounded by harsh desert. (ABC News)\n\nWhile tourism became the primary business at Gnaraloo Station when Mr Richardson assumed the lease in 2005, the property has not escaped industrial interest.\n\nAndrew Forrest's Fortescue Metals Group acquired a bevy of exploration leases around the region in 2021, reaching 260km to the south of the station and about 400km to the north.\n\nAnalysts speculated the move could form a base for the mining magnate's green hydrogen ambitions, but it is understood the company has scaled back the plans.\n\nSurfer Scotty Bauer welcomed a \"fresh start\" for the station but warned buyers it \"demands respect\". (ABC News)\n\nMr Bauer said the prospect of a developer in tourism, energy or another area snapping up Gnaraloo Station was \"always in the back of everyone's minds\".\n\n\"As a community, we raise [concerns] as they come ... they've got to address all the issues with stakeholders, so good luck to them,\" he said.\n\nHe warned the place, like its famous swell, was not for the faint-hearted.\n\n\"It demands respect, really,\" he said.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-18/spursdown-frankfurt-to-make-europa-league-semifinal/105191120",
    "title": "Spurs surge to Europa League semifinal with defiant victory",
    "publish_date": "Thu, 17 Apr 2025 23:03:35 +0000",
    "category": "sports",
    "authors": [],
    "text": "A first-half penalty by Dominic Solanke secured Tottenham Hotspur a 1-0 win at Eintracht Frankfurt in the second leg of their Europa League quarter-final on Thursday for a 2-1 aggregate victory.\n\nThey will face Lazio in May for a spot in the final.\n\nSolanke gave Tottenham the lead from the spot two minutes before halftime after the visitors were awarded a penalty for a foul by goalkeeper Kaua Santos on Spurs midfielder James Maddison.\n\nMaddison headed the ball before clashing with the arriving Santos, and the referee pointed to the spot following a VAR review.\n\nThe win is an important one for manager Ange Postecoglou, who is fighting to hold his job after a difficult domestic season.\n\n\"To a man, I thought they were outstanding. I'm so proud of them,\" said Postecoglou.\n\n\"Unfortunately for a lot of you, you're going to have to put up with me a little bit longer, mate.\n\n\"We'll just see how that goes.\"\n\nTottenham continue their quest to win a first European trophy in more than 40 years after their 1984 UEFA Cup success, something that would give them redemption for a disappointing domestic season.\n\nThey reached the last four of a European competition for the first time since their run to the 2019 Champions League final, where they lost 2-0 against fellow Premier League side Liverpool.\n\nPlaying in a heavy rain, Eintracht showed more intent in the opening stages but lost Mario Goetze early on after the veteran playmaker suffered what looked like a hamstring injury.\n\nHe was replaced by Fares Chaibi, who wasted no time and had a chance with a header soon after but was denied by Tottenham keeper Guglielmo Vicario.\n\nTottenham were without their captain Son Heung-min, who did not travel due to a foot injury.\n\nMathys Tel, who signed for Spurs on loan from Bayern Munich in January, started in his place.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe 19-year-old had the visitors' first attempt on target after 26 minutes, sending a lofted shot from outside the box that forced Eintracht goalkeeper Kaua Santos into a save.\n\nEintracht, who took a sixth-minute lead in London through a fine Hugo Ekitike strike, were the better side but fell behind when Solanke sent Santos the wrong way converting coolly with a low shot down the middle of the goal.\n\nThe German side, champions in 2022, were far from willing to accept their fate and pushed for an equaliser after the restart but were missing a finishing touch.\n\nThe hosts stormed Vicario's goal with 15 minutes to go when the goalkeeper denied Chaibi from close range just before Rasmus Kristensen flashed a header just wide.\n\nThe Denmark defender had two more chances within the next minutes, shooting wide and being denied by Vicario.\n\nTottenham won the competition twice, including its inaugural edition in 1972 when they beat Wolverhampton Wanderers 3-2 on aggregate in a two-legged final.\n\nReuters",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-18/callide-power-plant-analysis-lnp-scandal/105186642",
    "title": "Blast from the past as Callide power plant presents first scandal for LNP",
    "publish_date": "Thu, 17 Apr 2025 21:04:58 +0000",
    "category": "finance",
    "authors": [],
    "text": "Rocked by a coal-fired controversy, the LNP has been sent into damage control for the first time since its Queensland election win.\n\nWhat should have been a simple exercise in lashing its Labor predecessors has put a pep in the opposition's step and sent the government's agenda offline.\n\nThe fallout from an explosion at the troubled Central Queensland Callide power station on April 4 has led the chief executive of the government-owned operator, CS Energy, to have his resignation brought forward, and another senior employee to leave the company.\n\nIt followed a less-than-stellar press conference in which Energy Minister David Janetzki conceded he should have mentioned the blast in a major energy address days after it happened.\n\nOne of Central Queensland power plant's generators will be offline until end of May. (ABC News: Scout Wallen)\n\nThe CS Energy board took the hit for the under-fire minister on Wednesday, admitting in a statement the company \"understated the gravity\" of the incident and there had not been \"adequate reporting of serious issues\".\n\nBut for a government which prides itself on media management and communication, the saga has seen its wires crossed.\n\nIt's struggled to wrestle control of the narrative, as Mr Janetzki failed to front media for more than a week, and details of the blast slowly leaked out.\n\nNot just a well-loved chocolate\n\nAdmittedly, briefing notes from the operator released by the government — an extraordinary step in itself — would be a struggle for anyone without an engineering background to grasp.\n\nBureaucrats and journalists alike learnt that a clinker was not just a well-known chocolate, but hardened ash that forms at coal-fired power stations and needs to be removed.\n\nBut probing further may have helped Mr Janetzki shed further light on the serious incident.\n\nThe CS Energy board took the hit for the under-fire minister. (AAP: Darren England)\n\nMr Janetzki has already taken steps to ensure he won't have to go through this again, implementing real-time updates for any future outages.\n\nA further source of frustration for the government will be that the Callide facility has become its first scandal, after using it as an attack line for so long in opposition.\n\nAn explosion at the power plant in 2021 left nearly half a million homes without power.\n\n'Being in government can be hard'\n\nAn expert report into the incident only came to light last year, with the then-LNP opposition calling for energy minister at the time Mick de Brenni to be sacked.\n\n\"Queenslanders' energy bills went up because of Labor's Callide cover-up. Ministers must be held accountable,\" a June 2024 media release from Mr Janetzki stated.\n\nA re-energised Mr Miles was in his element in a press conference on Monday. (ABC News: Kenji Sato)\n\nAs pointed out almost gleefully by Opposition Leader Steven Miles this week, \"being in government can be hard\".\n\nThe past week may have rammed that home for Mr Janetzki.\n\nLights are back on at Labor HQ\n\nMr Miles's campaigning efforts may have prevented an all-out whitewash at the October state election, but Labor was still battered and bruised after being thrown out of government.\n\nCallide operator concedes it 'understated the gravity' of explosion Photo shows A power station surrounded by trees. One of Central Queensland power plant's generators will be offline until the end of May after a blast on April 4.\n\nIt's struggled to get much cut through in opposition, often screaming into the abyss about health cuts.\n\nA slew of natural disasters has also made its task difficult, not wanting to be seen making cheap political points in a crisis.\n\nThe past week it's managed to occupy the vacuum left by the government's incoherent narrative, all too eager to return serve on the shots it was forced to endure thanks to the beleaguered power station.\n\nA re-energised Mr Miles was in his element in a press conference on Monday, seemingly wrapping up a response to a question about the saga, before what seemed to be an actual light bulb moment.\n\n\"And just one other thing on that topic\", he said before launching into another attack line.\n\nA long-awaited review into Queensland Health's capacity expansion program released this week is likely to mean the government will need to extend the timeline for its delivery of thousands of new hospital beds, delivering what Labor hope will be another win.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-18/oldest-solo-woman-sailor-jeanne-socrates-world-record-holder/105159996",
    "title": "At 82, Jeanne is still charting a 'marvellous' solo life on the high seas",
    "publish_date": "Thu, 17 Apr 2025 21:00:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "A simple mantra has helped Jeanne Socrates endure tough times alone at sea.\n\n\"It can't last forever. If I can get through this time, I'll be fine,\" the 82-year-old said of the positive mindset she lives by.\n\n\"That's the thing that keeps me going.\"\n\nThe British yachtswoman, who is sailing up the east coast of Australia, has spent plenty of time navigating the sometimes challenging conditions of the ocean.\n\nShe has faced \"really rough seas\" and endured a major accident when she was thrown off her boat around a decade ago.\n\n\"I broke my neck, I 'stove-in' my rib cage, had major internal injuries,\" she recounted.\n\n\"I was in a bad way and I took quite a time to recuperate.\"\n\nMs Socrates has been sailing for three decades. (ABC South East NSW: Floss Adams)\n\nBut the determined Ms Socrates did not let her injuries get in the way of her dreams.\n\nYears after her accident, Ms Socrates became recognised by Guinness World Records as the oldest woman to sail a yacht solo around the world without stopping — a feat she completed in 2019.\n\nThat voyage took the then 77-year-old sailor almost a year to complete, and culminated with her travelling through the Five Great Capes of the Southern Ocean.\n\n\"You can't pull into land, you've got to be at sea all the time,\" she said.\n\n\"The further I got, the less likely I was to give up.\n\n\"I put too much into it to think of giving up.\"\n\nJeanne Socrates completed her record sail around the world in 2019. (ABC South East NSW: Floss Adams)\n\nMs Socrates said she kept in touch with people via radio each day, as she circumnavigated the globe solo on her vessel, Nereida, which she calls her \"partner\" and \"team mate\".\n\n\"I could feel almost spiritually, I could feel that a lot of people were with me,\" she said.\n\n\"You don't feel so isolated when you've got the radio.\"\n\n'Use it or lose it'\n\nMs Socrates started sailing in her 50s so she could watch seabirds, and became \"completely hooked\".\n\n\"You've got these enormous seas and the birds, and the dolphins at times — it's just a marvellous place to be,\" she said.\n\nAlbatrosses are among Ms Socrates' favourite seabirds. (Supplied: Australian Antarctic Division)\n\nShe said she still looked for the beauty of birdlife on the ocean, especially large albatrosses.\n\n\"They come really close, gliding by, and they look at you in the eye and you're that close to them,\" she said.\n\n\"You think, oh gosh, how privileged am I to be able to be in this situation.\"\n\nThe octogenarian has attributed her good health to decades of sailing.\n\n\"Your body is active, keeping your balance all the time. I think that is a help,\" she said.\n\n\"Mentally, you've got to keep thinking about where you're going.\n\n\"I think, use it or lose it basically.\"\n\nMs Socrates keeps a meticulous sailing logbook. (ABC South East NSW: Floss Adams)\n\nAfter completing her Guinness World Record sail around the world, Ms Socrates has continued sailing, but now enjoys pulling into port and exploring the land on her travels too.\n\nShe is currently taking her time to explore what the east coast of Australia has to offer.\n\n\"You meet lovely people, everyone helps each other, it's a lovely community,\" she said.\n\n\"You get the sailing as a bonus.\"\n\nMs Socrates says her yacht Nereida is her \"teammate\" and \"partner\". (ABC South East NSW: Floss Adams)\n\nLater this month, Ms Socrates plans to dock in Port Stephens, in the NSW Hunter region, where she will spend a few months on land writing her autobiography.\n\nAfter that, with no set destination in mind, she says she will go wherever the sea takes her.\n\nMore women in sailing\n\nShelley Wright, who in 2014 founded the group Women Who Sail Australia, said Ms Socrates was an inspiration to other female sailors.\n\nShelley Wright started sailing in the 1980s. (Supplied)\n\nDr Wright said when she set up the group to encourage more women to get into the \"male-dominated industry\", she had no idea how many female sailors were already taking to the high seas.\n\n\"When we got to 300 [members], we thought that it was pretty amazing. I had no idea that there were 300 women out there sailing at that point,\" she said.\n\nThe group now boasts more than 7,000 members.\n\nDr Wright said Ms Socrates — who is also connected to the online group — was a trailblazer.\n\n\"It's mind blowing. The energy and the enthusiasm and the friendship, it's pretty impressive,\" Dr Wright said.\n\nMs Socrates heads off on the next leg of her voyage. (ABC South East NSW: Floss Adams)\n\nMs Socrates said she was still \"pretty determined\" to continue sailing into her later years.\n\n\"I just want to keep on going for as long as I can. I don't know how long that will be,\" she said.\n\n\"Obviously my body is aging. You can't get away from that.\n\n\"But I can't visualise life without being on Nereida.\"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-18/neurodivergent-boy-turned-away-from-boarding-schools/105184554",
    "title": "Boarding schools urged to make room for bush students with autism",
    "publish_date": "Thu, 17 Apr 2025 20:45:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "According to his mum, 12-year-old Dustin Neilsen is \"just a normal bush kid\" who likes to be outside with his pet dogs, build with Lego and play his electric guitar.\n\nThis year he should have started year 7 at boarding school, but his family has had difficulty finding one that will accommodate his needs.\n\nDustin has autism and despite trying to coordinate a plan with schools and therapists, his parents have been turned down by two schools and told by another to wait 12 months.\n\n\"We just want them to give him a chance, and that's probably the thing that concerns us the most is people don't give him a chance,\" his mother Melissa Neilsen said.\n\nHomeschooling was the only option because the family lives on a cattle farm more than an hour from the closest high school near Hughenden, 400 kilometres inland from Townsville in north-west Queensland.\n\n\"We feel like if he stays home, he's not going to get exposed to any of those social things and the older he gets, the more reclusive he may become,\" Ms Neilsen said.\n\nThe Neilsens live on a cattle farm near Hughenden, which leaves Dustin with little choice but to attend a boarding school. (ABC Rural: Brooke Tindall)\n\nDustin took part in a two-day boarding school experience with a Townsville school last year but the Neilsens were told he could not be accommodated at the dormitory at that time.\n\n\"I felt really guilty, like it was all my fault,\" Dustin said.\n\nThe school told the ABC it worked with the Neilsen family for months to assess Dustin's needs and determined he was not ready.\n\nIn a statement, the school said the boarding management team and the school's leadership team were not confident Dustin had the capacity to live communally and there were concerns for his safety and that of the other students.\n\n\"The school did not deny the child a position in boarding due to autism,\" the statement read.\n\n\"A decision was made to postpone the offer of a position in boarding for 12 months due to the child not being considered adequately successfully ready to enter a communal environment.\"\n\nMs Neilsen wants boarding schools to give her son a chance. (ABC Rural: Brooke Tindall)\n\nMs Neilsen believes the two-day experience did not give Dustin enough time to adjust to the boarding routine.\n\n\"He definitely would need time to adjust and adapt, but he has more supports than any other person,\" she said.\n\nThe Hughenden branch of the Isolated Children's Parents' Association (ICPA) is taking Dustin's story to its state conference in June.\n\nICPA president Wendy Henning said she was aware of many cases where families had opted to do high schooling at home because a boarding school could not accommodate their needs.\n\n\"We are very aware of the increasing numbers of neurodivergent children throughout Queensland and the need for education, regardless of where they're getting it, to be able to facilitate various learners,\" she said.\n\nAutism Awareness Australia chief executive Nicole Rogerson says schools should have the issue of neurodivergence \"on their radar\". (ABC News: Billy Cooper)\n\nCall for inclusivity\n\nAutism Awareness Australia chief executive Nicole Rogerson said the situation highlighted the need for schools to consider inclusivity in their dormitories.\n\n\"Ideally schools would already have this issue on their radar and be planning for it,\" she said.\n\nMs Rogerson suggested adjustments to the boarding environment, including sensory-friendly dorm rooms, quiet break spaces, flexible meal options and staff training.\n\n\"This isn't about creating special accommodations,\" she said.\n\n\" It's about applying universal design so that all students feel safe and supported. \"\n\nMelissa Neilsen says Dustin is \"a normal bush kid\". (ABC Rural: Brooke Tindall)\n\nThe Queensland Department of Education said state schools with boarding facilities could make reasonable adjustments to support the individual needs of neurodivergent students and all students with disabilities.\n\nIndependent Schools Queensland was contacted for comment but did not respond by deadline.\n\nDespite the enrolment process taking a toll, Dustin is looking forward to going to boarding school.\n\nHe said he was working hard with his support network to prepare for the enrolment process next year.\n\n\"I have a lot of [occupational therapists] and people who help me understand who I am as a person,\" Dustin said.\n\n\" But of all the people my mum is the person who's taught me the most in life. \"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-18/horse-escape-corryong-poetry-reenactment-banjo-paterson/105178602",
    "title": "Horse still missing a week after Man From Snowy River re-enactment goes awry",
    "publish_date": "Thu, 17 Apr 2025 20:30:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "A horse remains missing in Victoria's high country one week on from a live re-enactment of The Man From Snowy River poem that went awry.\n\nThe re-enactment of Banjo Patterson's famous poem is an annual treat at the three-day Man From Snowy River Bush Festival, which kicked off on April 11 across three days in the tiny town of Corryong, near the Victorian-NSW border.\n\nHowever, the 30th edition of the iconic bushman's ballad, a highlight of the opening day's festivities, did not go to plan.\n\nIt was anticipated that a group of horses and stockmen would corral 11 unbridled gallopers, including the famous \"colt from Old Regret\", back to the station to the cheers and hoots of the crowd.\n\nA crowd of more than 5,000 watched as the horses galloped off into the hills.\n\nIt was the last time one of the 11 gallopers would be seen for at least a week.\n\nThe Man From Snowy River Bush Festival in Corryong, Victoria. ( ) The performers getting ready for the show. (ABC Rural: Annie Brown) The Man From Snowy River Bush Festival in Corryong, Victoria. ( ) The horses take off during the live performance. (ABC Rural: Annie Brown) The Man From Snowy River Bush Festival in Corryong, Victoria. ( ) Guy McLean, dressed as Jim Craig, heads off after the horses. (ABC Rural: Annie Brown) The Man From Snowy River Bush Festival in Corryong, Victoria, April 2025 ( ) The horses run into the hills. (ABC Rural: Annie Brown) The Man From Snowy River Bush Festival in Corryong, Victoria. ( ) Guy McLean leads some horses. (ABC Rural: Annie Brown)\n\nThe riders lost the gallopers in the hilly Victorian countryside.\n\nHorse trainer Guy McLean, who was playing Jim Craig, the main character from the 1982 film of the same name, piped up after a few tense minutes.\n\n\"I know what you're thinking, you think we lost them don't ya?,\" he called over the speakers.\n\nThen mid-sentence, the generator stopped. The microphone cut out.\n\nAnd the real horse mustering began.\n\nThe crowd was entertained by the unexpected turn of events. ( )\n\nThe show must go on\n\nAfter the show, Mr McLean's voice was rasping from yelling and his horse was wet with sweat from galloping.\n\nTen of the 11 horses had been collected in an epic display of horse handling.\n\nMr McLean, who has more than 30 years of performing experience, said riders had to learn to \"roll with the horses\".\n\n\"The gentlemen that are running those horses are some of the best riders in the country,\" he said.\n\n\"It's hard mountain country here, it's the real deal.\n\nMr McLean says the show was thrilling, even if it didn't go according to plan. ( )\n\n\"There were wombat holes, there were rocks, a lot of the times our horses are on a 45-degree angle.\"\n\nMr McLean said although things didn't go exactly to plan, it was one of the most thrilling performances of his careers.\n\n\"This was real — there's no fakery to it,\" he said with a grin.\n\n\"I think the riders might be a little hurt it didn't go to plan, but we still put on a show for people.\"\n\nThe riders still put on a show with the \"unpredictable\" horses. ( )\n\nThree decades celebrating the Man From Snowy River\n\nThis year marked the 30th anniversary of the festival, which runs over three days, attracting more than 27,000 people into the town with a population of 1,300.\n\nIn terms of economics for the area, it is huge.\n\nPeople stick around the region for days eating, drinking, and enjoying the festivities.\n\nIt's opined that Paterson based the poem's main character on Jack Riley from nearby Corryong, a legendary horseman who was buried in the local cemetery in 1914.\n\nMore than 27,000 people attended the festival over three days. ( )\n\nBush poet Geoffrey Graham has attended and performed at the festival since it began.\n\nHe said the festival's success came from the community spirit it generated.\n\n\"You've really got to go to a festival like this to feel what the essence of being Australian is,\" he said.\n\n\"You’ll never see or feel this type of history anywhere else.\"\n\nMr Graham performed in character as Banjo Paterson and recited poems to the mesmerised crowd.\n\nBush poet Geoffrey Graham performs in front of the crowd. ( )\n\nHorse still missing\n\nBy the end the weekend, all but one of the horses had been found.\n\nThe missing beast is presumably still roaming the high country.\n\nMr Graham reflected on the nature of working with the animals.\n\n\"When you're around horses, it's unpredictable, you've got to adapt and be flexible,\" he said.\n\n\"Life is about being flexible — that's an Australian philosophy.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-18/north-of-north-inuit-comedy-anna-lambe-canada-netflix/105182946",
    "title": "North of North is set in the Arctic but will make you feel warm and fuzzy",
    "publish_date": "Thu, 17 Apr 2025 20:25:37 +0000",
    "category": "finance",
    "authors": [],
    "text": "A few years ago, Inuuk actors Anna Lambe and Maika Harper were doing a screen test in Germany, of all places, when they realised they had a shared dream.\n\n\"We were outside a pub chatting about how much we wanted a comedy for Indigenous people that's not trauma-centred, is funny and silly and complex,\" Lambe tells ABC Entertainment.\n\n\"[We thought] maybe eventually it'll come around — and maybe we'll be a part of it.\"\n\nWith North of North, everything they dreamed came true.\n\nIt's the first TV series of its size to be set and filmed in Nunavut — the biggest and most northern territory of Canada, which stretches across most of the country's Arctic region.\n\nLoading YouTube content\n\nThe new coming-of-age comedy follows Inuk woman Siaja (Lambe) as she sets out to reinvent herself after a lifetime spent putting other people first.\n\nNow 26 years old, she went from taking care of her mother Neevee (Harper) — who struggled with alcoholism in Siaja's childhood — to looking after her man-child husband Ting (Kelly William) alongside raising their six-year-old daughter Bun (Keira Cooper).\n\nBut life as a stay-at-home mum isn't for Siaja. So, she dumps Ting and starts looking for a job.\n\nReinventing herself in the small (fictional) town of Ice Cove is another challenge entirely: in a community where Inuit women are expected to devote their lives to raising children, Siaja's decision to work for the problematic and clueless white woman running the town community centre isn't popular.\n\nSiaja's (left) new boss Helen (right) has good intentions, but couldn't be more exasperating. (Netflix)\n\nAn 'unapologetically Inuk' series\n\nTold in a mix of English and Inuktitut, North of North fuses a breadth of Inuit comedic styles — from the dry and witty to the broad and physical — creating characters that feel real and a world that's impossible to resist.\n\nAt the same time, the series doesn't shy away from the deeper issues that impact First Nations people: colonialism and its ongoing myriad impacts; tension between individualism and community; and intergenerational trauma and healing.\n\nThe contrast between light and dark makes both elements hit harder.\n\nNorth of North's creators say the costumes on the show are representative of the fashion any visitor to the Arctic could expect to see. (Netflix)\n\nEach of the series' eight episodes showcase different aspects of Inuit cultural identity, all while featuring vibrant costume design that draws inspiration from styles across the Arctic.\n\nNorth of North also boasts a soundtrack including the likes of Caroline Polachek, Remi Wolf, Doja Cat and Alanis Morrisette, as well as Inuk covers of Dua Lipa's Levitating, from Riit, and Fleetwood Mac's Dreams, by Elisapie.\n\nThe result is a nuanced show that's surprising and heartbreaking at times, but also heartwarming, joyful and easy to watch.\n\nLambe describes it as \"so unapologetically Inuk\".\n\nNorth of North could only have been made by Inuit filmmakers\n\nStacey Aglok MacDonald and Alethea Arnaquq-Baril have been producing TV and movies in the Arctic for 20 years, and had the same dream of seeing their community represented.\n\nThey also knew from the outset that they wanted to use North of North as a way to help develop the television industry in Iqaluit, the Nunavut city where the show was shot.\n\nSo, they launched a mentorship program, which saw local trainees work in roles across departments throughout production, and hosted drama workshops for local actors, from which they cast some roles in the show — including Iqaluit's mayor, Solomon Awa.\n\nNorth of North was set in the fake Nunavut town of Ice Cove, which is really Iqaluit. (Netflix)\n\nThe main cast is predominantly First Nations, with actors from other parts of Canada, Alaska and even New Zealand, and there were a number of Indigenous crew members.\n\nMany Iqaluit residents also appear as extras throughout the series — the community feels as much like its own character in the show as the stunning Arctic landscapes.\n\n\"[The Iqaluit locals in the show] have all been getting so much love and shout-outs from within our community,\" Aglok MacDonald says.\n\n\"We even had a shot of a loose dog walking across the street and someone posted it on socials and they were like, 'Someone's dog made it to North of North!'\"\n\n'Comedy is a protective measure': Hacks stars talk making TV under Trump Photo shows Ava and Deborah, dressed up, press their faces together in a photoshoot in Hacks. Hacks stars Jean Smart and Hannah Einbinder talk comedy's power to platform women in Hollywood beyond their looks.\n\nLambe feels shooting in Iqaluit under the care of two Inuuk showrunners ensured that cultural safety and the production's impact on the community stayed front of mind.\n\n\"I think, in terms of Indigenous film and television, Indigenous representation [and] how to engage with [these] communities, it sets a new precedent,\" she says.\n\nAotearoa/New Zealand actor Jay Ryan, who plays an outsider in North of North visiting Ice Cove for research, agrees.\n\nHe recently starred in the Northern Territory-based Netflix show The Territory, which enjoyed a similar level of buzz for its representation of Indigenous people in Australia after its 2024 release — but thinks North of North reaches another level.\n\n\"Territory was great … it felt like a co-production with a lens on creating pathways for Indigenous crew members and cast, and that was a great stepping stone,\" he says.\n\n\"But North of North … was fully led by Indigenous creatives, cast, crew. I was the minority for once.\"\n\nJay Ryan (left) with Maika Harper (right), was on location in Nunavut for almost five months and says the few outsiders on the show were brought into the Iqaluit community \"as family\". (Netflix)\n\nFilming a TV show with a 100-strong crew in the Arctic\n\nBy all accounts, it would have been easier to film the majority of North of North somewhere like Toronto, and spend only a few weeks shooting in Iqaluit.\n\nThe show was the largest-scale project Aglok MacDonald or Arnaquq-Baril had attempted — and that Nunavut had ever seen.\n\nThe sets were built in Ontario, dismantled and then had to be either flown or shipped to Iqaluit, which cannot be reached by road from mainland Canada.\n\nSome of the logistics had to be planned a year in advance, considering things such as when the ocean would freeze over.\n\nFilming in -30°C weather was a standard day for the cast and crew on North of North. (Netflix)\n\nFinding accommodation for a crew of 100 in a town of 8,000 also proved difficult: there are only so many hotels in Iqaluit, and when a big symposium was on at the same time as filming, the cast and crew had to leave Nunavut for a week.\n\nAnd there was, of course, the frigid weather. Temperatures in Iqaluit are below freezing for an average of eight months a year.\n\nIn the show's first episode, two characters kiss outside. Ryan remembers it being -30°C at the time, and says the actors had to do the shot over 17 times.\n\nBut Ryan thinks the extreme cold fostered a sense of community among the cast and crew, saying there was a \"real kind of school-camp mentality\" at the hotel they stayed at — particularly on blizzard days, when they were forced inside.\n\nAnd filming entirely on location makes North of North a Nunavut project through and through, so they wouldn't have it another way.\n\nThe Iqaluit community feels as much like its own character in North of North as the breathtaking Arctic landscapes depicted in the show. (Netflix)\n\nThere's no word yet on a second season but, with the first finally out in the world, Arnaquq-Baril has one wish.\n\n\"I hope [viewers] want to come north and are intrigued by our part of the world,\" she says.\n\n\"I think a lot of people don't know we exist or, if they do know anything about Inuit, they tend to think of us as historical figures — a culture that once was.\n\n\" [I hope they] see that we are still here, always have been, and that we're funny and interesting and that they might admire our sense of community, that we stick together — through thick and thin and through insanity and trauma and laughs and joy. \"\n\nNorth of North is streaming now on Netflix.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/national/mother-kidnapped-before-body-found-in-torched-car-20250418-p5lsrl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mother kidnapped before body found in torched car",
    "publish_date": "Fri, 18 Apr 2025 11:54:41 +1000",
    "category": "finance",
    "authors": [],
    "text": "Mother kidnapped before body found in torched car\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/europa-league-live-ange-s-spurs-face-era-defining-quarter-final-clash-against-eintracht-frankfurt-20250417-p5lsgd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Europa League 2025 as it happened: Ange’s Spurs into semi-finals after gritty away win in Germany",
    "publish_date": "Fri, 18 Apr 2025 11:49:40 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "It felt like Ange Postecoglou could even be out of a job before Easter was over had Tottenham Hotspur exited the Europa League.\n\nInstead the head coach and Tottenham fight on after an impressive battling performance (a rarity in Postecoglou’s reign) to reach their first semi-final in this competition, then the Uefa Cup, since 1984.\n\nWhether even winning this competition, and earning a precious Champions League place, with the finance that brings, can save Postecoglou remains in severe doubt. Maybe the die is already cast on his future given their wretchedness in the Premier League.\n\nTottenham’s Dominic Solanke celebrates after scoring his side’s opening goal. Credit: AP\n\nBut had Spurs lost to Eintracht Frankfurt, Postecoglou may well not have been in the dug-out for Monday’s next league encounter, at home to Nottingham Forest, such was the mood. Their season would have been over and, so, it could be argued there was little reason for carrying on given how beleaguered he has become.\n\nBut in winning, and keeping a clean sheet, Spurs have also kept alive the Australian’s much-derided declaration that he always claims a trophy in his second season at a club. That promise is one he can still keep, whatever then happens.\n\nThe Frankfurt fans were relentless. Postecoglou will hope he has silenced some of the noise around him and he looked like a man, on the touchline, who knew what was at stake. On the final whistle all his coaches jumped on him for a group hug with goalkeeper Guglielmo Vicario sprinting to join in.",
    "source": "SMH",
    "cluster_id": 12
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/dreading-time-with-family-this-weekend-try-these-ideas-for-a-harmonious-get-together-20250413-p5lrct.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dreading time with family this weekend? Try these ideas for a harmonious get-together",
    "publish_date": "Fri, 18 Apr 2025 11:45:10 +1000",
    "category": "lifestyle",
    "authors": [
      "Robyn Willis"
    ],
    "text": "One of the many benefits of the mini break known as Easter is the opportunity to spend time with family. Whether it’s a time to celebrate faith or just a chance to indulge in a truckload of chocolate, it’s not unusual to find yourself in the company of relatives, close and not-so-close.\n\nRelationships Australia national executive officer Nick Tebbey says many people look forward to such gatherings.\n\n“A lot of people find being with family nourishing, and they focus on the positives,” he says.\n\nEaster is a great opportunity to celebrate with family. Credit: Getty Images\n\nHowever, he says there’s a growing cohort who find family time fraught, often for the same reason.",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/culture/celebrity/i-hear-you-mocking-the-female-astronauts-you-re-doing-patriarchy-s-dirty-work-20250417-p5lsmf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "I hear you mocking the female astronauts. You’re doing patriarchy’s dirty work",
    "publish_date": "Fri, 18 Apr 2025 11:45:00 +1000",
    "category": "finance",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "Bad feminist that I seem to be, I missed what many other women saw and felt when the “historic” all-female Blue Origin space jaunt started making news. My first thought? Cool space suits. Very Josie and the Pussycats. Seventies glam, high pony, love it.\n\nMy shallow all-about-the-optics mind was soon schooled by a slew of celebrities who, from the safety of their socials, quickly turned this 11-minute ride to the edge of Earth into a global hot button topic.\n\nSure, space tourism is crazy, but women have much bigger problems to confront than the all-female crew of Blue Origin that included pop star Katy Perry (pictured back centre-left Credit: AP\n\nNo sooner had the crew touched down than rockets were fired at the astronauts. Well — almost exclusively at Katy Perry. She sang What A Wonderful World (I am dead), kissed the ground, noted her makeup stayed intact and flashed her tour set list. Ick.\n\nThe pile-on came from an old songbook. When women become the face of something they also become the face of the backlash. Unless they have a backstory awash with trauma or diversity, they can be shredded, the barbs packaged as entertainment.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/you-have-to-put-up-with-me-for-a-bit-longer-ange-clips-critics-as-spurs-keep-trophy-hopes-alive-20250418-p5lsoz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘You have to put up with me for a bit longer’: Ange clips critics as Spurs keep trophy hopes alive",
    "publish_date": "Fri, 18 Apr 2025 11:44:56 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "The scenes at full-time said it all. After Spurs were forced to withstand immense pressure through a late onslaught from the hosts, Postecoglou fist-pumped the air at the final whistle and then was immediately mobbed by his support staff. Guglielmo Vicario jumped on the pile. One by one, the rest of his players embraced him, with feeling. You could see it. The conspiracy theorists will do their thing, and chairman Daniel Levy’s opinion is another matter entirely, but it was abundantly clear that the football-facing elements of Tottenham Hotspur are 100 per cent behind their leader. This was unity in full display, total focus and maturity in the face of adversity and relentless outside noise, from the media and their own supporters. Postecoglou last week lamented a lack of attention from the “football gods” but in Frankfurt, they were blessed. It’s been overdue. Instead of them losing key players to injury, it was their opponents, whose talisman Mario Götze was forced off after just 17 minutes, clutching at his hamstring, instantly disrupting their rhythm. Instead of them giving goals away, they were the recipients, thanks to the clumsiness of Frankfurt goalkeeper Kaua Santos, who had a blinder last week. This week he ironed out a brave James Maddison as he tracked a ball into the box from Cristian Romero; the resultant penalty was expertly slotted home by Dominic Solanke. Ange Postecoglou. Credit: Getty Images\n\nInstead of wasting chances, they watched Frankfurt’s Rasmus Kristensen burn three in quick succession late in the second half. These bits of good fortune shouldn’t detract from the reality: Spurs were the better team, and deserved to win. Postecoglou’s critics will say that if they played like this more often, they’d be less critical. In fairness to them, they’d be right, but in fairness to him, they ignore a lot of mitigating circumstances. And it’s worth noting that he perhaps conceded some ground to them: in the second half, he ditched some of his textbook tactical traits and ordered his team to dig in. There were more long, aimless goal kicks and clearances to nobody than you might see in full seasons of Angeball. His two second-half substitutions were to replace their two wingers with a defensive midfielder and a third centre-back. Dominic Solanke. Credit: AP\n\nCall it what you want - pragmatism, adaptation, self-preservation - but it worked, and that was all that mattered here. Next up is Bodø/Glimt, champions of Norway in four of the last five seasons, after they beat Lazio in the other quarter-final on this side of the draw in a dramatic penalty shootout. They are based in a small town just north of the Arctic Circle, with a population smaller than Tottenham’s stadium capacity - and they play on an artificial pitch, so making the most of the first leg in London on May 1 will be crucial. Loading The instinct will be to write them off immediately, but Postecoglou knows that will be a mistake: his Celtic side was humbled by the Norwegians in the knockout round play-offs of the UEFA Conference League in 2022. As compelling as Ange’s personal redemptive arc is, Bodø/Glimt’s is the true underdog story of this tournament. Spurs are the big dogs who should be winning it all. Post-match, Postecoglou was reminded about his notorious second-season trophy record, a fact - not a boast, not a promise, not a vow, but a fact, despite how it has been twisted - which has become a stick to beat him with.\n\n“People like to mock and ridicule and diminish my achievements,” he said. “That’s fine. I’ll keep doing what I do.” He had more to say to the written press. Loading “I am the same manager today that I was yesterday, so if people think us winning tonight makes me a better manager, or whoever thinks I wasn’t doing a good job yesterday, should be feeling the same way,” Postecoglou said. “I don’t care, it doesn’t bother me, it doesn’t affect what I do.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/vowing-to-play-beyond-2025-an-origin-star-braces-for-tough-family-talks-20250417-p5lsg1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Origin star left a powerhouse, and has pledged to fight for new deal",
    "publish_date": "Fri, 18 Apr 2025 11:22:09 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size This is the moment “the stars aligned” and tempted Felise Kaufusi from a rugby league powerhouse. When the Dolphins enforcer built his NRL career with the Melbourne Storm, he would marvel at the club’s founding fathers. Names such as Lazurus, Kimmorley, Kearns – pioneers who inspired the present day juggernaut. Kaufusi had achieved so much: two premiership rings, State of Origin triumphs and Kangaroos jerseys on his resume. But aside from desiring a return to Queensland as his father passed away, he wanted more. He wanted to follow those trailblazers into folklore. Felise Kaufusi in action for the Dolphins. Credit: Getty Images “That’s all we talked about down in Melbourne; the guys who started the club and their legacy we still talk about, and I’m pretty sure will always talk about,” Kaufusi tells this masthead before challenging his former teammates.\n\nAdvertisement\n\n“That’s something not just me, but the Bromwich boys [Jesse and Kenny] wanted to try to create, so that hopefully when our footy careers are done and dusted, the boys can look back at these founding players. “I don’t play to leave a legacy, I just hope my work speaks for itself. Being a foundation player for the Dolphins is what you will be remembered for. “It’s a part of history no one can take from you.” Tough talks nearing amid desire to play on So engrossed has Kaufusi become by the Redcliffe outfit’s birth, he has declared his desire to play beyond his 2025 contract. “I’m fresh in the mind and the body is holding up, so I’d love to continue playing as long as I can,” Kaufusi says.\n\nAdvertisement\n\n“It comes back to the body and mind, but at the moment, I’m enjoying my footy. Nappies aren’t cheap these days, so I might have to keep playing for as long as I can. Loading “You can only go as long as your body or mind tells you, and I haven’t got to the point to say I’ve had enough.” Aggression has been Kaufusi’s trademark. Yet, it is that physicality which draws the ire of fans who condemn him on social media. Kaufusi has heard it all before in an 11-year career – vitriol and angst littering searches of his name in the past. “I know I’ve copped it, and I can cop it,” he says, “it’s part of what we do”.\n\nAdvertisement\n\nBut Kaufusi faces some difficult conversations, as his children begin to appreciate the magnitude of his career. At school, classmates clamour for a photo of the 17-time Queensland Maroon, while his son will often ask why he hasn’t scored yet. But if the 32-year-old plays on, they will be open to the commentary which has followed their father – a foreign realm for most children, which comes with being in the spotlight. “My kids aren’t on social media yet, so they’re not exposed to it, but this next gen coming through are crazy on the gadgets and the iPhone,” Kaufusi says. “It’s something I haven’t had to navigate so far, but if I keep going until they’re old enough to have an account they’ll be exposed to it.\n\nAdvertisement\n\n“It’s one of those things we’ll have to go through and try work out our best way out of it.” Honouring his family Debate has raged about the future of international football since Broncos’ prop Payne Haas revealed he was considering defecting from the Kangaroos to Samoa. Hamiso Tabuai-Fidow and Tino Fa’asuamaleaui could follow. The ability for players to bounce between tier one and two Test nations, while being eligible for Origin, has divided pundits. Kaufusi, who shifted allegiances to Tonga, sympathises with Roosters star Victor Radley, who – born and raised in Sydney – is in New South Wales’ exile after opting to play for his father’s English heritage. Felise Kaufusi in action for Tonga in last year’s Pacific Championships final against Australia. Credit: NRL Photos\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/joey-fumes-over-nrl-contract-circus-20250418-p5lsrb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Joey fumes over NRL contract 'circus'",
    "publish_date": "Fri, 18 Apr 2025 11:18:50 +1000",
    "category": "finance",
    "authors": [],
    "text": "Joey fumes over NRL contract 'circus'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/i-ve-never-been-at-a-better-place-jon-hamm-is-ready-to-take-charge-again-20250417-p5lsm6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I’ve never been at a better place’: Jon Hamm is ready to take charge again",
    "publish_date": "Fri, 18 Apr 2025 11:00:00 +1000",
    "category": "finance",
    "authors": [
      "Louise Rugendyke"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size If ever there was a man built to wear a suit, it’s Jon Hamm. As suave advertising executive Don Draper in the TV series Mad Men, he was rarely seen without a jacket and tie. He wore it as if it was a suit of armour, hiding a deeply troubled character underneath. It was the role – and the look – that would define him for his seven seasons on the show, but it’s taken the 54-year-old almost 10 years to feel ready to step back into the role of leading man. John Hamm plays Andrew Cooper, who starts robbing the rich when he’s fired from his Wall Street job. “I love it,” says Hamm. “I love being No.1 on the call sheet. I love having the ability and the responsibility to set the tone for the whole set. I’ve got very broad shoulders, I’m a pretty strong guy. I can carry a lot of things. But I knew at that point, especially right after Mad Men, that I probably wasn’t ready to go right into something else.” Loading He has found that “something else” – the TV series Your Friends and Neighbours. Set in the wealthy suburbs of New York, where sprawling estates match the large egos of the property owners, it’s the kind of place where rolls of cash and expensive watches are kept in unlocked drawers and staff quietly attend to the owners’ whims. It’s also where Andrew Cooper, played by Hamm, fits right in – he’s neatly summed up as “that white guy who looks like he brushes his hair a lot” – until his divorce and then job loss send him sliding down the pecking order. He’s still got the Maserati and the country club membership, but he’s also looking at all this excess – all this stuff – through new eyes. So he begins to steal it.\n\nAdvertisement\n\n“He has a lot going for him, and he has a lot to learn, too,” says Hamm, who is talking over Zoom while sitting in a room styled up to look like one of the mega-mansions Coop picks his way through. “And I think that’s part of the journey of the show – he is unlearning a lot of the things he thought he knew for certain, and relearning the things that he comes to discover are more important.” Andrew Cooper (Jon Hamm) and ex-wife Mel (Amanda Peet) navigate new relationships in Your Friends and Neighbours. It’s the type of role that seems tailor-made for Hamm, a familiar but not complete carbon copy of Don Draper. Like Draper, Cooper is a natural in a suit, he fits effortlessly into wealthy circles and is, essentially, a privileged white man no one would look twice at walking through any affluent neighbourhood. If he had to, he could get away murder. Loading “This [white privilege] is a particularly resonant idea right now,” says Hamm. “And why is that not examined deeper? What does that mean for us as humanity, really? Why do certain people seem to be immune to consequence? And what does that tell the generation that sees that happen over and over and over again about consequences?” For writer Jonathan Tropper, who created the series, it was the opportunity to mess with Hamm’s screen persona that proved irresistible. “I went to him before I even wrote it to get his participation,” says Tropper. “The idea [of the character] is a man who conveys all the entitlement and the privilege of somebody who belongs there, but at the same time, once it’s taken away from him, he has pools of angst and ennui.\n\nAdvertisement\n\n“And we needed to have an actor that can make him relatable once you’ve stripped that veneer away from him. And that’s what I really wanted to do, was take Jon and everything that he’s represented in the past on TV, and deconstruct it.” Trooper knows the territory of Your Friends and Neighbours well. He grew up in the wealthy neighbourhood of Westchester County, north of New York City, which served as inspiration. He had written several books set in the area, including This Is Where I Leave You, which was adapted into a 2014 film, but it felt right to return now. January Jones as Betty Draper and Jon Hamm as Don Draper in Mad Men. “It’s a comment on consumerism,” says Tropper. “It’s a comment on acquisition, and it’s a comment on a certain class in our society who are so actively acquiring that they actually, I think in a lot of cases, become blind to what actually matters to them. So you end up with a house full of stuff, but a very empty life.” It sounds like a very The White Lotus crowd. “When I was pitching the show, I was worried people were going to think it was more like Breaking Bad,” says Tropper, laughing. “I would say to them, ‘This is where The White Lotus people are when they’re not at The White Lotus.’” The series is Hamm’s first lead role since he left Don Draper meditating on a hilltop, finding the meaning of life and, probably, a slogan for Coca-Cola, in 2015.\n\nAdvertisement\n\nFor a long time, Don Draper defined him, and it also took him some time to shake off. “I knew that I needed a bit of a rest, and was certainly going through some very transitional things in other parts of my life as well,” says Hamm (he broke up with his long-term partner and spent time in rehab). So he chose supporting roles – a tech billionaire on The Morning Show, a Trump-loving county sheriff in season five of Fargo and a Texas oil titan in Landman – but they, too, leaned into Draper’s slippery slide. Even Fargo creator Noah Hawley admitted he cast Hamm because he needed someone the audience would like, no matter how terrible he was. Loading “Well, I think part of what Noah is identifying there, is that I represent – as how I look and how I’ve been in the world – I look like a person that you are supposed to believe and trust,” says Hamm. “And I think that when you put someone like that in a situation where he does things that you are also supposed to find really, really terrible, you, as a viewer, are conflicted, and I think that creates an engaged audience member.” Do you like being seen that way – trustworthy on the outside, shifty on the inside? “Everybody has an outward-facing persona, that’s the cover of our book, right?” says Hamm. “And we’ve all been told not to judge the book by that cover, but some of us still do, and oftentimes you’re not surprised by what the book has underneath the cover, but sometimes you are pleasantly surprised.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/victoria/orthodox-easter-congregation-in-footscray-20250418-p5lsr6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Orthodox Easter congregation in Footscray",
    "publish_date": "Fri, 18 Apr 2025 10:58:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "Orthodox Easter congregation in Footscray\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/queensland/woman-bitten-on-hand-by-dingo-before-easter-long-weekend-20250418-p5lspi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Woman bitten on hand by dingo before Easter long weekend",
    "publish_date": "Fri, 18 Apr 2025 10:32:57 +1000",
    "category": "lifestyle",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "A woman has been bitten on the hands by a dingo near a camping area on K’gari on Thursday morning.\n\nThe woman had left the Winnam camping area alone and was walking towards the ocean about 10.30am when she was approached by five dingoes.\n\nVisitors to K’gari are reminded to never approach or feed dingoes, avoid walking alone and keep children close at all times. Food and waste should also be secured at all times. Credit: Kaihla McConnell\n\nA tagged dingo lunged at the woman. She suffered two lacerations to the middle fingers on both hands.\n\nThe Queensland Ambulance Service treated the woman on the island, formerly Fraser Island, and advised her to see a doctor.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/afl/fagan-zorko-in-unfriendly-exchange-20250418-p5lsp9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fagan, Zorko in 'unfriendly' exchange",
    "publish_date": "Fri, 18 Apr 2025 10:28:20 +1000",
    "category": "finance",
    "authors": [],
    "text": "Fagan, Zorko in 'unfriendly' exchange\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/carlo-had-a-big-head-before-the-tries-20250418-p5lsqx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "\"Carlo Had a Big Head Before the Tries\"",
    "publish_date": "Fri, 18 Apr 2025 10:17:54 +1000",
    "category": "finance",
    "authors": [],
    "text": "\"Carlo Had a Big Head Before the Tries\"\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/watch-out-for-henry-pollock-20250418-p5lsqt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Watch out for Henry Pollock",
    "publish_date": "Fri, 18 Apr 2025 10:07:20 +1000",
    "category": "finance",
    "authors": [],
    "text": "Watch out for Henry Pollock\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/it-s-worth-the-drive-just-for-the-cabbage-rolls-at-this-suburban-macedonian-diner-20250415-p5lrwq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "It’s worth the drive just for the cabbage rolls at this suburban Macedonian diner",
    "publish_date": "Fri, 18 Apr 2025 10:06:15 +1000",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Advertisement\n\nReview Eating outEpping It’s worth the drive just for the cabbage rolls at this suburban Macedonian diner Marijan Nikolovski and his family serve kebapi sausages, flavour-forward dips and more at Balkan Skara in Melbourne’s north. Dani Valent April 18, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 7 Sarma (cabbage rolls) at Balkan Skara. Jason South 2 / 7 Inside Balkan Skara. Jason South 3 / 7 Nafora grilled bread. Jason South 4 / 7 Ajvar (capsicum dip) with olives and bread. Jason South 5 / 7 Meat platter with kebaci and sharska (cheese stuffed patty). Jason South 6 / 7 Balkan Skara is worth the drive to Epping. Jason South 7 / 7 Three-milk sponge cake. Jason South Previous Slide Next Slide Eastern European$$$$ Did you hear the one about the guy who loved his local restaurant so much he bought it? That’s how Marijan Nikolovski ended up with Balkan Skara, where his family had celebrated christenings and birthdays for years. A longtime engineer in the automotive industry, the demise of local car manufacturing meant he was out of a job. Nikolovski was forever tinkering on the Weber at home – maybe he should fulfil his dream of running a restaurant one day? In 2023, he bought his favourite restaurant when the owners were ready to retire. It was a fond handover and included recipes that had kept the northern suburbs happy for 20 years. Nikolovski added some of his Macedonian family’s own recipes and rebranded the place to Balkan Skara (“skara” meaning “grill” in Macedonian). The name gives a handy clue to the offering. As a region, people and culinary identity, Macedonia spans six countries, anchored by landlocked North Macedonia, and including parts of northern Greece, Albania, Kosovo, Serbia and Bulgaria. Macedonian cuisine is a subset of Balkan food, with dishes such as skinless sausages, pepper dip and cabbage rolls found throughout the region with national and aunty-to-aunty variations.\n\nAdvertisement\n\nMeat platter with kebaci and sharska (cheese stuffed patty). Jason South The politics are complicated, but if anything promotes peace, it’s honest food made with pride and generosity – as it is at Balkan Skara. Everything happens in one room. Walk past the sheltered patio, and you’ll probably see Marijan at the grill, keeping an eye on his beloved kebapi sausages. His sons might be there cooking rice or soaking beans, wife Angelina will be taking orders in the small dining room (“Just the usual?” I hear her ask one guy), with her mum Pavlina pitching in. The music on the television is Macedonian – you’ll likely see footage of piano accordions and sheepskin bagpipes similar to those displayed on the walls. It feels like you’re in the Epping melting pot, 18 kilometres north of the CBD, with a Thai place next door, an Indian supermarket around the corner, and an old-school pizza joint down the road. All meals lead to the grill, but you’ll also want starters. Ajvar is a sturdy relish made with capsicum and eggplant, perfect for spooning over fluffy lep, a Balkan pide. Leftover bread is one of the world’s great gifts, and in Macedonia it’s grilled, drizzled with olive oil and scattered with oregano and feta to make nafora. Kaymak is a dense, clotted cream and there’s no wrong way to eat it: with bread, alongside beans, as a dessert.\n\nAdvertisement\n\nNafora grilled bread. Jason South I would drive to Epping especially for the sarma. To make them, the family pickles cabbage leaves for months until they are soft and savoury. They’re stuffed with rice and pork mince to form plump, comforting treasures. Kebapi are made to a secret ratio of pork and beef mince. Grilled with avid attention, you can tell how much care goes into this bedrock dish. The same meat mix is used for sharska, a football-shaped pattie parcel stuffed with tasty cheese. Cutting into it was a satisfyingly oozy experience. To eat shopska salad, you’ll need to spoon your way through a serious layer of grated feta to reveal the tomato, cucumber and onion jumbled underneath. It’s disarmingly simple – use the oil and vinegar on your table to adjust the dressing. For the three-milk cake, sponge is soaked in milk, cream and condensed milk to create a perfect pudding-like dessert. Drinking is threaded through Balkan food culture. There’s a Macedonian semi-dry red made from vranec, an indigenous grape, which goes well with grilled meats; BYO wine, Skopsko pilsner and rakiya (a potent fruit brandy) are options too. Raise a toast to Marijan Nikolovski, who is ticking off his bucket list and making people happy at the same time.\n\nAdvertisement\n\nThree more grills to try Jim’s Greek Tavern Whether it’s fish on the grill or lamb twirling over charcoal, Jim’s knows how to do fresh and fire-cooked. Since 1967, it’s been welcoming groups for upbeat meals in a casual setting at keen prices. A Melbourne institution for good reason. 32 Johnston Street, Collingwood, facebook.com/jimsgreektavern Galata Kebab There’s lamb and chicken from the spit, skewers and cutlets on the grill and excellent just-feed-us platters. Beyond meats, people come for the house-made dips and a killer range of halal snack packs, plus Turkish tea, coffee and traditional desserts. 173 Caroline Springs Boulevard, Caroline Springs, facebook.com/galatamelbourne TungThit Sizzling Steak Asian fusion grills are the thing at TungThit, whether it’s wagyu tomahawk served with bone marrow fried rice, or a neat little 150-gram porterhouse. You could also go for Melbourne’s most expensive banh mi, stuffed with beef short rib and pushing $60. Also in Abbotsford. 41 Springvale Road, Springvale, instagram.com/tungthit_sizzlingsteak Good Food reviews are booked anonymously and paid independently. A restaurant can’t pay for a review or inclusion in the Good Food Guide.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/video/chinese-tiktok-influencers-offer-a-way-to-evade-us-tariffs/kmxpa63h4",
    "title": "Chinese TikTok influencers offer a way to evade US tariffs",
    "publish_date": "Fri, 18 Apr 2025 00:26:05 +0000",
    "category": "finance",
    "authors": [],
    "text": "Chinese TikTok influencers offer a way to evade US tariffs\n\nPublished 16 April 2025, 7:52 am\n\nUS TikTok users are being inundated by videos from Chinese influencers seemingly offering a way for consumers to evade Washington's 145% tariffs on Chinese goods, by sourcing popular brands direct from the factories that claim to produce their products. The viral video trend has prompted warnings from trade experts, with some of America's top companies now weighing in.",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/interview-dr-wenn-lawson-on-improving-full-and-equal-participation-for-people-with-autism/atmryvs0h",
    "title": "INTERVIEW: Dr Wenn Lawson on improving full and equal participation for people with autism",
    "publish_date": "Thu, 17 Apr 2025 22:31:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/its-not-just-chocolate-popular-easter-treats-can-be-deadly-for-pets-vets-warn/5v9naofh9",
    "title": "It's not just chocolate: Popular Easter treats can be deadly for pets, vets warn",
    "publish_date": "Thu, 17 Apr 2025 22:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThey're cute, they're cuddly, they're part of the family.\n\n\n\n\n\nBut when they come through the doors of Melbourne's Lort Smith Animal Hospital, they can be pretty unwell.\n\n\n\n\n\nAnd however cute the patients are, vets at the hospital, like Dr James McGregor, are asking pet owners to take extra care this Easter weekend to avoid a surprise visit.\n\n\n\n\n\n\"The most important things really are just keeping those sweet treats chocolates, anything with raisins - so hot cross buns especially - away from your dogs. And also for cats as well, Easter lilies pose probably the biggest risk - so keeping those away from you cat. To be honest not even having them in the house is ideal.\"\n\n\n\n\n\nAnd foods indulging an Easter sweet tooth - aren't the only danger.\n\n\n\n\n\nRaw fish ... cooked bones ... grapes ... onions and garlic... corn on the cob ... nuts and meat trimmings ... Dr McGregor says they all have the potential to put pets in harm's way.\n\n\n\n\n\n\"So we've seen a really wide range of cases to be honest with you. From mild vomiting and diarrhoea - to more severe instances where they've been in hospital for weeks with you know kidney issues. And the kidneys they don't re-generate - once that damage is done.\"\n\n\n\n\n\nThe advice to pet owners: keep a watchful eye on furry friends - and also keep a look out for a visit from the Easter bunny this weekend.\n\n\n\n\n\nWhile the children may not find all the chocolate you've hidden - never underestimate the tenacity of your average pet to hunt down and eat forbidden sweet treats.\n\n\n\n\n\n\"You know you have got your labradors - they will do anything to grab that sweet treat off the side of the table. So it's really important to keep in mind those things - and they will try and outsmart us!\"\n\n\n\n\n\nDr Simone Maher is the chief veterinary officer for insurance company PetSure.\n\n\n\n\n\nShe told Channel Nine that owners have to make a real effort to keep the forbidden foods under lock and key.\n\n\n\n\n\n\"Putting them just on a table or something is just not enough. They've really got to be put away in a cupboard because they'll smell those delicious treats out.\"\n\n\n\n\n\nAnother vet, Megan Brashear says the amount of the wrong sort of food and the size of the pet will govern how bad the reaction is - but you'll soon know if your pet is in trouble:\n\n\n\n\n\n\"We'll tend to see signs in these patients about one to four hours post-ingestion . That's not a hard and fast rule but that's about the time that you're going to look for problems. First, we'll see GI (gastrointestinal) distress. In these more mild reactions, these animals are going to be vomiting and probably have diarrhoea. What really gets concerning about these guys is that the methylxanthines actually increase the calcium content inside the cell; and it increases cell excitability. So we start to see these muscle tremors and we can actually cardiac arrhythmias because of the chocolate that the animal has eaten.\"\n\n\n\n\n\nBut if despite all precautions, your pet does manage to get hold of a forbidden food, Simone Maher says the advice is simple.\n\n\n\n\n\n\"Well, the first thing you need to do is to contact your vet and there are some pieces of information that can be really helpful to work out how much danger your pet is in: and that's your dog's approximate weight. And if you can, what sort of chocolate they ate, the darker the chocolate, the more dangerous, the less they need to eat. So if you can provide that sort of information - that can be super helpful.\n\n\n\n\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/climate-wars-revisisted-party-time-ep-3/vpjj9uwe1",
    "title": "Climate Wars (Revisited): Party Time Ep 3",
    "publish_date": "Thu, 17 Apr 2025 21:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "SBS Political Reporter\n\nSara Tomevska\n\nwill fill us in on what the major parties are offering up in the climate and energy space, and Energy and Climate Change Program Director at the Grattan Institute,\n\nTony Wood\n\n, explains just how feasible it all actually is.",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/trump-accuses-us-federal-reserve-chair-of-playing-politics-with-interest-rates/hp49qcqko",
    "title": "Trump accuses US Federal Reserve chair of 'playing politics' with interest rates",
    "publish_date": "Thu, 17 Apr 2025 20:51:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "United States President Donald Trump launched a series of attacks against the country's Federal Reserve chair Jerome Powell, accusing the central bank chief of \"playing politics\" by not cutting interest rates and asserting he had the power to evict Powell from his job \"real fast\".\n\n\n\n\n\nPowell's termination as Fed chair \"cannot come fast enough\", Trump said in comments posted to social media.\n\n\n\n\n\nThe post also said the Fed should cut interest rates and called a recent Powell speech about the economy a \"complete mess\".\n\n\n\n\n\nHe expanded in a later press appearance that reflected how the Fed's decisions could weigh on Trump's fortunes.\n\n\n\n\n\nInterest rates on home mortgages and other consumer credit remain high, for example, and the Fed is likely to offer little relief now that inflation risks are rising in the wake of Trump's tariff plans .\n\n\n\n\"The Fed really owes it to the American people to get interest rates down. That's the only thing he's good for,\" Trump said.\n\n\n\n\n\n\"I am not happy with him. If I want him out of there, he'll be out real fast, believe me.\"\n\n\n\n\n\nTrump's pointed remarks about Powell echo the sometimes intense language used against the Fed chair in Trump's first term. It pushes into an issue with the potential to rock global markets if Trump tries to fire Powell because he disagrees with his monetary policy decisions.\n\n\n\n\n\nKristalina Georgieva, managing director of the International Monetary Fund, said with the global outlook weakening in the face of the Trump tariff onslaught, central banks like the Fed needed to remain agile and credible — capacities that can be limited by political interference.\n\n\n\nKrishna Guha, vice chair of investment banking firm Evercore ISI, said in a note: \"A sudden crystallisation of the threat to Fed independence would both intensify market stress and shift it in more of a stagflationary direction with a sharp increase in tail risk.\"\n\n\n\n\n\nTrump's comments come a day after Powell said at an event at the Economic Club of Chicago that the Fed's \"independence is very widely understood and supported in Washington and in Congress where it really matters,\" drawing applause from the high-level group of business executives for a pledge to set interest rates independent of political pressure or partisan considerations.\n\n\n\n\n\nIn the same appearance, Powell downplayed the likelihood of interest rate cuts anytime soon.\n\n\n\n\n\nHe said the administration's tariff plans were likely to raise both inflation and unemployment, leaving the Fed sidelined in making any changes to interest rates until the direction of the economy is clearer.\n\n\n\nREAD MORE Why Xi Jinping is touring Southeast Asia amid rising tariff tensions\n\nIn the US, Trump's plans have also led to a lower growth outlook, with economists polled by Reuters putting the odds of a recession at 45 per cent. But it has also raised the prospect of higher inflation policymakers said they may need to guard against by leaving interest rates at least at their current level.\n\n\n\n\n\nThe Fed's benchmark interest rate is currently 4.25 per cent - 4.50 per cent, where it has been since December following several rate cuts late last year.\n\n\n\n\n\nPowell also warned Trump's tariff policies risked pushing inflation and employment further from the central bank's goals, which it manages jointly under a mandate from Congress.\n\n\n\n\n\nThe Fed was \"well positioned to wait for greater clarity\" about Trump's policies and their impact, he said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/what-weather-to-expect-this-easter-long-weekend/vt23m61v7",
    "title": "What's the weather like this Easter long weekend? Here's what to expect in your city",
    "publish_date": "Thu, 17 Apr 2025 19:56:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Bureau of Meteorology (BoM) predicts warm weather across most of the country on Friday.\n\n\n\n\n\nThere's even a chance your chocolate may melt, with temperatures reaching over 30C in Brisbane and Darwin this weekend.\n\n\n\n\n\nBut a cold front is expected to move through parts of Australia, with rain and cooler weather likely to cross the south.\n\n\n\n\n\nThere's also a cyclone tracking towards the Western Australian coast and large swells in the east.\n\n\n\n\n\nAngus Hines, senior meteorologist at BoM said: \"This low pressure system is very powerful, although it's a long way offshore.\"\n\n\n\n\n\n\"This low will not impact our weather directly but will generate some very large, powerful waves for eastern Australia.\"\n\n\n\n\n\nHere's a full breakdown of what each capital city has in store.\n\n\n\nMelbourne\n\nThe city will be mostly sunny on Friday, with showers developing on Saturday and continuing throughout the long weekend.\n\n\n\nSydney\n\nSydney can expect a shower or two and a maximum of 29C on Sunday morning.\n\n\n\nA graphic showing the temperature in Sydney over the Easter long weekend. Credit: SBS News\n\nBrisbane\n\nSunshine and warm weather are predicted over the Easter break. It will be partly cloudy with a top of 31C on Monday.\n\n\n\n\n\nWhile a sunny and dry Easter is expected for Brisbane, major flooding will continue in south-western Queensland. It's also affecting parts of South Australia and northern NSW, as some towns remain isolated by flooding.\n\n\n\n\n\n\"Significant flooding is likely to continue for weeks to come, as floodwaters move slowly downstream,\" Hines said.\n\n\n\nA graphic showing the temperature in Brisbane over the Easter long weekend. Source: SBS News\n\nPerth\n\nClouds and windy conditions are expected from Friday to Monday, with temperatures as cool as 10C.\n\n\n\nA graphic showing the temperature in Perth over the Easter long weekend. Source: SBS News\n\nAdelaide\n\nIn Adelaide, there is a high chance of rain over the weekend. Temperatures will shift from 11 to 27C.\n\n\n\nA graphic showing the temperature in Adelaide over the Easter long weekend. Source: SBS News\n\nCanberra\n\nIt's cooler in Canberra with clouds clearing on Friday and showers on Sunday and Monday.\n\n\n\nA graphic showing the temperature in Canberra over the Easter long weekend. Source: SBS News\n\nHobart\n\nRain and light winds are predicted throughout the long weekend.\n\n\n\nA graphic showing the temperature in Hobart over the Easter long weekend. Source: SBS News\n\nDarwin\n\nSaturday and Sunday will see a top of 33C and possible showers.\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-coalitions-nuclear-plan-is-raising-questions-about-water-heres-why/vfeyig743",
    "title": "Why the Opposition's nuclear plan is raising questions about water",
    "publish_date": "Thu, 17 Apr 2025 11:39:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Conflicting signals from inside the Coalition are again raising questions about the lack of detail in its nuclear energy plans.\n\n\n\n\n\nIn mid-2024, Opposition Leader Peter Dutton announced that if elected, he would create seven nuclear power plants across New South Wales, Victoria, Queensland, South Australia, and Western Australia, pledging that it would lead to cheaper energy.\n\n\n\n\n\nThe proposal has faced broad criticism from climate scientists who say it is costly and unrealistic. But this week, a senior Coalition frontbencher who represents one of the potential nuclear sites also queried whether there was enough water available to build and run it.\n\n\n\nWhy is water a concern?\n\nNuclear power plants require vast amounts of water for cooling and safe operation, which has raised concerns given that Australia is a country grappling with water scarcity.\n\n\n\n\n\nIn Wednesday's election debate , Dutton said that \"they are already water allocations to each of the seven sites that have been located\" when asked about the issue.\n\n\n\n\n\n\"We've looked at the water allocations for each of those sites ... We're comfortable with the analysis that we've done,\" Dutton told the ABC, before referring to modelling the Coalition commissioned last year on its nuclear plan from Frontier Economics, even though the work did not tackle the question of water.\n\n\n\nBut just hours before the debate, Darren Chester, the member for the Victorian coastal seat of Gippsland, which is one of the suggested nuclear sites, told ABC radio that it will take more than two years to determine the water supply availability.\n\n\n\n\n\nHe said that a \"full site characterisation study based on facts not opinions\" has to be done to see if there is enough water to sustain the site.\n\n\n\n\n\n\"The experts in the field would be required to report on all seven sites around issues surrounding water and seismology.\"\n\n\n\nThis month, a report commissioned by Liberals Against Nuclear — a grassroots group comprising Liberal Party supporters who oppose the Coalition's plan — found that 90 per cent of the proposed nuclear power generation is either already water-constrained or very likely to be from 2040 to 2120.\n\n\n\n\n\n\"The water footprint of proposed inland nuclear power needs to be much more prominent in current debates,\" the report stated.\n\n\n\n'We'll work to find consensus'\n\nDutton has continued to frame nuclear power as the only feasible and proven technology capable of firming up renewable energy sources, but he's continued to receive some pushback from within his party.\n\n\n\n\n\nLast year, Queensland's Liberal Premier David Crisafulli said he would oppose plans to build two nuclear plants in his state, and that he did not support lifting Australia's moratorium on nuclear power, which bans the construction and operation of nuclear power plants under federal law.\n\n\n\n\n\nIn response to a question in Wednesday's leaders' debate about state opposition to his plan, Dutton said that, if necessary, he would \"exercise\" Commonwealth powers — a tool which allows the federal government to override state laws in certain situations.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/more-than-32-000-jobs-in-created-in-march-and-the-impact-of-the-federal-election-on-the-market/4h6eay8cn",
    "title": "More than 32,000 jobs in created in March, and the impact of the federal election on the market",
    "publish_date": "Thu, 17 Apr 2025 07:59:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-reason-you-could-be-getting-a-larger-deduction-come-tax-time/db1xsk6mu",
    "title": "Work-from-home tax deductions have changed. You might get a larger return this year",
    "publish_date": "Thu, 17 Apr 2025 05:36:54 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Australian Taxation Office (ATO) has discreetly bumped the fixed rate work from home deduction.\n\n\n\n\n\nTaxpayers can now claim 70 cents per work hour under the revised fixed cost method. Previously, it was 67 cents per work hour.\n\n\n\n\n\nThe revised change applies from 1 July 2024, meaning taxpayers can use this method for the 2024-25 income tax return.\n\n\n\nWhat is the fixed-rate method?\n\nThe fixed-rate method apportions the additional running expenses you may incur by using a fixed rate for each hour you worked from home during the income year.\n\n\n\nThose expenses include energy, internet, mobile and phone, and stationery and computer consumables, provided they are incurred on a fair and reasonable basis.\n\n\n\n\n\nThe fixed rate per hour calculates the total of your deductible expenses for the income year, but does not apply if a separate deduction is claimed for any of the eligible expenses.\n\n\n\n\n\n\"It is designed to simplify the calculation and the records required to claim working from home expenses,\" an ATO spokesperson told SBS News.\n\n\n\n\n\nIf you do not use the fixed-rate method, you will need to use the actual expenses method to claim a deduction for the additional expenses you incur as a result of working from home.\n\n\n\n\n\n\"Taxpayers can use the method that gives them the best outcome, provided they've kept the right records,\" the spokesperson said.\n\n\n\nWho can claim it?\n\nYou can rely on the fixed-rate method to calculate a deduction for additional running expenses if you work from home while carrying out your employment or business duties, incur additional running expenses as a result of working from home and keep relevant records to evidence the running expenses you are incurring.\n\n\n\n\n\nSuch evidence must include at least one monthly or quarterly invoice for each of the expenses, or one receipt for every item bought.\n\n\n\n\n\nReliance on the fixed-rate method does not require that you have a separate home office or dedicated work area set aside in your home.\n\n\n\nHow to calculate your deduction\n\nIn order to calculate the total deduction for running expenses, first calculate the number of hours worked from home during the income year and multiply it by the fixed rate.\n\n\n\n\n\nThen, calculate the work-related decline in value of any depreciating assets used to work from home during the income year.\n\n\n\n\n\nThe sum of both results will determine the amount that can be claimed as a tax deduction.\n\n\n\nWhy the change?\n\nThe ATO said the 3 cent bump reflects the most current Australian Bureau of Statistics data on the 'basket of goods', as it pertains to \"relevant expenses included in the rate\".\n\n\n\n\n\nThat metric uses a representative collection of items used to measure changes in the cost of living and inflation over time.\n\n\n\n\n\n\"The update to the rate does not alter the expenses included under the method or eligibility criteria,\" an ATO spokesperson said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-to-spot-misinformation-disinformation-online/e0uw6vy4h",
    "title": "You can't trust everything you read online. Here's how to spot misinformation",
    "publish_date": "Thu, 17 Apr 2025 04:40:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "Ever been scrolling through your Instagram feed, or the comments on a Facebook post, and thought: 'Hmm, that doesn't seem right'?\n\n\n\n\n\nMaybe it's a clickbait-y headline, an account with no profile and no friends spamming others with dodgy-sounding statistics, or a political hashtag being promoted by what look like bots.\n\n\n\n\n\nIf any of these are familiar, there's a chance you've been exposed to misinformation or disinformation.\n\n\n\n\n\nAt least 26 per cent of Australians rely on social media as their primary source of news, according to a 2024 report released by behaviour change communications company Shannon Behaviour Change.\n\n\n\n\n\nBut just 24 per cent of people think social media and online platforms are successfully regulating misinformation and disinformation.\n\n\n\nREAD MORE The voters who could see more misinformation this election\n\nAnd with Australia in the middle of an election campaign , there's a high chance that in your travels through the internet, you'll encounter information that isn't true.\n\n\n\n\n\nSo, how can you spot it and verify it?\n\n\n\nMisinformation versus disinformation\n\nMisinformation is incorrect or false information that people spread without intending to deceive others, often because they genuinely think it's true. Misinformation may be shared by mistake or due to ignorance.\n\n\n\n\n\nDisinformation is malicious: the person distributing it knows the information is false, biased or misleading and is sharing it to deceive people.\n\n\n\n\n\nDisinformation can also become misinformation if it's spread by people who believe it is actually true.\n\n\n\nREAD MORE How false rumours, misinformation and disinformation are fuelling social media\n\nWhy do people spread misinformation and disinformation?\n\nFalse information can come from many different sources, from foreign governments to online conspiracy theorists. They may be receiving a financial incentive to spread disinformation, aiming to promote a particular political agenda, or they may simply be trolls wanting to sow online discord.\n\n\n\n\n\nDr Denise Goodwin, co-director of health programs at BehaviourWorks Australia at Monash University, specialises in data collection and management. She said the rise in both misinformation and disinformation was linked to the idea of a \"post-truth\" society.\n\n\n\n\n\n\"Objective facts are less influential than emotional or ideological appeals, which is often exploited by politicians and state actors to sway public opinion, further polarising societies,\" she said.\n\n\n\nCommon types of misinformation and disinformation\n\nThe Australian eSafety commissioner has a helpful resource page about misinformation and disinformation, which includes questions to ask yourself when encountering suspicious information online.\n\n\n\n\n\nFor example, does the content seem extremely one-sided, or \"too good to be true\"? Is there evidence presented in the story that justifies the claims it makes?\n\n\n\n\n\nThe eSafety Commission stresses the importance of using critical thinking to question the content you’re seeing.\n\n\n\nThese questions from the eSafety commissioner can help you stay alert to misinformation and disinformation. Credit: SBS You also might encounter doctored images or videos, so be aware of potential photoshopping or editing.\n\n\n\n\n\nSigns of doctored images can include blurring, pixelation or inconsistent skin tones and textures, while video may be low quality or contain glitches and inconsistent sound or lighting.\n\n\n\n\n\nOne helpful tool to identify potentially doctored images is reverse image searching, which is possible through search engines like both Google and Bing, as well as other image searching sites.\n\n\n\n\n\nReverse image searching can help you find other instances where an image has been used and provide more context about its origin.\n\n\n\n\n\nThere are a number of topics where you might encounter fake information.\n\n\n\n\n\nIn recent years, misinformation and disinformation about the COVID-19 vaccine spread rapidly on platforms like Facebook.\n\n\n\n\n\nClimate change misinformation is also prevalent online and may include things like false or distorted scientific data.\n\n\n\nAccording to the State of Change report, there is a risk to Australian democratic institutions and processes due to the growing prevalence of \"false narratives and conspiracy theories\".\n\n\n\n\n\nGoodwin said there are \"significant\" political implications of misinformation and disinformation.\n\n\n\n\n\n\"They undermine trust in democratic institutions, erode the credibility of the media, and facilitate societal polarisation,\" she said.\n\n\n\n\n\n\"This creates an atmosphere of distrust that weakens political accountability and destabilises systems, making them vulnerable to populist leaders who exploit public scepticism of credible information.\"\n\n\n\n\n\nMisinformation and disinformation might also contain a nugget of truth among the falsehoods, making it seem more legitimate. That's why it's important to fact-check content you see online.\n\n\n\nREAD MORE Australian federal election 2025 explained: Everything you need to know\n\nHow to fact-check information\n\nLuckily, there are lots of ways you can fact-check.\n\n\n\n\n\nAccording to the State of Change report, when encountering misinformation or disinformation, 33 per cent of people surveyed did nothing.\n\n\n\n\n\nBut 38 per cent checked alternative sources for verification and 30 per cent said they commented on posts or told others that it was misinformation.\n\n\n\n\n\nThere are a number of websites working to verify information and debunk misinformation, including United States-based FactCheck.org, Snopes.com and the Australian Associated Press' AAP FactCheck.\n\n\n\nDoing your own research is another important step for verifying information you see online, particularly using well-respected media outlets or government department websites.\n\n\n\n\n\nEighty-eight per cent of people surveyed in the report sought to verify information they saw on news or social media.\n\n\n\n\n\nThe most common way of doing this was searching for information through Google or another search engine, followed by reading additional articles and then reading information from experts.\n\n\n\nThe most common way people verify information is through Google or another search engine. Credit: SBS There are also a number of media literacy resources you can find online.\n\n\n\n\n\nThey range from training resources offered by organisations like First Draft News to interactive games like Deakin University’s Libertas Veritas game, where you play a government official looking to spread propaganda.\n\n\n\n\n\nThese resources can help you understand why and how lies are spread online.\n\n\n\nWhat about government regulation?\n\nThe Digital Industry Group, a non-profit industry association, has a voluntary code of practice of disinformation and misinformation, established in 2021 after a request from the Australian government. Its signatories include Adobe, Apple, Google, Meta, Microsoft, Redbubble, and TikTok, among others.\n\n\n\nThe Australian Communications and Media Authority (ACMA) monitors the activity of digital platforms under the code and reports back to the government.\n\n\n\n\n\nIts most recent report in 2023 found there was an \"urgent need\" to improve transparency around what measures platforms were taking to prevent misinformation and disinformation, and how effective they were.\n\n\n\n\n\nIn late 2024, the federal government scrapped a bill that would have given ACMA the power to monitor digital platforms and require them to keep records about misinformation and disinformation.\n\n\n\n\n\nIf ACMA deemed companies had failed to adequately self-regulate, it would have had the power to approve an enforceable industry code of conduct, or introduce minimum standards.\n\n\n\nREAD MORE What is the misinformation bill and why has it triggered worries about freedom of speech?\n\nWhile the bill passed the lower house, it faced criticism from across the political spectrum over fears it would infringe on freedom of speech. Labor then abandoned the bill, saying it had no hope of passing in the Senate.\n\n\n\n\n\nSeventy-seven per cent of Australians surveyed for the State of Change report said they agreed or strongly agreed that people have a personal responsibility to verify information before sharing it with others.\n\n\n\n\n\nSo if you're tempted to share something or come across information that seems a little suspicious, remember that misinformation and disinformation are out there. But with the right tools, you're equipped to spot it, check it and fight it.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/article/easter-2025-heres-whats-open-on-the-long-weekend-across-australia/lfewdtfd9",
    "title": "Easter 2025: Here's what's open on the long weekend across Australia",
    "publish_date": "Thu, 17 Apr 2025 03:30:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "This year, Good Friday falls on 18 April and will begin the four-day Easter long weekend.\n\n\n\n\n\nFor over 11 million Christians in Australia, it marks the crucifixion and resurrection of Jesus Christ following 40 days of reflection during Lent.\n\n\n\n\n\nIt’s also the first time since 2017 that both Western and Orthodox Easter celebrations have aligned.\n\n\n\n\n\nHere’s your guide to which businesses will be open or operating under alcohol and trading restrictions.\n\n\n\nREAD MORE Where double demerit points are in force across Australia this Easter\n\nWhat’s open on Good Friday?\n\nWoolworths stores will be closed nationwide, with some exceptions in South Australia, Western Australia and at Brisbane Airport, Queensland.\n\n\n\n\n\nAll Coles supermarkets will be closed, except for Victor Harbor, Murray Bridge Green and Mount Barker in South Australia.\n\n\n\n\n\nAldi, Big W, Bunnings, Australia Post, and Westfield shopping centres will also shut.\n\n\n\n\n\nIn NSW, the takeaway sale of alcohol is banned, and drinks can only be served on premises between midday and 10pm.\n\n\n\n\n\nIn Victoria, bottle shops will be closed while licensed venues can serve alcohol from midday to 1am.\n\n\n\n\n\nPeople in Queensland and Western Australia can only buy alcohol with a meal at licensed venues.\n\n\n\n\n\nIn South Australia, the ACT and Tasmania, there are no limits on alcohol sales for public holidays.\n\n\n\n\n\nHowever, gambling at hotels and clubs will not be permitted across the country.\n\n\n\nWhat’s open on Easter Saturday?\n\nMost major supermarkets, including Aldi and retail stores, will be open.\n\n\n\n\n\nAll Woolworths supermarkets will reopen, except for some Metro outlets.\n\n\n\n\n\nColes stores will be open on Saturday.\n\n\n\n\n\nMost stores will be operating according to holiday trading hours, and opening hours may depend on where you are.\n\n\n\nWhat’s open on Easter Sunday?\n\nIn NSW, most businesses cannot open on Easter Sunday unless they have obtained a special exemption. Services including petrol stations, pharmacies and small grocers generally operate.\n\n\n\n\n\nIn South Australia, retail trading is restricted to the Adelaide CBD and in Western Australia to Greater Perth. In both states, stores in these regions will only open between 11am to 5pm.\n\n\n\n\n\nIn Queensland, small independent retailers can operate without restriction but larger retailers, including supermarkets and department stores, will mostly be only allowed to open from 9am to 6pm.\n\n\n\n\n\nIn Victoria, ACT and Tasmania, no restrictions apply.\n\n\n\nWhat’s open on Easter Monday?\n\nMost businesses will reopen. In Queensland, large retailers including supermarkets and department stores will have the same restrictions as Easter Sunday.\n\n\n\n\n\nIn South Australia, only some supermarkets will be open. Those in the Adelaide CBD can only operate from 10am to 5pm.\n\n\n\n\n\nIn Western Australia, general retailers can only open from 8am to 6pm.\n\n\n\nWhy does the date for Easter change each year?\n\nEaster is recognised as a movable feast, meaning it can fall as early as 22 March — the last time this happened was 1818 — or as late as 25 April, as occurred in 1934.\n\n\n\n\n\nThe date varies each year as Easter is determined by a lunar calendar, which follows the movement of the Earth and Moon.\n\n\n\n\n\nBut some Christian denominations use different calculations and calendars to determine the date.\n\n\n\n\n\nOrthodox churches follow the Julian calendar, which is currently 13 days behind the Gregorian calendar, which Western churches adhere to.\n\n\n\n\n\nThe two Easter celebrations will collide in 2025, an overlap that occurs approximately every three to four years.\n\n\n\n\n\nThis year also marks 1,700 years since the Council of Nicaea, regarded by most Christians as the first major meeting of the church.\n\n\n\n\n\nThe anniversary has reignited the debate among some Christians, including Pope Francis, who called for a unified Easter date earlier this year.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 3
  },
  {
    "url": "https://www.theage.com.au/national/mother-kidnapped-before-body-found-in-torched-car-20250418-p5lsrl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Mother kidnapped before body found in torched car",
    "publish_date": "Fri, 18 Apr 2025 11:54:41 +1000",
    "category": "finance",
    "authors": [],
    "text": "Mother kidnapped before body found in torched car\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/europa-league-live-ange-s-spurs-face-era-defining-quarter-final-clash-against-eintracht-frankfurt-20250417-p5lsgd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Europa League 2025 as it happened: Ange’s Spurs into semi-finals after gritty away win in Germany",
    "publish_date": "Fri, 18 Apr 2025 11:49:40 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "It felt like Ange Postecoglou could even be out of a job before Easter was over had Tottenham Hotspur exited the Europa League.\n\nInstead the head coach and Tottenham fight on after an impressive battling performance (a rarity in Postecoglou’s reign) to reach their first semi-final in this competition, then the Uefa Cup, since 1984.\n\nWhether even winning this competition, and earning a precious Champions League place, with the finance that brings, can save Postecoglou remains in severe doubt. Maybe the die is already cast on his future given their wretchedness in the Premier League.\n\nTottenham’s Dominic Solanke celebrates after scoring his side’s opening goal. Credit: AP\n\nBut had Spurs lost to Eintracht Frankfurt, Postecoglou may well not have been in the dug-out for Monday’s next league encounter, at home to Nottingham Forest, such was the mood. Their season would have been over and, so, it could be argued there was little reason for carrying on given how beleaguered he has become.\n\nBut in winning, and keeping a clean sheet, Spurs have also kept alive the Australian’s much-derided declaration that he always claims a trophy in his second season at a club. That promise is one he can still keep, whatever then happens.\n\nThe Frankfurt fans were relentless. Postecoglou will hope he has silenced some of the noise around him and he looked like a man, on the touchline, who knew what was at stake. On the final whistle all his coaches jumped on him for a group hug with goalkeeper Guglielmo Vicario sprinting to join in.",
    "source": "TheAge",
    "cluster_id": 12
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/dreading-time-with-family-this-weekend-try-these-ideas-for-a-harmonious-get-together-20250413-p5lrct.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dreading time with family this weekend? Try these ideas for a harmonious get-together",
    "publish_date": "Fri, 18 Apr 2025 11:45:10 +1000",
    "category": "lifestyle",
    "authors": [
      "Robyn Willis"
    ],
    "text": "One of the many benefits of the mini break known as Easter is the opportunity to spend time with family. Whether it’s a time to celebrate faith or just a chance to indulge in a truckload of chocolate, it’s not unusual to find yourself in the company of relatives, close and not-so-close.\n\nRelationships Australia national executive officer Nick Tebbey says many people look forward to such gatherings.\n\n“A lot of people find being with family nourishing, and they focus on the positives,” he says.\n\nEaster is a great opportunity to celebrate with family. Credit: Getty Images\n\nHowever, he says there’s a growing cohort who find family time fraught, often for the same reason.",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/culture/celebrity/i-hear-you-mocking-the-female-astronauts-you-re-doing-patriarchy-s-dirty-work-20250417-p5lsmf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "I hear you mocking the female astronauts. You’re doing patriarchy’s dirty work",
    "publish_date": "Fri, 18 Apr 2025 11:45:00 +1000",
    "category": "finance",
    "authors": [
      "Kate Halfpenny"
    ],
    "text": "Bad feminist that I seem to be, I missed what many other women saw and felt when the “historic” all-female Blue Origin space jaunt started making news. My first thought? Cool space suits. Very Josie and the Pussycats. Seventies glam, high pony, love it.\n\nMy shallow all-about-the-optics mind was soon schooled by a slew of celebrities who, from the safety of their socials, quickly turned this 11-minute ride to the edge of Earth into a global hot button topic.\n\nSure, space tourism is crazy, but women have much bigger problems to confront than the all-female crew of Blue Origin that included pop star Katy Perry (pictured back centre-left Credit: AP\n\nNo sooner had the crew touched down than rockets were fired at the astronauts. Well — almost exclusively at Katy Perry. She sang What A Wonderful World (I am dead), kissed the ground, noted her makeup stayed intact and flashed her tour set list. Ick.\n\nThe pile-on came from an old songbook. When women become the face of something they also become the face of the backlash. Unless they have a backstory awash with trauma or diversity, they can be shredded, the barbs packaged as entertainment.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/you-have-to-put-up-with-me-for-a-bit-longer-ange-clips-critics-as-spurs-keep-trophy-hopes-alive-20250418-p5lsoz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘You have to put up with me for a bit longer’: Ange clips critics as Spurs keep trophy hopes alive",
    "publish_date": "Fri, 18 Apr 2025 11:44:56 +1000",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "The scenes at full-time said it all. After Spurs were forced to withstand immense pressure through a late onslaught from the hosts, Postecoglou fist-pumped the air at the final whistle and then was immediately mobbed by his support staff. Guglielmo Vicario jumped on the pile. One by one, the rest of his players embraced him, with feeling. You could see it. The conspiracy theorists will do their thing, and chairman Daniel Levy’s opinion is another matter entirely, but it was abundantly clear that the football-facing elements of Tottenham Hotspur are 100 per cent behind their leader. This was unity in full display, total focus and maturity in the face of adversity and relentless outside noise, from the media and their own supporters. Postecoglou last week lamented a lack of attention from the “football gods” but in Frankfurt, they were blessed. It’s been overdue. Instead of them losing key players to injury, it was their opponents, whose talisman Mario Götze was forced off after just 17 minutes, clutching at his hamstring, instantly disrupting their rhythm. Instead of them giving goals away, they were the recipients, thanks to the clumsiness of Frankfurt goalkeeper Kaua Santos, who had a blinder last week. This week he ironed out a brave James Maddison as he tracked a ball into the box from Cristian Romero; the resultant penalty was expertly slotted home by Dominic Solanke. Ange Postecoglou. Credit: Getty Images\n\nInstead of wasting chances, they watched Frankfurt’s Rasmus Kristensen burn three in quick succession late in the second half. These bits of good fortune shouldn’t detract from the reality: Spurs were the better team, and deserved to win. Postecoglou’s critics will say that if they played like this more often, they’d be less critical. In fairness to them, they’d be right, but in fairness to him, they ignore a lot of mitigating circumstances. And it’s worth noting that he perhaps conceded some ground to them: in the second half, he ditched some of his textbook tactical traits and ordered his team to dig in. There were more long, aimless goal kicks and clearances to nobody than you might see in full seasons of Angeball. His two second-half substitutions were to replace their two wingers with a defensive midfielder and a third centre-back. Dominic Solanke. Credit: AP\n\nCall it what you want - pragmatism, adaptation, self-preservation - but it worked, and that was all that mattered here. Next up is Bodø/Glimt, champions of Norway in four of the last five seasons, after they beat Lazio in the other quarter-final on this side of the draw in a dramatic penalty shootout. They are based in a small town just north of the Arctic Circle, with a population smaller than Tottenham’s stadium capacity - and they play on an artificial pitch, so making the most of the first leg in London on May 1 will be crucial. Loading The instinct will be to write them off immediately, but Postecoglou knows that will be a mistake: his Celtic side was humbled by the Norwegians in the knockout round play-offs of the UEFA Conference League in 2022. As compelling as Ange’s personal redemptive arc is, Bodø/Glimt’s is the true underdog story of this tournament. Spurs are the big dogs who should be winning it all. Post-match, Postecoglou was reminded about his notorious second-season trophy record, a fact - not a boast, not a promise, not a vow, but a fact, despite how it has been twisted - which has become a stick to beat him with.\n\n“People like to mock and ridicule and diminish my achievements,” he said. “That’s fine. I’ll keep doing what I do.” He had more to say to the written press. Loading “I am the same manager today that I was yesterday, so if people think us winning tonight makes me a better manager, or whoever thinks I wasn’t doing a good job yesterday, should be feeling the same way,” Postecoglou said. “I don’t care, it doesn’t bother me, it doesn’t affect what I do.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/vowing-to-play-beyond-2025-an-origin-star-braces-for-tough-family-talks-20250417-p5lsg1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Why Origin star left a powerhouse, and has pledged to fight for new deal",
    "publish_date": "Fri, 18 Apr 2025 11:22:09 +1000",
    "category": "sports",
    "authors": [
      "Nick Wright"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size This is the moment “the stars aligned” and tempted Felise Kaufusi from a rugby league powerhouse. When the Dolphins enforcer built his NRL career with the Melbourne Storm, he would marvel at the club’s founding fathers. Names such as Lazurus, Kimmorley, Kearns – pioneers who inspired the present day juggernaut. Kaufusi had achieved so much: two premiership rings, State of Origin triumphs and Kangaroos jerseys on his resume. But aside from desiring a return to Queensland as his father passed away, he wanted more. He wanted to follow those trailblazers into folklore. Felise Kaufusi in action for the Dolphins. Credit: Getty Images “That’s all we talked about down in Melbourne; the guys who started the club and their legacy we still talk about, and I’m pretty sure will always talk about,” Kaufusi tells this masthead before challenging his former teammates.\n\nAdvertisement\n\n“That’s something not just me, but the Bromwich boys [Jesse and Kenny] wanted to try to create, so that hopefully when our footy careers are done and dusted, the boys can look back at these founding players. “I don’t play to leave a legacy, I just hope my work speaks for itself. Being a foundation player for the Dolphins is what you will be remembered for. “It’s a part of history no one can take from you.” Tough talks nearing amid desire to play on So engrossed has Kaufusi become by the Redcliffe outfit’s birth, he has declared his desire to play beyond his 2025 contract. “I’m fresh in the mind and the body is holding up, so I’d love to continue playing as long as I can,” Kaufusi says.\n\nAdvertisement\n\n“It comes back to the body and mind, but at the moment, I’m enjoying my footy. Nappies aren’t cheap these days, so I might have to keep playing for as long as I can. Loading “You can only go as long as your body or mind tells you, and I haven’t got to the point to say I’ve had enough.” Aggression has been Kaufusi’s trademark. Yet, it is that physicality which draws the ire of fans who condemn him on social media. Kaufusi has heard it all before in an 11-year career – vitriol and angst littering searches of his name in the past. “I know I’ve copped it, and I can cop it,” he says, “it’s part of what we do”.\n\nAdvertisement\n\nBut Kaufusi faces some difficult conversations, as his children begin to appreciate the magnitude of his career. At school, classmates clamour for a photo of the 17-time Queensland Maroon, while his son will often ask why he hasn’t scored yet. But if the 32-year-old plays on, they will be open to the commentary which has followed their father – a foreign realm for most children, which comes with being in the spotlight. “My kids aren’t on social media yet, so they’re not exposed to it, but this next gen coming through are crazy on the gadgets and the iPhone,” Kaufusi says. “It’s something I haven’t had to navigate so far, but if I keep going until they’re old enough to have an account they’ll be exposed to it.\n\nAdvertisement\n\n“It’s one of those things we’ll have to go through and try work out our best way out of it.” Honouring his family Debate has raged about the future of international football since Broncos’ prop Payne Haas revealed he was considering defecting from the Kangaroos to Samoa. Hamiso Tabuai-Fidow and Tino Fa’asuamaleaui could follow. The ability for players to bounce between tier one and two Test nations, while being eligible for Origin, has divided pundits. Kaufusi, who shifted allegiances to Tonga, sympathises with Roosters star Victor Radley, who – born and raised in Sydney – is in New South Wales’ exile after opting to play for his father’s English heritage. Felise Kaufusi in action for Tonga in last year’s Pacific Championships final against Australia. Credit: NRL Photos\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/joey-fumes-over-nrl-contract-circus-20250418-p5lsrb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Joey fumes over NRL contract 'circus'",
    "publish_date": "Fri, 18 Apr 2025 11:18:50 +1000",
    "category": "finance",
    "authors": [],
    "text": "Joey fumes over NRL contract 'circus'\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/i-ve-never-been-at-a-better-place-jon-hamm-is-ready-to-take-charge-again-20250417-p5lsm6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I’ve never been at a better place’: Jon Hamm is ready to take charge again",
    "publish_date": "Fri, 18 Apr 2025 11:00:00 +1000",
    "category": "finance",
    "authors": [
      "Louise Rugendyke"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size If ever there was a man built to wear a suit, it’s Jon Hamm. As suave advertising executive Don Draper in the TV series Mad Men, he was rarely seen without a jacket and tie. He wore it as if it was a suit of armour, hiding a deeply troubled character underneath. It was the role – and the look – that would define him for his seven seasons on the show, but it’s taken the 54-year-old almost 10 years to feel ready to step back into the role of leading man. John Hamm plays Andrew Cooper, who starts robbing the rich when he’s fired from his Wall Street job. “I love it,” says Hamm. “I love being No.1 on the call sheet. I love having the ability and the responsibility to set the tone for the whole set. I’ve got very broad shoulders, I’m a pretty strong guy. I can carry a lot of things. But I knew at that point, especially right after Mad Men, that I probably wasn’t ready to go right into something else.” Loading He has found that “something else” – the TV series Your Friends and Neighbours. Set in the wealthy suburbs of New York, where sprawling estates match the large egos of the property owners, it’s the kind of place where rolls of cash and expensive watches are kept in unlocked drawers and staff quietly attend to the owners’ whims. It’s also where Andrew Cooper, played by Hamm, fits right in – he’s neatly summed up as “that white guy who looks like he brushes his hair a lot” – until his divorce and then job loss send him sliding down the pecking order. He’s still got the Maserati and the country club membership, but he’s also looking at all this excess – all this stuff – through new eyes. So he begins to steal it.\n\nAdvertisement\n\n“He has a lot going for him, and he has a lot to learn, too,” says Hamm, who is talking over Zoom while sitting in a room styled up to look like one of the mega-mansions Coop picks his way through. “And I think that’s part of the journey of the show – he is unlearning a lot of the things he thought he knew for certain, and relearning the things that he comes to discover are more important.” Andrew Cooper (Jon Hamm) and ex-wife Mel (Amanda Peet) navigate new relationships in Your Friends and Neighbours. It’s the type of role that seems tailor-made for Hamm, a familiar but not complete carbon copy of Don Draper. Like Draper, Cooper is a natural in a suit, he fits effortlessly into wealthy circles and is, essentially, a privileged white man no one would look twice at walking through any affluent neighbourhood. If he had to, he could get away murder. Loading “This [white privilege] is a particularly resonant idea right now,” says Hamm. “And why is that not examined deeper? What does that mean for us as humanity, really? Why do certain people seem to be immune to consequence? And what does that tell the generation that sees that happen over and over and over again about consequences?” For writer Jonathan Tropper, who created the series, it was the opportunity to mess with Hamm’s screen persona that proved irresistible. “I went to him before I even wrote it to get his participation,” says Tropper. “The idea [of the character] is a man who conveys all the entitlement and the privilege of somebody who belongs there, but at the same time, once it’s taken away from him, he has pools of angst and ennui.\n\nAdvertisement\n\n“And we needed to have an actor that can make him relatable once you’ve stripped that veneer away from him. And that’s what I really wanted to do, was take Jon and everything that he’s represented in the past on TV, and deconstruct it.” Trooper knows the territory of Your Friends and Neighbours well. He grew up in the wealthy neighbourhood of Westchester County, north of New York City, which served as inspiration. He had written several books set in the area, including This Is Where I Leave You, which was adapted into a 2014 film, but it felt right to return now. January Jones as Betty Draper and Jon Hamm as Don Draper in Mad Men. “It’s a comment on consumerism,” says Tropper. “It’s a comment on acquisition, and it’s a comment on a certain class in our society who are so actively acquiring that they actually, I think in a lot of cases, become blind to what actually matters to them. So you end up with a house full of stuff, but a very empty life.” It sounds like a very The White Lotus crowd. “When I was pitching the show, I was worried people were going to think it was more like Breaking Bad,” says Tropper, laughing. “I would say to them, ‘This is where The White Lotus people are when they’re not at The White Lotus.’” The series is Hamm’s first lead role since he left Don Draper meditating on a hilltop, finding the meaning of life and, probably, a slogan for Coca-Cola, in 2015.\n\nAdvertisement\n\nFor a long time, Don Draper defined him, and it also took him some time to shake off. “I knew that I needed a bit of a rest, and was certainly going through some very transitional things in other parts of my life as well,” says Hamm (he broke up with his long-term partner and spent time in rehab). So he chose supporting roles – a tech billionaire on The Morning Show, a Trump-loving county sheriff in season five of Fargo and a Texas oil titan in Landman – but they, too, leaned into Draper’s slippery slide. Even Fargo creator Noah Hawley admitted he cast Hamm because he needed someone the audience would like, no matter how terrible he was. Loading “Well, I think part of what Noah is identifying there, is that I represent – as how I look and how I’ve been in the world – I look like a person that you are supposed to believe and trust,” says Hamm. “And I think that when you put someone like that in a situation where he does things that you are also supposed to find really, really terrible, you, as a viewer, are conflicted, and I think that creates an engaged audience member.” Do you like being seen that way – trustworthy on the outside, shifty on the inside? “Everybody has an outward-facing persona, that’s the cover of our book, right?” says Hamm. “And we’ve all been told not to judge the book by that cover, but some of us still do, and oftentimes you’re not surprised by what the book has underneath the cover, but sometimes you are pleasantly surprised.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/victoria/orthodox-easter-congregation-in-footscray-20250418-p5lsr6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Orthodox Easter congregation in Footscray",
    "publish_date": "Fri, 18 Apr 2025 10:58:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "Orthodox Easter congregation in Footscray\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/queensland/woman-bitten-on-hand-by-dingo-before-easter-long-weekend-20250418-p5lspi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Woman bitten on hand by dingo before Easter long weekend",
    "publish_date": "Fri, 18 Apr 2025 10:32:57 +1000",
    "category": "lifestyle",
    "authors": [
      "Courtney Kruk"
    ],
    "text": "A woman has been bitten on the hands by a dingo near a camping area on K’gari on Thursday morning.\n\nThe woman had left the Winnam camping area alone and was walking towards the ocean about 10.30am when she was approached by five dingoes.\n\nVisitors to K’gari are reminded to never approach or feed dingoes, avoid walking alone and keep children close at all times. Food and waste should also be secured at all times. Credit: Kaihla McConnell\n\nA tagged dingo lunged at the woman. She suffered two lacerations to the middle fingers on both hands.\n\nThe Queensland Ambulance Service treated the woman on the island, formerly Fraser Island, and advised her to see a doctor.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/afl/fagan-zorko-in-unfriendly-exchange-20250418-p5lsp9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fagan, Zorko in 'unfriendly' exchange",
    "publish_date": "Fri, 18 Apr 2025 10:28:20 +1000",
    "category": "finance",
    "authors": [],
    "text": "Fagan, Zorko in 'unfriendly' exchange\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/carlo-had-a-big-head-before-the-tries-20250418-p5lsqx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "\"Carlo Had a Big Head Before the Tries\"",
    "publish_date": "Fri, 18 Apr 2025 10:17:54 +1000",
    "category": "finance",
    "authors": [],
    "text": "\"Carlo Had a Big Head Before the Tries\"\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/watch-out-for-henry-pollock-20250418-p5lsqt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Watch out for Henry Pollock",
    "publish_date": "Fri, 18 Apr 2025 10:07:20 +1000",
    "category": "finance",
    "authors": [],
    "text": "Watch out for Henry Pollock\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/it-s-worth-the-drive-just-for-the-cabbage-rolls-at-this-suburban-macedonian-diner-20250415-p5lrwq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "It’s worth the drive just for the cabbage rolls at this suburban Macedonian diner",
    "publish_date": "Fri, 18 Apr 2025 10:06:15 +1000",
    "category": "finance",
    "authors": [
      "Dani Valent"
    ],
    "text": "Advertisement\n\nReview Eating outEpping It’s worth the drive just for the cabbage rolls at this suburban Macedonian diner Marijan Nikolovski and his family serve kebapi sausages, flavour-forward dips and more at Balkan Skara in Melbourne’s north. Dani Valent April 18, 2025 Save Log in , register or subscribe to save recipes for later. You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\n1 / 7 Sarma (cabbage rolls) at Balkan Skara. Jason South 2 / 7 Inside Balkan Skara. Jason South 3 / 7 Nafora grilled bread. Jason South 4 / 7 Ajvar (capsicum dip) with olives and bread. Jason South 5 / 7 Meat platter with kebaci and sharska (cheese stuffed patty). Jason South 6 / 7 Balkan Skara is worth the drive to Epping. Jason South 7 / 7 Three-milk sponge cake. Jason South Previous Slide Next Slide Eastern European$$$$ Did you hear the one about the guy who loved his local restaurant so much he bought it? That’s how Marijan Nikolovski ended up with Balkan Skara, where his family had celebrated christenings and birthdays for years. A longtime engineer in the automotive industry, the demise of local car manufacturing meant he was out of a job. Nikolovski was forever tinkering on the Weber at home – maybe he should fulfil his dream of running a restaurant one day? In 2023, he bought his favourite restaurant when the owners were ready to retire. It was a fond handover and included recipes that had kept the northern suburbs happy for 20 years. Nikolovski added some of his Macedonian family’s own recipes and rebranded the place to Balkan Skara (“skara” meaning “grill” in Macedonian). The name gives a handy clue to the offering. As a region, people and culinary identity, Macedonia spans six countries, anchored by landlocked North Macedonia, and including parts of northern Greece, Albania, Kosovo, Serbia and Bulgaria. Macedonian cuisine is a subset of Balkan food, with dishes such as skinless sausages, pepper dip and cabbage rolls found throughout the region with national and aunty-to-aunty variations.\n\nAdvertisement\n\nMeat platter with kebaci and sharska (cheese stuffed patty). Jason South The politics are complicated, but if anything promotes peace, it’s honest food made with pride and generosity – as it is at Balkan Skara. Everything happens in one room. Walk past the sheltered patio, and you’ll probably see Marijan at the grill, keeping an eye on his beloved kebapi sausages. His sons might be there cooking rice or soaking beans, wife Angelina will be taking orders in the small dining room (“Just the usual?” I hear her ask one guy), with her mum Pavlina pitching in. The music on the television is Macedonian – you’ll likely see footage of piano accordions and sheepskin bagpipes similar to those displayed on the walls. It feels like you’re in the Epping melting pot, 18 kilometres north of the CBD, with a Thai place next door, an Indian supermarket around the corner, and an old-school pizza joint down the road. All meals lead to the grill, but you’ll also want starters. Ajvar is a sturdy relish made with capsicum and eggplant, perfect for spooning over fluffy lep, a Balkan pide. Leftover bread is one of the world’s great gifts, and in Macedonia it’s grilled, drizzled with olive oil and scattered with oregano and feta to make nafora. Kaymak is a dense, clotted cream and there’s no wrong way to eat it: with bread, alongside beans, as a dessert.\n\nAdvertisement\n\nNafora grilled bread. Jason South I would drive to Epping especially for the sarma. To make them, the family pickles cabbage leaves for months until they are soft and savoury. They’re stuffed with rice and pork mince to form plump, comforting treasures. Kebapi are made to a secret ratio of pork and beef mince. Grilled with avid attention, you can tell how much care goes into this bedrock dish. The same meat mix is used for sharska, a football-shaped pattie parcel stuffed with tasty cheese. Cutting into it was a satisfyingly oozy experience. To eat shopska salad, you’ll need to spoon your way through a serious layer of grated feta to reveal the tomato, cucumber and onion jumbled underneath. It’s disarmingly simple – use the oil and vinegar on your table to adjust the dressing. For the three-milk cake, sponge is soaked in milk, cream and condensed milk to create a perfect pudding-like dessert. Drinking is threaded through Balkan food culture. There’s a Macedonian semi-dry red made from vranec, an indigenous grape, which goes well with grilled meats; BYO wine, Skopsko pilsner and rakiya (a potent fruit brandy) are options too. Raise a toast to Marijan Nikolovski, who is ticking off his bucket list and making people happy at the same time.\n\nAdvertisement\n\nThree more grills to try Jim’s Greek Tavern Whether it’s fish on the grill or lamb twirling over charcoal, Jim’s knows how to do fresh and fire-cooked. Since 1967, it’s been welcoming groups for upbeat meals in a casual setting at keen prices. A Melbourne institution for good reason. 32 Johnston Street, Collingwood, facebook.com/jimsgreektavern Galata Kebab There’s lamb and chicken from the spit, skewers and cutlets on the grill and excellent just-feed-us platters. Beyond meats, people come for the house-made dips and a killer range of halal snack packs, plus Turkish tea, coffee and traditional desserts. 173 Caroline Springs Boulevard, Caroline Springs, facebook.com/galatamelbourne TungThit Sizzling Steak Asian fusion grills are the thing at TungThit, whether it’s wagyu tomahawk served with bone marrow fried rice, or a neat little 150-gram porterhouse. You could also go for Melbourne’s most expensive banh mi, stuffed with beef short rib and pushing $60. Also in Abbotsford. 41 Springvale Road, Springvale, instagram.com/tungthit_sizzlingsteak Good Food reviews are booked anonymously and paid independently. A restaurant can’t pay for a review or inclusion in the Good Food Guide.\n\nRestaurant reviews, news and the hottest openings served to your inbox. Sign up",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://au.news.yahoo.com/campers-gruesome-injuries-lead-to-warning-ahead-of-easter-holidays-a-lot-of-mistakes-075237951.html",
    "title": "Camper's gruesome injuries lead to warning ahead of Easter holidays: 'A lot of mistakes'",
    "publish_date": "2025-04-17T07:52:37Z",
    "category": "finance",
    "authors": [],
    "text": "It's an outdoor rule we are all familiar with – staying hydrated. But even the most prepared campers can make mistakes, and this time it landed him in hospital.\n\nAndrew Lane spent months preparing for the trip, but a simple oversight had painful consequences that cut his adventure short. Source: Andrew Lane/6PR, Shire of Murray\n\nWith the Easter holidays upon us and many campsites around Australia booked out, one camper’s gruesome injuries have served as a timely reminder to follow basic — but effective — rules to ensure a safe and memorable trip.\n\nAndrew Lane was only five days into a long-awaited hiking trip on the Bibbulmun Track in Western Australia. He was using his long service leave and spent months planning the journey when things took a painful turn at the end of a hot day.\n\n\"I got severely dehydrated, so I ended up getting into camp and thought I felt a little bit under the weather so skolled a massive amount of water, and then made a cup of tea to make myself feel a little bit better,\" Andrew told Perth's 6PR.\n\nAs he was dunking the tea bag into the water, his surroundings suddenly \"went black\" as he passed out. When he came too, he realised four of his fingers had been \"dangling\" in the boiling water, and were now blistered and raw.\n\nADVERTISEMENT\n\nIncredibly, the pain didn’t rouse him and he woke to find his fingers “cooked pretty nicely”.\n\n“They went up like some big English breakfast sausages,\" he said.\n\nAndrew's hand was left blistered \"like breakfast sausages\". Source: Andrew Lane/6PR\n\nHiker tried to carry on without help\n\nAndrew said he knew the damage was quite bad, but he had been planning the trip for “months and months” and didn’t want it to come to an end only five days in. He said there were other campers nearby, but he was “embarrassed” to tell them what happened.\n\nUsing what he had with him, he ran his fingers under cold water and wrapped up his hand, and took painkillers to ease the pain.\n\nHe planned to stop in at Collie, about 40km down the trail, to see a doctor where he figured they would \"pop the blisters\" and he'd be on his way. But about 25km into the walk, he found some phone reception and made a call to his wife.\n\nADVERTISEMENT\n\nAfter seeing a photo of his blistered hand, she told him he had to stop walking and go to a hospital. He caught a cab to Collie.\n\nOn advice from Fiona Stanley Hospital, doctors at Collie Hospital cut away the blisters, cleaned the wound and dressed it properly.\n\n“The pain at the time when I did it was not as bad as the pain of having to get it treated,\" Andrew said.\n\nHe admitted he made \"a lot of mistakes\" on his short trip, and warned fellow campers that the \"most dangerous time\" during a camping trip is whenever there are hot things around.\n\nHe also stressed the importance of staying hydrated and replenishing lost electrolytes.\n\n“I was sweating all day, had really low electrolytes and then I stupidly should have taken on board some electrolytes straight away but just managed to drink a whole lot of water… and that of course thins out your electrolytes even further so yeh, I did a lot of mistakes.”\n\nADVERTISEMENT\n\nTwo years on from the incident, staff at Fiona Stanley are still \"keeping an eye\" out for him, but Andrew feels like he's made a full recovery.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 40
  }
]