[
  {
    "url": "https://www.9news.com.au/national/helloworld-launches-takeover-bid-of-webjet/a95f434b-d784-4a19-8b43-8dcd9082f29e",
    "title": "Popular online travel agency announces takeover bid",
    "publish_date": "Tue, 18 Nov 2025 23:31:55 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "H﻿elloworld Travel has launched a takeover bid for online travel agent Webjet.\n\nWebjet announced that under the non-binding offer, Helloworld would acquire 100 per cent of the remaining shares in Webject at 90 cents a share.\n\nHelloworld currently has a 17.27 per cent stake in Webjet.\n\nREAD MORE: Trump hurls outrageous slur at female reporter\n\nOnline travel agent Webjet has announced a takeover bid by Helloworld Travel. (Webjet)\n\nThe takeover offer is subject to a number of conditions, including a satisfactory completion of due diligence by Helloworld; entry into a scheme implementation deed with customary terms and conditions; and a unanimous favourable recommendation from the Webjet board.\n\nThat recommendation will also require the absence of any superior proposal, and an independent expert's confirmation that the sale was in the best interests of Webjet shareholders.\n\nRegulatory approvals and approvals from shareholders and the courts are also required.\n\nREAD MORE: Huge vote on Epstein files after Trump backflip\n\nHelloworld would purchase all shares it does not currently control at 90 cents apiece. (9News)\n\nThe purchase would be funded through a combination of cash on balance sheet, and new debt facilities, Webjet said.\n\nThe board has agreed to provide Helloworld with an opportunity to conduct due diligence, noting that no binding offer was in place.\n\nShareholders have been told they do not have to currently take any action, and that more announcements will come.﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/stocks-drop-after-another-jarring-day-as-worries-about-too-high-prices-keep-dogging-nvidia-bitcoin/65543d6c-281a-4e76-9532-b7c08f1d5fd0",
    "title": "Stocks drop after another jarring day on Wall Street",
    "publish_date": "Wed, 19 Nov 2025 00:51:17 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "The US stock market fell after another jarring day, as worries keep dogging Nvidia, bitcoin and other Wall Street stars that their prices shot too high.\n\nAfter quickly sliding to a morning loss of 1.5 per cent, the S&P 500 clawed back nearly all of it before sinking again.\n\nIt finished with a fall of 0.8 per cent and pulled further from its all-time high set late last month. The Dow Jones Industrial Average lost 498 points, or 1.1 per cent, and the Nasdaq composite sank 1.2 per cent.\n\nREAD MORE: Trump hurls outrageous slur at female reporter\n\nSpecialist Anthony Matesic and trader Patrick Casey work on the floor of the New York Stock Exchange. (AP)\n\nThe shaky finish on Wall Street was felt in the Australian share market, which fell at the opening of trade before steadying to go up 0.5 per cent up at midday.\n\nIn the US, Nvidia was again the heaviest weight on the market, and its drop of 2.8 per cent brought its loss for the month so far to more than 10 per cent.\n\nThat’s a steep enough fall that Wall Street has a name for it: a correction.\n\nWhat Nvidia does matters disproportionately to savers’ 401(k) accounts because its immense size means it’s the most influential stock on Wall Street. Those 401(k) accounts are the equivalent of Australia's superannuation funds.\n\nIt single-handedly steers the direction of the S&P 500 some days, after fervent demand for its artificial-intelligence chips helped it briefly top $5 trillion in total value.\n\nThe US stock market’s recent struggles are a sharp turnaround from its nearly relentless rally since April, when Wall Street last sold off after President Donald Trump shocked the world with stiff tariffs.\n\nREAD MORE: Huge vote on Epstein files after Trump backflip\n\nTrader Anan Patel works on the floor of the New York Stock Exchange, Tuesday, Nov. 18, 2025. (AP Photo/Richard Drew) (AP)\n\nThat rally was so strong that critics say it may have carried prices too high, too fast and left the market at risk of a sharp drop.\n\nThey point in particular to stocks swept up in the AI mania, which have been surging at spectacular speeds for years.\n\nNvidia’s price more than doubled in four of the last five years, for example, while Palantir Technologies’ stock more than doubled in the first six and a half months of this year.\n\nMany big investors still seem to expect stock prices to rise further, according to the latest monthly survey of global fund managers by Bank of America Global Research.\n\nBut when asked what the No. 1 risk for the market is, one with a lower probability of happening but a chance of very big damage, 45 per cent pointed to an AI bubble.\n\nThat beat out potential trouble in the bond market, inflation and trade wars.\n\nOptions trader Joseph D'Arrigo works on the floor of the New York Stock Exchange, Tuesday, Nov. 18, 2025. (AP Photo/Richard Drew)\n\nA record percentage of investors is also saying companies are “overinvesting,” according to the survey.\n\nThe worry is that all the dollars pouring into AI chips and data centers worldwide may not produce the kind of revolution that AI proponents have been predicting, or at least not as profitable a one.\n\nOther high-flying areas of the market with their own evangelists have also been struggling lately.\n\nBitcoin’s price briefly fell below $US90,000 ($138,000) in the morning, down from nearly $US125,000 last month. It later recovered some of its losses and climbed back toward $US93,000.\n\nHome Depot also dragged the market lower after falling 6 per cent.\n\nIt reported a weaker profit for the summer than analysts expected and cited a variety of reasons.\n\nChief among them was a lack of storms, which would have driven customers to buy more home-improvement supplies.\n\nHome Depot chief executive Ted Decker also pointed to “consumer uncertainty and continued pressure in housing” for preventing an expected increase in demand.\n\nReporting stronger profits is one of the ways a company can make its stock price look less expensive, because stock prices tend to track with earnings over the long term.\n\nThat’s raising the stakes for tomorrow's profit report from Nvidia, which could either help halt its stock’s slide or worsen it.\n\nElsewhere on Wall Street, Cloudflare fell 2.8 per cent after an earlier issue at the internet infrastructure provider caused global outages for ChatGPT and other services.\n\nAll told, the S&P 500 fell 55.09 points to 6,617.32.\n\nThe Dow Jones Industrial Average dropped 498.50 to 46,091.74, and the Nasdaq composite sank 275.23 to 22,432.85.\n\nIn the bond market, Treasury yields likewise oscillated through the day.\n\nThe yield on the 10-year Treasury eventually eased to 4.11 per cent from 4.13 per cent late Monday.\n\nYields have been swinging amid doubts about whether the Federal Reserve will cut its main interest rate at its next meeting in December, something that traders had earlier seen as very likely.\n\nWhat the Fed does is critical for the market because stock prices ran to records in part because of expectations for continued cuts to rates.\n\nThe Fed has cut rates twice already this year in hopes of shoring up a slowing job market.\n\nBut lower interest rates can make inflation worse, and inflation has stubbornly remained above the Fed’s two per cent target.\n\nIn stock markets abroad, indexes tumbled across Europe and Asia.\n\nSouth Korea’s Kospi sank 3.3 per cent, Japan’s Nikkei 225 dropped 3.2 per cent and France’s CAC 40 fell 1.9 per cent for some of the world’s larger drops.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/new-nsw-puppy-laws-2025-breeder-identification-numbers-litter-limits-selling-rules-everything-to-know-explained/718be85f-f47b-48ec-8fa3-c80d184462c9",
    "title": "The $110,000 fine you could face if your dog has puppies",
    "publish_date": "Tue, 18 Nov 2025 23:59:14 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "P﻿uppy breeders and owners in New South Wales could face massive fines exceeding $110,000 after new laws come into effect next month.\n\nThe state government is cracking down on illegal backyard breeding and puppy farming, including ﻿a strict cap on the number of litters a dog can have over its lifetime, from December 1.\n\nThe tougher laws aim to make it easier for families looking to buy a new puppy to find an \"ethical and accountable breeder\", the NSW government said.\n\nREAD MORE: Trump hurls outrageous slur at female reporter\n\nThe NSW government is cracking down on illegal puppy farming and backyard breeding with new laws. (Joe Armao)\n\n﻿This fresh legislation is captured under the NSW Prevention of Cruelty to Animals Amendment (Puppy Farming) Act 2024.\n\nHere's everything you need to know about the upcoming law changes.﻿\n\nYou'll need a new identification number﻿\n\nThe first change will require all NSW puppy breeders to have something called a Breeder Identification Number (BIN)﻿.\n\nA BIN is given free of charge when breeders create a profile on the NSW Pet Registry.\n\nThe government has introduced identification numbers to assist buyers in finding an ethical breeder.\n\nThere are exceptions to this rule – including rehoming organisations caring for a surrendered pregnant dog and farmers breeding working dogs that will remain on their land.﻿\n\nMore transparency in puppy ads﻿\n\nBreeders advertising the sale or transfer of dogs will also be required to include key identifying information.\n\nThis includes a BIN,﻿ the dog's microchip details or a rehoming organisation number if the puppy is born on or after December 1, 2025.\n\nA BIN is given free of charge when breeders create a profile on the NSW Pet Registry. (Getty)\n\nCap on breeding﻿\n\nOne of the biggest changes﻿ will be a newly-introduced cap on how many litters a female dog can birth over its lifetime.\n\nThere will be a cap of five litters per dog – or three by caesarean.\n\nNew breeders will also be required to keep 20 or less non-desexed female dogs over the age of six months on the premises. This law comes into effect a little earlier on November 21.\n\nFinally, there will also be a breeder-to-puppy ratio rule.\n\nThe law required breeders to have one staff member to every 20 dogs at a licensed premise.\n\nREAD MORE: Huge vote on Epstein files after Trump backflip\n\nBreeders advertising the sale or transfer of dogs will also be required to include key information. (Nine)\n\nTougher penalties for illegal breeding\n\nThe stricter laws come with tougher fines for breeders who don't ﻿comply.\n\nThe NSW government can impose a maximum $110,00﻿0 penalty for individuals who keep more than 20 female dogs on the premises without an exemption and $550,000 for corporations.\n\nThe same fine applies to exceeding the lifetime breeding limit for a female dog.﻿\n\nNot having a BIN could result in a $11,000 fine, while advertising a pet for sale without the necessary information can incur a $16,500 fine.﻿\n\nMeanwhile, not complying with the staff-to-dog ratio can result in a $44,000 fine for individuals or $220,000 for corporations.﻿\n\nIndividuals could also face prison time if the laws are broken.\n\n﻿Minister for Agriculture, Regional and Western NSW Tara Moriarty said the laws will \"weed out\" the bad actors in the breeding industry.\n\n\"These law changes will ensure breeders are held accountable and those in animal welfare law enforcement are given the support they need,\" Moriarty said.\n\n\"We've already banned puppy farms and prevented people convicted of animal cruelty offences from keeping and breeding animals.\n\n\"We will continue to take a strong stance on animal welfare.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/right-to-disconnect-laws-putting-more-unpaid-overtime-part-time-casual-workers/67e967e2-1274-449a-b4bc-a2dfdfccda36",
    "title": "By not checking the time, Aussie workers are losing thousands",
    "publish_date": "Wed, 19 Nov 2025 00:02:58 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Part-time and casual workers are doing more and more unpaid overtime as full-time employees make use of the right-to-disconnect workplace laws.\n\nNew research by the Centre for Future Work at The Australia Institute found the average worker was doing 3.5 hours of unpaid overtime each week, or equivalent to more than four and a half full-time weeks per year.\n\nThat averages out to about $8000 lost by each worker, or a collective $95.8 billion loss to the entire workforce.﻿\n\nREAD MORE: Trump hurls outrageous slur at female reporter\n\nPart-time and casual workers are doing more overtime since the right to disconnect laws came into force. (Getty Images/iStockphoto)\n\nThe Centre found ﻿that full-time employees averaged 3.8 hours of unpaid overtime a week, compared to 3.7 hours for part-timers.\n\n\"The situation for full time workers has stabilised. It's a good first step. I would say, for them, the right to disconnect is working,\" Centre for Future Work director Fiona Macdonald said.\n\n\"But this is the first time we have seen rates of unpaid overtime for part time workers almost as high as full time workers.\"\n\nREAD MORE: Huge vote on Epstein files after Trump backflip\n\nShe acknowledged that Australians were too accustomed to offering free overtime to expect rates to plummet instantly.\n\n\"The right to disconnect is less effective for part time workers and casuals because they are simply not given enough paid hours to do their jobs,\" Macdonald said.\n\n\"Young people who are already on the lowest incomes are bearing the brunt of this trend towards squeezing part timers.\"\n\nHighest-paying jobs in Australia that don't need a degree View Gallery\n\nWorkers aged 18 to 24 average 4.7 hours a week of unpaid overtime.﻿\n\n\"However you look at it, Australian workers are being ripped off,\" Macdonald said.\n\n\"The cost of living crisis isn't over. Now, more than ever, workers should be paid for every single hour they work.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/yarram-sawmill-closes-with-73-jobs-lost/36fc18a2-6743-4475-9fdc-e4713d672edf",
    "title": "More than 70 jobs lost in sudden closure of town's sawmill",
    "publish_date": "Wed, 19 Nov 2025 00:20:24 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "T﻿he shock closure of a sawmill in south-east Victoria has put 73 workers out of a job and left the local community devastated.\n\nStaff at the Associated Kiln Driers (AKD) sawmill at Yarram, in Gippsland, yesterday learnt the site was closing just weeks before Christmas.\n\nAKD is the country's biggest softwood producer and has a total Australian workforce of 1000 people.\n\nREAD MORE: Aussies sit on 209 million days used leave as jobs market shifts ﻿\n\nA community in Gippsland, eastern Victoria, has been left devastated at news 73 jobs will go with the closure of a local timber mill. (Photo by Angela Wylie). (The Age)\n\nBut the Gippsland sawmill has been hit hard by a slowdown in the construction sector and increased operating costs, the company's chief executive Shane Vicary said.\n\n\"To remain a sustainable and competitive Australian business, we are adapting to market conditions, simplifying our operations and strengthening the core business at our four major sawmilling sites, which continue to produce the full suite of structural softwood products,\" he said.\n\n\"Having operated in regional communities for 70 years, the significance of our departure from Yarram is not lost on us.\n\n\"We understand how important our operations have been to the fabric of this region and we are committed to working with local stakeholders in Gippsland to reduce the impact of the closure where reasonably possible.\"\n\nLocal MP Danny O'Brien said the sudden news of the closure was a devastating blow for the community, which had a jobless rate above the state average.\n\nTimber products have been made at the Yarram sawmill for 70 years, but the site will now close. (The Age)\n\n\"Seventy-three jobs lost in a town the size of Yarram is enormous,\" he told radio station TRFM.\n\n\"These are local families, local businesses and a whole community that will feel the impact of this closure immediately.\n\nIn a social media post, the Timber, Furnishing and Textiles Union said it was lobbying other timber mills to take some of the impacted workers who lost their jobs at Yarram.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/social-media-use-soars-children-drop-sports-reading-the-arts/ff7576ba-3c3c-4f18-a1b3-85755602dad0",
    "title": "Social media use soars as kids drop sports, reading, music",
    "publish_date": "Tue, 18 Nov 2025 21:51:42 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Kids are dropping sport, reading, music,﻿ and the arts as social media use soars, prompting concerns about their development.\n\nNew research from the University of South Austral﻿ia found that social media use among children and teens had risen by more than 200 per cent since before the COVID-19 pandemic.\n\nThe researchers tracked more than 14,000 South Australian students aged 11 to 14 from 2019 to 2022.\n\nREAD MORE: Optus hit with maximum fine over phone scam ﻿\n\nSocial media use has soared among adolescents. (Getty Images/iStockphoto)\n\nOver the four-year period, the number of young people who used social media daily jumped from 26 per cent to 85 per cent.\n\nThis correlated with an increase of the proportion of children who never read for fun from 11 per cent to 53 per cent.\n\nThe amount of young people who never took part in arts activities rose from 26 per cent to 70 per cent.\n\nREAD MORE: Aussies sit on 209 million days of unused leave as job market shifts ﻿\n\nFar fewer young people are reading for fun. (Getty Images/iStockphoto)\n\nThe proportion of students who never did extra-curricular music activities rose from 70 per cent to 85 per cent.\n\nAnd non-users of social media went from 31 per cent of the cohort to just 3 per cent.\n\nBoys experienced a steeper drop in reading, while girls consistently used social media more often.\n\nREAD MORE: Tropical Cyclone Fina forms off Australian coast ﻿\n\nMusic participation has also dropped. (Getty Images/iStockphoto)\n\nThe researchers said these figures had not reversed in the years since the pandemic restrictions were lifted.\n\nConversely, time spent watching TV, doing chores, and playing electronic games increased during the pandemic but returned to pre-pandemic levels by 2022.\n\n\"There's no doubt that social media has become deeply embedded in children's daily lives. But now it's at the point where it's replacing many of the activities that support healthy development – like sport, reading, and creative play,\" UniSA researcher and PhD candidate Mason Zhou said.\n\n\"Because these changes happened during a critical stage of adolescence, and because they've persisted three years after COVID restrictions ended, they may have lasting impacts on young people's health and wellbeing – and that's a real cause for concern.\"\n\nWith the looming implementation of Australia's social media ban for children under 16, the researchers said this study could show where extra support would be needed for younger teens and children.\n\nCo-researcher Professor Dot Dumuid said more programs and policies that encouraged young people to re-engage in enriching activities such as sport, music, arts, and reading were needed.\n\nSport helps boost healthy social development. (Getty)\n\nAustralia is bringing in a social media ban for under-16s. (Getty)\n\n\"If we want to support young people's wellbeing, we need to help them rebalance their time – encouraging them to reconnect with real-world activities that build skills, confidence and social connection,\" Dumuid said.\n\n\"Children who participate in sports, arts and other extra-curricular activities generally have better academic outcomes, stronger self-identity, improved social skills and better mental health.\"\n\nDumuid said the dominance of social media posed developmental risks to adolescents.\n\n\"The pending social media bans are certainly an intervention aimed at protecting children,\" she said.\n\n\"When access is restricted, children may shift to alternative platforms like gaming, messaging apps or TV. Tracking these behavioural shifts and examining their short- and long-term impacts on young people's health and wellbeing will be important as we move beyond the ban.\"\n\nThe full paper can be found here .",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/black-friday-false-advertising-how-to-spot-misleading-deals-inflated-prices-everything-you-need-know-explained/c1715836-2c96-41dc-a652-2829847e2174",
    "title": "Dodgy deals abound in the Black Friday sales - here's how to spot them",
    "publish_date": "Tue, 18 Nov 2025 18:55:49 +0000",
    "category": "finance",
    "authors": [
      "Nov"
    ],
    "text": "Australians are being warned to watch out for dodgy sales tactics and false advertising as the Black Friday sales continue.\n\nThe ACCC has already put retailers on notice for misleading or deceptive sales advertising urged consumers to watch out for shopping scams.\n\nHere a consumer law expert breaks down how to spot misleading deals and what to do if you think you've been misled by false advertising during the Black Friday sales.\n\nAussies are being warned to watch out for dodgy deals in the Black Friday sales. (Getty)\n\nAre Black Friday deals really worth it?\n\nThey can be if you shop smart, according to University of Melbourne law professor Jeannie Marie Paterson.\n\nThat means watching out for ﻿manipulative advertising tactics like countdowns and timers designed to pressure consumers into overspending.\n\n\"Retailers and marketers want people to buy more than they need,\" Paterson told 9news.com.au.\n\n\"People who run marketing campaigns have studied psychology [and] we need to realise that they know more about us than we know about ourselves, so just beware.\"\n\nHow do retailers create fake or misleading discounts?\n\nThe ACCC has warned retailers it is on high alert for misleading advertising tactics during the Black Friday sales period, including:\n\nadvertising a sale as ﻿'up to X per cent off' but the 'up to' text is not prominently displayed, or few products are on sale at the advertised rate\n\nusing misleading time representations (e.g. saying sale is for 'X days only', using a countdown timer) that don't reflect the true duration of the sale\n\nclaiming a sale is ﻿store-wide or site-wide when some products are excluded\n\nusing fine print or disclaimers to limit ﻿headline claims about a sale (e.g. members-only deals)\n\nusing misleading pricing representations that inflate the pre-sale price of a product\n\nPaterson said many of these tactics boil down to creating a misleading sense of pressure for consumers to buy and warned Aussie shoppers to avoid such deals.﻿\n\nCompanies caught breaking the rules can face investigations and fines.\n\nMichael Hill, My House and Hairhouse online paid penalties earlier this year for allegedly making false and misleading representations about their Black Friday sales in 2024.\n\nExamples of the type of advertising the ACCC's sweep will focus on. (ACCC)\n\nWhat can I do if I've been misled by false advertising?\n\nBusinesses that mislead consumers through false advertising or claims can be subject to fines and other penalties in Australia.\n\nTo protect yourself from potentially ﻿false or misleading advertising, Paterson recommends taking screenshots of online advertisements, product listings, and shopping carts.\n\nIt takes just a few seconds and can provide crucial evidence if you don't get what was promised.﻿\n\nIf you think you've been a victim of false advertising, you can ﻿ report it to the ACCC.\n\nIs it legal for stores to inflate prices before a sale?\n\nNo, but that doesn't stop it from happening.\n\nSome retailers ﻿increase the price of a product before discounting it, resulting in a sale price that seems better than it really is.\n\nThis is misleading and illegal, but it's hard for consumers to spot unless they were tracking the product's price﻿ before it went on sale.\n\nSome use ﻿online archives like The Wayback Machine to check a product's price history before buying, but it doesn't always work.\n\nIt's better to plan ahead if you want to avoid being duped.\n\n\"Go and do some research on the products you might be interested in first,\" Paterson said.\n\n\"Then when sales times comes, you can shop from an informed position that you're getting the discount you actually think you are.\"\n\nSome Aussies use ﻿online archives to check a product's price history before making Black Friday purchases. (Getty)\n\nWhat are the most common Black Friday scams to look out for?\n\nAussies have lost millions to shopping scams already this year and they're currently the most reported scam type involving financial loss in 2025, according to the ACCC.\n\nIt's warning consumers to watch out for these scams over the Black Friday sales period.﻿\n\n\"Scammers love Black Friday sales too because they know shoppers are looking for bargains and they rely on creating urgency and pressure that can come with a busy shopping period,\" ACCC Deputy Chair Catriona Lowe said.\n\n\"We remind consumers to take their time, check the legitimacy of websites and its offers, and be cautious about sharing personal or financial information online.\"\n\nShopping scams initiated through fake websites, advertisements, social media, and mobile apps have already resulted in $122 million in losses this year.\n\nPaterson said that if a Black Friday deal sounds \"too good to be true\", it probably is.\n\nShe also issued a specific warning for the ﻿'ghost store' scam, which has tricked plenty of Aussies out of their hard-earned cash in a matter of minutes.\n\n﻿\"Ghost stores are stores that often say they're closing down and selling off their stock, but in fact don't really exist,\" she explained.\n\n\"They're just a scam.\"\n\nREAD MORE: Australia Post reveals deadline for mailing Christmas parcels\n\nAre online deals better than in-store deals?\n\nIt depends on the retailer.\n\nSome retailers offer online-exclusive deals, including discounts that may be better than what they can afford to offer in bricks and mortar stores.﻿\n\n\"The overheads for retailers selling online are much lower than selling in store,\" Paterson explained.\n\n\"We also know that people are less likely to return products they buy online.\"\n\nBut she warned that digital deals may come with hidden catches.\n\nFor example, if you order a product from an overseas retailer your consumer protections will be more limited than if you buy from an Australian business.\n\n\"If you buy a product and it's faulty or it doesn't fit, you don't have a lot of return rights,\" Paterson said.\n\nCan I get a refund on a Black Friday sale item?\n\nIt depends.﻿\n\nSome retailers say that products bought in Black Friday sales can't be returned, but ﻿that doesn't override your consumer rights.\n\n﻿\"In Australia we have consumer guarantees, which means you do have a right to a refund or replacement for goods that are faulty,\" Paterson said.\n\n\"But there is no legal right for change of mind returns.\"﻿\n\nThe rules also apply to overseas retailers that sell here as Australian law applies to goods sold into Australia, but it may be harder to enforce.\n\nIf in doubt, check the fine print before making purchases in the Black Friday sales.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/cristiano-ronaldo-attends-white-house-dinner-with-trump/106026916",
    "title": "Ronaldo attends White House dinner with Trump and Saudi crown prince",
    "publish_date": "Wed, 19 Nov 2025 01:49:44 +0000",
    "category": "sports",
    "authors": [],
    "text": "Soccer superstar Cristiano Ronaldo has had dinner with US President Donald Trump and Saudi Arabia's Crown Prince Mohammed bin Salman at the White House.\n\nMr Trump opened his remarks by thanking some of the guests, including Ronaldo.\n\nThe president said he introduced his youngest son, Barron, to the soccer player, adding that his son was impressed with the meeting.\n\nIt was unclear why the footballer was in attendance, but the Portuguese striker has been the face of the Saudi football league since 2022.\n\nDonald Trump delivered a speech at the dinner alongside Saudi Crown Prince Mohammed bin Salman. (Reuters: Tom Brenner)\n\nAt the black-tie dinner in the White House East Room, Mr Trump welcomed Nvidia chief executive Jensen Huang, tech entrepreneur Elon Musk and other high-profile guests.\n\nFIFA President Gianni Infantino was also in attendance. He has been a regular at the White House this year, ahead of next year's FIFA World Cup.\n\nDuring dinner, Mr Trump announced he was designating Saudi Arabia as a major non-NATO ally as the administration aims to elevate the two nations' military relationship.\n\nThe designation, while largely symbolic, provides foreign partners with certain benefits in the areas of defence, trade and security cooperation.\n\nRonaldo sees Saudi crown prince as 'boss'\n\nRonaldo joined football club Al-Nassr at the end of 2022 on a reported $US536.3 million ($865 million) contract.\n\nHe has since signed a two-year extension over the summer for a reported $US710 million, which will keep him with Al-Nassr until at least the 2026-27 season.\n\nAl Nassr signed Cristiano Ronaldo in 2022. (Reuters: Ahmed Yosri)\n\nAl-Nassr is majority-owned by the Saudi sovereign wealth fund that the crown prince chairs, and Ronaldo has been the figurehead leading Saudi Arabia's recent investment in its soccer league.\n\nSaudi Arabia teams have invested over $US3 billion into signing some of the best players in the world.\n\nIn an interview with Piers Morgan, Ronaldo referred to Prince Mohammed as \"our boss\".\n\nEarlier this month, he appeared at a Ministry of Tourism event in Riyadh where he talked up the kingdom's development projects and his hopes for the 2034 FIFA World Cup being held in Saudi Arabia.\n\nRonaldo's US troubles\n\nIt was a rare US visit for Ronaldo, who has not played in the country since 2014. It is believed he has not visited the country since that time either.\n\nIn 2017, German news magazine Der Spiegel reported that Ronaldo had paid $US375,000 in hush money to a woman who accused him of raping her at a Las Vegas hotel in 2009.\n\nHe denied the claims made by Kathryn Mayorga, saying in a statement made in 2018: \"Rape is an abominable crime that goes against everything that I am and believe in.\"\n\nIn 2019, US prosecutors said Ronaldo would not face charges because the claims could not be proven.\n\nABC/Wires",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/sa-minister-calls-for-urgent-national-inquiry-into-asbestos-sand/106026188",
    "title": "SA education minister calls for urgent national inquiry as asbestos sand sites climb to more than 450",
    "publish_date": "Wed, 19 Nov 2025 01:38:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "South Australia's education chief has called for a national inquiry into how coloured play sand contaminated with asbestos was imported into the country.\n\nThe number of sites that have reported stocking the product has climbed to more than 450 in South Australia, according to an updated post on the SA Education Department's website.\n\n\"I want to know how this stuff got through our borders, how it ended up on the shelves of major retailers like Kmart and Target and then ended up in schools, preschools and thousands of households,\" Education Minister Blair Boyer said on Wednesday.\n\nSouth Australian Minister for Education said the inquiry would examine what checks occur with products like coloured play sand. (ABC News: Lincoln Rothall)\n\nMr Boyer said he had written to the federal government asking for an inquiry and hoped other jurisdictions would join him in the request.\n\n\"What are the checks that occur with products like this?\" Mr Boyer said.\n\n\"Especially now that we know in cases of a product that was made and marketed towards kids, what checks occur with a product like that?\"\n\nMr Boyer said the inquiry could lead to ensuring an incident like this would not happen again.\n\n\"Aside from all the concern that it's caused families, there is a real cost here, that we are wearing to do the clean-up,\" Mr Boyer said.\n\n\"That's money that we won't be able to spend on other things in the education system.\"\n\nMr Boyer said the department was expanding the number of contractors in the next couple of days who could facilitate deep cleans at education sites.\n\n\"It means we can speed through that process,\" he said.\n\nLast week, the ACCC issued a national recall notice for various coloured sand products after testing detected traces of asbestos.\n\nThat list expanded on Sunday, when further products made in China were identified.\n\nAccording to the department, the sand has either been secured at a majority of the locations or has been confined to isolated areas.\n\nOn Monday, Catholic Education in South Australia said it had temporarily closed two schools to allow for deep cleaning.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/sa-adelaide-university-co-vice-chancellors-on-uni-merger/106022624",
    "title": "Nothing like Adelaide uni merger 'has been attempted in Australia before'",
    "publish_date": "Wed, 19 Nov 2025 01:32:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "When a senate inquiry into university governance kicked off in Adelaide in November, the room was so icy cold it forced South Australian Greens Senator Barbara Pocock to ask a question many had been thinking.\n\n\"Is there anyone that can warm this room up, I'm freezing\" Senator Pocock said.\n\nThere were murmurs of agreement among the small gathering.\n\nBut when Senator Pocock later began asking pointed questions about the cost of a contract for Deloitte to support the universities merging to become the new Adelaide University, the temperature in the room turned up.\n\n\"So that particular contract around Deloitte, what was the value of it?\" Senator Pocock asked.\n\nAdelaide University co-vice chancellor Professor David Lloyd questioned in response: \"So this is what I have to ask … does the committee want me to release that publicly?\"\n\nHe had earlier explained to the senators, the contract with Deloitte was commercial in confidence and the clause was the reason the university had not released the original business case for the merger in full.\n\n\"That's why I'm asking if I'm being required to release it now and that's why I'll take that on notice,\" he told the inquiry.\n\nProfessor David Lloyd says \"complicated would be an understatement\" when describing the university merger. (ABC News)\n\nAdelaide University has been given until November 24 to provide a formal response and the co-vice chancellors have indicated they may release the detail.\n\n\"We're reflecting on that and we might well do that,\" Professor Peter Høj has told ABC News.\n\n\"We've just got to make sure that we're able to do that responsibly.\"\n\nDeloitte has been assisting with the task of amalgamating the University of Adelaide and the University of South Australia, with the merged institution aiming to house a 70,000-strong student cohort and 11,000 staff.\n\nIts projected operation turnover is estimated at about $2.2 billion.\n\n\"Nothing like this has been attempted in Australia before … to say it's complicated would be an understatement,\" Professor David Lloyd said.\n\nHe explained Deloitte is working on systems integration — including IT development and data transfer — and operates across mergers and acquisitions, project management and staff training.\n\n\"When we undertook to create the new university, we were very cognisant to the fact that we had to run two universities while building a new university,\" Professor Lloyd said.\n\n\"And we had to create the capability and resources to create that new institution without necessarily disrupting the activities of the two.\"\n\nAdelaide University co-vice-chancellor Peter Høj in a sit-down interview with ABC News Stateline. (ABC News)\n\nProfessor Høj added \"the complexity of taking two large universities with its myriad of systems and records … is not something I think any organisation in Australia would be able to do on their own and on the time frame required\".\n\n\"We believe it's absolutely appropriate to get considerable help in and spend money when it's needed and not spend money when it's not needed,\" he said.\n\nConfusion among students\n\nWhile there is great interest in the money being spent, for many of the 56,000 continuing students, their sights are set elsewhere.\n\nNaomi Wright, who has been studying journalism at UniSA, said she chose the degree due to its quick pathway through a Masters of Communications.\n\n\"I've come in specifically because my masters was going to be one year instead of two, but now looking at the new website the course actually just doesn't exist,\" she said.\n\n\"So I don't know if that means I'm the last group doing it or if I genuinely just won't do it anymore.\"\n\nNaomi Wright says she has yet to receive her course outline for Masters of Communications. (ABC News)\n\nShe said she has received some emails and a chance to join an online discussion forum, but she said there has still been confusion.\n\n\"When I've been talking to tutors and people at uni asking them if we're going to be at the same campus next year or if we're doing the same subjects, they just don't know and everyone's just not on the same page,\" she said.\n\nMs Wright said part of the problem has been not receiving her course outline, which is known as a study plan.\n\n\"I'm sure everything will work out, but right now, not only me, but I know a lot of people will just have no idea what's going on and what to expect next year,\" she said.\n\nThe Adelaide University is set to be one of the largest educators of tertiary students in Australia. (ABC News)\n\nProfessor Høj said the delay has been due to Adelaide University creating a new curriculum.\n\n\"That means that we have to be extra careful to advise the students appropriately,\" he said.\n\n\"So it's really that complication that has meant that we had to pressure test the study plans.\"\n\nProfessor Lloyd added that the university did not want to provide \"information that wasn't accurate\".\n\nDate Total study plans released to continuing students October 31 23,000 November 7 37,000 November 14 40,000\n\nThe co-vice chancellors said all study plans will be released before December 1, when enrolment opens.\n\nBut it is delays like this that have some students like Ms Wright wondering if the universities needed more time to come together.\n\n\"A lot of people have said it kind of just feels like we've been bombarded,\" she said.\n\n\"You're starting a new degree, but now it's just all going to change rather than maybe doing it over five or even more years and just slowly bringing it each time.\"\n\nAdelaide University students have been getting new study plans. (ABC News: Marco Catalano)\n\nDespite it being two years since the South Australian parliament passed legislation that green lit the merger, both co-vice chancellors are resolute setting a January 1, 2026, deadline is the best course of action.\n\n\"I guess there's a public phase and there's and there's a there's a not so public phase,\" Professor Lloyd said.\n\n\"Peter and I started talking about this in August of 2021.\n\n\"So we've been at this now for over four years in terms of trying to give it the right thought, the right direction, the right incubation.\n\n\"We probably could have spent the more time, but whether we would have got a return on that time investment, I guess it's questionable.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/fears-for-science-as-csiro-chief-defends-job-cuts/106026314",
    "title": "'The cost of science has gone up': CSIRO chief defends job cuts",
    "publish_date": "Wed, 19 Nov 2025 01:10:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "The chief executive of the CSIRO has defended the decision to cut hundreds of jobs, arguing the organisation needs to alter its priorities to remain relevant.\n\nYesterday, Australia's peak science agency said it had reached a \"critical inflection point\" and would need to cut up to 350 jobs.\n\nThose jobs are in addition to more than 800 positions that have already been slashed from the organisation in the past 18 months.\n\nFederal Science Minister Tim Ayres said the cuts were aimed at refocusing the efforts of the CSIRO towards research priorities, such as critical minerals, iron and steel production in Australia.\n\nToday, the CSIRO's chief executive said the cuts were being influenced by two main factors.\n\nCost of living pressure extends to science\n\n\"The first is we're looking at our science portfolio as we always should and asking how we can focus it in the areas where CSIRO can make the biggest impact for the country,\" CSIRO CEO Doug Hilton said.\n\n\" Then the second thing is we're facing a really profound sustainability challenge that's been accumulating probably over 40 years. \"\n\nDr Hilton also defended the government's funding of the organisation, saying its budget had not been cut, but that the cost of conducting research had increased significantly.\n\n\"What's happened over 15 years is the value of the appropriation that we get, the money we get from the government in the budget each year, has gone up by about 1.3 per cent,\" he said.\n\n\"The cost of living has gone up by about 2.7 per cent on average each year. And the cost of science has gone up much, much more than that.\"\n\nCSIRO chief executive Doug Hilton says the cost of science has risen along with the cost of living. (Supplied: WEHI)\n\nDr Hilton said the CSIRO had not yet told staff which areas of research would be targeted by the cuts, but they would be informed \"over the next three days in a respectful way\".\n\n\"We take these decisions very seriously and my heart goes out to the staff, not just the ones that are impacted but the broader CSIRO community,\" he said.\n\n\"We work in a lot of different research areas and I think it is appropriate for us every year to look at those areas where we believe we can generate the most impact.\n\n\"And the type of science Australia needs has changed over 50 years. If you think about 10 years ago, no one was talking about AI. Now, we use AI in almost every research area.\n\n\"So the skills of our staff, the mix of our staff, the diversity of disciplines that we bring to bear on big problems needs to evolve.\"\n\nThe organisation employs more than 5,800 people in sites across the country. (ABC News: Callum Flinn)\n\nHe also defended the decision to announce the redundancies in the lead-up to Christmas.\n\n\"In order for us to be able to meet our budget in the 2026-27 year we needed to start that process now and I acknowledge that it is a difficult time to start engaging with staff about those things,\" he said.\n\n\"The timing has been driven by a desire to look at our whole research portfolio. We had 300 of our most senior scientists come together in Melbourne in September and we wanted to take the time to consider their input.\"\n\n'It's terrifying'\n\nScience and Technology Australia chief executive Ryan Winn today attributed the job cuts to inflation, saying the problem was affecting the entire sector.\n\n\"I wouldn't put the blame at Doug's feet,\" he told ABC Radio Canberra.\n\n\"This is government not keeping pace with the investment in science as the cost of everything goes up.\n\n\"We're talking 350 jobs. It's great ideas, it's innovations, it's our future.\n\n\"This is a problem that's been growing for everyone.\"\n\nMr Winn said he had been receiving messages from people since yesterday's announcement, anxious about its wider impact.\n\n\"I've had messages from science teachers saying 'How do I convince my kids in my classes to do science now when this is the message government and our sector is sending?'\" he said.\n\n\" It's terrifying. We know that we need more engineers, more scientists, more AI experts ... How do we convince them that there's real jobs here if all they're hearing is about job cuts? \"\n\nMr Winn pointed to research the CSIRO had done that had led the way in science.\n\n\"We have ultra-low gluten-free barley that came out of CSIRO,\" he said.\n\n\"These are amazing ideas that no one else has developed and it's CSIRO that has led these things, so yes, we can do a lot to prioritise and look at how CSIRO can partner with other organisations ... but CSIRO can't do it alone and also universities can't do it alone.\n\n\"We've got a great research sector, we just need to back them.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/socceroos-vs-colombia-new-york-live-blog/106026972",
    "title": "Live: Socceroos make solid start against world number 13 Colombia",
    "publish_date": "Wed, 19 Nov 2025 00:51:47 +0000",
    "category": "sports",
    "authors": [
      "Luke Pentony",
      "Henry Hanson"
    ],
    "text": "Colombia is yet to find any real rhythm in New York.\n\nThe South Americans are keeping possession well around half-way, but are struggling to find a way forward.\n\nJames Rodriguez is dropping quite deep to receive the ball, but we haven't seen any magic from him just yet.\n\nI also wonder how bobbly and difficult to navigate this playing surface is.\n\nIt looks pretty uneven out there - especially towards Colombia's right corner flag, where we can see the remnants of a baseball diamond.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/three-mile-island-nuclear-power-plant-constellation-energy/106026820",
    "title": "From meltdown to restart, US nuclear power plant gets a second life",
    "publish_date": "Wed, 19 Nov 2025 00:46:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Three Mile Island, once the site of America's worst nuclear power accident, is set to start producing electricity again after the US Department of Energy agreed to a $US1 billion ($1.5 billion) loan.\n\nThe nuclear power plant, on an island in the Susquehanna River just outside Harrisburg, Pennsylvania, is under contract to supply power to data centres for tech giant Microsoft.\n\nIt was the site of the nation's worst commercial nuclear power accident in 1979.\n\nGoogle, Microsoft to reopen nuclear plants to power AI Google has announced a nuclear facility shuttered in 2020 will return to service in 2029 to help power its \"growing cloud and AI infrastructure in Iowa\", a year after Microsoft signed on to reopen Three Mile Island.\n\nThe loan is in line with the priorities of US President Donald Trump's administration, including bolstering nuclear power and artificial intelligence.\n\nFor Constellation Energy, which owns Three Mile Island's lone functioning nuclear power reactor, the federal loan will lower its financing cost to get the mothballed plant up and running again.\n\nThe 835-megawatt reactor can power the equivalent of approximately 800,000 homes, the US Department of Energy says.\n\nThe reactor had been out of operation for five years when Constellation Energy announced last year that it would spend $US1.6 billion ($2.4bn) to restart it under a 20-year agreement with Microsoft to buy the power for its data centres.\n\nConstellation Energy renamed the functioning unit the Crane Clean Energy Center as it works to restore equipment including the turbine, generator, main power transformer and cooling and control systems.\n\nJapan's nuclear gamble Why a country stricken by one of the worst nuclear disasters of all time is ready for more reactors.\n\nThe company hopes to bring the plant back online in 2027.\n\nThe loan is being issued under an existing $US250 billion ($383 billion) energy infrastructure program initially authorised by the US Congress in 2022.\n\nNeither the department nor Constellation has released the terms of the loan.\n\nAccident in 1979\n\nThe plant was the site of the nation's worst commercial nuclear power accident in 1979.\n\nThe accident destroyed one reactor, Unit 2, and left the plant with one functioning reactor, Unit 1.\n\nIn 2019, Constellation Energy's then-parent company Exelon shut down the functioning reactor, saying it was losing money and Pennsylvania lawmakers had refused to subsidise it to keep it running.\n\nThe plan to restart the reactor comes amid a renaissance for nuclear power, as policymakers are increasingly looking to it to shore up the nation's power supply to meet rising power demand driven by data centres, particularly with the growth of AI.\n\nAP",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/abs-wage-price-index-figures-released-september-quarter/106026360",
    "title": "Wage growth remains steady, just ahead of inflation",
    "publish_date": "Wed, 19 Nov 2025 00:35:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian Bureau of Statistics (ABS) figures show workers received an average base pay increase of 3.4 per cent over the year to September, in line with the previous quarter and economist forecasts.\n\nThat pay rise has again slightly outpaced consumer price inflation, which rose to 3.2 per cent over the same period. It means the average worker saw a small increase in their purchasing power.\n\nInflation surges to 3.2pc in September quarter Inflation data has came in much hotter than economists were expecting with annual inflation surging to 3.2 per cent in the September quarter, up from 2.1pc in June.\n\nHowever, the annual pay increase was slightly down on the same period a year earlier, when workers saw their base pay packets rise 3.5 per cent on average.\n\nJP Morgan economist Tom Kennedy said workers could expect to see their real wages — adjusted for inflation — fall again next year.\n\n\"The recent upturn in inflation means that real wage growth has also turned lower, running at just +0.2 per cent and likely to turn negative in the coming quarters as headline inflation approaches 3.5 per cent,\" he said.\n\nWorkers in the public sector, especially state government employees, earned more than those in the private sector. (Unsplash: Glenn Carstens-Peters)\n\nThis tallies with recent Reserve Bank forecasts in its Statement on Monetary Policy, which also tipped inflation to outpace pay rises for much of 2026.\n\nThis year's pay rise was also stronger for workers in the public sector (3.8 per cent) compared to the private sector (3.2 per cent).\n\nThe head of prices statistics at the ABS, Michelle Marquardt, said those mostly went to state, not federal or local, government employees.\n\n\"State government pay rises contributed 82 per cent of public sector wage growth this quarter,\" Ms Marquardt said.\n\nAbhijit Surya, from Capital Economics, said the relative weakness of private sector pay rises, which were propped up by an increase in minimum and award wages, should comfort the Reserve Bank that wage rises are not a major contributor to inflation pressures.\n\n\"Encouragingly, though, wage growth for workers on individual arrangements, which tends to be more sensitive to cyclical conditions, did ease slightly, from 3.1 per cent to 3 per cent,\" he noted.\n\n\"Looking further ahead, our composite labour market continues to suggest that wage growth will fall to around 3 per cent in the coming quarters, as the [Reserve] Bank is expecting.\n\n\"With productivity growth in the midst of a cyclical rebound, unit labour cost growth should ease in tandem, helping to tame services inflation.\"\n\nWage growth peaked at 4.2 per cent in the December quarter of 2023, after remaining stuck below 2.5 per cent from the start of 2015 to early 2022.\n\nThe Wage Price Index (WPI) measures base pay, and does not include additional payments like overtime and bonuses.\n\nThe ABS published a second set of monthly numbers today, estimating the total wages and salaries paid by employers to their staff in September.\n\nPayments totalled $108.8 billion, driven higher by bonuses in the mining, utilities, retail, media and financial services sectors, which are often paid in September, in response to financial year targets.\n\nHowever, the 5.3 per cent annual growth in total wages and salaries paid to employees was down from the 6.1 per cent rise recorded over the year to September 2024.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-11-19/sugar-beet-trialled-for-sustainable-aviation-fuel/106022432",
    "title": "New crop could be Australia's sustainable aviation fuel sweet spot",
    "publish_date": "Wed, 19 Nov 2025 00:30:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "It has not been grown here for almost a century, but as the need for sustainable aviation fuels intensifies, sugar beet could be making an Australian comeback.\n\nBiofuel company Sky Renewables has partnered with eight central Queensland farmers to trial growing the crop as a feedstock for renewable energy.\n\nTraditionally grown in Europe, Russia and the United States to produce sugar, beets were first grown in Victoria's Gippsland region in the late 1800s, but the industry collapsed after World War II.\n\nSugar beet is grown in places like Russia, Europe and the United States. ( Flickr: Sugar Beets/arbyreed/CC BY-NC sa 2.0)\n\nAlready working with the industry that came to replace it — sugar cane — the company's chief executive Simon Yim hopes beets will prove superior when it comes to fuel.\n\nAs the Queensland government holds its own hearings into sugar's bioenergy opportunity, the industry is hopeful the COP30 climate talks in Brazil will set clear targets to incentivise further investment.\n\nWaste game\n\nIn the Burdekin region near Townsville in north Queensland, Mr Yim works with canegrowers to produce biomethane, a renewable natural gas.\n\n\"We are trying to persuade the growers to abandon burning the cane field before harvesting so that we can take the tops and trash and use it as a feedstock,\" he said.\n\nSimon Yim is the founder and CEO of biofuel company Sky Renewables. (ABC Capricornia: Claudia Sullivan)\n\nBut 600 kilometres to the south, around Emerald, where cotton and grains are the staple crops, eight growers have signed up to work with the company over the next two years.\n\nMr Yim said the beets would be trialled as a winter rotational crop, extracting the sugar juice to ethanol, an ingredient in biofuel.\n\n\"This is probably the best, simplest and lowest carbon intensity feedstock to make bioethanol,\" Mr Yim said.\n\nHe said the lack of infrastructure made beets unviable as a sugar crop when compared to the established cane industry, but as a water-efficient feedstock for the fledgling biofuel industry, it stacked up.\n\n\"Right now, what was considered waste just a few years ago [has] become valuable,\" he said.\n\n\" Using waste to make bioenergy is the name of the game. \"\n\nShahana McKenzie, the chief executive of industry representative body Bioenergy Australia, said there were positive signs that value was being recognised globally.\n\nShahana McKenzie says regional and rural Australia are in a unique position to capitalise on the interest in biofuels. (Supplied: Bioenergy Australia)\n\n\"There has been a very strong focus on decarbonisation of the electricity sector globally,\" she said.\n\n\"It's really good to see that now there is this focus moving towards low-carbon liquid fuels and renewable gases.\"\n\nTwo years ago, global leaders agreed to transition away from oil, gas and coal at the COP28 climate talks in Dubai, but the deal was criticised for failing to set actionable targets.\n\nQantas has committed to 10 per cent sustainable aviation fuel from 2030. (ABC News: Keana Naughton)\n\nMs McKenzie said the most recent climate talks in Brazil had the opportunity to drive global market development by addressing the shortage of sustainable aviation fuel (SAF).\n\n\"It sets a global ambition,\" she said.\n\n\"It sends a signal out globally across the countries to say this is now an area of focus.\"\n\nSustainable momentum\n\nIn September, the Australian government announced a $1.1 billion program to promote biofuel manufacturing and development, in a bid to provide decarbonised fuel options to hard-to-abate sectors like aviation.\n\nMr Yim said international interest in SAF production had accelerated since Europe set a minimum supply mandate, which requires fuel at EU airports to contain a minimum of 2 per cent SAF in 2025, increasing to 70 per cent by 2050.\n\n\"SAF is a global need,\" he said.\n\n\"For example, Qantas has committed to 10 per cent SAF in their tanks starting in 2030.\"\n\nMs McKenzie said regional and rural Australia was in a unique position to capitalise on the interest.\n\n\"What we have seen over the past 12 months is absolutely a strong focus from businesses out of the US as well as Europe looking at Australia and saying, hang on, there's a lot of feedstock there,\" she said.\n\n\"With that feedstock in the regions, we can be providing economic returns into regional Australia.\n\n\"If we're talking about the low-carbon fuels and renewable gas projects, we're talking about thousands of jobs, we're talking an additional 10 billion GDP.\"\n\nAustralia's sugar industry has been pushing to expand into biofuel for years. (ABC News: Brad Marsellos)\n\nIn Queensland, that opportunity is being explored through an inquiry into sugarcane bioenergy opportunities.\n\nHearings resume in Brisbane on November 19. Among those providing submissions is the peak industry body for the sugarcane milling sector, Australian Sugar Manufacturers.\n\n\"The sugar industry can supply over 30 per cent of Australia's domestic aviation fuel needs,\" chief executive Ash Salardini said.\n\n\"Sugar-derived biofuels [can] provide affordable biogas to regional manufacturers and replace coal to make steel production green with renewable pellets made from sugar by-products.\n\n\"This agenda will create thousands of new jobs in places like Bundaberg, Mackay, Townsville and Cairns, and will attract more manufacturing businesses to regional Queensland through access to affordable energy and secure the long-term viability of the sugar industry that already supports 20,000 jobs.\"\n\nThe committee intends to table an interim report on December 15, 2025, with a final report due on June 12, 2026.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/gympie-mens-shed-in-desperate-search-for-new-home/106009024",
    "title": "Queensland men's shed still without a home after being evicted",
    "publish_date": "Wed, 19 Nov 2025 00:01:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "It might be a little rough on the outside, but this rundown tin shed has been a home for the silver-haired blokes of Gympie for more than a decade.\n\nAfter 12 years in the heart of town, the Gympie Men's Shed needs to find new premises, and it is proving a difficult task.\n\nThe members were notified in June that their tenancy at the Old Gympie Railway Station would not be renewed, but, after months of searching, they are about to be \"men without a shed\".\n\nThe group says it has struggled to find a suitable industrial site with property scarce in the region. (ABC Sunshine Coast: Jake Kearnan)\n\nShed secretary Jack Menhenik said safety concerns were cited in the eviction notice.\n\n\"Queensland Rail has been really good to us over the last 12 years in this vicinity, which has got three sheds, a communal block, a toilet and kitchen facilities,\" Mr Menhenik said.\n\n\" They're a bit concerned about the safety of the building. There's asbestos … I'm sure there is asbestos in every government building, the roof is leaking, and [there are] a few other things. \"\n\nThe shed is downsizing its operation into storage as the search for another space continues.\n\n\"We're doing a lot of dump runs, we've had this garage sale going on for four weeks, and we've been trying for months to find a new space,\" Mr Menhenik said.\n\n\"Real estate in the area is scarce.\"\n\nThe men's shed will meet once a month after its members vacate the premises as they search for a new site. (ABC Sunshine Coast: Jake Kearnan)\n\nAccording to the Real Estate Institute of Queensland (REIQ), Gympie's rental vacancy rate currently sits at 1.2 per cent, 0.2 per cent higher than the state average but in line with the national rate of 1.2 per cent.\n\nMeanwhile, the median house price has more than doubled from $322,000 to $750,000 in the past five years.\n\nIt has made finding a new home difficult.\n\nPresident of the Gympie Men's Shed Markcus Jaques said the members had been working tirelessly to clear out the site.\n\n\"A lot of us have been going home, getting in our lounge chairs, falling asleep and not waking up until the next morning,\" Mr Jaques said.\n\n\"Most of us are over 65, and it's a lot to ask.\n\n\"Some of the blokes reckon I've been getting the whip out.\n\n\"Since we've closed, my phone hasn't stopped ringing from partners and wives saying, 'What am I going to do with my husband now?'\n\nA closing down sale is being held at the old site on Tozer Street. (ABC Sunshine Coast: Jake Kearnan)\n\nUncertain future\n\nMen's sheds across the country have long played an important role in creating a community environment and a sense of belonging for men of all ages.\n\nMr Menhenik said membership numbers had dwindled since the news.\n\n\"We had 70 members; at the moment we've only got about 35 on the books,\" he said.\n\n\"A few of the guys haven't renewed, citing that we don't have a home.\n\n\"We meet three times a week from around 8am to midday, and there's three or four members that only turn up for the coffee break — it gets them out of the house.\"\n\nJack Menhenik said the group had concerns about the welfare of its members if they are unable to meet regularly. (ABC Sunshine Coast: Jake Kearnan)\n\nThere were fears the group would lose the money it had raised over the years.\n\n\"We're a not-for-profit organisation … if we did fold, we would lose that money,\" Mr Menhenik said.\n\n\"That would go to the Australian Men's Shed Association, which is what the constitution says, and there is nothing wrong with that, but … these guys have done sausage sizzles and sold a heap of equipment to make money for the Gympie Men's Shed.\"\n\nWhile the search for a new home has been unfruitful thus far, the club is hopeful someone will come to the table with a suitable site.\n\nThe group has been working tirelessly to move all its equipment into storage. (ABC Sunshine Coast: Jake Kearnan)\n\nEnd of an era\n\nThe club was given a three-month grace period to vacate the premises following the expiry of its lease in June.\n\nQueensland Rail's head of SEQ, Neil Backer, said it was unable to continue the token lease due to site defects.\n\n\"Queensland Rail has been working with the Gympie Men's Shed for several months, and all attempts have been made to find them a new location,\" Mr Backer said.\n\n\"Unfortunately, this has not been possible.\"\n\nQueensland Rail will continue to provide the men's group with a shed for storage on site for up to two years while they source a new home.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/fifa-world-cup-scotland-beat-denmark-scott-mctominay/106026514",
    "title": "Scotland ends 28-year World Cup absence after breathtaking bicycle kick goal",
    "publish_date": "Tue, 18 Nov 2025 23:55:41 +0000",
    "category": "sports",
    "authors": [],
    "text": "A superb bicycle kick goal from Scott McTominay has helped Scotland reach the World Cup finals for the first time since 1998.\n\nThe Scots qualified for next year's finals in North America and Mexico with a 4-2 victory over Denmark in front of a boisterous home crowd at Glasgow's Hampden Park.\n\nDenmark, who only needed to avoid defeat to secure its third successive World Cup finals appearance, was stunned in the third minute when McTominay scored a magical goal for the ages.\n\nAppearing to defy gravity, McTominay soared high into the air to meet a Ben Gannon-Doak cross with an overhead kick that gave Denmark goalkeeper Kasper Schmeichel no chance.\n\nMcTominay's goal lit up social media, with Scottish sporting great Andy Murray among those astonished by his effort.\n\n\"What on earth was that,\" Murray wrote on X.\n\n\"McTominay you wee dancer!\"\n\nScotland went on to clinch its World Cup finals berth after stoppage-time goals from Kieran Tierney and Kenny McLean.\n\nWhen Patrick Dorgu equalised at 2-2 in the 81st minute, it seemed 10-man Denmark would secure the point it needed to top Group C and book its place in next year's finals.\n\nBut after a rollercoaster qualifying campaign for the Scots, the biggest twist of the evening was saved for the end.\n\nThe ball came out to Tierney in the third minute of stoppage time, before he looked up and curled a superb left-footed shot past a diving Schmeichel.\n\nThe drama was not over, though.\n\nSchmeichel was found way out of his goal when McLean launched a shot from the halfway line into the empty net.\n\nLyndon Dykes celebrates Scotland's triumph at Hampden Park. (Getty Images/UEFA: Alex Livesey)\n\n\"That just sums up this squad. Never say die,\" Scotland captain Andy Robertson said.\n\n\"We just keep going right to the end and one of the craziest games.\n\n\"We put the country through it, but I'm sure it's worth it. We're going to the World Cup.\"\n\nEarlier, Denmark levelled in the 57th minute after McTominay's stunning goal.\n\nA Robertson foul on Gustav Isaksen was adjudged to have been just inside the penalty area and Rasmus Højlund made no mistake from the spot.\n\nMinutes later, Rasmus Kristensen was shown a second yellow card and when Lawrence Shankland touched in a corner to put Scotland ahead, it looked like that would be enough.\n\nSpain through to World Cup finals\n\nSpain booked its spot at the World Cup finals after a nervy 2-2 draw with Turkey in Seville, finishing unbeaten at the top of Group E.\n\nSwitzerland also qualified, despite being held 1-1 by Kosovo, while Belgium hammered Liechtenstein 7-0 to confirm its finals berth.\n\nAustria's Marcel Sabitzer celebrates qualifying for the World Cup finals. (Reuters: Lisa Leutner)\n\nAustria advanced to its first World Cup finals appearance since 1998.\n\nThe Austrians snatched a 77th-minute equaliser against Bosnia and Herzegovina to earn a 1-1 draw.\n\nReuters/AP",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/tonga-election-king-democracy-noble-votes/106022830",
    "title": "After 15 years of democracy, is Tonga turning back to its king?",
    "publish_date": "Tue, 18 Nov 2025 23:39:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "On Thursday, the people of the Kingdom of Tonga will head to the ballot box for only the fifth general election in its history.\n\nAs the only remaining sovereign monarchy in the Pacific, the Kingdom, as it is known colloquially, is still young democratically, with most of the country's parliament being elected by the people for the first time in 2010.\n\nYet, in spite of the recent — and long heralded — milestones of political evolution, there is concern among some that Tonga is, already, slipping back into an autocracy.\n\n\"What we are witnessing is a reversal of democratic changes that happened in 2010,\" said Lopeti Senituli, a political commentator and former advisor to two prime ministers.\n\n\"What we agreed to in 2010 was a power-sharing arrangement between the king and a democratically elected prime minister and cabinet … that was what we agreed to.\"\n\nLopeti Senituli is concerned by some of the political manouvres being made in Tonga. (ABC News)\n\nThursday's general election occurs less than a year after the former prime minister Siaosi Sovaleni resigned in parliament, just minutes after a motion for a vote of no-confidence was passed against him.\n\nThe public reasons given for the motion were alleged corruption and mismanagement, but there was widespread speculation the motion was the result of a power struggle between the prime minister and King Tupou VI.\n\nJust weeks prior to Sovaleni's resignation, a dispute between the PM and king became public when a letter from Tonga's Royal Palace was leaked, revealing the king's disapproval of Sovaleni's foreign minister at the time, Fekita 'Utoikamanu.\n\nThe letter was later publicly rebuked by Sovaleni. Soon after, Sovaleni was replaced by the now Prime Minister 'Aisake Eke, and parliament passed legislation handing full control of Tonga's foreign affairs to the monarchy, renaming it \"His Majesty's Diplomatic Service\".\n\nMr Senituli said the move was an example of changes being made \"without consulting the public\".\n\nMr Sovaleni himself is on the ballot paper and widely predicted to win his constituency, with the prospect of being re-elected as prime minister a possibility.\n\nMr Senituli believes Mr Sovaleni has a good chance of returning to the top job, while others say the breakdown in relationship with the king leaves him with no chance.\n\nSome, such as Tongan noble representative Lord Tu'ilakepa, go further.\n\nHe believes the prime minister position should be decided by the king, effectively reversing the democratic reforms of 2010.\n\nLord Tu'ilakepa has advocated for more radical changes to Tonga's politics. (ABC News)\n\n\"Let the king choose the prime minister from the 26 MPs,\" he told the ABC.\n\n\"If that happens, all these quarrels will stop.\n\n\"Right now, you have individuals lobbying and calling around trying to secure the PM position.\n\n\"What's crucial is for the people's representatives to stand united — but realistically, they never will. They have different political ideologies.\"\n\nTonga's tough democratic experience\n\nTonga's 15 years as a democracy has been arduous.\n\nIn that short period, four out of five prime ministers have faced a vote of no confidence, 10 MPs have been convicted for corruption and bribery, and at one point, the country's parliament was dissolved for nearly four months.\n\nDespite being recognised as a democracy, Tonga's political system still faces international and domestic criticism for allocating more than a third of parliament seats to \"noble representatives\" — MPs elected by a pool of just 33 hereditary chiefs and a handful of life peers.\n\nElections in the country have been peaceful and results have been undisputed, but frictions between cabinet and the monarchy and nobles have been ongoing.\n\nThere's a mixed reaction about the balance of powers within Tonga's political system, a system largely based on the United Kingdom's Westminster system — one which recognises the monarch as the head of state but a government directed by a democratically elected parliament.\n\n\"At the moment the parliament is unable to check itself, so the king has to get involved in the political process,\" said Tevita Motulalo, a long-time journalist and political commentator.\n\n\"I would prefer to have two chamber system with lower and upper house, because there are greater checks in place.\n\n\"The nobles are representatives of their territories and ha'a [tribe] … it's similar to that of a senator who comes in as representative of a state/province.\"\n\nTongans want better infrastructure and social support\n\nOn the streets of the capital Nuku'alofa, the tension between the palace and the politicians is not front of mind.\n\nAs they head to the ballot box, it's the economy, basic infrastructure, healthcare and crime.\n\n\"The biggest challenge that I'm seeing in my neighbourhood are the poor state of the roads … they're damaged and full of potholes,\" said one woman in Nuku'alofa.\n\n\"I'm looking to a government that prioritises education, health and security,\" said another.\n\n\"A lot of youth are using drugs … I feel like the government hasn't done enough for youth,\" said a man in the Tongatapu village of Vaotu'u.\n\nThe ABC spoke to Tongan voters ahead of the 2025 poll to get their views on what would shape their decisions at the ballot box. (ABC News)\n\n\"I will vote for the person who has love for the poor. Like myself, I'm not well off and I'd like someone who helps the poor. One thing I think could be improved is the pension for elderly people, these are the people who worked to build this country.\"\n\nTonga has endured persistent fuel shortages, with hours-long queues being a common sight at petrol stations.\n\nPotholes dot almost every road and a number of resorts have closed down as a result of natural disasters.\n\nThe public sector is suffering from a severe labour shortage due to mass emigration and overseas labour mobility which has seen thousands of Tongans regularly travel to Australia and New Zealand to pick fruit and pack meat.\n\n\"As a single voter issue, democratic reform is no longer centre stage,\" said Mr Motulalo.\n\n\"The majority of the discussions in the election campaigns is about livelihoods, education, health and so forth.\"\n\nThe King 'flexes his muscles' in Tonga Tonga's king has taken control of a government department in what critics say is a 'slap' to democracy in the Pacific nation.\n\nFor long time pro-democracy advocates like Mr Senituli, however, the monarch's increasing influence in the running of the country is worrying.\n\nHe says it could be just one step in the erosion of Tonga's democratic reforms.\n\n\"Now we are slowly witnessing the king re-inserting his executive authority and this is a step backwards,\" he said.\n\n\"This is what I'm worried about, that the democratic changes that we have made are going to be lost.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/victoria-liberals-jess-wilson-first-day/106025500",
    "title": "Jess Wilson faces climate change grilling on first day as Victorian Liberal leader",
    "publish_date": "Tue, 18 Nov 2025 23:10:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Jess Wilson has started her first full day as Victorian Liberal leader by refusing to distance her party's climate change policies from its federal counterpart, which was criticised last week for dumping the commitment to net zero emissions.\n\nShe also reaffirmed the party's commitment to repeal the state's first treaty with Aboriginal people, which was signed earlier this month.\n\nThe federal Liberal Party last week dumped its commitment to achieving net zero emissions by 2050, despite action on climate change being seen as a key issue for younger voters.\n\nMs Wilson declined to commit to a net zero policy in Victoria but said her party had supported emissions reduction legislation in the parliament.\n\n\"There's no plans to change what legislation has gone through the parliament but what we are doing is we are saying we have to focus on the fact that power bills keep increasing and that we have a gas shortfall in future years and that's why we have been very clear that we want gas to be part of that transition,\" she told ABC Radio Melbourne.\n\nAfter the federal Liberal Party ditched its net zero commitment, then-Victorian Liberal leader Brad Battin said he was \"comfortable\" retaining Victoria's goal of net zero emissions by 2045.\n\nBut on Wednesday Ms Wilson would not repeat that commitment.\n\n\"We have been clear in our position in the parliament in supporting emissions reduction targets here in Victoria, but what I'm saying is it can't be by itself,\" she said.\n\n\" We have to make sure people are actually able to pay their power bills. \"\n\nShe also indicated she did not differ from her predecessor, Brad Battin, in her plans for the state's treaty with Aboriginal people, which the government signed into law with much fanfare.\n\n\"We've been very clear that we oppose the treaty and will repeal it when we come into government,\" she said.\n\nJess Wilson has become the third Liberal party leader in less than three months following a leadership spill. (AAP Image: Joel Carrett)\n\nMs Wilson was keen to market her arrival as leader as a fresh start for the party, just a year out from the next state election.\n\n\"Yesterday was a line in the sand moment. We have elected a new generational team and a team that represents all walks of life from all across Victoria,\" she said.\n\n\"As a millennial, I'm 35, I understand the pressures of that generation and below, and a lot of it comes back to home ownership.\n\n\"So many young people in Victoria have simply lost hope that they will ever be able to afford their own home, and I want to put forward the policies that restore that hope.\"\n\nSigns the party is still divided on leadership\n\nMs Wilson ousted Mr Battin yesterday after a motion to spill the leadership divided the Liberal Party, 19 votes to 13.\n\nAfter the party voted for the spill, Ms Wilson was elected unopposed.\n\nOn Wednesday morning, Mr Battin offered his full support to the new party leader who would take them to the polls in 2026.\n\n\"Look, I think we've got a really good chance,\" he said.\n\n\"Jess is going to be in a great position to win. We've seen that Victorians really want change, and Jess is the right person now to take us to the next election.\n\n\"Victorians just want to see that the Victorian Liberal Party can deliver. We've already come out with some good policies we'll continue.\"\n\nBrad Battin was dumped after less than a year as Victorian Liberal leader. (ABC News: ABC News)\n\nSenior Lecturer in Politics and International Relations at Monash University Zareh Ghazarian said the 19-13 split in the spill vote showed there was still disagreement in the party.\n\n\"This shift to a new leader wasn't unanimous, Brad Battin still did have supporters and there are still going to be divisions within the Liberal party,\" Dr Ghazarian said.\n\n\" It's this weird conundrum where it doesn't necessarily mean that if a leader is popular, they're going to keep their job. \"\n\nDr Ghazarian said the divisions within the party would need to be fixed quickly to avoid the situation repeating.\n\n\"There are 12 months until the next election, which is due this time next year,\" he said.\n\n\"If they are still unable to reconcile their differences, especially between those with more socially conservative views and those with slightly more progressive views, then the party is probably going to be going through this loop regularly.\"\n\nFormer Liberal premier Jeff Kennett called it an \"exciting\" development for the party.\n\n\"This is a generational change, it's a generational change for the Liberal party,\" he said.\n\n\" I think you will find that she'll not only attract young people to her style, but I think she'll also attract a lot of those senior women who have been attracted to the Teals in recent years but who are fundamentally Liberal supporters. \"\n\nFormer premier Jeff Kennett says Ms Wilson represents generational change in the party. (ABC News)\n\nMr Kennett said the party had been bogged down in factional warfare for years, and would benefit from the leadership of a relative \"cleanskin\" to politics.\n\n\"There have been people who have been working to undermine successive leaders,\" he said.\n\n\"The very fact they have, as factions, come together and said we need change … gives me great hope.\"",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/davis-cup-finals-carlos-alcaraz-pulls-out-of-spain-campaign/106026144",
    "title": "Alcaraz 'heartbroken' after withdrawing from Davis Cup Finals",
    "publish_date": "Tue, 18 Nov 2025 22:11:45 +0000",
    "category": "sports",
    "authors": [],
    "text": "World number one Carlos Alcaraz says he is \"heartbroken\" after pulling out of Spain's squad for the Davis Cup Finals in Bologna because of a swollen hamstring.\n\nAlcaraz aggravated the injury during the ATP Finals in Turin, where he lost to Jannik Sinner in the tournament decider on Monday AEDT.\n\n\"I'm so sorry to announce that I won't be able to play for Spain in the Davis Cup in Bologna,\" Alcaraz wrote on Instagram.\n\nSinner claims ATP Finals victory over Alcaraz Jannik Sinner has defeated world number one Carlos Alcaraz 7-6 (4), 7-5 in the ATP Finals title decider.\n\n\"I have edema [swelling] in my right hamstring, and the medical recommendation is not to compete.\n\n\"I've always said that playing for Spain is the greatest thing there is, and I was really looking forward to helping us fight for the Davis Cup.\n\n\"I'm going home heartbroken.\"\n\nAlcaraz's withdrawal dealt another blow to Davis Cup organisers, the International Tennis Federation.\n\nSinner, ranked number two in the world, pulled out of the Davis Cup Finals last month before defending champions Italy confirmed his absence.\n\nItaly, which has won the past two Davis Cups, will also be without world number eight Lorenzo Musetti, who withdrew citing physical and family reasons.\n\nMusetti's place is expected to be taken by Lorenzo Sonego, who has been in Turin practising in recent days.\n\nItaly faces Austria in the quarterfinals on Thursday morning AEDT, while Spain plays Czechia on Friday AEDT.\n\nReuters",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/afl-draft-2025-how-to-watch-and-what-time-does-it-start/106026096",
    "title": "How to watch the AFL draft and everything else you need to know",
    "publish_date": "Tue, 18 Nov 2025 21:45:07 +0000",
    "category": "sports",
    "authors": [],
    "text": "Another AFL draft has arrived, offering dozens of teenage footballers the chance to realise their dreams and clubs the opportunity to prepare for a brighter future.\n\nThe draft can be a complicated beast these days, with academies and father-son selections muddying the waters for clubs looking to secure the best talent.\n\nHere is everything you need to know about the 2025 AFL draft and tap here for a rundown of every pick for each team.\n\nWhen is the AFL draft?\n\nThe 2025 AFL draft will be held over two nights on Wednesday, November 19 and Thursday, November 20.\n\nThe first round will be completed tonight, when a selection of players will be present at Docklands Stadium for the event.\n\nThe rest of the draft will be held on the second night. In total, 50 to 60 players are expected to be drafted this year.\n\nHow can I follow the AFL draft?\n\nABC Sport will have live blogs running on both nights of the draft, bringing you news and analysis of every pick.\n\nThe draft will also be broadcast live on Fox Footy and Kayo Sports.\n\nWhat time is the AFL draft?\n\nBoth nights of the draft will start at 7pm AEDT.\n\nHere are the corresponding times for other regions of Australia.\n\n6:30pm ACDT: South Australia\n\nSouth Australia 6pm AEST: Queensland\n\nQueensland 5:30pm ACST : Northern Territory\n\n: Northern Territory 4pm AWST: Western Australia\n\nWho are the players I should know before the draft?\n\nIt is widely expected that Willem Duursma — the fourth Duursma sibling to join the AFL/AFLW system — will be taken by West Coast with the first selection on Wednesday night.\n\nWillem Duursma is set to be the number one pick at this year's draft. (Getty Images: Paul Kane)\n\nOthers in the top-five mix are Zeke Uwland and Dylan Patterson (both members of Gold Coast's academy), Daniel Annable (a member of Brisbane's academy) and Harry Dean (a Carlton father-son).\n\nFrom the open pool of players available to all, Cooper Duff-Tytler, Sullivan Robey, Xavier Taylor, Sam Cumming and Dyson Sharp are the strongest top-10 candidates.\n\nWhat is the current order of picks in the first round?\n\nWest Coast West Coast Richmond Richmond Essendon Essendon Melbourne Melbourne Carlton Hawthorn Carlton GWS West Coast Western Bulldogs Gold Coast Adelaide Brisbane Gold Coast Geelong Fremantle Essendon Hawthorn Brisbane\n\nHow does the bidding system work in the AFL draft?\n\nThe AFL assigns each draft pick with a points value. The first pick in the draft has the most value, with 3,000 points, and the points value of each pick decreases all the way down until pick 54, the final pick of the third round, which is worth 14 points. Any picks from then onwards have no points value.\n\nBrisbane will swiftly match a bid for academy prospect Daniel Annable. (Getty Images: Josh Chadwick)\n\nThe points system is in place for two reasons: to require clubs to pay for matching bids on father-son prospects or academy prospects that are tipped to go high up in any given draft year.\n\nTeams who match bids for either a father-son or academy prospect get a 20 per cent discount. Teams are not obligated to match bids from other clubs, therefore allowing the player to be drafted by a different club.\n\nCan teams do trades during the draft?\n\nThey sure can!\n\nSince being introduced in 2018, the ability for teams to trade during the draft has added an extra wrinkle to the whole process.\n\nTeams can trade with each other using their own picks in the current draft as well as using picks in the 2026 or 2027 drafts.\n\nWhat is the father-son rule?\n\nThe father-son rule is one that is unique to the AFL and allows family traditions to be carried through generations.\n\nSimply put, if a player makes 100 or more appearances for a single club, then that same club has the right to draft the player's son.\n\nThere have been some famous father-son combinations to have played in VFL/AFL history, perhaps none more famous than Gary Ablett and Gary Ablett Jr, who both played for Geelong.\n\nTeams are not obligated to select a player under the father-son rule either. A famous example of this occurred in the 2015 draft when the Sydney Swans opted against drafting Josh Dunkley — now a three-time premiership player — whose father, Andrew, played 217 games for the club.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/miscellaneous-rate-local-government-reform-bankrupt-mount-magnet/106019936",
    "title": "Regional shire warns state rate reforms would bankrupt council",
    "publish_date": "Tue, 18 Nov 2025 21:33:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "An outback local government says it could be bankrupted, as a \"David and Goliath\" battle moves through the West Australian parliament's upper house.\n\nLast week, the lower house passed an amendment to the Local Government Act which would block shires from rating certain mining land.\n\nMount Magnet chief executive Tralee Cable said, if legislated, the shire's rates income would shrink from $3 million a year to about $300,000.\n\n\"Effectively, this bill will bankrupt this local government,\" Ms Cable said.\n\nMount Magnet had a population of about 580 people in the 2021 census. (ABC News: Chloe Henville)\n\nIt was sparked by a landmark Supreme Court decision in July, ruling that the Shire of Mount Magnet, about 570 kilometres north-east of Perth, could levy rates on a mining camp covered by \"miscellaneous licences\".\n\nMiscellaneous licences are typically levied on land with mining infrastructure, such as access roads and accommodation sites.\n\nSwift reforms followed\n\nThe ruling opened the door for other local governments to scrutinise miscellaneous licence holders, a move which the mining sector said could cost it $55 million a year.\n\nThe mining camp owner, Atlantic Vanadium, said it would appeal the decision.\n\nMeanwhile, the WA Labor government swiftly announced reforms to the act, which were welcomed by the Chamber of Minerals and Energy WA.\n\nThe WA government is looking to exempt land under miscellaneous licences from rates. (ABC News: Rachel Pupazzoni)\n\nToo swiftly, according to Ms Cable.\n\n\"The speed of this bill, the complete lack of consultation, the disregard, the amazing disregard for the impact on our small regional community,\" she said.\n\nThe amendment would require any rates collected on miscellaneous licensed land since 2017 to be repaid within 28 days.\n\n\"If we are to repay the money that we have rated, it would halve our reserves,\" Ms Cable said.\n\nWith 580 residents, Ms Cable said taking away the income source would make the shire economically unviable.\n\n\"We're not a dysfunctional, malfunctioning local government,\" Ms Cable said.\n\n\"This is not a small local government trying to gouge the mining industry\n\n\"But we need regular, budgetable, reliable, non-discretionary revenue.\"\n\nThe Shire of Mount Magnet has been fighting to charge rates on occupied Crown land. (ABC News: Chloe Henville)\n\nBill 'heavy-handed', says opposition\n\nShadow Local Government Minister Kirrilee Warr likened the legislative reform to a \"David and Goliath\" battle against small regional councils.\n\nMs Warr said the local government sector was not properly consulted, with less than a week to respond to the state before the \"heavy-handed\" bill was publicly announced.\n\n\"[That] is certainly not adequate time when we are working within the bureaucracy of any level of government,\" Ms Warr said.\n\nThe WA Nationals pushed the state to amend the proposed bill and write in compensation through a revitalised Royalties for Regions scheme for affected councils, but the changes were not adopted.\n\nKirrilee Warr says impacted shires should be financially supported. (ABC News: Chloe Henville)\n\nMs Warr said the bill would also undermine the Supreme Court's decision.\n\n\"We must respect the separation of powers,\" Ms Warr said.\n\n\"When did it become our place to start saying, 'Sorry, courts, we don't believe what you've just read and interpreted and said, and we want you to go and change that?'\n\n\"I am gobsmacked by that.\"\n\nReturn to the status quo\n\nLocal Government Minister Hannah Beazley did not respond directly to questions about whether the amendment contradicted the court's decision.\n\nBut she said the state government had introduced \"sensible and effective law reform\" following the Supreme Court ruling and restored the \"long-held understanding\" that miscellaneous licensed land was not rateable.\n\nHannah Beazley says the bill would uphold the status quo. (ABC News: Keane Bourke)\n\nMs Beazley said councils would not be hurt by the amendment.\n\n\"Local governments are not being financially disadvantaged by the proposed change to the legislation since the land has only been rateable since the Supreme Court decision in July,\" she said.\n\n\"This land was never intended as a revenue stream for local governments.\"\n\nMs Beazley said, if passed, the bill would provide clarity and uphold the status quo.\n\nThe amendment has been read twice in the state's upper house, but has not been formally adopted.\n\nThere are eight sitting days left in the upper house for this year.",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.abc.net.au/news/2025-11-19/west-coast-eagles-2025-afl-draft-preview/105866808",
    "title": "West Coast Eagles brace for most important draft in club's history",
    "publish_date": "Tue, 18 Nov 2025 21:19:17 +0000",
    "category": "sports",
    "authors": [],
    "text": "When Campbell Chesser secured his trade from West Coast to Carlton, a gaping hole in the West Coast Eagles' list profile was brought into sharp focus.\n\nThe club only has one player either selected with, or traded in exchange for, a first-round draft pick between 2015 and 2021 on its books.\n\nCampbell Chesser's move to Carlton leaves West Coast without another first-round draft pick. (AFL Photos via Getty Images: Daniel Carson)\n\nIn fact, just eight players recruited in that time remain at the club.\n\nA lot is made of the Tim Kelly move, which saw the midfielder arrive from Geelong for first-round picks in 2019 and 2020.\n\nIt was that move which, when it didn't translate to another premiership, contributed to the dire position the club finds itself in now.\n\nBut it's not the sole decision the Eagles have made in their recruitment which, in 2025, saw them produce a calamity never seen before in VFL/AFL history — 22 losses in a single season.\n\nLet me be clear — that is not a dig at Kelly.\n\nTim Kelly came to West Coast in exchange for a raft of high picks. (AAP Image: Richard Wainwright)\n\nHe didn't dictate his trade value, and in his early years at the club was among its best players, acknowledged by his 2023 John Worsfold Medal, and runner-up finish in 2022.\n\nWhat it highlights is a list management strategy that hasn't paid off, and picks which haven't translated to long-term talent.\n\nA brief history of picks\n\nWhen West Coast won the 2018 premiership, it did so with eight first-round picks in its match-day squad, along with three others in Andrew Gaff, Nic Naitanui and Brad Sheppard on its list.\n\nJarrod Brander also played a game that year, after being pick 13 in the 2017 draft.\n\nCompared to the 12 first rounders who played a game in 2018, the 2025 Eagles had just seven, with all but Liam Duggan and Tom Cole drafted since 2021.\n\nLiam Duggan was one of seven first-round draft picks who played a game for West Coast in 2025. (AAP Image: Jono Searle)\n\nThat's reflected in the age profile of West Coast. Its premiership side had an average age of 26 with 2657 games between them.\n\nThe side that played in round 24 this season, which didn't include the injured Harley Reid, had an average age of 23 and with a thousand fewer games of experience.\n\nThe point here is twofold. It shows the Eagles are still very much at the beginning of the rebuild, and that this upcoming draft is critical for the club's future.\n\nWhat is a successful draft?\n\nQuantifying draft success is very difficult. Is it total games played by any given draft year? Premierships? Individual accolades? According to Draftguru, West Coast's 2005 draft is the best ever on record, by games played.\n\nIt was the draft that landed Matt Priddis and Shannon Hurn, and yielded an average of 136 games per player selected.\n\nThat figure is clearly skewed by the 573 games played by Hurn and Priddis, but considering Steven Armstrong was in the Eagles' 2006 premiership side, and Matt Spangher went on to win a flag with Hawthorn, it was a very good draft.\n\nShannon Hurn and Matt Priddis were outstanding draft picks for West Coast, with Hurn a premiership captain and Priddis a Brownlow medallist. (AAP Image: Richard Wainwright)\n\nCould Willem Duursma, widely tipped to be the draft’s first pick, have a similar impact as those two club greats?\n\nWill he stay the journey and commit to the Eagles’ rebuild long term?\n\nAnd who will they opt to take with pick two?\n\nAFL draft club by club: Every team's picks and potential targets With the AFL draft just around the corner, see which picks each club has to work with and the players they could select.\n\nRuckman/forward Cooper Duff-Tytler is predicted to be the second pick, and the ruck position has haunted West Coast since the breakdown and retirement of Nic Naitanui.\n\nBut the midfield needs bolstering too, and that could see the Eagles making a move out of left field.\n\nNext Generation Academy prospects Tylah Williams and Koby Evans could also receive bids, as well as potential father-son recruit Charlie Banfield, who may end up in blue and gold like his dual-premiership winning father Drew.\n\nThe Eagles' draft lotto ticket currently reads picks 1, 2, 13, 34 and 41.\n\nWe all know the odds of hitting the jackpot aren't great, but three and a supp would be a win for Eagles fans.\n\nIt’s a draft full of huge questions for West Coast, and the answers won’t be known for years.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
    "source": "ABC",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/skittish-batter-could-be-englands-weakness-20251119-p5ngp8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Skittish' batter could be England's weakness",
    "publish_date": "Wed, 19 Nov 2025 13:00:46 +1100",
    "category": "sports",
    "authors": [],
    "text": "'Skittish' batter could be England's weakness\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/soccer/socceroos-v-colombia-live-updates-australia-take-on-colombia-at-citi-field-new-york-in-international-friendly-20251118-p5ngex.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Socceroos v Colombia LIVE updates: Australia take on Colombia at Citi Field, New York in international friendly",
    "publish_date": "Wed, 19 Nov 2025 12:59:50 +1100",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Izzo called into action, again. This time Colombia moves the ball quickly through the middle, Luis Diaz receives it, turns, shoots and Izzo dives to his left to keep it out.\n\nAs commentator Andy Harper notes, that’s the key difference between the two sides at the moment - a little bit more enterprise and speed in ball movement. Colombia are doing it better right now. That should surprise nobody.\n\nColombia 0-0 Australia, 24 minutes",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/national/nsw/john-laws-state-funeral-live-updates-australian-radio-broadcaster-to-be-farewelled-in-st-andrews-cathedral-service-20251119-p5ngjt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "John Laws state funeral live updates: Russell Crowe, John Williamson to lead tributes as Australian radio broadcaster farewelled in St Andrew’s Cathedral service",
    "publish_date": "Wed, 19 Nov 2025 12:55:51 +1100",
    "category": "finance",
    "authors": [
      "Angus Thomson"
    ],
    "text": "Former deputy prime minister Barnaby Joyce has arrived at John Laws’ state funeral.\n\nWearing his customary wide-brimmed Akubra, Joyce posed for selfies with punters before telling a gaggle of assembled media that Laws “gave people hope that they would be listened to”.\n\n“The worst thing you can be for you guys is boring … John Laws was never boring,” he said.\n\nJoyce was asked: “Were you scared of him?”\n\n“I don’t know about scared,” was his reply.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/australia-news-live-survivors-demand-release-of-epstein-files-ahead-of-critical-vote-nsw-liberals-defy-federal-colleagues-to-retain-net-zero-target-trump-hosts-saudi-leader-20251119-p5ngj0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Government reviewing laws to tackle Nazism; Congress overwhelmingly votes to release Epstein files; Israel targets Lebanon with airstrike",
    "publish_date": "Wed, 19 Nov 2025 12:51:10 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Very early into his first address at the National Press Club as ABC boss, Hugh Marks has made a subtle jibe toward his boss, the broadcaster’s chair Kim Williams, almost a year to the day after he prompted a global storm for taking aim at podcaster Joe Rogan.\n\n“It is true that Australia has a vibrant and generally responsible media market compared to many other places around the world, one that grows with new voices every day. Joe Rogan, for example,” Marks said.\n\nABC managing director Hugh marks at the National Press Club in Canberra. Credit: Alex Ellinghausen\n\nWilliams last year called Rogan “deeply repulsive”, saying people like him “prey on people’s vulnerabilities”, which drew responses from Rogan himself and Elon Musk.\n\nMarks is making his pitch in the broadcasted address eight months into his tenure at the ABC, and 24 hours before it presents its 2026 slate of content in a presentation at its Ultimo headquarters on Thursday.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/property/news/chemist-warehouse-family-splash-80-million-plus-on-toorak-block-20251119-p5ngjl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chemist Warehouse family splash $80 million-plus on Toorak block",
    "publish_date": "Wed, 19 Nov 2025 12:28:10 +1100",
    "category": "finance",
    "authors": [
      "Elizabeth Redman"
    ],
    "text": "Chemist Warehouse co-founder Jack Gance and his wife Evelynne have bought a Toorak estate for more than $80 million.\n\nThe Rich Listers are tipped to knock down the existing homes on the block and rebuild their dream home on the site.\n\nThe Toorak estate was listed for $80 million to $88 million. Credit: Kay & Burton\n\nThe offering across two titles was listed for sale with a price guide of $80 million to $88 million. A source with knowledge of the deal, but not authorised to comment publicly, said they thought the result was within the range. Another source also not authorised to comment said the Gances were the buyers.\n\nPublic records show the owners of the properties are Weian Zhang, known as Andy, and Miaomiao Zhang, who are directors of property development company V-Leader.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/lifestyle/life-and-relationships/looking-for-inspiration-for-christmas-this-year-find-all-our-gift-guides-in-one-place-20251020-p5n3v3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Looking for inspiration for Christmas this year? Find all our gift guides in one place",
    "publish_date": "Wed, 19 Nov 2025 12:22:53 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Finding the perfect gift on a budget is a big ask. We’ve taken the work out of it for you with our pick of the best, quirkiest and affordable presents for your office, family or friend group secret Santa.\n\nNovember 14, 2025\n\nby Lauren Ironmonger",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/sport/magical-moments-from-scotland-and-iraq-in-wc-qualifiers-20251119-p5ngog.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Magical moments from Scotland and Iraq in WC qualifiers",
    "publish_date": "Wed, 19 Nov 2025 12:08:58 +1100",
    "category": "sports",
    "authors": [],
    "text": "Magical moments from Scotland and Iraq in WC qualifiers\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/lifestyle/peter-james-on-royal-crime-novel-20251119-p5ngoa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Peter James on royal crime novel",
    "publish_date": "Wed, 19 Nov 2025 12:03:12 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Peter James on royal crime novel\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/politics/federal/albanese-has-cut-australia-s-cop-bid-off-at-the-knees-has-anyone-told-bowen-20251119-p5ngm3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Albanese has cut Australia’s COP bid off at the knees; has anyone told Bowen?",
    "publish_date": "Wed, 19 Nov 2025 12:01:20 +1100",
    "category": "finance",
    "authors": [
      "Nick O'Malley"
    ],
    "text": "If Australia has conceded defeat to Turkey over the hosting rights for next year’s COP climate talks, someone should tell Climate Change and Energy Minister Chris Bowen in Brazil, where he is currently advocating for the bid at this year’s meeting.\n\nMixed messages from Australia are not making his job any easier, say observers on the ground.\n\nMixed messages … Chris Bowen and Anthony Albanese. Credit: Alex Ellinghausen\n\nAustralia has been making a case to host the talks, along with its Pacific neighbours, since 2022. With the full support of all the other nations in its Western Europe and others UN group, it has long been seen as the inevitable winner.\n\nAll other nations in the grouping, that is, except for Turkey, which is prosecuting its own campaign to host COP31.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/culture/books/a-visionary-world-of-star-maps-spider-threads-and-animal-spirits-20251114-p5nffg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A visionary world of star maps, spider threads and animal spirits",
    "publish_date": "Wed, 19 Nov 2025 12:00:00 +1100",
    "category": "finance",
    "authors": [
      "Jane Sullivan"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size There are two stories Judith Nangala Crispin tells about her solo journeys criss-crossing the central Australian deserts on a motorcycle with her mongrel dingo Moon on the back. One is a blog that aims to empower women. It covers just one of the 37 crossings she made, and it’s full of adventure and drama. Right from the start, her Suzuki DR650 bike had tyre trouble, and she was stranded for two days in the middle of nowhere. She battled through a desert heatwave, floods, hundreds of kilometres of potholes, corrugations and ruts. Worst of all, Moon was bitten by a snake, and she drove for seven hours through the lightning-streaked night to a vet in Katherine, convinced that Moon would die on the way. Luckily, he survived and they both got safely to the end of the journey at Canberra. The second story about her desert odyssey enters an entirely different visionary world of star maps, spider threads and UFOs in the sky, the spirits of dead animals ascending and a quest to find a caravan of dog-headed beings with bodies made of stars. These are some of the astonishing phenomena explored in Crispin’s illustrated verse novel, The Dingo’s Noctuary (a noctuary is a night diary). “Zoe descends to comfort her daughters, in a burning country”. Credit: Judith Nangala Crispin Crispin’s motorcycle odyssey came to a sad end during her 37th journey. She was driving through Broken Hill when “I was run over by a mum shouting at her kids in a gigantic SUV”. She was left with a traumatic brain injury and damage to 126 muscles down her spine. “The book was only half finished, but I had this terrible sensitivity to light from the computer, it gave me blinding headaches.” So she wrote the second half of The Dingo’s Noctuary on a 1966 Olympia Splendid 33 travel typewriter. “It transported me back to when I was 15 and thought I was going to grow up to be Gertrude Stein.” This is the third book from the acclaimed poet. It’s a big handsome hardback that took more than seven years to complete, and it’s already won or been shortlisted for poetry, art and photography awards even before publication. The poetry alternates with prose, hand-drawn maps, plant pressings and 47 Lumachrome glass prints of dead animals and birds.\n\nAdvertisement\n\n“The book is about what I found,” Crispin says. “As a person with mixed heritage and Aboriginal ancestry but without any cultural authority, acceptance or ties, what relationship could I have directly with country that’s not just a platitude? It took 37 trips to feel I knew enough about country and people and myself to write anything meaningful.” Crispin is a descendant of Bpangerang people from the Murray River, and she also acknowledges heritage from Scotland, Ireland, France, Mali, Senegal and the Ivory Coast. She spent more than 20 years searching for her grandmother’s history, hoping it would make her feel she was “a legitimate Aboriginal person”. But it was a rough search. “I’d known we had Aboriginal ancestry since I was a child. We were all told this is something you never talk about, my grandmother and mother were very emphatic,” she says. “Terrible things would happen to the family if you said anything … There is very little on the white record for some people because the families try so hard to cover it up. I was feeling increasingly illegitimate, I didn’t belong to white culture or Black culture, and I thought, do I keep going on?” One of Crispin’s Lumachrome glass prints, “Enid, connected to Earth by zodiacal light - spider-strings in the old language, the umbilicus of Country.” Credit: Judith Nangala Crispin Along the way she met many “despairing” people on the same quest. “I wanted this book to be for them. You can walk out on the land and form your own relationship. You don’t have to walk through life feeling like half a person because you don’t have your heritage papers in order.” By the time she discovered her link to the Bpangerang people, she had already spent 15 years living with the Warlpiri people in the Northern Territory. She worked for PAW, the remote Indigenous media organisation, mentoring, working with an app for suicide prevention and with the painters: “It was the painters who were trying to free me from dogma.” The Warlpiri are her adopted people and she took their skin name Nangala as a sign of respect. ‘One clear night, Lilian followed the Milky Way out toward Orion. All her life she had stared up at Betelgeuse, the giant red star, and felt it staring back’: Crispin’s Lumachrome Glass Print and chemigram of roadkill Australian Masked Owl. Credit: Judith Nangala Crispin\n\nAdvertisement\n\nBeloved Warlpiri friends and mentors appear often in The Dingo’s Noctuary, and she has given them their own voices. One of them is Lily, “one of the most miraculous people I’ve ever met”. She lived in a humpy until she was 98, and at over 100 she was taken to a nursing home with dementia. The first time Crispin visited her there, Lily had decided she was a new mum to an Aboriginal baby doll and a couple of toys. She was having trouble breastfeeding them, so Crispin got her a bottle. Lily told her many stories: one was about a mountain, and if you went past it, you would find dog-headed people with bodies made of stars. Crispin honoured her stories and made them a feature of her journey: “I told Moon those stories when I was driving him to the vet, trying not to be a complete nervous wreck.” She knew she wanted to talk about the land and people as they were, without romanticising, “but I didn’t want the book to have this weight of suffering and poverty and hopelessness. It’s about the love that people out in the desert have for that place, and the love I had, which came through being able to see what they saw.” The Warlpiri women taught her that a woman can stand up strong after birth, and at death too, grief-stricken but not shattered. “So I thought I’d try and honour the dead, starting small with animals and plants and work my way up.” Crispin and Moon on their motorbike. Credit: Judith Nangala Crispin The first roadkill she collected for her portraits was a tiger snake. The process of decay gave out a light that exposed the image on the page. The images can be put in an art gallery and honoured the way we honour saints in a church, she says. “I portrayed them as ascending back to their ancestors in the sky. I sat with more than 500 cadavers as they bloated up and broke down and then buried them. There’s a smell, but you can ignore it. And the rest feels kind of holy.” T\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/culture/books/faith-poetic-precision-and-visionary-charge-patti-smith-s-new-memoir-20251117-p5nfzb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Faith, poetic precision and visionary charge: Patti Smith’s new memoir",
    "publish_date": "Wed, 19 Nov 2025 12:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "Michael Dwyer"
    ],
    "text": "Her earliest memories shimmer as if through a looking glass in the back of a wardrobe: the doll rescued from a cliff; the maple bureau whose knobs are dials to infinity; the rat-infested underworld she patrols with the neighbourhood children; old Aggie across the hall with her dark green book of Irish fairytales.\n\nIt’s a spark poets and songwriters know well: sound as the seed of a world more felt than understood. In this latest in her series of gloriously transporting memoirs, Smith follows that scratch into the awkwardness and beauty of childhood, the place where “the kingdom of the infinite imagination” first opened beneath her feet.\n\nThe crumb trail begins at once. “The pen scratches across the page rebel hump rebel hump rebel hump. What do those words mean, asks the pen. I don’t know, says the wrist.” That’s the bread of angels: the mundane summoning the mystical. Patti Smith is the go-between, setting the vibration to language, trusting meaning will come.\n\n“Mine was a Proustian childhood, one of intermittent quarantine and convalescence,” she writes. A dose of Asian flu intensifies her insistence on divine structure. Her mother’s emptied tip jar and the Puccini box set on the dresser are “a marriage of art and sacrifice” that literally saves her nine-year-old life.\n\nThe outer world she describes as her struggling family bounces between Philadelphia apartments is no less heightened. “I was happy there observing the last vestiges of the 1940s, soon to succumb to modern times,” she writes. “There were horse-drawn wagons, the iceman, a ragman, and an organ grinder with a monkey with a little red cap.”\n\nPatti Smith in 1969. Credit: Norman Seeff\n\nShe’ll return to the loss of that paradise later, but her spirit world never falters, even as she trades up her mother’s devotion to the Jehovah’s Witnesses for Picasso, Modigliani and Sargent at the Philadelphia Museum of Art. “I believed in the Creator, the many tongues of nature, the moral lessons of fairytales, the language of trees, and the clay of the earth … God, the infinite realm, Jesus, the human bridge, the artist, the material mouthpiece,” she writes. Breadcrumbs are everywhere: animals, constellations, fragments of ancient alphabets.\n\nA teenage pregnancy and a broken family nest hurl her towards New York, and the part of her story fans will know. Mapplethorpe, Shepard and the Chelsea Hotel; Dylan and Burroughs and Lenny Kaye, terrain that crisscrosses her earlier books from fresh angles. “Claiming the right to create without apology from a stance beyond gender or social definition” is one of her cascading manifestos.",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/roblox-to-introduce-age-guessing-tech-to-avoid-looming-social-media-ban-for-kids/8kgad5lie",
    "title": "eSafety commissioner says Roblox age restrictions come after negotiations, fine threats",
    "publish_date": "Tue, 18 Nov 2025 20:00:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "One of the world's biggest gaming platforms will ask users to verify their age after Australia's online safety watchdog threatened multimillion-dollar fines over concerns it was \"becoming a playground for pedophiles\".\n\n\n\n\n\nRoblox announced plans to launch age-estimation technology on Tuesday, with checks initially available as a voluntary measure before they become mandatory for Australians in December.\n\n\n\n\n\nThe United States-based firm said the changes would limit inappropriate conversations between children and adults on the platform.\n\n\n\n\n\nThe change will be enforced one week before Australia's social media ban for children under 16 years, which Roblox is exempt from.\n\n\n\n\n\nBut eSafety Commissioner Julie Inman Grant told ABC radio the restrictions were only being introduced after negotiations with Roblox, in which they were threatened with fines for failing to prevent harm.\n\n\n\n\n\n\"We'd been watching Roblox for a long time and had been concerned about some of their safety features and it becoming a playground for pedophiles,\" she said.\n\n\n\n\"We reached out to them around a formal warning and then it turned into a negotiation which they have to comply with by the end of December.\"\n\n\n\n\n\nUnder eSafety industry codes and standards, platforms can be fined up to $49.5 million for failing to protect users from seriously harmful material.\n\n\n\n\n\nAll Roblox users will be asked to submit to age-estimation technology under its changes, with checks provided by the US firm Persona.\n\n\n\n\n\nThe software will scan users' faces and use artificial intelligence technology to guess their age before assigning their account to one of six age categories.\n\n\n\n'Path of least friction', Roblox says\n\nUsers will only be allowed to chat on the platform with their group and adjacent age groups to reduce the risk of inappropriate conversations, Roblox chief safety officer Matt Kaufman said.\n\n\n\nRoblox users will be asked to submit to age-estimation technology under new rules. Source: AAP / Dean Lewins The technology had proven accurate to within one or two years, and users could correct results by sharing government-issued identification, he said.\n\n\n\n\n\n\"We decided that simply going with age-estimation was the path of least friction and the path that provided the best outcome and that minimised the collection of personal information,\" Kaufman said.\n\n\n\n\n\nEarlier in 2025, politicians called for Roblox to fall under Australia's social media age ban, but Inman Grant confirmed it would be exempt, as would services such as the social chat platform Discord and the games marketplace Steam.\n\n\n\n\n\nDespite its chat feature, Roblox was not a social media platform, Kaufman said, but he hoped its changes would lift online standards.\n\n\n\nRoblox age restrictions will be required for users in Australia, New Zealand and the Netherlands in December before a global expansion in January 2026.\n\n\n\n\n\nThe reforms come as the firm faces more than 35 lawsuits in the US, including allegations it allowed child sexual exploitation on its platform.\n\n\n\n\n\nNine online platforms will fall under Australia's Online Safety Amendment Act , including Facebook, Instagram, YouTube and TikTok, when it comes into effect on 10 December.\n\n\n\n\n\nReaders seeking support can ring Lifeline crisis support on 13 11 14 or text 0477 13 11 14, Suicide Call Back Service on 1300 659 467 and Kids Helpline on 1800 55 1800 (for young people aged 5 to 25). More information is available at beyondblue.org.au and lifeline.org.au .\n\n\n\n\n\nAnyone seeking information or support relating to sexual abuse can contact Bravehearts on 1800 272 831 or Blue Knot on 1300 657 380.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/pari-island-indonesia-taking-cement-giant-holcim-to-court/l8rhwbel5",
    "title": "The tiny island taking one of the world's most valuable companies to court",
    "publish_date": "Tue, 18 Nov 2025 18:37:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "Less than two hours by ferry from the grit and gridlock of megacity Jakarta, Pari Island seems almost too good to be true.\n\n\n\n\n\nThe Indonesian capital's 10 million people are swapped for just 1,500. Children spend all day playing barefoot on sandy white beaches, as pristine turquoise seas lap around them.\n\n\n\n\n\nThen you notice the swing sets and picnic tables peeking out of the water.\n\n\n\n\n\n\"During high tides or tidal floods, the water comes right into the house, up to about here,\" explains local man Arif Pujianto, pointing to decaying kitchen cabinets inside his home.\n\n\n\n\n\n\"You can still see the marks. It left all this damage, made things rot and fall apart.\"\n\n\n\nArif Pujianto has lived in this house 50 metres from the shore since he was a small boy. He says it now fills with water at least twice a year. Credit: SBS News / Claudia Farhart Locals say life on this island was steady for generations, but over the past decade, it has undergone a dramatic transformation.\n\n\n\n\n\nEnvironmentalists monitoring Pari Island say 11 per cent of it has already been swallowed by the sea, with some projecting the entire island will be underwater by 2050. All around the shore, structures that used to sit on land are now permanently submerged.\n\n\n\n\n\n\"This is my island,\" Pujianto says.\n\n\n\nThe place I've lived since I was a child, the place both my parents are buried.\n\n\"Other small islands have already started disappearing. If that ever happens,\" he says, before trailing off.\n\n\n\n\n\n\"I really hope it doesn't. That's why I filed this lawsuit.\"\n\n\n\nDemanding compensation\n\nIt is difficult to name a place that has contributed less to human-induced climate change than Pari Island.\n\n\n\n\n\nThere is not a single car in operation; the community grows and catches much of their own food; they've even planted thousands of carbon-capturing mangroves along the coastline in a bid to protect it from further erosion.\n\n\n\n\n\nYet it's one of the places in Indonesia where the effects of climate change are being felt most acutely.\n\n\n\n\n\nRising tides have damaged homes, warming waters have ruined once-lucrative seaweed farms, and rapidly changing weather patterns have made fishing largely unprofitable.\n\n\n\nThe community are now demanding damages, having launched a landmark legal case against Swiss cement giant Holcim over its historic carbon emissions.\n\n\n\n\n\n\"We studied this for a long time before finally choosing them, because their emissions are among the highest in the world,\" one of four plaintiffs, Ibu Asmania, says.\n\n\n\n\n\n\"The warming we feel now is caused by the massive emissions they've been producing since the 1950s.\"\n\n\n\n\n\nThe cement industry accounts for around 8 per cent of global carbon emissions annually, mostly due to the extreme heat needed to produce clinker (the main ingredient in cement).\n\n\n\n\n\nHolcim, worth more than $75 billion, is the industry's biggest player.\n\n\n\n\n\nThe plaintiffs are seeking about $6,800 each, arguing Holcim is responsible for 0.42 per cent of all global emissions since 1950 and should therefore pay for the same proportion of the damage caused to Pari Island (equivalent to $27,200 of a total $6,476,190 in emissions-related damage).\n\n\n\nIbu Asmania and her husband Sartono run a small seaweed farm off the coast of Pari Island. But rising tea temperatures are bleaching their crops. Credit: SBS News / Claudia Farhart \"What we're demanding first is for Holcim to cut its emissions, and secondly, to repair the environmental damage on Pari Island, through restoration, disaster mitigation, mangrove replanting and building wave barriers,\" Asmania says.\n\n\n\n\n\n\"It would mean our sea could recover, the fish could come back, and the whole ecosystem could heal again.\"\n\n\n\nAn ecosystem in turmoil\n\nAsmania and her husband, Sartono, have operated a small seaweed farm just off the coast of Pari Island for 20 years.\n\n\n\n\n\nAlmost every family on the island used to farm seaweed, but today she says only five are still trying.\n\n\n\n\n\n\"At first, we thought the seaweed had some kind of disease. It starts turning white from the tips, then the whole branch turns white, decays and rots. And then it spreads to the other seaweed nearby, one by one, until everything gets damaged,\" she explains.\n\n\n\nBut later we learned that it's actually because of climate change. It's because of the increasing sea temperature.\n\nThe community's other main source of income — fishing — has not been spared the impacts either.\n\n\n\n\n\nBang Bobby is another plaintiff in the Holcim case. He remembers first going out to sea with his parents in his fifth year of primary school. Now 53 years old, he has been fishing the waters off Pari Island ever since.\n\n\n\n\n\n\"We could still predict the seasons back then, including the wind directions month to month,\" he tells SBS News.\n\n\n\nBang Bobby has been fishing the waters off Pari Island since he was 10 years old. He says changing weather patterns are driving fish away from the island. Credit: SBS News / Claudia Farhart \"During the easterly winds around August, we'd catch tuna mackerel and scads. Then, as the seasons shifted to westerlies around March or April, we'd catch Spanish mackerel, baby tuna, and lots of others.\n\n\n\n\n\n\"Now, we can't predict nature anymore. Every forecast is completely off.\"\n\n\n\n\n\nBobby says fish populations near the island have declined, which means local fishers need to travel much further out to sea to find their daily catch.\n\n\n\nImagine a big basin filled with water. If you drop even a small stone into it, it still creates ripples and waves that reach everywhere. It's the same with emissions. Bang Bobby\n\nDuring the region's eight-month-long wet season, when storms are sudden and intense, they often need to turn back before catching anything.\n\n\n\n\n\nThe difference in Bobby's income is dramatic; he used to turn a profit of around $500-$600 per month, but now, he is lucky to make $150.\n\n\n\n\n\n\"This is something we have to do. Even though Pari Island is far from Holcim's factories, the emissions they produce have caused the climate change that's reached us here,\" he says.\n\n\n\n\n\n\"Imagine a big basin filled with water. If you drop even a small stone into it, it still creates ripples and waves that reach everywhere. It's the same with emissions. You can't see them with your eyes, but their impact is real and we can feel it.\"\n\n\n\nLandmark legal battle\n\nNo community has ever successfully sued a corporation on another continent over its carbon emissions.\n\n\n\n\n\nA Peruvian farmer spent the better part of a decade trying to launch a lawsuit against German energy giant RWE, arguing its carbon emissions contributed to glacial flooding in his hometown, but a German court rejected his case in May.\n\n\n\nActivists at the Indonesian Forum for the Environment, which is helping the Pari Island community with its legal case, say that if it is successful, it could set an important precedent for other communities seeking climate justice.\n\n\n\n\n\n\"We know that emissions, and therefore the climate crisis, cannot be contained within administrative borders,\" the forum’s head of monitoring Mas Bagus says.\n\n\n\n\n\n\"Of course, other corporations should also be held accountable. We invite others to do the same.\n\n\n\n\n\n\"Today it's Holcim, tomorrow it could be other companies that must also take responsibility.\"\n\n\n\n\n\nThe Pari Island plaintiffs travelled to Switzerland in September to make their case with a local court in the town of Zug, where Holcim is headquartered. They're now awaiting the court's decision on whether to consider their complaint.\n\n\n\nPari Island man Edi Mulyono says he is taking Holcim to court to protect his children's futures. Credit: SBS News / Claudia Farhart In a statement to SBS News, a Holcim spokesperson said: \"In our opinion, the question of who is allowed to emit how much CO2 is a matter for the legislature and not a question for a civil court.\"\n\n\n\n\n\n\"We await the court's decision, yet regardless of the outcome, Holcim is fully committed to reaching net zero by 2050.\"\n\n\n\nBy then, the people of Pari Island fear it will be too late.\n\n\n\n\n\n\"I don't know how long I'll live; maybe I'll die tomorrow, but I've got three kids; the eldest is in high school, the youngest is still in kindergarten,\" says Edi Mulyono, the fourth plaintiff in the case against Holcim.\n\n\n\n\n\n\"What I fear most is what will happen when my children grow up and have their own kids. Where will they live if this island keeps eroding and disappearing because of coastal abrasion and tidal floods?\n\n\n\n\n\n\"That's what's always on my mind. That's why I'm still doing everything I can to protect this island from sinking.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/video/ahead-of-black-friday-shoppers-warned-to-be-wary-of-scams/izvuq3ovc",
    "title": "Ahead of Black Friday, shoppers warned to be wary of scams",
    "publish_date": "Tue, 18 Nov 2025 09:53:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "Ahead of Black Friday, shoppers warned to be wary of scams\n\nPublished 18 November 2025, 8:15 am\n\nAustralians have lost more than a quarter of a billion dollars to scams in the first nine months of this year - an increase of 16 per cent on the previous period. The ACCC and National Anti-Scam Centre found online shopping scams are now the most commonly reported. Experts say it's a timely reminder for Australians to remain vigilant, ahead of what's expected to be a busy Black Friday sales period.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/video/new-cancer-scanning-technology-offering-better-diagnosis-and-personalised-treatment/9t6qmeza8",
    "title": "New cancer scanning technology offering better diagnosis and personalised treatment",
    "publish_date": "Tue, 18 Nov 2025 08:44:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/former-liberal-senator-hollie-hughes-lashes-ex-colleagues-as-inept-and-lazy-as-she-quits-party-live-on-radio/xjqprnvgj",
    "title": "Former Liberal senator lashes ex-colleagues as 'inept' and 'lazy' as she quits party",
    "publish_date": "Tue, 18 Nov 2025 08:18:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Former federal senator Hollie Hughes has quit the Liberal Party, saying it has strayed from its values and accusing some former colleagues of being \"lazy\" and \"inept\".\n\n\n\n\n\nSpeaking on Sydney's 2GB on Tuesday, Hughes — who left parliament just six months ago — backed Sussan Ley's leadership but said the party was mired by internal division.\n\n\n\n\n\n\"It is absolutely a rabble,\" she said.\n\n\n\n\n\n\"I have all the support in the world for Sussan Ley, I think she is doing an outstanding job.\n\n\n\n\n\n\"But there are some people who are completely inept, who are lazy, who are not across the details.\"\n\n\n\n\n\nHughes said the direction some members wanted to take the party no longer reflected the values of founder and former prime minister Robert Menzies.\n\n\n\n\n\n\"I don't think they reflect what a lot of Australians feel anymore,\" she said.\n\n\n\nShe added Ley had done a \"great job\" as leader, including on net zero, by allowing members a chance to voice their views at a party room meeting.\n\n\n\n\n\nBut she questioned how the federal division could be at odds with the NSW branch, which has backed a net zero by 2050 target.\n\n\n\n\n\n\"I don't know how it works,\" she said.\n\n\n\n\n\nHughes said she wanted to speak freely and would stay in the party and \"snipe from the sidelines\" like some former parliamentarians had done.\n\n\n\nREAD MORE Ley downplays past net zero remarks, stops short of revealing personal view\n\n\"I've always put [the party] first,\" she said.\n\n\n\n\n\n\"But when I look at the undermining that is going on, and I see some of the people doing it, I want to be able to give you absolute home truths about it without the hypocrisy of being a paid-up member of the Liberal Party.\"\n\n\n\n\n\nHughes served as a NSW senator from 2019 to 2025 and was shadow assistant minister under former Opposition leader Peter Dutton.\n\n\n\n\n\nShe left parliament after being placed in an unwinnable senate position following a preselection loss.\n\n\n\n\n\nSince leaving office, Hughes has purchased a pub at Rydal in the NSW central tablelands.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/campaign-targets-schoolies-over-alcohol-dangers-while-overseas/02dy6mvt0",
    "title": "Campaign targets schoolies over alcohol dangers while overseas",
    "publish_date": "Tue, 18 Nov 2025 07:55:18 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nEvery year, thousands of Australian school leavers head overseas on holidays, for the rite of passage known as \"schoolies\".\n\n\n\n\n\nIt's a moment when adventures begin for teens - and prayers are said by parents.\n\n\n\n\n\nFor Michelle Jones, whose daughter Bianca never returned from her holiday to Laos, it is a bittersweet memory.\n\n\n\n\n\n“’It's very very raw, especially at the departure entrance there where we said goodbye to our girls. Yep. Very raw, very upsetting.\"\n\n\n\n\n\nBianca Jones and her friend Holly Bowles died after consuming drinks laced with methanol at a backpackers’ hostel in the tourist town of Vang Vieng last November.\n\n\n\n\n\nThey were just 19.\n\n\n\n\n\nNow their parents want other young people to know the dangers that come with travelling - and drinking alcohol - overseas.\n\n\n\n\n\nHolly's mother Sam Bowles says they want to connect with other parents.\n\n\n\n\n\n\"It resonates with us. What we're trying to do is just get the message out to keep other travellers safe\" The families are at the centre of a new safety campaign targetting school leavers, launched by the federal government at Melbourne airport's international departure lounge.\n\n\n\n\n\n“Bianca and Holly were so excited about travelling overseas together. When Bianca first raised it with Mark and I, we were a little cautious, but also knew that travelling overseas with Holly was something that they had wanted to do and we were all confident about them traveling together. They were smart and they knew how to look after themselves.\" The campaign provides teens and parents with practical advice on drinking in moderation, looking after friends, and the risks posed by unlabelled, cheap or suspicious drinks.\n\n\n\n\n\n\"Be wary about consuming spirits and liqueur-based drinks such as cocktails on the rocks, buckets, and shots.\"\n\n\n\n\n\nThere is also guidance on how to get help if and when things do go wrong.\n\n\n\n\n\nIt's backed by the SmartTraveller website and not-for-profit group Drinkwise.\n\n\n\n\n\nMessaging will include promotional events at airport departure lounges, and geotargeted advertisements reaching mobile phones, as DrinkWise CEO Simon Strahan explains.\n\n\n\n\" They'll be seeing those messages in and around airports. They'll be seeing those messages on social media when they're searching for bars. It'll come up as part of that search activity. In Australia, we'll have those messages in liquor stores as well. We've got activations, that will be in airports, part of that will be actually engaging with school leavers, give them some merchandise, current reminders, and really start to talk to them.\"\n\n\n\n\n\nWith the end of the year fast approaching, the campaign is ramping up ahead of schoolies celebrations.\n\n\n\n\n\nThousands of students are expected to travel locally and overseas, to popular party destinations like Bali, Fiji, the Gold Coast, and south-east Asia.\n\n\n\n\n\nEducation Minister Jason Clare says the campaign is about reaching teenagers - wherever they are.\n\n\n\n\n\n\"We want to have fun and we want them to be safe. We want them to come home safe, and that's fundamentally what this campaign is all about - information online, on the plane, in the airport, text message, social media, but also getting information to schools.\"\n\n\n\n\n\nDespite a lengthy investigation by police in Laos and pressure from Australian authorities, no charges have yet been laid over the deaths of Bianca and Holly.\n\n\n\nMichelle Jones and Sam Bowles remember their daughters' excitement as they embarked on their adventure, but they are urging parents to talk to their children about remaining vigilant.\n\n\n\n\n\nMICHELLE JONES: \"Parents should have the conversation and sit them down, before they go away.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/60bn-wiped-from-asx-scams-rise-ahead-of-black-friday-sales/pn6vyu2mw",
    "title": "$60bn wiped from ASX & scams rise ahead of Black Friday sales",
    "publish_date": "Tue, 18 Nov 2025 07:07:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/csiro-to-slash-up-to-350-jobs-as-part-of-cost-cutting-drive/6flpnh9fi",
    "title": "'Critical inflection point': CSIRO to slash hundreds of jobs as part of cost-cutting drive",
    "publish_date": "Tue, 18 Nov 2025 06:53:03 +0000",
    "category": "finance",
    "authors": [],
    "text": "Hundreds of scientists and researchers will lose their jobs with Australia's leading science agency blaming rising costs and funding gaps for the cuts.\n\n\n\n\n\nThe CSIRO has announced up to 350 full-time staff roles will be abolished as the agency embarks on a new research direction to remain sustainable over the coming decades.\n\n\n\n\n\nBut the union representing the agency's workers has slammed the Albanese government for 'devastating' cuts, which it said were worse than under the former Abbott Coalition government.\n\n\n\n\n\nThe CSIRO said it was facing long-term financial sustainability challenges and it was at a \"critical inflection point\" due to funding not keeping pace with the rising costs of running a modern science agency.\n\n\n\n\n\nAfter decades of stretching resources to maintain the breadth of its programs and size of its workforce, the agency's chief executive Doug Hilton said the organisation needed to adapt to achieve the right balance.\n\n\n\nREAD MORE The mystery of Australia's deepest lake has finally been solved\n\n\"As today's stewards of CSIRO, we have a responsibility to make decisions that ensure we can continue to deliver science that improves the lives of all Australians for generations to come,\" Hilton said.\n\n\n\n\n\n\"We must set up CSIRO for the decades ahead with a sharpened research focus that capitalises on our unique strengths, allows us to concentrate on the profound challenges we face as a nation and deliver solutions at scale.\"\n\n\n\n\n\nThe organisation has announced its key focus areas following an 18-month review, which includes supporting a clean, affordable energy transition, addressing climate change, applying advanced technologies such as AI and quantum, mitigating and eradicating biosecurity threats and applying disruptive science and engineering to solve unanswered questions.\n\n\n\n\n\nThe sharpened focus means other research activities would need to be de-prioritised leading to the job cuts, the agency said.\n\n\n\n'These cuts will hurt'\n\nOver the past 18 months, 818 jobs have been cut from the agency, which CSIRO Staff Association secretary Susan Tonks said were deeper than the Abbott government-era cuts.\n\n\n\nLISTEN TO Australia making a dent in plastic packaging pollution on coastlines, CSIRO finds SBS News 03:51 English\n\n\"These are some the worst cuts the CSIRO has ever seen, and they're coming at a time when we should be investing in and building up public science,\" Tonks said.\n\n\n\n\n\n\"We don't need a crystal ball to know these cuts will hurt — they'll hurt families, farmers and our future.\"\n\n\n\n\n\nThe union has called on the government to commit extra funding to the agency to reverse the job losses.\n\n\n\n\n\nConsultation with staff, the union and external stakeholders will occur throughout the period of change, with early engagement to commence this week.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 10
  },
  {
    "url": "https://www.theage.com.au/national/skittish-batter-could-be-englands-weakness-20251119-p5ngp8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Skittish' batter could be England's weakness",
    "publish_date": "Wed, 19 Nov 2025 13:00:46 +1100",
    "category": "sports",
    "authors": [],
    "text": "'Skittish' batter could be England's weakness\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/soccer/socceroos-v-colombia-live-updates-australia-take-on-colombia-at-citi-field-new-york-in-international-friendly-20251118-p5ngex.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Socceroos v Colombia LIVE updates: Australia take on Colombia at Citi Field, New York in international friendly",
    "publish_date": "Wed, 19 Nov 2025 12:59:50 +1100",
    "category": "sports",
    "authors": [
      "Vince Rugari"
    ],
    "text": "Izzo called into action, again. This time Colombia moves the ball quickly through the middle, Luis Diaz receives it, turns, shoots and Izzo dives to his left to keep it out.\n\nAs commentator Andy Harper notes, that’s the key difference between the two sides at the moment - a little bit more enterprise and speed in ball movement. Colombia are doing it better right now. That should surprise nobody.\n\nColombia 0-0 Australia, 24 minutes",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/national/nsw/john-laws-state-funeral-live-updates-australian-radio-broadcaster-to-be-farewelled-in-st-andrews-cathedral-service-20251119-p5ngjt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "John Laws state funeral live updates: Russell Crowe, John Williamson to lead tributes as Australian radio broadcaster farewelled in St Andrew’s Cathedral service",
    "publish_date": "Wed, 19 Nov 2025 12:55:51 +1100",
    "category": "entertainment",
    "authors": [
      "Angus Thomson"
    ],
    "text": "The state funeral is open to the public, and will be livestreamed on the NSW government website.\n\nPremier Chris Minns, or a senior colleague, is among the current and former political leaders expected to attend. Our photographers and reporters are on the ground and will bring you news on the broadcasters, politicians, and celebrities that turn up to St Andrew’s Cathedral today.\n\nSt Andrew’s Cathedral will host John Laws’ state funeral. Credit: Wolter Peeters\n\nOne broadcaster who won’t be attending the service is Kyle Sandilands, who described Laws as “one of the true originals” and a “mentor and a mate” following his death.\n\n“I’ve told the family I’m not attending,” Sandilands told listeners to his KISS FM radio show earlier today.\n\n“I said listen, thank you but after my own father’s funeral, the paparazzi intrusion in such an emotional moment, I thought that I’m never going to another funeral again,” he said. “I won’t be watching the service ... it feels to me like I’ve lost a grandfather. I know that sounds bizarre, but he’s been in my life for a very long time.”\n\nPrime Minister Anthony Albanese, who remembered Laws as an “iconic Australian”, won’t attend. Instead, he will be represented by Assistant Immigration Minister Matt Thistlethwaite.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/australia-news-live-survivors-demand-release-of-epstein-files-ahead-of-critical-vote-nsw-liberals-defy-federal-colleagues-to-retain-net-zero-target-trump-hosts-saudi-leader-20251119-p5ngj0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australia news LIVE: Government reviewing laws to tackle Nazism; Congress overwhelmingly votes to release Epstein files; Israel targets Lebanon with airstrike",
    "publish_date": "Wed, 19 Nov 2025 12:51:10 +1100",
    "category": "finance",
    "authors": [
      "Emily Kaine"
    ],
    "text": "Very early into his first address at the National Press Club as ABC boss, Hugh Marks has made a subtle jibe toward his boss, the broadcaster’s chair Kim Williams, almost a year to the day after he prompted a global storm for taking aim at podcaster Joe Rogan.\n\n“It is true that Australia has a vibrant and generally responsible media market compared to many other places around the world, one that grows with new voices every day. Joe Rogan, for example,” Marks said.\n\nABC managing director Hugh marks at the National Press Club in Canberra. Credit: Alex Ellinghausen\n\nWilliams last year called Rogan “deeply repulsive”, saying people like him “prey on people’s vulnerabilities”, which drew responses from Rogan himself and Elon Musk.\n\nMarks is making his pitch in the broadcasted address eight months into his tenure at the ABC, and 24 hours before it presents its 2026 slate of content in a presentation at its Ultimo headquarters on Thursday.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/property/news/chemist-warehouse-family-splash-80-million-plus-on-toorak-block-20251119-p5ngjl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Chemist Warehouse family splash $80 million-plus on Toorak block",
    "publish_date": "Wed, 19 Nov 2025 12:28:10 +1100",
    "category": "finance",
    "authors": [
      "Elizabeth Redman"
    ],
    "text": "Chemist Warehouse co-founder Jack Gance and his wife Evelynne have bought a Toorak estate for more than $80 million.\n\nThe Rich Listers are tipped to knock down the existing homes on the block and rebuild their dream home on the site.\n\nThe Toorak estate was listed for $80 million to $88 million. Credit: Kay & Burton\n\nThe offering across two titles was listed for sale with a price guide of $80 million to $88 million. A source with knowledge of the deal, but not authorised to comment publicly, said they thought the result was within the range. Another source also not authorised to comment said the Gances were the buyers.\n\nPublic records show the owners of the properties are Weian Zhang, known as Andy, and Miaomiao Zhang, who are directors of property development company V-Leader.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/lifestyle/life-and-relationships/looking-for-inspiration-for-christmas-this-year-find-all-our-gift-guides-in-one-place-20251020-p5n3v3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Looking for inspiration for Christmas this year? Find all our gift guides in one place",
    "publish_date": "Wed, 19 Nov 2025 12:22:53 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Finding the perfect gift on a budget is a big ask. We’ve taken the work out of it for you with our pick of the best, quirkiest and affordable presents for your office, family or friend group secret Santa.\n\nNovember 14, 2025\n\nby Lauren Ironmonger",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/sport/magical-moments-from-scotland-and-iraq-in-wc-qualifiers-20251119-p5ngog.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Magical moments from Scotland and Iraq in WC qualifiers",
    "publish_date": "Wed, 19 Nov 2025 12:08:58 +1100",
    "category": "sports",
    "authors": [],
    "text": "Magical moments from Scotland and Iraq in WC qualifiers\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/lifestyle/peter-james-on-royal-crime-novel-20251119-p5ngoa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Peter James on royal crime novel",
    "publish_date": "Wed, 19 Nov 2025 12:03:12 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Peter James on royal crime novel\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/politics/federal/albanese-has-cut-australia-s-cop-bid-off-at-the-knees-has-anyone-told-bowen-20251119-p5ngm3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Albanese has cut Australia’s COP bid off at the knees; has anyone told Bowen?",
    "publish_date": "Wed, 19 Nov 2025 12:01:20 +1100",
    "category": "finance",
    "authors": [
      "Nick O'Malley"
    ],
    "text": "If Australia has conceded defeat to Turkey over the hosting rights for next year’s COP climate talks, someone should tell Climate Change and Energy Minister Chris Bowen in Brazil, where he is currently advocating for the bid at this year’s meeting.\n\nMixed messages from Australia are not making his job any easier, say observers on the ground.\n\nMixed messages … Chris Bowen and Anthony Albanese. Credit: Alex Ellinghausen\n\nAustralia has been making a case to host the talks, along with its Pacific neighbours, since 2022. With the full support of all the other nations in its Western Europe and others UN group, it has long been seen as the inevitable winner.\n\nAll other nations in the grouping, that is, except for Turkey, which is prosecuting its own campaign to host COP31.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/culture/books/a-visionary-world-of-star-maps-spider-threads-and-animal-spirits-20251114-p5nffg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A visionary world of star maps, spider threads and animal spirits",
    "publish_date": "Wed, 19 Nov 2025 12:00:00 +1100",
    "category": "finance",
    "authors": [
      "Jane Sullivan"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size There are two stories Judith Nangala Crispin tells about her solo journeys criss-crossing the central Australian deserts on a motorcycle with her mongrel dingo Moon on the back. One is a blog that aims to empower women. It covers just one of the 37 crossings she made, and it’s full of adventure and drama. Right from the start, her Suzuki DR650 bike had tyre trouble, and she was stranded for two days in the middle of nowhere. She battled through a desert heatwave, floods, hundreds of kilometres of potholes, corrugations and ruts. Worst of all, Moon was bitten by a snake, and she drove for seven hours through the lightning-streaked night to a vet in Katherine, convinced that Moon would die on the way. Luckily, he survived and they both got safely to the end of the journey at Canberra. The second story about her desert odyssey enters an entirely different visionary world of star maps, spider threads and UFOs in the sky, the spirits of dead animals ascending and a quest to find a caravan of dog-headed beings with bodies made of stars. These are some of the astonishing phenomena explored in Crispin’s illustrated verse novel, The Dingo’s Noctuary (a noctuary is a night diary). “Zoe descends to comfort her daughters, in a burning country”. Credit: Judith Nangala Crispin Crispin’s motorcycle odyssey came to a sad end during her 37th journey. She was driving through Broken Hill when “I was run over by a mum shouting at her kids in a gigantic SUV”. She was left with a traumatic brain injury and damage to 126 muscles down her spine. “The book was only half finished, but I had this terrible sensitivity to light from the computer, it gave me blinding headaches.” So she wrote the second half of The Dingo’s Noctuary on a 1966 Olympia Splendid 33 travel typewriter. “It transported me back to when I was 15 and thought I was going to grow up to be Gertrude Stein.” This is the third book from the acclaimed poet. It’s a big handsome hardback that took more than seven years to complete, and it’s already won or been shortlisted for poetry, art and photography awards even before publication. The poetry alternates with prose, hand-drawn maps, plant pressings and 47 Lumachrome glass prints of dead animals and birds.\n\nAdvertisement\n\n“The book is about what I found,” Crispin says. “As a person with mixed heritage and Aboriginal ancestry but without any cultural authority, acceptance or ties, what relationship could I have directly with country that’s not just a platitude? It took 37 trips to feel I knew enough about country and people and myself to write anything meaningful.” Crispin is a descendant of Bpangerang people from the Murray River, and she also acknowledges heritage from Scotland, Ireland, France, Mali, Senegal and the Ivory Coast. She spent more than 20 years searching for her grandmother’s history, hoping it would make her feel she was “a legitimate Aboriginal person”. But it was a rough search. “I’d known we had Aboriginal ancestry since I was a child. We were all told this is something you never talk about, my grandmother and mother were very emphatic,” she says. “Terrible things would happen to the family if you said anything … There is very little on the white record for some people because the families try so hard to cover it up. I was feeling increasingly illegitimate, I didn’t belong to white culture or Black culture, and I thought, do I keep going on?” One of Crispin’s Lumachrome glass prints, “Enid, connected to Earth by zodiacal light - spider-strings in the old language, the umbilicus of Country.” Credit: Judith Nangala Crispin Along the way she met many “despairing” people on the same quest. “I wanted this book to be for them. You can walk out on the land and form your own relationship. You don’t have to walk through life feeling like half a person because you don’t have your heritage papers in order.” By the time she discovered her link to the Bpangerang people, she had already spent 15 years living with the Warlpiri people in the Northern Territory. She worked for PAW, the remote Indigenous media organisation, mentoring, working with an app for suicide prevention and with the painters: “It was the painters who were trying to free me from dogma.” The Warlpiri are her adopted people and she took their skin name Nangala as a sign of respect. ‘One clear night, Lilian followed the Milky Way out toward Orion. All her life she had stared up at Betelgeuse, the giant red star, and felt it staring back’: Crispin’s Lumachrome Glass Print and chemigram of roadkill Australian Masked Owl. Credit: Judith Nangala Crispin\n\nAdvertisement\n\nBeloved Warlpiri friends and mentors appear often in The Dingo’s Noctuary, and she has given them their own voices. One of them is Lily, “one of the most miraculous people I’ve ever met”. She lived in a humpy until she was 98, and at over 100 she was taken to a nursing home with dementia. The first time Crispin visited her there, Lily had decided she was a new mum to an Aboriginal baby doll and a couple of toys. She was having trouble breastfeeding them, so Crispin got her a bottle. Lily told her many stories: one was about a mountain, and if you went past it, you would find dog-headed people with bodies made of stars. Crispin honoured her stories and made them a feature of her journey: “I told Moon those stories when I was driving him to the vet, trying not to be a complete nervous wreck.” She knew she wanted to talk about the land and people as they were, without romanticising, “but I didn’t want the book to have this weight of suffering and poverty and hopelessness. It’s about the love that people out in the desert have for that place, and the love I had, which came through being able to see what they saw.” The Warlpiri women taught her that a woman can stand up strong after birth, and at death too, grief-stricken but not shattered. “So I thought I’d try and honour the dead, starting small with animals and plants and work my way up.” Crispin and Moon on their motorbike. Credit: Judith Nangala Crispin The first roadkill she collected for her portraits was a tiger snake. The process of decay gave out a light that exposed the image on the page. The images can be put in an art gallery and honoured the way we honour saints in a church, she says. “I portrayed them as ascending back to their ancestors in the sky. I sat with more than 500 cadavers as they bloated up and broke down and then buried them. There’s a smell, but you can ignore it. And the rest feels kind of holy.” T\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/culture/books/faith-poetic-precision-and-visionary-charge-patti-smith-s-new-memoir-20251117-p5nfzb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Faith, poetic precision and visionary charge: Patti Smith’s new memoir",
    "publish_date": "Wed, 19 Nov 2025 12:00:00 +1100",
    "category": "entertainment",
    "authors": [
      "Michael Dwyer"
    ],
    "text": "Her earliest memories shimmer as if through a looking glass in the back of a wardrobe: the doll rescued from a cliff; the maple bureau whose knobs are dials to infinity; the rat-infested underworld she patrols with the neighbourhood children; old Aggie across the hall with her dark green book of Irish fairytales.\n\nIt’s a spark poets and songwriters know well: sound as the seed of a world more felt than understood. In this latest in her series of gloriously transporting memoirs, Smith follows that scratch into the awkwardness and beauty of childhood, the place where “the kingdom of the infinite imagination” first opened beneath her feet.\n\nThe crumb trail begins at once. “The pen scratches across the page rebel hump rebel hump rebel hump. What do those words mean, asks the pen. I don’t know, says the wrist.” That’s the bread of angels: the mundane summoning the mystical. Patti Smith is the go-between, setting the vibration to language, trusting meaning will come.\n\n“Mine was a Proustian childhood, one of intermittent quarantine and convalescence,” she writes. A dose of Asian flu intensifies her insistence on divine structure. Her mother’s emptied tip jar and the Puccini box set on the dresser are “a marriage of art and sacrifice” that literally saves her nine-year-old life.\n\nThe outer world she describes as her struggling family bounces between Philadelphia apartments is no less heightened. “I was happy there observing the last vestiges of the 1940s, soon to succumb to modern times,” she writes. “There were horse-drawn wagons, the iceman, a ragman, and an organ grinder with a monkey with a little red cap.”\n\nPatti Smith in 1969. Credit: Norman Seeff\n\nShe’ll return to the loss of that paradise later, but her spirit world never falters, even as she trades up her mother’s devotion to the Jehovah’s Witnesses for Picasso, Modigliani and Sargent at the Philadelphia Museum of Art. “I believed in the Creator, the many tongues of nature, the moral lessons of fairytales, the language of trees, and the clay of the earth … God, the infinite realm, Jesus, the human bridge, the artist, the material mouthpiece,” she writes. Breadcrumbs are everywhere: animals, constellations, fragments of ancient alphabets.\n\nA teenage pregnancy and a broken family nest hurl her towards New York, and the part of her story fans will know. Mapplethorpe, Shepard and the Chelsea Hotel; Dylan and Burroughs and Lenny Kaye, terrain that crisscrosses her earlier books from fresh angles. “Claiming the right to create without apology from a stance beyond gender or social definition” is one of her cascading manifestos.",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://au.news.yahoo.com/flight-chaos-air-traffic-control-110035994.html",
    "title": "Major update after Aus airport chaos",
    "publish_date": "2025-11-18T23:25:08Z",
    "category": "finance",
    "authors": [],
    "text": "A technical issue with air traffic control communications systems has created flight chaos at three major airports around Australia.\n\nAirservices Australia confirmed it was working to address an issue with the systems at its Melbourne Air Traffic Service Centre on Tuesday.\n\nAn Airservices Australia spokesman said safety, air traffic control and communication between air traffic controllers and aircraft were unaffected.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“The main operational capability being impacted is that we have reverted to manual entering of flight plans in some circumstances,” a spokesman said.\n\nAirservices Australia confirmed it was working to address an issue with the systems at its Melbourne Air Traffic Service Centre on Tuesday. Picture: NewsWire / Gaye Gerard\n\n“To maintain safety while we work to rectify the issue, traffic management measures have been implemented at Melbourne, Perth, and Adelaide Airports.”\n\nArrivals at Melbourne Airport experienced delays for more than an hour from 5pm on Tuesday afternoon while technicians worked to fix the problem.\n\nA Perth Airport spokesman confirmed some arrivals and departures had been delayed.\n\nAn Adelaide Airport spokesman said some flights were delayed up to an hour and would continue to have a knock on effect for later flights.",
    "source": "Yahoo",
    "cluster_id": 40
  }
]