[
    {
        "url": "https://www.9news.com.au/national/kunjin-virus-mosquito-borne-disease-detected-in-nsw/6059fba1-fd06-4b0d-82af-f218447c9a2c",
        "title": "Second deadly mosquito-borne virus detected in days",
        "publish_date": "Wed, 03 Dec 2025 23:50:57 +0000",
        "category": "lifestyle",
        "authors": [
            "Dec"
        ],
        "text": "Just days after Japanese encephalitis was detected for the first time this season in Victoria , a second mosquito-borne virus has reared its head across the border.\n\nNSW Health said Kunjin virus had been detected at Cowra in the state's west.\n\nThe virus was found in a blood sample from a sentinel chicken on November 20, collected as part of NSW Health's routine surveillance.\n\nA potentially deadly mosquito-borne virus has been detected in NSW. (Getty)\n\nNSW Health's director of health protection Dr Stephen Conaty said the detections so early in the summer season were concerning.\n\n\"Mosquito numbers will likely increase with warmer weather, and we remind everyone in NSW to protect themselves against mosquito bites, which can cause diseases such as Japanese encephalitis and Murray Valley encephalitis, and infection with Kunjin virus, Ross River virus and Barmah Forest virus,\" Conaty said.\n\nThere are now 60 NSW LGAs that are considered to be higher risk of Japanese encephalitis virus.\n\nREAD MORE: Scorching heatwave to smother major city as hot air mass moves across state\n\nA vaccine for JE is available and free for eligible people. (Getty)\n\nResidents and travellers to these LGAs should take particular care to avoid mosquito bites.\n\n\"There is a safe, effective and free vaccine to protect against Japanese encephalitis (JE),\" Conaty said.\n\n\"This vaccine is free to anyone who lives or routinely works in these 60 LGAs west of the dividing range and in northern NSW, and for people who work in some other high-risk occupations.\"\n\nJE vaccine is available through general practitioners, Aboriginal health services and pharmacists.\n\nPeople who meet the eligibility criteria should make an appointment ahead of time and let the provider know it is for the JE vaccine.\n\nThese providers may require a few days' notice so they can order the vaccine and may charge a consultation fee.\n\nA booster dose may be recommended for some people with ongoing risk of exposure, one to two years after completing their primary course.\n\nPeople are urged to use insect repellent. (Getty Images/iStockphoto)\n\nOther than the JE vaccine, there is no vaccination or specific treatment for Kunjin virus or other mosquito-borne diseases in Australia.\n\nMost people infected with Kunjin virus will suffer no symptoms.\n\nThose who do may suffer fever, enlarged lymph nodes, rashes, swollen and aching joints, headaches, muscle weakness, and fatigue.\n\nThose who do show symptoms should seek medical treatment immediately.\n\nSevere infections can lead to lifelong neurological complications and even death.﻿\n\nThe best way to avoid infection is to avoid being bitten by mosquitoes, which are more active between dusk and dawn.\n\nPeople can take actions such as applying insect repellent to exposed skin, wearing long sleeves and leggings with socks and covered footwear, and staying inside at dawn and dusk when mosquitoes are most active.﻿\n\nMosquito-borne diseases cannot be transmitted directly between humans or from any other animal.\n\nInformation on eligibility for a free JE vaccine is available online here .\n\nInformation on mosquito protection can be found here .﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/first-guardian-master-trust-liquidators-warning-for-investors/8fb33728-da26-45e3-809f-2609eb1b39b5",
        "title": "Stark outlook for First Guardian investors as $336k Lamborghini, brewery sold",
        "publish_date": "Thu, 04 Dec 2025 00:49:13 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "L﻿iquidators of the company behind the collapsed superannuation fund First Guardian Master Trust are warning they face an unphill battle to recover hundreds of millions of dollars owed to investors.\n\nFirst Guardian Master Trust entered liquidation this year, taking about $446 million from 6000 people with it.\n\nAmong them are business owners, parents and mum and dad investors, many of whom now face an uncertain financial future.\n\nThe Australian Securities and Investments Commission (ASIC) began investigating Falcon Capital in 2024. (Jim Rice)\n\nIn an update this week, liquidators from FTI Consulting said just $1.6 million has been recovered to date after they were appointed to manage First Guardian's responsible entity Falcon Capital.\n\nAmong that $1.6 million was ﻿$336,646 from the sale of a 2023 Lamborghini Urus and $450,000 from the liquidation of craft brewer Fox Friday Brewing.\n\nLiquidators ﻿Ross Blakeley and Paul Harlond said \"a substantial shortfall of asset recoveries to outstanding and unredeemed funds invested is likely\".\n\nThey warned unitholders that \"only a partial return of unredeemed funds may eventuate.\"\n\nThe report said many investments had been determined to be of no value.\n\nRemaining investments are \"largely illiquid, intangible assets, located in foreign jurisdictions, and involve related parties\" of Falcon and First Guardian or parties that had links with those directors.\n\nA 2023 Lamborghini Urus was sold for $336,646 as part of the recovery. (Lamborghini)\n\nThe liquidators said they have drawn up subpoenas for a list of more than 150 parties where Falcon monies are believed to have been paid.\n\nHowever, the process was expected to take \"considerable time\" to finalise.﻿\n\nCorporate regulator ASIC began investigating Falcon Capital, First Guardian and director David Anderson in late 2024.\n\nAccording to ASIC, most of the 6000 investors accessed First Guardian through superannuation platforms Diversa, Netwealth and Equity Trustees.\n\nIt alleges investors were lured into transferring their super by \"lead generators\" who referred them to personal financial advice providers.\n\nASIC says they were \"advised to roll their superannuation assets into a retail choice superannuation fund, and then invest into First Guardian\".",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/jacinta-allan-victoria-1000-public-service-jobs-to-go-in-huge-budget-cuts/3aed8f6d-4a57-4006-a356-9334d91e4047",
        "title": "Victorian government to slash 1000 jobs in brutal $4bn cost-cutting mission",
        "publish_date": "Wed, 03 Dec 2025 23:26:18 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "V﻿ictoria's public service sector will be heavily slashed by 1000 jobs as part of a desperate bid to strip back spending in the debt-riddled state.\n\nThe cuts will include 332 executive and senior jobs after the review discovered the workforce was too \"top heavy\" and recommended reducing the level of leadership roles.\n\nIt is expected the brutal cost-cutting measures will free up more than $4 billion over four years and the recommendations will be implemented immediately.\n\nAround 330 executive and senior jobs will be axed from the state government﻿ as part of the Helen Silver review. (Simon Schluter)\n\nThe number of senior VPS5 and VPS6 positions will be reduced, saving an estimated $125 million over the forward estimates.\n\nThe Victorian government said it will rebalance the workforce back to pre-pandemic levels, which it claims will allow for more entry-level roles such as nurses, teachers and police officers.﻿\n\nNearly 30 government entities and boards will also be either wound down, merged or abolished, among them Sustainability Victoria, Cladding Safety Victoria, Victorian Marine and Coastal Council and the Road Safety Camera Commissioner And Reference Group.\n\nVicHealth and Healthshare Victoria will also be folded ﻿into the Department of Health in a move to streamline public services following the forensic spending review.\n\nThe cuts will also limit spending on consultants and labour hire.﻿\n\n\"Victorian families are watching every dollar in their household budgets and they expect their government to do the same, and that is exactly what we are doing,\" Premier Jacinta Allan said today.\n\nAllan said the cuts aim to help public service workers remain \"laser-focussed\" on services including education, healthcare, community safety and cost of living measures.\n\nShe said the Victorian government rejected some of the Silver recommendations which would have impacted frontline services.\n\nREAD MORE: Meta begins locking out Australian children from social media accounts\n\nAllan said the state's public service sector is made up of \"strong, professional\" people. (Nine)\n\n\"I want to be clear today, not every recommendation has been accepted,\" Allan added.\n\n\"﻿We have not accepted them all because we do not want to cut into frontline services.\n\n\"The work we've been doing and the announcements we're making today are about continuing to keep the public service laser-focussed on continuing to deliver those services.\"\n\nAllan acknowledged that the state's public service sector is made up of \"strong, professional\" people.﻿\n\n\"This is about looking at how we build our public sector for the future,\" Allan said.\n\nThe state avoided even deeper cuts after Treasurer Jaclyn Symes flagged that between 2000 to 3000 jobs could be lost when the $2 million Helen Silver review was commissioned back in February.\n\nVictoria's p﻿ublic service industry comprised around 315,000 full-time staff as of June 2024.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sand-product-recall-kmart-target-asbestos-fears/2725eed3-bc74-45b0-af61-ae0cd9f17a10",
        "title": "Sand product recalled from Kmart and Target over asbestos fears",
        "publish_date": "Wed, 03 Dec 2025 21:21:43 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Another play sand product for kids has been pulled from shelves around the country over asbestos fears.\n\nA recall notice has been issued for the Make Your Own Unicorn Sand Ornament, sold at Kmart and Target.\n\nThe products contain loose, coloured play sand for children, and empty, unicorn-shaped ornaments.\n\nThe Make Your Own Unicorn Sand Ornament has been recalled from Kmart and Target. (Supplied)\n\nThe ACCC's product safety watchdog said the sand may include asbestos﻿, a prohibited substance in Australia.\n\n\"The products may cause a risk to health as asbestos has been detected in some samples after laboratory testing,\" the recall notice said.\n\nHowever, the risk of any asbestos in the sand being either airborne or fine enough for inhalation is \"low\".\n\nREAD MORE: Meta begins locking out Australian children from social media accounts ﻿\n\nThe product was sold at Kmart and Target outlets. (Getty)\n\n\"Importantly, respirable asbestos has not been detected in any of the tested samples,\" the notice said.\n\n\"The release of respirable asbestos fibres is unlikely to occur in its current state, unless the sand is processed by mechanical means such as crushing or pulverising.\"\n\nHowever, people are urged to stop using the product immediately, and follow the online guidelines for asbestos disposal .\n\nThey should also contact Kmart or Target for a full refund.\n\nMore details and the contact information for both chains can be found online here .﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/thailand-eases-afternoon-alcohol-ban/f3f9fd75-b134-4a10-8267-290201c94eeb",
        "title": "Thailand eases alcohol ban to attract more tourists",
        "publish_date": "Thu, 04 Dec 2025 01:07:47 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Thailand has temporarily eased a ban on the sale of afternoon alcoholic drinks in a move aimed to attract more tourists.\n\nRestaurants, bottle shops and other authorised outlets can now sell beer, wine and spirits from 2pm to 5pm as part of a six-month trial, the BBC reports.\n\nOverseas tourists, including Australians, have often been confused by the afternoon prohibition of alcohol sales ﻿in Thailand, a top destination for partygoers.\n\nTourists in Thailand will find buying an afternoon alcoholic drink easier after authorities eased a decades-old ban. (AP Photo/Sa (AP)\n\nIt was started in 1972, partly to deter public servants from drinking during work hours.\n\nAlcohol sales in Thailand are now permitted from 11am to midnight during the next 180 days while an expert panel examines its impact.\n\nPreviously, breaking the ban carried the risk of a fine up to 10,000 baht﻿ ($437).\n\nThe change comes in the lead-up to the Christmas and the New Year holiday, both peak periods for tourists.﻿\n\nNew Thai Prime Minister Anutin Charnvirakul has pledged to kickstart the economy by reviving tourism following years of political unrest.\n\nLocal beer brands Chang and Singha are favourites among overseas visitors,﻿\n\nAbout 800,000 Australians visit Thailand every year, according to Tourism Research Australia.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/social-media-influencers-medical-advice/2516140b-e49b-4ddc-ae7a-e5734a43bae5",
        "title": "Experts caution against taking medical advice from influencers",
        "publish_date": "Wed, 03 Dec 2025 23:54:09 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Experts have called for greater governance on potentially misleading medical advice shared by influencers on social media.\n\nWhilst over 40 per cent of young adults in the USA take advice from influencers, a report in The BMJ claims people are at risk of getting incorrect or biased information on important medical issues.\n\nFor example, Kim Kardashian encouraged her 360 million followers to have a full-body screening with magnetic resonance imaging.\n\nREAD MORE: ﻿ Scorching heatwave to smother major city as hot air mass moves across state\n\nKim Kardashian has previously promoted medical treaments with no proven benefits. (Getty)\n\nWhile scans can have a benefit for people at a high-risk of certain conditions it is also linked to overdiagnosis and unnecessary medical interventions.\n\nThe fourth overlapping biases, according to the authors, include \"limited expertise, industry influence, entrepreneurial interests, and personal belief.\n\n\"Such advice can cause psychological, physical, financial, and systemic harm,\" the report continued.\n\nThe report says influencers create a tight bond and relationship with their followers, with the sharing of real-life experiences helping foster a connection.\n\nThey can also help break stigmas surrounding certain medical conditions.\n\nLily Mae, also known as @chronicallylil on Instagram, documents her journey in navigating multiple medical conditions. (Instagram/@chronicallylil)\n\nHowever, the report argues more government oversight is required to ensure influencers do not mislead their followers or promote unethical practices.\n\nAustralia already has some laws and regulations in place, banning paid health testimonials.\n\nSome influencers believe medical experts should work more closely with them, believing they can bridge a key gap.\n\n\"I wish healthcare professionals would listen and engage more with patient communities online,\" Lily Mae, whose Instagram account @chronicallylil shows her struggles with Ehlers-Danlos syndrome, endometriosis, and vascular compression syndrome.\n\n\"There's such a wealth of firsthand knowledge being shared—real stories, symptoms, and lived experiences that could help improve care if more providers took the time to understand them.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/grant-hackett-ceo-secrets-to-success/7d380e6d-1d74-47a6-b443-481147fb6954",
        "title": "Grant Hackett was on top of the world at age 20. This is what he wishes he'd known",
        "publish_date": "Wed, 03 Dec 2025 18:57:19 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Exclusive: In this nine.com.au series, we'll be talking to some of Australia's smartest and sharpest ﻿entrepreneurs, founders and CEOs to find out what makes them tick - and what advice they'd have for anyone starting out.\n\nGrant Hackett was just 20 when he won his first gold medal at the Sydney Olympics.\n\nHe scored another gold, three silver, and two bronze across his Olympic career, before trading his speedos for spreadsheets when he retired from swimming in 2008 and ﻿dove into the world of finance.\n\nGrant Hackett was 20 when he won his first Olympic gold medal; now he's chief executive of Generation Development Group. (Eamon Gallagher/AFR)\n\nToday, he is the chief executive of Generation Development Group and his achievements go far beyond how he performed in the pool in his 20s.\n\nThese are his secrets to success.\n\nHow do you start the day to set yourself up for success?\n\nI always wake up at the same time, normally 5.15am every morning. The only time I don't do that is on the weekends, that's where I get my extra bit of recovery. I noticed that in my swimming career, when my sleep periods were different it just made me flat, so consistency of wake-up time is really important.\n\nI have a series of drinks that I have, probably just because of my previous career. I've got a longevity mix, creatine, glutamine, amino acids ... and I have that pre-made the night before so I don't have to think about it in the morning, because I'm not a morning person.\n\nEven though everyone thinks I should be because my former career, I hate early mornings, so I have to make it as easy as possible. I've also got a protein shake that's already set up, I have a water bottle, I'm really quite strict on all of that stuff.\n\nI'll usually do a 45-minute workout in the morning and then the last thing I do after getting ready is always have breakfast with the kids. I'm not the person who tries to get to the office at 7am and get everything done, because I have really young kids and I always try to have breakfast with them.\n\nThat's my time at the table with them on weekdays and I feel quite sad when I don't get that time before I leave for work.\n\nThese days Hackett considers himself a 'corporate athlete' and some of his habits are holdovers from his swimming career. (Dallas Kilponen)\n\nWhat are three daily habits you always stick to?\n\nWhat I always do when I finish my work day is write a 'to do' list before I leave, which will be my first things to tick off the next day. I find that, for me, is an important way to disconnect from the office when I leave. If I don't do that, I'll leave being too analytical about everything else I've got to do and I won't slow down. That, for what I call the corporate athlete, is really important because if you don't get all those little things right like winding down, sleeping well, your cognitive capacity is just not as good.\n\nI also always leave 15 minutes between meetings, because a lot of the time meetings go over and I want to give myself enough time to prepare mentally for the objectives of the next meeting. I don't like meetings for meetings' sake. I like to be really clear on what we're doing there, what we're trying to achieve, and what the actions are. So I always give myself 15 minutes in between each of those, and I always want an agenda for every meeting that I have too.\n\nThe other thing that I'm really, really conscious of as chief executive of a pretty large business is that your energy matters. Even if I'm having a rough day, like all of us do every now and again, I'm always very, very self-aware that the energy I bring in can really set the tone for a lot of other people. So I say good morning and make eye contact and ask how people's weekends were, because that stuff actually matters. It sounds like small talk but it's not, it's setting the energy and tone in the business.\n\nHackett made a massive career change from swimming to finance and admitted it wasn't easy. (AFR/Andrew Quilty)\n\nLots of Aussies are looking for a career change — what small action can help them get ahead of other candidates?\n\nDevelop relationships with people in a field that you're interested in, or at the very least people who are successful like serial entrepreneurs, because they will give you ideas and insights. I love it when someone comes to me and says, 'this is what I'm thinking about doing, I'd love your advice', or 'I'd love some help'.\n\nAnd be willing to start at the bottom rung of the ladder. Be really, really willing to eat humble pie and start again.\n\nI got day two into finance, this is going back nearly 20 years, and I could win World Championships and Olympics and break world records but I wasn't even the best at the table [in finance]. As soon as I realised that I was like, 'what do I need to do to get to the next level?'. I could have given up. I could have just gone and done talking gigs or other bits and pieces to generate income. I didn't need to be in a completely new field. But I was at the bottom rung of the ladder and recognised what I needed to do to get up that ladder, to get to a position that I feel really proud of. And as soon as you recognise that, you move up surprisingly quick.\n\nWhat financial myth do you wish you never bought into?\n\nIn my teenage mind, when I started trading [stocks], I thought there was going to be two or three stocks that would be huge. I just thought, surely you pick a few winners and all of a sudden it's going to be worth millions of dollars.\n\nThat was probably the myth that was broken very, very quickly for me when I burned some cash on the dot com boom/bust. I realised pretty quick that there's no one stock that is a get rich quick scheme.\n\nThere are no shortcuts in anything I've done that's had some sort of success attributed to it, whether it's financial success, or in sport, or in business. You've got to be willing to do the hard work and maybe look like an overnight success eventually. But even the things that look like they grow quick, they're still really, really hard.\n\nAt 20, Hackett thought he 'knew everything'. He knows better now. (Dallas Kilponen)\n\nWhat do you wish you could tell your 20-year-old self?\n\nThere's a few things that I probably couldn't put in this!\n\nI would tell myself that when things are going really well, and you feel like you're winning, and life's good, it never lasts. So enjoy it, but recognise that nothing ever stays there.\n\nAnd it's true for the opposite; when it hits the fan and things go really, really bad, and you feel like you're getting nowhere in life, and you've hit rock bottom ... it's never that bad. There's always an opportunity, and you can always get back to where you want to be if you're willing to do the work.\n\nI think if I could tell 20-year-old self that I would have saved myself years of anxiety and ups and downs. But my 20 year-old-self thought he knew everything.\n\nIt's so funny, I remember I said my 20s that nothing could go wrong. Everything went right, I felt like life was easy. My 30s were the exact opposite – divorce, missing my kids, bad publicity. And then my 40s are when you actually start to get life ... it's a really nice stage of life.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/social-media-ban-australia-how-it-will-be-enforced-explained/ec113782-085b-4510-b3b6-1b264e0f587e",
        "title": "How Australia's world-leading social media ban will be enforced",
        "publish_date": "Wed, 03 Dec 2025 18:37:01 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Later this month, Australia will implement a world-first ban on social media for children , barring anyone aged under 16 from accessing certain websites and apps.\n\nHowever, questions have been raised about how the ban will actually be enforced, and the government itself has admitted it won't be perfect in keeping underage users off the blocked sites.\n\nThis is what we know about how the ban will work.\n\nChildren younger than 16 will be banned from social media on December 10. (AP Photo/Rick Rycroft)\n\nWho is responsible for keeping children off social media?\n\nResponsibility for enforcing the ban, which comes into effect on December 10, has been placed on social media companies.\n\nIf children aged under 16 do find their way onto one of the banned sites, they and their parents won't face any penalties.\n\nInstead, the federal government's eSafety agency can take action against tech companies that aren't taking \"reasonable steps\" to keep underage users off their platforms.\n\nThe list of age-restricted platforms includes Facebook, TikTok, and Reddit. (Getty)\n\nWhat are those 'reasonable steps'?\n\neSafety hasn't specified exactly what social media companies need to do to avoid falling foul of the new laws.\n\n\"There is no one-size fits all approach for what constitutes the taking of reasonable steps,\" its regulatory guidance states.\n\nIn a nutshell, though, from December 10, providers need to deactivate or remove the accounts of users aged under 16, and stop those children from being able to immediately create new profiles to get around the ban.\n\nThis includes using geolocation data to check whether a user is an Australian resident, and verify that account holders are 16 or older.\n\nWhile social media platforms can confirm ages by checking someone's government-issued ID, they're required to offer at least one alternative so users aren't forced to hand over their driver's licence or passport.\n\nSocial media companies like Meta are responsible for keeping underage users off their platforms. (AP Photo/Rick Rycroft)\n\nCompanies have already begun rolling out age assurance technology, which can estimate and infer someone's age.\n\nThe exact methods vary, but range from getting users to take a video selfie to analysing account behaviour and other metadata.\n\nThe government has acknowledged the ban won't be perfect and some children will get around it, but says it will have an overall positive impact.\n\n\"Just because there are under 18s who will drink alcohol today doesn't mean that it's not a good, important law that we have that you cannot drink under 18,\" Communications Minister Anika Wells said.\n\n\"This is about creating cultural change, and yeah, there's recalcitrance… we are creating a rule that everybody's off (social media), and the people that get around it, they will be the outliers.\"\n\nAnika Wells has acknowledged some children will still manage to access social media despite the ban. (Kate Geraghty)\n\nThere's also a range of requirements for companies around the data they collect, making sure they don't discriminate against diverse groups, and that users have an avenue to appeal decisions made against them.\n\nThe full eSafety guidance can be found here .\n\nWhat happens if social media companies don't enforce the ban?\n\nIf a social media company breaks the age restriction laws, including by failing to take reasonable steps to keep underage children off its platforms, it will face a fine of up to $49.5 million.\n\neSafety can also take the offending company to court to seek injunctions or undertakings from it in response to any breach.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/double-demerits-2025-christmas-new-year-when-do-they-start-explainer/3f943681-39c0-4281-8e38-ace4f87b5620",
        "title": "The one state where this could cop you double demerits year round",
        "publish_date": "Wed, 03 Dec 2025 03:58:12 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Double demerits will soon come into effect for the Christmas holidays, but not all Australian states and territories enforce them equally.\n\nSome impose double demerits year-round, while others opt out entirely – though drivers from some states can still cop double demerit penalties across borders.\n\nHere's when and where ﻿double demerits will be enforced over the 2025 Christmas holidays.\n\nREAD MORE: Australia Post reveals deadline for mailing Christmas parcels\n\nD﻿ouble demerits are on the way for NSW, the ACT and WA ahead of the holidays. (Getty)\n\nNSW, the ACT and WA\n\nNSW, the ACT and WA impose double demerits over most holiday periods and long weekends, including:\n\nthe Christmas and New Year period\n\nAustralia Day\n\nEaster\n\nAnzac Day﻿\n\nKing's Birthday\n\nLabour Day\n\nstate-specific public holidays (e.g. WA Day)﻿\n\nDouble demerits only apply to specific road offences.\n\nIn NSW, they are: speeding, using a mobile phone while driving, riding without a helmet, not wearing or incorrectly wearing a seatbelt (drivers and passengers).\n\nNSW drivers can cop double demerits if their passengers aren't wearing a seatbelt correctly. (9News)\n\nThe same rules apply in the ACT, and a few additional offences are subject to double demerits in WA.\n\nThey are: ﻿﻿drink or drug driving, running a red light, driving a vehicle fitted with a device designed to evade detection by a speed camera, and driving in a manner to evade detection by a speed camera.\n\nDouble demerits will be enforced on the following dates over the Christmas holidays:\n\nNSW: December 24 to January 4\n\nACT: December 24 to January 4\n\nWA: December 19 to January 4\n\nQueensland\n\n﻿Queensland also imposes double demerits, though in a slightly different way.\n\nInstead of limiting double demerits to holiday periods, they are enforced year-round ﻿and apply to motorists who repeatedly commit specific offences.\n\nThese offences include:\n\n﻿speeding more than 20km/h over the speed limit\n\nmobile phone offences\n\ndriver seatbelt offences\n\nseatbelt offences for passengers under 16\n\nmotorcycle helmet offences\n\nREAD MORE: How to maximise public holidays and make the most of your annual leave in 2026\n\nDouble demerits apply year-round in Queensland. (Getty)\n\nDrivers will have double demerits applied if they're caught repeating an offence from the same offence group two or more times within a year.\n\nFor example, a driver caught on their phone will receive double demerits if they are caught using it a second or subsequent time within 12 months.\n\nVictoria, SA, NT and Tasmania﻿\n\nUnlike ﻿the other states, Victoria, SA, NT and Tasmania﻿ don't impose double demerits at all.\n\nBut that doesn't mean drivers are totally in the clear.\n\nMotorists who hold a Queensland licence could still cop double demerits if they're caught committing an eligible offence in another state or territory.\n\nThat's because Queensland drivers ﻿who commit demerit-point offences interstate are subject to the demerit points that apply in their home state for the same offence.\n\nThe same goes for drivers from NSW, ﻿who are also subject to double demerits in their home state if they're caught breaking the rules across state lines.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-04/girl-guiding-women-institute-to-stop-membership-trans-women/106100184",
        "title": "Leading groups for UK women and girls to close doors for trans women",
        "publish_date": "Thu, 04 Dec 2025 01:56:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Transgender women will no longer be allowed to join two of the UK's leading groups for women and girls, in the aftermath of a Supreme Court ruling.\n\nIf you or anyone you know needs help: Transcend Australia (Supporting Australian families and their trans, gender diverse and non-binary children and young people).\n\nKids Helpline on 1800 551 800\n\nThe Women's Institute and Girlguiding announced the changes within days of each other, noting the difficulty of their respective decisions.\n\nIn April, the Supreme Court ruled that a woman was someone born biologically female, excluding transgender people from the legal definition.\n\nThis judgment related to whether a trans woman with a gender recognition certificate (GRC), a formal document that gives legal recognition of someone's new gender, was protected from discrimination as a woman under Britain's Equality Act.\n\nBoth groups said their recent decisions were made with legal advice, and in the case of the Women's Institute, the group said the judgment meant it could \"no longer legally offer formal membership to transgender women\".\n\nWomen celebrate the April Supreme Court ruling. ( )\n\n\"As an organisation that has proudly welcomed transgender women into our membership for more than 40 years, this is not something we would do unless we felt that we had no other choice,\" The Women's Institute CEO Melissa Green said.\n\nShe said the organisation would continue to support trans women outside of formal membership.\n\nThe move was made with a \"heavy heart\", according to a joint statement from the Girlguiding heads.\n\n\"This is a decision we would have preferred not to make, and we know that this may be upsetting for members of our community,\" it read, noting adult helper roles were still open to all.\n\nBoth statements can be read in full below:\n\nGirlguiding From Chair of Trustees Denise Wilson, CEO Felicity Oswald, and Chief Guide Tracy Foster: Following April's Supreme Court decision relating to sex and gender, many organisations across the country have been facing complex decisions about what it means for girls and women and for the wider communities affected. Girlguiding's governing charity documents set out that the membership and people who benefit from our organisation are girls and women. The Supreme Court ruled that girls and women are defined in the Equality Act 2010 by their biological sex at birth. Following detailed considerations, expert legal advice and input from senior members, young members and our Council, the Board of Trustees for Girlguiding has made the difficult decision that Girlguiding must change, following the Supreme Court's ruling. From today, 2 December, it is with a heavy heart that we are announcing trans girls and young women will no longer be able to join Girlguiding. This is a decision we would have preferred not to make, and we know that this may be upsetting for members of our community. There will be no immediate changes for current young members, but more information will be shared next week. Most adult roles, including unit helpers, district helpers and administrative support, are already open to all, so we are confident that no volunteers will have to leave the organisation. Girlguiding believes strongly in inclusion, and we will continue to support young people and adults in marginalised groups. Over the next few months, we will explore opportunities to champion this value and actively support young people who need us. A new taskforce will explore ways to support everyone and create new opportunities. Members of all ages are encouraged to contribute to this taskforce to help us shape a future organisation that is inclusive. Girlguiding is proud to be the UK's largest youth organisation dedicated to girls and is focused on creating an equal world for girls and young women. For over 100 years, we have been a welcoming space for all girls to have new experiences, support their communities, build friendships and grow their confidence. While Girlguiding may feel a little different going forward, these core aims and principles will always endure and we remain committed to treating everyone with dignity and respect, particularly those from marginalised groups that have felt the biggest impact of this decision. The Women's Institute From CEO Melissa Green: It is with the utmost regret and sadness that we must announce that, from April 2026, we can no longer offer formal membership to transgender women. As an organisation that has proudly welcomed transgender women into our membership for more than 40 years, this is not something we would do unless we felt that we had no other choice. To be able to continue operating as the Women's Institute — a legally recognised women's organisation and charity — we must act in accordance with the Supreme Court's judgment and restrict formal membership to biological women only. However, this change is only in respect to our membership policy and does not change our firm belief that transgender women are women. We know that many of our members will find this decision extremely painful. We have been actively seeking alternative ways — outside of formal membership — of continuing to extend fellowship, sisterhood, and support to transgender women, who have been such an important part of our WI family. In April 2026, we will be launching a national network of local WI Sisterhood groups, which will offer monthly opportunities for all people, including transgender women, to come together to socialise, learn from each other, and share their experiences of living as women. Our activity outside of formal membership has always and will continue to play a vital role in creating welcoming spaces where all women can come together to learn, share ideas, and work together to improve lives in our communities. We remain absolutely committed to delivering on that mission.\n\nMove may be influenced by anti-trans campaigners\n\nThe interpretation of the ruling has been disputed by legal advocacy group Good Law Project, which says the law does not \"require trans exclusion\".\n\nIn the case of Girlguiding, the GRC is only available to over-18s.\n\nGood Law Project's trans rights lead, Jess O'Thomson, believed the move came after intense lobbying from \"anti-trans campaigners\".\n\nUK court rules a woman is defined by the gender at birth The court upheld an appeal by a campaign group on whether transgender women are legally women under equality legislation.\n\nIn 2018, anti-trans group Fair Play for Women launched a petition asking Girlguiding to review its policy for trans members.\n\n\"They thought after the Supreme Court decision in April that the whole world would suddenly agree with them,\" O'Thomson said, of trans opponents.\n\n\" But they have misunderstood the law, as well as human nature. \"\n\nThe legal charity said it was prepared to offer legal and financial backing to organisations willing to challenge the ruling's interpretation.\n\nExclusion a 'cruelty', advocates say\n\nHelen Belcher, CEO of TransActual, a leading UK transgender advocacy group, said charities could not afford to fight legal claims surrounding the ruling's interpretation.\n\nShe added the decisions would have an innumerable impact on Britain's \"beloved charities and national institutions\".\n\n\"Our thoughts are with the people who may be outed by their exclusion, or lose access to their vital social groups and support networks at a time when those are more important than ever,\" she said.\n\n\"This government must be held responsible for the long-lasting damage they are doing to a generation of LGBTQ+ people.\n\n\" This is mere cruelty to exclude trans people from doing the things they love with the people who love them. \"\n\nCounter-protesters mocked JK Rowling at an anti-trans demonstration in April. ( )\n\nAround 41 per cent of trans individuals in the UK say they have experienced a hate crime due to their gender identity, according to the latest statistics on the prevalence.\n\nLeading anti-trans campaigner and author JK Rowling said the Girlguiding announcement would \"help girls\".\n\n\"It reminds girls that the desires of boys do not supersede their feelings, their rights, their discomfort or their safety,\" she said on X.\n\nCampaign group For Women Scotland (FWS), which is financially backed by Rowling, spearheaded the April appeal that determined whether transgender women were legally women under equality legislation.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-04/steve-cropper-dies-aged-84/106100460",
        "title": "Legendary guitarist and songwriter Steve Cropper dies aged 84",
        "publish_date": "Thu, 04 Dec 2025 01:31:33 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Steve Cropper, the guitarist and songwriter who helped anchor the celebrated Memphis backing band Booker T and the MG's, has died aged 84.\n\nThe musician also co-wrote the classics Green Onions, (Sittin' on) The Dock of the Bay and In the Midnight Hour.\n\nPat Mitchell Worley, president and CEO of the Soulsville Foundation, said Mr Cropper's family told her that he died in Nashville on Wednesday. The foundation operates the Stax Museum of American Soul Music in Memphis, located at the site of the former Stax Records, where Cropper worked for years.\n\nThe cause of death was not immediately known.\n\nLongtime associate Eddie Gore said: \"He's such a good human.\"\n\n\"We were blessed to have him, for sure,\" he added.\n\nThe guitarist, songwriter and record producer was not known for flashy playing, but his spare, catchy licks and solid rhythm chops helped define Memphis soul music.\n\n'Play it, Steve!'\n\nSteve Cropper's very name was immortalised in the 1967 smash Soul Man, recorded by Sam & Dave.\n\nMidway through the track singer Sam Moore calls out, \"Play it, Steve,\" as Cropper pulls off a tight, ringing riff, a slide sound that Cropper used a Zippo lighter to create.\n\nThe exchange was re-enacted in the late 1970s when Cropper joined the John Belushi-Dan Aykroyd act The Blues Brothers and played on their hit cover of Soul Man.\n\nRolling Stones guitarist Keith Richards, asked once about Cropper: said simply: \"Perfect, man.\"\n\nSteve Cropper performs with the Blues Brothers Band in Washington in 2016. (AP: Andrew Harnik)\n\nSteve Cropper was inducted into the Rock and Roll Hall of Fame in 1992 as a member of Booker T and the MG's.\n\nRolling Stone magazine ranked him 39th on its 100 Greatest Guitarists list, describing him as \"the secret ingredient in some of the greatest rock and soul songs\".\n\nThe guitarist was in the 1980 movie The Blues Brothers and its follow-up, Blues Brothers 2000, portraying The Colonel in the Blues Brothers band. In real life, he toured with them.\n\nHe was inducted into the Songwriters Hall of Fame in 2005, and two years later received a Grammy Award for lifetime achievement.\n\nCropper continued recording into his later years, including 2024's Friendlytown, which was nominated for a Grammy. Earlier this year, Cropper received the Tennessee Governor's Arts Award, the state's highest honour in the arts.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-04/ted-egan-former-nt-administrator-musician-dies-aged-93/106100878",
        "title": "Former NT administrator, musician and author Ted Egan dies aged 93",
        "publish_date": "Thu, 04 Dec 2025 01:18:12 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Folk music legend, author and former Northern Territory Administrator Ted Egan has died aged 93.\n\nEgan died this morning at home in his beloved outback hometown of Alice Springs.\n\nThe singer, who was famous for his larger-than-life persona and for popularising the beer carton as a musical instrument, was surrounded by his large family when he died.\n\nHe was also known as a vocal supporter of Aboriginal land rights during the 1960s and 1970s, including penning the song Gurindji Blues with former Australian of the Year Galarrwuy Yunupingu.\n\nIn a statement, his wife Nerys Evans and son Greg Egan told the ABC he \"lived a big and very generous life spanning 93 years. We will miss him enormously\".\n\n\"It is with sadness but also great pride that Nerys Evans and the Egan family mark the passing of our beloved partner, father, grandfather, great grandfather and best mate,\" they said.\n\n\"Ted passed peacefully at home this morning, as was his wish.\n\n\"We shared Ted with Territorians, Australians and the wider world.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-04/prada-purchase-of-versace-to-have-big-impact-on-fashion/106097096",
        "title": "Versace excelled at maximalism. Now Prada wants to take it further",
        "publish_date": "Thu, 04 Dec 2025 01:11:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "One of the biggest rivalries in fashion is over, with Prada buying fellow Italian fashion house Versace in a billion-dollar deal.\n\nThe takeover, worth 1.25 billion euro ($2.2 billion), was confirmed in a chic, one-line statement.\n\nVersace's fortunes have been waning in recent years as the nearly 50 year old brand struggles to capture consumers as it once did.\n\nPrada, on the other hand, has found immense success, thanks in part to its more youthful label, Miu Miu — its name derived from its owner, Miuccia Prada.\n\nGianni Versace backstage with supermodels Karen Mulder, Linda Evangelista and Carla Bruni in 1992. (Getty Images: Foc Kan/WireImage)\n\nIn March, Donatella Versace stepped down as creative director, nearly three decades after she took up the role following the assassination of her brother and the brand's founder, Gianni Versace.\n\nShe was replaced by former Miu Miu head Dario Vitale — though executives say his move was unrelated to the Prada deal.\n\nNow, with a new owner, Versace will be hoping to be brought back into style.\n\nCultural headwinds\n\nWhen it comes to fashion, Prada and Versace could not be more different.\n\n\"They're kind of polar opposites,\" said Kirstie Clements, the former editor of Vogue Australia, adding Versace had always been \"dynamic\".\n\n\"If you go back to when it was designed by Gianni Versace, [it was] really bright, colourful, sexy, in your face, glitzy,\" she told ABC News.\n\n\"But not over the top because he always had a sense of restraint.\"\n\nVersace is synonymous with bold patterns, glitzy embellishments and seductive silhouettes. (Reuters: Stefano Rellandini)\n\nAlternatively, Prada is a \"more intellectual brand\", said Clements, with its aesthetic not being overtly sexy.\n\n\" They're both very representative of Italian fashion, but super different. \"\n\nPrada's latest collection featured the brand's signature clean lines and a subdued color palette. (Reuters: Alessandro Garofalo/File Photo)\n\nAccording to The Australian Financial Review's fashion editor Lauren Sams, Versace's struggles in recent years can be attributed to a post-pandemic economy, but also \"cultural headwinds\".\n\n\"I think it says a lot when Palazzo Versace, the hotel attached to the fashion brand, that when it opened in Australia, it opened on the Gold Coast and that was the perfect spot for it,\" she told ABC News Channel.\n\n\"It was a place where you could be outsized and sexy and outrageous, and that is what Versace is.\n\n\"That is not really sort of the time at the moment. We are not really having that moment in fashion.\"\n\nA mini skirt with maximum impact\n\nIn 2022, a very short skirt by Miu Miu became one of the most coveted pieces in the industry.\n\nDebuted on the runway the previous season, the pleated, eye-poppingly low-slung mini skirt captured the attention of the front row — and soon after, the rest of the internet.\n\nThis skirt from Miu Miu was a hit with industry insiders, influencers and celebrities alike. (Getty Images: Vanni Bassetti)\n\nThe mini skirt was seen on Zendaya, Emma Corrin and Emily Ratajkowski, to name a few.\n\nBut no-one sparked more headlines than Nicole Kidman who, at 54, wore the matching set on the cover of Vanity Fair, later saying she \"begged\" stylists to let her wear the viral outfit.\n\nNicole Kidman was one of many celebrities to wear the viral outfit. (Supplied: Vanity Fair)\n\n\"Prada has had its 'on seasons' and its 'off seasons', but it's had a lot of publicity through Miu Miu,\" Clements said.\n\n\"It did that little belt skirt. All the influencers were wearing it. It's all about getting a viral moment.\"\n\nDario Vitale debuted his first Versace season in September, with the spring/summer 2026 collection during Milan Fashion Week.\n\nDario Vitale's debut collection with the brand paid tribute to Gianni Versace. (Instagram: @Versace)\n\nThe collection referenced the brand's 1980s Gianni Versace era, with critics calling it everything from bold and brash to fun and audacious.\n\n\"If you look at that collection, it's really different and it was very divisive. Not everybody loved it,\" Clements said.\n\n\"But when I looked at it I thought, 'That's interesting, that's a move forward,' because I think Versace was stuck.\"\n\nMade in Italy\n\nVersace was previously owned by US luxury group Capri Holdings.\n\nNow, under Prada, it's going back to its roots.\n\n\"'Made in Italy' is a really important designation for Italian designers and I think bringing it back into an Italian company is going to be a really important part of its future,\" Sams said.\n\nA look from one of Donatella Versace’s final collections during her time as creative director. (AP: Antonio Calanni)\n\nBut in Clements opinion, Prada still has \"a lot of work to do\" in order to make Versace profitable.\n\n\"Do they buy something else? Do they buy Armani? Are they going to turn into an Italian conglomerate?\" she said.\n\n\"It's quite a tricky time in fashion. They're looking for brands that have a solid philosophy like Versace does.\"\n\nPrada is not yet on the level of luxury goods conglomerate LVMH, which owns 75 brands including Louis Vuitton, Christian Dior, and Moët & Chandon.\n\nHow Anna Wintour redefined fashion over almost 40 years As US Vogue editor-in-chief, Anna Wintour forever changed the fashion industry.\n\nBut Clements said Prada's purchase of Versace could be the beginnings of an Italian luxury group that could one day rival French luxury group Kering, which owns Gucci, Saint Laurent, Bottega Veneta and Alexander McQueen.\n\nTrends come and go, and come back again — so will Versace rise to the occasion once again?\n\n\"100 per cent, if you get it all right,\" Clements said.\n\n\"If you get the right celebrities, the right influencers, the right people on board — and it's the right clothing for the moment — you can do it.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-04/community-radio-platforming-diverse-voices/106089034",
        "title": "People with disability 'blossom like a flower' on community radio",
        "publish_date": "Thu, 04 Dec 2025 01:01:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "Across Australia, community radio stations act as hubs of culture and connection, reflecting the diversity of the communities they serve, powered by a legion of loving volunteers.\n\nAt 8CCC Radio in Alice Springs, the voices of people with disability are put centrestage — or desk — and broadcast onto the FM airwaves, blasting into local cars or kitchens, and online all over the world.\n\n8CCC broadcasts across central Australia and the Barkly. (ABC News: Xavier Martin)\n\nUnassuming, 8CCC sits next to the fish and chippy and a Chinese restaurant, with a coffee shop out the front and a place to sit and listen. The station brings people of all abilities and backgrounds together to share music and stories.\n\nThe outback station became a National Disability Insurance Scheme (NDIS) training provider a few years ago, and since that time, it has grown the number of shows presented by people with disability on the station to five.\n\nBen Russell, who lives with a vision impairment, loves hosting the anime show on 8CCC Community Radio. (ABC News: Elsie Lange)\n\nWhat is community radio?\n\nOperated by and for local communities, these stations exist all over the country and are integral not only to the ecosystem of media in Australia, but to the arts too.\n\nThey are non-profit organisations, giving much-needed airtime to voices and content that can be missed out in traditional mainstream media.\n\n8CCC Radio started in Alice Springs in 1981 and started broadcasting into Tennant Creek in 1990, and sits alongside its local sister station, Central Australian Aboriginal Media Association (CAAMA).\n\nMark Bensted from disability support service Total Recreation has been a part of Andy Harrison's journey on 8CCC. (ABC News: Xavier Martin)\n\nAccording to the Community Broadcasting Association of Australia (CBAA), there are nearly 5.3 million Australians tuning into community radio across the country every week.\n\nCBAA director of public affairs Reece Kinnane said the sector came together two years ago to put together a plan to focus on what makes community radio unique and different.\n\n\"We want to provide a space for all Australians to connect and we want to be a part of all Australian communities, and that includes people with a disability,\" Mr Kinnane said.\n\n\"It's really important that people with a disability hear stories told with a lens of lived experience … a lot of stations are stepping up to do that and it's fantastic to see.\"\n\nAccessibility opens doors\n\nAndy Harrison lives with a physical disability and has been presenting on 8CCC for five years. He now presents the afternoon program every weekday and is known for his tough interview style and love of country music.\n\nAndy Harrison says he loves playing country music on his show. (ABC News: Xavier Martin)\n\n\"Me being an ambassador for disability like I am, [being on 8CCC] gave me the opportunity to put the word out to other young people and say, 'Hey, if you want to get your own show started, come down to 8CCC,'\" Mr Harrison said.\n\n\" We'll train you up and get your own show going, and now we've got up to four or five broadcasters with disabilities running on 8CCC five days a week. \"\n\nMr Harrison said it was station manager Benjamin Erin who offered him a paid, full-time role at the station after years of volunteering had honed his skills.\n\nBenjamin Erin says it's important that the voices heard on community radio reflect the community. (ABC News: Xavier Martin)\n\n\"Being accessible to Andy opened up the doors to being accessible to the broader community,\" Mr Erin said.\n\nHe said partnering with local disability service provider Total Recreation helped the station to have more people with diverse abilities volunteer and participate.\n\n\"While many of our shows are shows about general things that anyone could be interested in, [because they are] presented by someone who happens to have a disability, there are unique perspectives that come from making sure those voices can be part of those conversations,\" he said.\n\nRoyston Thompson presents a sports show on 8CCC. (ABC News: Elsie Lange)\n\nSpace to 'blossom like a flower'\n\nWhile Mr Harrison's program welcomes a diverse range of guests including local musicians and politicians, Ben Russell, who is vision-impaired, hosts an hour-long show talking about anime.\n\nBen Russell says he loves that 8CCC is making sure the voices of people with disability are heard. (ABC News: Elsie Lange)\n\nMr Russell said having the platform to present his show made him feel he was \"able to achieve something\".\n\n\"[To] prove to people that people with disabilities actually have a chance in this world, to show them what it means to blossom like a flower,\" Mr Russell said.\n\nJaidyn Stanton said he felt like \"a kid in a candy store\" when he chose the rock music he was going to blast into the world that week for his show, Jaidyn's Rock Nation.\n\nRight now, his show is focused on rock music from the 1970s, and he said he loved interviewing local musicians on air.\n\nJaidyn Stanton hosts a weekly rock show at the station. (ABC News: Elsie Lange)\n\nMr Stanton's penchant for presenting started back in high school, when he did an internship at another commercial radio station in Alice Springs and received warm praise from his teachers at the time.\n\nAnd his listeners mean the world to him.\n\n\"I just want to give a shout-out to all my rock-loving brothers and sisters out there who actually love tuning into my show every week,\" Mr Stanton said.\n\n\"We love community radio.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/health/2025-12-04/pregnancy-supplements-marketing-medical-evidence-folate-prenatal/106092086",
        "title": "What's in pregnancy supplements? Sorting science from marketing spin",
        "publish_date": "Thu, 04 Dec 2025 00:59:40 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Navigating pregnancy and early parenting advice can be overwhelming — and for many parents, the confusion begins in the supplement aisle.\n\nOne of the first things women planning a pregnancy or in the early stages of one are advised to do is take a prenatal supplement containing folic acid — the synthetic version of folate, or vitamin B9 — and iodine.\n\nIodine is essential for a baby's brain and nervous system development, while folate is particularly important in early pregnancy to help prevent neural tube defects such as spina bifida.\n\nBut there are scores of supplements to choose from, many of which contain a plethora of vitamins and minerals, sometimes in vastly different amounts.\n\nAdding to the confusion is the fact many newer supplement companies substitute folic acid with methylfolate — a lesser-studied form of folate, often claimed to be more easily absorbed — and usually at heftier prices.\n\n\"It's very hard standing in the pharmacy to negotiate those claims, to understand what is effective, what is cost-effective, and what is safe,\" Alexis Shub, obstetrician and maternal fetal medicine specialist at the Mercy Hospital for Women, said.\n\nSo what ingredients are essential in a prenatal supplement? And when should you start taking one?\n\nWhat supplements are recommended in pre-conception and pregnancy?\n\nNational pregnancy care guidelines recommended women take 400–600 micrograms of folic acid per day ideally from four weeks before conception and throughout the first 12 weeks of pregnancy.\n\nFor women at increased risk of having a pregnancy affected by neural tube defects — such as those with a family history, or who have diabetes — a higher dose (5 milligrams per day) may be recommended.\n\nFolic acid supplementation substantially reduces the risk of neural tube defects, but does not prevent all cases. (Pexels: MART PRODUCTION)\n\nWhen it comes to iodine, all women are advised to take a daily supplement containing 150 micrograms when they're planning a pregnancy, pregnant and breastfeeding. (Women with a pre-existing thyroid disorder should seek medical advice first.)\n\nIf you haven't taken a supplement prior to conception — and it's estimated half of all pregnancies in Australia are unplanned — it's recommended you start once you become aware you're pregnant.\n\nTo reduce the risk of nutrient deficiencies and neural tube defects across the population, bread products in Australia are also fortified with folic acid and iodine. Since mandatory fortification was introduced in 2009, neural tube defects have fallen by 14 per cent.\n\nWhat's the difference between folic acid and other types of folate?\n\nWhen you consume folate through food or folic acid, your body converts it into methylfolate (also known as L-5-methyltetrahydrofolate or 5-MTHF). It does this with the help of an enzyme made by the MTHFR gene.\n\nIn recent years, a growing number of supplement companies have developed prenatal formulations that contain methylfolate instead of folic acid.\n\nTypically, they're promoted as being more \"bioavailable\" (or easier to absorb) and therefore a better choice, especially for people with MTHFR gene variations, which can slightly reduce the gene's effectiveness.\n\nTests to consider if you're planning pregnancy Government guidelines recommend seeing a GP three to six months before you become pregnant.\n\nBut Shelley Wilkinson, a prenatal dietitian and an obstetric medicine researcher at the University of Queensland, said that wasn't the case, and stressed that folic acid was the only form of folate that had been shown in trials to help prevent neural tube defects.\n\n\"The majority of people will be able to get the folate they need from [folic acid] supplements and food,\" Dr Wilkinson said.\n\nAustralian pregnancy guidelines (and other international health authorities) note that pregnant women with MTHFR variations — which are estimated to affect 60–70 per cent of the population — can still process all types of folate, including folic acid.\n\nAccording Dr Shub: \"When people look at blood levels of folate in women with MTHFR variants, they're the same when they've taken folic acid as women who don't have that mutation.\"\n\nIt shouldn't be assumed, she said, that methylfolate supplements — which are typically more expensive — work in the same way as folic acid to support neural tube development.\n\n\"The data around neural tube defect prevention is all with folic acid … so for women who take other variants [of folate], we just don't have that information.\n\n\"The other problem with [methylfolate] is that it's not as stable … it's susceptible to changes to light and temperature, and so what you think you're getting in your vitamin might not be what's actually in there.\"\n\nFolic acid intake is more important for determining blood folate levels than having a MTHFR variant, health authorities say. (Getty Images: Galina Zhigalova)\n\nClaire Roberts, who leads the Pregnancy Health and Beyond Laboratory at Flinders University, said while supplements containing methylfolate were \"likely\" to help to prevent neural tube defects, and may even be beneficial for some women, there wasn't enough evidence to confirm that.\n\nWhat about other vitamins and minerals?\n\nVitamin D testing during pregnancy used to be recommended, as was supplementation for women found to be deficient, but Australia's national pregnancy care guidelines were recently updated to advise against this.\n\nThe guidelines note that while routine vitamin D supplementation during pregnancy \"may offer some benefit\", there's insufficient evidence to recommend testing or supplementation as part of standard pregnancy care.\n\nWhen it comes to supplementing other key vitamins and minerals, the guidelines currently recommend:\n\nCalcium : recommended for women at risk of high blood pressure\n\n: recommended for women at risk of high blood pressure Iron : recommended for pregnant women based on blood test results at 28 weeks\n\n: recommended for pregnant women based on blood test results at 28 weeks Vitamin B6 : not enough evidence to detect clinical benefits in pregnancy, though it may help to reduce nausea (high doses, however, can lead to serious adverse outcomes — see below)\n\n: not enough evidence to detect clinical benefits in pregnancy, though it may help to reduce nausea (high doses, however, can lead to serious adverse outcomes — see below) Vitamin B12 : not enough evidence to draw conclusions, though it may benefit women who are vegetarian or vegan\n\n: not enough evidence to draw conclusions, though it may benefit women who are vegetarian or vegan Magnesium : not routinely recommended\n\n: not routinely recommended Omega-3 fatty acids : may reduce the risk of preterm birth in women who are low in omega-3\n\n: may reduce the risk of preterm birth in women who are low in omega-3 Vitamin A and E : high-dose supplementation not routinely recommended for pregnant women with no identified deficiency or clinical need\n\n: high-dose supplementation not routinely recommended for pregnant women with no identified deficiency or clinical need Vitamin C : high-dose supplementation not routinely recommended for pregnant women with adequate dietary intake\n\n: high-dose supplementation not routinely recommended for pregnant women with adequate dietary intake Zinc : guideline under review\n\n: guideline under review Other minerals (e.g. selenium) : not enough evidence to draw conclusions\n\n: not enough evidence to draw conclusions Probiotics: guideline under review.\n\nWith the exception of folic acid and iodine, Dr Shub said there was limited evidence for many of the ingredients in prenatal supplements, and that for the majority of pregnant women (without risk factors or known deficiencies), a balanced diet would provide most of the nutrients they needed.\n\n\"If women are trying to do the best thing in their pregnancy, a healthy diet and exercise is still the best way to go. Although that can be difficult, spending money on [multi]vitamins is probably not a good use of money.\"\n\nGetting vitamins and minerals through a varied, wholefood diet offers benefits that can't be obtained from supplements, experts say. (Pexels: Kei Scampa)\n\nDr Wilkinson agreed: \"There's a lot you can get from a well-planned diet — omega-3, so DHA and EPA [two types of omega-3 fatty acids] can be obtained, and choline [a nutrient important for fetal development] … is in meat, fish, poultry, dairy, eggs, green leafy veggies, legumes, and potatoes.\"\n\nEvidence for choline supplementation is mixed, though some experts suggest it may help women meet their recommended daily intake.\n\nDr Wilkinson acknowledged that many Australians struggled to get enough fruit and vegetables in their diet, and encouraged pregnant women concerned about their nutrient intake to work with an accredited dietitian or their healthcare provider to create a \"food-first approach\".\n\n\" Eating a nourishing diet is going to be more important than finding the 'right' supplement. \"\n\nWhy more is not always better\n\nDr Wilkinson said while many women took pregnancy supplements containing a range of vitamins and minerals for \"peace of mind\", there was a risk of consuming too much, particularly if women were taking a combination of products.\n\n\"We've seen it with vitamin B6, which can be in magnesium [supplements], energy drinks, multivitamins and morning sickness tablets.\"\n\nShe said she had seen some pregnant women who were taking more than 50 times the recommended daily amount of vitamin B6, which in high doses can cause irreversible nerve damage.\n\nAustralia's national medicines regulator recently reported that high doses of B6 could lead to adverse pregnancy outcomes, particularly in the first trimester.\n\nDr Wilkinson recommends using a supplement that contains folic acid and iodine at the recommended dose. (Pexels: Nataliya Vaitkevich)\n\nHigh doses of vitamin A, C and E can also be dangerous during pregnancy: \"It's why women should not take non-pregnancy multivitamins,\" Dr Shub said.\n\nUnnecessarily high doses of recommended vitamins can also pose potential health risks, said Professor Roberts, whose research has found a link between excess maternal folate levels and a rise in gestational diabetes.\n\n\"It's almost like there is a sweet spot — too little is not good, and too much is not good,\" she said.\n\nIn a small 2023 study, Dr Wilkinson and her colleagues found 5 per cent of pregnant women exceeded the safe upper level of intake for folic acid (1,000 micrograms per day), and almost 50 per cent exceeded the upper limit for iron.\n\nWhile folic acid supplementation is only recommended during the first trimester, research suggests many women continue to take it in the second and third trimesters as part of a prenatal multivitamin.\n\nDr Wilkinson said this was generally OK, given daily folate requirements were increased during pregnancy, but advised women against taking \"large amounts\" that might put their daily consumption above the recommended upper limit.\n\nCalls for better regulation and labelling\n\nUnlike registered medicines, most vitamin supplements in Australia aren't evaluated by the Therapeutic Goods Administration before they hit the market.\n\nThe TGA regulates the safety and quality of AUST L products by limiting them to use only pre-approved low-risk ingredients, however many are not assessed for efficacy, placing them in a regulatory \"grey area\", Dr Wilkinson said.\n\nABC Health in your Instagram feed Follow @abchealth on Instagram, where we're busting myths and sharing practical, smart health advice.\n\nShe and Professor Roberts said they'd like to see increased regulation of prenatal supplements to help consumers make evidence-based choices.\n\n\"Women want to do the best thing for their baby, and they have an awful lot of guilt if they don't,\" Professor Roberts said.\n\nDr Wilkinson added that increased oversight could help women avoid paying for products they didn't need.\n\n\"It could be a lot cheaper and easier if you took what you needed, rather than what you're marketed.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-04/opal-miners-continue-operations-vergemont-station-national-park/106095772",
        "title": "Outback opal miners allowed to operate in new national park",
        "publish_date": "Thu, 04 Dec 2025 00:28:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "Miners with tenures inside one of Queensland's newest national parks will be allowed to continue hunting for opals.\n\nVergemont Station was bought by the state government in April last year, backed by an anonymous $21 million donation.\n\nThe purchase led to months of uncertainty for opal miners with tenures inside the former cattle station, which is larger than the Australian Capital Territory.\n\nIndividual mining operations on Vergemont are small in scale. (ABC Western Qld: Hannah Walsh)\n\nBut the decision now by the state government to retain and expand an area of land declared in 1991 for opal miners — Restricted Area 257 — has been welcomed by the industry.\n\n\"It's pure relief,\" Boulder Opal Association secretary Alison Summerville said.\n\n\" I've made several phone calls today to particular families who have been waiting on tenterhooks and it's a wonderful Christmas present for all of us. \"\n\nMs Summerville said many people feared the national park designation would force generational miners out of the leases they held on Vergemont.\n\nMinister for Natural Resources and Mines Dale Last said it showed the government's commitment to backing the resources sector, including small-scale opal miners.\n\nThis boulder opal found on Vergemont is valued at $300,000. (ABC Western Qld: Hannah Walsh)\n\n\"The change of government was a significant factor in retaining this industry for the future,\" Ms Summerville said.\n\nThe government said the acquisition of Vergemont Station and the nearby former stations of Tonkoro and Melrose would create a corridor of protected land to safeguard habitat and rare and threatened species, along with significant Indigenous cultural heritage.\n\nEnvironment Minister Andrew Powell said the park was part of a plan to add 1.8 million hectares to the state's protected areas by 2028.\n\n\"The proposed new national park will safeguard the significant ecological values of the unique landscape,\" Mr Powell said.\n\nThe department also confirmed new park rangers had been employed to manage the former station and other protected areas in the region.\n\nThreatened species like the night parrot and purple-necked rock wallaby live on Vergemont. (Supplied: Qld Government)\n\nMiners ecstatic\n\nOpal miner Robbie Vinnicombe, who has combed through the red dirt of Vergemont for the past 30 years, said the outcome was a huge relief.\n\n\"I feel ecstatic, I'm shaking,\" he said.\n\n\"For me personally, it means my investment is no longer sitting on a knife's edge.\n\n\" I've invested my life, my life's savings and time, and up until recently with the purchase of Vergemont it was all put on hold and I had no idea where we were standing. \"\n\nRobbie Vinnicombe has hunted for opals on Vergemont for three decades. (ABC Western Qld: Hannah Walsh)\n\nThere were 60 active mining tenures and 80 sub-blocks under exploration on Vergemont at the time of its purchase.\n\n\"It's a very good outcome not just for the industry but for our region,\" My Vinnicombe said.\n\nThe opal industry contributes $14 million a year to Winton, according to a report commissioned by the town's local council.\n\nThe Vergemont camp site has hosted generations of opal miners. (ABC Western Qld: Hannah Walsh)\n\nThe fine print\n\nMs Summerville said everyone who had a mining tenure within the Restricted Area 257 was \"safe\".\n\n\"Every single piece of mining tenure, whether it was a mining claim, a mining lease or an EPM [exploration permit for minerals] has been retained and will be retained for the future in opal mining,\" she said.\n\n\"The fine print was always going to be the difficult part … what we wanted was to be sure of the future.\"\n\nThe decision to retain and expand the opal mining area ends months of unease. (ABC Western Qld: Hannah Walsh)\n\nMs Summerville said 47,000 hectares on the eastern and western edges of Vergemont had been protected from mining, but it was not considered significant opal-bearing ground.\n\nThe state government has also proposed giving small-scale miners access to an additional 155,000 hectares for prospecting.\n\nThe proposal would add 494 sub-blocks to the existing restricted area.\n\nBoulder opals from Vergemont are sold around the world. (ABC Western Qld: Hannah Walsh)\n\nMs Summerville said she could not wait to reassure international opal buyers.\n\n\"This is a far-reaching industry.\n\n\"We have so many people who rely on us around the world, and I can't wait to get back out there and give them that assurance that we are there, we will be mining and producing one of the most beautiful gemstones in the world.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-04/cricket-fan-scott-stokes-vespa-roadtrip-ashes-tests/106092912",
        "title": "Cricket fanatic crisscrossing Australia on Vespa to attend every Ashes Test",
        "publish_date": "Wed, 03 Dec 2025 23:56:20 +0000",
        "category": "sports",
        "authors": [],
        "text": "Scott Stokes is a man on a mission: to attend every Test cricket match in Australia on his little yellow Vespa — a trip encompassing 12,000 kilometres of open road.\n\nScott Stokes (no relation to England captain Ben Stokes) is a cricket tragic.\n\nThe 55-year-old from Canberra is crisscrossing the country for several weeks on his lightweight scooter to watch every game of the Ashes.\n\nWhile some might choose to fly, Scott is doing it via bitumen at 90 kilometres per hour (85km/h if it's windy).\n\nWith the wind beneath his feet, he is making his way from Test match to Test match on \"Van-espa\" the Vespa.\n\nBut for Scott, the long, solo journey is also another type of test, as he grapples with his own mental health.\n\nIf you need someone to talk to, call: Lifeline on 13 11 14\n\nMensLine Australia on 1300 789 978\n\nBeyond Blue on 1300 224 636\n\n\"It has always been a dream of mine to go to every Ashes Test, both here and in England,\" he said.\n\n\"But the other reason is … it's a mental health journey for me.\"\n\nScott Stokes has had a \"long relationship\" with cricket, both playing and watching, according to his wife Helen. (Supplied)\n\nIn late 2020, Scott had a \"fairly significant event\" and was medically retired from his job in health.\n\n\"I bought Van-espa just after being retired and she's really great to ride, it's very good for mindfulness,\" he said.\n\nWhen Scott floated the idea of an epic road trip to his wife, Helen, she \"didn't say no\" — so he took that as a green light.\n\n\"The Vespa has been kind of life-changing for him,\" Helen said.\n\nThe long journey, culminating in the realisation of Scott's dream to attend every Ashes Test in a series, has given him a target and a goal, she explained.\n\n\"I'm really happy that he's getting out there … he's definitely doing everything he can to rebuild his resilience, which has certainly been low in recent years,\" she said.\n\nScott Stokes with his mother Bev, before setting off on his 12,000-kilometre journey. (Supplied)\n\nA 'bit of a dance' with trucks\n\nAfter a short test run from Canberra to the Blue Mountains, Scott set out with his wife's blessing and a detailed list of petrol stations to ride the more than 3,700km to Perth.\n\n\"I followed him on a practice run from Katoomba and he didn't look like falling off … so I was pretty confident he's going to be fine,\" Helen said.\n\nContending with road trains, trucks, potholes and a petrol tank that only takes him a couple of hundred kilometres at a time, Scott successfully navigated the first leg of his journey to Perth for the first match.\n\nThen, he jumped back on Van-espa for the second leg: Perth to Brisbane — a journey of more than 4,300km — for the second Test.\n\n\"It's a bit of a dance,\" Scott said.\n\n\" I have to be mindful of where they [the trucks] are. There's been a couple of close calls, which my wife won't want to hear about. \"\n\nVan-espa the Vespa taking a quick pit stop at the Mad Max 2 museum west of Broken Hill in outback NSW. (Supplied)\n\nWhile Scott is a \"fantastic driver\", according to Helen, she has firmly ruled out a \"his and hers\" matching dual-Vespa scenario.\n\n\"I'm not very coordinated so we don't want me on the open road on a Vespa … I can just go on the back of his every now and then,\" she said.\n\nThat is, when Scott graduates from his P plates in April next year.\n\nUntil then, Scott has Helen and family behind him as he continues the remaining 4,000km journey from Brisbane to Adelaide, then to Melbourne (via the Great Ocean Road) and on to Sydney, before returning home to Canberra.\n\n\"We're about five years into his journey now, and it's tough on the kids, tough on me, it's tough on him,\" Helen said.\n\n\" But he's working really hard to do what he can to get better and you've got to admire that. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-04/bronze-gorilla-sculpture-eurobodalla/106095164",
        "title": "$1.6m art installation, including 3-metre gorilla, gets town talking",
        "publish_date": "Wed, 03 Dec 2025 22:59:28 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "A 3-metre-tall bronze gorilla on the New South Wales South Coast is drawing crowds and raising eyebrows.\n\nThe artwork, Wild Mother Eastern Lowland Gorilla, is a statue of a 30-year-old eastern lowland gorilla named Mina.\n\nInstalled at Corrigan's Reserve in Batehaven, it is the second of 22 sculptures made by internationally acclaimed artists Gillie and Marc that will be installed across the Eurobodalla area over the next seven months.\n\nValued in total at $1.6 million, the sculptures have been permanently donated to Eurobodalla Shire Council through the Australian government's Cultural Gifts Program.\n\nMathew Hatcher said the gorilla and other statues were designed to spark conversation. (Supplied: Mathew Hatcher)\n\nPictures of the gorilla statue have been posted to local social media groups, with some commenters questioning the installation cost to council of $27,000 or the choice to feature non-native animals.\n\nEurobodalla Shire Mayor Mathew Hatcher said the debate the public art installation created was expected.\n\n\"Those noticeboards are lit up at the moment because of a gorilla and people telling you where [we] should have put it … [or] we don't have gorillas in the Eurobodalla so why do we have a gorilla?\" he said.\n\n\" No matter if we put nothing or we put something, there's going to be people who are for and against it. \"\n\nLocals and tourists have been stopping in Corrigan's Reserve to take photos and admire the work. (ABC South East NSW: Toby Hemmings)\n\nMr Hatcher said the work was about creating a culture in the town and making it a space where people talk.\n\n\"There's no doubt people are talking,\" he said.\n\n\"It's getting engagement and that's what art is all about.\"\n\nConservation-based art\n\nKnown for their large public installations in major cities, Gillie and Marc are British Australian artists who make sculptures inspired by wildlife conservation.\n\nIn early November, their work The Splendid Fairywren Loved Adventure with Rabbitwoman and Dogman was installed at Nato Oval in Narooma.\n\nThe Splendid Fairywren Loved Adventure with Rabbitwoman and Dogman was installed at Nato Oval in Narooma in early November. (Supplied: Eurobodalla Shire Council)\n\nThe remaining 20 works to be distributed across the shire are a series of life-sized bronze sculptures depicting critically endangered baby animals.\n\nIn a statement issued via their publicist, Gillie and Marc said they were inspired to donate to the council after travelling to the region and being moved by its natural beauty.\n\n\"After the devastating [Black Summer] bushfires and the continuing pressures on habitat, we felt a strong responsibility to give something meaningful back,\" they said.\n\nThe plaque attached to Wild Mother Gorilla describes the animal depicted as a \"peaceful queen\". (ABC South East NSW: Jacinta Counihan)\n\nMonkey see\n\nFor people who ventured out to see the work in person, such as Sunshine Bay resident Seamus Donegan, the reaction was more positive.\n\n\"I think it's good. It will attract people to the park and it's a good talking point,\" he said.\n\nGraham Milliken likes the statue. (ABC South East NSW: Jacinta Counihan)\n\nLocal Graham Milliken said he thought the gorilla statue was \"grouse\".\n\n\"It's better than some of the art I've seen around, to be quite honest,\" he said.\n\n\"I'm not one of these abstract people — I'd rather see something like this than something I can't understand.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-04/remote-community-rescues-400k-food-delivery/106090818",
        "title": "Five months' worth of food saved by team effort in remote WA",
        "publish_date": "Wed, 03 Dec 2025 22:27:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "A remote Aboriginal community has completed a mammoth 36-hour recovery of a food and supply delivery needed to feed its residents for the next five months.\n\nThe Punmu community, 1,300 kilometres north-east of Perth, orders a bulk food delivery every year to keep shelves stocked over the wet season, when cyclonic rains can flood the only road into the town for weeks or sometimes months.\n\nCommunity coordinator Edith Costello said the triple-trailer road train carrying about $400,000 worth of food and supplies broke down 25 kilometres from the town early on Sunday morning.\n\nEdith Costello says the community had to resolve the situation on its own. (ABC Pilbara: Alistair Bates)\n\n\"I realised we had to get together and make a plan,\" she said.\n\n\"We're probably the third-most remote community in WA, so there isn't anyone to call.\"\n\nWhat followed was a mammoth 36-hour recovery effort.\n\nTeam effort\n\nRough conditions on the unsealed road into Punmu had cracked one of the truck's air springs and broken away a large mount on its left side.\n\nMs Costello sent out the community's mechanic, who did some temporary repairs and ditched the truck's trailers so the driver could take it slowly to the workshop in town.\n\nIt took 5 hours to repair the road train. (Supplied: Punmu Aboriginal Community)\n\nOver the next 5 hours, the mechanic removed the left-hand back wheels and repaired the broken parts, before welding everything back in place.\n\n\"Meanwhile, staff were flattening and trying to harden the road section that had given way in the hope we could get back to retrieve our trailers,\" Ms Costello said.\n\nPunmu finance manager Gary Kairn was tasked with ferrying diesel to the stranded trailers so the meat inside could remain refrigerated.\n\n\"I've worked in communities for a lot of years and it's really a matter of if you see a job that needs doing, you've just got to have a crack at it,\" he said.\n\n\"It does build a sense of camaraderie.\"\n\nGary Kairn (left) says coming together to tackle the problem built a sense of camaraderie among the Punmu team. (Supplied: Punmu Aboriginal Corporation)\n\nWhen the repairs were complete, each trailer was collected and driven to the community, with the final pallets unloaded around 6pm on Monday.\n\n\"Seeing all the goods loaded into the warehouse and into the freezer at the end of the day was a fantastic outcome,\" Mr Kairn said.\n\nRescue reignites roads debate\n\nThe incident is further evidence of a road maintenance crisis the local shire has been pleading with state and federal governments to help fix for months.\n\nThe Shire of East Pilbara has been struggling with maintaining roads across an area larger than Victoria.\n\nPunmu is one of Western Australia's most remote Indigenous communities, reliant on bulk food deliveries to keep people fed over the wet season. (ABC News: Charlie McLean)\n\nIt estimates almost $300 million is required to re-sheet worn-out dirt roads and repair damage from Cyclone Zelia last year.\n\n\"The road's been hammered by two cyclones … over the last month we've had a car roll over, we've had vehicles lose wheels,\" Ms Costello said.\n\n\"It's a very difficult road to drive no matter how careful you are.\"\n\nMs Costello said she could not understand why the state government could not invest in the Punmu road, when it had given $60 million to Gina Rinehart's Hancock Iron Ore to help seal a road between two of its mines in the same region.\n\n\"Why is the government putting money into that road while neglecting other roads which are vital routes?\" she said.\n\n\" The route through our community goes straight to Alice Springs. It's a lifeline to us, not just for food but for essential services. \"\n\nRoad conditions in the east Pilbara have been in the spotlight this year. (Supplied: Michael King)\n\nThe condition of the east Pilbara's roads has attracted attention from political parties on opposite ends of the spectrum.\n\nThe Greens' Sophie McNeill and the Nationals' Julie Freeman have both visited Punmu this year to advocate for more state funding.\n\n\"It's an incredible story how the Punmu community came together to save this critical food order … but it shouldn't have had to come to that,\" Ms McNeill said.\n\n\"These remote communities need to be better supported by our government, and the state of the roads are just atrocious and it's not viable.\"\n\nWA Transport Minister Rita Saffioti was contacted for comment but did not reply ahead of publication.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-04/victoria-helen-silver-review-public-sector-job-cuts/106099806",
        "title": "Victorian government targets executives as 1,000 public sector jobs cut",
        "publish_date": "Wed, 03 Dec 2025 22:00:14 +0000",
        "category": "finance",
        "authors": [],
        "text": "More than 1,000 public service jobs will be slashed under a cost-cutting plan intended to save billions of dollars unveiled by the Victorian government.\n\nTreasurer Jaclyn Symes today publicly released the final report from Helen Silver — the top bureaucrat tasked with streamlining Victoria's public sector by identifying inefficiencies and consolidating government entities — as well as her government's response.\n\nThe government said the cuts would save more than $4 billion over the next four years but would not affect frontline services.\n\nAbout 330 senior executive and technical specialist roles will be cut, saving $359 million over the next four years, while reducing spending on consultants is estimated to save $113 million.\n\nIt comes as the government seeks to rein in employee costs, which have ballooned from $18.8 billion in 2014-2015 to an estimated $38 billion in 2024-2025.\n\nFiring higher-level public service staff, known as VPS5 and VPS6, is expected to net savings of $125 million over the four-year estimates period.\n\nPremier Jacinta Allan said the cost-saving measures would save $4 billion over the next four years. (ABC News)\n\nThe government estimates more than 1,000 public sector roles will be cut — a figure well short of the 2,000 to 3,000 jobs Ms Symes flagged when she commissioned the Silver review in February.\n\nAbout 315,000 full-time equivalent staff were employed in the overall public sector as of June 2024, according to the state government, or about 10 per cent of the state's labour force.\n\nPremier Jacinta Allan said the cuts would save a considerable amount of money.\n\n\"The actions and responses to the Silver report will deliver $4 billion in savings across the Victorian budget and these are savings that mean that we can continue to deliver those frontline services that matter most to Victorian people,\" she said.\n\n\" This is about looking at how we build our public sector for the future. \"\n\nMs Symes said the cutting of executive public sector roles would reshape the sector.\n\n\"What Helen did identify is that the public service is hard-working and dedicated, but has become top-heavy,\" she said.\n\n\"We have a situation where we have too many executives, too many in the top of the range and not enough entry-level and graduate positions.\n\n\"This is about a transformation of how the public sector will look in the future and, indeed, I very much welcome those recommendations.\"\n\nThe CPSU said the government had already been cutting public sector jobs based on recommendations from the Silver report. (ABC News: Simon Tucci)\n\nCommunity and Public Sector Union (CPSU) assistant secretary Mitch Vandewerdt-Holman said the government had already been implementing the Silver review's recommendations \"by stealth\".\n\nHe said 619 of the 1,055 jobs to go had already been cut.\n\n\"We've been fighting every single one of those cuts. We will continue to fight to save as many jobs as possible,\" he said.\n\nThe CPSU welcomed the focus on senior-executive positions being cut.\n\nCuts fall short of report's recommendations\n\nThe review itself, finalised and handed to the treasurer in June, recommended slashing 2,000 jobs.\n\nIn May, the treasurer also foreshadowed that cuts would focus on the state's public entities and boards, which cost $35 billion every year.\n\n\"Victoria has over 500 entities and 3,400 boards and public committees, so you can't tell me there's not some fat to cut there,\" Ms Symes said in her May budget speech.\n\nToday's cuts announcement will see the number of public entities reduce by 29 — far fewer than the 78 recommended in the review.\n\nThe Silver review estimated reducing the number of public entities by 78 would save $427 million over four years. The government initially claimed it would save the same amount, despite slashing 49 fewer than recommended, but later admitted those savings would only amount to $27 million.\n\nUnder the changes, the government also says it will halve the number of business regulators by 2030.\n\nThe establishment of a new regulator called Safe Food Victoria will combine separate food safety regulators for dairy and meat.\n\nPremier announces cost-cutting review Premier Jacinta Allan announces a review of public sector spending that could see up to 3,000 public sector workers made redundant.\n\nThe Victorian Legal Services Board will be merged with the Legal Admissions Board, while HealthShare Victoria and VicHealth — responsible for healthcare procurement and health promotion respectively — will be absorbed into the Department of Health.\n\nThe review made 52 recommendations. The government accepted 27 in full, three in part and 15 in principle.\n\nMs Symes said the government may choose to revisit some of the recommendations it had chosen not to accept.\n\n\"That is not necessarily indicating that we won't go further in the future; it's recognition that some of her recommendations will take some time,\" she said.\n\n\"For example, her recommendation to combine a lot of the workplace regulators is something that has merit, but right now I have a piece of legislation in the parliament that affects the labour hire authority.\n\n\"Now is not the time to merge other entities into that organisation while we're bedding down important functions.\"\n\nVictorian Opposition Leader Jess Wilson said the report was an admission of failure by the government to rein in spending. (ABC News)\n\nIt rejected seven recommendations, including a proposal that the government pause building more early learning and childcare centres beyond those already operating or under construction, as well as cut funding for musical instruments in secondary schools.\n\nThe government also declined to merge the state's retail water authorities, despite recent bungles with Greater Western Water's billing system, noting \"the different needs and infrastructure requirements of local communities\".\n\nVictorian Opposition Leader Jess Wilson said the Silver review was \"a $4 billion admission of failure\".\n\n\"Labor's mismanagement and top-heavy bureaucracy is driving Victoria deeper into debt and starving critical funds from the frontline community safety, health and housing services Victorians deserve,\" she said.\n\n\"This report issues a stark warning over the dire impact Victoria's soon-to-be $1 million an hour interest bill is having on our capacity to deliver frontline services now and into the future.\n\n\"These supposed savings are a drop in the ocean. Since this report was handed to Labor in June, Victoria's net debt has grown by almost twice the claimed savings Labor's cuts will deliver.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-04/asx-markets-business-news-live-updates-december-4/106099782",
        "title": "Live: Risk of 'imminent' RBA rate hike rising",
        "publish_date": "Wed, 03 Dec 2025 21:30:23 +0000",
        "category": "finance",
        "authors": [
            "Michael Janda",
            "David Taylor",
            "Gareth Hutchens",
            "Daniel Ziffer"
        ],
        "text": "After the initial discussion about private investment, the discussion at the Senate's economics legislation committee has shifted to another topic.\n\nOn Monday night, officials from the National Audit Office were asked about the matter of Treasury making payments worth $2.3 billion to the states that may have been in breach of the constitution.\n\nIt relates to some passages in Treasury's 2024-25 annual report, which was published on October 24.\n\nTreasury's annual report contained this passage:\n\nCompliance with Statutory Conditions for Payments from the Consolidated Revenue Fund\n\nSection 83 of the Commonwealth of Australia Constitution Act 1900 (the Constitution) provides that no amount may be paid out of the Consolidated Revenue Fund except under an appropriation made by law. Treasury has controls in place to reduce any instances of non-compliance with section 83 wherever possible and ensure there is no intentional misuse of funds. Recovery action is taken to rectify any instances of non-compliance as soon as it is identified. During 2025-25, Treasury continued to monitor and adapt its verification procedures for payments made under the Federation Financial Relations Act 2009 and the Federation Reform Fund Act 2008. The Treasury identified that eight payments made to the States and Territories in 2024-25 totalling $2.28 billion relating to the Energy Bill Relief extension scheme were in breach of section 83 of the Constitution. The payments were made without appropriate written ministerial authorisation in place for the senior official to approve the payments on the Minister's behalf. The States had met the requirements for the payments therefore the potential breaches are technical in nature. Written authorisation from the Minister for the relevant senior officials to approve these payments was put in place and internal processes updated to align with the revised authorisation.\n\nOfficials from the National Audit Office appeared before Senate estimates on Monday, and they were asked about it.\n\nHow could Treasury make eight payments totalling $2.28 billion that were in breach of the constitution?\n\nHere's how part of that conversation went:\n\nLIBERAL SENATOR JAMES PATERSON: How would you characterise payments of this volume being made without ministerial authorisation? MS CARLA JAGO, GROUP EXECUTIVE DIRECTOR: We expect that all payments are made in accordance with the law. Steps were taken in this instance, when the issue was identified, to rectify that so that they were retrospectively authorised. Senator PATERSON: But prior to those steps being taken, these payments were unlawful, weren't they? Ms Jago: Our understanding is that they were in breach of section 83 of the Constitution before they were retrospectively authorised. Senator PATERSON: Is it a serious thing, in the ANAO's view, that a department is making unlawful payments to the tune of $2.3 billion? Ms Jago: We see any potential breach of section 83 of the Constitution as a serious matter. Senator PATERSON: Is there a difference between a technical breach and a serious breach of the law? Ms Jago: I'm not sure what a technical breach versus a serious breach— Senator PATERSON: Nor am I. That's why I am asking. MS RONA MELLOR, DEPUTY AUDITOR-GENERAL: You'd appreciate that we're very black-and-white people. A breach is a breach. Senator PATERSON: You should be, and I agree with you. A breach is a breach. An unlawful payment of any money is a worry but particularly when it's $2.3 billion. Ms Mellor: You would hopefully be aware that, in December, we would normally table a summary of all financial statements and results, and we do include in that summary what we call 'L findings', or breaches, and there will be some. This one, in the evidence Ms Jago's given, sounds like it was rectified and wouldn't be reported as a breach, because it was rectified. But certainly, as we're auditing, when we see legislative breaches, we report on those to the parliament at the end of the calendar year.\n\nIn my next post, I'll cover what Ms Wilkinson had to say about the matter.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-04/wallabies-and-all-blacks-drawn-into-same-world-cup-group/106099738",
        "title": "History made as Wallabies and All Blacks drawn into same World Cup group",
        "publish_date": "Wed, 03 Dec 2025 21:30:02 +0000",
        "category": "sports",
        "authors": [],
        "text": "Wallabies coach Joe Schmidt could be the centre of a trans-Tasman tug-of-war after Australia and New Zealand were pitted in the same group at a Rugby World Cup for the very first time.\n\nThere were groans of excitement when the All Blacks landed alongside the Wallabies in Pool A at Wednesday night's much-anticipated draw for the 2027 global showpiece in Australia.\n\nThe southern hemisphere superpowers will both be unbackable favourites to beat minnows Chile and Hong Kong China in their other two pool matches, leaving the winners of the Bledisloe Cup-like battle certain to top the group.\n\nWhat is anything but certain, though, is Schmidt's future beyond his two-and-a-half-year tenure with the Wallabies.\n\nThe New Zealander will hand over the Wallabies coaching reins to Les Kiss next August after answering an SOS call from Rugby Australia to stay on until after his successor completes his 2026 Super Rugby commitments with Queensland.\n\nSchmidt had initially been due to finish up after this year's series against the touring British & Irish Lions before twice having his contract extended by Rugby Australia.\n\nAsked on Wednesday night if he would consider staying on in some capacity — most likely as an advisor to good friend Kiss — until the end of the World Cup, Schmidt offered a coy, \"not at this stage\".\n\n\"At the end of July is when I finish, and I've just hugely enjoyed the group,\" he said.\n\n\"They work really hard for what they get and it will be tough to walk away and leave them in what I believe is good hands.\"\n\nSchmidt has a son with severe epilepsy in New Zealand.\n\n\"So some of the other priorities I've got … I've had two weeks at home in the last five months,\" he said.\n\n\"So I think getting home a bit more often will be the preference at this stage.\"\n\nPressed further on whether Kiss could twist his arm, Schmidt said: \"Yeah, look, I've had the privilege of coaching in three World Cups and loved and hated them in different measures depending on how things work out.\n\n\"I've been good friends going back a fair way with Les and so we'd always be chatting anyway.\"\n\nSchmidt was an All Blacks assistant coach at the 2023 World Cup in France, when New Zealand lost an epic final 12-11 against the Springboks.\n\nThe 60-year-old would be an obvious target for the NZRU, especially given the draw and his insight on the Wallabies.\n\nAnd he didn't completely close the door on a return to the All Blacks, leaving the door ajar when quizzed about the prospect.\n\n\"I'm not looking to be involved at all, either side,\" Schmidt said.\n\n\"I may well be in the stadium watching. I'd say that I'll just be delighted to be there and spectating because Rugby World Cups are really special occasions.\n\n\"Having been at three of them, just the whole atmosphere around them.\n\n\"It builds into a crescendo for match days and some of the gatherings around stadiums and those sort of things.\n\n\"I'm just excited that it's only two years away now and I can't wait for it to come up and, in some ways, I can't wait not to be involved so that I can just enjoy it because it's pretty nerve-wracking when you're in the midst.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nThe result of their historic first pool showdown with the All Blacks will shape the seventh-ranked and struggling Wallabies' path to an improbable fifth World Cup final.\n\nIf they conquer the mighty All Blacks, the Wallabies would almost certainly face two-time defending champions South Africa in the quarterfinals.\n\nIf they lose to New Zealand, the hosts would likely meet Eddie Jones's Japan in the round of 16, then England in the quarters and either Ireland or Argentina in the semifinals.\n\n\"In a World Cup, if you want to win it, you've got to beat the best teams,\" skipper Harry Wilson said after Wednesday night's draw.\n\n\"There are a lot of potential paths you can go down.\n\n\"But if we get the Springboks in a quarter-final, it will be exciting. It's a challenge which we're going to have to be ready for.\"\n\n2027 Rugby World Cup groups\n\nPool A: New Zealand, Australia, Chile, Hong Kong China\n\nPool B: South Africa, Italy, Georgia, Romania\n\nPool C: Argentina, Fiji, Spain, Canada\n\nPool D: Ireland, Scotland, Uruguay, Portugal\n\nPool E: France, Japan, USA, Samoa\n\nPool F: England, Wales, Tonga, Zimbabwe\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/mcilroy-reflects-on-rollercoaster-round-20251204-p5nkvn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "McIlroy﻿ reflects on 'rollercoaster' round",
        "publish_date": "Thu, 04 Dec 2025 13:04:20 +1100",
        "category": "finance",
        "authors": [],
        "text": "McIlroy﻿ reflects on 'rollercoaster' round\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-australia-leaves-fate-of-isis-brides-to-us-military-labor-announces-first-military-support-package-for-ukraine-in-over-a-year-20251204-p5nkp2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: House Democrats release new footage of Jeffrey Epstein’s private island; Fate of ISIS brides left to US military",
        "publish_date": "Thu, 04 Dec 2025 13:03:36 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Australia’s gold-tinged export performance continues to shine brightly.\n\nNew figures from the Australian Bureau of Statistics this morning showed the country shipped $5.7 billion in non-monetary gold to the rest of the world in October.\n\nIt was the second-largest monthly result on record, only eclipsed by the $6.1 billion exported in July.\n\nOver the past 12 months, gold exports reached an all-time high of $55.4 billion, a jump of 62 per cent over the previous 12 months.\n\nNew figures from the Australian Bureau of Statistics this morning showed the country shipped $5.7 billion in non-monetary gold to the rest of the world in October. Credit: Bloomberg\n\nIf not for the surge in gold exports, Australia’s total merchandise exports would have gone backwards over the past year.\n\nOf the nation’s major exports, only beef, which has jumped by 33 per cent to $17.8 billion, has increased over the past year.\n\nIron ore remains the most valuable export at $120.3 billion, down by 7 per cent. Coal exports have slipped by a quarter to $66.3 billion while LNG exports eased by 8 per cent to $62.1 billion.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/health-and-wellness/feeling-the-afternoon-slump-a-dietitian-suggests-these-foods-over-quick-fixes-20251126-p5nirr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Feeling the afternoon slump? A dietitian suggests these foods over quick fixes",
        "publish_date": "Thu, 04 Dec 2025 13:00:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Nicole Economos"
        ],
        "text": "If you keep eating like this you’ll… Likely fall short on key nutrients, especially fibre and calcium, with no fruit, very few vegies at lunch, and no wholegrains, legumes, nuts or seeds through the day. That can leave your gut microbiome underfed, your long-term bone health under pressure, and your appetite regulation a bit more wobbly than it needs to be.\n\nWhy don’t you try… Boosting your breakfast with a handful of spinach or rocket, choosing wholegrain sourdough, and adding a seaweed salad or extra veg to your sushi lunch. Beat the afternoon slump with a snack of nuts and a piece of fruit, which will also lift fibre and healthy fats while keeping your microbiome well nourished.\n\nAshleigh Vallis is the founder and creative director of Summi Summi.\n\nGet the best of Sunday Life magazine delivered to your inbox every Sunday morning. Sign up here for our free newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-edge-up-wall-street-drifts-near-its-all-time-high-20251204-p5nkok.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Property stocks weigh on ASX, miners rise",
        "publish_date": "Thu, 04 Dec 2025 12:46:34 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporters"
        ],
        "text": "The Australian sharemarket is swinging between modest gains and losses, ignoring a positive lead from Wall Street, where stocks finished near record highs on hopes that a cut to US interest rates is coming at December’s Federal Reserve meeting.\n\nAfter a positive start to the session, the S&P/ASX 200 briefly dipped into the red and then rebounded. It was up just 2.9 points at 8598.1 at 12.21pm AEDT, with four of its 11 industry sectors in positive territory. The Australian dollar was trading at US66.10¢ at 11.40am AEDT.\n\nWall Street advanced overnight on rising hopes that an interest rate cut is coming at the Fed’s December meeting. Credit: AP\n\nTrade balance figures released this morning showed that Australia’s trade surplus widened to $4.39 billion in October 2025, up sharply from a downwardly revised $3.71 billion in September and surpassing market expectations. Consensus forecast was for a trade surplus of $4.2 billion, according to Trading Economics.\n\nMining stocks were higher, with copper prices hitting a record high overnight as a surge in orders to withdraw metal from London Metal Exchange warehouses compounded worries that potential US tariffs will fuel a global supply squeeze.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/richo-call-will-be-made-on-monday-boss-of-wests-tigers-owners-breaks-his-silence-20251204-p5nkq5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Richo call will be made on Monday’: Boss of Wests Tigers’ owners breaks his silence",
        "publish_date": "Thu, 04 Dec 2025 12:07:15 +1100",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "DP: “We were supporting Shane from the outset. He’s come back and expressed that he’s got some things to think about, and Shane needs to make a decision now.” AP: Do you believe that he’ll be at the helm of Wests Tigers for the start of next year? DP: “We’ll respect his decision. That’s up to Shane, and he’ll come back to us.” AP: It feels like everything is in limbo until we know whether he’s going to be the CEO of the Wests Tigers long term. Have you had discussions with him about a time frame as to when he will decide?\n\nDP: “I’ve been in discussions with Shane … asking when he would come back with an answer. He responded that he’s still thinking about it but will come back with an answer on Monday … it really needs to be resolved sooner rather than later.” AP: You talked about a lack of communication – and obviously the four independent directors are no longer there – what responsibility does Shane Richardson bear for that? DP: “I think some of the decisions that were made, that should have come to the Holman Barnes Group for approval, certainly didn’t happen. And that’s coming from the CEO and the board.” AP: Is there anything in the [ownership] agreement whereby certain actions taken by the football club have to come back to you either for ratification or to inform you of what’s going on? DP: “That’s correct. In the agreement, there is a threshold limit that if transactions – let’s say transactions above a certain limit – need to come back to Holman Barnes Group for approval.”\n\nAP: Such as player signings above a certain [financial] limit? DP: “That’s correct.” Wests Tigers CEO Shane Richardson. Credit: Oscar Colman AP: And that hasn’t been happening. DP: “Not that I’m aware of.”\n\nAP: The narrative is that there has been some discontent about the jersey, that it contains too much Tiger and not enough Magpie. Is that the case? DP: “The colours of the jersey have not come up at all as part of this process. I think that’s a rehash of some old narrative … this has been floating around for years. This is trivial, and to think this is a reason for Holman Barnes Group taking this decisive action is laughable.” AP: The other thing that’s been discussed recently is this idea that there’s a push for Western Suburbs Magpies to take over, to push Balmain out of the joint venture. Is that the case? DP: “That’s not the case at all. The Holman Barnes Group is fully supportive of Wests Tigers. There’s been no talk about bringing back the Magpies. Once again, I think that’s a narrative that’s been rehashed from a couple of years ago.” AP: There’s no doubt the Holman Barnes Group has a good track record of managing clubs – but less so when it comes to football clubs. It’s been 14 years since the Tigers last finals appearance. Why should fans have any faith in the regime?\n\nDP: “Well, that’s correct. And that’s what we’re hoping to rectify under Benji Marshall’s leadership. If the football operation can keep progressing as they have, they’re on the improve. We’d like to see us get back to playing finals football.” AP: What do these changes mean for Benji Marshall? DP: “Benji has got our full support. He’s an absolute club legend and we think he’s a great coach. We absolutely want him here for the long term.” Wests Tigers coach Benji Marshall has the full support of the Holman Barnes Group. Credit: Getty Images AP: ARL Commission chairman Peter V’landys said he is concerned about what had transpired at board level and that he wanted the NRL to investigate. Are you concerned that head office is concerned?\n\nDP: “I think because it’s a purely governance issue between the boards – and there is a current agreement in place with Holman Barnes Group and Wests Tigers – I don’t believe that NRL should be concerned over this.” AP: Should they be concerned about the performance of Wests Tigers because obviously the two are tied together? DP: “Like I said, we’re progressing in the right direction. So I think if the NRL looks at on-field performance as well as financial performance, then we should be heading towards the finals.” AP: Is there still tension between Balmain and Western Suburbs, the two factions in the joint venture marriage? DP: “In the past, there’s certainly been a lot of tension between Wests and Balmain. We’ve had the Balmain board meet with the Wests Ashfield board, and what’s been great is that I feel like we’re more unified than ever. For example, Wests Ashfield has made it clear to Balmain that we want them to be part of the joint venture.\n\n“They retain their 10 per cent share in West Tigers, they retain their board seat in Wests Tigers. Wests Ashfield will continue to fund the Balmain Football Club and is now funding the Balmain District Juniors. So we’re very much committed to supporting Balmain and continuing on in the joint venture.” AP: At some clubs, it’s pretty easy for the membership, if they are disgruntled, to affect change. For instance, at Canterbury, you only need to get about 110 signatures to force an extraordinary general meeting. Under the ownership structure with the Holman Barnes Group, and its relationship with Wests Tigers, there’s basically no lever to pull if you’re a disgruntled member or a fan. You need to be a debenture holder, and it’s all very tightly controlled. Can you understand their frustration in that they are seeing this [boardroom brawl], they are seeing a lack of performance on the field, and there is nothing they can do about it? DP: “Absolutely, I can see the frustration … I’m a fan myself, but we are progressing in the right direction. With the right people in place at the football department, I think we will progress and continue to progress. On-field performance is everything, and that’s what we need to focus on.” The long-term future of Tigers playmaker Jarome Luai remains unresolved. Credit: Getty Images AP: Speaking of things on the field, two of your highest profile players, Jarome Luai and Jahream Bula, have yet to commit long term. They have clauses or options in their contracts in their favour, and it was suggested they were close to committing – until the latest developments. Are you concerned that they might slip through your fingers because of what’s transpired?\n\nDP: “That’s a question for the football department. I haven’t seen the contracts, so I’m not aware of the clauses that we’re talking about. However, I do believe that they’re close to re-signing, and I’d like to think they would.” AP: A protest march has been arranged. Are you concerned about disgruntled Wests Tigers fans making their presence felt and making their voices heard? DP: “We understand the passion that fans have and we appreciate that this announcement has caused upset. We have no problem in fans making their voices heard, however marching to Wests Ashfield and potentially intimidating innocent staff members is not something we would condone and I would urge the organiser to rethink this action.” AP: Should all the [feeder teams, such as NSW Cup, Jersey Flegg, etc] be playing under the Wests Tigers jersey, banner and logo, given it is supposedly one club? DP: “That’s something for the new Wests Tigers board to start getting their head around and make decisions on.”\n\nLoading AP: What’s the position of the Holman Barnes Group on that? “The Holman Barnes Group obviously has a number of teams under their umbrella, Wests Tigers and Wests Magpies being two of those, as well as the registered clubs. So we support all our teams.” AP: Will the Holman Barnes Group now start sticking their beak into football, interfering and meddling in football matters? DP: “No, it’s not for the Holman Barnes Group to get involved with football operations and player signings. But it is their responsibility to ensure that due diligence is done correctly around the selection of those players. So it’s just ensuring that governance and those systematic measures are in place.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/victoria/1000-jobs-to-be-axed-from-public-sector-but-government-shirks-deeper-cuts-20251204-p5nkpw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "1000 jobs to be axed from public sector but government shirks deeper cuts",
        "publish_date": "Thu, 04 Dec 2025 12:06:14 +1100",
        "category": "finance",
        "authors": [
            "Chip Le Grand",
            "Kieran Rooney"
        ],
        "text": "Loading It also baulked at a recommended wholesale restructure of public utilities, which would have resulted in 14 water boards merging into three. Silver called for the government to cease funding programs that provide musical instruments and doctors for high schools, and reduce the Better Boating Fund, all of which were rejected. However, it agreed to end a paid special leave program for health workers with COVID-19, in place since the pandemic. Targeted reviews of TAFE were recommended, but the government only committed to support this on a voluntary basis.\n\nThe Independent Review of the Victorian Public Service, which was commissioned by Treasurer Jaclyn Symes in February shortly after she moved into the job, urged the government to take “immediate action” to reduce the sprawling growth of public sector entities since the pandemic. “There are good reasons for establishing entities to achieve a policy goal at a particular point in time, and they employ many talented and dedicated staff,” the Silver review found. Loading “However, the large and growing number of public entities and their complexity are creating duplication and confusion, and stifling public and private sector productivity.” The report found that the substantial direct and indirect cost to the government of maintaining these entities and an extraordinary 3200 public boards and committees – a number greater than any other state or territory – undermined efforts to reduce public spending.\n\nSymes said the measures adopted by the government would make the public sector more efficient while avoiding frontline job cuts. “Frontline workers are excluded from the scope of this review,” she said. “Bringing together entities with similar functions makes it quicker and easier for individuals and businesses to interact with government by offering cleaner points of contact and fewer processes and forms to deal with.” Symes said she accepted Silver’s analysis that Victoria’s large number of entities, and their complexities, could be confusing and put a handbrake on public and private productivity. “Not only is it tying up some bureaucrats’ time, it’s creating numerous doors of entry for citizens, stakeholders and businesses,” she said. “Time is money. I hear this when I’m out there talking to the business community.”\n\nSymes said the public service had too many executive positions and not enough graduate and entry-level roles. She would not be drawn on how the savings would affect her operating surplus for this financial year. An updated figure for this will be reported on Friday as part of the state’s mid-year budget update. The full recommendations of the Silver review, which were presented to the government in July, would have netted budget savings of about $5 billion. Opposition Leader Jess Wilson said the review was an admission of failure, accusing the government of mismanagement and a top-heavy bureaucracy that was driving debt. “This report issues a stark warning over the dire impact Victoria’s soon to be $1 million an hour interest bill is having on our capacity to deliver frontline services now and into the future,” she said.\n\n“These supposed savings are a drop in the ocean. Since this report was handed to Labor in June, Victoria’s net debt has grown by almost twice the claimed savings Labor’s cuts will deliver. “The only ones cutting jobs and services are Premier Jacinta Allan and Treasurer Jaclyn Symes.” Community and Public Sector Union state secretary Jiselle Hanna said it was good the treasurer had not embarked on bigger job cuts as first feared, but rejected the review’s suggestion the government should be smaller. “Government already cannot do what Victorians expect it to,” she said. “The blind-faith obsession with outsourcing costs the state more by reducing our capability,\n\nincreasing long-term costs, and making budget repair harder.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/what-works-and-what-doesn-t-in-the-new-metro-tunnel-20251202-p5nk59.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What works – and what doesn’t – in the new Metro Tunnel",
        "publish_date": "Thu, 04 Dec 2025 12:03:21 +1100",
        "category": "finance",
        "authors": [
            "Patrick Hatch"
        ],
        "text": "Each station also has accessible toilets, parents’ rooms and adult changing place facilities. A Travellers Aid hub at Parkville will open soon and help passengers get between the station and nearby hospitals. Stations could do with more seating, though. Good: Architecture and design The Arden station entrance features massive concrete arches lined with more than 100,000 hand-laid bricks, reflecting North Melbourne’s rich industrial history. Credit: Justin McManus It’s hard not to be impressed walking through the five new underground stations. High ceilings and wide platforms create a sense of space and openness that is a world away from their grubby City Loop counterparts.\n\nArden station’s redbrick arches will surely become one of the city’s architectural landmarks. The coupling of raw cement – most impressively in State Library station’s arched entrance – with Art Deco-inspired lighting and fixtures reflects the city above it. It feels undeniably Melbourne. Signage is clear, and the connections between CBD interchange stations are intuitive to follow. There are escalators galore – including a wall of five at the State Library entrance – to avoid the passenger congestion experienced at other CBD stations, and provide redundancy during breakdowns (looking at you, Southern Cross).\n\nBad: Deja vu The quiet State Library station on Monday morning. Credit: Justin McManus The platforms at Town Hall and State Library look nearly identical – especially on board an arriving train. And because not every cement column on the platform is signed, it might not be obvious which station you are arriving at. Making the two stations distinct was a missed opportunity to explore different design ideas while making life easier for commuters.\n\nGood and bad: Anzac tram interchange The canopy at Anzac isn’t up to the job. Credit: Wayne Taylor Anzac station’s integrated tram stop works excellently. Transferring from St Kilda Road trams and directly down into the station takes just a couple of minutes. For many, getting on a train here will be quicker than taking a tram all the way up Swanston Street. It doesn’t all work well, though. The 85-metre wooden canopy at Anzac is an attractive structure – but too small to protect passengers from the elements while transferring to/from a tram. It also fails to stop rain falling onto Anzac’s concourse. Staff had to erect “wet floor” signs there during light rain on Monday.\n\nGood: Platform screen doors Platform screen doors improve safety and comfort. Credit: Simon Schluter Platform screen doors at each of the five stations are a big step up for passenger comfort. There’s no loud whoosh of air as trains arrive or depart. They make platforms safer, quieter and easier to keep warm and cool. One nifty feature: the displays showing passenger loads in each carriage on the next arriving train, so you can board at a door with the most room. Not all doors are in use right now, however, and this could be signed better. Metro is operating seven-carriage trains in the Metro Tunnel, but the platforms are long enough to accommodate 10-carriage trains in the future. Doors not in use have signs that say “Board trains this way →” but The Age saw plenty of passengers expecting trains to arrive there, perhaps thinking the sign indicated the direction of travel.\n\nGood: Artwork Danie Mellor’s work Forever at State Library station. Credit: Wayne Taylor Future generations of Melburnians will be grateful for the public artworks included at the new stations. Patricia Piccinini’s colourful ceramic tiles at Parkville seem to be a favourite among visitors. Danie Mellor’s work Forever, consisting of photographic portraits of Wurundjeri Woi Wurrung women printed on huge glass panels along La Trobe Street, is a beautiful addition to the city.\n\nBad: Advertising onslaught The unfinished digital advertising screen at Town Hall station. Credit: Gemma Grant When taking the escalators from the new City Square down into Town Hall station, passengers come face-to-face with a large wall crying out for another mural or artwork. Instead, an enormous LCD screen – we’re talking IMAX here – will assault commuters with “immersive 3D anamorphic display” advertising. A three-screen digital wrap-around also detracts from the State Library station’s impressive entrance.\n\nThe stations were supposed to celebrate Melbourne’s history and people. Too many of them have fallen victim to the rapacious commercialisation of public life. The wraparound advertising screens at State Library. Credit: Wayne Taylor Bad: Fast food The use of retail space is uninspired. There’s a McDonald’s at Town Hall, while Parkville has a Maccas and a KFC. The doctors at the Royal Melbourne and Peter Mac won’t love that patients have access to so much junk food on their doorstep. The iconic Campbell Arcade is now accessible from Town Hall. It was home to an independent coffee shop, a record store and the Sticky Institute zine hub before it was emptied during construction. Let’s hope it rekindles that quirky and creative spirit when the shopfronts are leased out again.\n\nBad: CBD station myki glitch The underground concourse connecting State Library station to Melbourne Central. Credit: Jason South Town Hall station connects to Flinders Street Station. State Library connects to Melbourne Central. Passengers can transfer between them without going through myki gates – in effect, forming two CBD mega stations served by both the Metro Tunnel and City Loop. But the myki ticket system treats them as separate stations.\n\nLoading Usually, if you enter a station, change your mind about travelling and exit the same station within 15 minutes, you are not be charged a fare. But if you enter Town Hall, change your mind and then exit via the Melbourne Central gates, your myki will be charged. Transport Victoria says it is working to change this, and also make it possible for anyone to use these underpasses without touching on. Until then, one gate is left open at Town Hall and State Library.\n\nBad: Bicycle parking The absence of secure or even undercover bicycle parking at Arden, Parkville or Anzac is a baffling oversight. There are bicycle hoops, all vulnerable to the elements and thieves. Loading Good bicycle parking can encourage commuters to combine a short bike ride with a train journey, massively enhancing the catchment of people who can access a station. The Dutch, of course, do this best: at Utrecht station, commuters can ride directly into its three-level, 12,500-bike underground parking facility. That might be overkill for Melbourne. But the Metro Tunnel stations don’t even have the lockable Parkiteer bike cages, which are installed at many suburban stations.\n\nGood and bad: Public space The revamped City Square, above Town Hall station, is a welcome addition to a CBD that is starved of communal space. It’s a shame that other opportunities to create new public spaces were missed. The project initially planned to permanently close Franklin Street (between City Baths and RMIT) to create a new pedestrian zone and public space, but that was scrapped. The redeveloped City Square. Credit: Joe Armao The Swanston Street vehicle-free zone should have been extended north to A’Beckett Street, past State Library station.\n\nLikewise, one or both sides of Flinders Street were closed for years during construction. People have gotten used to it. It could have stayed closed to make room for the tens of thousands of pedestrians set to pour out of Town Hall and Flinders every morning. Instead, they’ll have to squeeze onto already overcrowded footpaths when it reverts to a traffic thoroughfare. Bad: Soft launch timetable Almost every Melburnian will be aware that the Metro Tunnel is now open. But how many will have read the fine print? It is only open between 10am to 3pm on weekdays, and until 7pm on weekends. Trains run only every 20 minutes. The full timetable starts on February 1.\n\nIt’s inevitable that some people will leave home thinking they can get a train to Parkville, only to find the tunnel is closed for the day. Visitors here for the Australian Open and other events this summer will be confused too. Bad: The line with no name In New York you can get on the “A” train to Harlem. Londoners ride the Jubilee and Suffragette lines. Metro Tunnel will operate the newly connected Sunbury and Cranbourne/Pakenham lines. Passenger information displays at Anzac. Credit: Wayne Taylor\n\nNot just a mouthful, it can be confusing, too. Melbourne’s train lines are named after their final terminus (the Hurstbridge Line, the Glen Waverley Line). That’s fine if they only travel into the CBD and back again to their origin. It doesn’t work for the 100 kilometre end-to-end Metro Tunnel. As it stands, Pakenham Line trains go to Sunbury, and Sunbury Line trains go to Cranbourne or East Pakenham. If they applied the convention used on the London Underground, customers would be told they need a “Metro Line: Sunbury” train to travel towards Sunbury. Much easier to understand.\n\nGood: Cross-city travel People say the Yarra is the physical and psychological barrier that divides Melbourne. I’d argue the City Loop is just as significant. The Metro Tunnel bridges the divide, making it possible to travel directly from the outer north-west all the way to the outer south-east. Over time, this will change how Melburnians conceive the city and their place in it. People will be more willing and able to cross the city for work, study or leisure. Melbourne will be a smaller, more connected place.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/an-arrest-the-rat-pack-and-a-speech-that-brought-the-house-down-swan-quips-his-way-into-pies-hall-of-fame-20251204-p5nkr1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An arrest, the Rat Pack and a speech that brought the house down: Swan quips his way into Pies’ hall of fame",
        "publish_date": "Thu, 04 Dec 2025 11:58:49 +1100",
        "category": "sports",
        "authors": [
            "Michael Gleeson"
        ],
        "text": "Loading Milligan famously accepted a lifetime achievement award at the British Comedy awards saying, “About bloody time … I’m not going to thank anybody because I did it all on my own.” Read a letter of praise from Prince Charles he dismissed the now King as “the little grovelling bastard”. Swan was as gloriously irreverent as Spike. He mentioned his family and kids but added they didn’t deserve any thanks because they weren’t around when he played. Besides, he loves them, “but I don’t necessarily like them all the time”. He thanked his teammates, but “they rode on my coat-tails, so I probably don’t need to thank them”.\n\nSwan is the most disarmingly entertaining after-dinner speaker and interviewee in football. Self-deprecating and dry, he thanked the fans for their support, “although there are no fans here, we all know it’s just rich people and players” in the room. The rich people and players guffawed loudly. “The love I received from the fans, and I guess as a ‘Rat Pack’ we did, clearly you made me bigger than what I was or what I am. So I thank you for that,” he said. Dane Swan and Alan Didak celebrate the club’s 2010 premiership. Credit: Joe Armao And this is the nub of Swan. An outrageously good footballer in his peak years after 2007 or 2008 until his retirement, he was just outrageous in his early years. He described himself as a kid who was as surprised as anyone to find himself on an AFL list.\n\nLoading “I got dropped halfway through the year I got drafted for having a poor attitude which may shock some people, then I played three good games, and they drafted me off the back of that,” he said. “I have a got some wonderful memories from those first four years [in the AFL] but none of them have got anything to do with football. They are all hazy now – I was pretty good off the field. “Obviously, the best thing that happened to me in the AFL was – and it’s not for everyone, but it obviously worked for me – I went out and got arrested.” Yeah, it’s probably not for everyone.\n\nBut for Swan, it was the moment that prompted a new career-saving commitment. At a time when the club was bottoming out and playing kids he was given another chance. Had it not been for his arrest on assault charges in 2003 and changing his ways, he “would have been given the arse at the end of the year and that would have been it”. “I got 50 games I didn’t deserve. Mick [Malthouse] was extremely hard on me; in those team meetings he used to say some pretty mean stuff and say some personal stuff I didn’t even know about myself. I thought, ‘Someone is going to have to tell my parents, I don’t know what’s happened here’.” “Obviously, the best thing that happened to me in the AFL was – and it’s not for everyone, but it obviously worked for me – I went out and got arrested.” Dane Swan The club didn’t need to be bullied to include Swan in their Hall of Fame. His Brownlow Medal, his premiership, and his powerful indefatigable run and nous to find the goals had already made certain of his inclusion. It was not hyperbole for Matthews to say he was in the conversation as the best player in the competition at one stage. For a period of four or five years, he was clearly among the best in the AFL. But playing ability and achievements were only part of the reason, and in fact the lesser of the reasons, for the warmth with which Swan is held at the club. Swan was the everyman who played unlike the everyman. He was tattooed – he said that helped his mystique – and was not so wound up in the self-importance of the AFL as to be unable to laugh at it, and himself.\n\nHis most telling comment was that he never wanted to be the best footballer he could be, he wanted to have the best life he could have. He understood work-life balance in football before it was a thing. He commanded play with the ball and was ringmaster away from the field. He led a group of similarly talented players – Alan Didak, Ben Johnson, Chris Tarrant – who shared a thirst for life after hours. “I hope one day the Rat Pack get put in here as a group,” he said, to loud laughter. “You’re laughing but I’m serious. “I certainly wasn’t on the Men For All Seasons calendars, I wasn’t built like that. We’re just normal everyday guys who just happened to play on the MCG, we’re out doing whatever else is doing.”\n\nThis relatability is the reason he can upstage even Matthews, a football icon who has homes everywhere and nowhere, having been the player of the century at Hawthorn, coached flags at Collingwood and against them at the Brisbane Lions, but loves them all in different ways. Collingwood were the perfect fit for Swan. Dane Swan was a footy character who was beloved by the fans. Credit: Getty Images This is a club of Tony Shaw and Lou Richards. A club where a member of the original Magpie Rat Pack now runs the club. Before Swan, Didak, Johnson and Shaw, there was Craig Kelly, Denis Banks, Mick McGuane and, of course, Darren Millane. Kelly is now the CEO. The club embraced their past this night opening a new Hall of Fame section in the rebuilt museum. It includes Millane’s locker from the Victoria Park change rooms. It’s sparseness, sitting alone in the room, adds to the poignancy of recognising the premiership player who died in a car accident in his prime.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/ukraine-is-running-out-of-cash-can-europe-seize-russian-money-to-help-20251204-p5nkqi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ukraine is running out of cash. Can Europe seize Russian money to help?",
        "publish_date": "Thu, 04 Dec 2025 11:57:42 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The International Monetary Fund has estimated that Ukraine will have a €65 billion shortfall in its budget over the next two years without financial aid. About two-thirds of Ukraine’s government revenues are now devoted to the war effort. It desperately needs more cash. Loading A stumbling block to a EU plan to use the Russian assets as collateral for a €140 billion loan to Ukraine has been Belgium’s unwillingness to expose itself to Russian litigation if there is a peace deal, sanctions on Russia are lifted and Moscow demands the return of its money, which Euroclear would have a contractual obligation to comply with. That could leave Belgium on the hook for the funds, and facing insolvency. Russia has, indeed, threatened 50 years of legal warfare against Europe if its assets are touched. It would also probably seize Western financial assets (the amounts aren’t known) that it froze in retaliation for the G-7 sanctions. The latest EU proposal would involve Euroclear making an interest-free loan equivalent to the value of the Russian assets it holds, which would be used to repay EU countries for money already lent to Ukraine, with the rest lent to Kyiv.\n\nUkraine wouldn’t be required to repay the loan unless and until it received compensation – reparations – from Moscow for the damage the war has done to its infrastructure and people. The cost of remediating the damage that the war has inflicted on Ukraine has been estimated at close to the equivalent of a trillion Australian dollars. An option that has been considered in response to Belgium’s concerns is that some or all of the EU member states provide guarantees that they would underwrite the repayment of the “reparations” loan should Russia refuse to pay for the damage it has done. Alternatively, the EU could just borrow the money itself and lend it to Ukraine, hoping that repayment would be secured in future peace negotiations.\n\nWhile a loan to Ukraine, whether backed by Russia’s assets or not, would give the Europeans a direct stake in the outcome of the peace negotiations being undertaken by the US (with minimal involvement by Ukraine), it could also place the guarantor nations at financial risk if the US forces Ukraine into a deal on Russia’s terms. Loading That could happen. Under the 28-point plan that the US presented to Russia last month (with, it seems, considerable input from the Russians), apart from ceding Ukrainian land that Russia doesn’t currently control along with that it does occupy, an exclusion from Ukraine joining NATO and reducing the size of its military, all sanctions on Russia would be lifted. The agreement specifically said that frozen Russian funds would be used in US-led efforts to rebuild Ukraine, with the US receiving 50 per cent of any profits. The EU would contribute $US100 billion ($150 billion) to the reconstruction funding. The rest of the frozen funds would be invested in a separate US-Russian investment vehicle for joint projects. While the Russians rejected the proposals, the Trump administration has made it clear that it views the ending of the war as a commercial opportunity (surprise, surprise) and is less concerned about Ukraine’s interests – and those of the Europeans – than it is in its own and in Donald Trump’s desire to have his name on a peace deal, regardless of its quality.\n\nIf Ukraine’s interests are to be protected, it will be by the EU, not America. That the bulk of Russia’s offshore reserves are held within Europe does give the EU leverage to participate in any settlement, though it is extremely difficult, indeed near-impossible, to obtain a consensus from with a 27-member bloc that contains some pro-Russian voices. If the EU can agree on a mechanism for funnelling, directly or indirectly, the value of the Russian assets held within Europe to Ukraine, it would give it a place at the table because it would signal to Russia that Ukraine would have the money to sustain its defence for at least the next two years. Russia might have had some successes on the ground in Ukraine, at considerable cost in lives and equipment, but the war is taking an increasingly severe toll on its own economy, which is in the grip of stagflation, on the brink of recession and where the government’s focus on military spending is causing significant economic stresses in regions not benefiting from the war effort. A recent tightening of US sanctions on Russia oil exports, targeting both Russia’s major oil producers and, critically, their customers, will cut further and harder into Moscow’s revenues and its ability to fund the war without risking more domestic economic hardship and social unrest.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/german-president-state-banquet-underway-20251204-p5nkq7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "German President State Banquet underway",
        "publish_date": "Thu, 04 Dec 2025 11:54:34 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "German President State Banquet underway\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/music/my-spotify-listening-age-is-73-years-old-i-demand-a-recount-20251204-p5nkt8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "My Spotify listening age is 73 years old? I demand a recount",
        "publish_date": "Thu, 04 Dec 2025 11:52:35 +1100",
        "category": "entertainment",
        "authors": [
            "Robert Moran"
        ],
        "text": "I never thought Spotify’s Wrapped list would be the thing that led me to an existential crisis, but here we are.\n\nThe streaming giant’s annual round-up of users’ listening habits often produces intriguing wrinkles for social media to pore over: our top songs, albums, and genres of the year. But this year’s Wrapped, released on Thursday, has offered something new that’s confused everyone: your Spotify listening age.\n\nSpotify Wrapped’s listening age is such a lie.\n\nAccording to the streamer, your listening age is based on the idea of a “reminiscence bump”, which they define as “the tendency to feel most connected to the music from your younger years”.\n\n“First, we look at the release dates of all the songs you played this year. Next, we identify the five-year span of music that you engaged with more than other listeners your age. We’re hypothesising that this five-year span matches your ‘reminiscence bump’, assuming you were between 16 and 21 years old when those tracks were released,” Spotify said in a statement.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/motorsport/spice-girls-headline-mclarens-1997-livery-reveal-20251204-p5nkuj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Spice Girls headline McLaren's 1997 livery reveal",
        "publish_date": "Thu, 04 Dec 2025 11:51:57 +1100",
        "category": "finance",
        "authors": [],
        "text": "Spice Girls headline McLaren's 1997 livery reveal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/spotify-breaks-down-this-years-music-in-review-20251204-p5nkuh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Spotify breaks down this year's music in review",
        "publish_date": "Thu, 04 Dec 2025 11:49:18 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Spotify breaks down this year's music in review\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/opposition-probes-government-spending-midday-news-bulletin-4-december-2025/abd5dt82v",
        "title": "Opposition probes government spending | Midday News Bulletin 4 December 2025",
        "publish_date": "Thu, 4 Dec 2025 00:48:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Opposition condemns Albanese government over transparency record\n\nSuper fund reports two thirds of members afraid they can’t retire\n\nLeeds beat Chelsea 3-1 in Premier League\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe opposition is ramping up its attacks on the federal government, accusing senior ministers of misplaced priorities and a lack of transparency as cost-of-living pressures bite.\n\n\n\n\n\nLeader of the Opposition Sussan Ley today targeted energy policy, ministerial travel and concerns over national security during a fiery press conference.\n\n\n\n\n\nMs Ley singled out Energy Minister Chris Bowen over rising power prices, while also criticising Communications Minister Anika Wells for charging taxpayers almost $100,00 for an overseas trip to New York.\n\n\n\n\n\n\"The wheels are well and truly falling off the Albanese government. Last week, we learned that Chris Bowen is a part time energy minister delivering a part time energy grid. This week, we learnt that Annika Wells is a part time communications minister, but a full-time frequent flyer ... And today, we learn that Tony Burke has held secret meetings about the return of so-called ISIS brides to Australia.\"\n\n\n\n\n\nMs Ley is demanding answers from the Labor government on what senior ministers, including Foreign Minister Penny Wong, knew about the brides, and when, as well as on other matters.\n\n\n\n---\n\n\n\n\n\nNew research reveals nearly two in five Australians fear they will never be able to retire, as housing and living costs continue to rise.\n\n\n\n\n\nAccording to MFS Investment Management, about 38 per cent of superannuation members now share that concern, up from 28 per cent last year.\n\n\n\n\n\nTwo-thirds of survey respondents expect to work longer than planned.\n\n\n\n\n\nHousing has become the top financial worry, overtaking everyday expenses, with inflation close behind.\n\n\n\n\n\nFewer than half of retirees are confident their savings will deliver enough income throughout retirement.\n\n\n\n---\n\n\n\n\n\nTen major social media platforms, Facebook, Instagram, Kick, Reddit, Snapchat, Threads, TikTok, X, YouTube and, most recently, Twitch, will face fines of up to $50 million dollars if they fail to remove accounts belonging to Australians under 16 from the 10th of December.\n\n\n\n\n\nThe eSafety Commissioner will issue notices to all ten platforms on 11 December demanding data on account removals, followed by monthly requests for six months.\n\n\n\n\n\nRegulators say courts could impose the maximum penalty where breaches are systemic or repeated.\n\n\n\n\n\nCommunications Minister Anika Wells says the government expects platforms to implement age checks carefully but firmly.\n\n\n\n\n\n“The government recognises that age assurance may require several days or weeks to complete fairly and accurately … One week from today, this law is starting. Over the coming months, we will fight to defend this law in the High Court because parents right across Australia asked the government to step up.”\n\n\n\n\n\nGoogle says the reform is misguided and that it does not fulfil its promise to make kids safer online.\n\n\n\n---\n\n\n\n\n\nHong Kong’s deadly high-rise fire has claimed at least 159 lives, as police arrest six people suspected of disabling fire alarms during maintenance at the housing complex.\n\n\n\n\n\nVictims ranged from a one-year-old child to a 97-year-old resident.\n\n\n\n\n\nPolice say they have now searched seven of the eight towers engulfed by the blaze, which burned for more than 40 hours, though around 30 people remain unaccounted for.\n\n\n\n\n\nCommissioner of Police Joe Chow says the operation is far from over.\n\n\n\n\n\n“So, this is the interim, but we have not finished our work yet because as you can see the scaffoldings, a lot of bamboos, that they have fallen down. So, we still need to do some work on those bamboos to see any remaining or any bodies were covered by these bamboos.”\n\n\n\n\n\nAuthorities say suspected human remains have been found in several apartments, with DNA testing now underway.\n\n\n\n---\n\n\n\n\n\nFive Palestinians, including two children, have been killed in Israeli airstrikes on Gaza, according to medics at Al-Kuwaiti Hospital in Khan Younis.\n\n\n\n\n\nA tent sheltering displaced people in the southern part of the enclave was among the sites hit.\n\n\n\n\n\nThe Israeli military says the strike targeted a Hamas fighter after what it described as a ceasefire breach, accusing militants of attacking Israeli troops near Rafah and injuring five soldiers.\n\n\n\n\n\nPrime Minister Benjamin Netanyahu has warned Israel will respond to any harm to its forces.\n\n\n\n\n\nGaza's health authorities say 357 Palestinians have been killed over the first 50 days of the ceasefire, while Israeli authorities say three Israeli soldiers have been killed in the same period.\n\n\n\n---\n\n\n\n\n\nTo sport and in football, Chelsea's Premier League title hopes have suffered a major setback, with a humbling 3-1 defeat at Leeds United which lifted the hosts out of the bottom three.\n\n\n\n\n\nAn attacking start from Leeds was rewarded with a sixth minute goal when Jaka Bijol powered in a header from the corner and the home side doubled their lead, with Ao Tanaka scoring a stunner two minutes before halftime.\n\n\n\n\n\nChelsea pulled one back five minutes after the break, through substitute Pedro Neto, but their comeback attempt was ended when a mistake at the back gave Leeds a third goal in the 72nd minute, with Dominic Calvert-Lewin wrapping up the win.\n\n\n\n\n\nChelsea coach Enzo Maresca says Leeds were impressive opponents.\n\n\n\n\n\n\"I think they were better than us in all the aspects, they deserved to win the game. There is nothing that we can take from this game. The only thing we can do is try to understand the mistake we have done, try to reset, because again in 48 hours we have one more game.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-much-do-you-need-to-retire/1j5iabxnv",
        "title": "How much super will you need? The new figure to retire comfortably",
        "publish_date": "Wed, 3 Dec 2025 22:37:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "The cost of a comfortable retirement is higher than it's ever been, according to the Association of Superannuation Funds of Australia (ASFA).\n\n\n\n\n\nThe peak body's CEO, Mary Delahunty, said, fortunately, the average balance of superannuation accounts has also risen to a record high.\n\n\n\n\n\nThe average balance is sitting at $172,834 for nearly 18 million superannuation account holders over the age of 15. For those aged 65 to 69, the average balance is around $420,934.\n\n\n\n\n\n\"More Australians than ever before are reaching retirement with meaningful super behind them,\" she said.\n\n\n\n\n\nBut it might not feel that way to many Australians.\n\n\n\nWith the eye-watering cost of living putting pressure on families and economic uncertainty overseas making Australians anxious , two new guides have outlined how much you need to support your retirement.\n\n\n\nSo how much will you need?\n\nThere are many factors that influence how much money you'll need, such as age pension eligibility, whether you own your home, and your living situation.\n\n\n\n\n\nMost calculations consider a more modest budget option versus a more comfortable lifestyle, including things like overseas travel and subscriptions to streaming services.\n\n\n\n\n\nAccording to ASFA, coupled homeowners 65 and over will need $76,505 each year to live comfortably in retirement.\n\n\n\n\n\nA single person will need around $54,240 each year.\n\n\n\nSource: SBS News That's an increase of 3.5 per cent and 3.6 per cent respectively compared to this time last year, and it's directly connected to the rising cost of living.\n\n\n\n\n\nThe group estimated retirees over 85 who own their home would need less money, offering about $71,104 as a guide for a couple and $47,534 for a single person.\n\n\n\n\n\nA separate estimate from Super Consumers Australia, a group that advocates for lower- and middle-income super consumers, suggests that a typical single homeowner will need around $322,000 in superannuation for a comfortable retirement.\n\n\n\n\n\nCouples will need a combined $432,000.\n\n\n\nSource: SBS News In contrast, for those living a 'modest lifestyle', the estimated annual budget was approximately $20,000 lower, as they typically spend less on health insurance, cars, and take fewer holidays, among other expenses.\n\n\n\n\n\nExperts say it may take even less in superannuation to have a secure retirement, especially if you own your own home.\n\n\n\n\n\nJoey Moloney, the deputy director of the housing and economic security program at the Grattan Institute, previously told SBS News the real cost of retirement could be even lower, as retirees typically spend less once they stop working.\n\n\n\n\n\n\"When you look at people's spending habits from pre-retirement to post-retirement, what you see is that people spend less in retirement and increasingly so as retirement goes on,\" he said.\n\n\n\n\n\n\"Pensioners benefit from a bunch of discounts on council rates, electricity, medicines and other benefits that add up to an implicit income of thousands of dollars a year.\"\n\n\n\nWhere have prices risen most?\n\nWith the consumer price index rising in the September quarter to 1.3 per cent , and a 3.2 per cent increase over the past year, more people are spending money on daily essentials.\n\n\n\n\n\nIn the September quarter alone, electricity prices have risen by 9 per cent.\n\n\n\n\n\nOver the past twelve months, the increase is closer to 25 per cent.\n\n\n\n\n\nMeanwhile, the cost of eating out has risen by around 1.3 per cent, while those staying in are paying 9.3 per cent more for media services.\n\n\n\nDelahunty said the holidays will be a challenging time for many retirees because prices have risen fastest in the things they spend most on, like \"food, energy and health\".\n\n\n\n\n\n\"Some older people may cut back on pricier gifts, travel and social occasions to stay on top of the basics,\" she said.\n\n\n\n\n\nShe pointed to recent reforms, including the move to 12 per cent super and Payday Super , that could give people more security over their retirement savings.\n\n\n\n\n\n\"The challenge now is to keep strengthening the system so every Australian has the best possible chance of a comfortable, dignified retirement, not just at Christmas but all year round.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/high-court-ruling-on-nt-rent-hikes-morning-bulletin-4-december-2025/0re3sm1jh",
        "title": "High Court ruling on NT rent hikes | Morning Bulletin 4 December 2025",
        "publish_date": "Wed, 3 Dec 2025 19:30:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\nHigh Court ruling on NT rent hikes sparks calls for compensation...\n\nAustralia and New Zealand become first non-NATO nations funding Ukraine arms...\n\nPat Cummins on the verge of a shock return in the second Ashes Test.\n\n\n\nThe lead solicitor for a group of Aboriginal tenants who the High Court has ruled were charged unlawful rent rises by the Northern Territory government is calling for compensation.\n\n\n\n\n\nOn Wednesday the court struck down the NT 'Remote Rent Framework' on the basis that a lack of consultation meant tenants had been denied procedural fairness.\n\n\n\n\n\nThe policy affected over 5,000 homes, and many vulnerable remote community residents living in public housing, with rents rising by up to 200 per cent in some cases.\n\n\n\n\n\nDaniel Kelly represented four residents from Gunbalany and Laremba in the case and says people like his clients should be compensated.\n\n\n\n\n\n\"This framework has now been shown to be unlawful, and over the last few years, the territory was predicting it would result in an increase of $9.7 million in rent every year. That's 9.7 million additional rent they've collected under this system. And there now needs to be some sort of accounting process about how this is going to be rectified with clients who have paid increased rent under this unlawful system.\"\n\n\n\n\n\nAustralia and New Zealand are set to become the first non-NATO nations to help fund the purchase of critical military equipment for Ukraine under a new $95 million package.\n\n\n\n\n\nThe Albanese government will today unveil the additional support, including $50 million for the Prioritised Ukraine Requirements List, through which NATO co-ordinates the acquisition of US-made defence assets for Kyiv.\n\n\n\n\n\nAustralia will also donate $43 million worth of A-D-F supplies, including tactical air-defence radars, munitions and combat-engineering equipment, alongside a further $2 million for advanced drone technologies.\n\n\n\n\n\nThe announcement lifts Australia’s total assistance to more than $1.7 billion since Russia’s full-scale invasion began in 2022.\n\n\n\n\n\nA Senate Estimates committee has heard that Communications Minister Annika Wells recent trip to the United Nations General Assembly cost taxpayers almost $100,000.\n\n\n\n\n\nOfficials confirmed that $94,828 was spent on flights for the minister and two staff, which included Ms Wells' own travel budget of $35,000.\n\n\n\n\n\nThe trip was spruiking Labor's social-media-ban for under 16's at a meeting of world leaders.\n\n\n\n\n\nWhen asked to justify the cost, Ms Wells says the trip fuelled global momentum for the world leading policy.\n\n\n\n\n\n\"The reason you know all those things is because we're transparent about them and we will disclose them and we'll continue to disclose information about that trip through the usual processes that trip was undertaken as the Minister for Communications and I think and I would think the people who were there for that UN event who join us in this room today would agree with me that it was incredibly important.\"\n\n\n\n\n\nHamas has handed over a recovered body to members of the Red Cross to be repatriated back to Israel.\n\n\n\n\n\nPrime Minister Benjamin Netanyahu's office has confirmed receiving a body believed to be of a dead hostage held in Gaza through the Red Cross.\n\n\n\n\n\nThe remains have arrived at an Israeli forensics institute for examination.\n\n\n\n\n\nHamas also handed over remains on Tuesday which Mr Netanyahu's office later said were not of any hostage.\n\n\n\n\n\nThe handover of the last two hostages' bodies in Gaza would complete a key condition of the initial part of U-S President Donald Trump's plan to end the Gaza war.\n\n\n\n\n\nMeanwhile, Israel says it will reopen the Rafah border crossing and would start allowing Palestinians wishing to leave Gaza to do so.\n\n\n\n\n\nResidents forced to flee their homes in Hong Kong are being allowed to return and retrieve their belongings after a deadly fire killed at least 156 people.\n\n\n\n\n\nWith authorities collecting evidence in a criminal probe into the fire, it remains unclear when residents can return to the building.\n\n\n\n\n\nSome 30 people remain missing and fifteen have been arrested on suspicion of manslaughter.\n\n\n\n\n\n37-year-old Hong Kong resident Trent Heung says people want justice.\n\n\n\n\n\n\"I think justice is number one. I think there is no negotiation. Justice and really really justice for the victims and I think the entire population in Hong Kong would love to have the truth and the justice to be told.”\n\n\n\n\n\nIn cricket, Australian captain Pat Cummins is on the verge of a shock return for the second Ashes Test, which starts this afternoon in Brisbane.\n\n\n\n\n\nCummins has been sidelined with a back injury for the past few months, and wasn't in the Australian squad for this match.\n\n\n\n\n\nBut he has been training with the team in the leadup to this match, and his deputy, Steve Smith, says Cummins looks good.\n\n\n\n\n\nIf Cummins returns, it's unclear whether fast bowler Brendan Doggett would have to make way, or whether Australia would play four fast bowlers, and drop spin bowler Nathan Lyon instead.\n\n\n\n\n\nSmith has refused to confirm reports from News Corp newspapers that Josh Inglis will come into the side for injured batsman Usman Khawaja.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-australians-now-expect-from-landlords/hk8909fa5",
        "title": "What Australians now expect from landlords",
        "publish_date": "Wed, 3 Dec 2025 18:36:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "As temperatures rise, so do many Australians' energy bills.\n\n\n\n\n\nThe high cost of keeping their homes at a comfortable temperature is, according to new research from Energy Consumers Australia (ECA), driving millions of renters to avoid it altogether.\n\n\n\n\n\nECA's latest Consumer Energy Report Card, released on Thursday, found that 70 per cent of a poll of 1,428 renters nationwide were avoiding heating or cooling their homes to save money.\n\n\n\n\n\nAt the same time, two in five (40 per cent) of those polled said they couldn't afford to keep their home at a comfortable temperature on hot days without using a lot of energy.\n\n\n\n\n\nFor cold days, the national figure was 32 per cent.\n\n\n\nDespite being one of the warmest parts of Australia, renters in the Northern Territory were the most reluctant to heat or cool their homes due to the cost. Source: SBS News ECA's executive manager of analysis and advocacy executive manager, Ashley Bradshaw, said the findings supported the need to introduce minimum energy efficiency standards for rental properties across Australia.\n\n\n\n\n\n\"On the one hand, renters are telling us they're avoiding using energy, but on the other hand, they're also telling us that their bills are generally a lot higher than any household of the same size,\" he told SBS News.\n\n\n\n\n\n\"Without some sort of mandatory enforceable standards, renters are going to keep living in homes that are too hot in summer, too cold in winter, and very expensive to run.\"\n\n\n\n\n\nSeparate data by research firm SECNewgate polled 1,208 Australians and found 65 per cent of respondents supported a minimum efficiency standard for rental homes.\n\n\n\n\n\nAnd of 1,056 respondents, almost half said landlords should cover the cost of home upgrades to meet minimum energy-efficiency standards, with government support. Another 27 per cent said landlords should pay the full amount, 14 per cent believed the government should fund the upgrades, and 7 per cent said the cost should be shared between landlords and tenants.\n\n\n\nWhat are minimum energy efficiency standards?\n\nMinimum energy efficiency standards can include requirements such as draught-proofing and proper insulation, and the installation of energy-efficient appliances.\n\n\n\n\n\nThe ECA data suggest just over a third of rentals in Australia have at least one form of insulation, compared to 78 per cent of owner-occupied homes.\n\n\n\n\n\nClimateworks Centre's buildings lead, Gill Armstrong, said: \"We know that rentals are in really worse shape than other housing segments like owner-occupiers, and we know that tenants just can't upgrade — they've got no rights to do that — so we need that requirement for landlords to have minimum rental standards throughout all the states.\"\n\n\n\n\n\n\"I don't think it should be guesswork as to whether this home is going to be acceptable to live in or you're going to have really high bills,\" she said.\n\n\n\nREAD MORE Who will feel the heat? The suburbs in Australia most at risk from extreme heat revealed\n\nBoth Victoria and the ACT are progressively introducing minimum energy efficiency standards for rentals.\n\n\n\n\n\nThat means more than two million rental homes are in jurisdictions without any minimum, enforceable energy-efficiency requirements, according to ECA.\n\n\n\n\n\n\"At the moment, some state restrictions are simply very high level, just that the house needs to be 'in working order' — essentially words around that respect — so nothing at all related to energy efficiency,\" Bradshaw said.\n\n\n\nWhat changes are being proposed?\n\nBradshaw said ECA first wants to see the disclosure of a home's energy efficiency rating made mandatory at the point of lease in every state and territory.\n\n\n\n\n\n\"A [rating of] 10 is this theoretically perfectly-efficient house, where almost the internal temperature of the house is irrespective of the outdoor temperature,\" he said.\n\n\n\n\n\n\"On the other hand, a zero star would essentially be you are literally outside, a one star would be a tent.\n\n\n\nAustralian homes are of \"very poor quality\" when it comes to energy efficiency, Bradshaw said. Source: Getty / Maryna Terletska \"I think the average rating of a house in Australia is 1.8, so we're kind of closer to a tent in terms of certain quality of homes, particularly rentals.\"\n\n\n\n\n\nBradshaw said that would then be followed by the progressive introduction of minimum energy-efficiency standards, making homes unable to be rented out unless they meet a certain benchmark.\n\n\n\n\n\n\"If we look forward, we're going to seemingly have more extreme weather and see the health and societal impacts of that, so it becomes more and more important.\"\n\n\n\nHow much could energy efficiency standards save you?\n\nHaving a better-insulated home with more energy-efficient appliances means you don't need to use as much power or have appliances running for as long to make your living environment comfortable.\n\n\n\n\n\nArmstrong said that can result in a significant cut to your annual energy bills.\n\n\n\n\n\n\"Depending on the size of your home and how much heat or cool you like, we're looking at saving a considerable amount per year — up to $2,000, our modelling showed, particularly in the homes that are the lowest performers,\" she said. \"So that's no insulation and things like you've got gaps around windows, you've got old vents that are not blocked up, so your house is very leaky.\"\n\n\n\nREAD MORE How heatwaves can wreak havoc on your mental health\n\nBut the benefits extend far beyond cheaper energy bills, Bradshaw and Armstrong said.\n\n\n\n\n\nThey can also make your home quieter, reduce pressure on the energy grid, lower greenhouse gas emissions, and improve your physical and mental health and well-being.\n\n\n\nHow to get a more energy-efficient rental\n\nRegardless of whether minimum energy efficiency standards have been introduced where you live, Armstrong said it was worth talking to your landlord about upgrading your home.\n\n\n\n\n\nResearch shows most landlords have no idea what their rental properties feel like in summer or winter, so you should let them know exactly how your home \"is not fit for purpose\", she said.\n\n\n\n\n\n\"I'd communicate that as best as possible and document why the home is too hot, too cold, any air vents that are from past gas appliances that may have been removed that you can see daylight coming through, show them copies of bills, and suggest ways forward,\" Armstrong said.\n\n\n\n\n\n\"The Your Home website by the federal government has heaps of advice that landlords can follow.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/hobarts-afl-stadium-set-to-be-approved-by-tasmanian-parliament/qgac9qno5",
        "title": "Hobart’s AFL stadium set to be approved by Tasmanian parliament",
        "publish_date": "Wed, 3 Dec 2025 09:43:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Hobart’s AFL stadium set to be approved by Tasmanian parliament\n\nPublished 3 December 2025, 7:37 am\n\nThe Macquarie Point stadium in Tasmania is on the verge of securing long-awaited approval. The project's construction has left Tasmanians divided, even as hopes of an AFL team to call their own hinge on it. It now has enough votes to pass parliament.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/the-countdown-begins-to-australias-under-16s-social-media-ban/vhftpxbex",
        "title": "The countdown begins to Australia’s under-16s social media ban",
        "publish_date": "Wed, 3 Dec 2025 09:27:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "The countdown begins to Australia’s under-16s social media ban\n\nPublished 3 December 2025, 7:36 am\n\nTwo new social media apps have been put on notice by the e-safety commissioner, a week out from the implementation of the under 16s social media ban. As the government sells the policy, families are getting their heads around the impact of these changes. This story produced in collaboration with SBS Arabic.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/labors-housing-and-migration-policies-scrutinised-at-senate-estimates/6y8upda65",
        "title": "Labor’s housing and migration policies scrutinised at senate estimates",
        "publish_date": "Wed, 3 Dec 2025 09:14:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "Labor’s housing and migration policies scrutinised at senate estimates\n\nPublished 3 December 2025, 7:35 am\n\nProgress on the government's commitment for 1.2 million new homes to be built under its watch has been questioned by the Reserve Bank Governor. The housing shortage has also been also central to a debate inside the opposition as it finalises a new migration policy.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/australian-economy-grows-at-fastest-pace-in-two-years/v0awlsiaj",
        "title": "Australian economy grows at fastest pace in two years",
        "publish_date": "Wed, 3 Dec 2025 07:26:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/44-000-australians-overpaid-centrelink/hgf4bn7pn",
        "title": "Nearly 44,000 Australians are owed Centrelink refunds. Some died without knowing",
        "publish_date": "Wed, 3 Dec 2025 04:53:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Centrelink has refunded only 338 of the 44,000 people who overpaid their debt to the social services provider, with Services Australia confirming to SBS News the total amount refunded is already at $2.9 million.\n\n\n\n\n\nAround 2,700 people who were owed refunds died before the problem was identified, a Senate estimate hearing was told .\n\n\n\n\n\nChris Birrer, deputy chief executive officer for payments and integrity at Services Australia, said at Senate estimates on Tuesday that they were alerted to an issue regarding repayments around March this year by internal staff.\n\n\n\n\n\n\"These instances go back to 2007. There's a range of cases, with a certain cluster around the period from 2017 to 2019,\" he said.\n\n\n\n\n\nAs reported by Guardian Australia in October, Services Australia said the problem was caused by a procedural error around automatic deductions, and not related to the widespread robodebt scheme currently subject to the biggest class action in Australian history .\n\n\n\nBirrer said on top of those refunded, a further 111 cases were found not to be owed money.\n\n\n\n\n\nA spokesperson for Services Australia told SBS News they began contacting people impacted in late October 2025, but have been undertaking a thorough investigation since March to ensure \"clarity and certainty\" for customers.\n\n\n\n\n\nBut as more details were revealed on Tuesday about the challenges Services Australia had faced returning the money, Greens spokesperson for social services, Penny Allman-Payne said she was \"flabbergasted\" so little progress had been made.\n\n\n\nSome owed more than $5,000\n\nBirrer told estimates that around two per cent of people who overpaid, or around 880 people, were potentially owed over $5,000.\n\n\n\n\n\nThe average amount already paid to the 338 who have received money is around $8,579 each.\n\n\n\n\n\nAnother roughly 31 per cent, around 13,000 people, were owed anywhere between $51 and $500.\n\n\n\nDeputy CEO at payments and integrity group at Services Australia, Chris Birrer, told Senate estimates they were alerted to the issue in March. Source: Supplied A further 28 per cent overpaid between $1 and $50, with the remaining 22 per cent owed $1 or less.\n\n\n\n\n\nHe explained they were tackling the higher amounts first.\n\n\n\n\n\n\"We've done a phased approach starting with the high-value potential overpayments, so people out of pocket the most are getting quicker service from us,\" he told Senate estimates.\n\n\n\n\n\nMany of the overpayments were from people receiving the aged-care pension, and around 2,700 had died before the problem was identified.\n\n\n\n\n\nIn that case, Birrer said, they were still attempting to return the money to families of the deceased.\n\n\n\n\n\n\"We do attempt to contact estates and executors and beneficiaries, and that's a standard process.\"\n\n\n\n'Flabbergasted' at the delay\n\nAllman-Payne told Birrer she was \"flabbergasted\" at how long it was taking Services Australia to pay the money they owed.\n\n\n\n\n\nIn response, Birrer explained that their systems are \"large and complex\".\n\n\n\n\n\nFor some cases, he said, officers learn the recipient has already been refunded, but the payment \"was not recorded in a way that was evident in the customer's record\".\n\n\n\n\n\nA spokesperson for Services Australia told SBS News that it's \"essential\" to do due diligence, and that this has taken time.\n\n\n\nGreens senator Penny Allman-Payne said it was \"beyond belief\" for a government department not to notice the mistake for nearly twenty years. Source: AAP / Mick Tsikas\n\n\n\nIn a statement to SBS News, Allman-Payne said it was \"beyond belief\" that a government department could have wrongly taken money for two decades and not know about it.\n\n\n\n\n\n\"The welfare system is full of holes like these because Labor and the Liberals have spent decades harassing welfare recipients, rather than making sure the public service takes them seriously,\" she said.\n\n\n\n\n\nWhile Services Australia couldn't provide a firm timeline for fixing the problem, a spokesperson told SBS News more than 60 per cent of those impacted are not current customers.\n\n\n\n\n\n\"We are only able to make refunds to people we have current bank account details for or can successfully contact,\" they said.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/were-looking-at-it-very-seriously-trump-eyes-australias-superannuation-scheme/dp6o0rf9m",
        "title": "'We're looking at it very seriously': Trump eyes Australia's superannuation scheme",
        "publish_date": "Wed, 3 Dec 2025 04:31:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "United States President Donald Trump has praised Australia's superannuation system as \"a good plan\" that has \"worked out very well\", saying he is considering adopting a version of it in the US to help counter the nation's shrinking birth rate.\n\n\n\n\n\nHis remarks came on Wednesday AEDT as he unveiled a record US$6.25 billion (9.5 billion) donation from Michael and Susan Dell of the Dell technology company to children's investment accounts.\n\n\n\n\n\n\"There's a certain Australian plan that people are liking and they're talking about … not for children, necessarily, but it's for people, working people,\" Trump said.\n\n\n\n\n\n\"We're looking at it very seriously. It has worked out very well; it's a good plan.\"\n\n\n\nREAD MORE How much super will you need? The new figure to retire comfortably\n\nA reporter asked Trump whether he was specifically referring to the superannuation scheme.\n\n\n\n\n\n\"That's what they're talking about, yep,\" Trump said.\n\n\n\n\n\nThe US has a retirement savings scheme known as 401k, but it differs from superannuation in that many of the contributions are voluntary rather than mandatory.\n\n\n\n\n\nAustralia has the world's fourth-largest pension pool, with the US the biggest destination where it's invested.\n\n\n\nIn February Treasurer Jim Chalmers visited the US to spruik the superannuation scheme, which was widely interpreted as a tool to negotiate with Trump over tariffs.\n\n\n\n\n\nThe Dell gift program would provide US$250 ($380) to 25 million children under the age of 11 who live in households with a median income below US$150,000 ($228,000) per year.\n\n\n\n\n\nThe gift builds on the 'Trump Accounts' program, whereby children born between 1 January 2025 and 31 December 2028 receive $US1,000 ($1,520) in an investment account that they can access when they turn 18.\n\n\n\n\n\n\"Michael and Susan Dell are committing to one of the largest private donations in American history, which will directly benefit the next generation of American children through the new 'Trump Accounts' program,\" Trump said.\n\n\n\nLISTEN TO Australian economy grows at fastest pace in two years SBS News 13:50 English\n\nTrump Accounts are available to American children under 18 who have a Social Security number.\n\n\n\n\n\nThe broader aim of this trust fund-style policy is to encourage family growth, echoing efforts seen in other developed nations facing similar demographic challenges.\n\n\n\n\n\nWhen asked about additional measures to boost the birth rate, Trump referenced Australia's $4 trillion retirement savings system, suggesting a similar model might be considered, though he provided no further details.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-mental-health-divide-on-working-from-home-and-why-one-gender-enjoys-it-more/99arswfiy",
        "title": "What 16,000 Australians reveal about the hidden realities of working from home",
        "publish_date": "Wed, 3 Dec 2025 01:08:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "The ability and option to work from home has become a necessity for many in the Australian workforce, particularly since the height of the COVID-19 pandemic.\n\n\n\n\n\nCrawling out of bed and walking seconds to your computer to log in for the day, otherwise known as 'telecommuting', could have mental health benefits for some workers, a new study has found.\n\n\n\n\n\nResearchers from the University of Melbourne analysed data from the annual Household, Income and Labour Dynamics (HILDA) Survey from the years 2002 to 2023 to track the work and mental health of more than 16,000 workers.\n\n\n\n\n\nThe years 2020 and 2021 were not included in the study as people's mental health could have been more affected by the COVID-19 pandemic.\n\n\n\n\n\nA big feature of the study was examining whether the effects of working from home and commuting time differed between people with good and poor mental health.\n\n\n\nREAD MORE The male breadwinner is gone. Why working from home is necessary for modern families\n\nAs for hybrid working, this had a major well-being boost for women, but only in particular situations.\n\n\n\n\n\nWhen women spent some time on-site or in the office each week, and worked from home, the biggest mental health gains were noted.\n\n\n\n\n\nGains were comparable to those from a 15 per cent rise in household income.\n\n\n\n\n\nFor women with poorer mental health, flexible work arrangements led to better mental health.\n\n\n\nThe study noted less work stress and helping women to juggle work and life were other benefits of working from home.\n\n\n\n\n\nFor men, working from home did not make a measurable effect on mental health, positive or negative.\n\n\n\n\n\nThe report mentioned that this could be due to the unequal division of domestic and caregiving responsibilities, which disproportionately fall on women and constrain their spatial mobility.\n\n\n\n\n\nWorkers with poorer mental health were found to be more sensitive to long commutes and most likely to benefit from flexible working arrangements.\n\n\n\n\n\nFor women commuting, there was no detectable effect. But for men, longer commutes equated to poorer mental health for those who already had issues.\n\n\n\n\n\nFor a man near the middle of the mental health distribution adding half an hour to his one-way commute reduced reported mental health by roughly the same amount as a 2 per cent drop in household income, the authors wrote.\n\n\n\n\n\nFor workers who don’t have problems with their mental health, commuting and working from home don’t have much of an impact on them. Yet they still may value flexibility, the study found.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/mcilroy-reflects-on-rollercoaster-round-20251204-p5nkvn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "McIlroy﻿ reflects on 'rollercoaster' round",
        "publish_date": "Thu, 04 Dec 2025 13:04:20 +1100",
        "category": "finance",
        "authors": [],
        "text": "McIlroy﻿ reflects on 'rollercoaster' round\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-australia-leaves-fate-of-isis-brides-to-us-military-labor-announces-first-military-support-package-for-ukraine-in-over-a-year-20251204-p5nkp2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: House Democrats release new footage of Jeffrey Epstein’s private island; Fate of ISIS brides left to US military",
        "publish_date": "Thu, 04 Dec 2025 13:03:36 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine"
        ],
        "text": "Australia’s gold-tinged export performance continues to shine brightly.\n\nNew figures from the Australian Bureau of Statistics this morning showed the country shipped $5.7 billion in non-monetary gold to the rest of the world in October.\n\nIt was the second-largest monthly result on record, only eclipsed by the $6.1 billion exported in July.\n\nOver the past 12 months, gold exports reached an all-time high of $55.4 billion, a jump of 62 per cent over the previous 12 months.\n\nNew figures from the Australian Bureau of Statistics this morning showed the country shipped $5.7 billion in non-monetary gold to the rest of the world in October. Credit: Bloomberg\n\nIf not for the surge in gold exports, Australia’s total merchandise exports would have gone backwards over the past year.\n\nOf the nation’s major exports, only beef, which has jumped by 33 per cent to $17.8 billion, has increased over the past year.\n\nIron ore remains the most valuable export at $120.3 billion, down by 7 per cent. Coal exports have slipped by a quarter to $66.3 billion while LNG exports eased by 8 per cent to $62.1 billion.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/health-and-wellness/feeling-the-afternoon-slump-a-dietitian-suggests-these-foods-over-quick-fixes-20251126-p5nirr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Feeling the afternoon slump? A dietitian suggests these foods over quick fixes",
        "publish_date": "Thu, 04 Dec 2025 13:00:00 +1100",
        "category": "lifestyle",
        "authors": [
            "Nicole Economos"
        ],
        "text": "If you keep eating like this you’ll… Likely fall short on key nutrients, especially fibre and calcium, with no fruit, very few vegies at lunch, and no wholegrains, legumes, nuts or seeds through the day. That can leave your gut microbiome underfed, your long-term bone health under pressure, and your appetite regulation a bit more wobbly than it needs to be.\n\nWhy don’t you try… Boosting your breakfast with a handful of spinach or rocket, choosing wholegrain sourdough, and adding a seaweed salad or extra veg to your sushi lunch. Beat the afternoon slump with a snack of nuts and a piece of fruit, which will also lift fibre and healthy fats while keeping your microbiome well nourished.\n\nAshleigh Vallis is the founder and creative director of Summi Summi.\n\nGet the best of Sunday Life magazine delivered to your inbox every Sunday morning. Sign up here for our free newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-edge-up-wall-street-drifts-near-its-all-time-high-20251204-p5nkok.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Property stocks weigh on ASX, miners rise",
        "publish_date": "Thu, 04 Dec 2025 12:46:34 +1100",
        "category": "finance",
        "authors": [
            "Staff Reporters"
        ],
        "text": "The Australian sharemarket is swinging between modest gains and losses, ignoring a positive lead from Wall Street, where stocks finished near record highs on hopes that a cut to US interest rates is coming at December’s Federal Reserve meeting.\n\nAfter a positive start to the session, the S&P/ASX 200 briefly dipped into the red and then rebounded. It was up just 2.9 points at 8598.1 at 12.21pm AEDT, with four of its 11 industry sectors in positive territory. The Australian dollar was trading at US66.10¢ at 11.40am AEDT.\n\nWall Street advanced overnight on rising hopes that an interest rate cut is coming at the Fed’s December meeting. Credit: AP\n\nTrade balance figures released this morning showed that Australia’s trade surplus widened to $4.39 billion in October 2025, up sharply from a downwardly revised $3.71 billion in September and surpassing market expectations. Consensus forecast was for a trade surplus of $4.2 billion, according to Trading Economics.\n\nMining stocks were higher, with copper prices hitting a record high overnight as a surge in orders to withdraw metal from London Metal Exchange warehouses compounded worries that potential US tariffs will fuel a global supply squeeze.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/richo-call-will-be-made-on-monday-boss-of-wests-tigers-owners-breaks-his-silence-20251204-p5nkq5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Richo call will be made on Monday’: Boss of Wests Tigers’ owners breaks his silence",
        "publish_date": "Thu, 04 Dec 2025 12:07:15 +1100",
        "category": "sports",
        "authors": [
            "Adrian Proszenko"
        ],
        "text": "DP: “We were supporting Shane from the outset. He’s come back and expressed that he’s got some things to think about, and Shane needs to make a decision now.” AP: Do you believe that he’ll be at the helm of Wests Tigers for the start of next year? DP: “We’ll respect his decision. That’s up to Shane, and he’ll come back to us.” AP: It feels like everything is in limbo until we know whether he’s going to be the CEO of the Wests Tigers long term. Have you had discussions with him about a time frame as to when he will decide?\n\nDP: “I’ve been in discussions with Shane … asking when he would come back with an answer. He responded that he’s still thinking about it but will come back with an answer on Monday … it really needs to be resolved sooner rather than later.” AP: You talked about a lack of communication – and obviously the four independent directors are no longer there – what responsibility does Shane Richardson bear for that? DP: “I think some of the decisions that were made, that should have come to the Holman Barnes Group for approval, certainly didn’t happen. And that’s coming from the CEO and the board.” AP: Is there anything in the [ownership] agreement whereby certain actions taken by the football club have to come back to you either for ratification or to inform you of what’s going on? DP: “That’s correct. In the agreement, there is a threshold limit that if transactions – let’s say transactions above a certain limit – need to come back to Holman Barnes Group for approval.”\n\nAP: Such as player signings above a certain [financial] limit? DP: “That’s correct.” Wests Tigers CEO Shane Richardson. Credit: Oscar Colman AP: And that hasn’t been happening. DP: “Not that I’m aware of.”\n\nAP: The narrative is that there has been some discontent about the jersey, that it contains too much Tiger and not enough Magpie. Is that the case? DP: “The colours of the jersey have not come up at all as part of this process. I think that’s a rehash of some old narrative … this has been floating around for years. This is trivial, and to think this is a reason for Holman Barnes Group taking this decisive action is laughable.” AP: The other thing that’s been discussed recently is this idea that there’s a push for Western Suburbs Magpies to take over, to push Balmain out of the joint venture. Is that the case? DP: “That’s not the case at all. The Holman Barnes Group is fully supportive of Wests Tigers. There’s been no talk about bringing back the Magpies. Once again, I think that’s a narrative that’s been rehashed from a couple of years ago.” AP: There’s no doubt the Holman Barnes Group has a good track record of managing clubs – but less so when it comes to football clubs. It’s been 14 years since the Tigers last finals appearance. Why should fans have any faith in the regime?\n\nDP: “Well, that’s correct. And that’s what we’re hoping to rectify under Benji Marshall’s leadership. If the football operation can keep progressing as they have, they’re on the improve. We’d like to see us get back to playing finals football.” AP: What do these changes mean for Benji Marshall? DP: “Benji has got our full support. He’s an absolute club legend and we think he’s a great coach. We absolutely want him here for the long term.” Wests Tigers coach Benji Marshall has the full support of the Holman Barnes Group. Credit: Getty Images AP: ARL Commission chairman Peter V’landys said he is concerned about what had transpired at board level and that he wanted the NRL to investigate. Are you concerned that head office is concerned?\n\nDP: “I think because it’s a purely governance issue between the boards – and there is a current agreement in place with Holman Barnes Group and Wests Tigers – I don’t believe that NRL should be concerned over this.” AP: Should they be concerned about the performance of Wests Tigers because obviously the two are tied together? DP: “Like I said, we’re progressing in the right direction. So I think if the NRL looks at on-field performance as well as financial performance, then we should be heading towards the finals.” AP: Is there still tension between Balmain and Western Suburbs, the two factions in the joint venture marriage? DP: “In the past, there’s certainly been a lot of tension between Wests and Balmain. We’ve had the Balmain board meet with the Wests Ashfield board, and what’s been great is that I feel like we’re more unified than ever. For example, Wests Ashfield has made it clear to Balmain that we want them to be part of the joint venture.\n\n“They retain their 10 per cent share in West Tigers, they retain their board seat in Wests Tigers. Wests Ashfield will continue to fund the Balmain Football Club and is now funding the Balmain District Juniors. So we’re very much committed to supporting Balmain and continuing on in the joint venture.” AP: At some clubs, it’s pretty easy for the membership, if they are disgruntled, to affect change. For instance, at Canterbury, you only need to get about 110 signatures to force an extraordinary general meeting. Under the ownership structure with the Holman Barnes Group, and its relationship with Wests Tigers, there’s basically no lever to pull if you’re a disgruntled member or a fan. You need to be a debenture holder, and it’s all very tightly controlled. Can you understand their frustration in that they are seeing this [boardroom brawl], they are seeing a lack of performance on the field, and there is nothing they can do about it? DP: “Absolutely, I can see the frustration … I’m a fan myself, but we are progressing in the right direction. With the right people in place at the football department, I think we will progress and continue to progress. On-field performance is everything, and that’s what we need to focus on.” The long-term future of Tigers playmaker Jarome Luai remains unresolved. Credit: Getty Images AP: Speaking of things on the field, two of your highest profile players, Jarome Luai and Jahream Bula, have yet to commit long term. They have clauses or options in their contracts in their favour, and it was suggested they were close to committing – until the latest developments. Are you concerned that they might slip through your fingers because of what’s transpired?\n\nDP: “That’s a question for the football department. I haven’t seen the contracts, so I’m not aware of the clauses that we’re talking about. However, I do believe that they’re close to re-signing, and I’d like to think they would.” AP: A protest march has been arranged. Are you concerned about disgruntled Wests Tigers fans making their presence felt and making their voices heard? DP: “We understand the passion that fans have and we appreciate that this announcement has caused upset. We have no problem in fans making their voices heard, however marching to Wests Ashfield and potentially intimidating innocent staff members is not something we would condone and I would urge the organiser to rethink this action.” AP: Should all the [feeder teams, such as NSW Cup, Jersey Flegg, etc] be playing under the Wests Tigers jersey, banner and logo, given it is supposedly one club? DP: “That’s something for the new Wests Tigers board to start getting their head around and make decisions on.”\n\nLoading AP: What’s the position of the Holman Barnes Group on that? “The Holman Barnes Group obviously has a number of teams under their umbrella, Wests Tigers and Wests Magpies being two of those, as well as the registered clubs. So we support all our teams.” AP: Will the Holman Barnes Group now start sticking their beak into football, interfering and meddling in football matters? DP: “No, it’s not for the Holman Barnes Group to get involved with football operations and player signings. But it is their responsibility to ensure that due diligence is done correctly around the selection of those players. So it’s just ensuring that governance and those systematic measures are in place.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/victoria/1000-jobs-to-be-axed-from-public-sector-but-government-shirks-deeper-cuts-20251204-p5nkpw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "1000 jobs to be axed from public sector but government shirks deeper cuts",
        "publish_date": "Thu, 04 Dec 2025 12:06:14 +1100",
        "category": "finance",
        "authors": [
            "Chip Le Grand",
            "Kieran Rooney"
        ],
        "text": "Loading It also baulked at a recommended wholesale restructure of public utilities, which would have resulted in 14 water boards merging into three. Silver called for the government to cease funding programs that provide musical instruments and doctors for high schools, and reduce the Better Boating Fund, all of which were rejected. However, it agreed to end a paid special leave program for health workers with COVID-19, in place since the pandemic. Targeted reviews of TAFE were recommended, but the government only committed to support this on a voluntary basis.\n\nThe Independent Review of the Victorian Public Service, which was commissioned by Treasurer Jaclyn Symes in February shortly after she moved into the job, urged the government to take “immediate action” to reduce the sprawling growth of public sector entities since the pandemic. “There are good reasons for establishing entities to achieve a policy goal at a particular point in time, and they employ many talented and dedicated staff,” the Silver review found. Loading “However, the large and growing number of public entities and their complexity are creating duplication and confusion, and stifling public and private sector productivity.” The report found that the substantial direct and indirect cost to the government of maintaining these entities and an extraordinary 3200 public boards and committees – a number greater than any other state or territory – undermined efforts to reduce public spending.\n\nSymes said the measures adopted by the government would make the public sector more efficient while avoiding frontline job cuts. “Frontline workers are excluded from the scope of this review,” she said. “Bringing together entities with similar functions makes it quicker and easier for individuals and businesses to interact with government by offering cleaner points of contact and fewer processes and forms to deal with.” Symes said she accepted Silver’s analysis that Victoria’s large number of entities, and their complexities, could be confusing and put a handbrake on public and private productivity. “Not only is it tying up some bureaucrats’ time, it’s creating numerous doors of entry for citizens, stakeholders and businesses,” she said. “Time is money. I hear this when I’m out there talking to the business community.”\n\nSymes said the public service had too many executive positions and not enough graduate and entry-level roles. She would not be drawn on how the savings would affect her operating surplus for this financial year. An updated figure for this will be reported on Friday as part of the state’s mid-year budget update. The full recommendations of the Silver review, which were presented to the government in July, would have netted budget savings of about $5 billion. Opposition Leader Jess Wilson said the review was an admission of failure, accusing the government of mismanagement and a top-heavy bureaucracy that was driving debt. “This report issues a stark warning over the dire impact Victoria’s soon to be $1 million an hour interest bill is having on our capacity to deliver frontline services now and into the future,” she said.\n\n“These supposed savings are a drop in the ocean. Since this report was handed to Labor in June, Victoria’s net debt has grown by almost twice the claimed savings Labor’s cuts will deliver. “The only ones cutting jobs and services are Premier Jacinta Allan and Treasurer Jaclyn Symes.” Community and Public Sector Union state secretary Jiselle Hanna said it was good the treasurer had not embarked on bigger job cuts as first feared, but rejected the review’s suggestion the government should be smaller. “Government already cannot do what Victorians expect it to,” she said. “The blind-faith obsession with outsourcing costs the state more by reducing our capability,\n\nincreasing long-term costs, and making budget repair harder.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/what-works-and-what-doesn-t-in-the-new-metro-tunnel-20251202-p5nk59.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "What works – and what doesn’t – in the new Metro Tunnel",
        "publish_date": "Thu, 04 Dec 2025 12:03:21 +1100",
        "category": "finance",
        "authors": [
            "Patrick Hatch"
        ],
        "text": "Each station also has accessible toilets, parents’ rooms and adult changing place facilities. A Travellers Aid hub at Parkville will open soon and help passengers get between the station and nearby hospitals. Stations could do with more seating, though. Good: Architecture and design The Arden station entrance features massive concrete arches lined with more than 100,000 hand-laid bricks, reflecting North Melbourne’s rich industrial history. Credit: Justin McManus It’s hard not to be impressed walking through the five new underground stations. High ceilings and wide platforms create a sense of space and openness that is a world away from their grubby City Loop counterparts.\n\nArden station’s redbrick arches will surely become one of the city’s architectural landmarks. The coupling of raw cement – most impressively in State Library station’s arched entrance – with Art Deco-inspired lighting and fixtures reflects the city above it. It feels undeniably Melbourne. Signage is clear, and the connections between CBD interchange stations are intuitive to follow. There are escalators galore – including a wall of five at the State Library entrance – to avoid the passenger congestion experienced at other CBD stations, and provide redundancy during breakdowns (looking at you, Southern Cross).\n\nBad: Deja vu The quiet State Library station on Monday morning. Credit: Justin McManus The platforms at Town Hall and State Library look nearly identical – especially on board an arriving train. And because not every cement column on the platform is signed, it might not be obvious which station you are arriving at. Making the two stations distinct was a missed opportunity to explore different design ideas while making life easier for commuters.\n\nGood and bad: Anzac tram interchange The canopy at Anzac isn’t up to the job. Credit: Wayne Taylor Anzac station’s integrated tram stop works excellently. Transferring from St Kilda Road trams and directly down into the station takes just a couple of minutes. For many, getting on a train here will be quicker than taking a tram all the way up Swanston Street. It doesn’t all work well, though. The 85-metre wooden canopy at Anzac is an attractive structure – but too small to protect passengers from the elements while transferring to/from a tram. It also fails to stop rain falling onto Anzac’s concourse. Staff had to erect “wet floor” signs there during light rain on Monday.\n\nGood: Platform screen doors Platform screen doors improve safety and comfort. Credit: Simon Schluter Platform screen doors at each of the five stations are a big step up for passenger comfort. There’s no loud whoosh of air as trains arrive or depart. They make platforms safer, quieter and easier to keep warm and cool. One nifty feature: the displays showing passenger loads in each carriage on the next arriving train, so you can board at a door with the most room. Not all doors are in use right now, however, and this could be signed better. Metro is operating seven-carriage trains in the Metro Tunnel, but the platforms are long enough to accommodate 10-carriage trains in the future. Doors not in use have signs that say “Board trains this way →” but The Age saw plenty of passengers expecting trains to arrive there, perhaps thinking the sign indicated the direction of travel.\n\nGood: Artwork Danie Mellor’s work Forever at State Library station. Credit: Wayne Taylor Future generations of Melburnians will be grateful for the public artworks included at the new stations. Patricia Piccinini’s colourful ceramic tiles at Parkville seem to be a favourite among visitors. Danie Mellor’s work Forever, consisting of photographic portraits of Wurundjeri Woi Wurrung women printed on huge glass panels along La Trobe Street, is a beautiful addition to the city.\n\nBad: Advertising onslaught The unfinished digital advertising screen at Town Hall station. Credit: Gemma Grant When taking the escalators from the new City Square down into Town Hall station, passengers come face-to-face with a large wall crying out for another mural or artwork. Instead, an enormous LCD screen – we’re talking IMAX here – will assault commuters with “immersive 3D anamorphic display” advertising. A three-screen digital wrap-around also detracts from the State Library station’s impressive entrance.\n\nThe stations were supposed to celebrate Melbourne’s history and people. Too many of them have fallen victim to the rapacious commercialisation of public life. The wraparound advertising screens at State Library. Credit: Wayne Taylor Bad: Fast food The use of retail space is uninspired. There’s a McDonald’s at Town Hall, while Parkville has a Maccas and a KFC. The doctors at the Royal Melbourne and Peter Mac won’t love that patients have access to so much junk food on their doorstep. The iconic Campbell Arcade is now accessible from Town Hall. It was home to an independent coffee shop, a record store and the Sticky Institute zine hub before it was emptied during construction. Let’s hope it rekindles that quirky and creative spirit when the shopfronts are leased out again.\n\nBad: CBD station myki glitch The underground concourse connecting State Library station to Melbourne Central. Credit: Jason South Town Hall station connects to Flinders Street Station. State Library connects to Melbourne Central. Passengers can transfer between them without going through myki gates – in effect, forming two CBD mega stations served by both the Metro Tunnel and City Loop. But the myki ticket system treats them as separate stations.\n\nLoading Usually, if you enter a station, change your mind about travelling and exit the same station within 15 minutes, you are not be charged a fare. But if you enter Town Hall, change your mind and then exit via the Melbourne Central gates, your myki will be charged. Transport Victoria says it is working to change this, and also make it possible for anyone to use these underpasses without touching on. Until then, one gate is left open at Town Hall and State Library.\n\nBad: Bicycle parking The absence of secure or even undercover bicycle parking at Arden, Parkville or Anzac is a baffling oversight. There are bicycle hoops, all vulnerable to the elements and thieves. Loading Good bicycle parking can encourage commuters to combine a short bike ride with a train journey, massively enhancing the catchment of people who can access a station. The Dutch, of course, do this best: at Utrecht station, commuters can ride directly into its three-level, 12,500-bike underground parking facility. That might be overkill for Melbourne. But the Metro Tunnel stations don’t even have the lockable Parkiteer bike cages, which are installed at many suburban stations.\n\nGood and bad: Public space The revamped City Square, above Town Hall station, is a welcome addition to a CBD that is starved of communal space. It’s a shame that other opportunities to create new public spaces were missed. The project initially planned to permanently close Franklin Street (between City Baths and RMIT) to create a new pedestrian zone and public space, but that was scrapped. The redeveloped City Square. Credit: Joe Armao The Swanston Street vehicle-free zone should have been extended north to A’Beckett Street, past State Library station.\n\nLikewise, one or both sides of Flinders Street were closed for years during construction. People have gotten used to it. It could have stayed closed to make room for the tens of thousands of pedestrians set to pour out of Town Hall and Flinders every morning. Instead, they’ll have to squeeze onto already overcrowded footpaths when it reverts to a traffic thoroughfare. Bad: Soft launch timetable Almost every Melburnian will be aware that the Metro Tunnel is now open. But how many will have read the fine print? It is only open between 10am to 3pm on weekdays, and until 7pm on weekends. Trains run only every 20 minutes. The full timetable starts on February 1.\n\nIt’s inevitable that some people will leave home thinking they can get a train to Parkville, only to find the tunnel is closed for the day. Visitors here for the Australian Open and other events this summer will be confused too. Bad: The line with no name In New York you can get on the “A” train to Harlem. Londoners ride the Jubilee and Suffragette lines. Metro Tunnel will operate the newly connected Sunbury and Cranbourne/Pakenham lines. Passenger information displays at Anzac. Credit: Wayne Taylor\n\nNot just a mouthful, it can be confusing, too. Melbourne’s train lines are named after their final terminus (the Hurstbridge Line, the Glen Waverley Line). That’s fine if they only travel into the CBD and back again to their origin. It doesn’t work for the 100 kilometre end-to-end Metro Tunnel. As it stands, Pakenham Line trains go to Sunbury, and Sunbury Line trains go to Cranbourne or East Pakenham. If they applied the convention used on the London Underground, customers would be told they need a “Metro Line: Sunbury” train to travel towards Sunbury. Much easier to understand.\n\nGood: Cross-city travel People say the Yarra is the physical and psychological barrier that divides Melbourne. I’d argue the City Loop is just as significant. The Metro Tunnel bridges the divide, making it possible to travel directly from the outer north-west all the way to the outer south-east. Over time, this will change how Melburnians conceive the city and their place in it. People will be more willing and able to cross the city for work, study or leisure. Melbourne will be a smaller, more connected place.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/an-arrest-the-rat-pack-and-a-speech-that-brought-the-house-down-swan-quips-his-way-into-pies-hall-of-fame-20251204-p5nkr1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "An arrest, the Rat Pack and a speech that brought the house down: Swan quips his way into Pies’ hall of fame",
        "publish_date": "Thu, 04 Dec 2025 11:58:49 +1100",
        "category": "sports",
        "authors": [
            "Michael Gleeson"
        ],
        "text": "Loading Milligan famously accepted a lifetime achievement award at the British Comedy awards saying, “About bloody time … I’m not going to thank anybody because I did it all on my own.” Read a letter of praise from Prince Charles he dismissed the now King as “the little grovelling bastard”. Swan was as gloriously irreverent as Spike. He mentioned his family and kids but added they didn’t deserve any thanks because they weren’t around when he played. Besides, he loves them, “but I don’t necessarily like them all the time”. He thanked his teammates, but “they rode on my coat-tails, so I probably don’t need to thank them”.\n\nSwan is the most disarmingly entertaining after-dinner speaker and interviewee in football. Self-deprecating and dry, he thanked the fans for their support, “although there are no fans here, we all know it’s just rich people and players” in the room. The rich people and players guffawed loudly. “The love I received from the fans, and I guess as a ‘Rat Pack’ we did, clearly you made me bigger than what I was or what I am. So I thank you for that,” he said. Dane Swan and Alan Didak celebrate the club’s 2010 premiership. Credit: Joe Armao And this is the nub of Swan. An outrageously good footballer in his peak years after 2007 or 2008 until his retirement, he was just outrageous in his early years. He described himself as a kid who was as surprised as anyone to find himself on an AFL list.\n\nLoading “I got dropped halfway through the year I got drafted for having a poor attitude which may shock some people, then I played three good games, and they drafted me off the back of that,” he said. “I have a got some wonderful memories from those first four years [in the AFL] but none of them have got anything to do with football. They are all hazy now – I was pretty good off the field. “Obviously, the best thing that happened to me in the AFL was – and it’s not for everyone, but it obviously worked for me – I went out and got arrested.” Yeah, it’s probably not for everyone.\n\nBut for Swan, it was the moment that prompted a new career-saving commitment. At a time when the club was bottoming out and playing kids he was given another chance. Had it not been for his arrest on assault charges in 2003 and changing his ways, he “would have been given the arse at the end of the year and that would have been it”. “I got 50 games I didn’t deserve. Mick [Malthouse] was extremely hard on me; in those team meetings he used to say some pretty mean stuff and say some personal stuff I didn’t even know about myself. I thought, ‘Someone is going to have to tell my parents, I don’t know what’s happened here’.” “Obviously, the best thing that happened to me in the AFL was – and it’s not for everyone, but it obviously worked for me – I went out and got arrested.” Dane Swan The club didn’t need to be bullied to include Swan in their Hall of Fame. His Brownlow Medal, his premiership, and his powerful indefatigable run and nous to find the goals had already made certain of his inclusion. It was not hyperbole for Matthews to say he was in the conversation as the best player in the competition at one stage. For a period of four or five years, he was clearly among the best in the AFL. But playing ability and achievements were only part of the reason, and in fact the lesser of the reasons, for the warmth with which Swan is held at the club. Swan was the everyman who played unlike the everyman. He was tattooed – he said that helped his mystique – and was not so wound up in the self-importance of the AFL as to be unable to laugh at it, and himself.\n\nHis most telling comment was that he never wanted to be the best footballer he could be, he wanted to have the best life he could have. He understood work-life balance in football before it was a thing. He commanded play with the ball and was ringmaster away from the field. He led a group of similarly talented players – Alan Didak, Ben Johnson, Chris Tarrant – who shared a thirst for life after hours. “I hope one day the Rat Pack get put in here as a group,” he said, to loud laughter. “You’re laughing but I’m serious. “I certainly wasn’t on the Men For All Seasons calendars, I wasn’t built like that. We’re just normal everyday guys who just happened to play on the MCG, we’re out doing whatever else is doing.”\n\nThis relatability is the reason he can upstage even Matthews, a football icon who has homes everywhere and nowhere, having been the player of the century at Hawthorn, coached flags at Collingwood and against them at the Brisbane Lions, but loves them all in different ways. Collingwood were the perfect fit for Swan. Dane Swan was a footy character who was beloved by the fans. Credit: Getty Images This is a club of Tony Shaw and Lou Richards. A club where a member of the original Magpie Rat Pack now runs the club. Before Swan, Didak, Johnson and Shaw, there was Craig Kelly, Denis Banks, Mick McGuane and, of course, Darren Millane. Kelly is now the CEO. The club embraced their past this night opening a new Hall of Fame section in the rebuilt museum. It includes Millane’s locker from the Victoria Park change rooms. It’s sparseness, sitting alone in the room, adds to the poignancy of recognising the premiership player who died in a car accident in his prime.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/ukraine-is-running-out-of-cash-can-europe-seize-russian-money-to-help-20251204-p5nkqi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ukraine is running out of cash. Can Europe seize Russian money to help?",
        "publish_date": "Thu, 04 Dec 2025 11:57:42 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "The International Monetary Fund has estimated that Ukraine will have a €65 billion shortfall in its budget over the next two years without financial aid. About two-thirds of Ukraine’s government revenues are now devoted to the war effort. It desperately needs more cash. Loading A stumbling block to a EU plan to use the Russian assets as collateral for a €140 billion loan to Ukraine has been Belgium’s unwillingness to expose itself to Russian litigation if there is a peace deal, sanctions on Russia are lifted and Moscow demands the return of its money, which Euroclear would have a contractual obligation to comply with. That could leave Belgium on the hook for the funds, and facing insolvency. Russia has, indeed, threatened 50 years of legal warfare against Europe if its assets are touched. It would also probably seize Western financial assets (the amounts aren’t known) that it froze in retaliation for the G-7 sanctions. The latest EU proposal would involve Euroclear making an interest-free loan equivalent to the value of the Russian assets it holds, which would be used to repay EU countries for money already lent to Ukraine, with the rest lent to Kyiv.\n\nUkraine wouldn’t be required to repay the loan unless and until it received compensation – reparations – from Moscow for the damage the war has done to its infrastructure and people. The cost of remediating the damage that the war has inflicted on Ukraine has been estimated at close to the equivalent of a trillion Australian dollars. An option that has been considered in response to Belgium’s concerns is that some or all of the EU member states provide guarantees that they would underwrite the repayment of the “reparations” loan should Russia refuse to pay for the damage it has done. Alternatively, the EU could just borrow the money itself and lend it to Ukraine, hoping that repayment would be secured in future peace negotiations.\n\nWhile a loan to Ukraine, whether backed by Russia’s assets or not, would give the Europeans a direct stake in the outcome of the peace negotiations being undertaken by the US (with minimal involvement by Ukraine), it could also place the guarantor nations at financial risk if the US forces Ukraine into a deal on Russia’s terms. Loading That could happen. Under the 28-point plan that the US presented to Russia last month (with, it seems, considerable input from the Russians), apart from ceding Ukrainian land that Russia doesn’t currently control along with that it does occupy, an exclusion from Ukraine joining NATO and reducing the size of its military, all sanctions on Russia would be lifted. The agreement specifically said that frozen Russian funds would be used in US-led efforts to rebuild Ukraine, with the US receiving 50 per cent of any profits. The EU would contribute $US100 billion ($150 billion) to the reconstruction funding. The rest of the frozen funds would be invested in a separate US-Russian investment vehicle for joint projects. While the Russians rejected the proposals, the Trump administration has made it clear that it views the ending of the war as a commercial opportunity (surprise, surprise) and is less concerned about Ukraine’s interests – and those of the Europeans – than it is in its own and in Donald Trump’s desire to have his name on a peace deal, regardless of its quality.\n\nIf Ukraine’s interests are to be protected, it will be by the EU, not America. That the bulk of Russia’s offshore reserves are held within Europe does give the EU leverage to participate in any settlement, though it is extremely difficult, indeed near-impossible, to obtain a consensus from with a 27-member bloc that contains some pro-Russian voices. If the EU can agree on a mechanism for funnelling, directly or indirectly, the value of the Russian assets held within Europe to Ukraine, it would give it a place at the table because it would signal to Russia that Ukraine would have the money to sustain its defence for at least the next two years. Russia might have had some successes on the ground in Ukraine, at considerable cost in lives and equipment, but the war is taking an increasingly severe toll on its own economy, which is in the grip of stagflation, on the brink of recession and where the government’s focus on military spending is causing significant economic stresses in regions not benefiting from the war effort. A recent tightening of US sanctions on Russia oil exports, targeting both Russia’s major oil producers and, critically, their customers, will cut further and harder into Moscow’s revenues and its ability to fund the war without risking more domestic economic hardship and social unrest.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/german-president-state-banquet-underway-20251204-p5nkq7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "German President State Banquet underway",
        "publish_date": "Thu, 04 Dec 2025 11:54:34 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "German President State Banquet underway\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/music/my-spotify-listening-age-is-73-years-old-i-demand-a-recount-20251204-p5nkt8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "My Spotify listening age is 73 years old? I demand a recount",
        "publish_date": "Thu, 04 Dec 2025 11:52:35 +1100",
        "category": "entertainment",
        "authors": [
            "Robert Moran"
        ],
        "text": "I never thought Spotify’s Wrapped list would be the thing that led me to an existential crisis, but here we are.\n\nThe streaming giant’s annual round-up of users’ listening habits often produces intriguing wrinkles for social media to pore over: our top songs, albums, and genres of the year. But this year’s Wrapped, released on Thursday, has offered something new that’s confused everyone: your Spotify listening age.\n\nSpotify Wrapped’s listening age is such a lie.\n\nAccording to the streamer, your listening age is based on the idea of a “reminiscence bump”, which they define as “the tendency to feel most connected to the music from your younger years”.\n\n“First, we look at the release dates of all the songs you played this year. Next, we identify the five-year span of music that you engaged with more than other listeners your age. We’re hypothesising that this five-year span matches your ‘reminiscence bump’, assuming you were between 16 and 21 years old when those tracks were released,” Spotify said in a statement.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/motorsport/spice-girls-headline-mclarens-1997-livery-reveal-20251204-p5nkuj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Spice Girls headline McLaren's 1997 livery reveal",
        "publish_date": "Thu, 04 Dec 2025 11:51:57 +1100",
        "category": "finance",
        "authors": [],
        "text": "Spice Girls headline McLaren's 1997 livery reveal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/spotify-breaks-down-this-years-music-in-review-20251204-p5nkuh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Spotify breaks down this year's music in review",
        "publish_date": "Thu, 04 Dec 2025 11:49:18 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Spotify breaks down this year's music in review\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/top-heavy-public-4-billion-222410276.html",
        "title": "Axe to fall on public servants in search for savings",
        "publish_date": "2025-12-04T01:33:55Z",
        "category": "finance",
        "authors": [],
        "text": "A hatchet will be taken to a \"top-heavy\" state public service but job cuts won't be as deep as foreshadowed.\n\nPremier Jacinta Allan and Treasurer Jaclyn Symes on Thursday released a long-awaited independent review of Victoria's public service, led by banking executive and former bureaucrat Helen Silver.\n\nThe Victorian government's response committed to reducing the public service workforce by more than 1000 full-time equivalent jobs, including cutting 332 senior executive and technical specialist roles.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nTwenty-nine government entities will be merged or abolished entirely in the shake-up, alongside cutting back on spending on consultants, labour hire and CBD office space.\n\nTreasury estimates the measures will save Victoria's under-pressure budget more than $4 billion over the next four years.\n\nMs Silver's review contained more than $5 billion in suggested savings, recommending reductions of 2068 jobs, 78 entities and as many as 90 advisory bodies.\n\nThe government's pared-back moves will end unnecessary duplication and rebalance the state's \"top-heavy\" public service, the premier said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"We've rejected those recommendations that go to areas of frontline services,\" she told reporters.\n\nMs Symes admitted to an error on the government's media release that pointed to $427 million in estimated savings from entity mergers, when the actual figure was $27 million.\n\nTreasurer Jaclyn Symes is \"absolutely conscious\" the job cuts are landing 20 days before Christmas. (Diego Fedele/AAP PHOTOS)\n\nThe review found Victoria's public service workforce has grown 16 per cent since 2019, with the number of executive positions up 52 per cent.\n\nHigher-level public service staff, known as VPS5 and VPS6, will be capped at 15 per cent, saving $125 million over four years.\n\n\"We have a situation where we have too many executives, too many in the top of the range and not enough entry-level and graduate positions,\" Ms Symes said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhen announcing the review in February, Ms Symes said it would aim at job losses between 2000 and 3000 - about five to six per cent of the public service workforce.\n\nThe treasurer said she was \"absolutely conscious\" news of the looming job cuts was landing 20 days before Christmas but insisted it wasn't a termination notification.\n\n\"Many of these positions will be removed and altered, and changed by attrition,\" Ms Symes said.\n\n\"That is what has been baked into the $4 billion in savings. We would lose a lot of those savings if we were to pay out redundancies tomorrow.\"\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nVictoria's Community and Public Sector Union claimed victory over the smaller job cut number and suggested most of the pain was behind the 55,000-strong workforce.\n\n\"Six hundred and nineteen of the 1055 jobs to go have already been implemented,\" the union's Victorian branch assistant secretary Mitch Vandewerdt-Holman said.\n\n\"We've been fighting every single one of those cuts. We will continue to fight to save as many jobs as possible.\"\n\nOpposition Leader Jess Wilson described the review as a \"$4 billion admission of failure\".\n\n\"These supposed savings are a drop in the ocean,\" the Liberal leader and shadow treasurer said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"Since this report was handed to Labor in June, Victoria's net debt has grown by almost twice the claimed savings Labor's cuts will deliver.\"\n\nOpposition Leader Jess Wilson has described the review into Victoria's public service as a failure. (Joel Carrett/AAP PHOTOS)\n\nThe state of Victoria's finances are expected to be a major election battleground for the November 2026 election.\n\nMs Symes' predecessor Tim Pallas sought to cut 3000 to 4000 public service jobs in the 2023/24 Victorian budget.\n\nInstead, employee numbers grew from 54,760 to 54,839 over the financial year and the total wage bill was forecast to rise from $38 billion in 2024/25 and $42.4 billion in 2028/29.\n\nVictoria's net debt is expected to reach $194 billion by mid-2029, sending interest repayments soaring close to $29 million a day.\n\nProjections on government spending and debt will be refreshed on Friday when the mid-year budget update is released.",
        "source": "Yahoo"
    }
]