[
    {
        "url": "https://www.9news.com.au/world/donald-trump-announces-pharmaceutical-medicine-tariffs/2c000418-6102-4e2e-baa8-def9ae6511c2",
        "title": "Millions wiped from Aussie healthcare giants after Trump tariff",
        "publish_date": "Fri, 26 Sep 2025 01:36:59 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Millions of dollars have been wiped from the value of some of Australia's largest healthcare companies immediately after US President Donald Trump announced he would introduce a 100 per cent tariff on all imported medicines, starting October 1.\n\nVaccine giant CSL registered a sharp 7 per cent drop, as did radiology company Pro Medicus, in just the first 15 minutes of trade.\n\nPrices in both shares rallied soon after, but still dragged the ASX200 down to a minor loss at the time of publishing.\n\nDonald Trump has announced a 100 per cent tariff on imported medicines. (Truth Social)\n\nThe sheer plummet came after a Truth Social post in which Trump stipulated a much-mooted tariff on imported pharmaceuticals would begin within days.\n\n\"Starting October 1st, 2025, we will be imposing a 100% Tariff on any branded or patented Pharmaceutical Product, unless a Company IS BUILDING their Pharmaceutical Manufacturing Plant in America,\" Trump wrote on Truth Social.\n\n\"'IS BUILDING' will be defined as, 'breaking ground' and/or 'under construction.' There will, therefore, be no Tariff on these Pharmaceutical Products if construction has started. Thank you for your attention to this matter!\"\n\nIf the costs of the tariffs are passed on to consumers, the price of imported medicine in the US could﻿ effectively double.\n\nThis is also a decision that will have a potentially outsized impact on Australia, as vaccines are one of our largest exports to the US.\n\nIn 2024, Australia exported about $2.07 billion worth of pharmaceutical products to the US.\n\nREAD MORE: Dramatic change in polar vortex threatens to shake up spring weather\n\nThe decision could increase medicine prices in the US. (Getty)\n\nWhile that pales in comparison to larger medicine exporters such as Switzerland (which exported $4﻿5.9 billion worth of pharmaceuticals to the US in 2023), it is still a significant slice of Australia's trade with the US - though exports to the US overall are only a small part of Australia's global trade.\n\nAustralian beef exports to the US have grown this year despite a 10 per cent tariff in place, but it remains to be seen how medicine distributors stateside will react.\n\nTrump also announced import tariffs of 50 per cent on kitchen cabinets and bathroom vanities, 30 per cent on upholstered furniture, and 25 per cent on heavy trucks.\n\nPresident Donald Trump. (AP)\n\nTrump said foreign-made furniture was \"flooding\" the US.\n\n\"It is a very unfair practice, but we must protect, for National Security and other reasons, our Manufacturing process,\" he said.\n\nHe said the truck tariffs was to protect local manufacturers from \"unfair outside competition\".",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/interest-rates-likely-to-stay-on-hold-experts-say/4a792e95-c776-4797-97de-b8c2a6f7070e",
        "title": "Mortgage holders 'almost certain' to be kept waiting for rates relief",
        "publish_date": "Thu, 25 Sep 2025 23:22:06 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Mortgage holders hoping for further relief next week will likely be disappointed, with the Reserve Bank of Australia (RBA) tipped to keep the cash rate on hold.\n\nThat is the unanimous opinion of 32 economists and economic experts canvassed by financial research website Finder.\n\nIt was the first time they had all reached total agreement on the outlook for interest rates this year, and was made after ﻿a rise in inflation and buoyant consumer spending.\n\nA panel of economic experts have unanimously agreed the RBA will keep interest rates on hold next week. (AP/Mark Baker)\n\nIf they are accurate, the RBA board will keep the cash rate at 3.6 per cent when it wraps up its meeting next Tuesday.﻿\n\nGraham Cooke, head of consumer research at Finder, said the central bank faced a tricky balancing act.\n\n\"Mixed economic signals have kept the RBA in a holding pattern,\" he said.\n\n\"While spending remains strong, rising inflation and increasing unemployment add complexity to the decision-making process.\"\n\nExperts canvassed by Finder said the RBA was seeking a step-by-step reduction in the cash rate.\n\n\"No doubt the RBA is on a slide down with the cash rate. However, the several promised cuts will be spread over quite some time, and we should not expect a cut at every single meeting,\" Tomasz Wozniak, from the University of Melbourne, said.﻿\n\nHowever, most of the expert panel have punted on a Melbourne Cup Day rates cut in November.\n\nSeven out of 10 believe the central bank would make the final reduction in the cash rate for this year on November 4, less than an hour after the runners set off in the iconic horse race.\n\nBut Cooke said mortgage holders should remain cautious.\n\n\"September's increase in monthly inflation from 2.8 per cent to 3 per cent may keep the RBA's scissors in the sheath on Cup Day if the quarterly data follows suit.\"\n\n﻿ DOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/trump-says-chinas-xi-has-approved-of-proposed-deal-putting-tiktok-under-us-ownership/208f4dd8-ef85-4e9f-8c63-15a979495033",
        "title": "Trump says China's Xi has approved of proposed deal putting TikTok under US ownership",
        "publish_date": "Thu, 25 Sep 2025 21:47:24 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "President Donald Trump has signed an executive order that he says will allow TikTok to continue operating in the United States in a way that meets national security concerns laid out by the law.\n\nPresident Joe Biden signed legislation last year calling for China’s ByteDance to sell TikTok’s assets to an American company by early this year or face a nationwide ban, but Trump has repeatedly signed orders that have allowed TikTok to keep operating in the US as his administration tries to reach an agreement for the sale of the social media company.\n\nMuch is still unknown about the actual deal in the works, but Trump said Thursday that Chinese leader Xi Jinping has approved it. Any major change to the popular video platform could have a huge impact on how Americans — particularly young adults and teenagers — consume information online.\n\nTikTok is seen in the app stores of an iPhone and Google Pixel on January 8, 2025. (CNN)\n\nThe Chinese embassy in Washington didn’t immediately respond to an AP inquiry seeking confirmation that China has signed off on the proposed framework deal.\n\nAbout 43 per cent of US adults under the age of 30 say they regularly get news from TikTok, higher than any other social media app including YouTube, Facebook and Instagram, according to a Pew Research Center report published Thursday.\n\nTrump said in response to a question at a signing ceremony Thursday that he would make the American-controlled TikTok “100 per cent MAGA” if he felt he could, but he intends for “every philosophy, every policy” to be “treated right.”\n\nVice President JD Vance said the deal ensures that “American investors will actually control the algorithm” that determines the content seen on the social media app. He said more information about the deal will be revealed in the coming weeks.\n\nWho will control the new TikTok venture?\n\nUnder the terms of the deal that have so far been revealed by the White House, the app will be spun off into a new US joint venture owned by a consortium of American investors — including Oracle and investment firm Silver Lake Partners.\n\nThough the details have yet to be finalised, the investment group’s total stake in the new venture would be around 80 per cent, while ByteDance is expected to have a 20 per cent, or smaller, stake in the entity.\n\nThe board running the new platform would be controlled by US investors. ByteDance will be represented by one person on the board, but that individual will be excluded from any security matters or related committees.\n\nTikTok’s new owners include many whose business or political interests are tied to Trump, including Oracle co-founder Larry Ellison and Rupert Murdoch, raising questions about whether political influence will be exerted into the platform.\n\nAlthough he stepped down as Oracle’s CEO more than a decade ago, Ellison remains heavily involved as chairman and chief technology officer. Now 81, he could be in line to become a behind-the-scenes media power player, having already helped finance Skydance’s recently completed $8 billion merger with Paramount, a deal engineered by his son, David.\n\nTrump also mentioned Dell founder Michael Dell will be an investor in the new venture.\n\nTikTok users could now “get the editorial policies of the people who now have control of the company,” said David Greene, civil liberties director of the Electronic Frontier Foundation. ”It won’t be 100 per cent MAGA. The question is how it will treat criticism of him and people he likes.\"\n\nPresident Donald Trump listens to a question from a reporter as he speaks after signing an executive order regarding TikTok in the Oval Office at the White House, Thursday, Sept. 25, 2025, in Washington. (AP Photo/Alex Brandon) (AP)\n\nWhat we know about the algorithm powering the platform\n\nThe recommendation algorithm that has steered millions of users into an endless stream of video shorts has been central in the security debate over TikTok. China previously maintained the algorithm must remain under Chinese control by law. But a US regulation that Congress passed with bipartisan support said any divestment of TikTok must mean the platform cut ties with ByteDance.\n\nAmerican officials previously warned the algorithm — which is a complex system of rules and calculations that platforms use to deliver content to your feed — is vulnerable to manipulation by Chinese authorities, who can use it to shape messaging on the platform in a way that’s difficult to detect, but no evidence has ever been presented by US officials showing that China has attempted to do so.\n\nTrump, during his first term, signed an executive order attempting to ban the app if it didn’t split off its US business, warning that TikTok’s “data collection threatens to allow the Chinese Communist Party access to Americans’ personal and proprietary information.”\n\nTrump has since changed his approach to TikTok, often citing its role in helping him reach young voters in the 2024 presidential election.\n\nAlthough the details remain unclear, a Trump administration official said that a licenced copy of the ByteDance created algorithm — retrained solely with US data — will power the new US version of the app. Administration officials say this retraining effort will nullify any risk of Chinese interference and influence.\n\nVance said “we wanted to keep TikTok operating” but address security concerns so that “Americans can use TikTok but use it with more confidence than they had in the past.”\n\nYoung people especially “really wanted this to happen,” Trump said during the signing ceremony.\n\nThat makes it unclear if the US version of TikTok will be a different experience than what users in the rest of the world are used to. Any noticeable changes made to a social media platform’s service raises the risk of alienating its audience, said Jasmine Enberg, an analyst for the research firm eMarketer.\n\nIn a prime example of how a change of control can reshape a once-popular social media platform, billionaire Elon Musk triggered an almost immediate backlash after he completed his takeover of Twitter nearly three years ago.\n\nBut Musk made extremely visible changes, including changing its name to X, pulling back on its content moderation and adding exclusive features for paid subscribers. The changes that gradually occur while different data is fed into the US copy of TikTok’s algorithm could be subtle and unnoticeable to most of its audience.\n\n“Social media is just as much about the culture as it is the technology, and how users will take to new ownership and potentially a new version of the app is still an open question,” Enberg said.\n\nWhat motivated China to make this deal\n\nBeijing once called the demand that TikTok be spun off from its Chinese parent company an act of “robbery,” but Chinese officials changed their tune as the US-China trade war progressed.\n\nFollowing the announcement of a possible TikTok framework deal after US-China trade talks in Spain, some observers believed that China was able to extract concessions from the US on loosening trade restrictions in exchange for the TikTok deal. Others believe China was willing to do so to pave the way for a meeting between Xi and Trump.\n\nA TikTok deal would allow China to keep the ball rolling on trade negotiations, said Sun Yun, director of the China program at the Washington-based think tank Stimson Centre. “TikTok alone does not compare with the importance of an amicable US-China relations and the positive momentum that prevents many negative development from happening.”\n\nDimitar Gueorguiev, associate professor of political science at Syracuse University, said TikTok has become an “expendable concession” to Beijing because it is no longer a disruptive newcomer as it was five years ago.\n\nTikTok’s highly personalised “For You” video feed was seen as its secret sauce five years ago, when Trump first threatened to ban the app, but Instagram and other rivals now work similarly.\n\nGueorguiev argues that Beijing is more interested in retaining access to US technology and services, at least in the short term, so it can build up self-sufficiency in semiconductor, artificial intelligence and advanced manufacturing.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/macquarie-repay-shield-investors-michael-donovan-relieved-to-be-refunded-after-collapse-exclusive/c2381615-6ff9-41fc-a773-322d9a1fdb25",
        "title": "Micki thought he'd lost $150k. Then an email arrived in his inbox",
        "publish_date": "Thu, 25 Sep 2025 19:44:30 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "E﻿xclusive: A NSW chef who lost his $150,000 retirement fund in the multibillion-dollar super collapse is \"hugely relieved\" he will have his nest egg returned next week.\n\nMichael \"Micki\" Donovan, 58, ﻿from Bermagui on the NSW South Coast was left without a cent in his super when Shield Master Fund collapsed and went into liquidation.\n\nMacquarie Investment Management Ltd (MIML), a subsidiary of the Macquarie investment bank, this week said 3000 investors like Donovan will have 100 per cent of their money reimbursed by September 30.\n\nMichael Donovan was worried he'd lost $150,000 of his retirement fund after Shield's collapse. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nDonovan told 9news.com.au ﻿he will need to delay his retirement after missing out on thousands of dollars in interest as he waited for his money to be returned.\n\n\"I've still got a mortgage... so it was all I had to retire on in another five or six years because I'm a chef and I can't keep working at this age,\" Donovan said.\n\n\"It's set me back three, four years at least.\"\n\nDonovan realised his $150,000 had been frozen when he went to transfer it back to his original fund ﻿to claim disability insurance after tearing his rotator cuff.\n\nHe said he called MIML on September 5 but was told he \"didn't have any super left\".\n\nIt triggered a weeks-long nightmare for Donovan.\n\nThe hard-working chef is still recovering from his injury and wondered if he'd ever be able to retire.\n\n\"I left Bermagui, I was that depressed... I came up to Mudgee to see my best friend,\" Donovan said.\n\n\"﻿I've got friends in Mudgee, I worked here years ago. I could get some work here, do a couple of jobs here and there until my shoulder heals.\n\n\"I just couldn't believe it. Without my friends around me here in Mudgee, I didn't see any future.\"\n\nHe added: \"It's been a hard slog and I haven't slept for weeks.\"﻿\n\nDonovan told 9news.com.au ﻿he will still need to delay his retirement. (Supplied)\n\nDonovan joined a Facebook group of over 1500 other Australians who have been impacted by the collapse of both Shield Master Fund and First Guardian Fund.\n\nAround 12,000 Australians have been caught up in the $1.2 billion collapse.\n\nHe said the support of friends, along with thousands of other empathetic group members in his exact position, saved his life.﻿\n\nDonovan is still heartbroken for the countless others who haven't been told their money will be returned yet – if ever.\n\n\"﻿We're working-class Australians, there's something wrong with the system,\" he said.\n\n\"I'm not rich. It's only $150,000 and without my interest, it would have been more.\n\n\"But there's people who have lost hundreds of thousands more and they're at retirement... these poor people.\"\n\nDonovan calculates he has lost between $20,000 and $30,000 in interest since Shield's collapse.\n\nMIML won't pay back any potentially earned interest and has emailed Donovan to say he will be handed back 100 per cent of the net capital he invested in Shield by Tuesday.\n\n\"I had no idea it was Shield at all,\" he added, explaining he didn't realise where MIML had invested his money.\n\n\"It's a huge relief. I was pretty down, man. I know it's not huge money, but it's all I had.\"\n\n﻿He wants the superannuation industry to undergo urgent reform so no other Australian becomes entangled in another collapse.\n\nAccording to ASIC, around 5800 people invested their superannuation retirement savings into Shield.\n\n\"In many cases, this happened after people were contacted by lead generators and referred to financial advisers,\" ASIC said\n\n\"These advisers often told investors to roll over their existing superannuation balances into a choice superannuation fund available on a platform or to set up a self-managed super fund to facilitate investment into Shield.\"\n\nAn email sent from MIML to Donovan. (Supplied)\n\nASIC investigation after Shield's collapse﻿\n\nASIC said MIML, as the superannuation trustee, oversaw about $321 million in super investments into Shield by about 3000 of its members between 2022 and 2023.\n\nASIC began proceedings in the Federal Court against MIML, a subsidiary of Macquarie, following admissions that it did not act efficiently, honestly and fairly by failing to place Shield on a watch list for heightened monitoring.\n\nThe corporate watchdog also accepted a court-enforceable undertaking from MIML to ensure Macquarie pays members 100 per cent of the amounts they invested in Shield, less any amounts withdrawn.﻿\n\nASIC's Sarah Court said yesterday she hoped other trustees would take similar action to Macquarie.\n\n\"I'd just encourage any of the other trustees to speak to us about how they can restore investors to where they were before they put investments in either the Shield Master Fund or the First Guardian Master Fund,\" Court said.﻿\n\n\"Superannuation trustees offering choice platforms are on notice.\n\n\"They are gatekeepers for retirement savings. ASIC expects them to take active steps to monitor the funds they make available to members through their platforms.\"\n\nIn February 2024, ASIC halted new offers of investments in Shield.\n\n\"ASIC is investigating the circumstances surrounding Shield,\" the financial watchdog said.\n\n\"ASIC is investigating Keystone Asset Management Ltd (in liquidation) (the responsible entity for Shield), its directors and officers, the role of the superannuation trustees, certain financial advisers who recommended investors invest in Shield, the lead generators, and the research house which rated Shield.\"\n\nReaders seeking support can contact Lifeline on 13 11 14 or beyond blue on 1300 22 4636.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/typhoon-ragasa-impacts-australians-in-hong-kong-after-killing-dozens-in-taiwan/8adc2416-0bca-425e-b9ea-25cc7ef5e501",
        "title": "'Scrambling': Australian tourist stranded as Typhoon Ragasa lashes Hong Kong",
        "publish_date": "Thu, 25 Sep 2025 22:51:43 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "Typhoon Ragasa is barrelling through China, as the death toll in Taiwan reaches 14.\n\nAs a result of the storm - previously a super typhoon - a number of Australians find themselves stranded in Hong Kong, with thousands of flights cancelled and airports shut.\n\nThe extent of the destruction is starting to be realised as the system pushes west along the southern Chinese coast toward Vietnam.\n\nREAD MORE: Albanese splits from Trump on key issues hours after smiling selfie ﻿\n\nAn elderly woman shelters from the rain in the aftermath of Super Typhoon Ragasa in Shenzhen in southern China's Guangdong province on Wednesday, Sept. 24, 2025. (AP Photo/Ng Han Guan)\n\nIt was anything but happy hour at Melbourne man Viviano Romito's harbourside bistro, Frites.\n\n\"When mother nature calls, there's not much you can do,\" he told 9News.\n\n\"The pressure of the wave came right over the wall and directly into the restaurant.\n\n\"Completely gutted right throughout, the whole bottom floor.\"\n\nHurricane-force winds whipped up a storm surge that swamped multiple waterfront businesses.\n\nIt was anything but happy hour at Melbourne man Viviano Romito's harbourside bistro, Frites. (9News)\n\nThe restaurant's bottom floor was completely gutted by a storm surge that swamped multiple waterfront businesses. (9News)\n\n\"All the restaurants were affected exactly the same,\" Romito said.\n\nOver at the Fullerton Hotel, there was not just a leak but a wave, turning the lobby into the pool deck and washing staff off their feet.\n\nEven the high-rise rooms were copping it.\n\n\"Even though the windows were closed, because the wind was so strong, it was blowing the rain through it, so we had to put towels down,\" Barbara Leota told 9News via Zoom.\n\nBarbara Leota and family friend Grisellda Tautalafua from Sydney are stuck in Hong Kong due to Typhoon Ragasa (9News)\n\nLeota and family friend Grisellda Tautalafua from Sydney had their flights cancelled, as have thousands of others in Hong Kong.\n\n\"They actually shut the airport for 36 hours, so no flights coming in and out - apparently over 700 flights were cancelled, so they're just scrambling to try and get everyone sorted,\" Tautalafua said.\n\nThe couple are hoping to be on a flight back home tomorrow.\n\nFlights in Hong Kong resumed today after some 1000 had been disrupted, affecting about 140,000 passengers. Businesses also re-opened on Thursday.\n\nAn uprooted tree blocks a path in the Ho Man Tin area, as super typhoon Ragasa approaches in Hong Kong, Wednesday, Sept. 24, 2025. (AP Photo/Chan Long Hei)\n\nLike in Hong Kong, activities halted earlier in the week are gradually returning to normal in China's Guangzhou and Shenzhen.﻿\n\nRagasa peaked at super-typhoon strength on Monday, with maximum sustained winds of 265 km/h making it the world's strongest cyclone of the year.\n\nIn the Philippines, Ragasa left at least 11 dead, while in Taiwan, authorities revised the death toll from 17 to 14 on Thursday, citing double-counting.\n\nA man walks his dog near a uprooted tree in the aftermath of Super Typhoon Ragasa in Shenzhen in southern China's Guangdong province on Wednesday, Sept. 24, 2025. (AP Photo/Ng Han Guan)\n\nBy Thursday afternoon, its sustained winds had weakened to a maximum 55 km/h and Ragasa was downgraded to a tropical depression.\n\nIt's forecast to dissipate eventually while remaining a rain threat for Vietnam and other parts of South-East Asia.﻿\n\n- Reported with Associated Press.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/tourism-board-wants-to-charge-tourists-to-visit-twelve-apostles-victoria/a89c04f8-8994-4afb-b8ef-5af55a7c9116",
        "title": "Tourists could be charged a fee to visit famous Aussie landmark",
        "publish_date": "Wed, 24 Sep 2025 07:24:09 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "A Victorian tourism board and local council have floated the idea of charging tourists a fee to visit the famous Twelve Apostles on the Great Ocean Road.\n\nGreat Ocean Road Regional Tourism (GORRT) and Corangamite Shire have today called on the Victorian state government to seize a \"once-in-a-generation\" opportunity to greenlight a user-pays model to access the iconic natural attraction.\n\nThe proposed fee would support \"infrastructure, conservation, community wellbeing and user experience,\" the joint statement said.﻿\n\nThe famous Twelve Apostles on the Great Ocean Road. (Getty Images/iStockphoto)\n\n\"As stewards of the visitor economy in this extraordinary region, we believe a thoughtfully introduced user-pays system is not only fair, it is essential,\" said GORRT chair Andrew Jeffers.\n\n\"This approach must allow the active management of visitation across the day and year, encourage overnight stays, capture economic benefit, and reinvest directly into protecting and enhancing the fragile coastal environment.\"\n\nThe fee proposal was suggested in the regional tourism board's strategic business plan for 2025-2029.\n\nThe statement noted that a \"well-designed\" model would reward ﻿overnight and off-peak travel to relieve the peak period pressures.\n\n\"The Great Ocean Road is more than a scenic drive – it's a living, working region filled with vibrant communities, remarkable landscapes, and cultural depth,\" said GORRT general manager Liz Price.\n\nThe Great Ocean Road attracts millions of tourists each year. (Getty Images/iStockphoto)\n\nREAD MORE: Macron forced to walk NYC streets as Trump motorcade blocks traffic\n\n\"It's time we aligned our tourism management with our values – sustainability, responsibility, and long-term community benefit.\"\n\nThe tiered fee system was not determined in the statement.\n\nHowever, the proposal said the user-pays model would help fund a $126 million investment into the﻿ Twelve Apostles Precinct, which includes a new visitor centre.\n\nThe joint message urged the Victorian government to \"lead boldly\" to unlock the full potential of the Great Ocean Road region.\n\n﻿An estimated 6.8 million tourists traverse the Great Ocean Road each year, with tqo million visiting the Twelve Apostles annually.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/mansion-in-sydneys-eastern-suburbs-sets-australian-auction-record-at-451m/779c7aa8-c1b7-4e52-915f-91472b11a9fa",
        "title": "Somebody just made the most expensive bid in Aussie history",
        "publish_date": "Thu, 25 Sep 2025 01:52:13 +0000",
        "category": "finance",
        "authors": [
            "Sep"
        ],
        "text": "A rare Rose Bay mansion in Sydney's eastern suburbs has sold for $45.1 million, setting what is believed to be Australian record for the most expensive home sold at auction.\n\nThe grand Georgian Revival home was built in 1935 and sits on a 2536-square-metre block.\n\nKnown as 'The Knoll' due to its elevated position, it overlooks the Royal Sydney Golf Club.\n\nThe Knoll is in a prized position overlooking the golf course. (Richardson and Wrench Double Bay)\n\nRichardson and Wrench Double Bay's James and Michael Dunn handled the sale on behalf of the Burns family, who have held the prestigious property for 60 years.\n\nThe late vendor, Elizabeth Burns, died last year. She was a descendant of Sir James Burns, founder of the merchant company Burns Philp.\n\nMichael Dunn told 9news.com.au it was a \"very competitive auction\".\n\n\"The property was called on the market at around $40 million and it had exceeded the reserve for the property at that point,\" he said.\n\n\"It was a very spirited auction. There were four bidders fighting, and there were many more other potential buyers at the auction.\"\n\nFeedback from potential buyers had originally led the real estate agency to put an estimated price of $30 million -$35 million on the property, however, it was always hard to predict what would happen when such a rare home was on offer, Dunn said.\n\nAgents originally put price estimate of $30 million -$35 million on the home. (Richardson and Wrench Double Bay)\n\n\"In the last couple of years, there have been no sales of properties of non-waterfront properties, in the eastern suburbs, of this land size,\" he said.\n\n\"So arriving at an opinion of value is very, very challenging. There are no simple formulas.\n\n\"Mansions of this calibre come up rarely, land size of this calibre comes up rarely, fronting the newly-renovated Royal Sydney Golf Club comes up rarely.\n\n\"It's one-of-a-kind and I think the buyers recognised that.\"\n\nDunn said the successful bidders planned to ultimately renovate the property and live in it.\n\nThe sale eclipses the previous known record of $43.1 million for a sale at auction, set in 2021 for a $43.1 million mansion on 47 Lansell Road in Melbourne's Toorak.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/nrlw-finals-broncos-knights-brigginshaw-upton/105820672",
        "title": "The finals demons driving Brisbane towards NRLW glory",
        "publish_date": "Fri, 26 Sep 2025 01:38:59 +0000",
        "category": "sports",
        "authors": [],
        "text": "Brisbane have been one of the NRLW's powerhouses for the competition's entire history but after four seasons in the finals wilderness, the Queensland powerhouse is hell-bent on reclaiming some of their past glories.\n\nThe Broncos were the stand-outs in the NRLW's early years, losing just one match in the first three seasons as they romped to a trio of premiership titles.\n\nBut since then, it has been harder going. Brisbane consistently boasts one of the most talented squads in the game but they have yet to win a finals game since the 2020 grand final.\n\nIt is a four-year drought that is not just in the back of Brisbane's mind ahead of Sunday's preliminary final against Newcastle, it is the ultimate propulsive force.\n\nBrisbane were the gold standard in the NRLW's early years. (Getty Images: Cameron Spencer)\n\nA grand final clash between the Broncos and the Sydney Roosters, who take on Cronulla on Saturday night in the other prelim, has seemed inevitable all season but as veteran halfback Ali Brigginshaw points out, such a showdown has seemed inevitable in the past.\n\n\"Everyone tries to line us up with the Roosters but everyone said the same thing last year and we didn't make it. For us, it's not about anyone we're playing, it's about us,\" Brigginshaw said.\n\n\"That semifinal has been a huge hurdle for us and we haven't been able to overtake it.\n\n\"This group has achieved nothing. We've been together over three years and without silverware, there's not much to talk about because you can't talk about the games you should have won.\n\n\"We're focused on this semifinal more than anything. I think it'll be the toughest game we have because we have to get over that hurdle.\"\n\nBrigginshaw has played in each of Brisbane's failed finals campaigns in recent years, including last season's shock 14-0 semifinal loss to Cronulla.\n\nBrisbane were left wanting in a shock finals loss to Cronulla last year. (AAP: Dave Hunt)\n\nThis year's Broncos team is their most dominant in years. They lost just once in the regular season and come into the finals in red-hot form, having outscored their opponents by a combined 120-10 over the final three weeks of the regular season.\n\nBut Brigginshaw knows that counts for little now and the 35-year-old is hell bent on avoiding the pitfalls that have torpedoed Brisbane in the past.\n\n\"We might have taken shortcuts over the past few years and we learned you can't take those shortcuts,\" Brigginshaw said.\n\n\"The other team is doing everything they can to beat you and if you aren't doing all the one-percenters, it all adds up.\n\n\"If half the team isn't doing the right thing, you'll be found out.\"\n\nWhat could make the difference for Brisbane this time around is the form of fullback and captain Tamika Upton, who has scored 18 tries in 11 matches and seems certain to claim her second Dally M player of the year award.\n\nHer form on return to Brisbane after three seasons with Newcastle is clear evidence of her status as the best player in the world, given she leads the league in line breaks, try assists and line break assists.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nBrigginshaw played with Upton in her initial stint with Brisbane from 2019 to 2021 and has borne witness to the change first-hand.\n\n\"The way she articulates her game, the way she breaks the game down has changed,\" Brigginshaw said.\n\n\"I could ring her right now and she'd know who plays on what side, how they field kicks, what side they like to tackle with, everything.\n\n\"She works so hard during the week to get her body and mind ready.\n\n\"Tamika's brought a lot of leadership and she's taken that pressure off me. I've never felt so relaxed in the group because there's so much help from her and the rest of the leaders.\n\n\"That's where we've nailed it to get the most out of the group.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/brisbane-broncos-must-fill-carrigan-void-or-perish/105820354",
        "title": "Broncos must fill Carrigan void or perish",
        "publish_date": "Fri, 26 Sep 2025 01:29:08 +0000",
        "category": "sports",
        "authors": [],
        "text": "Brisbane must find a way to collectively make up for the loss of suspended lock Pat Carrigan or risk being exposed by Penrith in the middle of the park in the grand final qualifier.\n\nCarrigan has averaged 65 minutes a match in 24 games this year, and gets through a power of work on both sides of the ball.\n\nHis 158m and 36 tackles each game are just an aspect of his impressive resume.\n\nThe leadership of the Queensland and Australia powerhouse is invaluable, which is why coach Michael Maguire made him captain when regular skipper Adam Reynolds was injured.\n\nMaguire has named versatile Tyson Smoothy at number 13 to replace Carrigan at Lang Park on Sunday. Whether he runs out with the starting team is up for debate.\n\nSmoothy has averaged just 29 minutes through nine matches this season. If he runs on as per program, it won't be for a long stint. The 26-year-old does get through an average of 19 tackles each match, and rarely misses, but offers little in attack with just 26m per game.\n\nThe enduring legacy of the 2023 grand final Photo shows A man scores a try during a rugby league match, while another from the opposite team kneels behind. On Sunday, the Broncos and Panthers will face off in the finals for the first time since the 2023 grand final, but the memory of that night still hangs over both sides.\n\nThose stats alone show how much the rest of the pack will have to lift to cover for Carrigan.\n\nThe other three forwards named on the bench — Xavier Willison, Ben Talty and Kobe Hetherington — will be vital cogs to maintain the momentum of props Payne Haas and Corey Jensen when they take a break.\n\nHaas said they would all be expected to lift.\n\n\"I think it's just the work they've been putting in ever since pre-season. They all know their roles and know what's required of them,\" Haas said.\n\nThe way the champion prop addressed the topic suggested he was not prepared to accept anything but the best of his fellow forwards.\n\nWhen it comes to impact, the biggest asset for the Broncos against the Panthers is the return of giant forward Willison.\n\nThe 23-year-old had played every game of the season before breaking his right forearm against South Sydney in round 22.\n\nHis 23 tackles and 103m per match this season have been full of punch.\n\n\"I thought he started so well, and of course, to have that fracture in his arm didn't help,\" Haas said.\n\n\"But he's grown so much as a person, not just on the field but off the field as well.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I think maturity has been a big part of him and being professional about how he goes about his business, so I've seen that come a long way. He's come on in spades. especially this year.\"\n\nWillison will wear a forearm guard and will no doubt be tested by the Panthers' pack.\n\nMeanwhile, Haas put to bed suggestions he was still struggling with an ankle he injured in the 29-28 qualifying-final win over Canberra a fortnight ago.\n\n\"I think I was just being soft. I am all good,\" Haas grinned.\n\n\"I think we've got the best physios and performance staff here. So they've been looking after me, and it's helped having that extra week off, and I am feeling fresh and ready to go.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/branxholme-wallacedale-saints-focus-on-club-culture/105754946",
        "title": "Footy club facing population decline changes culture to attract recruits",
        "publish_date": "Fri, 26 Sep 2025 01:21:57 +0000",
        "category": "sports",
        "authors": [],
        "text": "On a cold winter's evening on the fringe of Branxholme's football oval, the mood is warm and lively among the crowd of rugged-up locals in the south-west Victorian community.\n\nLaughter spreads as a senior footballer arrives in a black-tie suit.\n\n\"The media is in town, so I better look good in case I end up on TV,\" he says with a grin.\n\nThis positive, relaxed and friendly vibe at Branxholme Wallacedale Football Netball Club's Thursday night training is what attracts people like Allan Lewis.\n\nAllan Lewis loves going to Thursday night training and home games. (ABC South West Vic: Ted O'Connor)\n\n\"You wouldn't go to the local pub, you would come down to footy training and talk to everybody, because everyone comes down here and we just have a great time,\" he says.\n\nAllan watches his son Jacoby, whose flowing mullet bounces in the breeze.\n\nJacoby Lewis, far right, with the long mullet, alongside his under-11s teammates. (ABC South West Vic: Ted O'Connor)\n\nThat Saturday, Jacoby and his fellow under-11s Saints claim their first win of the season in front of a home crowd.\n\nThe boys and girls in the young team have an entertaining collection of nicknames such as \"Atlas\", \"Package\", \"Tonka\" and \"Banana\".\n\nAmusing nicknames are a key feature of the Saints under-11s football team. (ABC South West Vic: Ted O'Connor)\n\nThey sing the victory song in the change rooms surrounded by their parents, and Allan is right behind Jacoby, smiling proudly.\n\nAllan loves the atmosphere at home games.\n\n\"It's unreal,\" he says.\n\n\" We're like one big family. Everyone looks after each other. \"\n\nThe under 11s players receive awards after their first win of the 2025 season. (ABC South West Vic: Ted O'Connor)\n\nClub faces population decline\n\nStrategies to create a strong club culture are talked about at the highest levels of AFL football.\n\nThe current vibe at Branxholme has not come overnight.\n\nThe club has responded to the sort of demographic shifts that are causing other football clubs across Australia in small country towns to merge or fold, ending proud legacies stretching back generations.\n\nThe community's population has declined to just over 300 people at the last census.\n\nResidents blame changes in the farming sector, resulting in fewer workers.\n\nBranxholme's football oval sits on the fringe of the small town. (ABC South West Vic: Ted O'Connor)\n\nThere are only 10 children at the local primary school and neighbouring Wallacedale is little more than a name on the map.\n\nSaints turn around 'rough reputation'\n\nMore than a decade ago, the club at one point could not fill a reserves grade, and like other teams in the league, it had no junior footballers, who played in a separate competition.\n\nSaints football director David Simpson says back then, the club did not have a great reputation.\n\nDavid Simpson says the club's culture has improved a lot over the past decade. (ABC South West Vic: Ted O'Connor)\n\n\"We had a lot of rough guys around here and that didn't help attract players and Branxholme had a bad name,\" he says.\n\nIn 2024, the league amalgamated with a local junior competition and this allowed Branxholme, along with other clubs, to field under-age football teams, being under 11s, 14s and 17s.\n\nBranxholme Wallacedale and the Westerns say they have good numbers coming through their junior ranks. (ABC South West Vic: Ted O'Connor)\n\nIt posed a challenge for the Saints leaders: how to fill those teams with so few people in the community to draw from.\n\nThis season, the Saints do not have an under-17s football side, and their undermanned reserves have copped some hefty floggings.\n\nBut David and other leaders at the club are feeling positive about the future.\n\nHe says enough younger players are coming through the ranks to hopefully fill all junior football grades next year, priming the reserves and seniors for success in future years.\n\nConditions can sometimes be muddy in south-west Victoria. (ABC South West Vic: Ted O'Connor)\n\nThe football director says the club's strategies to improve its culture are paying off.\n\nThey include actively recruiting families, children and fun, popular coaches; making sure everyone — footballers and netballers — get along so it's not cliquey; and seeking out children who do not play football or are not having fun at other clubs.\n\n\"Great club people, that's really been our number one priority,\" David says.\n\n\"We make sure everyone gets along with everyone and that works so well.\n\n\" Things are going in the right direction. We've got the girls football team coming in next year as well, so that's more growth for the club. \"\n\nParents of the under-11s were proud of their first win for the year. (ABC South West Vic: Ted O'Connor)\n\nPlan to make people want to be at Branxholme\n\nAs the Saints go on the attack in the senior football game, club stalwart Leonie Bell yells, claps and bounces on her heels.\n\nShe organises a rodeo every year to raise much-needed funds for the Saints and is on the club's executive committee.\n\nLeonie Bell loves cheering on Branxholme's footballers and netballers. (ABC South West Vic: Ted O'Connor)\n\nShe says recruiting can be a \"struggle\" due to the lack of people in the area.\n\nSo the committee's goal is to make the club an appealing place for newcomers, not only from Branxholme and Wallacedale, but surrounding areas, including the much larger hub of Hamilton.\n\n\"The whole club had a plan: let's get everyone to like the club and want to be here and then moving forward, everything just progresses from there,\" she says.\n\n\" We're a very, very small community out in the middle of nowhere … so everyone just comes down here really for your social life and just to have a lot of fun and watch the sport. \"\n\nOpposition on similar journey\n\nBranxholme Wallacedale is playing Westerns, a football netball club based further south in Portland.\n\nKangaroos president Vicki Clayton is doing odd jobs in the opposition change rooms and she tells a similar story to her opponents.\n\nVicki Clayton says her club has also been improving its culture to make it an appealing place for families. (ABC South West Vic: Ted O'Connor)\n\nThe Kangaroos are also struggling to fill sides in junior football, but they, like the Saints, have improved their culture to make it more family-friendly.\n\nShe says good Auskick and under-11 numbers mean she is confident about a bright future.\n\n\"We have junior nights, our Thursday night dinners are a real family affair,\" she says.\n\n\"So it's about setting the right environment for families to choose Westerns as a club because they value that culture.\"\n\nInjured senior footballer Lachlan Holcombe donned a traditional goal umpiring outfit to entertain his friends at the Saints. (ABC News: Ted O'Connor)\n\nLittle actions that count\n\nStuart Craig provides support and advice to regional sporting clubs on building positive cultures and says those appealing environments are especially important for teams in areas suffering population decline.\n\nThe business manager at the non-profit organisation Sports Focus says there are many acts and gestures needed to create an attractive club vibe, which at their heart are about treating people with respect.\n\n\"What they're wanting is an environment where I can go and I feel welcomed, I've got a sense of belonging in this place because I'm respected,\" he says.\n\n\" I'm getting recognised for the contribution I'm making, so that's being valued. It's all those little things. \"\n\nThe club is trying to be a welcoming place for people from all walks of life. (ABC South West Vic: Ted O'Connor)\n\nAllan Lewis hopes that in the future, the club will be just as successful on the field as it is off.\n\n\"We're hoping that we keep all the younger players and they gradually move up to the 14s, 17s, ressies and seniors and get us a couple of premierships,\" he says.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/afl-grand-final-preview-2025-geelong-profile-against-brisbane/105819810",
        "title": "How the unpredictable Cats baffled opponents on their way to the grand final",
        "publish_date": "Fri, 26 Sep 2025 01:16:23 +0000",
        "category": "sports",
        "authors": [],
        "text": "For the eighteen AFL clubs around the country there are two main challenges — how to get good.\n\nAnd two — how to stay good.\n\nPlenty of teams hit that first bar, at least for a short period of time. The past six years have seen six different premiers and seventeen different teams making finals.\n\nIt's that second challenge that is far harder. Teams can often stretch their premiership window out, but the rubber band usually snaps back sooner or later — see the Hawks, Eagles, Tigers or Demons.\n\nBut the Cats might be the exception to the rule.\n\nLoading...\n\nGeelong has played in 15 of the past 22 preliminary finals and missed finals just three times in that period. In that time the Cats have been consistently good — frustratingly so if you are a fan of any other team.\n\nOscar Wilde once posited that it was his belief that \"consistency is the last refuge of the unimaginative\".\n\nWilde may have been a century early to see coach Chris Scott not only shepherd the most consistently great team in the league, but also its most inventive.\n\n\"We do sort of shift things regularly in-season. We are big believers that the game changes and we want to change either with it or hopefully a little bit in front of it,\" Scott said last week.\n\nComing into this year's grand final, Geelong has put together the most impressive hot streak of any team this year.\n\nThey have won their past eight games in a row by at least 30 points.\n\nThat includes a victory against the Lions in the first week of finals.\n\nThat brilliance has delivered the Cats to the cusp of their eleventh flag. To stand upon the podium, they just need to continue to be their consistently dominating — and inventive — selves.\n\nMaximising their mistakes\n\nTo win games of Australian Football you've got to score more than the other team. Even Oscar Wilde might have known that.\n\nAnd in order to score, you've got to have the ball. And no team is better at winning the ball and using it effectively than Geelong.\n\nThe Cats lead the league from scoring from intercepts across the course of the season.\n\nTeams that have finished top three in total intercept scoring differential have won the flag in 18 of the past 19 seasons.\n\nWhile the Cats lead the league in that number (by some way), Brisbane are only ranked fifth across the year.\n\nAround two thirds of all scoring happens from intercepts league-wide, making it the most important phase of the game.\n\nThe Cats are adept at scoring from turnovers anywhere on the field but it's front half turnovers where they shine most. They average nearly six goals a game from intercepts they take forward of centre.\n\nA large part of that is down to the pressure that they apply in their forward half, with the Cats leading the league in tackles inside 50. Combined with a relatively high press, teams can get trapped in the Cats forward half.\n\nAs a consequence of this high defending method, they can be a little vulnerable to opposition transition getting through them.\n\nGeelong sits slightly below league average for conceding turnover scores from the defensive half. But given their high scoring this year — and their place in the grand final, that's a fair trade off.\n\nThe Cats don't have just one star defender to anchor around.\n\nInstead it's a team effort based on a common understanding of their principles and where they need to be.\n\nThe connectedness might help them overcome the loss of Tom Stewart for the Grand Final.\n\nSimply unpredictable\n\nFootball teams spend countless hours not only preparing themselves for a week's match, but also how the other team will play.\n\nWhile most will preach about playing their own game, there's always an eye towards working out what the other team will do.\n\nIt is in this aspect that Geelong really excels. Geelong confuses and confounds most opposition sides before, during and after games.\n\n\"If your strategy is 'hey, we want to be really flexible and move our team around' but you're moving good players away from their best position that's generally a bad idea,\" Scott mused after their preliminary final win.\n\n\"We just think when we move our players they're going from a good spot to another good spot.\"\n\nThis flexibility is key to a lot of what makes Geelong tick.\n\nA good example is how they use rucks. The Cats have utilised a three ruck set up in each game this year, with different players running through the roles. This is a unique arrangement in the AFL in 2025, with single primary rucks strongly predominant and no other side putting significant minutes into a third ruck.\n\nGeelong will spread the ruck load across different parts of the ground, with each ruck playing other roles.\n\nWhen Rhys Stanley, Mark Blicavs and Shannon Neale have played together it's Stanley that takes almost all centre bounces, with Blicavs filling a role more around the ground and Neale chopping out inside 50 and occasionally further up.\n\nScott has usually been hesitant to discuss his tactics with outsiders. When asked earlier this year about some of his strategic decisions the premiership coach was coy.\n\n\"In terms of the way we try to play … I don't talk about our tactics that much or the way we play,\" he said.\n\n\"Other coaches do, but I prefer to keep those things a little bit more to myself.\"\n\nNone of the Cats rucks chase the ground ball at ruck contests, instead looking to play a defensive role and spreading to provide extra options. Geelong's rucks will aggressively move themselves across the ground, particularly in the handover between the duties.\n\nThe solid performance in other roles of Blicavs and Neale means that the Cats don't lose anything by attacking the ruck in this way.\n\nIt's not only the ruck situation that sees Geelong perform switches.\n\nGeelong's key forwards will often work very high up the ground before doubling back, with hard running wings like Oliver Dempsey filling the space left behind.\n\nJeremy Cameron, Neale and Ollie Henry — who is named as an emergency — are all mobile and good ball users, allowing them to act as upfield targets and distributors targeting mismatches deeper up the ground.\n\nCameron works higher than any other major key position forward — something he's been able to balance alongside winning the Coleman Medal.\n\nIn the middle there are also shifts that throw opposition sides off kilter.\n\nPlayers who start outside the centre bounce group — like Shaun Mannagh — will often come inside for around the ground stoppages as ball winners.\n\nAlongside stronger bodies like Tom Atkins, this allows hard runners like Bailey Smith and Max Holmes to play their more natural roles slightly more outside, and enables them to get to post clearance contests a little easier.\n\nSometimes this hurts them in winning raw numbers of clearances, which has had them in trouble against Brisbane before this year.\n\nThe composition of this group can allow the Cats to play fast or slow, directly towards goal or with width. Geelong changes up their ball movement style as much as any team on a week to week basis — aside from their persistent preference to kick rather than handball.\n\nThe Cats have multiple players who can swing between roles and assignments to not only fill gaps, but cause problems for opposition sides.\n\nThat makes covering for the loss of a player like Tom Stewart marginally easier to bear.\n\n\"There's a little bit of a nod to our list management team who have done a terrific job,\" Scott said about the side's flexibility\n\nThis overall malleability — and depth — allows another wrinkle in the Cats' consistency arsenal.\n\nLate game heroics\n\nBeing a good football team means not just playing well in bursts, but across all four quarters. You'll often hear coaches congratulating their teams for playing out the game, or lamenting a lapse that cost them the game.\n\nCompeting across every minute is critical in a league as tight as the modern AFL.\n\n\"If you think that just (because you're) such a good team that you have it your way the whole game you're being really naive,\" Scott said last week.\n\nAcross the course of the year the ability to compete late in quarters and halves has shone through for Geelong, scoring heavily as quarters and halves run deep.\n\nTheir ability to switch personnel into different roles across the course of a game can deliver fresher legs where they are needed to gain an edge.\n\nNo side has been better in time-on this year, with the Cats playing right until the whistle.\n\nThis isn't just the case of fourth quarter blowouts either. If sides can't build up early leads Geelong has a tendency to blow teams out of the water.\n\nThis could be dangerous for Brisbane this week.\n\nCertain Cats players have a greater impact as the quarters wear on.\n\nPatrick Dangerfield can have explosive impact late with his powerful running away from contests.\n\nThe underrated Atkins gets even more involved than usual, and dangerous ball users Holmes and Tyson Stengle tend to get their hands on more footy around the ball as those around them tire.\n\nCameron also thrives late in quarters, with 37 of his 88 goals coming late in the term. His elite running ability for a tall forward pays dividends when opposition defenders are just waiting for the siren.\n\nPlaying to win again\n\nBeing consistently good is … well, good, but sometimes a little bit extra is required.\n\nIn this era of footy, making that extra step above the pack is harder than ever.\n\n\"If you sort of think about the way footy was years ago, the good teams — they'd have to have a bad season not to be in the top four,\" Scott said last week.\n\n\"Now you can have a really good season and miss the finals. So we've never been more respectful of the competition.\"\n\nBoth the Cats and Lions are vying for the right to become the first side this decade with two flags. The margins between the ultimate success and falling just short are very narrow — something both sides know intimately.\n\nIf the Cats can control the flow of the game and play right through all four quarters, they should be well on their way to winning their elusive third premiership of the Scott era.\n\nIf the consistency can hold one more week, then the Surf Coast should be happy all summer.\n\nABC Sport will be live blogging and calling all the action from the 2025 AFL grand final. Follow along at abc.net.au/sport.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/meet-me-at-the-baths-ang-collins-newcastle-new-annual-festival/105809954",
        "title": "'Like a magic pair of goggles': Theatre show set at 100-year-old ocean baths",
        "publish_date": "Fri, 26 Sep 2025 01:00:12 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "In 2023, the 100-year-old Newcastle Ocean Baths got a long-overdue glow-up.\n\nThe refreshed Art Deco facade and a brand-new promenade replaced the peeling paint and cracked concrete, and visitor numbers swelled when the historic ocean pool in the city's East End was reopened to the public.\n\nThe refurbished baths, long a favourite haunt of Novocastrians, captured the imagination of Tory Loudon, who left the Sydney Theatre Company to lead Newcastle's arts festival, New Annual, in early 2025.\n\n\"I wanted to go back to making work that's really grounded in place,\" she tells ABC Arts.\n\n\"I've always loved Newcastle's natural beauty, but I also felt the creative energy here has been building over the last 10 years.\"\n\nAs the incoming festival director, Loudon envisioned the baths as a festival hub, doubling as a live music venue and a theatre stage.\n\nShe saw that the saltwater pools overlooking the Pacific Ocean were a place people were naturally drawn to.\n\n\"What I love about the baths is that … it's a place where you can meet all different people of all different ages from all walks of life,\" she says.\n\nThe Newcastle Ocean Baths first opened to the public in 1922. (Supplied: New Annual/Lee Illfield)\n\nLoudon commissioned two Newcastle theatre makers, playwright Ang Collins and director Janie Gibson of Whale Chorus theatre company, to create a site-specific work for her inaugural program.\n\n\"Tory wanted to pay homage to [what is] such an important place for so many Novocastrians,\" Collins says.\n\nCollins — whose play Spewy premiered at New Annual in 2023 — looked to past productions, like Small Metal Objects by Back to Back theatre company and Griffin Theatre's Green Park, that placed theatre in public settings.\n\nThe result was Meet Me at the Baths, a \"collection of dramatic vignettes\" based on stories Collins and Gibson collected from the community.\n\nCollins hopes the show inspires the audience to think about their own connection with the city.\n\nShe also invites viewers to pack their bathers.\n\n\" I hope they bring their togs and come and have a swim after — how many theatre shows can you see and then jump in the water? \"\n\n'Theatre makers collecting stories'\n\nWhen it came to persuading the locals to share their stories, Collins and Gibson took their cue from another crowdsourced work: Trent Dalton's 2021 book Love Stories, based on conversations with strangers (and recently adapted for the stage).\n\nIn his pursuit of romantic tales, Dalton famously set up a table on a Brisbane street corner with an Olivetti typewriter and a sign reading: \"Sentimental writer collecting love stories.\"\n\nCollins and Gibson \"pilfered\" Dalton's idea and, a few times a week over two months, they set up their own table at the Newcastle baths with a similar sign that read: '\"Theatre-makers collecting Baths stories, come have a chat.\"\n\nAs they observed the waves of people coming and going from the baths, they came to recognise the many regulars who visited every day.\n\nCollins also put a call out on a local Facebook group dedicated to the baths with more than 27,000 members.\n\nThe response from the community was enthusiastic.\n\n\"Between them, we had so many stories — we could create five plays, not just one out of the stories we collected,\" Collins says.\n\n\"The Newcastle theatre scene is small but mighty,\" Collins says. (Supplied: New Annual/Lee Illfield)\n\nAs they listened to the multitude of stories, some common themes appeared.\n\nMany touched on the big milestones of life: birth, death and marriage.\n\n\"People get their ashes scattered at the baths,\" Collins says.\n\n\"We [heard another story about] a wedding ring that slipped off the groom's finger on the wedding day … and dropped into the baths.\"\n\nSearchers wearing snorkels spent hours scouring the bottom of the pool until a group of teenage boys finally found the ring.\n\nMany of the stories also touch on what Collins describes as \"the magic of everyday life\".\n\n\"There were stories of rainbows at night, phosphorescence, first kisses —those little moments that are blips that emerge out of your everyday routine,\" she says.\n\nA tapestry of everyday life\n\nCollins and Gibson whittled down the many stories they heard to a handful — a difficult task in itself — which they then fictionalised for the play.\n\nThe lost wedding ring makes an appearance, as do characters inspired by familiar faces at the baths who locals might recognise.\n\nThe family of a man, a longtime regular who recently died, gave the theatre makers their blessing to use his story in the production.\n\nCollins describes the show as a \"tapestry reflecting everyday life … at the Newcastle baths. It's like a short story collection that uses the real-life ocean baths as a stage\".\n\nThe show performed in hospital Photo shows Dad of patient looks through an octogon shape beaming at the camera A South Australian theatre group has come up with an innovative way to change the environment for hospital patients: stage a performance at the end of their bed.\n\nThe audience will hear the dialogue and the accompanying soundscape, designed by Liesl Pieterse (The Newsreader), through headphones.\n\nThe effect is like \"eavesdropping into these people's lives\", Collins says.\n\nAlso adding to the atmosphere is the general public, who will be able to use the facility as usual during the show's run.\n\nClosing such an important community space was never an option, Collins says.\n\n\"While the show is going on, people will be able to swim and tan and do all the things that they normally do — it's just that if you buy a ticket, that gets you a set of headphones which will be like a magic pair of goggles that you'll slip on to get this other deeper side of the story.\"\n\nThe unusual setting has required adjustments from the cast of four: Barney Donaghy, Jim Lawson, Katia Molino and Stephanie Rochet.\n\nThree days at Australia's oldest arts festival Photo shows On stage, Meher Pavri in a sun headdress sings. Neil D'Souza and Anaka Maharaj-Sandhu stand behind her. Over a weekend at Perth Festival, we're given a glimpse behind the scenes, inspiring empathy and defiant hope.\n\n\"The actors have found that if you act like you act in a theatre, which is to project [your voice] all the way to the back of the theatre, you look like a bit of a goose,\" Collins says.\n\n\"They say it's much more comparable to screen acting, where every little, tiny movement matters.\n\n\"They'll be mic'd up and you'll be able to hear every word they say quite intimately through the headphones, [but] they don't have to ham it up as much.\n\n\"In fact, if they do that, which is something we found in creative development, some people are like, 'What are you doing?' or 'Are you OK?' And then they have to say, 'Oh, no, I'm an actor in the show'.\"\n\nA public space for all\n\nHailing from a \"multi-generational Novocastrian family\", Collins has visited Newcastle's ocean baths all her life.\n\nHer parents would take her and her sister to the baths and the adjacent Map of the World pool when they were small.\n\n\"Saltwater is our family's norm,\" she says.\n\nABC Radio National's Top 100 Books of the 21st Century Top 100 Books is Radio National's new annual countdown where we hand over the reins to you to vote for your favourite books, and then we celebrate the Top 100 in a big weekend broadcast!\n\nWith urban areas increasingly dedicated to consumerism, public spaces like the baths are becoming increasingly rare and all the more valuable.\n\n\"Everyone is allowed in; it's free. People from all walks of life are there,\" Collins says.\n\n\"I've always felt like I belonged at the baths.\"\n\nThis year, the baths are also the venue for SOAK: Live at the Baths, five nights of free live music performances curated by musician and producer Tim Levinson.\n\nCollins says the New Annual festival, now in its fifth year, presents an invaluable opportunity for local creatives, many of whom relocate to Sydney and beyond to pursue careers in the arts, to perform at home.\n\n\"I don't think I can overstate the importance of New Annual,\" Collins says.\n\n\" Having an industry-standard major festival headline commission as an independent playwright — that is something I would never have thought possible in Newcastle. \"\n\nShe also applauds Loudon's artistic vision.\n\n\"In Australia, new writing isn't as valued as it could and should be, so to have Tory back it and take risks and celebrate experimentation and local stories — I think that's of national importance.\"\n\nMeet Me at the Baths is at Newcastle Ocean Baths, as part of New Annual festival, from September 27 to October 4.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/tony-rinaudo-wins-luxembourg-peace-prize-regenerative-farming/105666674",
        "title": "Australian wins peace prize for farming idea feeding millions in Africa",
        "publish_date": "Fri, 26 Sep 2025 00:48:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "To the untrained eye, the landlocked country of Niger may seem a denuded place: a landscape where soil can be so infertile it is like trying to farm in crushed glass.\n\nBut Gippsland man Tony Rinaudo looked at things differently.\n\nHe got down on the ground and where others saw barren soil, he saw potential.\n\nMr Rinaudo's work as an agronomist — a soil and plant scientist — in the West African nation during the 1980s resulted in the development of farmer-managed natural regeneration (FMNR), a technique that resulted in trees springing up from lifeless soil.\n\nIt is a technique that has earned Mr Rinaudo, who is World Vision's principal climate advisor, the 2025 Luxembourg Peace Prize for Outstanding Environmental Peace.\n\nHis work has given the tool of knowledge to others around him, while feeding millions of people in the process.\n\nTony Rinaudo was inspired by a dead tree stump. (ABC Gippsland: Madeleine Stuchbery)\n\nWhat is regenerative agriculture?\n\nAn upbringing in rural Myrtleford, in Victoria's north-east, informed Mr Rinaudo's choice to study agronomy after school, and his egalitarian approach to agriculture.\n\nAlong with his wife, he moved to Niger in the 1980s.\n\nRegenerative farming key to food security Photo shows A landscape of green grass with chickens roaming free and gumtrees in the background. A farmer walks among the chickens When Blythe Calnan and her partner bought their WA farm, they had a clear picture of how they wanted to manage it — by working with the environment to help protect it from future extreme weather events.\n\nThe landscape that greeted him was dire.\n\nGenerations of land clearing had left the soil barren and lifeless, and many farmers struggled to raise a crop.\n\nBut Mr Rinaudo saw an opportunity to help restore and manage the degraded landscape using trees.\n\nTrees improve soil health and provide cover for crops from winds during germination, while providing fodder and shelter for livestock.\n\n\"I figured, if deforestation was one of the major root causes of all these problems, then surely replanting the trees would go a long way towards solving those problems,\" Mr Rinaudo said.\n\nLoading...\n\nThe stump that changed everything\n\nThe solution for the degradation came, as Mr Rinaudo described it, as an answer to prayer.\n\nDuring the delivery of a ute-load of seedlings to a village, he stopped to reduce the air pressure in his vehicle's tyres to drive through the soft sand.\n\nWhat appeared to be a \"useless bush\" caught his attention, and he saw it was not a weed but a tree, sprouting from the concealed stump of a felled tree.\n\n\"That changed everything,\" he said.\n\nMr Rinaudo turned his attention to finding the stumps of trees that had been cut down and regenerating their growth, remedying all the issues of degradation caused by their erasure from the landscape.\n\nHe said using trees, producers could naturally restore biodiversity that had been stripped of weather protection, soil nutrients, or any life at all.\n\nTony Rinaudo shows farmers how to prune suckers to encourage new growth. (Supplied)\n\nRegenerative agriculture is a farming practice where one farms with natural systems and the environment, such as increasing natural biodiversity, rotating stock through paddocks, and improving soil function.\n\nThe movement has been gaining momentum in Australia in recent years, with changing climatic conditions creating dynamic circumstances for many farmers across the nation.\n\nGlobal soil degradation a major threat Photo shows Two men stand on the edge of a huge erosion site in Africa. Scientists warn 90 per cent of the planet's soil could be degraded by 2050 unless urgent action is taken.\n\n\"I'm not saying overrun your farm with trees,\" he said.\n\n\"In [the Australian] context, we have heavy machinery, we have high labour costs, but there are ways of integrating this with conventional farming in Australia.\"\n\nOver the span of 20 years in Niger, the area of land using Mr Rinaudo's technique has grown by 250,000 hectares a year and now covers 5 million hectares, with 200 million trees regenerated.\n\nIt has added $US900 million every year to Niger's agricultural output.\n\n\"It's one of the poorest countries in the world, in an extremely harsh environment on the edge of the Sahara Desert, and at the time, there was no significant government or even non-government support for this work,\" he said.\n\n\"Farmers in Niger are growing an additional 500,000 tonnes of grain each year, enough to feed two-and-a-half million people, because their crop yields have increased.\"\n\nPeace from the ground up\n\nWorld Vision Australia interim chief executive Grant Bayldon said Mr Rinaudo's technique was groundbreaking, and had restored millions of hectares of degraded land while empowering families and communities \"to build resilience, dignity and peace from the ground up\".\n\n\"Tony's work brings hope and empowers communities through practical and sustainable change,\" Mr Bayldon said.\n\nTony Rinaudo with the 2025 Luxembourg Peace Prize for Outstanding Environmental Peace. (ABC Gippsland: Madeleine Stuchbery)\n\nFor Mr Rinaudo, creating a stable source of food provides stability throughout the community, and with that comes peace.\n\nWatch the new season of The Assembly on ABC iview Photo shows A young person holding a microphone standing amongst audience. Leigh Sales returns to mentor a new cohort of autistic journalism students from across the country as they interview some of Australia's favourite celebrities.\n\n\"When you degrade landscapes and there's a shortage of food, fuel, fodder and water, there's more competition for those scarce resources, and more likelihood that conflict will arise as you restore the environment,\" he said.\n\nHe said when resources were abundant, there were fewer reasons for people to fight.\n\nMr Rinaudo said he was honoured to receive the prize.\n\n\"It highlights the incredible work of millions of smallholder farmers, who took this risk with this crazy white guy, and restored their land,\" he said.\n\n\"It's a tribute to them.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/trump-100pc-tariff-on-drugs-us-politics-/105820198",
        "title": "Donald Trump imposes 100 per cent tariff on pharmaceuticals from October 1",
        "publish_date": "Fri, 26 Sep 2025 00:09:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "The United States will impose a 100 per cent tariff on imports of branded or patented pharmaceutical products from October 1, unless a pharmaceutical company is building a manufacturing plant in the US, President Donald Trump said on Thursday.\n\n\"There will, therefore, be no Tariff on these pharmaceutical products if construction has started,\" Trump said on Truth Social.\n\nPharmaceutical drugs imported to the US were already slapped with a 25 per cent tariff in May.\n\nThe US president said the new tariff on any branded or patented pharmaceutical product would apply to all imports unless the company had already broken ground on a manufacturing plant in the United States.\n\nIn July, Mr Trump threatened to hit drug manufacturers with a tariff as high as 200 per cent if they did not move manufacturing to the US.\n\nPharmaceutical products are one of the top export markets for Australia to the US, worth around $1.6 billion in 2023-24.\n\nHowever, much of those exports relate to one Australian company, CSL, which sends vast quantities of plasma and other blood products to the United States.\n\nIn a statement, CSL told ABC News it was aware of the tariffs and was actively monitoring further announcements.\n\n\"In addition to CSL's Australian facilities, we have a very significant United States manufacturing footprint,\" it said.\n\n\"We are already expanding our US capabilities to meet the growing demand for our therapies and we have announced further expansion of significant, new capital investments during the next five years.\"\n\n\"As per previous market guidance, we do not expect any material impact from these tariffs.\"\n\nThe company, which also makes vaccines, already has production capacity in the US, with about 19,000 people employed there.\n\nThis includes hundreds of blood collection centres, a plasma processing facility in Illinois, and a vaccines plant in North Carolina.\n\nSeveral major pharma companies based here have previously told ABC News that they will not be affected as they do not export to the US.\n\nPharmaceutical companies Clarity, Neuren and Telix have also been contacted for comment.\n\nIn 2024, the US imported nearly $US233 billion ($357 billion) in pharmaceutical products, according to its Census Bureau.\n\nThe prospect of prices doubling could potentially increase costs of Medicare and Medicaid in the US.\n\nOpposition Leader Sussan Ley said the Coalition strongly opposed the imposition of tariffs.\n\n\"It is deeply concerning that Australian pharmaceutical exporters will be subject to harmful tariff arrangements from 1 October,\" she wrote in a statement.\n\n\"The 100 per cent tariff announced today puts this critical trade at risk, as well as the jobs thousands of people it employs and the savings Australians have invested in this sector.\"\n\nBut Dr Felicity Deane, an expert in trade law at the University of Queensland, said the details of the tariffs should not affect access to medicines here.\n\n\"In terms of access to medicines in Australia, this is not going to affect us whatsoever,\" she said.\n\n\"The president cannot impose a tariff and expect any changes to come into place in Australia. It won't affect our PBS.\n\n\"There's some suggestions that PBS could use some efficiency gains, but this is not going to bring them out. That's going to come about from our own processes.\"\n\nShe said the details were \"still hazy\".\n\n\"I think an announcement on Truth Social really doesn't give us all of the details that we potentially need,\" she told ABC News Channel.\n\n\"Certainly not the details we need to make some big financial decisions.\"\n\nTariffs imposed on heavy vehicles, kitchen cabinetry\n\nMr Trump said the US would also impose 25 per cent tariffs on heavy-duty trucks and 50 per cent tariffs on kitchen cabinets.\n\nHe said the new heavy-duty truck tariffs were to protect manufacturers from \"unfair outside competition\" and support locally manufactured vehicles.\n\n\"Large Truck Company Manufacturers, such as Peterbilt, Kenworth, Freightliner, Mack Trucks, and others, will be protected from the onslaught of outside interruptions,\" Trump posted.\n\nMr Trump also said he would start charging a 50 per cent tariff on bathroom vanities and a 30 per cent tariff on upholstered furniture next week.\n\nThe new tariffs on kitchen, bathroom and some furniture were because of huge levels of imports that were hurting local manufacturers, Trump said.\n\n\"The reason for this is the large scale 'FLOODING' of these products into the United States by other outside Countries,\" he wrote on Truth Social.\n\nTrump has long said that tariffs are the key to forcing investment in domestic factories.\n\nBut experts warn tariffs will drive up inflation.\n\n\"We have begun to see goods prices showing through into higher inflation,\" Federal Reserve Chair Jerome Powell warned in a recent news conference.\n\nHe added that higher costs for goods accounted for \"most\" or potentially \"all\" of the increase in inflation levels this year.\n\nThe consumer price index has already risen to 2.9 per cent in the US in the past 12 months, up from an annual pace of 2.3 per cent in April when Trump first launched a set of import taxes.\n\nBut Mr Trump disagrees inflation has occurred.\n\n\"There's no inflation,\" he told reporters Thursday.\n\n\"We're having unbelievable success.\"\n\nABC/Wires",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/foster-carer-shortage-in-kimberley-forcing-kids-off-country/105815878",
        "title": "Kids forced off country in northern WA due to foster shortage",
        "publish_date": "Thu, 25 Sep 2025 23:50:54 +0000",
        "category": "finance",
        "authors": [],
        "text": "For a vulnerable child entering the foster care system, being removed from home is hard enough without the burden of being sent thousands of kilometres from everything they know.\n\nBut this is the sad reality for many foster children in Western Australia's far north, where remote and regional communities such as the Kimberley are facing a critical shortage of local carers.\n\nRaising 23 kids teaches rural mum the importance of asking for help Photo shows An older woman smiles at the camera wearing bright pink lipstick, a pearl necklace and a white fur coat. After raising many children on a farm 60 kilometres from the nearest major town, Tracey Angwin says being part of a community is essential for rural mums.\n\nIt is a nationwide trend where more children are entering the system while more carers are leaving, according to the Foster Care Association of WA.\n\nAnd this is particularly felt in First Nations communities where service providers say children are being taken away from country.\n\n'Love them like your own'\n\nFoster carer Rebecca* lives and works in Kununurra, more than 3,000 kilometres from Perth.\n\nShe started working as a foster carer for Lifestyle Solutions last year and said the job was both rewarding and heartbreaking.\n\n\"You love them like your own while they're in your home. You're signing up to get this little person safe while they need safety,\" Rebecca said.\n\nShe said support from the service provider was consistent but she lacked being able to communicate with other carers due to the remoteness.\n\nRebecca says the job is challenging but rewarding. (ABC News: Patrick Thomas)\n\n\"We get a lot of newsletters through the fostering department saying [there are] support groups, and they have family picnics, but it's all based in Perth,\" she said.\n\nRebecca said living in Kununurra meant the child in her care maintained regular contact with family.\n\n\"Family to our little one is very important and we are very culturally sensitive about what that means for our child in care and for their family to be present in their life,\" she said.\n\n\" It also can be heartbreaking … [but] is ultimately what we want as carers. We want them to be back with family and into their cultural societies. \"\n\n'Taken off country'\n\nLifestyle Solutions general manager for WA, Sarah Hamm, said \"a lot of kids had been taken off country\" and placed in care arrangements in Perth.\n\nSarah Hamm says they are urgently looking for more carers in the Kimberley. (Supplied)\n\n\"A really big push is to try and get as many kids as we can back on country, back up north,\" Ms Hamm said.\n\n\" And we're keen to support the department to get those kids back up to the Kimberley … to their family, to their connection. \"\n\nMs Hamm said First Nations foster carers were \"incredible assets\" when it came to keeping a young person connected to their culture.\n\nShe said Lifestyle Solutions needed to see an uptick of \"at least another 20 to 30 foster carers\" locally within the next 12 months to meet demand.\n\n\"It's a crisis not having enough foster carers, and globally it's a big problem too,\" she said.\n\nCost of living\n\nFoster Care Association director Faye Alford said more subsidies were needed to attract and retain foster carers in remote communities.\n\nFay Alford says cost-of-living pressures for newly-extended families make the service challenging. (Supplied)\n\n\"Electricity is terribly high, the cost of food, having to travel to metro areas to get medical assistance — that's always pretty difficult for carers up there,\" Ms Alford said.\n\n\" It's a sign of the times where families are struggling financially, so to add an extra child or two or three to your family is very costly. \"\n\nBut Ms Alford said it was all worth it seeing joy spread across a child's face, despite the abuse or neglect they had endured.\n\nRecord investment in family support services\n\nA report by the WA commissioner for children and young people showed the number of children in out-of-home care had increased by 1,089 over 10 years.\n\nThe report said there were 5,326 children in out-of-home care in 2024.\n\nHowever, a Department of Communities statement said there had been a decrease over the past year, with statistics showing a drop from 5,326 to 5,276.\n\nThe Department of Communities says it has delivered record investment in early intervention and support services. (ABC Kimberley: Rosanne Maloney)\n\n\"[The department] prioritises placements in keeping with the Aboriginal and Torres Strait Island Child Placement Principles … to ensure the highest possible level of connection to family, community, culture and country is maintained,\" the statement said.\n\nThe spokesperson said there had been \"record investments in early intervention and family support services\".\n\n* The ABC is not using the foster carer's real name to protect the identity of the child in her care.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/donald-trump-signs-tiktok-executive-order-what-does-that-mean/105819550",
        "title": "Trump signs TikTok executive order but who's in charge of the platform now?",
        "publish_date": "Thu, 25 Sep 2025 23:44:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "US President Donald Trump has signed an executive order that he says will allow TikTok to continue operating in the country in a way that meets national security concerns laid out by the law.\n\nMuch is still unknown about the actual deal in the works, but Mr Trump said Chinese leader Xi Jinping had approved it.\n\nAny major change to the popular video platform could have a huge impact on how Americans — particularly young adults and teenagers — consume information online.\n\nMr Trump has frequently referenced TikTok's role in helping him reach voters during his 2024 presidential campaign.\n\nFormer President Joe Biden signed legislation last year calling for China's ByteDance to sell TikTok's assets to an American company by early this year or face a nationwide ban, but Mr Trump repeatedly signed orders that allowed TikTok to keep operating in the US as his administration tried to reach an agreement for the sale of the social media company.\n\nTrump says China's Xi approved TikTok deal Photo shows A man with blonde hair in a suit shakes hand with a man with black hair in a suit The deal would transfer TikTok's US assets to US owners from ByteDance, according to sources familiar with the negotiations.\n\nThe Chinese embassy in Washington has not yet provided confirmation that China has signed off on the proposed framework deal.\n\nAbout 43 per cent of US adults under the age of 30 say they regularly get news from TikTok, higher than any other social media app including YouTube, Facebook and Instagram, according to a Pew Research Centre report published on Thursday.\n\nWho will control the new TikTok venture?\n\nUnder the terms of the deal that have so far been revealed by the White House, the app will be spun off into a new US joint venture owned by a consortium of American investors — including Oracle, a software company, and investment firm Silver Lake Partners.\n\nAlthough the details have yet to be finalised, the investment group's total stake in the new venture is expected to be around 80 per cent, while ByteDance is expected to have a 20 per cent or smaller share.\n\nThe board running the new platform would be controlled by US investors, with one representative from ByteDance, but that individual would be excluded from any security matters or related committees.\n\nTikTok's new owners include many whose business or political interests are tied to Mr Trump, including Oracle co-founder Larry Ellison and Rupert Murdoch, raising questions about whether political influence will be exerted on the platform.\n\nLachlan Murdoch involved in possible TikTok deal, Trump says Photo shows A young man and an older man sit together in sporting stands The deal would see TikTok's American assets transferred from China's ByteDance to American owners.\n\nAlthough he stepped down as Oracle's chief executive more than a decade ago, Mr Ellison remains heavily involved in its operations, as chairman and chief technology officer.\n\nNow 81, he could be in line to become a behind-the-scenes media power player, having already helped finance Skydance's recently completed $8 billion merger with Paramount, a deal engineered by his son, David.\n\nMr Trump also mentioned tech giant Dell founder Michael Dell will be an investor in the new venture.\n\nWhat about the algorithm?\n\nThe recommendation algorithm that has steered millions of users into an endless stream of video shorts has been central in the security debate over TikTok.\n\nChina previously maintained the algorithm must remain under Chinese control by law.\n\nBut a US regulation that Congress passed with bipartisan support said any divestment of TikTok must mean the platform cuts ties with ByteDance.\n\nAmerican officials previously warned that the algorithm — which is a complex system of rules and calculations that platforms use to deliver content to your feed — is vulnerable to manipulation by Chinese authorities, who can use it to shape messaging on the platform in a way that's difficult to detect, but no evidence has ever been presented by US officials showing that China has attempted to do so.\n\nDuring his first term, Mr Trump signed an executive order attempting to ban the app if it didn't split off its US business, warning at the time that TikTok's \"data collection threatens to allow the Chinese Communist Party access to Americans' personal and proprietary information\".\n\nAlmost half (43 per cent) of US adults under 30 say they use TikTok as a source of news. (ABC News: Phoebe Pin)\n\nMr Trump has since changed his approach to TikTok, often citing its role in helping him reach young voters in the 2024 presidential election.\n\nAlthough the details remain unclear, a Trump administration official said that a licensed copy of the ByteDance-created algorithm — retrained solely with US data — will power the new US version of the app, which they say will nullify any risk of Chinese interference and influence.\n\nYoung people especially \"really wanted this to happen\", Mr Trump said during the signing ceremony.\n\nThat makes it unclear if the US version of TikTok will be a different experience than what users in the rest of the world are used to.\n\nJasmine Enberg, an analyst for the research firm eMarketer, said that making noticeable changes to a social media platform's service risked alienating its audience.\n\nIn a prime example of how a change of control can reshape a once-popular social media platform, billionaire Elon Musk triggered an almost immediate backlash after he completed his takeover of Twitter nearly three years ago.\n\nMr Musk made extremely visible changes to the platform, including changing its name to X, pulling back on its content moderation and adding exclusive features for paid subscribers.\n\nThe changes that gradually occur while different data is fed into the US copy of TikTok's algorithm could be subtle and unnoticeable to most of its audience.\n\n\"Social media is just as much about the culture as it is the technology, and how users will take to new ownership and potentially a new version of the app is still an open question,\" Ms Enberg said.\n\nWhat motivated China to make this deal?\n\nBeijing once called the demand that TikTok be spun off from its Chinese parent company an act of \"robbery\", but Chinese officials changed their tune as the trade war with the US progressed.\n\nFollowing the announcement of a possible TikTok framework deal after US–China trade talks in Spain, some observers believed that China was able to extract concessions from the US on loosening trade restrictions in exchange for the TikTok deal.\n\nOthers believe China was willing to do so to pave the way for a meeting between Mr Xi and Mr Trump.\n\nA TikTok deal would allow China to keep the ball rolling on trade negotiations, said Sun Yun, director of the China program at the Washington-based think tank Stimson Center.\n\n\"TikTok alone does not compare with the importance of amicable US–China relations and the positive momentum that prevents many negative developments from happening.\"\n\nWhat we know about how the under-16s social media ban will work Photo shows A graphic showing a hand holding a phone. It is superimposed on a drawing of Australia and surrounded by social media apps Australia is months away from implementing its world-first social media ban for teens. But questions still remain around how the restrictions will work.\n\nDimitar Gueorguiev, associate professor of political science at Syracuse University, said TikTok had become an \"expendable concession\" to Beijing because it was no longer a disruptive newcomer as it was five years ago.\n\nTikTok's highly personalised \"For You\" video feed was seen as its secret sauce five years ago, when Mr Trump first threatened to ban the app, but Instagram and other rivals now work similarly.\n\nDr Gueorguiev argued that Beijing was more interested in retaining access to US technology and services, at least in the short term, so it could build up self-sufficiency in semiconductor, artificial intelligence and advanced manufacturing.\n\n\"That is the front line of technological competition,\" he said.\n\n\"TikTok, by contrast, is a maturing consumer app with diminishing strategic weight.\"\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/mullumbimby-motor-neurone-disease-hiker-walks-bibbulmun-track-wa/105810642",
        "title": "Hiker with MND savours the 'stillness' one of Australia's most arduous treks",
        "publish_date": "Thu, 25 Sep 2025 23:26:46 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Walking 1,000 kilometres with an 18-kilogram backpack is an ask for many, but add motor neurone disease and you have a challenge most would not attempt.\n\nMullumbimby woman Catherine Perversi has many reasons for taking on the Bibbulmun Track in Western Australia.\n\n\"I firmly believe long-term hiking imparts knowledge when you listen well and allow your ears and eyes to stay open to its [nature's] sounds and beauty,\" she said.\n\nThree years ago, Ms Perversi began to experience difficulties with her speech, as words became hard to articulate.\n\nShe was diagnosed with MND in November last year.\n\nIt is a terminal, degenerative neurological disease that attacks and destroys the motor neurons responsible for voluntary muscle control, leading to progressive muscle weakness and eventual paralysis.\n\nThere is no known cure, although treatments can help manage symptoms.\n\nWriting on her blog, Ms Perversi said the illness had made her world smaller.\n\nHiking with motor neurone disease means every step must be carefully planned. (Supplied: Pia Perversi-Burchall)\n\n\"I ache for more space — space that allows distance from the crowd of my repetitive thoughts,\" she said.\n\n\"My life has revolved around appointments with medical specialists, submitting my body to medical tests.\n\n\"I've become a science experiment.\n\n\"I'm preoccupied with clinical trials that aim to find a cure for MND, assistive devices for things like foot drop/drag, and manage symptoms such as excess mucous.\"\n\nRaising awareness of MND is another reason for Ms Perversi to challenge herself, and she is also using the hike to raise funds for the MND and Me Foundation.\n\nThe charity cares for people living with MND and supports research into MND, and Ms Perversi hopes to raise $10,000 via GoFundMe.\n\nEveryday challenges\n\nEvery step Ms Perversi takes carries risk, and even eating food is a risky task when you have MND.\n\n\"I try to be cognisant of the dangers inherent in talking with my mouth full, choking,\" she said.\n\nDaughter Pia Perversi-Burchall said losing the capacity to communicate verbally had been a big hit for her mother.\n\nAustralia's first MND surveillance centre opens Photo shows A black and white photo of a woman and an older man wearing a hat and glasses. Researchers have established Australia's first motor neurone disease surveillance centre in a region where residents are three times more likely to contract the disease.\n\n\"Her voice has changed a lot — it is quite laboured and slurred,\" she said.\n\n\"Luckily, we can still have a conversation, but it is hard work for her.\"\n\nHowever, Ms Perversi is at no loss for words when sharing her thoughts and experiences in her blog.\n\n\"I am living with a terminal disease that currently has no cure and no effective treatment,\" she said in a recent post.\n\n\"My life expectancy could be five years, of which I've already lived three since the onset of symptoms.\n\n\" Death is certain, its time is not. \"\n\nCatherine Perversi and Pia Perversi-Burchall have recently completed the Sunshine Coast Great Walk. (Supplied: Pia Perversi-Burchall)\n\nMs Perversi and her daughter recently completed the 60km Sunshine Coast Great Walk as preparation for the Bibbulmun Track.\n\nBut it did not start well.\n\nWatch the new season of The Assembly on ABC iview Photo shows A young person holding a microphone standing amongst audience. Leigh Sales returns to mentor a new cohort of autistic journalism students from across the country as they interview some of Australia's favourite celebrities.\n\n\"[Mum] actually fell over three times in the first day and I thought, 'Oh my god, this is not going to happen,'\" Ms Perversi-Burchall said.\n\n\"But she found her feet and energy and was incredible.\n\n\"On the last day, there was a really long incline up a really steep cliff face and she took her time.\n\n\"She would probably cringe at these words, but she is an inspiring woman.\"\n\nCarrying 'the whole shebang'\n\nBefore her illness, Ms Perversi was a frequent hiker, completing the Camino de Santiago trail from southern France to Spain.\n\nBut she said the Bibbulmun Track — stretching from Kalamunda in the Perth Hills to Albany on the south coast — was no Camino.\n\n\"The 800km Camino is as challenging as any long hike — the difficult sections are real (and very eagerly forgotten) and most people are beset by injury and egg-sized blisters at some point,\" Ms Perversi said.\n\nCatherine Perversi and her friend Rebecca Ryall check a pack before the hike. (Supplied: Pia Perversi-Burchall)\n\n\"[However] everything on the Camino is on tap: warm beds, hot meals, fellow pilgrims to massage your shoulders, café con leche every few kilometres, and even a free wine fountain en route.\n\n\"The Bibbulmun Track, on the other hand, requires you to carry the whole shebang.\"\n\nTwo friends are walking the track for support and will meet up with Ms Perversi each night, and volunteer group Track Angels will drop food at regular intervals along the way.\n\nCatherine Perversi says she enjoys the \"silence\" of a long walk. (Supplied: Catherine Perversi)\n\nThe Bibbulmun has always been on Ms Perversi's to-do list, but her MND has made the trek feel more urgent.\n\n\"Given there's no way of knowing if I'll still have the use of my legs and arms in a year's time due to MND, there's no better time than now,\" she said.\n\nThe lure of nature also drives Ms Perversi forward.\n\n\"The track passes through a universally recognised biodiversity nerve centre, where 80 per cent of the plant species are found nowhere else on earth,\" she said.\n\n\" During September, October, it's wildflower season. \"\n\nThe wildflowers along the Bibbulmun Track are a constant source of delight for hikers. (Supplied: Catherine Perversi)\n\nThe first week of trekking has offered Ms Perversi hard times and pearls of joy.\n\n\"I'm finding my trail feet still, today I was tired and had a couple of slips, abrasions only,\" she said.\n\n\"I walked only 40 kilometres in four days, a paltry amount in comparison to most.\"\n\nBut the benefits of walking are evident.\n\n\"I'm happy, I wouldn't be anywhere else,\" Ms Perversi said.\n\n\"The stillness is sublime.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/international-week-of-deaf-people-celebrated-unique-deaf-spaces/105808090",
        "title": "This deaf woman was 12 before learning Auslan, now she's teaching others",
        "publish_date": "Thu, 25 Sep 2025 23:19:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Access to language is essential for the Deaf community, but it isn't always guaranteed — especially in isolated parts of Australia.\n\nNichole Davis spent the first decade of her life lip-reading because her family didn't know how to sign and was 12 years old when she finally met another deaf person.\n\nCommunicating through interpreter Bettina Girdler, Ms Davis said she \"was blown away\" the first time she saw someone using sign language.\n\nNichole Davis teaches Auslan in Darwin. (ABC News: Pete Garnish)\n\nNow, she works in Darwin for Deaf Connect — the nation's largest deaf, deafblind and hard of hearing service provider — where she has been teaching Auslan, the language of deaf Australians, for two years.\n\nThriving Deaf spaces\n\nEvents across Australia, including a social game of lawn bowls in Darwin, marked this year's International Week of Deaf People.\n\nThey were hosted in Deaf spaces where Auslan is the first language, everyone feels safe, and inclusion is paramount.\n\nThe NT celebration also coincided with International Day of Sign Languages, a fitting occasion as Auslan is strongly tied to identity in the Deaf community.\n\nSofie shared her story with the ABC through Deaf Connect interpreter Bettina Girdler. (ABC News: Pete Garnish)\n\nSofie Waldron, 13, has been using sign language since infancy and said events such as these promoted a sense of belonging.\n\n\"Auslan is my first language, it's natural for us to use it, and English is my second language,\" she said.\n\nWhile it can be nerve-wracking meeting new people, the teen said Deaf spaces make socialising feel more comfortable.\n\n\"I feel more calm and connected, just like I can engage more with people, sometimes it is difficult to understand people when they just speak English,\" she said.\n\nSofie is also part of her school's Deaf club, which offers space to relax and communicate with others in Auslan.\n\nShe said it was encouraging to see hearing students joining in and learning to sign.\n\nSofie Waldron lives with her hearing family, including her protective big brother, and is teaching her baby sister Auslan. (ABC News: Pete Garnish)\n\nUndeterred by the barriers of being the only deaf child in a hearing family, Sofie has been teaching her baby sister some sign language.\n\nThe teen would love to see more Auslan in schools, which she believes would led to less miscommunication and isolation.\n\nIt's a belief shared by Ms Davis, who described the ability to sign as a birth right.\n\nThe Auslan teacher wants all deaf babies to \"have access to their language from day dot, all throughout their life\".\n\nUnfortunately, that isn't always the case.\n\nThe social game of lawn bowls was one of 16 inclusive events hosted by Deaf Connect across the country this week. (ABC News: Pete Garnish)\n\nDespite Darwin being home to many deaf children, some of them struggle without classroom interpreters.\n\nMs Davis said insufficient funding for interpreters was \"a nationwide challenge\", but isolated regions were hit particularly hard.\n\nAccessibility has improved over time — the NT government announced in May it would commit $120,000 annually to help Deaf Connect continue providing interpreting services — but there's still a long way to go before achieving equality.\n\nLearning sign language\n\nMs Davis said some students were anxious when starting their sign language journey, but all were met with plenty of encouragement in a low-pressure environment.\n\n\"We love it when people start learning Auslan,\" Ms Davis said.\n\nThe classes were a lifeline for Divya Prasad when she moved to Darwin from the Middle East three years ago.\n\nThe mother-of-two lost her hearing as a toddler and, while her own family doesn't use sign language, the local Deaf community became like a second family.\n\nLoading...\n\nMs Prasad relied on lip-reading until learning Indian Sign Language at 17 years old, later picking up American Sign Language too.\n\nShe was happy to discover Deaf culture and Auslan after moving to Australia, which she said had strengthened her independence and sense of self.\n\nConnecting with Ms Davis and feeling supported by the Deaf community \"has been wonderful\", she told the ABC.\n\nNichole Davis applauding in Auslan by shaking her open palms in the air. (ABC News: Pete Garnish)\n\n\"I've realised that before my life here in Darwin there just wasn't awareness of Deaf community in my life, and now I feel like everything's improved,\" Ms Prasad said.\n\n\" We shouldn't be so isolated and face so many barriers, it would be great if we were all together as one community and able to communicate as equals. \"\n\nWhat is Deaf culture?\n\nDeaf Connect said Australia's Deaf culture had been shaped by the rich history, language, and diverse experiences — including a number of intersectional communities, as well as hearing families and allies.\n\nThe World Federation of the Deaf introduced an international Deaf flag in 2023, celebrating the variety of sign languages practised globally.\n\nThe international flag was unveiled in July 2023. (Supplied: X/World Federation of the Deaf)\n\nDeaf Connect said, even within Australia, unique Auslan dialects emerge.\n\nFor example the way some colours are signed differs between states, and Deaf First Nations communities have been using their own sign language dialects for centuries.\n\nSign names are another unique part of Deaf culture — akin to a special nickname, they're different for every individual and often tied to something personal.\n\nGregory Leeson lost his hearing later in life, picking up sign language from his wife Brenda who is also deaf.\n\nHis sign name is tied to the long beard he's known for.\n\nGreg Leeson demonstrating his unique sign name. (ABC News: Pete Garnish)\n\nDemonstrating his unique sign name, Mr Leeson's hand forms a symbol that resembles a 'G' in American Sign Language — linking to his birth name — then swoops down over his moustache.\n\nMs Davis encouraged the wider community to embrace Deaf culture with an open mind.\n\n\"Some people think 'Oh, deaf people can't do this or they can't do that',\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/joseph-uzumcu-adelaide-tailor-fined-smoking/105818722",
        "title": "Tailor fined for smoking outside Adelaide CBD business",
        "publish_date": "Thu, 25 Sep 2025 23:12:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "A well-known Adelaide tailor and clothing retailer has been fined for smoking outside his CBD business in contravention of council by-laws but has been spared convictions to allow him to travel overseas and \"keep abreast with fashion\" trends.\n\nJoseph Uzumcu, 66, who has traded from his Gawler Place shop for 38 years, appeared in the Adelaide Magistrates Court to be sentenced after pleading guilty to six counts of breaching an Adelaide City Council by-law that bans smoking in and around Rundle Mall.\n\nThe court heard one count related to a complaint from a member of the public who had seen Mr Uzumcu smoking in Gawler Place, while the other five counts were detected by CCTV or observations by council staff.\n\nDefence lawyer Jon Lister asked the court to spare Mr Uzumcu a conviction so he could continue to attend international fashion events, because a conviction may \"unduly prejudice\" the tailor's career.\n\nJoseph Uzumcu smoking outside his shop in Gawler Place. (Facebook)\n\nFears for fashion week dreams\n\n\"He, in the past, has travelled frequently to Europe, mostly to Italy, and to Japan for the purpose of keeping abreast with fashion developments at catwalks and fashion shows of that kind,\" Mr Lister said.\n\n\"It has been a long-term wish for him to attend the fashion week in New York and to attend a shoe fair in Los Angeles.\n\n\" He's concerned, your honour, that convictions for this matter may result in him being prohibited entry to the United States. \"\n\nMr Lister said while the application process did not currently preclude Mr Uzumcu from travelling to the United States, \"recent uncertainty about the manner in which executive decisions are made in the United States, under the Trump regime, has made him anxious that there may be a preclusion of him travelling if he's convicted of these offences\".\n\nHe told the court a fine would be an adequate punishment for the breaches and said Mr Uzumcu apologised to the court and the member of the public who made the complaint.\n\nJoseph Uzumcu spoke to the media outside court and said he would not advise younger generations to smoke. (ABC News: Jordanna Schriever)\n\n\"He's resolved, your Honour, to be very careful not to breach this by-law again, he'll be walking up to North Terrace for any cigarette smoking,\" Mr Lister said.\n\nA lawyer for the council told the court Mr Uzumcu ought to have known smoking was prohibited because he had been fined for five similar breaches in 2017.\n\n\"Given the defendant's antecedent history, he ought to have known that smoking in Gawler Place as he did was prohibited and his conduct, the subject of these counts, shows disregard for the law and he should be deterred from doing so in the future,\" the council's lawyer said.\n\nTailor spared conviction\n\nHe said the council sought convictions for each count.\n\nBut Magistrate Natalie Browne spared Mr Uzumcu any convictions, imposed a $600 fine and ordered he pay prosecution costs of $699.\n\nAt the conclusion of the hearing, Mr Uzumcu told the court he would seek medical advice to give up smoking.\n\nOutside court, he further explained that he had been smoking for more than 40 years and it was \"a very unconscious\" habit and it was \"very, very nice\" that he was not convicted.\n\n\"I run a very stressful business, I come out of the shop, I have a problem, I just light up a cigar,\" he said.\n\n\"I am guilty as charged … I should give up, absolutely. I would not advise any of the young generation to smoke because it is very difficult to give up.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/bondi-sculpture-by-the-sea-to-go-ahead-2025-due-to-lifeline/105819510",
        "title": "Sculpture by the Sea offered $200,000 lifeline after financial woes",
        "publish_date": "Thu, 25 Sep 2025 21:57:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sculpture by the Sea has been offered a $200,000 lifeline after organisers made an urgent plea for funding just weeks out from this year's event.\n\nThe annual exhibition, which is held on the Bondi to Tamarama cliff walk, was facing cancellation ahead of its October 17 start date after failing to secure federal government funding.\n\nFounder David Handley said the event relied on a combination of funding from the state government and Waverely Council, but had not received any federal money for the last two years, resulting in a $200,000 shortfall.\n\nAfter a public appeal for donations, organisers announced on Friday morning that it had acquired a major partnership with NRMA Insurance and the event will now go ahead as planned.\n\nMr Handley told ABC Radio Sydney the $200,000 would go towards paying this year's artists and safeguarding future operations.\n\n\"We're going to be able to take time to reflect on how we try to set up Sculpture from the Sea as a more sustainable operation with a future fund,\" he said.\n\nMembers of the public donated more than $125,000 within 30 hours of the appeal. (Supplied: Mitsuo Takeuchi)\n\nIn addition, the event also received more than $125,000 in public donations within the 30 hours of launching its appeal.\n\nMr Handley said the response had been \"extraordinary\".\n\n\"We went right down to the wire, that's why we had to do this desperate plea. We are not an organisation with cash reserves,\" he said.\n\nThe annual sculpture walk, which attracts around 450,000 visitors each year, typically costs around $3 million with installation alone coming to $800,000.\n\nFounder David Handley, artists Kasane Low and Niharika Hukku, and 2023 Sculpture by the Sea winner John Petrie. (ABC News: Pablo Vinales)\n\nArtists who exhibit at Sculpture by the Sea spend an average of $15,000 on each artwork, inclusive of materials, transportation and installation costs.\n\nMr Handley said artists are paid $3,000 and the remainder of the money goes towards holding the exhibition as a free-to-the public event.\n\n\"This year over $300,000 from our donors and sponsors is going directly into artists' pockets to help them with their costs,\" he said.\n\n\"We started this with volunteers working out of my lounge room with $100 in the bank.\"\n\nArtists who exhibit at Sculpture by the Sea spend an average of $15,000 on each artwork. (Supplied: Yoshiho Futo)\n\nOrganisers had criticised Creative Australia — the government's peak arts body — for the shortfall in funding.\n\nCreative Australia claimed the event had not submitted an application for funding, including from its recent arts project investments for organisations program.\n\n\"Funding does not automatically renew at the end of a funding cycle. To be considered for funding, organisations must apply for funding through an open and competitive process,\" a spokesperson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/cairns-child-safety-inquiry-foster-carers-strained/105816270",
        "title": "Former foster child tells inquiry he felt 'like cargo' in strained system",
        "publish_date": "Thu, 25 Sep 2025 21:56:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "It took Chance Kennedy 14 years to finally feel secure.\n\nHe first entered care as a toddler. He was in and out of foster and residential care.\n\nThere were spates of reunification with his mother, before her drug use forced him, as a child, to call Child Safety and ask to be taken back in.\n\nNow in his 20s, the quietly spoken Mr Kennedy this week told a room full of lawyers in Cairns about his time in care, as part of the regional hearings of the Child Safety Commission of Inquiry.\n\nIn his ambition to \"leave no stone unturned\", Commissioner Paul Anastassiou KC has heard from foster carers, kin carers and as child safety workers running residential homes.\n\nIn the third and final week of sittings in Cairns, Mr Kennedy explained how at the age of 10 he was put in 15 to 20 different placements in as many days.\n\n\"Especially when you're only at houses for one or two days, and then you're just moved around, you start to feel a bit like cargo,\" he said.\n\nHe said the lack of stability continued to impact him and his sense of self-worth.\n\n\"When you're at 20 different houses in as many days, you start to feel like, 'OK, well, nobody wants me', so then you just shut off emotionally, because there's no point getting attached,\" he said.\n\nFor several years, Mr Kennedy lived in a home that some of the commission lawyers referred to as a \"foster farm\".\n\nSharing a room with four to five other children, he said they were given different food to the parents and forced to work for one of the carer's lawn care businesses without pay.\n\nPaul Anastassiou KC sat for three weeks of hearings in Cairns. (AAP: Darren England)\n\n\"It was almost an expectation that you would help; otherwise, you know, you'd fear not getting fed,\" he said.\n\nHe said the father would drink while the children worked, and the adults would throw empty soft drink cans at them if they were annoyed.\n\n\"We were never treated as children … probably more of an annoyance,\" he said.\n\nAfter several more placements lasting from a few weeks to two years, at 14, Mr Kennedy said he finally landed a spot with a foster carer who gave him the stability and care he craved.\n\nIt was the one thing he urged the commission to prioritise.\n\n\"If possible, don't just keep moving us around,\" he said.\n\nMedical delays\n\nFoster carers and Child Safety officers have described a fraught and strained system, made up of a \"labyrinth\" of meetings and bureaucracy and vulnerable children losing at every turn.\n\nMultiple foster carers outlined the distress caused by lengthy delays in getting children access to medical care.\n\nManagers of multiple residential care homes in the Far North gave evidence during the inquiry. (ABC Far North: Holly Richardson)\n\nFoster carer Gayle McLaren told the inquiry she cared for a child who needed 14 fillings and five adult teeth removed.\n\nEach child is allocated $1,100 every two years for dental care, and that had already been spent on previous dental work.\n\nMs McLaren said Child Safety told her she had to take the child to a public dentist, which meant a four to six-month waiting list for treatment.\n\n\"This child is needing Panadol, ibuprofen most days and nights because she's in pain,\" she said.\n\nShe also described attempting to get specialised treatment for a child with scabies. Eventually, she paid for the dermatologist herself.\n\nA kinship carer, who could not be named for legal reasons, said he was still waiting, after more than 18 months, for a child in his care to see a paediatrician.\n\nHe said he would like to see children assessed as soon as possible when they entered the care system.\n\nAccess to timely medical care was an issue repeated by multiple foster and kin carers and former foster children. (ABC News: Curtis Rodda)\n\nAnglicare North Queensland chief executive Liz Colahan told the commission that in her years working for various organisations in Child Safety, the number of different agencies and people involved had ballooned.\n\nShe said this had inadvertently created more cracks for children to fall through.\n\nResidential care homes\n\nThe care children receive in residential care homes — where multiple children are housed in a building, with a team of staff rotating in — also came under scrutiny.\n\nRetired manager at Child Safety Innisfail Ralph Laksa said residential care should feel like a child's home but acknowledged many did not meet that standard.\n\nThe commission held hearings around Cairns and is expected to hold further sessions in regional Queensland. (ABC News: Brendan Mounter)\n\n\"I've seen residentials where they've taken the cupboard doors off the kitchen, they're replaced all the crockery with plastic plates, removed photos for them being thrown around,\" he said.\n\n\" They're just concrete besser block homes with no love, no care, no emotion in the home. \"\n\nThe Cairns hearings are expected to wrap up today with further hearings yet to be announced.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/billy-vigar-dies-at-21-after-head-injury-in-soccer-match/105819594",
        "title": "Former Arsenal player dies aged 21 after suffering brain injury during game",
        "publish_date": "Thu, 25 Sep 2025 21:55:58 +0000",
        "category": "sports",
        "authors": [],
        "text": "Former Arsenal-contracted player Billy Vigar has died aged 21 after sustaining a \"significant brain injury\" while playing for Chichester City last weekend.\n\nVigar was injured in an Isthmian League match at Wingate and Finchley, leading to the game's abandonment after 13 minutes.\n\n\"After sustaining a significant brain injury last Saturday, Billy Vigar was put in an induced coma. On Tuesday, he needed an operation to aid any chances of recovery. Although this helped, the injury proved too much for him and he passed away on Thursday morning,\" a statement from the seventh-tier Chichester read.\n\n\"The responses to the original update show how much Billy was thought of and loved within the sport. His family are devastated that this has happened whilst he was playing the sport that he loved.\"\n\nVigar joined Arsenal's academy as a 14-year-old in 2017, before signing a professional contract in 2022. He was loaned to Derby and Eastbourne Borough before joining Hastings United in 2024. He linked up with Chichester at the start of this season.\n\n\"Everyone at Arsenal Football Club is deeply sorry to hear of the tragic passing of Chichester City forward and former Arsenal academy player, Billy Vigar,\" a statement from Arsenal read.\n\n\"Billy joined our academy on schoolboy terms aged 14, after being scouted at his home town club Hove Rivervale FC and excelled as a striker at Hale End, scoring 17 goals in his debut season.\n\n\"As well as his significant talent, Billy will always be remembered for his love of the game, pride at representing our football club — he once called the day he was spotted by our scouts as 'the most important of his life' — and a character beloved by teammates and coaches alike.\n\n\"Our deepest condolences go out to the Vigar family and his many friends at this extremely difficult time.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-09-26/asx-markets-business-live-news-26-sept-2025/105819610",
        "title": "Live: CSL falls on Trump tariffs on pharmaceuticals from October while ASX edges lower",
        "publish_date": "Thu, 25 Sep 2025 21:46:09 +0000",
        "category": "finance",
        "authors": [
            "Yiying Li",
            "Emilia Terzon",
            "Emilia Terzon With Reuters"
        ],
        "text": "US President Donald Trump has announced 100 per cent tariffs on pharmaceutical imports from October.\n\nThe ASX has nudged lower at the open with CSL falling by three per cent.\n\nUS markets are down, dragged lower by the tech stock Oracle. It comes after concerns about an AI stock bubble.\n\nFollow the day's financial news and insights from our specialist business reporters on our live blog.\n\nDisclaimer: this blog is not intended as investment advice.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/afl-grand-final-parade-2025-live-blog-geelong-vs-brisbane-start-time-mcg-melbourne-park-oval-20250926-p5my2j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL grand final parade LIVE: Fagan refuses to rule out starting Neale as sub as fans flock to parade",
        "publish_date": "Fri, 26 Sep 2025 11:54:15 +1000",
        "category": "sports",
        "authors": [
            "Andrew Wu",
            "Marc Mcgowan"
        ],
        "text": "Geelong’s dual premiership coach Chris Scott says Bailey Smith’s arrival has not only positively impacted their on-field fortunes but changed their personality dynamics.\n\nThe rock-star midfielder, who boasts the biggest social media following of any AFL player, finished third in the Brownlow Medal and has transformed the Cats’ on-ball brigade into one of the best in the league.\n\nPatrick Dangerfield, Bailey Smith, and Dangerfield’s kids. Credit: Getty Images\n\nSmith has delivered his share of controversy along the way, too, most recently his tirade at a female photographer at training, but Scott has relished bringing him into the club.\n\n“I think we, to an extent, knew that he was going to change us in a lot of ways,” Scott said.\n\n“Without giving away too much about the way our football department works; I would describe the group of players, even if you think back to ’22 for a minute … if you know them, they’re a big group of introverts within that team. Bailey’s not one of them now, but the players have really embraced him.”\n\nScott said Smith had made a big impression on everyone at Geelong, including himself. Cats rising star Ollie Dempsey is another.\n\nOllie Dempsey and Mark Blicavs Credit: Eddie Jim\n\nThe hard-running wingman did not know Smith, but knew he was joining Geelong, when he replied “next year brother” to the ex-Bulldog’s grand final-related Instagram post last year: “Be out there one day.”\n\n“It was a bit of a joke back then. I didn’t actually know him. I hadn’t met him yet at that stage,” Dempsey said.\n\n“I was at the grand final myself, and I thought it’d be funny, me and my mate, to say that, and it got a lot of attention, which I should have expected, but it was pretty funny.\n\n“We talked about it earlier in the year that it’d be pretty cool if we did make it, and to repost it.\n\n“He’s been great. He’s a great teammate. Obviously, you’ve seen what he’s done on the field, but not only on the field, he’s been really good off the field for me, personally, and for the rest of the team. He brings a great energy and spark for us.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/the-sound-that-convinced-sam-kerr-her-return-from-injury-was-complete-20250926-p5my3k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The sound that convinced Sam Kerr her return from injury was complete",
        "publish_date": "Fri, 26 Sep 2025 11:52:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "“I just wanted to get on the pitch. I hated that I knew everyone was [talking about me]. I knew the commentators were talking about it. I knew that everyone was talking about it. And I was like, this should have been like a year ago, but whatever.” What came after that was even better: a goal, in the third minute of stoppage time, to help seal a 3-1 victory. Scrappy as it was, it won’t find a home on Kerr’s highlight reel - unlike the “out of body experience” of scoring that goal against England at the 2023 Women’s World Cup - but it was momentous all the same, and not just because it was her 100th for the club. Sam Kerr enters the fray after … well, too long on the sidelines. Credit: Getty Images “I was relieved, and just kind of like, laughing,” she said. “And I think like the response that the girls gave me was really nice and melted my heart … [and] I just wanted to thank the Chelsea fans, because throughout these last few months, they’ve been so supportive of me. Some of them probably lost a little bit of faith in, like, me or forgot what I could do on the pitch.\n\n“I’ve had so many people over the last year say, ‘Oh, she’ll never get back to what she was.’ Loading “It felt nice to be able to remind people. I don’t even need a whole game. I can score an important goal in 20 minutes, whether it’s my first game back or not.” The comeback trail for Kerr was about twice as long as it should be for an ACL injury; it was a “pretty crap” experience, she said, but one that was put into perspective by the arrival of her first child, Jagger, with partner Kristie. “It wasn’t like I was sitting off the park, and I was training and having a great old time. It was doctor’s appointment after doctor appointment, flying here, flying there, trying to fix my knee,” she said.\n\nLoading “I felt like every time … say I had six good weeks, then I’d have two really bad weeks. I had maybe like seven or eight setbacks. Especially when it got to the pointy end of [ast] season, it’s tough to not be involved in those games. As a competitor, you just want to be out there, and you just want to show people what you’re made of. And that was really hard for me. “The good part of it was you play football for so long, you kind of think it’s your identity and it’s who you are. But with the time off, I got to spend more time with Kristie. We got to go home, see my family. We had Jags. So there was things that happened that really kept me going. Now I have a different look on football, and I don’t hang so much of my life on it, I guess.” Kerr turned 32 earlier this month, and though that might suggest she’s in the twilight of her career, she insists that she’s not. The impending Women’s Asian Cup in Australia gives her another marquee event on home soil to look forward to, but her outlook stretches well beyond that, and even the next World Cup in 2027. In a recent interview with Nine, she said she has “way more in my locker than one more” World Cup - but when the time comes that she does retire, a career as a coach could beckon.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/the-stories-behind-the-migrant-matriarchs-who-helped-shape-wa-20250925-p5mxzo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The stories behind the migrant matriarchs who helped shape WA",
        "publish_date": "Fri, 26 Sep 2025 11:47:51 +1000",
        "category": "entertainment",
        "authors": [
            "Cameron Myles"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Vittoria Melia remembers vividly the sight of Rottnest Island heralding the end of her 22-day journey from Bivongi, Calabria to Fremantle in 1963. The trip was long and her daughter, Claudia, had been sick. When Claudia’s father came to greet them at the port, having left for Australia some nine or 10 months earlier, Claudia – then about two years old – wasn’t sure who he was. Vittoria and Claudia Melia in front of a photo of themselves (Claudia being carried, front, with Vittoria walking behind) at the entrance to the From Nonna With Love exhibition. Credit: Cameron Myles “I didn’t remember him, and I would have been scared,” Claudia says. “So I have no memory, really of the actual day we arrived, and I don’t have any memory of the voyage, but mum says that I was sick for the whole time.” “She was seasick the whole way,” Vittoria says. “[I’d say], ‘let’s go to the lounge’ – ‘no mum, it’s poisoned, the food’, so we lost weight on the ship, because I didn’t have any good lunch or dinner, and we had a little baby.”\n\nAdvertisement\n\nBut Vittoria wasted no time after landing, straight off to a wedding that night where they were introduced to Perth’s growing Italian community. “And I find everybody from the Bivongi at that wedding, it was an Italian wedding,” Vittoria laughs. A photo of Vittoria and Claudia at the end of their journey adorns the entrance to the latest exhibition to open at the WA Maritime Museum. From Nonna with Love: Stories of Tradition and Triumph charts the tales of the Italian migrants who came to Western Australia between the early 1900s to the 1970s – and, more specifically, the matriarchs who became the backbones of those communities which helped shape the identity of Perth, Fremantle, and the broader state. Ahead of its time: Anne Ferrari, left, with an early coffee roasting machine. The exhibition opens on Saturday, but many of the nonnas featured, and their families, got an early look on Wednesday during a tour with curator Nella Fitzgerald. Among the personal stories told through more than 100 objects on display are famous names in sport, politics – and food.\n\nAdvertisement\n\nAnne Ferrari, whose father John Re was behind Northbridge’s famous The Re Store, tells this masthead of the early days of selling coffee roasted and ground in-store – ahead of its time, given the espresso-driven cafe culture which later flourished in Perth. Maria Pizzale – the owner of classic Fremantle Italian restaurant Capri – has her story told in the exhibition. Capri Restaurant owner Maria Pizzale and daughter Carla Caravella. Credit: Cameron Myles Pizzale and her husband Corrado took over the restaurant from Corrado’s father Oddone in the 1960s, and it has remained a testament to traditional Italian cooking on the port city’s cafe strip ever since, its offering largely unchanged except for a recent move to serve alcohol after 71 years of BYO. Pizzale’s daughter, Carla Caravella, was overcome with emotion when she first saw the display. “Mrs Ferrari and mum lived a different life, because they were working, they were in the businesses working, and they worked long, hard hours, and so they weren’t in the community socializing quite as much,” Caravella says. “I don’t have time to have friends,” Pizzale laughs.\n\nAdvertisement\n\n“I was too busy, and I raised four children in the Capri Restaurant.” “This has brought so much emotion forward, because it is such an important part of our history … and it honours all these ladies who are part of this exhibition, because they’ve always been in the background, quietly, just keeping everything going,” Caravella says. Tony Ricciardello with his wife Carla, children, and mother Maria Ricciardello. Championship-winning Sports Sedan racer Tony Ricciardello was taken aback by the exhibition charting the accomplishments of his mum Maria Ricciardello alongside his father Basil. “There’s a lot of emotions happening,” he says. “We’ve worked together with Nella for quite a few months, putting this together. “And dad was in the background with me doing it, and he passed away in November, so he didn’t get to see the finished product of something that they both created.”\n\nAdvertisement\n\nMaria was always in the background of Tony’s accomplished racing career, described as “the core of the family that kept everyone strong and healthy”. “That was our picnic for the weekend, we went motor racing as a family; mum was always in the kitchen, cooking the food for the pit crew and the team,” he says. “And you know, dad was always demanding, not the sausage rolls and stuff – it was pasta and risotto for the pit crew.” The Ricciardellos aren’t the only famous motorsport family to have links to early Italian migration to Perth; Giuseppina Ricciardo – nonna of F1 driver Daniel Ricciardo – has an exhibit dedicated to her. The motivation for From Nonna With Love came from conversations Fitzgerald had with her mother about life in Italy during World War II, and the decision to migrate to Australia. “It’s a tribute to my mother, Angela. But in that tribute, is a tribute to every Nonna and great biznona that is here, both in Italy, Australia and around the world,” she says. “It also tells the story of extraordinary Italian women who migrated here to Australia … it tells their stories of perseverance, belief and the love that they had to build a family and a wonderful future here for them.”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/why-the-first-play-of-the-bledisloe-cup-could-tell-us-all-we-need-to-know-20250926-p5my2k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why the first play of the Bledisloe Cup could tell us all we need to know",
        "publish_date": "Fri, 26 Sep 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "If the Wallabies kick off against the All Blacks at Eden Park, it would not be a surprise if they take a leaf out of the Springboks’ playbook.\n\nIn Wellington two weeks ago, South Africa went high and straight down the middle from the kickoff, inviting their fullback Aphelele Fassi to try and regain possession, which he promptly did.\n\nIt was a statement of intent from the Springboks, and the Wallabies look set up to play with the same level of ambition.\n\nSome of coach Joe Schmidt’s selections were borne out of necessity, with Andrew Kellaway suffering a calf injury and Jake Gordon presumably not quite at his sharpest after a hamstring injury, but the net effect is a Wallabies team that is packed with both risk and reward.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/you-better-put-him-back-in-the-hunch-that-delivered-penrith-a-modern-day-great-20250925-p5mxwm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You better put him back in’: The hunch that delivered Penrith a modern-day great",
        "publish_date": "Fri, 26 Sep 2025 11:44:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Had long-serving Penrith recruitment manager Jim Jones not gone to the country NSW town of Forbes one autumn morning more than a decade ago, he is convinced Isaah Yeo would have never been discovered. “There’s a good chance he could have been playing for the Dubbo CYMS in the local A-grade comp – not chasing a possible fifth NRL premiership with the Panthers,” Jones said. In a classic sliding doors moment, Jones revealed the day he attended Red Bend Catholic College to watch trials for the Southern Country team. The best 17 players from that day would head to Sydney to try their luck at making the NSW Combined Catholic Colleges team. Selectors spotted Jones and asked him to help with proceedings. He initially told them he was there as a fan. “But I was glad I was there in the end because the teachers were never going to pick ‘Yeoy’,” Jones said.\n\nAdvertisement\n\nPenrith on-field leader Isaah Yeo. Credit: Getty Images “Every recruitment officer gets a hunch. I had a hunch with him. “I don’t know what would have happened had I not been there. Who knows, maybe Yeoy would have still been playing in Dubbo. “He was on the bench for his team. He was wearing the No.14. But he was tall, mobile, tough, and skilful. “The selectors asked me at the end of the day what I thought. They were like, ‘What about this fella?’, and I was like, ‘Yep’, then I asked, ‘What happened to the No.14?’. They said, ‘We didn’t pick him’. I said, ‘You better put him back in’. He was the only bloke I liked all day.” Yeo made the cut and went to Sydney, but missed out on the NSW CCC team. He remained on Jones’ radar and was later signed by Penrith.\n\nAdvertisement\n\nJones had similar “hunches” with Panthers fullback Dylan Edwards, and even Liam Martin, two of Yeo’s teammates who will feature in Sunday’s preliminary final against the Broncos. There were also a couple of players Jones missed, like the day he was sent to the Confraternity Carnival, a popular schoolboys tournament in Queensland, in the early 1990s, with the simple instruction of landing one signature. He wanted two and begged Phil Gould, who was then working with the Panthers, only to be told to stick with one. Wendell Sailor is one who ‘got away’ from the Panthers. Credit: Getty Images “I signed a fullback, Butch Fatnowna, who was brilliant,” Jones said. “But he broke his ankle, and by the time he was ready to come down to Sydney, he had put on a bit of weight. “Gus was into me about it, but I said, ‘you wouldn’t let me sign two’. That second player I wanted was Wendell Sailor.”\n\nAdvertisement\n\nSailor went on to win premierships with the Broncos and became a dual international. Isaah Yeo doing the hard work earlier this year. Credit: Getty Images “I still have a picture on the wall in my office of Wendell with the message, ‘thanks for not picking me, Jimmy’,” Jones said. Yeo’s father, Justin, recalled his boy “being OK, but never a standout, and certainly never the first kid picked”. “He was a bit like he is now, always strong, with little difference between his best game and worst game,” Yeo snr said. “Most of the time, he looked like another player. I remember he was playing SG Ball, and Ivan Cleary walked into the box at the very moment Isaah made a break and did something special. The coaches told Ivan, ‘that’s Isaah Yeo’. Isaah Yeo led the Kangaroos at last year’s Pacific Championships. Credit: Getty Images\n\nAdvertisement\n\n“You often wonder if things would have been different had Ivan not walked into the box at that very moment, or looked up to see what Isaah was doing at that exact time. “I teach at a school in Mudgee, and I still tell the kids how you need to make the most of every moment and opportunity; if you get an opportunity, it’s up to you what you do with it.” The kid wearing the No.14 jersey that day in 2012 – and who made a break when Cleary took a peek – has become one of the most influential forwards in the game. The attributes he provides are a large part of the reason Penrith can defeat Brisbane and give themselves a shot at five straight premierships next Sunday. Yeo is admired on both sides of the border, with Cameron Smith – the Melbourne, Queensland, and Australian legend who finished with 430 NRL games – praising the 30-year-old’s durability. “When you look at his last five years, Isaah has barely missed a game of footy,” Smith said.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/mayday-qantas-flight-issues-emergency-call-over-tasman-sea-20250926-p5my5q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Mayday’: Qantas flight issues emergency call over Tasman Sea",
        "publish_date": "Fri, 26 Sep 2025 11:39:58 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "A Qantas plane has landed safely at Auckland International Airport after issuing a Mayday call over the Tasman Sea amid concerns about a potential fire in the cargo hold.\n\nThe Mayday call triggered a priority landing at Auckland Airport, local media report, with the plane landing safely as emergency response waited on the tarmac.\n\nEmergency vehicles at Auckland Airport on Friday. Credit: Nine News\n\nAmbulance staff have treated two passengers for minor conditions, while other paramedic crews have been stood down.\n\nQantas Flight 141 departed Sydney on Friday morning, and landed in Auckland just before midday (New Zealand time).",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/strawberry-ricotta-crostata-20250922-p5mx1e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Strawberry ricotta crostata",
        "publish_date": "Fri, 26 Sep 2025 11:32:23 +1000",
        "category": "finance",
        "authors": [
            "Helen Goh"
        ],
        "text": "Step 1 To make the pastry, put the flour, salt and baking powder in a food processor and pulse a few times to combine and aerate. Add the cold, cubed butter and pulse until the butter is in small pieces, then add the cream cheese. Pulse until incorporated – the crumbs will look damp and unevenly sized – and add the vinegar and 1 tablespoon of the cream. Pulse until the dough just starts to come together (add another tablespoon of cream if it doesn’t), then tip the pastry out onto a lightly floured surface. Gather and press the pastry into one piece, then wrap loosely in cling film. Press to flatten into a disc and refrigerate for at least 1 hour (and up to 2 days).\n\nStep 2 When the pastry is well rested and you’re ready to bake the crostata, prepare the ricotta base: put all the ingredients in a bowl and stir with a wooden spoon until fully combined, then refrigerate.\n\nStep 3 Prepare the strawberries by combining all the ingredients in a bowl and tossing gently. Set aside.\n\nStep 4 Preheat the oven to 190C fan-forced (210C conventional).\n\nStep 5 Remove the pastry from the fridge and place it on a large sheet of baking paper that has been lightly dusted with flour. Roll the pastry out evenly into a large circle (about 38-40cm wide and 2mm thick). Don’t worry if the edges are irregular: this is part of the charm of a crostata. Lift the baking paper and transfer it and the pastry onto a large baking tray.\n\nStep 6 Spread the ricotta mix evenly across the middle of the pastry, leaving a 4cm-5cm border.\n\nStep 7 Spoon the strawberries on top of the ricotta mix, drizzle over any of their juice, then carefully draw the pastry border up and over the fruit, roughly pleating it as you go and leaving the centre of the crostata exposed.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/the-economy/wi-fi-on-board-why-i-prefer-flying-without-it-20250918-p5mw2w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wi-Fi on board: Why I prefer flying without it",
        "publish_date": "Fri, 26 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "In our wired world, the chance for waking, peaceful solitude is a rare and somewhat precious thing.\n\nFor many, one of the last places to find it is aboard a plane during a long flight. The cabin of an aircraft becomes a sanctuary – a personal space for thinking, writing, and quiet entertainment, detached from the demands of daily life.\n\nNo Wi-Fi here: How far you have to travel to not be bothered by an internet connection. Credit: Chris Zappone\n\nNow, in the name of progress, that sanctuary is at risk. The culprit: in-flight Wi-Fi.\n\nPart of the joy of flying has always been the freedom it offers – the solitude to work, to think, to just be, and to view at a distance life outside an endless stream of updates on screens.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/multiplex-s-250m-lawsuit-over-sydney-fish-market-as-bill-nears-1-25b-20250924-p5mxkq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Multiplex’s $250m lawsuit over Sydney Fish Market as bill nears $1.25b",
        "publish_date": "Fri, 26 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Harriet Alexander"
        ],
        "text": "Construction giant Multiplex is suing the NSW government over cost blowouts on the new Sydney Fish Market in a case that threatens to tip the total bill for the project to $1.25 billion and bankrupt the company that runs the markets.\n\nMultiplex has filed a $250 million lawsuit against Infrastructure NSW, which has brought a cross-claim against Sydney Fish Market for allegedly contributing to the cause of the action.\n\nThe new Sydney Fish Market is the subject of three-way legal action between the builder, the government and the head tenant. Credit: Sitthixay Ditthavong\n\nNeither the Sydney Fish Market nor Infrastructure NSW will commit to an opening date for the new site beyond saying that they expect partial completion to occur in November, “facilitating an opening prior to Christmas”.\n\nAccording to the market’s annual financial report, Multiplex is claiming that INSW breached its contract and mismanaged the construction of the new Sydney Fish Market on Blackwattle Bay.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/like-thousands-of-sydneysiders-jermaine-ran-a-marathon-last-month-but-he-didn-t-stop-20250924-p5mxle.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Like thousands of Sydneysiders, Jermaine ran a marathon last month. But he didn’t stop",
        "publish_date": "Fri, 26 Sep 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Mary Ward"
        ],
        "text": "Like tens of thousands of Sydneysiders, Jermaine Jones ran a marathon last month.\n\nBut, instead of finishing his race, posting a picture on Instagram, and taking the week off from the gym, the construction worker from Marrickville woke up the next morning and ran another marathon. Then he woke up the following day and did it again, and again, as he set out to complete 34 marathons in as many days.\n\nJermaine Jones is running 34 marathons around Centennial Park in as many days. Credit: Jessica Hromas\n\nAs he approaches his final run on Saturday, 37-year-old Jones has an injured right ankle and is dealing with significant bruising and swelling on his toes. But he seems unfussed.\n\n“It’s to be expected with this many marathons,” he said.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/it-s-so-sick-dangerfield-played-one-of-the-best-finals-on-record-then-the-real-performance-started-20250925-p5mxvv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It’s so sick’: Dangerfield played one of the best finals on record, then the real performance started",
        "publish_date": "Fri, 26 Sep 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "The football world has universally lauded Dangerfield, at age 35, for his spectacular display last week against Hawthorn, including 31 disposals, three goals, 20 contested possessions, 13 score involvements, nine inside 50s and six centre clearances. It was the highest-rating preliminary final performance since Champion Data started keeping records. Coach Chris Scott insisted afterwards that they don’t wrap the champion veteran in cotton wool and unleash him in September, but there must be some truth in that with his management in his 18th season. Dangerfield enhanced his legacy with a masterful performance in the Cats’ preliminary final win over Hawthorn. Credit: Getty Images The best-on-ground performance, which propelled Geelong into their seventh grand final since 2007, even triggered a discussion between his teammates about where “Pat” stacks up among the AFL’s modern giants. Max Holmes believes Dangerfield is “easily” inside the top five, while Shaun Mannagh has him on the podium – and joked that the man himself would probably place himself there, too.\n\nLoading “Gary Ablett jnr is a clear No.1, I’d say,” Holmes said. “I honestly want to put Patty second, but I know people scream that ‘Dusty’ [Dustin Martin] is better, and ‘Buddy’ [Lance Franklin] is up there as well. “It’s hard to rank those players, but I think ‘Danger’ is in that top five, for sure. He’s incredible to play alongside, and I guess that’s a perk of being at Geelong. There are stars everywhere who you can take a lot of wisdom from.” Bowes – who chose to join the Cats in large part because of Dangerfield’s involvement – agrees with Mannagh, pointing to his 359 games, eight All-Australian selections and four club champion awards across two clubs, as well as him winning the 2016 Brownlow Medal and playing in the 2022 premiership. “The only thing missing on his resume is being captain in a grand final and winning the premiership, so hopefully, we can tick that off for him,” Bowes said.\n\nEmerging midfielder Jhye Clark, the Cats’ super sub in the preliminary final, has a different measure for Dangerfield. After entering the match when Tom Stewart was concussed before quarter-time, Clark had a front-row seat to Dangerfield’s extraordinary feats. “It’s so sick. He’s one of a kind,” Clark said. Jhye Clark (left) celebrates Geelong’s preliminary final win with Dangerfield. Credit: Getty Images “He just runs straight through everyone, and when you watch him play – you just want to run through a brick wall. He’s so inspiring for the whole team, and I’d be very scared of playing against him.” Don’t mess with Danger’s play list\n\nShannon Neale was yet to make his AFL debut when he walked into the player gym at Kardinia Park one day in the 2022 pre-season. Zach Tuohy, Rhys Stanley and Dangerfield were already in there. Country music was blasting from the speakers, which a then-19-year-old Neale was unimpressed with before he made a mistake he will never forget. Dangerfield has formed a close bond with Shannon Neale (second from right) after an inauspicious start. Credit: Getty Images Without a moment of hesitation, the big forward from Perth pressed the “skip” button. “‘Don’t change the music! You can’t do that!’,” Dangerfield crossly told Neale, who initially laughed, thinking his reaction was a joke.\n\nLoading “But he said, ‘I’m dead serious’ and he’s got the finger pointing at me, and everything,” Neale recalled. “I walked out of the gym, and I almost left the club that afternoon. About 20 minutes later, he sends me a message, and he’s like, ‘Mate, I am extremely sorry, the [summer] heat got to me – it’s fine’. “It took me a couple of weeks to look him in the eyes again. He wasn’t the captain at the time, but obviously, he’s a leader. He’s such a figure. It’s Patrick Dangerfield. Anything that happens like that; you think you’re done.” Neale sheepishly shared the Dangerfield story, which he thinks might get him in trouble, but he wanted to make the point that it was a sliding doors moment for their relationship, which was limited at the time. They are only two lockers apart, now sit alongside one another in team meetings, and have formed a close bond.\n\n“I can ask him for advice, and I feel very comfortable approaching him about anything,” Neale said. “He’s super witty, and loves a laugh. I think he’s really enjoying his footy. He’s relaxed, and enjoying where he’s at, and certainly, our friendship has blossomed since that moment.” Another speaker-related Dangerfield story emerged last Friday night. It was all love between Shaun Mannagh and Dangerfield last week. Credit: AFL Photos The evergreen skipper was controlling the tunes again pre-match against the Hawks, but made the left-field choice of classical music. This time it wasn’t just Neale who took umbrage, prompting Dangerfield to relent and change to a different song, Kenny Loggins’ Danger Zone.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/life-and-relationships/mum-guilt-is-so-universal-it-inspired-the-name-of-my-company-20250925-p5mxy9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mum guilt is so universal it inspired the name of my company",
        "publish_date": "Fri, 26 Sep 2025 11:30:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "My body felt weird that 1992 day. I’d had to get out of a taxi the night before, repelled by the smell of every passenger before me. My nipples felt like they were being sliced with razor blades when my bra touched them. I wanted to sleep and wear overalls.\n\nSurely, surely, I was pregnant. A home test. One line. Devastation. And confusion. Why, then, was I suddenly craving McDonald’s chicken burgers when I’d never eaten one before? Why was I peeing every 10 minutes?\n\nBeing pregnant is stressful enough without incorrect claims. Credit: iStock\n\nMy doctor took blood. Rang by the end of the day: no baby this month. Come back next week, we’ll work out what’s going on.\n\nAt home, a boiling bath topped up for hours until the bottle of red was gone. I sobbed my face off. Called for more wine.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/nrl-around-the-clubs-finals-week-three-20250922-p5mwud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victor Radley withdraws from Ashes; Bulldogs in talks with Adam O’Brien",
        "publish_date": "Fri, 26 Sep 2025 11:26:12 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Michael Chammas",
            "Roy Ward",
            "Billie Eder"
        ],
        "text": "While Wane won’t pick his England squad until mid-October, new Australian coach Kevin Walters will name his side the day after the NRL grand final, having received a significant boost in prop Tino Fa’asuamaleaui opting to represent the Kangaroos over Samoa. Walters has also confirmed Roosters flyer Mark Nawaqanitawase will be considered for an Ashes berth, with his decision to move back to rugby at the end of 2026 having no bearing on his selection chances. Bulldogs pursue ex-Knights coach Adam O’Brien to shake up attack Michael Chammas The Canterbury Bulldogs are in talks with former Newcastle coach Adam O’Brien about a role with the club next season.\n\nBulldogs officials met with O’Brien on Thursday to discuss the prospect of him becoming the club’s attack coach in 2026. Jason Taylor, who currently coaches the Dogs’ attack, still has another year to run on his contract and is expected to move to a new role if O’Brien signs. Manly have also shown interest in signing O’Brien as an assistant coach, but sources with knowledge of the situation talking on the condition of anonymity said O’Brien was leaning towards the Bulldogs. O’Brien spent a decade working as an assistant to Craig Bellamy at Melbourne and a season under Trent Robinson at the Roosters before being head-hunted for the Knights’ top job as Nathan Brown’s successor.\n\nThe Bulldogs believe O’Brien’s experience and knowledge can boost an attack that came under fire for large parts of 2025. Adam O’Brien pulled the pin after six years in charge of the Knights. Credit: Getty Images O’Brien has worked with Bulldogs Kurt Mann, Sitili Tupouniua and Enari Tuala, as well as new recruit Leo Thompson. Bellamy says Jahrome Hughes will play in preliminary final Roy Ward\n\nHe won’t have a Mal Meninga-size guard on his forearm but Melbourne Storm star Jahrome Hughes is set to play in the club’s preliminary final at AAMI Park on Friday night. Hughes fractured his forearm in the last round of the season and seemed long odds to be able to return in time for the finals. Mal Meninga, right, sports his armguard after winning the 1989 ARL grand final with Canberra. Credit: Getty Images But the reigning Dally M Medallist has recovered quicker than expected and Storm coach Craig Bellamy is confident Hughes will play on Friday night against Cronulla, unless any last-minute issues arise. Returning Hughes to the side will mean rising halfback Jonah Pezet will likely drop out after starring in their qualifying final win over Canterbury-Bankstown two weeks ago.\n\nUnless something flares up for Hughes, Bellamy said he would be running out against the Cronulla Sharks despite having not completed “a whole heap” of contact work. “He’s done enough to be confident in what he needs to do and what he is doing,” Bellamy said. “Something drastic would have to go wrong for him to miss.” Bellamy laughed when asked if Hughes would need a large guard Meninga wore for the Canberra Raiders in the 1990s when Bellamy was also on the team. Meninga’s oversized guard became the stuff of legend but wouldn’t be allowed anywhere near a footy field today.\n\n“I was at Canberra when Mal used to wear that guard and no one was game to near him at training in case you copped it,” Bellamy said with a laugh. “But Hughesy’s [guard] is a fair bit thinner than Mal’s was.” Storm star Jahrome Hughes trains with his new forearm guard on Thursday. Credit: Getty Images Bellamy also praised the toughness of second-rower Shawn Blore who will also return from a fractured larynx to play on Friday night. “That’s a pretty bad injury he got and he kept going in the game - he’s a pretty tough unit,” Bellamy said. “He was busting to get back. He kept ringing me and telling me that “I’m right, I’m right” but, obviously, I’m taking more advice from the medical people than him. We are confident he has recovered.”\n\nThe Storm thumped the Sharks 30-6 when they last met at AAMI Park in June but the Sharks have won nine games out of 10 since including knockout final wins over Sydney Roosters and minor premiers Canberra Raiders. So the Sharks will come in fired up as will a sellout crowd hoping to see the Storm progress to another grand final. “I don’t know who wrote them off. They finished fifth,” Bellamy said. “To beat the Roosters and then beat Canberra in Canberra - we know they are in good form, but we are just concerned with what we need to do and how we need to do it.” The Storm hammered the Sharks but it kick-started Cronulla’s season\n\nRoy Ward The last time Cronulla trudged off AAMI Park they were at their lowest point of the season. Since that 30-6 round 17 loss to the Storm, the Sharks have won nine of 10 games, including two knockout finals, and are now just one win away from the NRL grand final. The only problem is that the team standing between them and the NRL decider is the Storm, who they take on at AAMI Park in a preliminary final on Friday night.\n\nSharks playmaker Braydon Trindall remembers that night in June well, and how it galvanised his team to turn their season around. “I think we were all just sick of letting the year slip away from us,” Trindall recalled on Wednesday. “So we sat down and had a good talk about it and went out on the field and changed some of the actions that were hurting us. “I think it was more of a club thing and everyone wanted to put in a bit more, and now look where we are.” The Storm hammered the Sharks last time they met in Melbourne. Credit: Getty Images Trindall has carried an eye issue through recent games after taking a knock against the Sydney Roosters earlier in the finals, but while there is some visible blood, he said it had no impact on his vision.\n\n“I copped a boot against the Roosters, but it’s starting to heal now,” he said. The Storm have plenty of respect for Trindall’s kicking game and the threat it poses, but he knows accuracy is the key given the height and catching ability of Storm wingers Xavier Coates and Will Warbrick. “It’s good when you have some good chases on the end of the kick,” he said. “Will is a good leaper, so there will be a bit of a challenge there. It doesn’t really change things. I might shorten the kicks up a bit so they have to run a bit more, but we’ve got some good catches as well so I won’t change much.” Knights approach premiership-winning half to work as attack consultant Michael Chammas\n\nThe Newcastle Knights have reached out to three-time premiership-winning playmaker Luke Keary about a role with the club as an attack and halves consultant from next season. The Knights are in the process of restructuring their coaching staff and have made the bold move to approach the recently retired Catalans pivot to gauge his interest in joining the club. Former Roosters playmaker Luke Keary could be heading to Newcastle. Credit: NRL Photos Keary worked with both new coach Justin Holbrook and director of football Chris James at the Sydney Roosters and is highly regarded as one of the smartest players in rugby league. Keary, who spent this season with Catalans in the Super League after finishing his NRL career at the Sydney Roosters in 2024, is weighing up the opportunity.\n\nThe 33-year-old wants to spend the summer travelling with his young family but is said to be keen to discuss the opportunity to link with the Knights. Newcastle are keen to add some specialised coaches to their ranks and believe Keary would be a huge asset to help work with recruits Dylan Brown and Sandon Smith, as well as incumbents Fletcher Sharpe and Kalyn Ponga. Newcastle’s attack struggled to fire in 2025 under the guidance of attack coach Blake Green, who missed out on the job as Adam O’Brien’s successor to Holbrook. Keary doesn’t have a job lined up at the Sydney Roosters, who themselves will welcome back Jared Waerea-Hargreaves in an official capacity to work with the club’s younger players in 2026. Panthers duo shrug off injury worries ahead of Broncos showdown\n\nDan Walsh and Billie Eder Penrith’s Liam Martin and Casey McLean insist they will be fit to play in Sunday’s grand final qualifier against Brisbane after being forced from the field in the Panthers semi-final thumping of Canterbury. Martin was in obvious discomfort after he was tackled by former teammate Viliame Kikau, with the NSW and Kangaroos star staying down and struggling to breathe late in the contest. The 28-year-old came from the field and struggled to make his way up the Accor Stadium tunnel at one point, but he was in good spirits soon afterwards and said he was not concerned about any recurrence of a rib cartilage injury he carried through last year’s finals. “They’re all right now,” Martin said of his ribs after full-time. “There was a bit of carry-on there. It’s a bit sore at the moment, but they’re all right. I landed on the ball, and ‘Kiks’ is a pretty big man, and he landed on me. I was a bit winded, but I’m all right now.\n\nLiam Martin is helped from the field at Accor Stadium. Credit: Getty Images “It crossed my mind at first [that a serious injury may have occurred], but after a while I was like ‘it’s all right, I’m being a sook again’.” Martin won last year’s Clive Churchill medal against Melbourne despite playing through the pain of a popped rib cartilage in the 2024 grand final. Loading He also required painkilling injections for almost the entire season to manage an ongoing AC joint injury in his shoulder, which he has battled again in recent weeks.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/lions-rookies-plot-a-boilover-while-a-champion-is-poised-to-end-his-slump-20250925-p5mxug.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lions rookies plot a boilover, while a champion is poised to end his slump",
        "publish_date": "Fri, 26 Sep 2025 11:14:55 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "“That’s going to be a challenge on the weekend, and how they can stand up at the end of the ball. It does help without Tom Stewart there – it’s unfortunate for Tom, but it does help as a Lions supporter, him not being there. “But Ty and Logan have done an amazing job as a couple of youngsters. We’ve got quite a diverse forward line, all of our guys can kick multiple goals.” Kai Lohmann has rediscovered his mojo at the right time. Credit: Getty Images Lohmann has success on the biggest stage, after his four goals in last year’s decider. While the 22-year-old’s body kept him from hitting his straps for much of 2025, he has rediscovered his mojo – kicking goals in his past eight games, including three in the semi-final against the Suns.\n\nAnd Lohmann declared his fitness would be no concern on Saturday. “Last year was pretty perfect, the way my body was and how I was leading into the game full of energy. This year’s been a bit difficult with my body, but … I’m feeling a lot better,” Lohmann said. “The last few weeks have been really good, I’m still dealing with a bit, but it’s been a lot better. It [the ankle] just seems to be lingering a little bit this year. “I’ve figured out how to play through injuries and get through these tough times.”\n\nLoading The energy Morris and Lohmann brought to Brisbane’s premiership cause was largely credited as rejuvenating their 2024 season. While Morris was kept to just six touches when Brisbane last faced the Cats, Lohmann believed there would be no repeat. “I saw glimpses last year he was going to be a pretty special player,” Lohmann said. “He can take his game to another level. We’ve got a really good young group, which is going to be exciting for Lions fans for a lot of years.”\n\nMeanwhile, Gallop will play just his sixth AFL game in the decider, meaning four of those clashes have all been finals fixtures. “It’s quite a good experience just to see what I’m capable of, it is being thrown in the deep end, but I wouldn’t have it any other way,” Gallop said. The Sunshine Coast product has had a remarkable ascent, after being spotted playing for the Maroochydore Colts before being invited into the Lions’ academy. Against the Magpies, his third goal proved to himself he belonged among the elite. His second, working through traffic, got Brisbane back in front after Collingwood’s rampant second quarter.\n\nTy Gallop celebrates a goal. Credit: AFL Photos “The first two was just being in the right place at the right time, but it was good to take a good mark on the last one and put that through,” Gallop said. “I was playing my senior footy and wasn’t too sure what was happening. Last year I was part of the Allies program and got a couple of games, and then I spoke to some role models of mine who gave me the confidence to back myself in and see where it could take me.” Loading Success for the Lions could hinge on Cameron bursting out of his perceived slump to inspire a Geelong boilover.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/donald-trump-confirms-tiktok-deal-with-china-ahead-of-us-ban/qdyc5vwor",
        "title": "Trump overcomes 'resistance' from China to transfer TikTok to US investors",
        "publish_date": "Fri, 26 Sep 2025 01:24:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "United States President Donald Trump has confirmed a plan to sell video-based social media platform TikTok's US operations to a consortium of American investors after the Chinese president signalled his approval for the deal.\n\n\n\n\n\nTrump signed an executive order on the deal on Thursday, which the White House valued at US$14 billion ($21.4 billion), without explaining how the figure was determined.\n\n\n\n\n\nTikTok's Chinese parent, ByteDance, currently values itself at more than US$330 billion ($505 billion). TikTok contributes a small percentage of the company's total revenue.\n\n\n\n\n\nMedia mogul Rupert Murdoch is reportedly part of the deal and would be joined by \"probably four or five absolutely world-class investors\", Trump said.\n\n\n\nREAD MORE Murdoch family joins TikTok US ownership deal, says Trump\n\nProtecting US assets\n\nTrump's efforts to sell the TikTok assets aim to address national security requirements outlined in a 2024 law and would allow for greater control over how TikTok's algorithm functions in the US.\n\n\n\n\n\nThe move comes months after a ban on the China-based app was set to take effect at the outset of this year.\n\n\n\n\n\nDiscussing how the deal was made, Trump said: \"I spoke with President Xi. We had a good talk, I told him what we were doing, and he said 'go ahead with it.'\"\n\n\n\n\n\nUS vice president JD Vance told reporters in the Oval Office that the deal would protect citizens from \"propaganda\".\n\n\n\n\n\n\"This deal really does mean Americans can use TikTok but actually use it with more confidence than they had in the past because their data is secure and it won't be used as a propaganda weapon like it has in the past,\" Vance said.\n\n\n\n\n\nHowever, he acknowledged the move was met with \"some resistance on the Chinese side\".\n\n\n\n\n\n\"The fundamental thing that we wanted to accomplish is that we wanted to keep TikTok operating, but we also wanted to make sure that we protected Americans' data privacy as required by law,\" he said.\n\n\n\nA group of Republicans said they want to see more details of the deal to ensure it represents a clean break with China.\n\n\n\n\n\n\"As the details are finalised, we must ensure this deal protects American users from the influence and surveillance of CCP-aligned groups,\" the group said.\n\n\n\n\n\nTrump has credited TikTok, which has 170 million US users, with helping him win reelection last year, and he has 15 million followers on his personal account.\n\n\n\n\n\n\"This is going to be American-operated all the way,\" Trump said.\n\n\n\nWho will own the assets?\n\nMurdoch and \"probably four or five absolutely world-class investors\" would be part of the deal, Trump confirmed.\n\n\n\n\n\n\"This is going to be American-operated all the way,\" he said, suggesting that US companies and investors would have majority control over the new entity.\n\n\n\n\n\nTrump said tech giant Oracle would be among the US investors in TikTok, but he did not disclose the full roster of new owners.\n\n\n\n\n\nA group of existing shareholders in ByteDance will hold a roughly 30 per cent stake, according to Reuters. Among ByteDance's current investors are venture capital firms Susquehanna International Group, General Atlantic, and KKR.\n\n\n\n\n\n— With additional reporting by Reuters.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/qantas-plane-lands-in-auckland-after-reports-of-a-fire-on-board/rjrcmg2if",
        "title": "Qantas plane lands in Auckland after reports of a fire on board",
        "publish_date": "Fri, 26 Sep 2025 00:48:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "A fire broke out on a Qantas flight en route from Sydney to Auckland on Friday morning, according to authorities in New Zealand.\n\n\n\n\n\nAuckland Airport told local media the aircraft \"landed safely\", and Fire and Emergency NZ confirmed it had responded to the emergency.\n\n\n\n\n\n\"We have received reports a Qantas flight from Sydney had a fire on board,\" an emergency services spokesperson said in a statement.\n\n\n\n\n\nThe Hato Hone St John ambulance service has not yet confirmed whether any passengers were injured.\n\n\n\n\n\nAn estimated 16 fire trucks, along with ambulances, attended the scene.\n\n\n\n\n\n\"The airfield is now returning to normal but there may be some slight delays for departing and arriving flights,\" a spokesperson for the airport said.\n\n\n\n\n\nThe trans-Tasman Qantas flight QFA141 left Sydney earlier this morning and landed around 11.47 am local time in Auckland.\n\n\n\n\n\nSBS News has contacted Qantas for comment.\n\n\n\n\n\nThis is a developing story and this article will be updated.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/unauthorised-edit-of-australian-film-removes-queer-couple-for-chinese-audiences/u8vtdhy8j",
        "title": "'Unauthorised' edit of Australian film Together removes same-sex couple for audiences in China",
        "publish_date": "Thu, 25 Sep 2025 22:34:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "A global movie distributor has demanded a Chinese company \"cease distributing\" an Australian film, after reports it used artificial intelligence to remove a queer couple.\n\n\n\n\n\nThe film Together stars Dave Franco and Alison Brie, who experience supernatural forces that affect their bodies, minds, and relationship.\n\n\n\n\n\nAfter screenings of the film in China, audiences noticed that a previously same-sex male couple getting married had been altered, with one of their faces swapped with a woman's.\n\n\n\n\n\nThe film's global distributor, Neon, has criticised the alteration of the film in China, seemingly another attempt by the country to censor depictions of queer characters in the media.\n\n\n\n\n\nOn Wednesday, Neon told Hollywood news outlet Deadline it \"does not approve\" of the \"unauthorised\" edit, and had demanded that the distributor Hishow cease distributing the altered version.\n\n\n\nGlobal movie distributor Neon has demanded a Chinese company \"cease distributing\" the Australian horror film Together, after reports it used artificial intelligence to remove a queer couple from a same-sex wedding scene. Source: Supplied / Neon/Hishow It is not the first time that films have been altered for viewing in China, with cuts and edits made to films like Bohemian Rhapsody in recent years to conceal nudity and sexuality.\n\n\n\n\n\nWhile it's been common for the country to edit out characters and scenes, the use of AI appears relatively new.\n\n\n\n\n\nThe 2023 film Oppenheimer was also altered with AI technology in China, digitally adding a black dress to a character to cover her exposed skin.\n\n\n\nThis media censorship also stretched to newspapers.\n\n\n\n\n\nA 2021 study by the Lowy Institute revealed that Chinese-language community media outlets in Australia are publishing news censored by translators they use in China to avoid potential repercussions in the country.\n\n\n\n\n\nStaff working in mainland China exercised self-censorship when translating news stories taken from mainstream Australian media into Chinese for community newspapers, according to the report.\n\n\n\n\n\nResearchers found the writers feared retribution by the Chinese authorities over any content perceived as negative.\n\n\n\n\n\nTogether was scheduled for general release in China on 19 September. But after the backlash, the film's Chinese distributor halted those plans without explanation.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/from-silicon-valley-to-sydney-how-trumps-h-1b-visa-move-could-make-ripples-in-australia/amcd339a5",
        "title": "From Silicon Valley to Sydney: How Trump's H-1B visa move could make ripples in Australia",
        "publish_date": "Thu, 25 Sep 2025 19:44:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points The H-1B visa program is a cornerstone of the United States' workforce, granting entry to 85,000 workers each year.\n\nOver the past five years, key players in Australia's tech industry have called on the government for a sector boost.\n\nExperts said the decision from the US presented an \"enormous\" opportunity for Australia to access high-level talent.\n\nUnited States President Donald Trump's recent order to raise the country's fee for skilled migrant visa applications to US$100,000 ($151,000) has shaken the tech industry, visa holders and hopeful applicants.\n\n\n\n\n\nThe fee increase is set to greatly reduce the number of future skilled-worker applications made by US-based companies, especially for tech giants like Amazon, Meta and Google, which send the bulk of H-1B visa requests.\n\n\n\n\n\nThe H-1B visa program is a cornerstone of the US' skilled workforce, with 85,000 permits granted every year, largely in tech.\n\n\n\n\n\nIn its 21 September decision, the White House said the visa, which was intended to bring skilled temporary workers into the US, had been \"deliberately exploited\" to replace American workers.\n\n\n\n\n\nIt later said the fee would be a one-off for new visa applicants and would not apply to applications submitted before 21 September.\n\n\n\n\n\nIn Australia, looming skills shortages and a flagging tech sector have led to growing calls for an overhaul of the country's migration program.\n\n\n\n\n\nAs Trump clamps down on foreign talent, closing the door on nearly 100,000 workers a year, could Australia open its own?\n\n\n\nAn 'opportunity' for the tech sector\n\nOver the past five years, key players in Australia's tech industry have called on the government for a sector boost.\n\n\n\n\n\nIn August 2022, the federal government announced it would commit to a target of 1.2 million tech-related jobs by 2030.\n\n\n\n\n\nThe goal, informed by consultation with tech industry groups including the Tech Council of Australia, would require more than 500,000 workers to join the hiring pool.\n\n\n\n\n\nAt the time, the government said its first step to achieving this was to \"accelerate\" processing times by clearing its backlog of millions of visa applications lodged during the COVID-19 pandemic period, prioritising \"skilled workers\".\n\n\n\n\n\nIn December 2024, the federal government added a specialised visa stream for in-demand skills to replace the former temporary skills visa . The \"modernised\" skilled occupation list contained more than 450 roles, especially in construction, cyber security, agriculture and health.\n\n\n\n\n\nFormer deputy secretary of the immigration department, Abul Rizvi, told SBS News the decision from the US presented an \"enormous\" opportunity for Australia to access high-level talent.\n\n\n\n\n\n\"It really does boil down to the preparedness of Australian industry and Australian employers to recruit these people. If they actively go out and recruit these people, then the visa categories are there to bring the people into Australia very quickly to enable them to get to work in Australia quickly. And find a pathway to permanent residents and citizenship.\n\n\n\n\n\n\"The key will be whether Australian employers wish to sponsor these people.\"\n\n\n\n\n\nThe Australian government announced in early September it would not make changes to the immigration cap , with its 2025-2026 intake to remain at the same levels and settings as the 2024-2025 program.\n\n\n\n\n\nIn 2024, the largest cohort of migrant arrivals consisted of temporary students, comprising 207,000 of a total 446,000 in the twelve months to June 2024.\n\n\n\nSome of Australia's biggest tech companies agree that Trump's announcement presents an opportunity for Australia, but they stress that policy and visa changes need to be made to entice skilled visa applicants.\n\n\n\n\n\nChief financial officer of Australian business management software company Deputy, Emma Seymour, said Australia would become a \"top-tier choice\" for skilled migrant workers if changes were made.\n\n\n\n\n\nThese included \"rapid visa approvals, recognition of qualifications, partner work rights, and a transparent route to permanent residency\".\n\n\n\n\n\n\"Australia is in a unique time zone, bridging the US and Asia, with world-class universities and a trusted regulatory environment,\" she said.\n\n\n\n\n\n\"If we pair that with targeted skilled migration, we can scale globally competitive product companies from here, especially in areas like HR and workplace tech and AI applications for real-world industries.\"\n\n\n\n\n\nSeymour said Deputy had seen \"firsthand\" how the right engineering, data, and product talent all contribute to productivity and revenue growth.\n\n\n\n\n\n\"Technology is now Australia’s third-largest industry, and with AI transforming every sector of the economy, the opportunity is bigger than ever … we just need to move fast enough to capture the full opportunity in front of us.\"\n\n\n\n\n\n'I don't think we're going to become the new Silicon Valley'\n\nBut senior lecturer in migration policy at the University of Sydney, Anna Boucher, questioned whether H-1B candidates, who could \"go anywhere in the world\", would choose Australia as their destination.\n\n\n\n\n\n\"We don't have as large an intake into our skilled immigration program. And I guess more importantly, we're not really seen as a global tech centre yet,\" she said.\n\n\n\n\n\nShe said it was also about having adequate infrastructure to support opportunities.\n\n\n\n\n\n\"Whether we have that pipeline in place to suddenly accept all these super-talented former H-1B visa holders, I'm not sure. I don't think it's just an immigration issue though. Arguably, there would be capacity, but we just don't have a tech-focused visa in Australia.\"\n\n\n\n\n\nBoucher said findings from a 2019 study on migrant interests and motivations found Australia had some draw-cards for potential skilled workers outside of its visa system, including that it was less expensive and had good weather in comparison to the US.\n\n\n\n\"I mean, they sound ridiculous, but these are the kinds of things, based on my study, that migrants are interested in,\" she said.\n\n\n\n\n\n\"We have great weather, we have pretty good schools.\"\n\n\n\n\n\nShe said since 2019, things had shifted, meaning Australia's democracy itself may have become an enticing factor.\n\n\n\n\n\n\"Maybe that security is what's become important, as there are fewer democracies in the world,\" she said.\n\n\n\n\n\n\"These are things that motivate migrants, but the US has always been such a centre of migration that I would not be surprised if big tech just take the hit, because for them the benefits of this skilled labour far outweigh the price.\n\n\n\n\n\n\"No doubt this price point has been picked for a reason, it's what the Trump administration believes they can get away with.\n\n\n\n\n\n\"I don't think we're going to become the new Silicon Valley.\"\n\n\n\nIssues for migrants\n\nYaser Naseri mentors migrant and refugee workers struggling to find work that matches their skill set in Australia.\n\n\n\n\n\nHe told SBS News that when he arrived in the country, his qualification in industrial electricity was invalid, and even after re-skilling at university, he found it difficult to find work that matched his skill set.\n\n\n\n\n\n\"I sent around 90 applications and I got a handful of interviews only, so that was really surprising. I thought it would be much easier,\" he said.\n\n\n\n\n\nHe mentioned that Australian employers tend to place a lot of importance on local experience, which made it difficult for people coming to the country for career opportunities to find adequate work.\n\n\n\n\n\n\"It's like starting from scratch,\" he said.\n\n\n\n\"Although you have experience and qualifications, you have to learn how to navigate the system, how to build your network, how you approach hiring managers and how you present and sell yourself. There are big challenges — lack of knowledge, cultural differences, lack of language — all at play here.\"\n\n\n\n\n\nRecent analysis has revealed a gap between Australia's demand for skilled workers and their ability to integrate into appropriate roles once here.\n\n\n\n\n\nAccording to a report commissioned by Settlement Services International (SSI), more than 500,000 migrant workers already in Australia are working below their skill level.\n\n\n\n\n\nSSI CEO Violet Roumeliotis said Australia’s migration program was designed to attract international talent, particularly to address national skills shortages, but the research showed that more than 621,000 migrants were unable to work to their full potential.\n\n\n\n\n\nThe report found every state and territory would benefit financially if migrant workers were able to access appropriate job outcomes, with the report's authors estimating Australia's economy could be losing $9 billion per year.\n\n\n\nBut Rizvi said he doubted whether those issues were likely to affect skilled workers sought out by Australian companies.\n\n\n\n\n\n\"Potential H-1B workers are not the group who would be struggling to get their skills recognised in Australia,\" he said.\n\n\n\n\n\n\"The group that is struggling to get their skills recognised in Australia tend to be skilled migrants who have come either through the family stream or as secondary applicants in the skill stream or as humanitarian entrants.\n\n\n\n\n\n\"They face the biggest barriers in getting their skills recognised, and there the range of issues are multiple.\"\n\n\n\n\n\nRizvi said the challenge really lies with the tech sector to make use of Australia's skilled migrant visa pathways.\n\n\n\n\n\n\"This is certainly an opportunity and I think the question really should be put to the Australian industry, the big, the big tech players in Australia, are they going to target these people?\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/researchers-design-safer-solutions-for-sharing-the-water-with-sharks/vh5q6n798",
        "title": "Researchers design safer solutions for sharing the water with sharks",
        "publish_date": "Thu, 25 Sep 2025 09:28:21 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Researchers design safer solutions for sharing the water with sharks\n\nPublished 25 September 2025, 8:01 am\n\nWhile shark attacks are rare, when they do happen, the injuries can be fatal. New Australian research has found wetsuits made with bite-resistant materials can dramatically reduce the severity of life-threatening wounds.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/industries-at-risk-of-technology-and-ai-big-dividend-day/1op2dgni7",
        "title": "Industries at risk of technology and AI & big dividend day",
        "publish_date": "Thu, 25 Sep 2025 08:27:41 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/special-episode-palestine-recognition-trump-unfiltered-paracetamol-panic/tnptxg0lk",
        "title": "Special Episode: Palestine recognition, Trump unfiltered & paracetamol panic",
        "publish_date": "Thu, 25 Sep 2025 07:22:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/tga-approves-alzheimers-drug-for-use-in-australia/3ebn6rgu9",
        "title": "It's 'third time lucky' for an Alzheimer's drug. But many Australians like Peter will miss out",
        "publish_date": "Thu, 25 Sep 2025 05:53:19 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A newly-approved Alzheimer's drug could help tens of thousands of Australians with the condition, but most people won't have access to the \"incredibly important\" medicine.\n\n\n\n\n\nLacenamab, which has the brand name Leqembi, has been approved by the Therapeutic Goods Administration (TGA) for use by some patients with mild cognitive impairment.\n\n\n\n\n\nIt is shown to reduce a plaque in the brain called amyloid, which contributes to Alzheimer's symptoms, but carries a minor risk of swelling or bleeding on the brain.\n\n\n\n\n\nThere are about 425,000 people in Australia living with dementia, according to the Australian Institute of Health and Welfare (AIHW), which the degenerative brain disease, Alzheimer's disease, being the most common form.\n\n\n\n\n\nDementia is also a leading causes of death in Australia , the AIHW recently found.\n\n\n\n'Shattered' by diagnosis\n\nRetired police officer Peter Duclos was diagnosed with the condition in 2024.\n\n\n\n\n\n\"I felt things weren't quite right … I was forgetful and just wasn't feeling like me,\" he told SBS News.\n\n\n\n\n\n\"I used to love photography, but now I've lost those skills.\n\n\n\n\n\n\"You think you're great one day and then the next day you think: 'oh God, how do I do this again?'\"\n\n\n\nAfter seeing his GP and getting several scans, he was given his diagnosis of younger-onset Alzheimer’s disease.\n\n\n\n\n\nHe felt \"shattered\" and reached out to peak advocacy group Dementia Australia for support.\n\n\n\n\n\nAfter taking a course with the group, he started volunteering as a peer support person for other people living with Alzheimer's and dementia.\n\n\n\n\n\nHe said the approval of lecanemeb could help many people with the illness, but it's too late for him.\n\n\n\n\n\n\"I might be a bit further along with it [Alzheimer's] that can be beneficial for me now,\" he said.\n\n\n\nPeter Duclos lives on Sydney's northern beaches with family. Source: Supplied / Peter Duclos. He also said the cost would be prohibitive for most people with Alzheimer's.\n\n\n\n\n\nLecanemab has an estimated cost of $40,000 for a treatment cycle of between 12 and 18 months.\n\n\n\n\n\nAdditional health costs will take the price per patient up to around $80,000 to $100,000, depending on individual needs.\n\n\n\n\n\nThe drug's cost could be decreased if the government decides to subsidise it through the Pharmaceutical Benefits Scheme (PBS); however, it has not placed donanemab (sold as Kisunla), a comparable Alzheimer's drug approved earlier this year, on the scheme.\n\n\n\n'Well-deserved' approval\n\nChristopher Rowe, the director of the Australian Dementia Network, said the approval of lecanemab as a treatment is \"well deserved\", after its parent company failed twice to get the green light from the TGA.\n\n\n\n\n\n\"It's third time lucky and Australia is a little late to the party. It's already been approved in 51 countries. So I'm glad to see it finally happened here,\" he told SBS News.\n\n\n\n\n\n\"The fact that they approved donanemab, which has very similar effectiveness and side effects to lecanemab, could have impacted their decision.\"\n\n\n\n\n\nIn a statement released this week, the TGA said the Japanese drug manufacturer Eisai Australia has \"satisfactorily addressed the outstanding concerns regarding the safety of the medicine\".\n\n\n\n\n\nThere have been concerns that the drug can have fatal consequences in around 0.6 per cent of people, as shown in a long-running UK trial of lecanemeb .\n\n\n\nBoth lecanemab and donanemab target a brain plaque called amyloid, which builds up over 10 years, according to Rowe.\n\n\n\n\n\n\"You've got to be picked up, diagnosed, and treated early for the drugs to work. It's because this takes amyloid out of the brain, but it doesn't affect what's called tau tangles,\" he said.\n\n\n\n\n\n\"Tau tangles [abnormal accumulations of a protein called tau in brain cells] really do the damage. If you've already got tau tangles, then removing amyloid doesn't show any benefit.\"\n\n\n\n\n\nHe said lecanemab can extend people's quality of life and autonomy by around six months, allowing people to keep doing everyday tasks like grocery shopping.\n\n\n\nEarly diagnosis and cost a barrier\n\nBut there are two main issues still to address.\n\n\n\n\n\n\"Issue number one, you've got to get people very early in the disease. So most people won't qualify for this treatment,\" Rowe said.\n\n\n\n\n\n\"Issue number two is the cost at the moment; it's only available in private, and the drug itself costs around $40,000. But you've got other costs on top of that, which probably build up to about 80,000 in total.\n\n\n\n\n\n\"Without PBS coverage, this is a real impediment for a majority of the population.\"\n\n\n\n\n\nProfessor Michael Woodwood, the head of dementia research at Austin Health, and an honorary advisor to Dementia Australia, told SBS News the approval is \"incredibly important.\"\n\n\n\nREAD MORE Two new dementia risk factors identified — and what could help prevent or delay its onset\n\nHe said the introduction of lecanemab could incentivise more people to seek a diagnosis for Alzheimer's sooner.\n\n\n\n\n\n\"There's a lot of fear around getting a diagnosis, and at this stage, the vast majority of cases are not actually diagnosed. I think that the availability of these drugs will change that,\" he said.\n\n\n\n\n\nBut the drugs won't change health outcomes for people in isolation.\n\n\n\n\n\n\"We need to have a health system that's ready to adapt to the increased number of people wanting a diagnosis,\" he said.\n\n\n\n\n\n\"It's also important that the people still access all the other support services, the services of Dementia Australia, that they're aware of brain health, which includes exercise, diet, social mental activity, reducing cigarette smoking, et cetera.\"\n\n\n\nA 'new era' for Alzheimer's treatment worldwide\n\nLecanemab and donanemab approvals are increasing success rates in Alzheimer's treatment, according to global research published in the medical journal The Lancet this week.\n\n\n\n\n\nAlzheimer's disease accounts for about 70 per cent of all dementia cases worldwide, and scientists say there's more that can be done in caring for patients.\n\n\n\n\n\n\"Blood tests, biological drugs for Alzheimer's disease, and prevention interventions are propelling care into entirely new and exciting territory. However, the old needs of patients will not disappear,\" Professor Giovanni Frisoni from the University of Geneva said.\n\n\n\nHe said there needs to be a concerted effort to support current and future patients.\n\n\n\n\n\n\"More general practitioners and dementia specialists will need to master the less glamorous but steady advances made in the past few decades in the care and treatment of behavioural disorders, the use of sophisticated diagnostic imaging and laboratory tools, and psychosocial care.\"\n\n\n\n\n\nMeanwhile, Duclos is part of a clinical trial for another drug and receives monthly transfusions as part of the testing.\n\n\n\n\n\nHe is hopeful that drug trials both in Australia and overseas will improve treatment options for Alzheimer's.\n\n\n\n\n\n\"We really need to get the government on board and have money spent in the right places for the right reasons. \"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/our-cathy-my-mums-part-in-olympic-glory/o4v5o9e5d",
        "title": "'Thanks for waking me up': Untold story behind Cathy Freeman's Olympic glory",
        "publish_date": "Thu, 25 Sep 2025 05:06:08 +0000",
        "category": "sports",
        "authors": [],
        "text": "For my family, the story of Cathy Freeman's Sydney Olympic gold medal started 15 years before that historic night at Homebush Bay on 25 September 2000.\n\n\n\n\n\nThe year was 1985. I remember it well. It was my final year of school in Canberra, and Aussie rock icon Jimmy Barnes had just released For the Working Class Man, an album that I blared on high rotation. I was living with my parents in south Canberra.\n\n\n\n\n\nBack then, the national capital was the beating heart of elite sport, home to the Australian Institute of Sport (AIS). Promising athletes from across the country came to Canberra to build the foundations of international success. That year, the AIS invited a 12-year-old Cathy to be assessed for her athletic ability.\n\n\n\n\n\nRather than stay in the AIS dormitories, Cathy was placed with us at the suggestion of a mutual family friend. The idea was to provide her with a family environment — and importantly, an Aboriginal family environment — during her stay.\n\n\n\n\n\nShe was very young, very skinny, shy, and freezing. Canberra's winters are tough for anyone, but especially for a young Murri girl from Mackay in north Queensland.\n\n\n\nEach morning, Cathy was picked up and driven across the city for training and testing, before being dropped off at home at night.\n\n\n\n\n\nAs the days wore on, the cold, fatigue, and relentless training took their toll. Cathy would come home exhausted, eat, and fall straight into bed. Sometimes not even eat. She was homesick and often made calls back to her mum. For two weeks, it was rinse and repeat. Every morning, my mum would have to wake her with a soft call from the bedroom door, or sometimes a gentle shake.\n\n\n\n\n\nAs Cathy's career blossomed — from school athletics to nationals, Commonwealth Games, World Championships, and ultimately the Olympics — my mum would often call me and proudly claim her part in Cathy's success.\n\n\n\n\n\n\"If I didn't wake her up, there'd be no gold medals,\" she would joke.\n\n\n\nMum followed Cathy's career sparkle with enormous pride.\n\n\n\n\n\nAt the Sydney Olympics in 2000, I stood among tens of thousands of other Australians at Tumbalong Park in Darling Harbour, watching Cathy's 400m final on a giant projection screen.\n\n\n\n\n\nThe starter's gun fired. Silence turned to thunder as the crowd roared her down the back straight. Cathy rounded the bend in third place, then exploded into the lead, powering through the home straight to stop the clock at 49.11. She crossed the line, collapsed, and a nation exhaled in unprecedented joy — Cathy in relief.\n\n\n\n\n\nAs the live site erupted, my phone rang. It was my mum, calling from 1,800km away in far north Queensland.\n\n\n\n\n\n\"She's won! She's won!\" mum cried down the line.\n\n\n\n\n\n\"Our Cathy — our baby — has won!\"\n\n\n\nJohn-Paul Janke and his mum, who followed Cathy Freeman's career with enormous pride. Source: Supplied After 2000, whenever I saw Cathy at events, I'd share this story with her.\n\n\n\n\n\nI told her how mum always joked that without her morning wake-ups, there'd be no Olympic gold.\n\n\n\n\n\nIn 2003, at her first book launch, I bought a copy for mum. Cathy and I laughed together as I asked her to sign it.\n\n\n\n\n\nAs I walked away, I flipped open the cover to see what she had written: \"Joanna, thanks for waking me up. Love, Cathy.\"\n\n\n\n\n\nNow in her early 80s, mum still calls her \"our Cathy\".\n\n\n\n\n\nAnd since that September night 25 years ago, so too does the nation.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/greenlandic-girls-as-young-as-12-were-forcibly-fitted-with-iuds-denmark-just-apologised/8vpyoef0x",
        "title": "Greenlandic girls as young as 12 were forcibly fitted with IUDs. Denmark just apologised",
        "publish_date": "Thu, 25 Sep 2025 02:57:11 +0000",
        "category": "finance",
        "authors": [],
        "text": "Denmark's prime minister has apologised to women who were victims of a decades-long involuntary birth control campaign, which has left islanders with deep scars and strained relations with their former colonial power.\n\n\n\n\n\nThousands of women and girls as young as 12 were fitted with intrauterine devices (IUDs) without their knowledge or consent between 1966 and 1991, the year Greenland was given authority over its healthcare system.\n\n\n\n\n\n\"I don't believe we can achieve the more equal and proper relationship that many of us desire unless we dare opening even the darkest chapters,\" Denmark's Prime Minister Mette Frederiksen, dressed all in black, said at a ceremony in Greenland's capital Nuuk.\n\n\n\nBetween the late 1960s and 1992, Danish authorities aimed to reduce the Inuit birth rate by forcing around 4,500 women to wear an intrauterine device without their consent. Source: AP / Mads Claus Rasmussen The ceremony marks another step in Denmark's accelerated efforts to repair ties with Greenland, following United States President Donald Trump's recent vows to assert control over the vast, resource-rich Arctic island for security reasons.\n\n\n\n\n\n\"Therefore, the apology I offer today is not only about the past. It is also about our present and our future. About the mutual trust that must exist between us,\" Frederiksen told victims, some of whom wiped tears from their faces.\n\n\n\nPhysical and psychological scars\n\nAn investigation this month showed 4,070 women had been fitted with IUDs by the end of 1970 — roughly every second Greenlandic-born woman of childbearing age.\n\n\n\nA large number of women reported debilitating abdominal pain and many have not been able to have children even after their device was removed, often due to severe infections.\n\n\n\n\n\n\"Receiving an apology does not mean that we accept what has happened. We are here today because we do not accept what has happened,\" Greenland's Prime Minister Jens-Frederik Nielsen, who also wore black.\n\n\n\n\n\n\"But it is up to all of us to take the next steps,\" Nielsen said.\n\n\n\nNaja Lyberth, who leads a group of women that last year sought legal compensation from Denmark over the campaign, thanked Frederiksen for her apology, saying it created space for Greenlanders to work through their shared trauma.\n\n\n\n\n\n\"The state has now emphasised that we are equal souls within the Danish realm,\" said Lyberth, who herself got an IUD aged 14.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/afl-grand-final-parade-2025-live-blog-geelong-vs-brisbane-start-time-mcg-melbourne-park-oval-20250926-p5my2j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL grand final parade LIVE: Fagan refuses to rule out starting Neale as sub as fans flock to parade",
        "publish_date": "Fri, 26 Sep 2025 11:54:15 +1000",
        "category": "sports",
        "authors": [
            "Andrew Wu",
            "Marc Mcgowan"
        ],
        "text": "Geelong’s dual premiership coach Chris Scott says Bailey Smith’s arrival has not only positively impacted their on-field fortunes but changed their personality dynamics.\n\nThe rock-star midfielder, who boasts the biggest social media following of any AFL player, finished third in the Brownlow Medal and has transformed the Cats’ on-ball brigade into one of the best in the league.\n\nPatrick Dangerfield, Bailey Smith, and Dangerfield’s kids. Credit: Getty Images\n\nSmith has delivered his share of controversy along the way, too, most recently his tirade at a female photographer at training, but Scott has relished bringing him into the club.\n\n“I think we, to an extent, knew that he was going to change us in a lot of ways,” Scott said.\n\n“Without giving away too much about the way our football department works; I would describe the group of players, even if you think back to ’22 for a minute … if you know them, they’re a big group of introverts within that team. Bailey’s not one of them now, but the players have really embraced him.”\n\nScott said Smith had made a big impression on everyone at Geelong, including himself. Cats rising star Ollie Dempsey is another.\n\nOllie Dempsey and Mark Blicavs Credit: Eddie Jim\n\nThe hard-running wingman did not know Smith, but knew he was joining Geelong, when he replied “next year brother” to the ex-Bulldog’s grand final-related Instagram post last year: “Be out there one day.”\n\n“It was a bit of a joke back then. I didn’t actually know him. I hadn’t met him yet at that stage,” Dempsey said.\n\n“I was at the grand final myself, and I thought it’d be funny, me and my mate, to say that, and it got a lot of attention, which I should have expected, but it was pretty funny.\n\n“We talked about it earlier in the year that it’d be pretty cool if we did make it, and to repost it.\n\n“He’s been great. He’s a great teammate. Obviously, you’ve seen what he’s done on the field, but not only on the field, he’s been really good off the field for me, personally, and for the rest of the team. He brings a great energy and spark for us.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/the-sound-that-convinced-sam-kerr-her-return-from-injury-was-complete-20250926-p5my3k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The sound that convinced Sam Kerr her return from injury was complete",
        "publish_date": "Fri, 26 Sep 2025 11:52:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "“I just wanted to get on the pitch. I hated that I knew everyone was [talking about me]. I knew the commentators were talking about it. I knew that everyone was talking about it. And I was like, this should have been like a year ago, but whatever.” What came after that was even better: a goal, in the third minute of stoppage time, to help seal a 3-1 victory. Scrappy as it was, it won’t find a home on Kerr’s highlight reel - unlike the “out of body experience” of scoring that goal against England at the 2023 Women’s World Cup - but it was momentous all the same, and not just because it was her 100th for the club. Sam Kerr enters the fray after … well, too long on the sidelines. Credit: Getty Images “I was relieved, and just kind of like, laughing,” she said. “And I think like the response that the girls gave me was really nice and melted my heart … [and] I just wanted to thank the Chelsea fans, because throughout these last few months, they’ve been so supportive of me. Some of them probably lost a little bit of faith in, like, me or forgot what I could do on the pitch.\n\n“I’ve had so many people over the last year say, ‘Oh, she’ll never get back to what she was.’ Loading “It felt nice to be able to remind people. I don’t even need a whole game. I can score an important goal in 20 minutes, whether it’s my first game back or not.” The comeback trail for Kerr was about twice as long as it should be for an ACL injury; it was a “pretty crap” experience, she said, but one that was put into perspective by the arrival of her first child, Jagger, with partner Kristie. “It wasn’t like I was sitting off the park, and I was training and having a great old time. It was doctor’s appointment after doctor appointment, flying here, flying there, trying to fix my knee,” she said.\n\nLoading “I felt like every time … say I had six good weeks, then I’d have two really bad weeks. I had maybe like seven or eight setbacks. Especially when it got to the pointy end of [ast] season, it’s tough to not be involved in those games. As a competitor, you just want to be out there, and you just want to show people what you’re made of. And that was really hard for me. “The good part of it was you play football for so long, you kind of think it’s your identity and it’s who you are. But with the time off, I got to spend more time with Kristie. We got to go home, see my family. We had Jags. So there was things that happened that really kept me going. Now I have a different look on football, and I don’t hang so much of my life on it, I guess.” Kerr turned 32 earlier this month, and though that might suggest she’s in the twilight of her career, she insists that she’s not. The impending Women’s Asian Cup in Australia gives her another marquee event on home soil to look forward to, but her outlook stretches well beyond that, and even the next World Cup in 2027. In a recent interview with Nine, she said she has “way more in my locker than one more” World Cup - but when the time comes that she does retire, a career as a coach could beckon.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/the-stories-behind-the-migrant-matriarchs-who-helped-shape-wa-20250925-p5mxzo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The stories behind the migrant matriarchs who helped shape WA",
        "publish_date": "Fri, 26 Sep 2025 11:47:51 +1000",
        "category": "entertainment",
        "authors": [
            "Cameron Myles"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Vittoria Melia remembers vividly the sight of Rottnest Island heralding the end of her 22-day journey from Bivongi, Calabria to Fremantle in 1963. The trip was long and her daughter, Claudia, had been sick. When Claudia’s father came to greet them at the port, having left for Australia some nine or 10 months earlier, Claudia – then about two years old – wasn’t sure who he was. Vittoria and Claudia Melia in front of a photo of themselves (Claudia being carried, front, with Vittoria walking behind) at the entrance to the From Nonna With Love exhibition. Credit: Cameron Myles “I didn’t remember him, and I would have been scared,” Claudia says. “So I have no memory, really of the actual day we arrived, and I don’t have any memory of the voyage, but mum says that I was sick for the whole time.” “She was seasick the whole way,” Vittoria says. “[I’d say], ‘let’s go to the lounge’ – ‘no mum, it’s poisoned, the food’, so we lost weight on the ship, because I didn’t have any good lunch or dinner, and we had a little baby.”\n\nAdvertisement\n\nBut Vittoria wasted no time after landing, straight off to a wedding that night where they were introduced to Perth’s growing Italian community. “And I find everybody from the Bivongi at that wedding, it was an Italian wedding,” Vittoria laughs. A photo of Vittoria and Claudia at the end of their journey adorns the entrance to the latest exhibition to open at the WA Maritime Museum. From Nonna with Love: Stories of Tradition and Triumph charts the tales of the Italian migrants who came to Western Australia between the early 1900s to the 1970s – and, more specifically, the matriarchs who became the backbones of those communities which helped shape the identity of Perth, Fremantle, and the broader state. Ahead of its time: Anne Ferrari, left, with an early coffee roasting machine. The exhibition opens on Saturday, but many of the nonnas featured, and their families, got an early look on Wednesday during a tour with curator Nella Fitzgerald. Among the personal stories told through more than 100 objects on display are famous names in sport, politics – and food.\n\nAdvertisement\n\nAnne Ferrari, whose father John Re was behind Northbridge’s famous The Re Store, tells this masthead of the early days of selling coffee roasted and ground in-store – ahead of its time, given the espresso-driven cafe culture which later flourished in Perth. Maria Pizzale – the owner of classic Fremantle Italian restaurant Capri – has her story told in the exhibition. Capri Restaurant owner Maria Pizzale and daughter Carla Caravella. Credit: Cameron Myles Pizzale and her husband Corrado took over the restaurant from Corrado’s father Oddone in the 1960s, and it has remained a testament to traditional Italian cooking on the port city’s cafe strip ever since, its offering largely unchanged except for a recent move to serve alcohol after 71 years of BYO. Pizzale’s daughter, Carla Caravella, was overcome with emotion when she first saw the display. “Mrs Ferrari and mum lived a different life, because they were working, they were in the businesses working, and they worked long, hard hours, and so they weren’t in the community socializing quite as much,” Caravella says. “I don’t have time to have friends,” Pizzale laughs.\n\nAdvertisement\n\n“I was too busy, and I raised four children in the Capri Restaurant.” “This has brought so much emotion forward, because it is such an important part of our history … and it honours all these ladies who are part of this exhibition, because they’ve always been in the background, quietly, just keeping everything going,” Caravella says. Tony Ricciardello with his wife Carla, children, and mother Maria Ricciardello. Championship-winning Sports Sedan racer Tony Ricciardello was taken aback by the exhibition charting the accomplishments of his mum Maria Ricciardello alongside his father Basil. “There’s a lot of emotions happening,” he says. “We’ve worked together with Nella for quite a few months, putting this together. “And dad was in the background with me doing it, and he passed away in November, so he didn’t get to see the finished product of something that they both created.”\n\nAdvertisement\n\nMaria was always in the background of Tony’s accomplished racing career, described as “the core of the family that kept everyone strong and healthy”. “That was our picnic for the weekend, we went motor racing as a family; mum was always in the kitchen, cooking the food for the pit crew and the team,” he says. “And you know, dad was always demanding, not the sausage rolls and stuff – it was pasta and risotto for the pit crew.” The Ricciardellos aren’t the only famous motorsport family to have links to early Italian migration to Perth; Giuseppina Ricciardo – nonna of F1 driver Daniel Ricciardo – has an exhibit dedicated to her. The motivation for From Nonna With Love came from conversations Fitzgerald had with her mother about life in Italy during World War II, and the decision to migrate to Australia. “It’s a tribute to my mother, Angela. But in that tribute, is a tribute to every Nonna and great biznona that is here, both in Italy, Australia and around the world,” she says. “It also tells the story of extraordinary Italian women who migrated here to Australia … it tells their stories of perseverance, belief and the love that they had to build a family and a wonderful future here for them.”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/why-the-first-play-of-the-bledisloe-cup-could-tell-us-all-we-need-to-know-20250926-p5my2k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Why the first play of the Bledisloe Cup could tell us all we need to know",
        "publish_date": "Fri, 26 Sep 2025 11:45:00 +1000",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "If the Wallabies kick off against the All Blacks at Eden Park, it would not be a surprise if they take a leaf out of the Springboks’ playbook.\n\nIn Wellington two weeks ago, South Africa went high and straight down the middle from the kickoff, inviting their fullback Aphelele Fassi to try and regain possession, which he promptly did.\n\nIt was a statement of intent from the Springboks, and the Wallabies look set up to play with the same level of ambition.\n\nSome of coach Joe Schmidt’s selections were borne out of necessity, with Andrew Kellaway suffering a calf injury and Jake Gordon presumably not quite at his sharpest after a hamstring injury, but the net effect is a Wallabies team that is packed with both risk and reward.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/you-better-put-him-back-in-the-hunch-that-delivered-penrith-a-modern-day-great-20250925-p5mxwm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘You better put him back in’: The hunch that delivered Penrith a modern-day great",
        "publish_date": "Fri, 26 Sep 2025 11:44:00 +1000",
        "category": "sports",
        "authors": [
            "Christian Nicolussi"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Had long-serving Penrith recruitment manager Jim Jones not gone to the country NSW town of Forbes one autumn morning more than a decade ago, he is convinced Isaah Yeo would have never been discovered. “There’s a good chance he could have been playing for the Dubbo CYMS in the local A-grade comp – not chasing a possible fifth NRL premiership with the Panthers,” Jones said. In a classic sliding doors moment, Jones revealed the day he attended Red Bend Catholic College to watch trials for the Southern Country team. The best 17 players from that day would head to Sydney to try their luck at making the NSW Combined Catholic Colleges team. Selectors spotted Jones and asked him to help with proceedings. He initially told them he was there as a fan. “But I was glad I was there in the end because the teachers were never going to pick ‘Yeoy’,” Jones said.\n\nAdvertisement\n\nPenrith on-field leader Isaah Yeo. Credit: Getty Images “Every recruitment officer gets a hunch. I had a hunch with him. “I don’t know what would have happened had I not been there. Who knows, maybe Yeoy would have still been playing in Dubbo. “He was on the bench for his team. He was wearing the No.14. But he was tall, mobile, tough, and skilful. “The selectors asked me at the end of the day what I thought. They were like, ‘What about this fella?’, and I was like, ‘Yep’, then I asked, ‘What happened to the No.14?’. They said, ‘We didn’t pick him’. I said, ‘You better put him back in’. He was the only bloke I liked all day.” Yeo made the cut and went to Sydney, but missed out on the NSW CCC team. He remained on Jones’ radar and was later signed by Penrith.\n\nAdvertisement\n\nJones had similar “hunches” with Panthers fullback Dylan Edwards, and even Liam Martin, two of Yeo’s teammates who will feature in Sunday’s preliminary final against the Broncos. There were also a couple of players Jones missed, like the day he was sent to the Confraternity Carnival, a popular schoolboys tournament in Queensland, in the early 1990s, with the simple instruction of landing one signature. He wanted two and begged Phil Gould, who was then working with the Panthers, only to be told to stick with one. Wendell Sailor is one who ‘got away’ from the Panthers. Credit: Getty Images “I signed a fullback, Butch Fatnowna, who was brilliant,” Jones said. “But he broke his ankle, and by the time he was ready to come down to Sydney, he had put on a bit of weight. “Gus was into me about it, but I said, ‘you wouldn’t let me sign two’. That second player I wanted was Wendell Sailor.”\n\nAdvertisement\n\nSailor went on to win premierships with the Broncos and became a dual international. Isaah Yeo doing the hard work earlier this year. Credit: Getty Images “I still have a picture on the wall in my office of Wendell with the message, ‘thanks for not picking me, Jimmy’,” Jones said. Yeo’s father, Justin, recalled his boy “being OK, but never a standout, and certainly never the first kid picked”. “He was a bit like he is now, always strong, with little difference between his best game and worst game,” Yeo snr said. “Most of the time, he looked like another player. I remember he was playing SG Ball, and Ivan Cleary walked into the box at the very moment Isaah made a break and did something special. The coaches told Ivan, ‘that’s Isaah Yeo’. Isaah Yeo led the Kangaroos at last year’s Pacific Championships. Credit: Getty Images\n\nAdvertisement\n\n“You often wonder if things would have been different had Ivan not walked into the box at that very moment, or looked up to see what Isaah was doing at that exact time. “I teach at a school in Mudgee, and I still tell the kids how you need to make the most of every moment and opportunity; if you get an opportunity, it’s up to you what you do with it.” The kid wearing the No.14 jersey that day in 2012 – and who made a break when Cleary took a peek – has become one of the most influential forwards in the game. The attributes he provides are a large part of the reason Penrith can defeat Brisbane and give themselves a shot at five straight premierships next Sunday. Yeo is admired on both sides of the border, with Cameron Smith – the Melbourne, Queensland, and Australian legend who finished with 430 NRL games – praising the 30-year-old’s durability. “When you look at his last five years, Isaah has barely missed a game of footy,” Smith said.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/mayday-qantas-flight-issues-emergency-call-over-tasman-sea-20250926-p5my5q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Mayday’: Qantas flight issues emergency call over Tasman Sea",
        "publish_date": "Fri, 26 Sep 2025 11:39:58 +1000",
        "category": "finance",
        "authors": [
            "Daniel Lo Surdo"
        ],
        "text": "A Qantas plane has landed safely at Auckland International Airport after issuing a Mayday call over the Tasman Sea amid concerns about a potential fire in the cargo hold.\n\nThe Mayday call triggered a priority landing at Auckland Airport, local media report, with the plane landing safely as emergency response waited on the tarmac.\n\nEmergency vehicles at Auckland Airport on Friday. Credit: Nine News\n\nAmbulance staff have treated two passengers for minor conditions, while other paramedic crews have been stood down.\n\nQantas Flight 141 departed Sydney on Friday morning, and landed in Auckland just before midday (New Zealand time).",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/strawberry-ricotta-crostata-20250922-p5mx1e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Strawberry ricotta crostata",
        "publish_date": "Fri, 26 Sep 2025 11:32:23 +1000",
        "category": "finance",
        "authors": [
            "Helen Goh"
        ],
        "text": "Step 1 To make the pastry, put the flour, salt and baking powder in a food processor and pulse a few times to combine and aerate. Add the cold, cubed butter and pulse until the butter is in small pieces, then add the cream cheese. Pulse until incorporated – the crumbs will look damp and unevenly sized – and add the vinegar and 1 tablespoon of the cream. Pulse until the dough just starts to come together (add another tablespoon of cream if it doesn’t), then tip the pastry out onto a lightly floured surface. Gather and press the pastry into one piece, then wrap loosely in cling film. Press to flatten into a disc and refrigerate for at least 1 hour (and up to 2 days).\n\nStep 2 When the pastry is well rested and you’re ready to bake the crostata, prepare the ricotta base: put all the ingredients in a bowl and stir with a wooden spoon until fully combined, then refrigerate.\n\nStep 3 Prepare the strawberries by combining all the ingredients in a bowl and tossing gently. Set aside.\n\nStep 4 Preheat the oven to 190C fan-forced (210C conventional).\n\nStep 5 Remove the pastry from the fridge and place it on a large sheet of baking paper that has been lightly dusted with flour. Roll the pastry out evenly into a large circle (about 38-40cm wide and 2mm thick). Don’t worry if the edges are irregular: this is part of the charm of a crostata. Lift the baking paper and transfer it and the pastry onto a large baking tray.\n\nStep 6 Spread the ricotta mix evenly across the middle of the pastry, leaving a 4cm-5cm border.\n\nStep 7 Spoon the strawberries on top of the ricotta mix, drizzle over any of their juice, then carefully draw the pastry border up and over the fruit, roughly pleating it as you go and leaving the centre of the crostata exposed.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/the-economy/wi-fi-on-board-why-i-prefer-flying-without-it-20250918-p5mw2w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wi-Fi on board: Why I prefer flying without it",
        "publish_date": "Fri, 26 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Chris Zappone"
        ],
        "text": "In our wired world, the chance for waking, peaceful solitude is a rare and somewhat precious thing.\n\nFor many, one of the last places to find it is aboard a plane during a long flight. The cabin of an aircraft becomes a sanctuary – a personal space for thinking, writing, and quiet entertainment, detached from the demands of daily life.\n\nNo Wi-Fi here: How far you have to travel to not be bothered by an internet connection. Credit: Chris Zappone\n\nNow, in the name of progress, that sanctuary is at risk. The culprit: in-flight Wi-Fi.\n\nPart of the joy of flying has always been the freedom it offers – the solitude to work, to think, to just be, and to view at a distance life outside an endless stream of updates on screens.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/multiplex-s-250m-lawsuit-over-sydney-fish-market-as-bill-nears-1-25b-20250924-p5mxkq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Multiplex’s $250m lawsuit over Sydney Fish Market as bill nears $1.25b",
        "publish_date": "Fri, 26 Sep 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Harriet Alexander"
        ],
        "text": "Construction giant Multiplex is suing the NSW government over cost blowouts on the new Sydney Fish Market in a case that threatens to tip the total bill for the project to $1.25 billion and bankrupt the company that runs the markets.\n\nMultiplex has filed a $250 million lawsuit against Infrastructure NSW, which has brought a cross-claim against Sydney Fish Market for allegedly contributing to the cause of the action.\n\nThe new Sydney Fish Market is the subject of three-way legal action between the builder, the government and the head tenant. Credit: Sitthixay Ditthavong\n\nNeither the Sydney Fish Market nor Infrastructure NSW will commit to an opening date for the new site beyond saying that they expect partial completion to occur in November, “facilitating an opening prior to Christmas”.\n\nAccording to the market’s annual financial report, Multiplex is claiming that INSW breached its contract and mismanaged the construction of the new Sydney Fish Market on Blackwattle Bay.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/like-thousands-of-sydneysiders-jermaine-ran-a-marathon-last-month-but-he-didn-t-stop-20250924-p5mxle.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Like thousands of Sydneysiders, Jermaine ran a marathon last month. But he didn’t stop",
        "publish_date": "Fri, 26 Sep 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Mary Ward"
        ],
        "text": "Like tens of thousands of Sydneysiders, Jermaine Jones ran a marathon last month.\n\nBut, instead of finishing his race, posting a picture on Instagram, and taking the week off from the gym, the construction worker from Marrickville woke up the next morning and ran another marathon. Then he woke up the following day and did it again, and again, as he set out to complete 34 marathons in as many days.\n\nJermaine Jones is running 34 marathons around Centennial Park in as many days. Credit: Jessica Hromas\n\nAs he approaches his final run on Saturday, 37-year-old Jones has an injured right ankle and is dealing with significant bruising and swelling on his toes. But he seems unfussed.\n\n“It’s to be expected with this many marathons,” he said.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/it-s-so-sick-dangerfield-played-one-of-the-best-finals-on-record-then-the-real-performance-started-20250925-p5mxvv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘It’s so sick’: Dangerfield played one of the best finals on record, then the real performance started",
        "publish_date": "Fri, 26 Sep 2025 11:30:00 +1000",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "The football world has universally lauded Dangerfield, at age 35, for his spectacular display last week against Hawthorn, including 31 disposals, three goals, 20 contested possessions, 13 score involvements, nine inside 50s and six centre clearances. It was the highest-rating preliminary final performance since Champion Data started keeping records. Coach Chris Scott insisted afterwards that they don’t wrap the champion veteran in cotton wool and unleash him in September, but there must be some truth in that with his management in his 18th season. Dangerfield enhanced his legacy with a masterful performance in the Cats’ preliminary final win over Hawthorn. Credit: Getty Images The best-on-ground performance, which propelled Geelong into their seventh grand final since 2007, even triggered a discussion between his teammates about where “Pat” stacks up among the AFL’s modern giants. Max Holmes believes Dangerfield is “easily” inside the top five, while Shaun Mannagh has him on the podium – and joked that the man himself would probably place himself there, too.\n\nLoading “Gary Ablett jnr is a clear No.1, I’d say,” Holmes said. “I honestly want to put Patty second, but I know people scream that ‘Dusty’ [Dustin Martin] is better, and ‘Buddy’ [Lance Franklin] is up there as well. “It’s hard to rank those players, but I think ‘Danger’ is in that top five, for sure. He’s incredible to play alongside, and I guess that’s a perk of being at Geelong. There are stars everywhere who you can take a lot of wisdom from.” Bowes – who chose to join the Cats in large part because of Dangerfield’s involvement – agrees with Mannagh, pointing to his 359 games, eight All-Australian selections and four club champion awards across two clubs, as well as him winning the 2016 Brownlow Medal and playing in the 2022 premiership. “The only thing missing on his resume is being captain in a grand final and winning the premiership, so hopefully, we can tick that off for him,” Bowes said.\n\nEmerging midfielder Jhye Clark, the Cats’ super sub in the preliminary final, has a different measure for Dangerfield. After entering the match when Tom Stewart was concussed before quarter-time, Clark had a front-row seat to Dangerfield’s extraordinary feats. “It’s so sick. He’s one of a kind,” Clark said. Jhye Clark (left) celebrates Geelong’s preliminary final win with Dangerfield. Credit: Getty Images “He just runs straight through everyone, and when you watch him play – you just want to run through a brick wall. He’s so inspiring for the whole team, and I’d be very scared of playing against him.” Don’t mess with Danger’s play list\n\nShannon Neale was yet to make his AFL debut when he walked into the player gym at Kardinia Park one day in the 2022 pre-season. Zach Tuohy, Rhys Stanley and Dangerfield were already in there. Country music was blasting from the speakers, which a then-19-year-old Neale was unimpressed with before he made a mistake he will never forget. Dangerfield has formed a close bond with Shannon Neale (second from right) after an inauspicious start. Credit: Getty Images Without a moment of hesitation, the big forward from Perth pressed the “skip” button. “‘Don’t change the music! You can’t do that!’,” Dangerfield crossly told Neale, who initially laughed, thinking his reaction was a joke.\n\nLoading “But he said, ‘I’m dead serious’ and he’s got the finger pointing at me, and everything,” Neale recalled. “I walked out of the gym, and I almost left the club that afternoon. About 20 minutes later, he sends me a message, and he’s like, ‘Mate, I am extremely sorry, the [summer] heat got to me – it’s fine’. “It took me a couple of weeks to look him in the eyes again. He wasn’t the captain at the time, but obviously, he’s a leader. He’s such a figure. It’s Patrick Dangerfield. Anything that happens like that; you think you’re done.” Neale sheepishly shared the Dangerfield story, which he thinks might get him in trouble, but he wanted to make the point that it was a sliding doors moment for their relationship, which was limited at the time. They are only two lockers apart, now sit alongside one another in team meetings, and have formed a close bond.\n\n“I can ask him for advice, and I feel very comfortable approaching him about anything,” Neale said. “He’s super witty, and loves a laugh. I think he’s really enjoying his footy. He’s relaxed, and enjoying where he’s at, and certainly, our friendship has blossomed since that moment.” Another speaker-related Dangerfield story emerged last Friday night. It was all love between Shaun Mannagh and Dangerfield last week. Credit: AFL Photos The evergreen skipper was controlling the tunes again pre-match against the Hawks, but made the left-field choice of classical music. This time it wasn’t just Neale who took umbrage, prompting Dangerfield to relent and change to a different song, Kenny Loggins’ Danger Zone.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/life-and-relationships/mum-guilt-is-so-universal-it-inspired-the-name-of-my-company-20250925-p5mxy9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Mum guilt is so universal it inspired the name of my company",
        "publish_date": "Fri, 26 Sep 2025 11:30:00 +1000",
        "category": "lifestyle",
        "authors": [
            "Kate Halfpenny"
        ],
        "text": "My body felt weird that 1992 day. I’d had to get out of a taxi the night before, repelled by the smell of every passenger before me. My nipples felt like they were being sliced with razor blades when my bra touched them. I wanted to sleep and wear overalls.\n\nSurely, surely, I was pregnant. A home test. One line. Devastation. And confusion. Why, then, was I suddenly craving McDonald’s chicken burgers when I’d never eaten one before? Why was I peeing every 10 minutes?\n\nBeing pregnant is stressful enough without incorrect claims. Credit: iStock\n\nMy doctor took blood. Rang by the end of the day: no baby this month. Come back next week, we’ll work out what’s going on.\n\nAt home, a boiling bath topped up for hours until the bottle of red was gone. I sobbed my face off. Called for more wine.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/nrl-around-the-clubs-finals-week-three-20250922-p5mwud.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victor Radley withdraws from Ashes; Bulldogs in talks with Adam O’Brien",
        "publish_date": "Fri, 26 Sep 2025 11:26:12 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh",
            "Michael Chammas",
            "Roy Ward",
            "Billie Eder"
        ],
        "text": "While Wane won’t pick his England squad until mid-October, new Australian coach Kevin Walters will name his side the day after the NRL grand final, having received a significant boost in prop Tino Fa’asuamaleaui opting to represent the Kangaroos over Samoa. Walters has also confirmed Roosters flyer Mark Nawaqanitawase will be considered for an Ashes berth, with his decision to move back to rugby at the end of 2026 having no bearing on his selection chances. Bulldogs pursue ex-Knights coach Adam O’Brien to shake up attack Michael Chammas The Canterbury Bulldogs are in talks with former Newcastle coach Adam O’Brien about a role with the club next season.\n\nBulldogs officials met with O’Brien on Thursday to discuss the prospect of him becoming the club’s attack coach in 2026. Jason Taylor, who currently coaches the Dogs’ attack, still has another year to run on his contract and is expected to move to a new role if O’Brien signs. Manly have also shown interest in signing O’Brien as an assistant coach, but sources with knowledge of the situation talking on the condition of anonymity said O’Brien was leaning towards the Bulldogs. O’Brien spent a decade working as an assistant to Craig Bellamy at Melbourne and a season under Trent Robinson at the Roosters before being head-hunted for the Knights’ top job as Nathan Brown’s successor.\n\nThe Bulldogs believe O’Brien’s experience and knowledge can boost an attack that came under fire for large parts of 2025. Adam O’Brien pulled the pin after six years in charge of the Knights. Credit: Getty Images O’Brien has worked with Bulldogs Kurt Mann, Sitili Tupouniua and Enari Tuala, as well as new recruit Leo Thompson. Bellamy says Jahrome Hughes will play in preliminary final Roy Ward\n\nHe won’t have a Mal Meninga-size guard on his forearm but Melbourne Storm star Jahrome Hughes is set to play in the club’s preliminary final at AAMI Park on Friday night. Hughes fractured his forearm in the last round of the season and seemed long odds to be able to return in time for the finals. Mal Meninga, right, sports his armguard after winning the 1989 ARL grand final with Canberra. Credit: Getty Images But the reigning Dally M Medallist has recovered quicker than expected and Storm coach Craig Bellamy is confident Hughes will play on Friday night against Cronulla, unless any last-minute issues arise. Returning Hughes to the side will mean rising halfback Jonah Pezet will likely drop out after starring in their qualifying final win over Canterbury-Bankstown two weeks ago.\n\nUnless something flares up for Hughes, Bellamy said he would be running out against the Cronulla Sharks despite having not completed “a whole heap” of contact work. “He’s done enough to be confident in what he needs to do and what he is doing,” Bellamy said. “Something drastic would have to go wrong for him to miss.” Bellamy laughed when asked if Hughes would need a large guard Meninga wore for the Canberra Raiders in the 1990s when Bellamy was also on the team. Meninga’s oversized guard became the stuff of legend but wouldn’t be allowed anywhere near a footy field today.\n\n“I was at Canberra when Mal used to wear that guard and no one was game to near him at training in case you copped it,” Bellamy said with a laugh. “But Hughesy’s [guard] is a fair bit thinner than Mal’s was.” Storm star Jahrome Hughes trains with his new forearm guard on Thursday. Credit: Getty Images Bellamy also praised the toughness of second-rower Shawn Blore who will also return from a fractured larynx to play on Friday night. “That’s a pretty bad injury he got and he kept going in the game - he’s a pretty tough unit,” Bellamy said. “He was busting to get back. He kept ringing me and telling me that “I’m right, I’m right” but, obviously, I’m taking more advice from the medical people than him. We are confident he has recovered.”\n\nThe Storm thumped the Sharks 30-6 when they last met at AAMI Park in June but the Sharks have won nine games out of 10 since including knockout final wins over Sydney Roosters and minor premiers Canberra Raiders. So the Sharks will come in fired up as will a sellout crowd hoping to see the Storm progress to another grand final. “I don’t know who wrote them off. They finished fifth,” Bellamy said. “To beat the Roosters and then beat Canberra in Canberra - we know they are in good form, but we are just concerned with what we need to do and how we need to do it.” The Storm hammered the Sharks but it kick-started Cronulla’s season\n\nRoy Ward The last time Cronulla trudged off AAMI Park they were at their lowest point of the season. Since that 30-6 round 17 loss to the Storm, the Sharks have won nine of 10 games, including two knockout finals, and are now just one win away from the NRL grand final. The only problem is that the team standing between them and the NRL decider is the Storm, who they take on at AAMI Park in a preliminary final on Friday night.\n\nSharks playmaker Braydon Trindall remembers that night in June well, and how it galvanised his team to turn their season around. “I think we were all just sick of letting the year slip away from us,” Trindall recalled on Wednesday. “So we sat down and had a good talk about it and went out on the field and changed some of the actions that were hurting us. “I think it was more of a club thing and everyone wanted to put in a bit more, and now look where we are.” The Storm hammered the Sharks last time they met in Melbourne. Credit: Getty Images Trindall has carried an eye issue through recent games after taking a knock against the Sydney Roosters earlier in the finals, but while there is some visible blood, he said it had no impact on his vision.\n\n“I copped a boot against the Roosters, but it’s starting to heal now,” he said. The Storm have plenty of respect for Trindall’s kicking game and the threat it poses, but he knows accuracy is the key given the height and catching ability of Storm wingers Xavier Coates and Will Warbrick. “It’s good when you have some good chases on the end of the kick,” he said. “Will is a good leaper, so there will be a bit of a challenge there. It doesn’t really change things. I might shorten the kicks up a bit so they have to run a bit more, but we’ve got some good catches as well so I won’t change much.” Knights approach premiership-winning half to work as attack consultant Michael Chammas\n\nThe Newcastle Knights have reached out to three-time premiership-winning playmaker Luke Keary about a role with the club as an attack and halves consultant from next season. The Knights are in the process of restructuring their coaching staff and have made the bold move to approach the recently retired Catalans pivot to gauge his interest in joining the club. Former Roosters playmaker Luke Keary could be heading to Newcastle. Credit: NRL Photos Keary worked with both new coach Justin Holbrook and director of football Chris James at the Sydney Roosters and is highly regarded as one of the smartest players in rugby league. Keary, who spent this season with Catalans in the Super League after finishing his NRL career at the Sydney Roosters in 2024, is weighing up the opportunity.\n\nThe 33-year-old wants to spend the summer travelling with his young family but is said to be keen to discuss the opportunity to link with the Knights. Newcastle are keen to add some specialised coaches to their ranks and believe Keary would be a huge asset to help work with recruits Dylan Brown and Sandon Smith, as well as incumbents Fletcher Sharpe and Kalyn Ponga. Newcastle’s attack struggled to fire in 2025 under the guidance of attack coach Blake Green, who missed out on the job as Adam O’Brien’s successor to Holbrook. Keary doesn’t have a job lined up at the Sydney Roosters, who themselves will welcome back Jared Waerea-Hargreaves in an official capacity to work with the club’s younger players in 2026. Panthers duo shrug off injury worries ahead of Broncos showdown\n\nDan Walsh and Billie Eder Penrith’s Liam Martin and Casey McLean insist they will be fit to play in Sunday’s grand final qualifier against Brisbane after being forced from the field in the Panthers semi-final thumping of Canterbury. Martin was in obvious discomfort after he was tackled by former teammate Viliame Kikau, with the NSW and Kangaroos star staying down and struggling to breathe late in the contest. The 28-year-old came from the field and struggled to make his way up the Accor Stadium tunnel at one point, but he was in good spirits soon afterwards and said he was not concerned about any recurrence of a rib cartilage injury he carried through last year’s finals. “They’re all right now,” Martin said of his ribs after full-time. “There was a bit of carry-on there. It’s a bit sore at the moment, but they’re all right. I landed on the ball, and ‘Kiks’ is a pretty big man, and he landed on me. I was a bit winded, but I’m all right now.\n\nLiam Martin is helped from the field at Accor Stadium. Credit: Getty Images “It crossed my mind at first [that a serious injury may have occurred], but after a while I was like ‘it’s all right, I’m being a sook again’.” Martin won last year’s Clive Churchill medal against Melbourne despite playing through the pain of a popped rib cartilage in the 2024 grand final. Loading He also required painkilling injections for almost the entire season to manage an ongoing AC joint injury in his shoulder, which he has battled again in recent weeks.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/lions-rookies-plot-a-boilover-while-a-champion-is-poised-to-end-his-slump-20250925-p5mxug.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Lions rookies plot a boilover, while a champion is poised to end his slump",
        "publish_date": "Fri, 26 Sep 2025 11:14:55 +1000",
        "category": "sports",
        "authors": [
            "Nick Wright"
        ],
        "text": "“That’s going to be a challenge on the weekend, and how they can stand up at the end of the ball. It does help without Tom Stewart there – it’s unfortunate for Tom, but it does help as a Lions supporter, him not being there. “But Ty and Logan have done an amazing job as a couple of youngsters. We’ve got quite a diverse forward line, all of our guys can kick multiple goals.” Kai Lohmann has rediscovered his mojo at the right time. Credit: Getty Images Lohmann has success on the biggest stage, after his four goals in last year’s decider. While the 22-year-old’s body kept him from hitting his straps for much of 2025, he has rediscovered his mojo – kicking goals in his past eight games, including three in the semi-final against the Suns.\n\nAnd Lohmann declared his fitness would be no concern on Saturday. “Last year was pretty perfect, the way my body was and how I was leading into the game full of energy. This year’s been a bit difficult with my body, but … I’m feeling a lot better,” Lohmann said. “The last few weeks have been really good, I’m still dealing with a bit, but it’s been a lot better. It [the ankle] just seems to be lingering a little bit this year. “I’ve figured out how to play through injuries and get through these tough times.”\n\nLoading The energy Morris and Lohmann brought to Brisbane’s premiership cause was largely credited as rejuvenating their 2024 season. While Morris was kept to just six touches when Brisbane last faced the Cats, Lohmann believed there would be no repeat. “I saw glimpses last year he was going to be a pretty special player,” Lohmann said. “He can take his game to another level. We’ve got a really good young group, which is going to be exciting for Lions fans for a lot of years.”\n\nMeanwhile, Gallop will play just his sixth AFL game in the decider, meaning four of those clashes have all been finals fixtures. “It’s quite a good experience just to see what I’m capable of, it is being thrown in the deep end, but I wouldn’t have it any other way,” Gallop said. The Sunshine Coast product has had a remarkable ascent, after being spotted playing for the Maroochydore Colts before being invited into the Lions’ academy. Against the Magpies, his third goal proved to himself he belonged among the elite. His second, working through traffic, got Brisbane back in front after Collingwood’s rampant second quarter.\n\nTy Gallop celebrates a goal. Credit: AFL Photos “The first two was just being in the right place at the right time, but it was good to take a good mark on the last one and put that through,” Gallop said. “I was playing my senior footy and wasn’t too sure what was happening. Last year I was part of the Allies program and got a couple of games, and then I spoke to some role models of mine who gave me the confidence to back myself in and see where it could take me.” Loading Success for the Lions could hinge on Cameron bursting out of his perceived slump to inspire a Geelong boilover.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/fears-fire-board-qantas-flight-013829650.html",
        "title": "Fears of fire on-board Qantas flight",
        "publish_date": "2025-09-26T01:38:29Z",
        "category": "finance",
        "authors": [],
        "text": "In a terrifying ordeal, a Qantas flight due for Auckland has been forced to make an emergency landing over fears a fire broke out on-board the aircraft.\n\nThe QF141 flight, travelling from Sydney to Auckland, made an emergency landing at Auckland Airport shortly after noon local time.\n\n“During a flight this morning between Sydney to Auckland, the pilots were receiving intermittent indication about potential fire in the cargo hold,” a Qantas spokesperson told SkyNews.com.au.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“The pilots followed standard procedures and notified authorities through a mayday call.\n\n“The aircraft landed safely at Auckland Airport and passengers have disembarked.\n\n“Preliminary investigations report that there was no fire in the front cargo hold. Our engineers will inspect the aircraft to determine the cause.”\n\nMore to come",
        "source": "Yahoo"
    }
]