[
    {
        "url": "https://www.9news.com.au/national/salvation-army-research-new-research-suggests-oneinfive-people-will-avoid-family-and-friends-this-christmas-due-to-financial-hardship/d675b5ec-292b-45d5-89c8-b9c026bcbd4a",
        "title": "New research reveals sad fact about Christmas in Australia",
        "publish_date": "Mon, 22 Dec 2025 06:18:23 +0000",
        "category": "lifestyle",
        "authors": [
            "Dec"
        ],
        "text": "More than 20 per cent of people said they would ﻿find their mental health challenging this festive season.\n\n\"This Christmas is a time to come together as a nation and look out for one another,\" Campbell said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/colac-victoria-toy-store-lego-stolen-christmas/f548c629-46cc-4fdd-93e4-dc0d9410fc72",
        "title": "Thieves steal Lego sets worth thousands from Victorian toy store",
        "publish_date": "Tue, 23 Dec 2025 00:43:39 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Two men forced their way through the front doors of the store on Murray Street in Colac, about 150 kilometres south-west of\n\nMelbourne\n\n, at about 4am on Sunday morning.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/georgie-purcell-josh-burns-welcome-first-child-lilah-poppy-together/3d2815c4-733c-4e04-a85a-dd9c65d00e8c",
        "title": "Political couple welcome first child together in the midst of 'heartbreak and sadness'",
        "publish_date": "Mon, 22 Dec 2025 23:12:00 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Political power couple ﻿Victorian Animal Justice MP Georgie Purcell and Federal Labor MP Josh Burns have welcomed their first child together at a time when her Jewish father \"needed some light in the darkness\".\n\nLilah Poppy Purcell was born earlier than expected on Friday, weighing just 2.56kg at 37 weeks and five days.\n\nHer first two names represent the purple and red flowers, which are the colours of the pair's political stripes and a nod to her Jewish heritage, something Purcell said would be \"an important part of her life in our home\". ﻿\n\nREAD MORE: ﻿ Who Australians blame for terrorism revealed in new poll\n\nLilah Poppy Purcell was born earlier than expected on Friday. (Instagram)\n\n\"Becoming a mum has been the best thing ever. It's also made me more determined than ever before to fight for a future that is kind, equal and just,\" she said.\n\n\"As for Lilah, she has already given us more than she could possibly know — arriving at a time that her dad needed some light in the darkness﻿.\"\n\nBurns, ﻿who has been mourning the Bondi Beach attack on the Jewish community, said he has experienced \"immense lows and highs over the past week\" but said \"out of darkness, flowers and beauty grow\".\n\n\"My heart will always stay with my community who are in mourning, but I'm also feeling so grateful to have my daughters and partner with me at home,\" he said.\n\nREAD MORE: ﻿ Massive sinkhole in England swallows canal boats\n\nJosh Burns kisses his daughter in hospital. (Instagram)\n\nBurns, one of Labor's most senior Jewish MPs whose office has been frequently targeted by vandals, said he would raise his daughter to be proud of her heritage and express it openly in Australia.\n\n\"Children are not born with hate. My daughters will be raised in a home with love, safety and kindness,\" he said.\n\n\"Now I have two jobs to do: Firstly, changing nappies and being present as a father. And secondly, I'm determined to help shape a better future for my daughters and my community in our country.\"\n\nLilah is the political couple's first child together. (Instagram)\n\nAs for Purcell, she said she will spend the next few weeks resting and preparing for the upcoming state election and parliament to resume, this time with a \"+1 alongside me\". ﻿\n\nThe couple hard-launched their relationship in July last year when they stepped out together at Canberra's midwinter ball. ﻿\n\nBurns has a second daughter, Tia, from his previous marriage.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/bill-shock-nsw-woman-naomi-thompson-father-accumulated-6400-in-energy-bill-debt-government-rebates-exclusive/9f4a331b-63b0-4498-ae6f-95369e419422",
        "title": "Naomi opened a letter and discovered a $6400 energy bill debt",
        "publish_date": "Mon, 22 Dec 2025 18:34:42 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "Exclusive: A NSW woman has revealed how her father unknowingly racked up a nearly $6400 debt from years of unpaid energy bills .\n\nNaomi Thompson, 34, has spent nearly five years helping her ill father ﻿slowly bring down the debt – and the balance is a stark reminder of how vulnerable Australians are among the most impacted by the rising costs.\n\nThompson's father, who suffered a stroke, didn't realise he was being contacted by Energy Australia until the bills ballooned to an unmanageable amount.\n\nREAD MORE: ﻿ Professor flooded with death threats over what he wants banned from Queensland\n\nNaomi Thompson's father had unknowingly racked up a $6395 debt. (Supplied)\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\n9news.com.au understands his preferred communication with his energy provider was through letters.﻿\n\nHe was also unable to be contacted by phone.﻿\n\nThompson, too, had no idea until spotting the debt collection letters, which her father had believed were a scam.\n\n\"I said, 'Dad, this is much bigger than just being a scam. These guys are debt collectors',\" Thompson said.\n\nThe debt had been bought from Energy Australia by a third-party debt collection agency in 2021 called ﻿Panthera Finance Group.\n\nThompson's father owed a total of $6395 on power bills dating back to 2019.\n\n\"It's not clear exactly how it happened, but it got to that giant size,\" she said.\n\nAfter the initial bill shock, Thompson was advised﻿ to visit a financial counsellor, who gave her options to help reduce the debt due to hardship.\n\n\"They [Panthera] agreed to drop half the debt, but still wanted the other half paid,\" Thompson said.\n\n\"It was still $3150 roughly that they wanted Dad to pay. He's now on the aged pension, he's paying about 30 per cent of that in rent... that's a lot of money.\"\n\nThe debt has been paid incrementally by around $50 per fortnight.\n\nIt was a small weight off Thompson and her father's shoulders.\n\nPanthera Finance Group was recently acquired by Francom Group, which honoured the debt agreement.\n\nNow, there is a little over $1750 left in the debt owing.﻿\n\nAfter the initial bill shock, Thompson was advised﻿ to visit a financial counsellor,. (Supplied)\n\nThompson said it \"blows her mind\" that power bills could be so expensive.\n\nShe often struggles to pay her own electricity or energy bills as the price of keeping the power on climbs higher.\n\nThompson said it would financially ﻿bankrupt her if she helped pay off even a little bit of her dad's debt.\n\n\"I personally experienced bill shock with my last electricity bill,\" she added.\n\n\"I pay a little bit every single fortnight to ensure that I get maybe $100 max on a bill because I don't want to get giant bill shock.\n\n\"Yet when it came in, it was around $600.\"\n\nTreasurer Jim Chalmers this month announced the much-needed $300 energy bill rebate introduced in 2024 would discontinue next year.\n\nIt was a small slice of financial relief that helped millions of Australians, including Thompson and her dad.\n\n\"﻿I think it's actually really terrible that they've stopped the rebate,\" Thompson added.\n\nCo-coordinator at the Antipoverty Centre Jay Coonan said energy retailers often use debt to justify rising prices.\n\n\"By wiping debt for people who are trapped in debt to these big retailers we'll do everyone a favour,\" Coonan said.\n\n\"Power bills are one of the biggest concerns [for people struggling] because they're continuously going up even as people are using less, or they're installing products to intentionally use less.\"\n\nThompson said it \"blows her mind\" that power bills could be so expensive. (Getty Images/Tetra images RF)\n\nCoonan said the government should intervene in more meaningful ways to stop skyrocketing energy bills.\n\n\"Instead, they used public money to fuel ballooning energy company profits,\" he added.\n\n\"Quite frankly, the energy subsidies have been a total waste of money.\"\n\nThe Stop the Bill Shock campaign﻿, a joint effort alongside the Antipoverty Centre, Parents for Climate and Sweltering Cities, has called on the federal government to wipe existing energy debts and cushion the bill hardship experienced by households doing it tough.\n\nThe average energy debt as of 2025 in Australia was $1367, according to the Australian Energy Regulator﻿ (AER).\n\nThis is compared to $1148 at the same time in 2024.﻿\n\nThe AER's latest report found that, while government rebates temporarily boosted affordability for many customers, more customers ended the year with energy debt.﻿\n\n\"It takes such a heavy toll on people,\" Thompson said.\n\n\"The debt collectors themselves or even people in power don't think about the toll that that has on a person, the stress of constantly being contacted, the worry about answering a phone call because you don't know who it is, a knock on the door or opening a letter.\"\n\nEnergy Australia's Chief Customer Officer Kate Gibson's statement in full﻿:\n\nOur priority is to ensure both our residential and business customers' energy needs are met. EnergyAustralia provides a range of support options for customers facing financial hardship, helping them manage their energy bills, stay connected, and strengthen their ability to pay in the long run.\n\nOur EnergyAssist Hardship Program is our main support avenue for residential customers experiencing financial stress. Case managers work with customers to review their financial situation, tailor assistance and support throughout their challenge period. The assistance includes tailored payment plans, arrangements for payment extensions, support for accessing government grants and concessions, financial counselling referrals as well as relief from fees for missed payments.\n\nWe continue to look at the most effective way of reaching vulnerable customers and work with other retailers, the Australian Energy Council and consumer groups. For example, partnering with Uniting to provide energy efficiency support to vulnerable customers and working with the financial and telecommunications sectors as a founding member of Thriving Communities Partnership.\n\nWe encourage any customer concerned about bill payments to reach out as soon as possible, since earlier contact typically leads to more available options and support before any debt accumulates. By staying engaged, we can better understand a customer's circumstances, offer timely support, and help prevent unnecessary stress.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/massive-sinkhole-in-england-swallows-canal-boats-sparking-rescue-operation/e8cf35d7-2968-4b08-9691-3ca47490a92d",
        "title": "Massive sinkhole in England swallows canal boats",
        "publish_date": "Mon, 22 Dec 2025 14:28:59 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "A massive sinkhole has developed in a canal in the English county of Shropshire, trapping two boats in deep mud and prompting emergency services to declare a \"major incident\".\n\nAn image released by Shropshire Fire and Rescue Service shows the two canal boats trapped in the sinkhole – which measures about 50 by 50 metres – while a third boat leans over the sinkhole's slope.\n\nCanal boats are long vessels designed to navigate Britain's system of narrow canals. Historically, the boats were used to transport cargo but have since evolved into floating homes and are also used for recreational purposes.\n\nREAD MORE: What the big four banks think will happen with interest rates next year\n\nBoats lie damaged after a sinkhole breached a canal in Whitchurch, Shropshire. (AP)\n\nMore than 10 people needed to be saved. (AP)\n\nRescue teams responded to a \"significant breach\" of the Shropshire Union Canal in Whitchurch, a historic market town about 270 kilometres north-west of London, near the Welsh border, Shropshire Fire and Rescue Service said on Monday.\n\nA \"major incident\" was declared at 5.17am (6.17pm AEDT), but the situation was later declared stable, said Scott Hurford, area manager at the service. Search and rescue activity has since ended, he added.\n\nNo individuals are currently believed to be on board the affected boats and no injuries have been reported, he said.\n\nShropshire Fire and Rescue Service said rescue crews had been working in challenging conditions due to unstable ground and \"rapidly moving water\", but managed to bring more than 10 members of the public to safety. The service didn't provide further information about those people.\n\nShropshire Fire and Rescue Service said rescue crews had been working in challenging conditions due to unstable ground and \"rapidly moving water\". (AP)\n\nEmergency services asked the public to avoid the area while teams continue to deal with the incident.\n\nThe Canal and River Trust, the largest canal charity in the United Kingdom, said on Monday that it was carrying out \"initial investigations into the possible cause of the breach and will provide more details in due course\".",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/what-the-big-four-banks-think-will-happen-with-interest-rates-next-year/262761c1-f82b-4782-b631-dc2634b650d5",
        "title": "What the big four banks think will happen with interest rates next year",
        "publish_date": "Mon, 22 Dec 2025 08:05:36 +0000",
        "category": "finance",
        "authors": [
            "Dec"
        ],
        "text": "It's a thought which is likely to put dampener on Christmas and New Year: interest rates could rise again in 2026.\n\nOne bank predicts as many as two hikes in the new year﻿ in depressing news for Aussie mortgage holders.\n\nCBA and NAB are both now predicting a cash rate hike, potentially as early as February.\n\nREAD MORE: Major bank hikes fixed rates despite saying more RBA cuts on the way ﻿\n\nRBA governor Michelle Bullock at a press conference. (Renee Nowytarger)\n\nNAB also reckons it will go up in May too.﻿\n\nHowever, others banks a happier prediction, forecasting they'll stay on hold.\n\n﻿Westpac has updated its cash rate forecast, predicting the RBA will keep the cash rate on hold at 3.60 per cent for the foreseeable future.\n\nPreviously Westpac's economic team was predicting two further cash rate cuts in May and August next year, Canstar says.\n\nHowever, the bank is leaving the door open to this possibility in the first half of 2027.\n\nThe shift comes on the back of recent inflation surprises and the RBA's \"more hawkish tone,\" Canstar says\n\n﻿Westpac has updated its cash rate forecast, predicting the RBA will keep the cash rate on hold at 3.60 per cent for the foreseeable future. (Getty)\n\nANZ still expects the cash rate to remain unchanged in 2026.\n\nWhen it comes to savings, there's slightly better news﻿\n\nCanstar says 33 banks have hiked at least one term deposit rate so far this month.\n\nThis list includes CBA, NAB, ANZ and Westpac, which changed its term deposit special from 3.90 per cent for 11 months to 4.10 per cent for 12 months.\n\nThis compares to just 10 banks that cut at least one term deposit rate so far this month.\n\nREAD MORE: Man charged with trying to spark violent protest on Sydney beach\n\nREAD MORE: Where storms are set to strike on Christmas Day ﻿\n\nAs a result, out of the big four banks, ANZ has the highest term deposit rate of 4.25 per cent, although it's only for a term of eight months.\n\nSally Tindall, Canstar.com.au data insights director, said: \"Westpac's the last big bank to rule out the possibility of further cash rate cuts on the back of what has been a marked shift in tone from the RBA.\n\n\"The central bank has gone out of its way to put borrowers on notice that cash rate cuts are well and truly out the window, but also, hikes are now back on the table.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/christmas-tree-farm/106170822",
        "title": "Green thumb goes from a backyard business to 40,000 Christmas trees",
        "publish_date": "Tue, 23 Dec 2025 01:36:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Ten years ago, Lawrence Ranson was working on a Christmas tree farm in Germany when he realised there was a gaping hole in the Australian market.\n\n\"We only had one variety of Christmas tree [in Australia], and only a couple of farms in the whole country, really big ones,\" he said.\n\n\"I thought there was an opportunity there, and I started trying to grow these strange trees from all over the world, and failing in the beginning.\"\n\nMr Ranson with one of the first Christmas trees he grew in Wollongong. (ABC Central West: Emily Middleton)\n\nThe start-up business in a Wollongong backyard was plagued by massive power bills and tested the goodwill of Mr Ranson's housemates.\n\nHe moved to a cooler climate on the outskirts of Bathurst in Central West NSW, and now supplies the classic Christmas trees radiata pine and Douglas fir to growers right across Australia.\n\nHe grows seedlings for other Christmas tree farmers, and cut trees for the public.\n\nChristmas tree hunters travel from right across the central west to secure the best tree. (ABC Central West: Emily Middleton)\n\n\"We're doing 200,000 to 300,000 seedlings a year now, supplying other farms around Australia … we now grow most of the seedlings of Christmas tree farmers in Australia,\" Mr Ranson said.\n\n\"We have in the tens of thousands, in the ground, they take seven or eight years to mature. So, we have a cycle and we're planning about 10,000 a year, and this year we've cut 6,000 or 7,000.\n\n\"They go to Sydney, they go to Brisbane, Melbourne, all over the place.\"\n\nThe Christmas tree farm grows about 40,000 cut trees. (ABC Central West: Emily Middleton)\n\nNative and exotic Christmas trees\n\nLooking to expand beyond the classic spruce and fir Christmas trees, Mr Ranson has made it his mission to bring new varieties to living spaces.\n\nWhile there are no specifications of what he looks for in a tree, he believes the quirkier the better.\n\n\"There'd be 120-odd varieties that we're experimenting with, maybe 30 or 40 look promising,\" he said.\n\n\"We've got blue spruces with like a bright blue colour, and we've got firs from Russia and from Canada and all sorts of places.\"\n\nA few hundred other species of trees are being trialled to grow for Christmas trees. (ABC Central West: Emily Middleton )\n\nWith strict biosecurity rules on seed imports, Mr Ranson turned to the resources around him.\n\nHe found that Orange, an hour west of his Christmas tree farm, was a playground for propagation.\n\n\"Collectors 100 years ago in towns like Orange had planted these trees, one or two of them, and we found them … and we go and collect our own seed, climb the trees and pick the cones,\" Mr Ranson said.\n\nLawrence Ranson owns the Christmas tree farm near Bathurst. (ABC Central West: Emily Middleton)\n\n\"There's so much in Australia if you look around … whenever we're driving somewhere I'm like 'oh my God, it's a giant sequoia' and we'll pull over and get cuttings or get seeds straight away.\n\n\"There are botanic gardens, they're often quite helpful, people's front yards, I've traded a case of beer for a tree climb if they let me collect big sacks of seeds.\"\n\nDescribing Orange as a \"hot spot for cool stuff\", Mr Ranson can often be spotted climbing the trees in high-vis around the area.\n\nBuyers pick their trees, which are then cut down to be taken home. (ABC Central West: Emily Middleton)\n\nHe said the climbing part of the job came about by necessity.\n\n\"The cones [that contain the seeds] are always at the top of course,\" Mr Ranson said.\n\n\"By the time they fall, often the cones are already open and there's no seeds left.\"\n\n'Pretty funny looking things'\n\nMr Ranson has always found joy seeing his customers happy at the farm with their families.\n\nBut he said it was not always about how \"Christmassy\" the tree looked.\n\nThe farm grows trees in all different shapes and sizes. (ABC Central West: Emily Middleton)\n\n\"We've got Huon pines and they're like a Christmas tree, but with ... a little droopy top which is pretty cute. They do really well,\" he said.\n\n\"There's some pretty funny looking things, you never know, you'd be surprised what people want.\n\n\"It's fun, you come with the kids and they like to be part of it and choose a tree.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/weather-impacted-christmas-lychees-are-best-quality-in-decades/106162250",
        "title": "Christmas lychees best quality in decades despite tough season",
        "publish_date": "Tue, 23 Dec 2025 01:00:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Despite season constraints and rain-delayed harvests, this summer is producing some of the best Queensland lychees in decades according to the wholesalers.\n\nYield and supply have been a bit of a mixed bag from grower to grower across the main lychee regions, such as Northern Queensland, Wide Bay and the Sunshine Coast.\n\nBut wholesaler Larry Griffin from Simon George and Sons in Townsville said the quality was exceptional.\n\n\"It's the best year I can remember, [and] I've been doing it for so long. Everything just eats so beautifully,\" he said.\n\nGrowers are reporting a lower lychee yield this year. (ABC Rural: Sophie Johnson)\n\nFor consumers, prices are slightly cheaper compared to last Christmas, when the price sat at around $25 per kilo.\n\nMr Griffin said larger fruit was selling for closer to $20 per kilo, but the smaller fruit could fetch $12 per kilo.\n\n\"I have seen stuff down for $10 a kilo on farm, but that's your second-grade stuff, but still eating beautifully,\" he said.\n\nBut the drop in prices is not because supply is higher than last year.\n\nLarry Griffin says the lychees coming through to him are the best quality he has ever seen. (ABC Rural: Sophie Johnson)\n\nRain impacts\n\nPresident of the Australian Lychee Growers Association Derek Foley said heavy rain had impacted the number of lychees hitting the market floor.\n\nHe said this caused the price to fluctuate.\n\n\"There's quite a bit of rain through parts of [the lychees] flowering and that's washed the pollen out of some of the flowers and certainly interrupted the crop,\" he said.\n\n\"But having said that, some very good crops in the north, but there's also some not so good and that same syndrome has seems to be appearing now on the Sunshine Coast.\n\n\" Some farms that are very regular producers of fruit year in, year out have been affected also, apparently, by all the wet weather that they've experienced. \"\n\nWet weather has impacted the number of lychees coming to market. (ABC Rural: Sophie Johnson)\n\nHowever, Mr Griffin said there would be ample supply through the Christmas period.\n\n\"Definitely in a few weeks we will see it start to taper off at some point in January, a lot of that's going to be on how much demand soaks up that volume as well,\" he said.\n\nHe said most of his lychees were sourced from the Mareeba area and he focused on providing to hospitality businesses and the retail sector.\n\nPrices are lower than last year, which he said could be due to a lower overall retail demand.\n\n\"We're coming in the Christmas, everyone's doing a bit tough, there's talk about interest rates going up. I think that all kind of plays a part into how keen people are to spend their money,\" Mr Griffin said.\n\n\"But [lychees] have definitely taken off this year for us in sales.\"\n\nCome January, lychee supply will start to weaken. (ABC Rural: Sophie Johnson)\n\nSome varieties producing less\n\nOn Salvatore Girgenti's lychee farm in Mareeba, he said some varieties were producing well this year, like the B3s, but others had seen a low yield.\n\nSo far, most trees have only been producing 50 per cent of their desired volumes.\n\n\"It's weather affected mostly — long wet season two [years] in a row and just fluctuations, big fluctuations, in the weather,\" he said.\n\n\"Last year we probably had more fruit, with younger trees.\"\n\nHe expected the price for lychees would increase soon.\n\n\"You've got other areas which I believe have been affected [by weather] as well, Bundaberg, for example, has had some bad luck,\" Mr Girgenti said.\n\n\"The other coastal areas that from what I'm hearing are wrapping up there picking already and this area, there's a few farmers that have finished already.\n\n\"I feel the price should be going up from here. It probably went down prematurely. It has been a strange pricing this year.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/newmont-cadia-gold-mine-buys-dust-monitoring-stations-epa/106170892",
        "title": "Gold mine pays $330,000 after two dust incidents",
        "publish_date": "Tue, 23 Dec 2025 00:39:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "The owner of one of Australia's largest gold mines will spend more than $300,000 on air monitoring equipment after two dust incidents.\n\nThe NSW Environment Protection Authority (EPA) has entered a legally binding agreement with Newmont, the operator of the Cadia Gold Mine near Orange on the NSW Central Tablelands.\n\nThe enforceable undertaking dictated that the company would spend $307,500 on five new monitoring stations for the state government's Rural Dust Monitoring Network.\n\nThe agreement was reached after the EPA launched legal action against the mine for two dust incidents in October 2022.\n\nThe agency has since dropped the proceedings after it settled the enforceable undertaking with Newmont.\n\nThe NSW EPA alleged the two dust events occurred in October 2022. (ABC Open contributor: Happy Snapper)\n\nThe company will also pay $25,000 to the EPA to cover the investigative and legal costs it spent probing the dust events from the mine's tailings dam.\n\nThe EPA's Executive Director of Operations Steve Beaman said in a statement these sorts of agreements led to effective outcomes for the community.\n\n\"Since these incidents, Cadia has acted to minimise dust events, including installing an irrigation system on their northern tailings storage facility,\" he said.\n\n\"[Cadia] is continuing work to manage dust emissions in the long term.\"\n\nThe five locations of the DustTrak monitoring stations are yet to be determined. (Supplied: Cadia Valley Operations )\n\nIn a statement, a Newmont spokesperson said the two dust lift-off events did not exceed the mine's 24-hour criteria for air quality.\n\n\"As part of Cadia's ongoing commitment to environmental stewardship it implements a comprehensive dust management program,\" they said.\n\n\"We provide real-time accessible data and reporting on air quality levels at four locations around our site.\"\n\nThe agreement comes after the mine was fined $350,000 earlier this year for several dust pollution breaches between 2021 and 2023.\n\nBoost to dust network\n\nMr Beaman said the five extra stations would increase the state's number of monitors to more than 40.\n\nThe DustTrak facilities will measure indicators such as visibility, and oxides of nitrogen and ozone.\n\nThey will also detect very small particulate matter known as PM10 and PM2.5.\n\nNSW Health described those types of dust particles — which are fewer than 10 micrometres in length — as small enough to enter the lungs and bloodstream and had the potential to cause serious health effects.\n\nThe locations of the DustTrak stations are yet to be determined.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/southern-80-cancelled-2026-water-ski-race-safety-investigation/106170180",
        "title": "Southern 80 water ski race cancelled for second year straight",
        "publish_date": "Tue, 23 Dec 2025 00:20:50 +0000",
        "category": "sports",
        "authors": [],
        "text": "The Southern 80 water ski race on the Murray River has been cancelled for a second year as the sport awaits the findings of a NSW Maritime safety investigation.\n\nThe March 2026 race at Echuca-Moama would have been the first since 2024, when skier Luke Wentworth died participating in the event.\n\nThe 40-year-old from Melbourne was one of four people killed in the sport last year, triggering a pause on racing by Ski Racing Australia in June 2024.\n\nNSW Maritime launched a safety investigation, which is now complete but its findings are yet to be publicly released.\n\nSteve Shipp says another cancellation is a blow to Echuca-Moama and other Murray River towns. (ABC Riverina: Romy Stephens)\n\nThe lack of findings and recommendations has prompted Moama Water Sports Club, which organises the Southern 80, to cancel next year's event.\n\nClub president Steve Shipp said it had been expecting the report any day for a couple of weeks.\n\n\"We just haven't got enough time now to run the event,\" he said.\n\n\" The time taken to get this done is, frankly, far too long. \"\n\nA Transport for NSW Maritime spokesperson confirmed the report would be released in weeks but did not respond directly to a question about the delay.\n\nSouthern 80 organisers not consulted\n\nThe Southern 80 involves boats pulling two skiers through more than 120 Murray River bends at speeds in excess of 160 kilometres per hour.\n\nMr Shipp said the club had not been contacted by NSW Maritime investigators, despite the race's history of fatalities.\n\n\"If there's recommendations for our club I'll certainly be asking where [they came] from when there's been no discussion with us about it,\" he said.\n\nIan Tricker, Nathan Miller, Ray Ball and Reece Simmonds of team TR after winning the Southern 80 in 2019. (Supplied: Ian Tricker)\n\nIan Tricker has been racing in the Southern 80 since the late 1980s and is the owner and driver of TR, the team that holds the overall record for fastest race time.\n\nMr Tricker was sceptical about the race's future.\n\n\"It's debatable when, unfortunately if ever, the [Southern] 80 will return,\" he said.\n\nHe said the Southern 80 and potentially all Australian racing should move to one skier per boat, rather than two.\n\n\"It may be time to make the change … the rest of the world [events are] all one skier,\" he said.\n\n\" It's a no-brainer to me. If it saves just one fall, how can you argue with that? \"\n\nTeam TR racing in the 2019 Southern 80. (Supplied: Ian Tricker)\n\nWhile Mr Tricker is keen for the sport to return, he said uncertainty remained around what it would look like after the review.\n\n\"I fear terribly for the sport,\" he said.\n\n\"There's been lots of competitors who have sold their boats and moved on to other forms of sport.\n\nCancellation a blow to small towns\n\nMr Shipp said the Southern 80 cancellation was \"devastating\" for Moama Water Sports Club, but also for the regional communities missing out on an economic boost.\n\n\"The last Southern 80 was worth over $10 million for the weekend to Echuca-Moama,\" he said.\n\nHe said other towns in the region, including Robinvale, Mildura, Kerang and Swan Hill, would also feel the effect of the cancellation.\n\nMr Shipp said the club would forge ahead with planning its other racing event, the Beehag 100, for late next year and for a return of the Southern 80 in 2027.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/push-inside-israel-to-annex-west-bank-approve-settlements/106171756",
        "title": "'I feel that I live in a cage': West Bank annexation push ongoing despite Trump's opposition",
        "publish_date": "Mon, 22 Dec 2025 23:59:18 +0000",
        "category": "finance",
        "authors": [],
        "text": "Standing beneath the imposing stone walls of one of the most ancient and revered sites in the West Bank, Yishai Fleischer was blunt in his assessment of its significance in modern times.\n\n\"It's something that should be bringing people together, but oftentimes places like this actually make people jealous and tear them apart,\" he said.\n\nMr Fleischer wanted to meet the ABC at the Tomb of the Patriarchs in the city of Hebron, south of Jerusalem.\n\nThe site is said to be the burial place of the prophet Abraham, a significant figure in Judaism, Islam and Christianity, and is considered one of the holiest places in all three religions.\n\nControl of the building has been wrested between conquering forces for centuries and the structure today, which sits over the cave where Abraham and his family are buried, is half synagogue and half mosque.\n\nA drone view of the Ibrahimi Mosque, which Jews call the Tomb of the Patriarchs. (Reuters: Ilan Rosenberg)\n\nMr Fleischer's description of the place was a simple summation of a problem dogging this part of the world, but belies the severity of the situation facing the West Bank as his fellow Israeli settlers demand control over areas where millions of Palestinians live.\n\n\"It's a Jewish building on top of Jewish tombs, and the Jewish people have been living at this town and praying here at this tomb for the last 3,500 years,\" he argued.\n\n\"For the Jewish people to survive in this region, we have to be strong in terms of our identity, in terms of our economy, in terms of our military, in terms of our spirituality.\n\n\"Haters will have to go … we have to be strong here and push back in forces that want to destroy us.\"\n\nIt is a view that permeates the settler movement, and some other corners of the Israeli society — that all the land west of the Jordan River is Jewish land, and any action to restore control is a God-given right.\n\nThat belief has spurred some within Benjamin Netanyahu's coalition, often referred to as the most right-wing government in Israel's history, to push for legislation formally annexing the West Bank.\n\nDespite his backing of Israel on a range of other matters, that has been a step too far for the US President Donald Trump, who in September told journalists: \"I will not allow Israel to annex the West Bank.\"\n\nBut many believe it is something of an academic argument — that annexation has already happened as a result of Israel's vice-like control of the West Bank and its government's support for Jewish settlers.\n\nTomb of the Patriarchs is said to be the burial place of the prophet Abraham. (ABC News: Hamish Harty)\n\nEarlier this week, Israel approved 19 new settlements in the occupied West Bank — including re-establishing two settlements that were dismantled two decades ago.\n\nSettlements are considered illegal under international law, but many figures in the Israeli government and settler movement see the territory as their land.\n\n\"The Jewish people are resettling this land, this is the heartland of our story, this is the DNA of our people-hood,\" Mr Fleischer said.\n\n\"We're connected to this thing inextricably; we're not going to be connected this way to Brooklyn or to Sydney or Melbourne. It's not the same.\"\n\nPalestinians live in fear\n\nOn a hill overlooking the Tomb, anti-settlement activist Issa Amro's house is encased in tall fencing, which he argued was necessary to protect him from settler attacks — everything from rock throwing to fire bombings.\n\n\"I feel that I live in a cage,\" he said.\n\n\"My neighbourhood is caged, my city is caged and my country is caged.\"\n\nIssa Amro feels threatened by Israeli settlers. (ABC News: Hamish Harty)\n\nWhen the ABC tried to approach Mr Amro's house, an Israeli soldier blocked the path — insisting foreigners could not pass through an Israeli-dominated area en route to the Palestinian community he lived in.\n\nThe 45-year-old said he had never felt free in the West Bank, labelling Israel's control of the territory as \"apartheid\".\n\nBut he said the situation had deteriorated significantly since October 7, 2023.\n\n\"[Israeli soldiers] got all the support to do whatever they can, because they can do it without any accountability, without anybody saying this is wrong or this is bad,\" Mr Amro said.\n\nTomb of the Patriarchs seen from behind Issa Amro's fence. (ABC News: Hamish Harty)\n\nHe said he had been attacked multiple times by settlers and soldiers, and that Israeli authorities turned a blind eye to the conduct.\n\n\"If you have protection and support and finance coming from the Israeli government to the fanatic and extreme Israeli soldiers and settlers, it means it's a state terror,\" he said.\n\n\"The Israeli government now is acting outside the Israeli law and even the international law, and for sure they are acting outside the Jewish principles and morals.\"\n\nAnnexation underway\n\nMoves to impose Israeli sovereignty on the West Bank have been underway for decades, but the issue has taken on a different tone and tempo in recent months.\n\nIsraeli Finance Minister Bezalel Smotrich and National Security Minister Itamar Ben-Gvir, both subject to sanctions by countries including Australia for their violent rhetoric towards Palestinians, have led the charge.\n\nMr Fleischer said Australia's sanctions against those ministers amounted to \"misunderstanding and antisemitism\".\n\n\"To have Australia getting in our business without clearly understanding, and eroding our sovereignty by sanctioning our people … is an abhorrent act of sabotage,\" Mr Fleischer argued.\n\nThe proposal to approve 19 new settlements was introduced to Israeli cabinet by the pair. When announcing it on social media, Mr Smortrich said it was \"correct and moral Zionism\".\n\n\"Within three years we have regulated 69 new settlements — a record like no other,\" he wrote.\n\nNew settlements overlook Palestinian homes. (ABC News: Hamish Harty)\n\nMr Smotrich's portfolios give him responsibility for approving and expanding settlements, something he has done with considerable vigour since taking office.\n\nIsraeli media has reported Mr Smotrich is pushing for hundreds of millions of shekels to be spent on settlements and outposts, as part of the Israeli government's upcoming budget.\n\nIn October the Isareli parliament, the Knesset, gave preliminary approval to a bill that would effectively annex the West Bank — just as the US Vice-President JD Vance was wrapping up his visit to Israel.\n\nHow a four-day siege symbolises the struggle for statehood A quiet town north-east of Ramallah is on the front line of a territorial battle in the West Bank.\n\n\"If it was a political stunt it was a very stupid political stunt, and I personally take some insult to it,\" Mr Vance said when asked about the vote.\n\n\"The West Bank is not going to be annexed by Israel, the policy of the Trump administration is that the West Bank will not be annexed by Israel.\"\n\nMr Trump also in October told Time Magazine: \"Israel would lose all of its support from the US if that happened.\"\n\nMr Netanyahu's Likud party did not back the legislation and criticised those who pushed for the vote.\n\nAlthough almost two months later, the prime minister said annexation remained \"a subject of discussion\" during a press conference alongside German Chancellor Friedrich Merz, who had just warned Israel against any measures to annex the West Bank.\n\n\"There is no change of the status quo. Israel today controls the security between the Jordan River and the sea,\" Mr Netanyahu said.\n\n\"[Annexation] is not something that I think we're headed in the coming time, it'll be a question that will be raised eventually, but not right away.\"\n\nAll entry and exit points into the West Bank are operated by Israel. (ABC News: Hamish Harty)\n\nIssa Amro said the Trump intervention meant very little to people living in the West Bank.\n\n\"The Israeli government would not be able to maintain the occupation for that long without applied support of many, many Western countries,\" he said.\n\n\"One of the main countries which is blindly supporting the Israeli government … it's the American administration.\n\n\" Donald Trump is part of the problem … he's not peacemaker for me he's a war maker. \"\n\nMichael Sfard, one of Israel's leading human rights lawyers, said the intervention by the Trump administration was important — but argued it only went so far.\n\n\"It has to be acknowledged and it has to be confronted that Israel … has annexed the territory and is treating it as its sovereign territory,\" he told the ABC.\n\n\"We're building settlements there, we are moving communities from one place to another, we're digging out natural resources, we're exploiting the territory, and we're planning it for a very long term.\n\n\"This is not an ordinary occupation — an occupation has to be temporary, and the occupier is not to change the occupied territory at all, as much as possible.\n\n\"We're doing the opposite, we're perpetuating our domination in the West Bank, and in the last two years, we've done that in a way that, for me, this is annexation, even if it hasn't been declared.\"\n\nMichael Sfard says Israel has effectively annexed the West Bank. (ABC News: Hamish Harty)\n\nAttacks on the rise\n\nAcross the West Bank, there are roughly half a million Jewish settlers living in around 140 settlements and up to 300 outposts, a type of settlement that is unauthorised by the Israeli government but often receives retroactive approval.\n\nThat figure increases to around 700,000 when including East Jerusalem — which most countries, including Australia, do not recognise as sovereign Israeli territory after Israel seized it in 1967. It remains on the opposite side of Israel's border wall from the rest of the Palestinian territory.\n\nWhile the settlements are considered unlawful under international law, they are supported by Israeli legislation, including instances where communities have been retroactively legalised years after being built on Palestinian land.\n\nThe Palestinian Authority (PA) exercises control over some parts of the West Bank, including cities such as Ramallah and Nablus, but Israeli security forces maintain a significant presence right across the territory.\n\nA barrier made of concrete and fencing separates most of the West Bank from Israel and East Jerusalem. (ABC News: Hamish Harty)\n\nAll entry and exit points into the West Bank are operated by Israel — including the international land border with Jordan, where the Allenby Bridge crossing provides the only transit option to Palestinians without permits to enter Israel.\n\nIsraeli authorities have permanently or temporarily restricted access to some parts of the West Bank, through major operations such as counterterrorism raids in refugee camps, as well as more routine measures such as closing roads and building checkpoints to stifle free movement.\n\nViolence by settlers towards Palestinians has also surged in recent months. In October, the United Nations recorded the highest number of cases since it began keeping records in 2006, with 264 attacks.\n\nYishai Fleischer, armed with a rifle during his interview with the ABC, downplayed the settler violence. Instead, he blamed Palestinians for fuelling conflict across the West Bank.\n\n\"As in all societies, we have members of the society that are more aggressive and maybe take it to illegal actions,\" he said.\n\n\"If there's illegal action being done, they'll be taken care of.\"\n\nSettler attacks in West Bank during olive picking season Settler violence against Palestinians in the West Bank ramps up every year during olive harvest, but a brazen attack caught on camera has left the community shaken.\n\nHe said Australia did not understand the severity of the situation, and said that opposing settlements was tantamount to \"standing against Jewish survival\".\n\nMichael Sfard argued the intensity of Israeli actions in the West Bank is unlike anything he has seen in three decades.\n\n\"We have the most radical government Israel has ever had, with the settler movement basically a very powerful element of this government,\" he said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/bindi-mail-service-disability-enterprise-town-camps/106164908",
        "title": "Meet the Alice Springs disability enterprise delivering mail to town camps",
        "publish_date": "Mon, 22 Dec 2025 23:30:12 +0000",
        "category": "finance",
        "authors": [],
        "text": "In an office in the industrial area of Alice Springs, Teresa Johnston is sorting mail into pigeonholes representing 18 different Aboriginal town camps.\n\nEvery Tuesday and Thursday, she goes to the post office to collect the mail for residents of the town camps — small Aboriginal communities dotted around towns and cities in the Northern Territory.\n\nTara Heenan and Theresa Johnston are both supported employees with Bindi Enterprises. (Supplied: Bindi Enterprises)\n\nMs Johnston is a supported employee with disability enterprise Bindi, which is partnering with Australia Post to provide employment opportunities and training to people with disability.\n\nIt's the week before Christmas, so there's lots of work to do.\n\n\"I feel satisfaction,\" Ms Johnston says.\n\n\"I deliver the mail to the town [camps], then at the end of the day, [I feel] really good.\"\n\nTeresa Johnston collects the mail from the post office, sorts it and delivers it every Tuesday and Thursday. (ABC News)\n\nAfter an hour or so of sorting, the team, including support worker Sandra Brown and fellow Bindi Enterprises employee Tara Heenan, pile into their ute.\n\nTheir first stop is Larapinta Valley, its winding roads and bright houses shining in summer sun at the base of the pink and orange MacDonnell Ranges.\n\n\"I'm out all the time, and the scenery is really great,\" Ms Johnston says.\n\n\"[I like] the mountains.\"\n\nTeresa Johnston and Sandra Brown driving through Larapinta Valley town camp, the MacDonnell Ranges in the distance. (ABC News)\n\nBindi was established in the late 1970s, when parents of people with disability in Alice Springs wanted somewhere their children could get training and employment — because nothing else existed.\n\n\"Bindi is sort of a big workplace family, where people have been coming for a long time,\" Bindi operations manager Liesl Rockchild says.\n\n\"They know the lay of the land, they know their work and we couldn't do it without everybody.\"\n\nMs Rockchild explains there are different arms of the enterprise, including the contracts department, a digital arts program and an Aboriginal art centre and studio.\n\nBindi delivers mail across 18 town camps around Alice Springs. (ABC News)\n\nMs Johnston says she likes to do the mail service because people are \"happy to get their mail\".\n\n\"It's exciting, because Christmas time is coming,\" she says.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/ashes-boxing-day-test-squad-pat-cummins-jhye-richardson/106173288",
        "title": "Australia names Boxing Day Ashes replacements for Cummins and Lyon",
        "publish_date": "Mon, 22 Dec 2025 23:25:37 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia has named its 15-player squad for the Boxing Day Ashes Test, with captain Pat Cummins confirmed to miss the game and Nathan Lyon set for \"an extended period\" on the sidelines.\n\nLyon tore his hamstring while fielding on the final day of the third Test in Adelaide and will require surgery, while Cummins hinted after the series-clinching game that he \"doubted\" he would play at the MCG as his comeback from a back injury is managed.\n\nWest Australian fast bowler Jhye Richardson comes into the squad, while Victorian off spinner Todd Murphy has been named, and is a chance to play his eighth Test.\n\nCheck out the full squad.\n\nMurphy is the only full-time spinner in the squad and looks likely to earn his first cap on home soil after splitting his seven Tests between India, England and Sri Lanka since taking seven wickets on debut in 2023.\n\nNathan Lyon and Todd Murphy have played together in the subcontinent on a number of occasions. (Getty Images: Pankaj Nangia)\n\nMurphy played two Tests during the 2023 Ashes in England after Lyon went down with a calf injury in the second game at Lord's.\n\nRichardson, meanwhile, is looking to play his fourth Test.\n\nThe 29-year-old made his Test debut way back in 2019 and played two games against Sri Lanka, but a run of injuries and the top form of the cartel of Cummins, Mitchell Starc, Josh Hazlewood and Scott Boland limited him to just one more game, in Adelaide during the 2021/22 Ashes.\n\nRichardson is no guarantee to play in Melbourne as incumbents Starc and Boland, plus seamers Brendan Doggett and Michael Neser, are also in the squad.\n\nJhye Richardson, who has had problems with his right shoulder, joined some net sessions during the third Test in Adelaide. (Getty Images: Robbie Stephenson/PA Images)\n\nSteve Smith also returns to captain the team, as he did in Cummins's absence for the first two Tests, after missing the Adelaide clash with vertigo.\n\nUsman Khawaja replaced him after initially being left out of the pre-game squad having already missed the second Test in Brisbane with back spasms.\n\nKhawaja scored 122 runs across two innings in Adelaide, including a vital 82 on day one, as Australia locked up the Ashes with an 82-run victory.\n\nThe 39-year-old's performance put pressure on Josh Inglis, who has a top score of 32 from three innings in the series since replacing Khawaja in Brisbane.\n\nAustralia's Boxing Day Ashes Test squad Steve Smith (c)\n\nScott Boland\n\nAlex Carey\n\nBrendan Doggett\n\nCameron Green\n\nTravis Head\n\nJosh Inglis\n\nUsman Khawaja\n\nMarnus Labuschagne\n\nTodd Murphy*\n\nMichael Neser\n\nJhye Richardson*\n\nMitchell Starc\n\nJake Weatherald\n\nBeau Webster * New inclusions for fourth Test",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/ac-milan-versus-como-serie-a-game-at-perth-stadium-called-off/106173042",
        "title": "Landmark Italian league game in Perth cancelled over 'unacceptable demands'",
        "publish_date": "Mon, 22 Dec 2025 23:14:55 +0000",
        "category": "sports",
        "authors": [],
        "text": "In a blow to soccer fans in Western Australia, the much-anticipated Serie A game between AC MIlan and Como will not go ahead in Perth next year.\n\nThe match had been pencilled in for February 8, with the game moving to Perth due to AC Milan being unable to play at the San Siro Stadium while the Winter Olympics were on.\n\nThe clash had been billed as a chance for WA to make \"international football history\", as it would have been the first time a major European league game for points was played outside its national borders.\n\nAC Milan and French goalkeeper Mike Maignan, the team's current captain, will not be playing in Perth. (Reuters: Jennifer Lorenzini)\n\nIn a joint statement between the WA government and Serie A, the sides said they had \"exhausted every viable option\" to bring the historic game to WA, but ultimately, it was decided the cost would be excessive.\n\n\"The onerous conditions from the Asian Football Confederation (AFC) to sanction the fixture could not be implemented without financial risks to the State Government and Serie A that could not be mitigated,\" the statement read.\n\n'Unacceptable demands'\n\nWA Sport and Recreation Minister Rita Saffioti said it was a tough decision, but ultimately the right one.\n\n\"It's disappointing, but it's the right call — we were not willing to expose Western Australia to an unacceptable level of risk,\" she said.\n\nWhile Ms Saffioti said the financial risk was significant, she also blamed excessive bureaucracy for sinking the deal.\n\nRita Saffioti had been pushing to bring AC Milan and Como to Perth. (Facebook: Rita Saffioti)\n\n\"This project has been many months in the making, and we did everything we could to get it across the line, but football politics, legal issues and bureaucracy have got in the way,\" she said.\n\n\"There was no guidebook for this; this has never happened anywhere in the world before.\n\n\"We embarked on this project because of the huge economic pay-off for our state and how it would help grow the world game in Australia.\"\n\nThe game was scheduled to be played at Perth Stadium. (ABC News: Cason Ho)\n\nSerie A president Ezio Simonelli said in the joint statement, \"an escalation of further unacceptable demands\" by the AFC had made playing the game in Perth \"impossible\".\n\n\"While expressing disappointment at the outcome of this project, we remain firmly convinced that this conclusion is a missed opportunity in the growth of Italian football at an international level, which also deprives the many Serie A fans abroad of the dream of attending a match of their favourite team in person,\" he said.\n\nNo money lost, WA government says\n\nDespite the government initially remaining positive about the prospect of the game going ahead, doubts started to surface in early December.\n\nAt the time, Premier Roger Cook described the deal as \"complex\" and stressed the need for the game to be financially beneficial for the state.\n\nSerie A game in Perth would have been laughable 10 years ago Italian heavyweights AC Milan look set to play a match, for actual Serie A points, in Perth. What will the state government pay to lure them here, and why are some football supporters unhappy?\n\n\"It's very complex, but we want to make sure that we deliver value for money for the WA taxpayer,\" he said.\n\n\"There has to be a return to make sure we can justify this on the basis of visitation, on the basis of destination marketing, and on the basis of promoting WA.\"\n\nMs Saffioti said the bid for the game had not cost the government any money, and claimed the buzz around Perth hosting the game had in fact generated a significant financial benefit.\n\n\"Importantly, no payments were made, nor has WA lost out through this process, as no agreement was reached,\" she said.\n\n\"We know Perth has been talked about like never before across major global media outlets and European football circles for the past six months, which is great exposure for our state and our reputation for hosting world-class events.\"\n\nThe joint statement between the WA government and Serie A claimed the bid had generated more than $280 million in global media exposure since April.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/the-rock-community-takes-on-businesses-to-keep-town-alive/106127058",
        "title": "Barb dedicated her life to The Rock. Now The Rock is returning the favour",
        "publish_date": "Mon, 22 Dec 2025 23:05:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Barb Payne takes great pride in her immaculate yard, spotless living room adorned with photos of cherished loved ones, and ensuring anyone who walks through the door is treated to a cuppa.\n\nAt 85, she has spent decades in this home she once shared with her late husband at The Rock, in southern New South Wales.\n\n\"I'm very independent. I try and do things myself,\" she said\n\n\"I potter around the house, I get home care — but I mainly keep it nice and clean and tidy myself.\"\n\nThe Rock sits beside the Olympic Highway, one of the main routes linking Wagga Wagga and Albury. (ABC Riverina: Simon Wallace )\n\nMs Payne spent many hours as a volunteer in The Rock, a town named for the giant landmark that dominates the landscape, including running the Meals on Wheels Service, which she now receives.\n\n\"I say to myself, 'I think I've earned it,'\" she says.\n\nThe Rock might be a small town, but residents are rolling up their sleeves to help people like Ms Payne, who now has a condition on her licence that restricts how far she can travel.\n\nSome unlikely characters have taken on local businesses, including the butcher shop, the post office and, crucially, the doctors surgery.\n\nLuke Golds grew up in town and is now the local butcher.\n\nHe said while it was not his long-term plan to stay, the people had won his heart.\n\n\"I started as a wash-up boy seven years ago and got my apprenticeship [here],\" Mr Golds said.\n\n\"If this was just a random town, I probably wouldn't have done it.\"\n\nAnd he almost didn't, with the butcher closing for six months before he took it on.\n\nIt was something Ms Payne said almost broke her heart.\n\nLuke Golds took over the local butcher shop to keep the service going. (ABC Riverina: Jess Scully )\n\n\"[I'm happy as] long as I can get to the butchers … the post office and the doctors,\" she said.\n\nMr Golds said he was inspired by his dad, Bobby Rushby, who told the ABC he took over the post office a couple years ago \"to save it from going under\".\n\nLike his dad, Mr Golds could not stand by and watch local businesses close and people disappear from town.\n\n\"They get their two sausages and a steak and go home and do it again the next day,\" he said.\n\n\"I feel like family to them really, I love them.\"\n\nBarb Payne always gets her meat from the local butcher since it reopened. (ABC Riverina: Melinda Hayter )\n\nMedical care crucial\n\nIn addition to the butcher and post office, The Rock has a small grocery store, an op shop, chemist, hairdresser and a club.\n\nThe population is also serviced by a medical centre, built by Ayman Shenouda and his wife Samiha Azab, both GPs who have worked in The Rock since 2002.\n\n\"The community is special,\" Dr Shenouda said.\n\n\" Why do you have to leave your community that you've lived in all your life to access medical services? \"\n\nThe medical practice has a doctor available every day, a workload shared by the couple as well as other doctors at their Glenrock Family Practice, based in Wagga Wagga.\n\nRecently, the pair have employed a doctor who will be based permanently in The Rock for at least the next three years.\n\nDr Shenouda and Dr Azab have also helped establish a nursing home for those unable to care for themselves but who don't want to leave their town.\n\nAyman Shenouda says the community of The Rock is special. (ABC Riverina: Jess Scully)\n\nGail Driscoll, a councillor and member of The Rock Progress Association, said the village had attracted young families due to its housing affordability, but residents enjoyed how self-sufficient the community was.\n\n\"Some small communities do exist without those services [but] The Rock … provides to all demographics,\" she said.\n\n\"We also have a fantastic school that has before-and-after-school care.\"\n\nResidents and council are working hard to bring a petrol station back to the village. (ABC Riverina: Melinda Hayter)\n\nAlthough many bases are covered, there is one basic amenity the community is working with council to try to bring back.\n\n\"A servo most definitely would probably make it a town again,\" Mr Golds said.\n\nThe progress association and council have been working with outside investors in order to bring fuel back.\n\nBut for what it still lacks in services, The Rock makes up for in its people and its sense of community.\n\nAnd for Ms Payne, that is what matters most.\n\n\"I love it. I would not change it for the world,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/treetop-protester-wins-red-tingle-trees-fight/106171960",
        "title": "Plans to burn rare forest abandoned after man camps in tree for six nights",
        "publish_date": "Mon, 22 Dec 2025 22:35:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "A 70-year-old man who spent six nights camped 20 metres above a forest floor protesting the prescribed burning of giant red tingle trees in WA's south has succeeded in halting an \"imminent\" burn.\n\nAbout 500 hectares of tingle forest at Mount Clare, in the Walpole-Nornalup National Park, 400 kilometres south of Perth, was due to be burnt by the Department of Biodiversity Conservation and Attractions (DBCA).\n\nThe protest was sparked after the DBCA began preliminary ground works at the Mount Clare block in October.\n\nAs part of a community protest action, Paul Jack spent six days living on a platform suspended in the canopy of a giant red tingle tree.\n\nPaul Jack spent six nights on a platform suspended from a giant red tingle tree. (Supplied: Via Stidwell)\n\nMan in tree was last resort\n\nMr Jack said placing himself in the canopy of the burn site was a last resort for the group.\n\n\"From past experience with all of the letter writing and the work that various people have put in over quite a few years to try and modify the DBCA's approach to burnings … nothing else was working,\" he said.\n\n\" This block was imminent, they'd done the scrub rolling already, they were all set to go. We had to do something. \"\n\nRed tingles can live for more than 500 years and reach heights of 75 metres, and only grow in WA's famed Valley of the Giants.\n\n'Operational priorities'\n\nThere have been repeated calls for the government to amend its prescribed burning program after a burn 12 months ago felled more than 100 trees, including a century-old red tingle.\n\nVia Stidwell says the group will continue to push for the removal of tingle trees from prescribed burns. (Supplied: Via Stidwell)\n\nMt Clare Tingle Community Blockade spokesperson Via Stidwell previously told the ABC the group was prepared to man the platform until its demands were met.\n\nHowever last Friday, the Mount Clare block and two others – totalling more than 1,000 hectares – were removed from the DBCA's 2025-26 burn plan.\n\nIn a letter from DBCA director-general Stuart Smith to protesters, seen by the ABC, Mr Smith said burns in Mount Clare, Nornalup and Coalmine containing tingles were being cancelled due to \"operational priorities\".\n\nMr Smith wrote the burns were expected to remain on the DBCA's three-year burn options list, but he was willing to discuss longer-term management of fire-sensitive ecosystems.\n\nPaul Jack says installing the platform was a final effort to get the DBCA to listen to concerned locals. (Supplied: Via Stidwell)\n\nFuture protests expected\n\nMr Jack said while the department's decision was a temporary reprieve from burning, it was a positive outcome for the group.\n\n\"The prospect of having to keep the campaign alive and go all the way through Christmas and so forth wasn't a very happy one,\" he said.\n\n\"I'm absolutely relieved that we've got extra breathing space now to negotiate further to get these particular forests, especially tingle, off the burn list.\"\n\nAs Mr Jack returned to the forest floor, a second protester took his place for one night before the group ended the protest action.\n\nThe Mt Clare Tingle Community Blockade opposes the burning of the tingle forest. (Supplied: Via Stidwell)\n\nMs Stidwell said the group would continue to protest future burns until tingles were excluded from all prescribed burns.\n\n\"The community has shown by the stand taken at Mount Clare, and with the broad community support received for it, that we are not willing to see any more tingle burns occur; not this year, not any year,\" she said.\n\nHundreds of trees felled in controlled burn DBCA documents confirm the unprecedented scale of damage to an ecological hotspot destroyed by a government-lit fire.\n\nThe DBCA was sent a list of questions about the future of its burn program, including how many burn sites included tingle trees and if they would be removed from its burn list.\n\nA DBCA spokesperson said prescribed burns were based on risk management, operational requirements and implementing government policy.\n\nThey said the department was committed to science-based fire management to protect community safety and the unique ecological values of the South West.\n\nJess Beckerling says DBCA's actions are a positive step forward. (ABC News: Cason Ho)\n\nGreens MLC Jess Beckerling said the department's response was the most significant indication it was open to amending its burn program since it had been placed under the spotlight.\n\n\"It was heartening to read that DBCA recognises tingle forests are sensitive ecosystems and is willing to keep having the conversation with the community,\" she said.\n\n\"Tingles must be added to the list of values that are protected from fire.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/bonnie-deas-putting-wnbl-lessons-to-use-in-us-college-basketball/106172980",
        "title": "The trial by fire that gave Bonnie Deas a running start on the US college scene",
        "publish_date": "Mon, 22 Dec 2025 22:06:14 +0000",
        "category": "sports",
        "authors": [],
        "text": "When guard Bonnie Deas faced Australian basketball legend Sami Whitcomb, she had 48 points dropped on her head in just two games.\n\nThe freshman said it was one reason she had shot out of the gates in her American college career.\n\nDeas played for the Sydney Flames in the WNBL last season and was only expected to feature a handful of times.\n\nBut, when injuries cruelled the side, she was suddenly thrust into the line-up, playing in a semifinal series against Whitcomb and eventual champions Bendigo Spirit.\n\n\"That's a WNBA player. I was having to face-guard her, and she still dropped 25 points on my head [in one game],\" Deas said.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\n\"After guarding Whitcomb, I've become a massive fan. The way she plays, goes about things, and how professional she is, I just absolutely love her.\n\n\"I always keep looking back on my season with the Flames and just how much I've learned. Now in college, things are just clicking.\"\n\nDeas, who plays for the University of Arkansas, is one of 119 Australian women college basketballers taking the court in the US this season.\n\nLoading Instagram content\n\nThe 19-year-old is thriving, breaking Arkansas freshman rebound records and averaging a double-double per game and being named Freshman of the Week after her debut game.\n\n\"I took that [WNBL] opportunity to just be a sponge and soak up as much as I could,\" Deas said.\n\n\"It's honestly helped with my growth in college, because I've been able to convert what I learned into my season.\"\n\nAnother emerging Australian talent, Sienna Harvey, is playing for the University of Washington, producing double-digit scoring performances and averaging 15 minutes per game.\n\nBut Harvey would not have made it if not for her parents driving three-and-a-half hours to training sessions and games from Wodonga, in regional Victoria, to Melbourne.\n\nWhen the guard decided she wanted to make a career out of basketball, she moved to Geelong aged just 14.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I feel bad for the kids that still have to do that, it's a lot of travelling and everything,\" Harvey said.\n\n\"I knew [moving to Geelong] was going to help me and my basketball career, just because of travelling.\n\n\"[Playing college basketball] just shows no matter where you come from, you can really do anything. It definitely is cool.\"\n\nThe US college campaign is well underway, with the regular season to finish in March, before the best teams compete for the national championship.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/outback-graziers-praise-rainfall-after-long-dry-spell/106171108",
        "title": "'Amazing' early Christmas present for outback NSW graziers following rain",
        "publish_date": "Mon, 22 Dec 2025 21:29:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Significant rainfall across parts of outback New South Wales has been hailed as a \"godsend\", arriving just days before Christmas.\n\nThe falls, of up to 50 millimetres in some parts, follow months of hot, dry and windy conditions.\n\nLittle rain has led many to sell off or seriously consider de-stocking their properties.\n\nFor grazier Britt Anderson, who lives at Cymbric Vale Station, 180 kilometres north-east of Broken Hill, the rain was most welcome.\n\n\"To have rain now is absolutely a godsend … things were exceptionally tight,\" she said.\n\n\"The really hot winds that we've been experiencing the last couple of months have done a lot of damage out here.\"\n\nA couple of dogs owned by Britt and Mick enjoying a swim. (Supplied: Britt Anderson )\n\nAfter receiving less than 90mm for the entire year, the 37mm that fell over the weekend has left Britt, her husband Mick and their two teenage daughters very happy.\n\n\"Mick is looking like a Cheshire cat, he's walking around very smiley,\" she said.\n\n\"Looking at puddles, watching creeks, floating down creeks, it's been pretty amazing.\"\n\nBritt said she is hopeful there will be more rain to follow.\n\n\"It was a bit triggering, it didn't feel like that long ago we were in severe drought,\" she said.\n\n\"It's been an absolute complete 180 for us, to have that hope that … the rest of this season and the summer season is set up.\"\n\n'Out of the blue'\n\nRob Pearce said the storm \"came out of the blue\" 45 kilometres south of Broken Hill.\n\n\"It's been really dry and no sign of rain and all of a sudden … it developed,\" he said.\n\nGrazier Rob Pearce received 50mm south of Broken Hill. (ABC News: Will Hunter)\n\n\"We ended up with 50mm over the house, which was just unbelievable.\"\n\nWhile follow-up rain is needed over the coming months, Rob said this rain would provide graziers with a fresh sense of optimism.\n\n\"The biggest thing is that it gives you hope and makes you feel good,\" he said.\n\n\"You can go into Christmas thinking 'gee we've had a nice bit of rain'. [Let's] look for 2026 and see what happens moving forward.\"\n\nMr Pearce said he was hopeful anyone who missed out on rain would receive it the next time around.\n\n\"It's disappointing for people that miss out,\" he said.\n\n\"We've missed out plenty of times before but at least if it's about and it's only 10 mile or five mile away, at least it's getting closer.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/homelessness-poor-health-life-expectancy-falls-wa-research-finds/106165168",
        "title": "Poor sleep, unhealthy diets and stress compound for the homeless",
        "publish_date": "Mon, 22 Dec 2025 21:17:20 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "When Rebecca Hendrix was living in a camper trailer in bush in Perth's south earlier this year, she knew something was not right.\n\n\"Probably three nights, four nights out of a week, I would be on my bed in the fetal position crying, just with excruciating pain,\" she recalled.\n\n\"I had my 10-year-old stroke Mum's hair, hold Mum's hand, [say] you'll be right, Mum, you'll be right.\n\nRebecca Hendrix is among a growing number of families falling into homelessness. (ABC News: Keane Bourke)\n\n\"And it was him that actually made me sort of go to the doctors.\n\n\"It was, I've got to do this for my boy, he can't be doing this, looking after his Mum.\"\n\nWhen the 47-year-old did visit a doctor, she was diagnosed with stage 3 cervical cancer.\n\nBut doctors would not allow her to start chemotherapy because it can weaken patients' immune systems — a risk they were unwilling to take until Rebecca was in more stable housing.\n\nRebecca Hendrix was delayed in starting chemotherapy because she was sleeping rough. (ABC News: Keane Bourke)\n\nShe was able to begin treatment while in transitional accommodation, before moving into her own place a few weeks later, thanks to a social housing provider.\n\n\"I've got my home, now I've got my boys with me, and I think that'll be my strongest medicine, beating this cancer,\" she said.\n\nHomelessness leads to poor health\n\nRebecca's story is not uncommon, with research finding clear links between homelessness and poor health.\n\nWestern Australian research has found people who have experienced homelessness die at an average age of about 48 — decades short of the average of 83 for most Australians.\n\nIt is a battle that street nurse Natale Bogoias is on the front line of, bringing health care to rough sleepers where they are.\n\nNatalie Bogoias has spent the last eight years as a street nurse with Homeless Healthcare. (ABC News: Keane Bourke)\n\nPoor sleep, unhealthy diets and the impacts of stress all compound for people who are homeless, some of whom are pushed to the streets because of health complications.\n\n\"When people do end up on the streets, it vastly affects their mental health and their physical health,\" Ms Bogoias said.\n\n\" That just makes it more and more difficult for them to find their way out of homelessness. \"\n\nWithout stable routines or even phones to keep track of time and appointments, it can be hard for people to look after their own health, she said.\n\n\"All of those things are just overlooked. People are focused on how they're going to get through each day,\" Ms Bogoias said.\n\nRebecca Hendrix described getting her own home as Christmas coming early. (ABC News: Keane Bourke)\n\nMs Hendrix agreed.\n\n\"I think if I was in a house, it would have all been different,\" she said.\n\nSupports struggle to keep up\n\nStories like Rebecca's are a growing concern for Traci Cascioli, chief operating officer at St Patrick's Community Support Centre, who has been noticing more families in need of help.\n\n\"People will hold out for as long as they can before raising the alarm and reaching out,\" she said.\n\n\"They're prioritising the needs of their children over their own health needs, or their own needs.\n\n\"Very often, the condition has been left to go untreated for such a long time that their needs require urgent medical attention.\"\n\nTraci Cascioli says the increase in families experiencing homelessness is concerning. (ABC News: Keane Bourke)\n\nThose cases were even more challenging, she said, because services had generally been set up to support single men and women.\n\n\"It's the thing that keeps me up at night because other cohorts that we work with, other people that we work with, there are perhaps more solutions that we can use and link in, more creative options out there,\" Ms Cascioli said.\n\n\" But families require a different response and our system is not well geared up for that. \"\n\nA St Pat's initiative to provide case management support to families opened recently, reaching capacity within only a few weeks.\n\nOn the whole, Ms Cascioli said Perth's housing crisis was leaving service providers \"having to hold people as best we can in a pattern of meeting their basic needs whilst we sort of tread water\".\n\nPriced out of the market\n\nThat was the situation Rebecca had been in before her diagnosis.\n\nShe said she had not been able to get back into stable housing for about four years, ever since her landlord decided to sell the property she had been renting.\n\nRebecca and her youngest son moved down to Rockingham, where she found a cleaning job, but they stayed living in a tent at a caravan park.\n\nSt Patrick's Community Support Centre helped Rebecca into her new home. (ABC News: Keane Bourke)\n\n\"Just too expensive for me, being single,\" she said.\n\n\"We just, I dunno, plodded along, did what we gotta do just to make it through each day.\"\n\nWestern Australia's growing social housing waitlist, which sat at 23,110 applications at the end of October, was not an option, with many people waiting years to get into a home.\n\nRebecca had been on the priority wishlist, but was not offered a property in time.\n\n'Pull your finger out'\n\nNow settling into her home for Christmas, Rebecca hopes the government will do more to help people in similar situations.\n\nRebecca Hendrix could not get a property through the public housing waitlist. (ABC News: Keane Bourke)\n\n\"There's that many vacant blocks that they can put on dongas, or even just a couple shower blocks because some people like living out of their campers, out of their caravans, but they don't have the spot to go to,\" Rebecca said.\n\nWhile not specifically endorsing that idea, Ms Cascioli said there was a need for homelessness services to be \"more flexible and nimble\" in their thinking, and to work together to find options for vulnerable people.\n\nThe state government said its mid-year budget update, released last week, showed $6.3 billion in investment in housing over the last five years, much of that in trying to lift social housing numbers.\n\n\"Our biggest challenge is to continue to deliver on housing,\" Treasurer Rita Saffioti acknowledged.\n\nRita Saffioti acknowledges the persistent pressures in the housing market. (ABC News: Keane Bourke)\n\n\"And making sure, I hate to use [the phrase] 'pull every lever', but try and do everything we can to get housing supply increased.\"\n\nThat included investing another $234 million for an extra 329 social homes and to refurbish 91 homes.\n\nThose measures, like almost everything the government has tried, are likely to struggle to move the needle, though, given population growth and continuing constraints in the construction sector.\n\nRebecca's message to the government is simple.\n\n\"There's a lot of people out there that need this, sick and homeless people,\" she said.\n\n\" Just pull your finger out and give us a hand, please. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/farmers-south32-bauxite-mine-water-issues/106172120",
        "title": "Farmer beside South32's major bauxite mine reports growing water issues",
        "publish_date": "Mon, 22 Dec 2025 21:06:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Drastic changes in salinity levels and water flows are being reported at farms neighbouring South32's Worsley bauxite mine in Western Australia.\n\nIn recent years, some properties have gone dry, while others have had rapid rises in groundwater levels, causing waterlogging and degradation of land.\n\nSome residents attribute the hydrological changes to South32's nearby mining operations.\n\nRussell Reynolds's farming property sits between the Mount Saddleback mining area and the Hotham River, near Boddington, 130 kilometres south of Perth.\n\nHe said his spring-fed dam was almost undrinkable because of rising salinity.\n\nMr Reynolds also claims a surface stream that once ran each winter has been dry now for two years.\n\n\"It's a bit disappointing, because they've made no effort whatsoever about controlling water flow so we still get enough water,\" Mr Reynolds said.\n\nThe Department of Water and Environmental Regulation (DWER) confirmed it was currently investigating Mr Reynolds's claims.\n\n\"DWER has kept Mr Reynolds informed throughout the investigation, which may take several months to complete due to its hydrogeological complexity,\" a spokesperson said.\n\nSouth32 has approval to take 900 million litres of groundwater a year, most of which is used for dust suppression. (ABC South West: Jon Daly)\n\nMiner draws millions of litres\n\nIn February this year, South32 received state and federal approval to increase its groundwater use from 500 million litres to 900 million litres a year, primarily for dust suppression on haulage roads.\n\n\"It'll only get worse,\" Mr Reynolds said.\n\n\"If you haven't got enough water to mine that size area, you shouldn't be allowed to mine that size area.\"\n\nMr Reynolds blames his water issues on a series of major production bores, known as the Tunnell Road borefield.\n\nRussell Reynolds says the seasonal surface water stream on his property has run dry for two years. (ABC South West: Jon Daly)\n\nThe borefield draws water from an underground stream that runs through the Saddleback Timber Reserve and onto Mr Reynolds's property, filling his dams.\n\nIn 1996, the borefield supplied 85 per cent of water for the mine, with an average of 465,000 litres of water being extracted every day.\n\nFrom December last year to June this year, South32 drew an average of 665,000 litres per day from Tunnell Road bores, with eight trigger-level exceedences, according to a recent compliance report.\n\nThe report noted dryer-than-average rainfall contributed to higher monthly water demand, but overall water usage from the borefield remained below recommended yield.\n\n\"Basically, they're taking it before it can get to the property,\" Mr Reynolds said.\n\n\"To me, that bore system should be restricted.\"\n\nRussell Reynolds says the water issues on his farm constitute a breach of South32's environmental approval conditions. (ABC South West: Jon Daly)\n\nRising salinity levels\n\nHe said the reduced groundwater flow was also to blame for a 500 per cent increase in salinity levels of his spring-fed dam.\n\nHe claims the dam's total dissolved solids (TDS) level jumped from 180 milligrams per litre (mg/L) in 2014 to 1,100mg/L in 2025.\n\nHowever, the ABC was unable to verify the original 2014 test results.\n\nAnything above 1,200 mg/L is considered unacceptable for drinking, according to national drinking water guidelines.\n\nRussell Reynolds said the regulator needed to step up and hold the mining company to account. (ABC South West: Jon Daly)\n\nIn 2020, South32 commissioned a report on ground and surface water as part of the expansion proposal approved earlier this year.\n\nThe report shows higher salinity levels in the Tunnell Road borefield, with average TDS levels ranging from 163–1,510 mg/L, compared to 160–391mg/L measured in a 1995 submission to the Environmental Protection Authority (EPA).\n\n\"Right at the moment, they don't have anything to control salt level, and they know exactly what's happening,\" Mr Reynolds said.\n\nSouth32 issued a brief statement noting it was aware of the \"matters that have been raised\" but did not respond directly to the ABC's questions.\n\n\"Worsley Alumina manages and monitors groundwater usage, quality, levels and its response in accordance with its approved Water Management Plan,\" a South32 spokesperson said.\n\nA line of dead native trees marks the water course that appeared on one farm in a matter of years. (ABC South West: Jon Daly)\n\nMining and water mounding\n\nOther farming properties beside the Mount Saddleback mining area have had sharp increases in groundwater levels and flow.\n\nThe ABC visited a property with a surface water stream that had appeared out of the adjacent forest within the last four years.\n\nThe stream's course through the farm is marked by a cluster of dead jarrah trees, and it has white salt scald beside it.\n\nThe ABC has seen evidence of salinity levels in dams increasing by more than 100 per cent in four years on other nearby farming properties.\n\nAnn Choong, a trained lawyer and member of the environmental group Dwellingup Discovery Forest Defenders, believes the changes are a result of water mounding, which occurs when forest is cleared, and cap rock is removed.\n\nSatellite images from 2015 and 2025 show the changes in surface water flow on a farming property beside Mt Saddleback. (ABC South West: Jon Daly)\n\nWater mounding occurs when more groundwater flows downhill, increasing the water table and salinity in low-lying areas.\n\nSouth32's Water Management Plan identifies water mounding as a potential impact of its operations, noting the risk of increases in salinity in groundwater and changes in surface water flows associated with changes in land use and land form.\n\n\"These impacts are interconnected and have a limited duration associated with the temporary change in land use during mining activities,\" the management plan states.\n\n\" Groundwater levels typically return to those equivalent to the unmined situation within five to 20 years. \"\n\nSouth32 says it manages and monitors groundwater usage in accordance with its approved management plan. (ABC South West: Jon Daly)\n\nBreach of 'no adverse impact' condition\n\nDr Choong has been working to bring the concerns of the few neighbouring landholders to the attention of the regulator.\n\nShe said many farmers had already sold their properties to the mining company.\n\n\"There aren't a lot of people to speak up about what happens to the land,\" she said.\n\n\"In 20–40 years, the ore will run out, and the question is, what are we going to have in terms of farmland?\" she asked.\n\nSouth32's 2020 groundwater study concluded declining rainfall was primarily responsible for rising salinity, not bauxite mining.\n\nAnn Choong has been helping landowners raise their water concerns with the regulator. (ABC South West: Jon Daly)\n\n\"Bauxite mining in the Saddleback area does not appear to be causing any additional observable salinity increase over and above that recognised as background response to regional rainfall decline,\" the report stated.\n\nMr Reynolds argues his experience challenges that finding, and the impact on his property constitutes a breach of environmental conditions set on South32's Worsley mine expansion.\n\n\"The emphasis is on DWER. How about [you] start acting on what you've put in place?\" Mr Reynolds said.\n\nAs a condition of South32's expansion last year, the state government said there had to be \"no adverse impacts to neighbouring groundwater users as a result of the proposal\".\n\n\"At this stage, DWER has not yet determined whether any adverse impacts have occurred,\" a DWER spokesperson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/handel-messiah-christmas-classic/106163866",
        "title": "Why Handel’s Messiah is a Christmas classic for many",
        "publish_date": "Mon, 22 Dec 2025 21:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Every December, choirs from around the world come together to perform Messiah by 18th-century composer George Frideric Handel.\n\nIn Australia, there is at least one performance in most capital cities.\n\nYou can usually hear Messiah broadcast on radio stations like ABC Classic in the lead-up to both Christmas and Easter.\n\n\"When Handel wrote Messiah in 1741, he would never have thought it would become one of the most performed works in the canon,\" says Andrew Ford, host of The Music Show on Radio National.\n\nHandel's Messiah with the Brisbane Chamber Choir The Brisbane Chamber Choir celebrate Christmas with Handel's magnificent oratorio about the life of Christ.\n\nHandel didn't set out to write a Christmas classic.\n\nBut as an oratorio that tells the story of Jesus's life from birth through to his resurrection, it makes sense for the season.\n\nIn spite of a complicated and controversial history, the music's vision of a better world, coupled with memorable tunes and associations with charitable causes, makes Messiah a Christmas staple for the ages.\n\nHow Handel composed Messiah\n\nUnlike an opera, where there are stage props and singers have to sing and act, an oratorio tells the story through words and music.\n\nIn Messiah, sometimes soloists will sing arias accompanied by the orchestra. Other times the full choir takes centre stage.\n\n\"[Messiah] is one of the most remarkable examples of the way in which words and music can work together to create more than the sum of the parts,\" says Charles King, a historian and author of Every Valley, a book exploring the origin story of the oratorio.\n\nHandel wrote Messiah in just over three weeks. (Portrait: Balthasar Denner)\n\nMessiah's fame is entwined with the story of its creation, King tells The Music Show.\n\nHandel wrote Messiah in just over three weeks, by using sections of music he had already composed in the past.\n\nIt was written at a point when Handel's career in London was flagging.\n\n\"He was venerated as a composer, but [had lost his edginess],\" King says.\n\nIn addition to his position as a court composer for the British monarchy, Handel turned to affluent patrons to sustain his career.\n\nOne of these patrons, Charles Jennens, was a wealthy landowner, an amateur musician and librettist.\n\nIt was Jennens who selected the biblical verses that would become the text of Messiah.\n\n\"[Jennens] suffered very deeply from what we might now call bipolar disorder or chronic depression,\" King says.\n\nJennens turned to the scriptures to create \"his own kind of ladder out of this abyss,\" King says.\n\nDespite Messiah's vision of a better world, it was born during one of the darkest periods of history.\n\n\"Most of the wealth of Europe was the result of slavery [and] the slave trade,\" Ford reminds us.\n\n\"The story of enslavement is absolutely entwined with art in this period in a way that we simply can't deny,\" King says.\n\nKing found that Jennens was a shareholder in the South Sea Company and Handel received portions of his salary through holding accounts in the Royal African Company, one of the major slave firms in the 1700s.\n\nHow Messiah became a Christmas tradition\n\nMessiah's first performance took place in April 1742 in Dublin.\n\nMessiah was first performed in the Musick Hall in Fishamble Street, Dublin. (Wikimedia Commons: The Musical Times)\n\nJennens wasn't in attendance. He thought that Handel had \"run off\" to Dublin with his precious words.\n\nThe first cast of Messiah included Susannah Cibber, a stage actor and low-voiced contralto whose loveless marriage had resulted in personal scandals and legal battles.\n\nCibber sang one of the most dramatic and memorable arias, He Was Despised, which includes the words: \"A man of sorrows and acquainted with grief.\"\n\n\"This scandalous, notorious woman, was now standing before [700 or so people], singing about the possibility of redemption,\" King describes the premiere.\n\n\"It was a movie-worthy moment far before the invention of film.\"\n\nThe Dublin premiere was met with rave reviews.\n\nProceeds were donated to the release of imprisoned debtors, a hospital and an infirmary.\n\nBut the oratorio's subsequent performances in London were not warmly received.\n\nHandel's decision to perform a sacred work in a theatre turned off many audiences from attending.\n\nMessiah lives on partly due to its association with philanthropic causes.\n\nFrom 1750, Handel offered performances of Messiah to raise funds for the Foundling Hospital, a children's home at the heart of London.\n\nFrom 1750, Messiah was performed annually at London's Foundling Hospital to raise funds. (Wikimedia Commons: British Museum)\n\nThe benefit concert became an annual event and cemented Messiah as \"music that was in aid of a good cause,\" King says.\n\nEven though Messiah began as an Easter-themed oratorio, the music became a Christmas tradition.\n\n\"By the 1830s and 1840s, people around the world were quite accustomed to hearing it at Christmas time,\" King says.\n\nOver the years, audiences have built their own traditions around the work.\n\nAn anecdote claimed King George II got to his feet during the famous Hallelujah Chorus at one of the London performances.\n\nAudiences today still stand during that section of Messiah.\n\nLoading...\n\nWhy Messiah still resonates with audiences today\n\nThere are relatively few pieces of music that have outlived their composers for as long as Handel's Messiah.\n\n\"This piece of music has been in near continuous performance since the time it was composed [nearly 300 years ago],\" King says.\n\nThe Music Show: Messiah Andrew Ford talks with author Charles King about how Handel's Messiah became a cornerstone of the musical canon.\n\nBoth Ford and King find the words of Messiah still quite resonant in the context of our present day.\n\n\"[Messiah] was created in a time of war, dissension, disease, ever-present death and real worry about the present state of the world,\" King says.\n\nThe vision of a better world makes the music timeless.\n\n\"Every performance of the Messiah begins with a promise: comfort ye, comfort ye my people,\" King says, referring to the first aria of the oratorio, which is taken from the biblical book of Isaiah.\n\nThis promise frames the story of Christmas and Easter, which are both present in the music.\n\nThe central question of Messiah, King says, is: \"How [do] you possibly have hope in a world in which all of the evidence of your senses would suggest otherwise?\"\n\n\" The first step in changing the world is to re-imagine the world in a radically new way. \"\n\nHence the famous line: \"Every valley shall be exalted, and every mountain shall be made low.\"\n\nAlmost 300 years later, audiences still turn to that promise for comfort.\n\nSign up to the ABC Classic Newsletter",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-12-23/unattended-caravans-at-murray-river-campsite-spark-debate/106124688",
        "title": "Unattended caravans 'ghost camping' at free sites spark debate over fair access",
        "publish_date": "Mon, 22 Dec 2025 20:54:46 +0000",
        "category": "finance",
        "authors": [],
        "text": "A row of unattended caravans parked along a popular free riverside campsite has sparked renewed debate about fair access to public camping spots during peak holiday periods.\n\nFootage, shared online by traveller Ciaran Shields and his partner through their account No Place To Go But Everywhere, shows caravans lined up along the Murray River on the New South Wales-Victoria border, with no sign of people staying at the site.\n\nMr Shields said the scene was unlike anything they had encountered during months of travelling around Australia in their converted bus.\n\nCiaran Shields is travelling around Australia with his young family. (Supplied: Ciaran Shields)\n\n\"The first time we came to that beach, we met a family camping there who told us about people parking their vans there for Christmas,\" he said.\n\n\"They said one of the guys had parked their van right in front of their tent, which we thought was a bit rude.\n\n\" There was just a row of vans parked up on the waterfront without anybody there. \"\n\nThe campsite, known as Davis Beach, on the Victorian side of the Murray River at Tocumwal, is a popular swimming and camping spot, particularly during school holidays.\n\nMr Shields said his family was not planning to camp there but visited the area last month so their children and dogs could swim.\n\nUnder Parks Victoria rules camping is allowed for up to six weeks at a time. (ABC News: Sarah Buchecker)\n\nThe video, which shows nine unattended caravans parked in what he described as \"prime spots\" along the Murray River, quickly gained traction online, drawing hundreds of thousands of views and hundreds of comments.\n\n\"We were absolutely blown away by the attention,\" Mr Shields said.\n\nThe footage triggered a flood of debate, with many accusing caravan owners of effectively \"reserving\" public campsites by leaving vehicles unattended for days or weeks at a time — behaviour widely viewed as inconsiderate, even if not always illegal.\n\nOthers defended the practice, arguing people should be free to come and go during extended holiday stays.\n\nA common problem\n\nThe stretch along the Murray River is managed by Parks Victoria, which said the practice was common at this time of year.\n\n\"The maximum time someone can camp at one of the Murray River Reserve sites, like Davis Beach, is six weeks,\" a spokesperson said.\n\n\"If people encounter issues with behaviour or facilities at one of our campsites, they can report them.\"\n\nThe issue is not just confined to camping.\n\nGoulburn-Murray Water (GMW), which manages recreational water storages across northern Victoria, warns reserving sections of public foreshore for exclusive use was not permitted.\n\n\"Our storages are fantastic places to visit but it is important that everyone plays their part to ensure they remain this way,\" GMW general manager of water storage services Jon McKeown said.\n\n\"During busy times we do see people looking to reserve inlets or parts of the foreshore for exclusive use by installing gazebos, inflatable pontoons and other structures before their visit.\n\n\" This is not permitted and isn't fair on others who want to enjoy the area. \"\n\nParks Victoria says campers reserving spots is a common problem. (ABC Mildura-Swan Hill: Sophie Malcolm)\n\nUnder the Water (Recreational Area) Regulations 2023, you can be fined for leaving temporary structures unattended on the foreshore.\n\nMr Shields said the behaviour was something his family had never encountered before.\n\n\"We used to live in the South West of WA and have been travelling around in our converted school bus since March 2024,\" he said.\n\n\"We have never seen anything like this on our travels before or around our home town in WA for that matter.\n\n\"But judging by the comments it happens here quite regularly for Christmas and Easter.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/racing/racing-community-in-mourning-after-apprentice-jockey-dies-in-car-crash-20251223-p5npqd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Racing community in mourning after apprentice jockey dies in car crash",
        "publish_date": "Tue, 23 Dec 2025 12:58:51 +1100",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "The racing community is in mourning after the death of 24-year-old apprentice jockey Bronte Simpson in a car crash on Monday night at Mendooran in the NSW Central West.\n\nSimpson died at the scene after her SUV left the Castlereagh Highway about 80 kilometres north-west of Dubbo and hit a tree.\n\nApprentice Bronte Simpson, left, after a win. Credit: Sky Racing\n\nThe Ballarat-raised rider had moved to NSW to start her racing career and began her apprenticeship with Sara Ryan at Wyong in February last year. She transferred to Tamworth trainer Jane Clement last August and had racked up 13 more winners since taking the Kristen Buchanan-trained Stylebender to victory with her first ride, at Muswellbrook on May 2 this year.\n\nSimpson had not ridden since the Dubbo meeting on Saturday and was believed to be travelling home on Monday night after visiting friends.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/katrina-meynink-s-all-time-greatest-party-snack-recipes-20251208-p5nlu7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Katrina Meynink’s all-time greatest party snack recipes",
        "publish_date": "Tue, 23 Dec 2025 12:46:43 +1100",
        "category": "finance",
        "authors": [
            "Katrina Meynink"
        ],
        "text": "Recipe collection\n\nKatrina Meynink’s all-time greatest party snack recipes\n\nThe party starts here. From mortadella olives with dirty martini dip to gunpowder potato gems, these are Katrina Meynink’s best snacks. Prepare to be wowed.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/loss-of-russian-venezuelan-oil-a-drop-in-ocean-for-world-s-crude-glut-20251223-p5npoi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Loss of Russian, Venezuelan oil a drop in ocean for world’s crude glut",
        "publish_date": "Tue, 23 Dec 2025 12:40:54 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Oil prices are hovering around their lowest point for the year despite the unexpectedly severe impact of US sanctions on Russia’s oil exports and its blockade of tankers entering or leaving Venezuelan ports.\n\nBrent crude, which traded below $US59 ($88) a barrel last week before reports of progress in Ukrainian peace talks lifted prices above $US60 a barrel, is still trading at less than $US62 a barrel despite a rising volume of stranded Russian oil.\n\nAn Iranian oil tanker at anchor near a refinery in Puerto Cabello, Venezuela, before the US began targeting similar vessels. Credit: AP\n\nWith the Trump administration seizing two sanctioned tankers off the Venezuelan coast and chasing a third, Venezuela’s oil exports are shrinking. Where, earlier this year, it was exporting more than a million barrels a day, exports are now down to less than 800,000 barrels and falling as tankers steer clear of its coast.\n\nThe impact of what analysts think could be the withdrawal of about 500,000 barrels a day of Venezuelan oil, as a result of the US chokehold, is less significant for the market and oil price than what’s happening to Russia’s exports. (Venezuelan oil represented only about one per cent of global supply even at its peak this year.)",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/traveller/inspiration/new-york-s-best-places-to-eat-and-drink-20221005-h26xah.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New York’s best places to eat and drink",
        "publish_date": "Tue, 23 Dec 2025 12:22:14 +1100",
        "category": "finance",
        "authors": [
            "Kristie Kellahan"
        ],
        "text": "Advertisement\n\nInspirationNew York New York’s best places to eat and drink Kristie Kellahan Updated December 23, 2025 — 12:22pm ,first published April 10, 2023 — 4:34pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThis article is part of Traveller’s Destination Guide to New York. See all stories .\n\nIt’s an impossible task to shortlist New York City’s best of the best restaurants. In one of the most diverse and exciting culinary destinations of the world, there are more than 25,000 places to eat, with more opening every day. Most are good (or they don’t last long); many are spectacular. What we can do is take a highly opinionated stance and steer you in the direction of spots we love. They’re reliably delicious, memorable and so much fun. Go on, take a bite. Atomix The bar at Korean diner Atomix. Elevated, innovative Korean dining in Manhattan\n\nThe only restaurant in New York to make The World’s 50 Best Restaurants list in 2025 (it came in at number 12), Atomix delivers innovative Korean fine dining at its most impressive. The 12-course tasting menu experience combines meticulous technique and surprising ingredients (kohlrabi and caviar; mussel and bluefin tuna with cheonggukjang) with exemplary service. Korean-born husband-and-wife team, Ellia and Junghyun ‘JP’ Park, welcome diners to an elegant, minimal space in the NoMad neighbourhood of Manhattan.\n\n104 East 30th Street, New York. Phone: +1 646 476 7217. See atomixnyc.com Mama’s Too\n\nAdvertisement\n\nQueues outside Mamas Too! on Bleecker Street. Alamy Stock Photo Arguably the best pizza in the city\n\nWhy name just one best pizza in New York when the city is full of outstanding slices and pies to devour? The square slices at Mama’s Too are right up there, with toppings ranging from classic (pepperoni cups) to inventive (Cacio e Pepe) and inspired (poached pear, mozzarella, sweet gorgonzola and hot honey). The original location is on the Upper West Side, but the West Village restaurant has an advantage: It’s a couple of hundred metres from L’Industrie Pizzeria, another strong contender for the city’s best pizza. Try them both and decide for yourself.\n\n323 Bleecker Street, New York. Phone: +1 212 510 7256. See mamastoo.com Tatiana by Kwame Onwuachi Interiors at Tatiana by Kwame Onwuachi. Adrian Gaut, courtesy of Modellus Novus and Lincoln Center Afro-Caribbean-NYC dishes by an acclaimed chef\n\nAward-winning chef and cookbook author Kwame Onwuachi brings the spice and flavour of his “Afro-Caribbean-raised-in-the-Bronx” heritage to the Upper West Side at Tatiana, a glamorous addition to the Lincoln Center precinct. It’s still one of the toughest reservations in the city, its popularity fuelled by countless awards and satisfying plates of curried goat patties, jerk lamb rib and buttery head-on shrimp. The New York Times named it the best restaurant in the city in 2023, less than a year after it opened; in 2025, it remains in the top 10.\n\n10 Lincoln Center Plaza, New York. Phone: +1 212 875 5222. See tatiananyc.com\n\nAdvertisement\n\nDante Australian-owned Dante in New York. Italian-inspired all-day cafe with excellent cocktails\n\nEstablished in 1915 as Caffé Dante, this Greenwich Village gem has been under Aussie management since 2015 when hospo power couple Linden Pride and Nathalie Hudson took the reins. Go there for the best Negronis in the city (on tap, no less), afternoon spritz specials and seasonal cocktails. The Italian-ish brunch and all-day-until-late menu shows some green-and-gold influence, with housemade banana bread and avocado toast alongside more Continental antipasti, flatbreads and pasta. The signature burger on a brioche bun is a delight. A second location, Dante West Village, serves food until midnight, seven days.\n\n79-81 MacDougal Street, New York. Phone: +1 212 982 5275. See dante-nyc.com Rolo’s Neighbourhood bar and grill for families, solos, dates\n\nThe restaurant at Rolo’s is consistently booked out, but don’t let that stop you crossing town to trendy Ridgewood on the border of Queens and Brooklyn. The terrific food and service is worth the wait (and Michelin Bib Gourmand recognition) and the sceney bar takes walk-ins. Launched by former Gramercy Tavern alums, Rolo’s sets the bar high with a menu of wood-fired specialties that starts with fluffy polenta bread and leads to deliciously charred lasagna and butter-smeared dry-aged steaks. The cocktail game is strong.\n\n853 Onderdonk Ave, Ridgewood, Queens. Phone: +1 718 417 6567. See rolosnyc.com\n\nAdvertisement\n\nHometown Bar-B-Que Brooklyn’s Hometown Bar-B-Que. Classic Southern pit-smoked barbecue in Brooklyn\n\nThis ain’t Texas, but it sure tastes like it. In an industrial warehouse space in Red Hook, Brooklyn, pitmasters smoke delectable brisket, pulled pork, ribs and sausage. Be prepared to wait in line for the juicy, tender meat; don’t arrive too late in the day or you might miss out. The sides are a meal in themselves, from pork-laced collard greens and tangy slaw to creamy mac-and-cheese. For dessert, the banana pudding gets rave reviews.\n\n454 Van Brunt Street, Brooklyn. Phone: +1 347 294 4644. See hometownbbq.com Le Bernardin Steamed black bass at Le Bernardin restaurant, New York. Daniel Krieger\n\nAdvertisement\n\nThree-Michelin star French seafood restaurant\n\nBook a table at Le Bernardin to celebrate a birthday or City Hall wedding in style. If you don’t need an excuse to splurge, simply go there because it’s great. Chef Eric Ripert’s Midtown restaurant is upscale and luxe, befitting the fine-dining French cuisine and impeccable service that has set a high standard for more than 30 years. Mainly seafood-focussed, there’s also a vegetarian menu or filet mignon and lamb for the committed carnivore. The chef’s tasting menu will set you back US$350 per person; US$530 with wine pairing.\n\n155 West 51st Street, New York. Phone: +1 212 554 1515. See le-bernardin.com Balthazar Balthazar has sustained its popularity and hype for 25 years. Ever-popular French brasserie\n\nFirst opened in 1997, it’s still near-impossible to get a prime-time dinner reservation at Keith McNally’s buzzy French-style brasserie, unless you book a month in advance. Why? The food is consistently terrific, from the signature Balthazar burger to veal Milanese, steak frites and roast chicken. A raw bar sends out magnificent seafood towers and a shrimp cocktail that never goes out of style, while the classic cocktails always satisfy. It’s worth trying for a walk-in seat at the bar, where you could be rubbing shoulders with A-list celebrities, models and photographers from nearby Soho studios. Brunch is an occasion you should definitely dress up for.\n\n80 Spring Street, New York. Phone: +1 212 965 1414. See balthazarny.com. Thai Diner\n\nAdvertisement\n\nThai Diner combines colourful kitsch with classic and modern Thai dishes. Creative Thai comfort food in a fun and lively space\n\nIt was always going to be a hit. New Yorkers mourning the closure of acclaimed restaurant Uncle Boons turned out in droves from day one to support chefs Ann Redding and Matt Danzer in their new venture. The all-day space in Chinatown plays it fun, loose and carefree with a menu of creative Thai-American dishes that please the soul as well as the tastebuds. Try the Disco Fries, smothered in Massaman curry with peanuts and coconut cream, stay for the roast chicken and banana blossom salad, feast on Uncle Boon’s traditional crab fried rice. The playful dessert menu – which includes a kitschy strawberry chiffon ‘monster’ cake and a coconut sundae festooned with palm sugar whipped cream – wouldn’t be out of place at a kids’ birthday party.\n\n186 Mott Street, New York. See thaidiner.com Birria-Landia Birria-Landia serves up some of the best street tacos in NYC. The best street tacos in the city\n\nJosé Moreno, a former chef at Eataly, has been credited with starting the Mexican birria craze in NYC. His family-run taco truck, located under the elevated subway tracks in Jackson Heights, was one of the first to sell juicy Tijuana-style beef birria tacos and tostadas. Now, they’re everywhere, including Birria-Landon’s five new locations in Manhattan, Queens, Brooklyn and the Bronx. Tortillas are dipped in beef fat, grilled until crunchy, then stuffed with juicy marinated meat and adobo spices. A side serve of tangy, chunky, beef consomme is for dunking. For under $20, you can try one of everything on the menu. The New York Times gave Birria-Landia a two-star critic’s pick and named it alongside Michelin-starred restaurants as one of the best places to eat in the city.\n\nCorner of 78th Street and Roosevelt Avenue, Queens. Phone: +1 347 283 2162. See birrialandia.com\n\nAdvertisement\n\nRed Rooster Harlem Red Rooster is known for its soul food and live music. Soul food and great music in the heart of Harlem\n\nIf you’re heading up to Harlem, you really should stop in at Red Rooster. No, not that Red Rooster (though there is fried chicken on the menu). Chef Marcus Samuelsson’s vision of a neighbourhood bar and restaurant has succeeded in enticing many Manhattanites north of Central Park, many for the first time. They rave about the consistently delicious soul food, the always-busy bar area and music sets from local performers that can turn a boring Tuesday night into an ecstatic party. Signature dishes to try include fried yardbird, mac and greens, and sweet potato coconut soup.\n\n310 Lenox Avenue, Harlem. Phone: +1 212 792 9001. See redroosterharlem.com Eleven Madison Park Eleven Madison Park draws foodies from across the world.\n\nAdvertisement\n\nFine dining restaurant with a strong plant-based offering\n\nOne of the most celebrated restaurants in New York City, chef Daniel Humm’s Eleven Madison Park became fully plant-based in 2021, only to reintroduce the option of select animal proteins for some dishes in mid-October 2025. You can still opt for the plant-based menu, of course – whatever you order, expect flawless attention to detail, inventive dishes and hyper-local, seasonal ingredients. Diners can enjoy a full tasting menu of eight-to-nine courses, or a five-course bar tasting menu in The Studio (none of which are shared online, due to the rapidly changing nature of seasonal availability). Without a reservation, your best option is to try for walk-in bar seating. Get there early.\n\n11 Madison Ave, New York. Phone: +1 212 889 0905. See elevenmadisonpark.com Smorgasburg Eat your way around the world at Smorgasburg. Outdoor food market featuring popular takeaway food\n\nCome hungry. Said to be the largest weekly open-air food market in the US, Smorgasburg started in Williamsburg and has now expanded to include locations in Prospect Park, World Trade Center, Miami and Los Angeles. Cheesesteaks, bao buns, lobster rolls, dumplings, doughnuts and much more are available, with many of the city’s most successful food trucks getting their start here. On a sunny day, it’s a joy to sit outside and eat your way through dozens of world cuisines. Opening hours vary by location; some vendors accept cash only.\n\n90 Kent Avenue, Brooklyn. Phone: +1 718 928 6603. See smorgasburg.com Semma\n\nAdvertisement\n\nSemma serves dishes that are hard to find outside of southern India. Authentic southern Indian cuisine\n\nForget everything you think you know about Indian food. The cuisine served at Semma in the West Village is rarely prepared outside of homes in south Indian villages. Step inside the bamboo-covered interior and you might feel you’ve been transported to Asia. Lobster tail swimming in turmeric-scented coconut milk, Goanese oxtail with just the right amount of spice, and snails in a ginger-tamarind sauce are three of the highlights. Whole Dungeness crab should be ordered the day before. The Semma team are also behind Indian hotspot Dhamaka in Essex Market on the Lower East Side.\n\n60 Greenwich Avenue, New York. Phone: +1 212 373 8900. See semma.nyc Bar Primi Relaxed and welcoming spot for pasta, pizza and good wine\n\nGo for the excellent pasta, stay for the luscious Sicilian pizza squares, of which the ‘Hot Girl Salami’ is the clear winner. There are now two locations of Bar Primi, one downtown on the Bowery and one in the Penn District near Madison Square Garden. Both serve approachable, delicious Italian food, cocktails and wine in a setting that is buzzy, elegant and fun. Walk-ins are welcome, and the wait for a table is normally not too long. Bar seating is a good option for solo diners.\n\n325 Bowery, New York. Phone: +1 212 220 9100. See barprimi.com Gramercy Tavern\n\nAdvertisement\n\nDanny Myers’ Gramercy Tavern. Getty Images Classic American cuisine in an upscale tavern setting\n\nKnow before you go: There are two distinct dining spaces at Gramercy Tavern. The more formal restaurant features a prix fixe tasting menu of local, seasonal dishes and a top-notch wine list. You might have more fun at the relaxed tavern, where walk-ins can try to nab a seat at the bar and the burgers are worthy of their hype. Many of the ingredients are sourced at the nearby Union Square Green Market. Service is warm and assured, befitting this classic – and classy – spot.\n\n42 East 20th Street, New York. Phone: +1 212 477 0777. See gramercytavern.com Restaurants at Rockefeller Center Alfresco dining at Le Rock. A large collection of cafes, bars and restaurants in midtown Manhattan\n\nThe area of midtown Manhattan around Rockefeller Center was once a dining dead zone, but over the past few years an exciting renaissance has occurred with many of the city’s best-loved F&B brands popping up within the Rock Center precinct. Now, visitors can grab a coffee and pastry to go from Bourke Street Bakery or Magnolia Bakery, linger over a bottle at City Winery, order oysters and steak frites at always-chic Le Rock or dive into pasta and polenta fries at Jupiter. In all, there are dozens of options to suit all tastes and budgets.\n\n45 Rockefeller Plaza, New York. Phone: +1 212 588 8601. See rockefellercenter.com\n\nSign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now.\n\nTraveller Guides",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/europe/house-boats-swallowed-in-canal-collapse-20251223-p5npqu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "House boats swallowed in canal collapse",
        "publish_date": "Tue, 23 Dec 2025 12:10:47 +1100",
        "category": "finance",
        "authors": [],
        "text": "House boats swallowed in canal collapse\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/health-on-the-rise-but-students-turning-off-it-in-first-round-of-university-offers-20251222-p5npf5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Health on the rise but students turning off IT in first round of university offers",
        "publish_date": "Tue, 23 Dec 2025 12:05:00 +1100",
        "category": "finance",
        "authors": [
            "Nicole Precel",
            "Noel Towell"
        ],
        "text": "Health courses are surging in popularity among Victorian teens awaiting a university offer, with society and culture, management and commerce still students’ study areas of choice.\n\nThere are 47,170 year 12 graduates who will receive first-round offers from Victorian universities, TAFE institutions and independent tertiary colleges on Tuesday, with further offers to study in 2026 to be made in January and February.\n\nCelia Pompeani, this year’s dux at Coburg High School, is one of thousands of Victorian teens who will get university offers on Tuesday. Credit: Chris Hopkins\n\nThe fastest-growing area of study is health, which includes nursing and biomedical science, with 9587 students receiving offers to study it next year, up 0.5 per cent from last year’s number, and comprising about 17.6 per cent of all offers.\n\nSociety and culture courses remain the biggest area of interest for prospective students, with 10,936 offers and a 20.1 per cent share of all offers, while management and commerce represents 16.5 per cent of offers.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/bolands-mcg-magic-20251223-p5npqr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Boland's MCG magic",
        "publish_date": "Tue, 23 Dec 2025 12:04:14 +1100",
        "category": "finance",
        "authors": [],
        "text": "Boland's MCG magic\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/books/biography-offers-a-glimpse-into-the-life-of-trailblazer-dame-quentin-bryce-20251121-p5nhc9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beyond the military moustache: How Quentin Bryce made the role of governor-general her own",
        "publish_date": "Tue, 23 Dec 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "Mark Mcginness"
        ],
        "text": "BIOGRAPHY\n\nQuentin Bryce\n\nJuliet Rieden\n\nPenguin, $55\n\nVice-regal memoirs are a relatively rare phenomenon in the history of Australian letters: from Sir William Denison’s two-volumes in 1870 to more recent autobiographies from Kerr, Cowen, Hayden and Cosgrove; and a few consorts: Lady Tennyson, the Duchess of Gloucester, Lady Cowen and notably Alexandra Hasluck’s elegant Portrait in a Mirror (1981). The hallmark has generally been discretion. One wishes there were less of it and more glimpses of the real experience shining light upon the magic. Like Henry Duke of Gloucester, returning home after two years as the 11th governor-general, was asked by Queen Mary, “How was it out there?” “Wretched, Mother, wretched.”\n\nBiographies - even authorised ones – are more forthcoming, among the best Zelman Cowen’s life of his hero, Isaac Isaacs (1993); and Philip Ayres’ Fortunate Voyager (2013), a superb account of the life of Ninian Stephen. Now Juliet Rieden’s biography of the 25th governor-general, Quentin Bryce, has joined the canon.\n\nBryce was the first female law faculty member at the University of Queensland; founding member of the National Women’s Advisory Council; founding Director of the Queensland Women’s Information Service; founding Chair and CEO of the National Childcare Accreditation Council; first female Federal Sex Discrimination Commissioner (these latter two proved especially testing); second female Governor of Queensland; and first female governor-general. If Bill Hayden said it was Stephen who had taken the starchiness out of the office, it was Quentin Bryce who offered an alternative to the military moustache, the ministerial portfolio and the judicial wig.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/hsc-students-receive-university-offers-search-our-database-for-entry-scores-20251216-p5nnz7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "HSC students receive university offers: Search our database for entry scores",
        "publish_date": "Tue, 23 Dec 2025 11:54:39 +1100",
        "category": "lifestyle",
        "authors": [
            "Craig Butt",
            "Sally Rawsthorne"
        ],
        "text": "The state’s top school-leavers are looking beyond the traditional prestigious degrees in law and engineering and opting to study occupational therapy, theology and social work.\n\nMore than 41,000 students received a place at university in Tuesday’s main round of offers.\n\nData from the University Admissions Centre released on Tuesday shows there were 20 courses that attracted a lowest selection rank of 99.95. While this is the highest possible ATAR, the lowest selection rank can also include up to 10 so-called adjustment factor points.\n\nAmong the top courses in the first round of offers were a bachelor of advanced science (honours) at Griffith University, a bachelor of nursing/bachelor of midwifery at La Trobe University, and a bachelor of education (secondary STEM) at the University of New England.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/we-asked-good-food-s-bar-of-the-year-for-a-summer-friendly-alternative-to-eggnog-20251222-p5npj5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "We asked Good Food’s Bar of the Year for a summer-friendly alternative to eggnog",
        "publish_date": "Tue, 23 Dec 2025 11:53:41 +1100",
        "category": "finance",
        "authors": [
            "Michael Chiem"
        ],
        "text": "1 / 5 “This drink isn’t exactly an eggnog, but it is a good alternative,” says Silver’s Motel co-owner Michael Chiem, who is also behind 2024 Bar of the Year, PS40. Dion Georgopoulos 2 / 5 Michael Chiem preparing his festive drinks for Good Food. Dion Georgopoulos 3 / 5 Michael Chiem making a Cameron’s Kick, which is on menu at Silver’s Motel. Dion Georgopoulos 4 / 5 Add a final flourish of nutmeg or cinnamon to your festive cocktail. Dion Georgopoulos 5 / 5 Silver’s Motel co-owners Tynan Sidhu and Chiem. Edwina Pickles Previous Slide Next Slide\n\nIs there a drink less suited to a sweltering Australian Christmas than eggnog? Unlikely. This rich, creamy “egg milk punch” was designed for fireside sipping, not the humidity of a Southern Hemisphere summer. For a smarter alternative, we turned to Michael Chiem, co-owner of The Sydney Morning Herald Good Food Guide Bar of the Year, Silver’s Motel. His suggestion? The Cameron’s Kick, which replaces the eggs with orgeat, a sweet liquid based on almonds. Currently served at Silver’s, “minus the spice garnish”, it’s a refreshing take on a traditional favourite.\n\nThis isn’t eggnog, but it’s an excellent alternative. It is a similar rich, festive drink that is perhaps a bit more palatable than the traditional eggnog you see in cold Christmas countries.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/australias-favourite-christmas-songs-revealed-20251223-p5npqi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia's favourite Christmas songs revealed",
        "publish_date": "Tue, 23 Dec 2025 11:48:09 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Australia's favourite Christmas songs revealed\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-to-rise-as-wall-street-climbs-larry-ellison-guarantees-paramount-bid-20251223-p5npn7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX climbs higher; Larry Ellison guarantees Paramount bid",
        "publish_date": "Tue, 23 Dec 2025 11:37:23 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket has advanced at the open with iron ore miners among the early risers after Wall Street made a steady start to its week.\n\nThe S&P/ASX 200 was up 30.7 points, or 0.4 per cent, to 8730.6 in early trade, with eight of 11 industry sectors in the green.\n\nWall Street rose to kick off the holiday-shortened week. Credit: Bloomberg\n\nMining stocks are mixed, with iron ore heavyweights BHP (up 1 per cent), Rio Tinto (up 1.2 per cent) and Fortescue (up 1.2 per cent) rising, but gold miners retreated, with Northern Star falling 0.9 per cent and Evolution Mining shedding 1.3 per cent in early trade.\n\nFinancial stocks are mixed with Commonwealth Bank – the biggest stock on the index – adding 0.7 per cent while Westpac edged 0.1 per cent higher, though National Australia Bank lost 0.3 per cent and ANZ Bank dipped 0.2 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-simple-christmas-food-swaps-thatll-cut-your-grocery-bill/rjv56o714",
        "title": "The simple Christmas food swaps that'll cut your grocery bill",
        "publish_date": "Mon, 22 Dec 2025 18:34:33 +0000",
        "category": "finance",
        "authors": [],
        "text": "As Christmas creeps closer, so does the pressure on household budgets.\n\n\n\n\n\nBecause while Christmas time offers us days off in the sunshine and time with loved ones, it also can be an expensive time — especially if you're the one buying Christmas lunch for the family.\n\n\n\n\n\nA new survey of 1,002 Australians from Pureprofile found households will spend, on average, $506 on festive food this year — up from $406 in 2024.\n\n\n\n\n\nThat same survey found 78 per cent of Australians plan on adjusting their spending this festive season, with 21 per cent planning to opt for more budget-friendly food and drink on Christmas Day.\n\n\n\n\n\nBut how can you actually save on your Christmas food spread? We asked some experts.\n\n\n\nFresh isn't always better\n\nFresh produce is often treated as the gold standard at Christmas. But frozen alternatives can be just as good — and sometimes better — according to Professor Gary Mortimer from the Queensland University of Technology Business School, who specialises in consumer behaviour.\n\n\n\n\n\n\"Frozen is a better quality because often when seafood is caught and particularly when prawns are caught, they're frozen immediately,\" he told SBS News.\n\n\n\n\n\n\"They're pretty fresh when they're frozen. So when you thaw them out, it's actually just like they've been caught.\"\n\n\n\n\n\nThere's also a clear price advantage.\n\n\n\n\n\n\"You find that the frozen product tends to be cheaper than the fresh product. The same would go for frozen veg over fresh veg,\" Mortimer said.\n\n\n\nWhile it might be tempting to buy fresh prawns, Professor Gary Mortimer said frozen ones can be just as good — and cheaper. Source: Getty / sfe-co2 More Australians are making the switch to frozen, said Eden Radford, media spokesperson at financial comparison site Canstar Blue.\n\n\n\n\n\n\"Fourteen per cent of people are actually buying food before Christmas — before December — and putting it in the freezer to store for later,\" she told SBS News.\n\n\n\n\n\n\"Consumers are getting a lot smarter either by want or by necessity because they know that they're just going to need to save.\n\n\n\n\n\n\"Doing things like shopping around at multiple supermarkets, choosing frozen options ahead of fresh.\"\n\n\n\nLook for what's in 'bountiful supply'\n\nSome fresh produce will be more expensive this year simply because there's less of it available.\n\n\n\n\n\n\"A lot of food tends to be fresh — fresh seafood, fresh fruit [often stone fruit] and those particular types of foods are highly susceptible to the supply and demand effect,\" Mortimer said.\n\n\n\nMortimer points to potatoes as one example: currently stripped from many supermarket shelves due to drought.\n\n\n\n\n\nPrawns and peaches, too, can swing in price depending on disease pressure or unpredictable growing conditions.\n\n\n\n\n\nHis advice? Stay flexible.\n\n\n\n\n\n\"The challenge is looking at what's in bountiful supply, therefore the prices will be relatively low,\" he said.\n\n\n\nThis Christmas, you can expect cheaper basics across the board, with Choice finding the cost of seven items has dropped since the last quarter. Source: SBS News Data from consumer advocacy group Choice found that overall, the cost of a base basket of seven items — apples, carrots, bananas, strawberries, Weet-bix, milk and chicken breast fillets — had fallen across the four big supermarkets in the last quarter.\n\n\n\n\n\nThe item that fell the most in price was strawberries, as expected for seasonal produce.\n\n\n\n\n\nThe price of milk rose at all four supermarkets.\n\n\n\n\n\nThe biggest price reduction came at Woolworths, with the cost of a basket dropping by 16 per cent.\n\n\n\n\n\nAt Aldi, it fell by 11 per cent, Coles by 6 per cent, and IGA by 4 per cent.\n\n\n\n\n\nRadford said more Australians are willing to be flexible on their grocery lists.\n\n\n\n\n\n\"Seventeen per cent of people said they'll always buy the same [Christmas] food. They don't look at price,\" she said.\n\n\n\n\n\n\"That suggests that people are a lot more cost-conscious and are trying to find different ways to save.\n\n\n\n\n\n\"They're willing to make a few changes. They're willing to swap some things out in order for them to save a little bit of money … it could be a different kind of meat or a smaller portion.\"\n\n\n\nBuy in bulk — then split it\n\nOne of the fastest-growing savings strategies is \"collaborative shopping\".\n\n\n\n\n\n\"A large family or a large group will get together … buy in bulk, and share it across two or three families,\" Mortimer said.\n\n\n\n\n\nHe said he's seen families buy half an animal carcass for around $600 and divide it between households. Others head to the markets , split a $400 fruit-and-veg haul, or buy an $80 ham from Costco and portion it out.\n\n\n\nRadford said thinking about portions can be an underrated saving tool.\n\n\n\n\n\nBefore shopping, she encourages people to think about whether they actually need a full-sized ham or if a smaller cut would do — or whether buying a slightly larger item might be cheaper if leftovers will cover multiple meals.\n\n\n\nHome brand is now the quiet hero\n\nMortimer said the days of looking down on supermarket-owned brands are over.\n\n\n\n\n\n\"Today, one in three products [in supermarkets] are a private label supermarket-owned brand,\" he said.\n\n\n\n\n\n\"They're traditionally lower priced than the brand product and equal, if not better quality.\"\n\n\n\nREAD MORE The simple shopping swap that could save you $4,000 a year\n\nMortimer said Christmas is when the quality difference becomes especially noticeable.\n\n\n\n\n\n\"As we move into the Christmas period, we start to see the better quality popping up — the Woolworths Select, the Coles Finest. When it comes to Christmas fare, I'd be looking at those types of products when you have Christmas lunch or dinner,\" he said.\n\n\n\n\n\nRadford said shoppers are getting more analytical: \"Australians aren't just going to take the price that's in front of them. They're going to look at the unit pricing and think if they can go somewhere else.\"\n\n\n\n\n\n\"And they're also opting to go for supermarket-branded items instead of buying the name brand,\" she said.\n\n\n\nShop across supermarkets\n\nChoice also compared the cost of your standard basket of groceries for entertaining — including items such as stuffed olives, Twisties, crackers, pretzels, cheese, and some fresh fruit and veg.\n\n\n\n\n\nAldi had the cheapest shop for party items, costing $41. Its base basket items were also the cheapest at $31.41.\n\n\n\nThe cost of your Christmas shop could differ significantly depending on which supermarket you go to, with Choice research finding Aldi is the cheapest place to go for your party shop. Source: SBS News The combined cost of an entertainment shop and your base basket items, without specials, at Woolworths came to $98.98.\n\n\n\n\n\nColes came in slightly higher at $100.04, while the same basket at IGA would cost you $109.25. Aldi's price was $72.41.\n\n\n\n\n\nAldi remains the consistently cheapest supermarket, Mortimer said, but its smaller range means many shoppers split their shop.\n\n\n\n\"What we are seeing with consumers and have seen for some time now is that they're willing to shop across multiple brands of supermarkets but also independent players to save money and get that choice,\" Mortimer said.\n\n\n\n\n\n\"You may shop at Aldi to get the basics, but you may go to the fruit market to get the lowest priced fruit and vegetables, then you might go to the big supermarkets to get the range you need to finish off Christmas lunch or dinner.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/where-is-the-worlds-most-empathetic-country/xlm4qcf5h",
        "title": "Where is the world's most empathetic country?",
        "publish_date": "Mon, 22 Dec 2025 08:44:02 +0000",
        "category": "finance",
        "authors": [],
        "text": "Where is the world's most empathetic country?\n\nPublished 22 December 2025, 6:43 am\n\nDenmark has been ranked among the 'happiest' countries in the world for more than a decade. Some experts suggest this is due to a focus on learning compassion, empathy and human connection at an early age, which in turn, supports positive inter-personal relations and conflict resolution in adulthood.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/is-the-santa-rally-here/bjzd7worl",
        "title": "Is the Santa rally here?",
        "publish_date": "Mon, 22 Dec 2025 07:25:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/racing/racing-community-in-mourning-after-apprentice-jockey-dies-in-car-crash-20251223-p5npqd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Racing community in mourning after apprentice jockey dies in car crash",
        "publish_date": "Tue, 23 Dec 2025 12:58:51 +1100",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "The racing community is in mourning after the death of 24-year-old apprentice jockey Bronte Simpson in a car crash on Monday night at Mendooran in the NSW Central West.\n\nSimpson died at the scene after her SUV left the Castlereagh Highway about 80 kilometres north-west of Dubbo and hit a tree.\n\nApprentice Bronte Simpson, left, after a win. Credit: Sky Racing\n\nThe Ballarat-raised rider had moved to NSW to start her racing career and began her apprenticeship with Sara Ryan at Wyong in February last year. She transferred to Tamworth trainer Jane Clement last August and had racked up 13 more winners since taking the Kristen Buchanan-trained Stylebender to victory with her first ride, at Muswellbrook on May 2 this year.\n\nSimpson had not ridden since the Dubbo meeting on Saturday and was believed to be travelling home on Monday night after visiting friends.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/katrina-meynink-s-all-time-greatest-party-snack-recipes-20251208-p5nlu7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Katrina Meynink’s all-time greatest party snack recipes",
        "publish_date": "Tue, 23 Dec 2025 12:46:43 +1100",
        "category": "finance",
        "authors": [
            "Katrina Meynink"
        ],
        "text": "Recipe collection\n\nKatrina Meynink’s all-time greatest party snack recipes\n\nThe party starts here. From mortadella olives with dirty martini dip to gunpowder potato gems, these are Katrina Meynink’s best snacks. Prepare to be wowed.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/loss-of-russian-venezuelan-oil-a-drop-in-ocean-for-world-s-crude-glut-20251223-p5npoi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Loss of Russian, Venezuelan oil a drop in ocean for world’s crude glut",
        "publish_date": "Tue, 23 Dec 2025 12:40:54 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "Oil prices are hovering around their lowest point for the year despite the unexpectedly severe impact of US sanctions on Russia’s oil exports and its blockade of tankers entering or leaving Venezuelan ports.\n\nBrent crude, which traded below $US59 ($88) a barrel last week before reports of progress in Ukrainian peace talks lifted prices above $US60 a barrel, is still trading at less than $US62 a barrel despite a rising volume of stranded Russian oil.\n\nAn Iranian oil tanker at anchor near a refinery in Puerto Cabello, Venezuela, before the US began targeting similar vessels. Credit: AP\n\nWith the Trump administration seizing two sanctioned tankers off the Venezuelan coast and chasing a third, Venezuela’s oil exports are shrinking. Where, earlier this year, it was exporting more than a million barrels a day, exports are now down to less than 800,000 barrels and falling as tankers steer clear of its coast.\n\nThe impact of what analysts think could be the withdrawal of about 500,000 barrels a day of Venezuelan oil, as a result of the US chokehold, is less significant for the market and oil price than what’s happening to Russia’s exports. (Venezuelan oil represented only about one per cent of global supply even at its peak this year.)",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/traveller/inspiration/new-york-s-best-places-to-eat-and-drink-20221005-h26xah.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "New York’s best places to eat and drink",
        "publish_date": "Tue, 23 Dec 2025 12:22:14 +1100",
        "category": "finance",
        "authors": [
            "Kristie Kellahan"
        ],
        "text": "Advertisement\n\nInspirationNew York New York’s best places to eat and drink Kristie Kellahan Updated December 23, 2025 — 12:22pm ,first published April 10, 2023 — 4:34pm Save You have reached your maximum number of saved items. Remove items from your saved list to add more. Save this article for later Add articles to your saved list and come back to them anytime. Got it Share\n\nThis article is part of Traveller’s Destination Guide to New York. See all stories .\n\nIt’s an impossible task to shortlist New York City’s best of the best restaurants. In one of the most diverse and exciting culinary destinations of the world, there are more than 25,000 places to eat, with more opening every day. Most are good (or they don’t last long); many are spectacular. What we can do is take a highly opinionated stance and steer you in the direction of spots we love. They’re reliably delicious, memorable and so much fun. Go on, take a bite. Atomix The bar at Korean diner Atomix. Elevated, innovative Korean dining in Manhattan\n\nThe only restaurant in New York to make The World’s 50 Best Restaurants list in 2025 (it came in at number 12), Atomix delivers innovative Korean fine dining at its most impressive. The 12-course tasting menu experience combines meticulous technique and surprising ingredients (kohlrabi and caviar; mussel and bluefin tuna with cheonggukjang) with exemplary service. Korean-born husband-and-wife team, Ellia and Junghyun ‘JP’ Park, welcome diners to an elegant, minimal space in the NoMad neighbourhood of Manhattan.\n\n104 East 30th Street, New York. Phone: +1 646 476 7217. See atomixnyc.com Mama’s Too\n\nAdvertisement\n\nQueues outside Mamas Too! on Bleecker Street. Alamy Stock Photo Arguably the best pizza in the city\n\nWhy name just one best pizza in New York when the city is full of outstanding slices and pies to devour? The square slices at Mama’s Too are right up there, with toppings ranging from classic (pepperoni cups) to inventive (Cacio e Pepe) and inspired (poached pear, mozzarella, sweet gorgonzola and hot honey). The original location is on the Upper West Side, but the West Village restaurant has an advantage: It’s a couple of hundred metres from L’Industrie Pizzeria, another strong contender for the city’s best pizza. Try them both and decide for yourself.\n\n323 Bleecker Street, New York. Phone: +1 212 510 7256. See mamastoo.com Tatiana by Kwame Onwuachi Interiors at Tatiana by Kwame Onwuachi. Adrian Gaut, courtesy of Modellus Novus and Lincoln Center Afro-Caribbean-NYC dishes by an acclaimed chef\n\nAward-winning chef and cookbook author Kwame Onwuachi brings the spice and flavour of his “Afro-Caribbean-raised-in-the-Bronx” heritage to the Upper West Side at Tatiana, a glamorous addition to the Lincoln Center precinct. It’s still one of the toughest reservations in the city, its popularity fuelled by countless awards and satisfying plates of curried goat patties, jerk lamb rib and buttery head-on shrimp. The New York Times named it the best restaurant in the city in 2023, less than a year after it opened; in 2025, it remains in the top 10.\n\n10 Lincoln Center Plaza, New York. Phone: +1 212 875 5222. See tatiananyc.com\n\nAdvertisement\n\nDante Australian-owned Dante in New York. Italian-inspired all-day cafe with excellent cocktails\n\nEstablished in 1915 as Caffé Dante, this Greenwich Village gem has been under Aussie management since 2015 when hospo power couple Linden Pride and Nathalie Hudson took the reins. Go there for the best Negronis in the city (on tap, no less), afternoon spritz specials and seasonal cocktails. The Italian-ish brunch and all-day-until-late menu shows some green-and-gold influence, with housemade banana bread and avocado toast alongside more Continental antipasti, flatbreads and pasta. The signature burger on a brioche bun is a delight. A second location, Dante West Village, serves food until midnight, seven days.\n\n79-81 MacDougal Street, New York. Phone: +1 212 982 5275. See dante-nyc.com Rolo’s Neighbourhood bar and grill for families, solos, dates\n\nThe restaurant at Rolo’s is consistently booked out, but don’t let that stop you crossing town to trendy Ridgewood on the border of Queens and Brooklyn. The terrific food and service is worth the wait (and Michelin Bib Gourmand recognition) and the sceney bar takes walk-ins. Launched by former Gramercy Tavern alums, Rolo’s sets the bar high with a menu of wood-fired specialties that starts with fluffy polenta bread and leads to deliciously charred lasagna and butter-smeared dry-aged steaks. The cocktail game is strong.\n\n853 Onderdonk Ave, Ridgewood, Queens. Phone: +1 718 417 6567. See rolosnyc.com\n\nAdvertisement\n\nHometown Bar-B-Que Brooklyn’s Hometown Bar-B-Que. Classic Southern pit-smoked barbecue in Brooklyn\n\nThis ain’t Texas, but it sure tastes like it. In an industrial warehouse space in Red Hook, Brooklyn, pitmasters smoke delectable brisket, pulled pork, ribs and sausage. Be prepared to wait in line for the juicy, tender meat; don’t arrive too late in the day or you might miss out. The sides are a meal in themselves, from pork-laced collard greens and tangy slaw to creamy mac-and-cheese. For dessert, the banana pudding gets rave reviews.\n\n454 Van Brunt Street, Brooklyn. Phone: +1 347 294 4644. See hometownbbq.com Le Bernardin Steamed black bass at Le Bernardin restaurant, New York. Daniel Krieger\n\nAdvertisement\n\nThree-Michelin star French seafood restaurant\n\nBook a table at Le Bernardin to celebrate a birthday or City Hall wedding in style. If you don’t need an excuse to splurge, simply go there because it’s great. Chef Eric Ripert’s Midtown restaurant is upscale and luxe, befitting the fine-dining French cuisine and impeccable service that has set a high standard for more than 30 years. Mainly seafood-focussed, there’s also a vegetarian menu or filet mignon and lamb for the committed carnivore. The chef’s tasting menu will set you back US$350 per person; US$530 with wine pairing.\n\n155 West 51st Street, New York. Phone: +1 212 554 1515. See le-bernardin.com Balthazar Balthazar has sustained its popularity and hype for 25 years. Ever-popular French brasserie\n\nFirst opened in 1997, it’s still near-impossible to get a prime-time dinner reservation at Keith McNally’s buzzy French-style brasserie, unless you book a month in advance. Why? The food is consistently terrific, from the signature Balthazar burger to veal Milanese, steak frites and roast chicken. A raw bar sends out magnificent seafood towers and a shrimp cocktail that never goes out of style, while the classic cocktails always satisfy. It’s worth trying for a walk-in seat at the bar, where you could be rubbing shoulders with A-list celebrities, models and photographers from nearby Soho studios. Brunch is an occasion you should definitely dress up for.\n\n80 Spring Street, New York. Phone: +1 212 965 1414. See balthazarny.com. Thai Diner\n\nAdvertisement\n\nThai Diner combines colourful kitsch with classic and modern Thai dishes. Creative Thai comfort food in a fun and lively space\n\nIt was always going to be a hit. New Yorkers mourning the closure of acclaimed restaurant Uncle Boons turned out in droves from day one to support chefs Ann Redding and Matt Danzer in their new venture. The all-day space in Chinatown plays it fun, loose and carefree with a menu of creative Thai-American dishes that please the soul as well as the tastebuds. Try the Disco Fries, smothered in Massaman curry with peanuts and coconut cream, stay for the roast chicken and banana blossom salad, feast on Uncle Boon’s traditional crab fried rice. The playful dessert menu – which includes a kitschy strawberry chiffon ‘monster’ cake and a coconut sundae festooned with palm sugar whipped cream – wouldn’t be out of place at a kids’ birthday party.\n\n186 Mott Street, New York. See thaidiner.com Birria-Landia Birria-Landia serves up some of the best street tacos in NYC. The best street tacos in the city\n\nJosé Moreno, a former chef at Eataly, has been credited with starting the Mexican birria craze in NYC. His family-run taco truck, located under the elevated subway tracks in Jackson Heights, was one of the first to sell juicy Tijuana-style beef birria tacos and tostadas. Now, they’re everywhere, including Birria-Landon’s five new locations in Manhattan, Queens, Brooklyn and the Bronx. Tortillas are dipped in beef fat, grilled until crunchy, then stuffed with juicy marinated meat and adobo spices. A side serve of tangy, chunky, beef consomme is for dunking. For under $20, you can try one of everything on the menu. The New York Times gave Birria-Landia a two-star critic’s pick and named it alongside Michelin-starred restaurants as one of the best places to eat in the city.\n\nCorner of 78th Street and Roosevelt Avenue, Queens. Phone: +1 347 283 2162. See birrialandia.com\n\nAdvertisement\n\nRed Rooster Harlem Red Rooster is known for its soul food and live music. Soul food and great music in the heart of Harlem\n\nIf you’re heading up to Harlem, you really should stop in at Red Rooster. No, not that Red Rooster (though there is fried chicken on the menu). Chef Marcus Samuelsson’s vision of a neighbourhood bar and restaurant has succeeded in enticing many Manhattanites north of Central Park, many for the first time. They rave about the consistently delicious soul food, the always-busy bar area and music sets from local performers that can turn a boring Tuesday night into an ecstatic party. Signature dishes to try include fried yardbird, mac and greens, and sweet potato coconut soup.\n\n310 Lenox Avenue, Harlem. Phone: +1 212 792 9001. See redroosterharlem.com Eleven Madison Park Eleven Madison Park draws foodies from across the world.\n\nAdvertisement\n\nFine dining restaurant with a strong plant-based offering\n\nOne of the most celebrated restaurants in New York City, chef Daniel Humm’s Eleven Madison Park became fully plant-based in 2021, only to reintroduce the option of select animal proteins for some dishes in mid-October 2025. You can still opt for the plant-based menu, of course – whatever you order, expect flawless attention to detail, inventive dishes and hyper-local, seasonal ingredients. Diners can enjoy a full tasting menu of eight-to-nine courses, or a five-course bar tasting menu in The Studio (none of which are shared online, due to the rapidly changing nature of seasonal availability). Without a reservation, your best option is to try for walk-in bar seating. Get there early.\n\n11 Madison Ave, New York. Phone: +1 212 889 0905. See elevenmadisonpark.com Smorgasburg Eat your way around the world at Smorgasburg. Outdoor food market featuring popular takeaway food\n\nCome hungry. Said to be the largest weekly open-air food market in the US, Smorgasburg started in Williamsburg and has now expanded to include locations in Prospect Park, World Trade Center, Miami and Los Angeles. Cheesesteaks, bao buns, lobster rolls, dumplings, doughnuts and much more are available, with many of the city’s most successful food trucks getting their start here. On a sunny day, it’s a joy to sit outside and eat your way through dozens of world cuisines. Opening hours vary by location; some vendors accept cash only.\n\n90 Kent Avenue, Brooklyn. Phone: +1 718 928 6603. See smorgasburg.com Semma\n\nAdvertisement\n\nSemma serves dishes that are hard to find outside of southern India. Authentic southern Indian cuisine\n\nForget everything you think you know about Indian food. The cuisine served at Semma in the West Village is rarely prepared outside of homes in south Indian villages. Step inside the bamboo-covered interior and you might feel you’ve been transported to Asia. Lobster tail swimming in turmeric-scented coconut milk, Goanese oxtail with just the right amount of spice, and snails in a ginger-tamarind sauce are three of the highlights. Whole Dungeness crab should be ordered the day before. The Semma team are also behind Indian hotspot Dhamaka in Essex Market on the Lower East Side.\n\n60 Greenwich Avenue, New York. Phone: +1 212 373 8900. See semma.nyc Bar Primi Relaxed and welcoming spot for pasta, pizza and good wine\n\nGo for the excellent pasta, stay for the luscious Sicilian pizza squares, of which the ‘Hot Girl Salami’ is the clear winner. There are now two locations of Bar Primi, one downtown on the Bowery and one in the Penn District near Madison Square Garden. Both serve approachable, delicious Italian food, cocktails and wine in a setting that is buzzy, elegant and fun. Walk-ins are welcome, and the wait for a table is normally not too long. Bar seating is a good option for solo diners.\n\n325 Bowery, New York. Phone: +1 212 220 9100. See barprimi.com Gramercy Tavern\n\nAdvertisement\n\nDanny Myers’ Gramercy Tavern. Getty Images Classic American cuisine in an upscale tavern setting\n\nKnow before you go: There are two distinct dining spaces at Gramercy Tavern. The more formal restaurant features a prix fixe tasting menu of local, seasonal dishes and a top-notch wine list. You might have more fun at the relaxed tavern, where walk-ins can try to nab a seat at the bar and the burgers are worthy of their hype. Many of the ingredients are sourced at the nearby Union Square Green Market. Service is warm and assured, befitting this classic – and classy – spot.\n\n42 East 20th Street, New York. Phone: +1 212 477 0777. See gramercytavern.com Restaurants at Rockefeller Center Alfresco dining at Le Rock. A large collection of cafes, bars and restaurants in midtown Manhattan\n\nThe area of midtown Manhattan around Rockefeller Center was once a dining dead zone, but over the past few years an exciting renaissance has occurred with many of the city’s best-loved F&B brands popping up within the Rock Center precinct. Now, visitors can grab a coffee and pastry to go from Bourke Street Bakery or Magnolia Bakery, linger over a bottle at City Winery, order oysters and steak frites at always-chic Le Rock or dive into pasta and polenta fries at Jupiter. In all, there are dozens of options to suit all tastes and budgets.\n\n45 Rockefeller Plaza, New York. Phone: +1 212 588 8601. See rockefellercenter.com\n\nSign up for the Traveller Deals newsletter Get exclusive travel deals delivered straight to your inbox. Sign up now.\n\nTraveller Guides",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/europe/house-boats-swallowed-in-canal-collapse-20251223-p5npqu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "House boats swallowed in canal collapse",
        "publish_date": "Tue, 23 Dec 2025 12:10:47 +1100",
        "category": "finance",
        "authors": [],
        "text": "House boats swallowed in canal collapse\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/health-on-the-rise-but-students-turning-off-it-in-first-round-of-university-offers-20251222-p5npf5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Health on the rise but students turning off IT in first round of university offers",
        "publish_date": "Tue, 23 Dec 2025 12:05:00 +1100",
        "category": "finance",
        "authors": [
            "Nicole Precel",
            "Noel Towell"
        ],
        "text": "Health courses are surging in popularity among Victorian teens awaiting a university offer, with society and culture, management and commerce still students’ study areas of choice.\n\nThere are 47,170 year 12 graduates who will receive first-round offers from Victorian universities, TAFE institutions and independent tertiary colleges on Tuesday, with further offers to study in 2026 to be made in January and February.\n\nCelia Pompeani, this year’s dux at Coburg High School, is one of thousands of Victorian teens who will get university offers on Tuesday. Credit: Chris Hopkins\n\nThe fastest-growing area of study is health, which includes nursing and biomedical science, with 9587 students receiving offers to study it next year, up 0.5 per cent from last year’s number, and comprising about 17.6 per cent of all offers.\n\nSociety and culture courses remain the biggest area of interest for prospective students, with 10,936 offers and a 20.1 per cent share of all offers, while management and commerce represents 16.5 per cent of offers.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/bolands-mcg-magic-20251223-p5npqr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Boland's MCG magic",
        "publish_date": "Tue, 23 Dec 2025 12:04:14 +1100",
        "category": "finance",
        "authors": [],
        "text": "Boland's MCG magic\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/books/biography-offers-a-glimpse-into-the-life-of-trailblazer-dame-quentin-bryce-20251121-p5nhc9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Beyond the military moustache: How Quentin Bryce made the role of governor-general her own",
        "publish_date": "Tue, 23 Dec 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "Mark Mcginness"
        ],
        "text": "BIOGRAPHY\n\nQuentin Bryce\n\nJuliet Rieden\n\nPenguin, $55\n\nVice-regal memoirs are a relatively rare phenomenon in the history of Australian letters: from Sir William Denison’s two-volumes in 1870 to more recent autobiographies from Kerr, Cowen, Hayden and Cosgrove; and a few consorts: Lady Tennyson, the Duchess of Gloucester, Lady Cowen and notably Alexandra Hasluck’s elegant Portrait in a Mirror (1981). The hallmark has generally been discretion. One wishes there were less of it and more glimpses of the real experience shining light upon the magic. Like Henry Duke of Gloucester, returning home after two years as the 11th governor-general, was asked by Queen Mary, “How was it out there?” “Wretched, Mother, wretched.”\n\nBiographies - even authorised ones – are more forthcoming, among the best Zelman Cowen’s life of his hero, Isaac Isaacs (1993); and Philip Ayres’ Fortunate Voyager (2013), a superb account of the life of Ninian Stephen. Now Juliet Rieden’s biography of the 25th governor-general, Quentin Bryce, has joined the canon.\n\nBryce was the first female law faculty member at the University of Queensland; founding member of the National Women’s Advisory Council; founding Director of the Queensland Women’s Information Service; founding Chair and CEO of the National Childcare Accreditation Council; first female Federal Sex Discrimination Commissioner (these latter two proved especially testing); second female Governor of Queensland; and first female governor-general. If Bill Hayden said it was Stephen who had taken the starchiness out of the office, it was Quentin Bryce who offered an alternative to the military moustache, the ministerial portfolio and the judicial wig.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/hsc-students-receive-university-offers-search-our-database-for-entry-scores-20251216-p5nnz7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "HSC students receive university offers: Search our database for entry scores",
        "publish_date": "Tue, 23 Dec 2025 11:54:39 +1100",
        "category": "lifestyle",
        "authors": [
            "Craig Butt",
            "Sally Rawsthorne"
        ],
        "text": "The state’s top school-leavers are looking beyond the traditional prestigious degrees in law and engineering and opting to study occupational therapy, theology and social work.\n\nMore than 41,000 students received a place at university in Tuesday’s main round of offers.\n\nData from the University Admissions Centre released on Tuesday shows there were 20 courses that attracted a lowest selection rank of 99.95. While this is the highest possible ATAR, the lowest selection rank can also include up to 10 so-called adjustment factor points.\n\nAmong the top courses in the first round of offers were a bachelor of advanced science (honours) at Griffith University, a bachelor of nursing/bachelor of midwifery at La Trobe University, and a bachelor of education (secondary STEM) at the University of New England.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/we-asked-good-food-s-bar-of-the-year-for-a-summer-friendly-alternative-to-eggnog-20251222-p5npj5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "We asked Good Food’s Bar of the Year for a summer-friendly alternative to eggnog",
        "publish_date": "Tue, 23 Dec 2025 11:53:41 +1100",
        "category": "finance",
        "authors": [
            "Michael Chiem"
        ],
        "text": "1 / 5 “This drink isn’t exactly an eggnog, but it is a good alternative,” says Silver’s Motel co-owner Michael Chiem, who is also behind 2024 Bar of the Year, PS40. Dion Georgopoulos 2 / 5 Michael Chiem preparing his festive drinks for Good Food. Dion Georgopoulos 3 / 5 Michael Chiem making a Cameron’s Kick, which is on menu at Silver’s Motel. Dion Georgopoulos 4 / 5 Add a final flourish of nutmeg or cinnamon to your festive cocktail. Dion Georgopoulos 5 / 5 Silver’s Motel co-owners Tynan Sidhu and Chiem. Edwina Pickles Previous Slide Next Slide\n\nIs there a drink less suited to a sweltering Australian Christmas than eggnog? Unlikely. This rich, creamy “egg milk punch” was designed for fireside sipping, not the humidity of a Southern Hemisphere summer. For a smarter alternative, we turned to Michael Chiem, co-owner of The Sydney Morning Herald Good Food Guide Bar of the Year, Silver’s Motel. His suggestion? The Cameron’s Kick, which replaces the eggs with orgeat, a sweet liquid based on almonds. Currently served at Silver’s, “minus the spice garnish”, it’s a refreshing take on a traditional favourite.\n\nThis isn’t eggnog, but it’s an excellent alternative. It is a similar rich, festive drink that is perhaps a bit more palatable than the traditional eggnog you see in cold Christmas countries.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/australias-favourite-christmas-songs-revealed-20251223-p5npqi.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia's favourite Christmas songs revealed",
        "publish_date": "Tue, 23 Dec 2025 11:48:09 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Australia's favourite Christmas songs revealed\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-to-rise-as-wall-street-climbs-larry-ellison-guarantees-paramount-bid-20251223-p5npn7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX climbs higher; Larry Ellison guarantees Paramount bid",
        "publish_date": "Tue, 23 Dec 2025 11:37:23 +1100",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket has advanced at the open with iron ore miners among the early risers after Wall Street made a steady start to its week.\n\nThe S&P/ASX 200 was up 30.7 points, or 0.4 per cent, to 8730.6 in early trade, with eight of 11 industry sectors in the green.\n\nWall Street rose to kick off the holiday-shortened week. Credit: Bloomberg\n\nMining stocks are mixed, with iron ore heavyweights BHP (up 1 per cent), Rio Tinto (up 1.2 per cent) and Fortescue (up 1.2 per cent) rising, but gold miners retreated, with Northern Star falling 0.9 per cent and Evolution Mining shedding 1.3 per cent in early trade.\n\nFinancial stocks are mixed with Commonwealth Bank – the biggest stock on the index – adding 0.7 per cent while Westpac edged 0.1 per cent higher, though National Australia Bank lost 0.3 per cent and ANZ Bank dipped 0.2 per cent.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/family-travel-perks-curbed-mp-015010065.html",
        "title": "Family travel perks curbed after MP expenses outrage",
        "publish_date": "2025-12-23T01:50:10Z",
        "category": "finance",
        "authors": [],
        "text": "Families of politicians could be downgraded to economy class flights and stopped from claiming taxpayer-funded trips to major sporting events.\n\nPrime Minister Anthony Albanese has moved to restrict family reunion travel entitlements for MPs following weeks of backlash around ministers charging the public purse to fly spouses to grand finals and private holidays.\n\nAttorney-General Michelle Rowland paid back about $10,000 after charging taxpayers more than $20,000 for family travel to Perth for a week-long holiday in 2023 following ministerial engagements in the west.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"I received advice from the Independent Authority that a portion of that, for one use two and a half years ago was outside the guidelines,\" she told ABC radio on Tuesday.\n\n\"So, I sought advice on that and repaid that amount.\"\n\nAttorney-General Michelle Rowland says she has repaid the one travel that fell outside the rules. (Mick Tsikas/AAP PHOTOS)\n\nSports Minister Anika Wells also came under fire for flying her husband to numerous grand finals and the Australian Open, as well as taking her family to the snow while claiming family reunion flights.\n\nMr Albanese wrote to the Independent Parliamentary Expenses Authority seeking advice and had now written to the independent remuneration tribunal with recommendations for changes that advice was received.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe tribunal sets politicians wages and entitlements.\n\n\"It is appropriate that we have an arm's length process on these matters,\" Mr Albanese told reporters in Canberra.\n\nFamily travel should be downgraded from business class to economy, he said he recommended in his letter.\n\nFlights should also be restricted to between Canberra and the MP's local area, effectively removing access to nationwide entitlements, he said.\n\nThe prime minister's recommendations on travel entitlements follow public outrage over claims. (Bianca De Marchi/AAP PHOTOS)\n\nBut spouses or partners of senior office holders should be able to claim flights to events they are invited to that directly relate to a minister's portfolio or parliamentary duties, Mr Albanese recommended.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe prime minister also called for the tribunal take into account the circumstances of new mothers or fathers, or MPs with children who are dependents, to make sure parents aren't disadvantaged.\n\n\"We want a parliament that reflects Australia in all its diversity,\" he said.\n\n\"That includes the fact that this parliament looks very different from what it did when I came here in 1996 - that's a good thing.\"\n\nThe tribunal will consider the recommendations in early January.",
        "source": "Yahoo"
    }
]