[
    {
        "url": "https://www.9news.com.au/national/satellite-images-show-how-firebesieged-towns-looked-before-and-after-deadly-victorian-blazes/8e9b7800-3b01-4147-aed0-e12b631a84eb",
        "title": "Satellite images show how fire-besieged towns looked before and after deadly Victorian blazes",
        "publish_date": "Fri, 16 Jan 2026 20:00:56 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "More than 1000 structures across Victoria have been damaged or destroyed by the fires,\n\nincluding 290 homes\n\nwhich have been reduced to ash and rubble.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/paracetamol-health-study-safe-for-pregnant-women-panadol-tylenol-donald-trump-news/8329a62a-a016-465f-baea-46b270ec69a9",
        "title": "'Gold-standard' study rejects Trump's claims on paracetamol",
        "publish_date": "Fri, 16 Jan 2026 23:37:41 +0000",
        "category": "lifestyle",
        "authors": [
            "Jan"
        ],
        "text": "A \"gold-standard\" study has rejected the Trump administration's advice for pregnant mothers to not take paracetamol .\n\nIn September last year, Donald Trump and his Health Secretary Robert F Kennedy Jr urged expecting mothers to avoid the common painkiller .\n\nThey claimed paracetamol, known in the US by the brand name Tylenol, had been linked to autism in children.\n\nREAD MORE: What the Greenland dispute means for NATO\n\nParacetamol is safe for pregnant mothers, a new study has confirmed. (Nine)\n\nBut an evidence review published in The Lancet found there was no evidence taking the drug while pregnant increased the risk of autism, ADHD or intellectual disability among children.\n\nThe systematic review looked at 43 studies to draw its conclusion.\n\nGynaecologist and senior lecturer at the University of Melbourne Joseph Sgroi said paracetamol is safe to use as directed.\n\n\"Simply put, when rigorous methods are applied, and accounting for all bias, the previously suggested harms do not hold up,\" he said.\n\n\"What is well established, however, is that untreated pain and especially high maternal temperatures can be harmful in pregnancy.\n\n\"Fever has been associated with miscarriage, preterm birth, and congenital anomalies.\n\n\"For this reason, avoiding paracetamol out of fear is not evidence-based and may place both mother and baby at risk.\"\n\nParacetamol is commonly sold in Australia under the brand name Panadol. (Rafael Ben-Ari - stock.adobe.com)\n\nIn September, Trump and Kennedy, neither of whom have any medical training, instead urged mothers to tough it out.\n\n\"Taking Tylenol is not good,\" the president said.\n\n\"For this reason, they are strongly recommending that women limit Tylenol use during pregnancy unless medically necessary.\"\n\nTrump also said, without any medical evidence, that Tylenol should not be given to children .\n\nThe president's remarks were immediately decried by doctors and scientists around the world.\n\nThe Lancet's review published today found the links between paracetamol and autism were \"often based on studies prone to biases\".\n\nThe current TGA guidelines for paracetamol use recommend adults and children 12 years or older take 500 to 1000mg every four to six hours as necessary.\n\nPresident Donald Trump claimed without reliable evidence that paracetamol was not safe to take. (AP)\n\nThe maximum adult dose is ﻿4000mg in any 24-hour period.\n\nThe optimal dose for younger children is ﻿15mg per kg, which can be given every four to six hours as required.\n\nChildren should have no more than four doses in 24 hours.\n\nParacetamol should always be used in accordance with the directions on the label and individuals should not take more than one medication containing paracetamol at the same time.\n\nDOWNLOAD THE 9NEWS APP : Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/adelaide-news-amy-bowden-mum-campaign-tougher-laws-after-daughters-overdose-death-ethan-ross/9f2434cd-cc35-4761-bcff-0360f4784e0d",
        "title": "Mother's emotional plea two years after daughter's death",
        "publish_date": "Fri, 16 Jan 2026 23:17:31 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "A South Australian mother has made an emotional plea for tougher penalties for those who fail to seek help in an emergency, two years after her daughter's overdose death.\n\nAmy Bowden's boyfriend Ethan Ross was there in her final moments but he failed to get help as the 26-year-old lay unconscious inside her Redwood Park home in Adelaide 's north-east.\n\nHe has since admitted he injected Amy with meth to try to reverse a heroin overdose in February 2024.\n\nREAD MORE: British band Pulp backflips on Adelaide festival withdrawal ﻿\n\nAmy Bowden died in February 2024. (Supplied)\n\nThe next day she was found dead, which was a fate her family said could have been avoided.\n\n\"Amy was a stunningly beautiful person inside and out,\" her mum Michelle Sposito said.\n\n\"Her death could most likely have been preventable if Ethan Ross had called Triple Zero and got real help for her.\"\n\nRoss previously pleaded guilty to administering a drug, a charge Amy's family says is inadequate.\n\nThey want new laws targeting those who fail to get help during an emergency.\n\n\"In other states and territories we have specific laws to make sure perpetrators are held to greater account,\" Sposito said.\n\nFacing a maximum 10 years behind bars, Ross sat silently inside the courtroom today as Bowden's family refused his apology letter.\n\nEthan Ross previously pleaded guilty to administering a drug, a charge Amy Bowden's family says is inadequate. (Supplied)\n\n\"We don't believe it's an apology, it's just another way to get out of where he is,\" step-father Bryan Bowden said.\n\nRoss, who is in custody, will be sentenced in a fortnight.\n\nBut Sposito said that won't be the end of her fight as she plans to continue to work in her daughter's name and rally the government for tougher laws.\n\nThe government said it was monitoring the case closely.\n\n\"We will never stop fighting for justice for our beautiful Amy,\" Sposito said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/woman-charged-over-alleged-domestic-related-stabbing-newcastle/c0db4c0d-3719-4952-980f-3917dc0d5acf",
        "title": "Woman charged over alleged stabbing in Newcastle",
        "publish_date": "Sat, 17 Jan 2026 00:36:07 +0000",
        "category": "sports",
        "authors": [
            "Jan"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/panda-mart-faces-130-charges-over-alleged-unsafe-electrical-products/ad3aaba5-7fed-4204-97ad-91d552ff2f94",
        "title": "Budget retailer faces 130 charges over alleged safety offences",
        "publish_date": "Fri, 16 Jan 2026 23:02:42 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "The investigation began after the regulator received information from another regulator in\n\nNew Zealand\n\nrelated to possible non-compliant products being sold by the retailer.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sydney-prepares-for-weekend-of-wild-weather/485693c2-89ab-4ed3-b70e-9f33b329e37c",
        "title": "Sydney braces for wild weather as super storm closes in",
        "publish_date": "Fri, 16 Jan 2026 21:52:50 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Following a\n\nheatwave\n\nthat gripped Sydney last weekend, the city is now bracing for its wettest weekend this\n\nsummer\n\n, with up to 20mm of rainfall possible on both Saturday and Sunday.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/jeanswest-ai-advertising-social-media-expert-reactions/a5a1d68d-45ee-44bb-bc77-38a59ccc0c29",
        "title": "Legacy Aussie retailer lashed over this image: 'Garbage'",
        "publish_date": "Fri, 16 Jan 2026 01:57:31 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "L﻿ess than three months ago, industry experts told 9news.com.au the use of generative AI in advertising will be much more common in the future.\n\nJeanswest has proven them right far sooner than expected.\n\nThe fashion retailer, which has gone into administration twice in the last six years, has been called out by consumers for using generative AI extensively in advertising online.\n\nREAD MORE: Unwelcome sign nasty interest rate shock is on the way\n\nMany promotional images on the Jeanswest website appear to be AI-generated. (Jeanswest)\n\nInstagram videos show AI models posing in digital versions of Jeanswest styles, and the brand's website ﻿is stacked with AI-generated photos and videos.\n\n9news.com.au has contacted Jeanswest for comment.﻿\n\nA Jeanswest customer support representative confirmed the ﻿content was AI-generated in a statement to the Sydney Morning Herald.\n\nREAD MORE: Man wounded in early morning shooting in Sydney\n\nThe representative told the SMH that ﻿AI is one of many tools in the brand's creative workflow and said it is dedicated to maintaining authenticity and relatability.\n\nProduct photos on the Jeanswest website do not appear to be AI-generated or altered.\n\nConsumers have voiced frustration and disappointment with the brand's heavy use of generative AI on social media, calling it \"garbage\".\n\nA screenshot from an AI-generated video posted to the official Jeanswest Instagram account. (Instagram/@jeanswest)\n\nOne comment on an AI video on the Jeanswest Instagram page called for the people responsible for approving the clip to be fired.﻿\n\nOn TikTok, an Australian user called content on the brand's website \"AI slop\"﻿.\n\n﻿\"At the moment, there are a lot of brands trying to use AI and using it in a really clumsy way that's getting a lot of ridicule,\" consumer psychologist, creative strategist, and Thinkerbell founder Adam Ferrier﻿ previously told 9news.com.au.\n\nBut AI can be a powerful marketing tool when used well and Ferrier﻿ said it will become more common in advertising as brands become better at using it.\n\nUniversity of Sydney Business School lecturer and consumer psychologist Dr Christina Anthony said it's likely that consumers will not react as strongly to AI ad campaigns as they become more normalised.\n\n\"And ﻿most brands won't abandon generative AI as the efficiencies are too valuable,\" she previously told 9news.com.au.\n\nInstead, they'll work towards making AI content that feels more authentic and human-centred – so much so that it may become undetectable.\n\nNew data has shown that more than half of Australians are unable to tell the difference between a real image and a deepfake .\n\nThough consumers seem to have spotted Jeanswest's clunky AI content without any issue, future generative AI ad campaigns made with rapidly improving technology will likely be harder to identify﻿.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sydney-3-billion-plan-to-prevent-debris-balls-from-washing-up-on-beaches/ce522c52-19a8-4ead-84a4-fbd8d5ee74cf",
        "title": "Billions thrown at preventing debris balls from washing up on Sydney beaches",
        "publish_date": "Fri, 16 Jan 2026 02:45:47 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Water Minister Rose Jackson said \"no one\" wants to see debris balls wash up on the coastline as she announced the\n\nstate\n\nwould invest $3 billion over 10 years to reduce the amount of wastewater that needs to be discharged through the deep ocean outfall in Malabar.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/donald-trump-organisation-family-investment/5ec586fc-195a-4fa5-8520-790abd60806b",
        "title": "Trump family eyeing Gold Coast property as latest investment",
        "publish_date": "Fri, 16 Jan 2026 00:55:16 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Donald Trump's family is eyeing their first Trump-branded property on Australian soil, with the Gold Coast the likely destination.\n\nConversations are underway to build a Trump Tower on the beach at Surfers Paradise .\n\nThe property is located on 3 Trickett Street, and has been a vacant block of land since 2013.\n\nThe prime piece of real estate is on the Esplanade, the main drag running alongside the beach.\n\nThe site has been in development hell since the Iluka Resort was demolished.\n\nThe Trump Organisation is now being run by the president's sons Donald Jr and Eric .\n\nThey have been prolific in expanding their portfolio globally.\n\nThey have upcoming projects in Saudi Arabia, Oman, Dubai, India, Vietnam, Romania, Qatar and Indonesia.\n\nREAD MORE: Donors give hundreds of thousands to Trump heckler\n\nDonald Jr and Eric Trump now run the Trump Organisation. (AP)\n\nIt currently has multiple properties in the US as well as Dubai, Indonesia, India, Oman, the Philippines, Qatar, Romania, Saudi Arabia, South Korea, Turkey, Uruguay and Vietnam.\n\nThe previous plan for a skyscraper on the property. (DBI)\n\nBut most of their projects are not owned by the organisation but are simply branding deals - that is, developers pay the Trumps to put their name on the building.\n\nThe details of the prospective deal have not been made public.\n\nNo development application has been made to Gold Coast Council.\n\nIn 2016, a proposal was made to build the third-tallest building in Australia on the site.\n\nThe building would have had 479 luxury apartments, a rooftop pool and a series of restaurants.\n\nThe residential skyscraper was given approval by council but the $1.2 billion project never eventuated.\n\nNow all that remains is the basement construction work.\n\nThe property was sold for a loss in 2019.\n\nWhen Donald Trump himself was in Australia in 2008 he said he wouldn't invest in the country without a partner.\n\n\"If I do something in Australia, I'd want to have a partner in Australia,\" he told the Australian Financial Review .\n\nBut his wealth has exploded since then, especially in his past year as president.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sexual-harrassment-at-work-most-people-still-wont-report-it-study-finds/c7c003e5-2428-4a75-8112-3fa614723ed9",
        "title": "Alarm bells over scale of unreported sexual harassment at work",
        "publish_date": "Fri, 16 Jan 2026 01:24:20 +0000",
        "category": "finance",
        "authors": [
            "Jan"
        ],
        "text": "Alarming new findings have shown ﻿that despite recent legal reforms and efforts to change toxic workplace cultures, most people who are sexually harassed at work still do not report it.\n\nTwo new studies from Flinders University suggest that it is not just the fear of retaliation that stops people from speaking, but also feeling unsupported by systems that will not protect them.\n\nThe lead author of both studies, Dr Annabelle Neall, a senior lecturer in mental health and wellbeing, and director of the Flinders Workplace Wellbeing Lab, says that only about one in five people who experienced harassment went on to report it.\n\nREAD MORE: Future of Bondi footbridge on hold after council pushes back decision ﻿\n\nPeople who are sexually harassed at work often still don't report it. (Getty Images/iStockphoto)\n\n\"The decision not to report wasn't just about external risks like losing a job, it was also deeply tied to internal struggles,\" Neall said.\n\n\"People weigh up whether reporting will make things better or worse and they often concluded it wasn't worth the emotional toll, the risk to their reputation, or the likelihood that nothing would change.\"\n\nThe research identified three key psychological needs that influence reporting: autonomy (feeling in control), competence (feeling capable), and relatedness (feeling respected and supported).\n\nREAD MORE: Almost 5 million Aussie social media accounts wiped in a single week ﻿\n\nPeople say they do not feel supported in reporting harassment. (Getty)\n\nWhen these needs are undermined - by unclear processes, fear of backlash, or a lack of trust in the system - people are far less likely to speak up.\n\n\"Victims and witnesses feel that they're having to choose between protecting themselves and speaking up, and that pressure makes the decision emotionally charged and very difficult,\" co-author Professor Lydia Woodyatt said.\n\n\"If people believe the system won't provide them justice or protect them, they stay silent. That silence isn't about indifference, it's about survival.\"\n\nResearchers called for more positive and empathetic workplace cultures. (Getty)\n\nParticipants described feeling unsure whether their experience \"counted\" as harassment, fearing career damage, and doubting that reporting would lead to meaningful action.\n\nMany worried about being labelled as troublemakers or weak. Others said the process itself felt punishing, with burdensome steps and little reassurance.\n\nOne of the studies, a historical review of workplace sexual harassment reporting and investigation, found these challenges were not new.\n\nWhile laws and policies have evolved since the 1980s, the research revealed that reporting systems remained largely ineffective.\n\n\"For decades, organisations have focused on legal compliance and punitive measures, but these approaches often fail to address the cultural and psychological barriers that keep people silent,\" Neall said.\n\nBoth studies call for a shift towards trauma-informed and transformative justice approaches, which move beyond punishment to address the root causes of harassment and create cultures of respect.\n\n\"People told us they didn't want revenge, but rather that they wanted assurance that it wouldn't happen again,\" Neall said.\n\n\"Reporting should feel like a step towards positive change, not a risk to your wellbeing.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/video-games-time-limit-before-bad-health-effects-kick-in-australia-study/005d9f60-b64e-4b84-899e-863781e808aa",
        "title": "How much video gaming is too much? Study pinpoints health limit",
        "publish_date": "Thu, 15 Jan 2026 23:32:09 +0000",
        "category": "lifestyle",
        "authors": [
            "Jan"
        ],
        "text": "Video games might not rot your brain - but new evidence suggests they can have a marked effect on your health.\n\nA new study led by Curtin University surveyed 317 students from at Australian universities, with a median age of 20.\n\nThe participants were split into three groups classes as \"low gamers\" (zero to five hours playing video games per week), \"moderate gamers\" (five to 10 hours)﻿, and \"high gamers\" (over 10 hours).\n\nREAD MORE: Almost 5 million Aussie social media accounts wiped in a single week ﻿\n\nExcessive video gaming has been linked to bad health outcomes. (Getty)\n\nThe research team found while low and moderate gamers reported similar health outcomes, results worsened dramatically once gaming exceeded 10 hours a week.\n\nProfessor Mario Siervo, from the Curtin School of Population Health, said the findings suggested excessive gaming was the key issue, rather than gaming itself.\n\n\"What stood out was students gaming up to 10 hours a week all looked very similar in terms of diet, sleep and body weight,\" Siervo said.\n\n\"The real differences emerged in those gaming more than 10 hours a week, who showed clear divergence from the rest of the sample.\"\n\nThe study found a decline in diet quality once gaming exceeded 10 hours per week, with a greater prevalence of obesity in the high gamers group, compared to the low and moderate gamers.\n\n\"Each additional hour of gaming per week was linked to a decline in diet quality, even after accounting for stress, physical activity and other lifestyle factors,\" Professor Siervo said.\n\nExcessive gaming was also linked to poor sleep habits. (Getty)\n\nAll groups reported generally poor sleep quality, but moderate and high gamers scored worse than low gamers, with gaming hours showing a significant link to sleep disruption.\n\n\"This study doesn't prove gaming causes these issues, but it shows a clear pattern that excessive gaming may be linked to an increase in health risk factors,\" Professor Siervo said.\n\n\"Our data suggests low and moderate gaming is generally fine, but excessive gaming may crowd out healthy habits such as eating a balanced diet, sleeping properly and staying active.\n\n\"Because university habits often follow people into adulthood, healthier routines such as taking breaks from gaming, avoiding playing games late at night and choosing healthier snacks may help improve their overall wellbeing.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/jakara-anthony-world-cup-moguls-winter-olympics/106240426",
        "title": "Olympic champion Jakara Anthony claims record-breaking win",
        "publish_date": "Sat, 17 Jan 2026 01:56:03 +0000",
        "category": "sports",
        "authors": [],
        "text": "Jakara Anthony has made history as the most successful Australian World Cup skier, winning her 26th moguls title with victory at Waterville Valley in the United States.\n\nAnthony is perfectly positioned to defend her Olympic crown in less than a month's time in Milan-Cortina with a dominant showing to clinch her third World Cup victory of the season.\n\nThe 27-year-old surpassed fellow Victorian, aerials skier Jacqui Cooper, on the all-time World Cup list.\n\nWith the event delayed by 24 hours due to poor weather, Anthony completed a speedy, clean run in the medal round that included a cork seven and backflip mute grab for a score of 81.17 — the only female skier to score over 80.\n\nAmericans Elizabeth Lemley (78.12) and Olivia Giaccio (76.60) filled the minor placings.\n\nMissing last year due to an anterior cruciate ligament injury, 19-year-old Lemley has now posted her second straight podium this season.\n\n\"I guess I have a good track record here now,\" said Anthony, who was a double winner in Waterville last season.\n\n\"It hasn't been the easiest comp this month, and the season's been all over the place, so I'm just super stoked to put down a few really clean runs.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It's a nice place to leave the World Cup season on hold until the next one.\"\n\nFellow Australian Charlotte Wilson finished 13th.\n\nIn the men's field, Japan's Ikuma Horishima opted for safety in icy conditions but still did enough to secure victory with a score of 85.56.\n\nFilip Gravenfors from Sweden took second with 80.54 points, while another Japanese skier, Shota Hirayama, earned his first World Cup podium in third place with 79.47 points.\n\nMatt Graham, who, along with Anthony, wore the yellow bib as the overall rankings leader, finished 16th, while Cooper Woods was 22nd.\n\n\"I was a little bit nervous for the finals as these were very tough conditions. I couldn't do a double full in the top air,\" said Horishima.\n\n\"It's very nice to have a podium together with another Japanese, and I hope there will be many more to come.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/team-australia-injury-setback-in-sail-gp-event/106238986",
        "title": "'No clear favourite' in SailGP as Team Australia suffers injury setback",
        "publish_date": "Sat, 17 Jan 2026 00:44:16 +0000",
        "category": "sports",
        "authors": [],
        "text": "Team Australia has suffered an early injury setback in the lead-up to the opening race of the Sail Grand Prix season, which Fremantle is hosting for the first time this weekend.\n\nTeammates said Iain Jensen twisted his knee on the tramp while crossing the boat during a jibe — their last manoeuvre of the day.\n\nAs Jensen awaits test results, sailing veteran Glenn Ashby has been flown in as back-up, joining the crew for the last day of practice.\n\nArtemis Racing wing trimmer Chris Drap also suffered an early injury, according to teammate and driver Nathan Outteridge.\n\n\"He went flying onto the boat and got pretty badly hurt on his lip — a bunch of stitches for him, and a day off on Wednesday,\" he said.\n\n\"But he was back on board yesterday, and we're back sailing again. He's really tough.\"\n\nThe sail boats got one last training session in on Friday. Pictured is the New Zealand boat \"Black Foils\". (ABC News: Andrew O'Connor)\n\nMeanwhile, Team Spain has been forced to bow out after its catamaran sustained significant damage during practice.\n\nThe early drama highlights the challenges ahead for the remaining 12 international teams, which will battle the famous Fremantle doctor out in 50-foot foiling catamarans, reaching speeds of up to 100 kilometres an hour.\n\nSold-out event\n\nAbout 15,000 people will attend the sold-out event — which WA's acting sport minister, John Carey, was keen to point out was \"better than Sydney\" — while about 20 million are expected to tune into the live broadcast to see what the Fremantle doctor has in store.\n\nSail GP fans will watch the event from these grandstands. (ABC News: Bridget McArthur)\n\n\"It's probably going to be the fastest and uncontrolled racing we've seen so far,\" Team Germany's Erik Heil said.\n\n\" The boats probably will be flying around pretty hectic. \"\n\nTeam Australia confident\n\nDespite the potential injury setback, three-time champions Team Australia said it was feeling confident and keen to get back on the winners' list after settling for silver the last two seasons.\n\n\"We love the breeze, we love the hard conditions, everyone just loves to send it out there,\" team strategist Natasha Bryant said.\n\nPerth-born grinder Kinley Fowler (left) and strategist Natasha Bryant (right), both Team Australia. (ABC News: Bridget McArthur)\n\nPerth is locked in to host the Sail Grand Prix for three years.\n\nMr Carey said the government expected big returns but refused to be drawn on the cost to bring it here.\n\n\"We don't get into individual costs because it is highly competitive. We are competing with great sailing cities around the world,\" he said.\n\n\"It's all part of our ambitious and aggressive agenda to make Perth, to make Freo, to make Western Australia a really exciting destination for visitors but also for locals.\"\n\n'No clear favourite'\n\nSailGP chief executive Sir Russell Coutts said he was confident Perth would set the tone for an \"exciting new era of competition\".\n\n\"We are entering what is likely to be the most competitive season in SailGP history, and after an active off-season of athlete transfers, we've got unbelievable depth across the fleet and no clear favourite heading into this event,\" the Olympic gold medallist and three-time America's Cup winner said.\n\nThe Danish boat \"Rockwool Racing\" on the water on Friday. (ABC News: Andrew O'Connor)\n\n\"This weekend also marks Australia's first, I would say, true race stadium experience where we've got grandstands right alongside the water in a venue that demands respect.\"\n\nRacing gets underway today at 1pm ACDT.\n\nSeveral roads will be closed, including parts of North Mole Drive, Cliff Street and Fleet Street, while boats planning on leaving the harbour between 11:30am and 3pm today and tomorrow will need to navigate an amended exit route.\n\nFremantle Ports has advised attendees to walk or get public transport to the event if possible.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/greek-tourist-ioannis-vidiniotis-injured-at-cottesloe-beach/106237774",
        "title": "Sandbank warning after tourist suffers catastrophic injuries at iconic beach",
        "publish_date": "Sat, 17 Jan 2026 00:08:36 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "A young Greek tourist has been flooded with donations and support after a tragic accident at Perth's most iconic beach left him with life-changing injuries.\n\nIoannis Vidiniotis had only been in Western Australia's capital for two days when his cousin Aristea Kazantzidou took him to Cottesloe Beach for a coffee and a swim.\n\nIt was New Year's Eve, and the Indian Ocean was clear and calm on a windless Perth day.\n\nIoannis — on his first trip to Australia — was relieved to find a shark net, and could not wait to jump in the water.\n\n\"It looked like a swimming pool,\" his cousin Aristea recalled.\n\n\" I thought Cottesloe was the safest place to take someone who has just stepped off a plane that's never been to Australia. \"\n\nIoannis Vidiniotis pictured with his cousin Aristea Kazantzidou. (Supplied)\n\nExperienced swimmer\n\nBut shortly after diving in, Ioannis was floating and unconscious.\n\n\"He is an experienced swimmer, and I don't believe he knew that he would strike a sand bank,\" Aristea said.\n\nThe young Athenian had hit his head on the sand bank, breaking his collarbone and fracturing his spine.\n\nDoctors say his chances of walking again are slim. (Supplied)\n\nAristea gave her cousin CPR and was helped by an anaesthetist named Lloyd, who happened to be there at the time.\n\n\"We put him on his back, and Lloyd was holding his head the whole time,\" Aristea said.\n\n\"My whole family is really thankful Lloyd was there.\"\n\nNearly $250,000 raised\n\nIoannis underwent a five-hour emergency spinal surgery and remains in ICU.\n\nIoannis Vidiniotis pictured before the accident with his cousin Elle (Aristea's sister) and uncle and aunty, Dimitri and Effie. (Supplied)\n\nMedical specialists have advised the family that his chance of walking again was less than 5 per cent.\n\nThe ABC understands that while in hospital Ioannis was visited by a young Perth man who defied the odds after a similar accident at another Perth beach and eventually walked again.\n\nAs of Friday, a gofundme page set up by the Hellenic Community of Western Australia had raised more than $250,000 to help with the ongoing costs of his care and rehabilitation.\n\nIoannis's mother was expected to arrive from Greece on Sunday to visit him in hospital.\n\nSandbank warning\n\nAristea said her family wanted people to be aware of the dangers of sandbanks.\n\n\"This is a stark reminder that Perth's beaches, no matter how calm they appear, can be treacherous,\" she said.\n\n\"We want people to enjoy our coastline, but also to understand how quickly things can go wrong.\"\n\nTown of Cottesloe chief executive Mark Newman said he believed the beach had adequate signage warning about the dangers of the ocean.\n\n\"The Cottesloe foreshore extends for 4 kilometres, within which we have approximately 30 entrance points,\" he said.\n\n\"We believe the beach is adequately signed, given the very passive nature of the beach.\n\n\"Like others, we feel it to be an unfortunate and sad event and would encourage all beach users to take care in the water.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/australia-oldest-skate-park-in-abany-turns-50/106224280",
        "title": "Fifty years ago Australia's first skate park was built in WA",
        "publish_date": "Sat, 17 Jan 2026 00:06:06 +0000",
        "category": "sports",
        "authors": [],
        "text": "A coastal community in Western Australia's south is celebrating the 50th anniversary of the country's oldest skate park.\n\nThe heritage-listed Albany Snake Run is also an important part of the sport's history globally, as the second-oldest surviving park in the world.\n\nIts inception was driven by the community, including a group of local children and teenagers who fundraised thousands of dollars.\n\nSkater Rory Gibbs at the Albany Snake Run Skate Park. (Supplied: Lachie Roscoe)\n\nCommunity-driven fundraising\n\nGraham Macaulay was just starting high school at the time.\n\n\"Around about 74/75, it was just the start of a full-blown skateboard phase,\" he said.\n\n\"Plenty of kids skateboarding around the roads and footpaths and driveways, but all those skateboarding areas had issues.\"\n\nLoading...\n\nAnd so they began working towards creating a designated skating area with support from his father, Jim Macauly, and Albany Mayor Harold Smith.\n\nMany of the young skateboarders in town helped fundraise for the park, including selling raffle tickets for a new colour television.\n\nThe community raised thousands of dollars for the construction of the skate park in the Albany suburb of Mount Clarence. Circa 1975/76. (Supplied: History Great Southern – Kaartdijin Biddi Albany)\n\n\"To incentivise some of the kids to go out and sell these raffle tickets, the two or three kids that could sell the most tickets were given a skateboard,\" Graham Macaulay said.\n\n\"We all went out and did all the door knocking all around town, sold heaps of tickets, even went into hotels — and we were underage — just going through selling tickets.\"\n\nRenowned US skater Russ Howell does a handstand on his skateboard at the Albany Snake Run Skate Park. (Supplied)\n\nBrother Steve Macaulay also remembers the group selling fairy floss and drinks at community events.\n\nAnd on one occasion, he said they were paid $300 by the council to blow up helium balloons.\n\n\"They needed balloons for the opening of the Brig Amity, and so in the belly, there we were trying to blow up 1,000 balloons for the event,\" he said.\n\nIn total, the community raised $3,000 for the skate park, which was constructed in an old gravel quarry in the Albany suburb of Mount Clarence.\n\nA man rides a skateboard at the Albany Snake Run Skate Park circa 1976. (Supplied: History Great Southern – Kaartdijin Biddi Albany)\n\nMany of the skaters were also surfers, and that inspired the design of a winding downhill track.\n\n\"They tried to set it up to look more like a surf break,\" Steve Macaulay said.\n\n\" The whole shape of it is inspired by a wave so that you could ride the wave either way, left or right. \"\n\nAlbany Snake Run Skate Park opening in 1976. (Supplied: History Great southern - Kaartdijin Biddi Albany)\n\nThe park opened to large crowds in February 1976, and overnight, it became \"the place to be\".\n\n\"On the day, there was just a countless number of people here, and from there on, probably for the next two or three years, you couldn't move on the track,\" he said.\n\n\"It was so popular, it was just the place to be.\"\n\nCaptured at the Albany Snake Run Skate Park circa 1976. (Supplied: History Great Southern – Kaartdijin Biddi Albany)\n\nGraham Macaulay fondly remembers spending every possible moment at the skate park.\n\n\"During phys ed [class], we would come down and have skateboarding as an option,\" he said.\n\n\"Lunch times, after school, before school, weekends were just packed.\n\n\" We were just living this dream … we were all starting to learn to surf, and we had this skateboarding, surfing lifestyle, and it was just amazing to grow up here in the 70s and have this as a way of life. \"\n\nIan Tarbotton at 15 years of age on the first bend of the Albany Snake Run Skate Park circa 1976. (Supplied: History Great Southern – Kaartdijin Biddi Albany)\n\nWith a dedicated place for the community to skate, the skill level began to build.\n\n\"Originally, it was just go down and hang on and try and steer your way through, but then the kids got better at skating … someone always seemed to be able to break some new ground.\"\n\nIn 1979, the skate park also hosted Australia's first National Skating Championship.\n\nA skateboarder riding a vert wall, which was added to the skate park later. Photo taken June 1989. (Supplied: History Great Southern – Kaartdijin Biddi Albany)\n\nNow Albany-based Kus Rolf remembers travelling down from Perth to try the Snake Run for the first time in 1998.\n\n\"We thought we could skate pretty good, and then we got to this place and realised that it was way gnarlier than we had ever imagined, and way rougher,\" Mr Rolf said.\n\nMr Rolf is the president and co-founder of the Albany Skateboard Society.\n\nHe said the park's design, inspired by surfing and moulded around boulders in the old quarry, made it unique in the world.\n\nAn aerial view of the Albany Snake Run Skate Park taken in 2023. (Supplied)\n\n\"That's what makes this place so unique — it's a different shape … this is really lumpy and organic and fast and steep,\" he said.\n\nThe Albany Snake Run inspired the design of early skate parks in the United States; however, by the 80s, parks were increasingly planned around ramps and bowls.\n\nSteven Macaulay (left), Graham Macaulay, Kus Rolph, and Lachie Ruscoe. (ABC News: Samantha Goerling)\n\nFor Graham Macaulay, it was \"amazing\" to have helped the skate park, which played an important part in the evolution of the sport.\n\n\"We've been part of the journey, a stepping stone for a lot of other parks around the place,\" he said.\n\n\"It seems to have morphed into a different type of skating nowadays, but who's to say it won't come back to this being the main type of skating in another 10/15/20 years?\"\n\nA skateboarder at the Albany Snake Run Skate Park. Year unknown. (Supplied: History Great southern - Kaartdijin Biddi Albany)",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/lancet-rejects-trump-paracetamol-pregnancy-autism-claims/106236278",
        "title": "Lancet rejects Trump's 'politicisation' of paracetamol use in pregnancy",
        "publish_date": "Fri, 16 Jan 2026 23:35:07 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "There is no evidence using paracetamol during pregnancy increases the risk of autism in children and discouraging its use could cause more harm than the drug itself, according to new analysis by one of the most prestigious medical journals in the world.\n\nA comprehensive review of evidence, published in The Lancet, has reinforced advice from peak medical bodies across the world that paracetamol is safe to take during pregnancy.\n\nThe paper comes just months after the Trump administration advised pregnant women to limit the use of acetaminophen — also known as paracetamol — arguing it was linked to autism in children.\n\n\"Don't take Tylenol … Tylenol is not good,\" US President Donald Trump said at the time, using the drug's American brand name.\n\nFive experts on Trump's paracetamol and autism claims Leading Australian experts in medicine, autism research and obstetrics say the US president's claims are \"a misreading of science,\" or at worst, \"a misuse\". Here's why.\n\nThe advice was quickly condemned by medical experts as baseless and causing unnecessary fear, while Australians with autism said they felt they were being \"scapegoated\".\n\nNow, an analysis of 43 existing studies, published in The Lancet Obstetrics, Gynaecology, & Women's Health journal, has found the strongest available evidence does not support a link between paracetamol use during pregnancy and neurodevelopmental harm.\n\n\"This [review] found no evidence that maternal paracetamol use during pregnancy increases the risk of autism spectrum disorder, ADHD or intellectual disability among children,\" the paper stated.\n\nThe researchers, from a range of European countries, said the \"politicisation of scientific uncertainty\" had created confusion among pregnant people, which could put them in danger.\n\n\"Avoidance of paracetamol based on inconclusive evidence could expose pregnant women and their babies to known risks associated with untreated fever or severe pain,\" the paper stated.\n\n\"Untreated maternal fever, in particular, has been linked to miscarriage, congenital anomalies, preterm birth, and differences in neurodevelopment.\n\nDonald Trump and Secretary of Health and Human Services Robert F. Kennedy Jr have previously raised concerns about the use of paracetamol during pregnancy. (Reuters: Kevin Lamarque)\n\n\"For this reason, discouraging the appropriate use of paracetamol has the potential to cause greater harm than the drug itself.\"\n\nIn Australia, paracetamol is considered a category A medication during pregnancy, which means it has been taken by a large number of pregnant women without any proven increase in any direct or indirect harmful effects on their babies.\n\n\"The message is clear: paracetamol remains a safe option during pregnancy when taken as guided,\" said the study's lead author, Asma Khalil, Professor of Obstetrics and Maternal Fetal Medicine at City St George's, University of London.\n\n\"This is important as paracetamol is the first-line medication we recommend for pregnant women in pain or with a fever, and so they should feel reassured that they still have a safe option to relieve them of their symptoms.\"\n\nPrevious research likely distorted by genetics and other facts\n\nThe review prioritised sibling-comparison research, with commentary published alongside the paper saying it offered \"strong evidence\" because they controlled for shared genetics and environmental factors.\n\nOne of the largest studies it relied on was a 2024 study on more than two million births in Sweden which compared siblings.\n\nThe study concluded that previous research, which had reported a link between paracetamol and autism, had likely been distorted by genetics, environmental factors or health conditions affecting the mother.\n\n\" The well-established tendency for autistic traits to run in families are more plausible explanations for previously observed associations than any direct effect of paracetamol. \"\n\nDavid Trembath is head of autism research at CliniKids, The Kids Research Institute Australia. (Supplied)\n\nThey noted pregnant women tended to overestimate the risk of medication-related harms, and could be overly susceptible to misinformation and shame.\n\n\"Limited understanding of the underlying causes of ADHD and autism spectrum disorder could leave affected mothers particularly susceptible to self-blame.\"\n\nThe authors said while there were limitations around their research, such as being unable to control for factors like when and how much paracetamol pregnant women were taking, they hoped their findings would put an end to \"any scepticism on using paracetamol\".\n\nDavid Trembath, head of autism research at CliniKids, The Kids Research Institute Australia, said while Mr Trump had a \"very loud microphone\" the results of the study should put concerns about paracetamol use in pregnancy \"to bed\".\n\nExperts say women must not avoid taking paracetamol because of the US president's comments. (Adobe Stock: fizkes)\n\n\"Unfortunately, we do live in a world where sometimes messages catch hold and it's hard to, even with the most comprehensive evidence, such as from a review like this, it's kind of hard to take them out of people's minds,\" Professor Trembath said.\n\n\"But I'm really confident that if people talk to their GPs, their doctors, et cetera, that they'll be able to provide a really clear picture of the evidence … which is clear and consistent that there is no association between paracetamol and autism, ADHD and intellectual disability in kids.\"\n\nHe also noted discussions around paracetamol use in pregnancy causing autism, and the portrayal of the condition as something inherently negative could be upsetting to people with autism.\n\nLoading...\n\n\"I'm really sad that people have had to go through this whole series of events, but I'm hoping that this will put an end to it, that we can get back to focusing on what really matters.\n\n\"And that is giving people with disability all of the same opportunities that are readily available to their peers, and focusing on how to support people to live the best life possible.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/matteo-berrettini-illness-australian-open-tennis-alex-de-minaur/106240240",
        "title": "Berrettini fighting illness ahead of Australian Open clash with de Minaur",
        "publish_date": "Fri, 16 Jan 2026 23:04:11 +0000",
        "category": "sports",
        "authors": [],
        "text": "Matteo Berrettini has hit a speed bump ahead of his Australian Open clash against local hope Alex de Minaur, with mystery surrounding the Italian's health.\n\nBerrettini, the former world number six, was forced to pull the plug early during his appearance at an exhibition match at Melbourne Park due to illness.\n\nThe former Wimbledon finalist had played just one match against Norway's Nicolai Budkov Kjaer at Red Bull Bassline on Friday night before retiring early.\n\nDe Minaur cops brutal Australian Open draw Alex de Minaur is slated to begin his Australian Open campaign with a clash against former semifinalist Matteo Berrettini. Here is everything you need to know about this year's draw.\n\nSlated to face de Minaur in the first round of the Open on Monday, Berrettini's run-in with illness is the latest of fitness troubles after an injury-ravaged 2025 campaign.\n\nKnocked out in the second round at last year's Australian Open, Berrettini was forced to retire from the Italian Open due to an oblique injury.\n\nBerrettini, currently ranked 56th in the world, then ruled himself out of the French Open and the US Open following a flare-up of the same issue.\n\nThe 30-year-old has now missed seven grand slams in four years, but was able to return in time to play a pivotal role in Italy's Davis Cup win in November.\n\nBerrettini — who reached the Australian Open semi-finals in 2022 — boasts a 3-2 lead against world number six de Minaur in the head-to-head count.\n\nBut the Sydneysider's wins over the Italian have both come on hard courts.\n\nBerrettini is the first opponent in a nightmare draw for de Minaur, who enters his home grand slam with his highest-ever seeding.\n\nArgentina's world number 74 Mariano Navone or Serbia's 96th-ranked Hamad Medjedovic wait for de Minaur should he defeat Berrettini.\n\nAmerican 29th seed Frances Tiafoe is a likely opponent in round three, with potential shootouts against grand slam nemesis Alexander Bublik in the last 16, before the top-ranked Carlos Alcaraz in the quarter-finals.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/heritage-wall-demolition-mount-gambier-old-flour-mill/106232796",
        "title": "Developer's bid to demolish 140-year-old flour mill walls faces backlash",
        "publish_date": "Fri, 16 Jan 2026 23:02:58 +0000",
        "category": "finance",
        "authors": [],
        "text": "The dolomite walls of a historic flour mill have stood tall in the heart of Mount Gambier for more than 140 years, but developers want to knock them down to make way for a multi-million dollar commercial and housing project.\n\nPlans submitted by Mossop Construction to demolish the walls on the corner of Sturt Street and Bay Road have angered residents and historians who want to see the structure preserved.\n\nThe heritage-listed structure is more than 140 years old, stands six metres tall and was originally built for a flour mill, which operated at the site for many years.\n\nThe facade is made of locally-sourced dolomite and limestone, which are key features of the landmarks and buildings in Mount Gambier.\n\nThe Mount Gambier Roller Flour Mill was built in 1885 at the corner of Bay Road and Sturt Street. (Supplied: State Library of South Australia)\n\nMount Gambier History Group president Megan McKenzie said she was disappointed that developers wanted to demolish the heritage icon.\n\n\"People accepted this was going to be a great new development for Mount Gambier,\" she said.\n\n\"It was only when the application [to demolish the wall] came in, we were concerned.\"\n\nIn the history group's submission against the proposed demolition, it said the unsafe sections of the wall could be removed while the parts with the most historical value were saved.\n\n\"Many people realise that, if this goes, it's just another part of our history going,\" Ms McKenzie said.\n\n\"We're not worried about the other things they put behind that facade, it is the facade that is so important and should be retained.\"\n\nMegan McKenzie is disappointed by plans to demolish a heritage-listed wall. (ABC South East SA: Samuel O'Brien)\n\nA long history of change\n\nThe site where the walls sit has been unoccupied in recent years, with a hardware store most recently calling it home.\n\nMossop Construction publicly released its proposal for the site in 2024.\n\nIt would include an 82-room hotel, townhouses and a commercial precinct.\n\nThe plans were approved by the Limestone Coast Southern Regional Assessment Panel in February last year, including keeping the heritage-listed wall intact.\n\nHowever, developers have lodged another application, saying new assessments had found it structurally unsafe and seriously degraded.\n\nThe site used to be home to a hardware store. (ABC South East SA: Eugene Boisvert)\n\nAccording to documents available on the PlanSA website, the architects who assessed the wall said retention was \"theoretically possible but would require an extensive and complex program of temporary and permanent structural works\".\n\nThe architects instead recommended reusing salvaged stones from the wall and incorporating them into the new design to highlight their heritage.\n\nAccording to the development application, the repair and retain option could cost $2.25 million, while the cost estimate for the demolition option was $118,000.\n\nThe architects said partial retention of the wall by removing or isolating sections of it was not feasible as it was \"likely to compromise the remainder and create additional instability\".\n\nPreservation a priority\n\nOckert Le Roux has made a submission against the proposed demolition of the old flour mill wall. (Supplied: Tim Rosenthal )\n\nMount Gambier photographer Ockert Le Roux said he was not convinced the developers were doing enough to preserve the wall.\n\nMr Le Roux has made a submission to the Limestone Coast Southern Regional Assessment Panel, arguing against the wall's demolition.\n\n\"It shouldn't take that long and it shouldn't cost that many dollars to make sure [the wall] is safe and then incorporate it into the modern-day buildings,\" he said.\n\n\"[The wall] has been coated in this awful grey paint for many many years, so we don't actually truly see the facade.\n\n\"If you peel that away, you're sitting with that beautiful pink limestone that Mount Gambier is known for.\"\n\nWhile he was not against the broader development of the precinct, Mr Le Roux said he would like to see the wall's heritage featured in the design.\n\n\"It has been vacant for quite some time; we've got a lot of these sites that sit undeveloped and they just deteriorate,\" he said.\n\n\" I think the treasure has been hidden for a very long time. \"\n\nMegan McKenzie says the facade should be maintained. (ABC South East SA: Samuel O'Brien)\n\nThe City of Mount Gambier said it would not lodge a submission regarding the application.\n\nIn a statement, council chief executive officer Paul Simpson said the council noted the independence of the assessment panel to make determinations in accordance with South Australia's planning legislation.\n\n\"These are the legislated measures put in place by the South Australian state government to allow for the consistent application of development across our state, and [the] council respects these processes,\" the statement said.\n\nThe ABC has contacted Mossop Construction for comment.\n\nThe public can make representations regarding the application on the PlanSA portal until midnight Tuesday, January 20.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/midwives-in-darwin-private-practice-contract-nt-government/106228974",
        "title": "Midwife banned from working unsupervised handed $1.1m NT government contract",
        "publish_date": "Fri, 16 Jan 2026 22:57:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "A Darwin midwife who has been barred from working unsupervised by Australia's nursing and midwifery regulator will continue to run the Northern Territory government's new private practice midwifery service, despite serious concerns from doctors.\n\nLast September, the NT government awarded Claire Marks a $1.1 million contract to establish Midwives in Darwin — a service intended to plug the gap left by the closure of the NT's only private maternity ward last year.\n\nAt the time the contract was signed, Ms Marks was being investigated by the Nursing and Midwifery Board of Australia; and in November, the regulator imposed a number of conditions on her registration, including that she must not practice without supervision.\n\nNT's last private obstetrician walks away as maternity services face collapse A growing number of NT women are travelling interstate to give birth — or leaving the territory altogether — following the sudden closure of the only private hospital maternity ward. Now, the NT's last private obstetrician is closing her practice.\n\nThe conditions also require Ms Marks to engage an approved mentor to address her management of care and maternal observations — which are critical safety tools, with missed or delayed observations potentially being the difference between early intervention and an emergency.\n\nA spokesperson for the Australian Health Practitioner Regulation Agency (AHPRA), which overarches the Nursing and Midwifery Board, said confidentiality provisions limited what could be said publicly about the matter, but confirmed that conditions were only imposed \"where it is deemed necessary to protect the public\".\n\nMs Marks would not say why the conditions had been placed on her, but said she felt \"confident in my ability to practice safely\".\n\n\"I do not feel any harm was caused to women and babies in my care, and I do not feel there is a risk to the public in my practice,\" she said.\n\nAsked whether she felt the conditions placed on her were unfair, Ms Marks said she believed her practice \"was and still is in alignment with evidence-informed care, best practice, and is compliant with the clinical governance\".\n\nClaire Marks has been awarded a $1.1 million contract to establish Midwives in Darwin. (ABC News: Marcus Kennedy)\n\nThe NT government contract for a private midwifery service, offering birthing and pregnancy support for privately insured women and families, has been subcontracted for a 12-month period to Ms Marks, who says she will serve as director of the service.\n\nMs Marks confirmed she would \"not be providing clinical services\" and would instead be overseeing a team of midwives, expected to join the practice in early 2026.\n\nThe NT Health Department declined to answer whether it was aware Ms Marks was under investigation at the time the contract was awarded or why it was proceeding with the contract.\n\nThe department also did not respond to questions about whether it believed it was appropriate for a practitioner with serious conditions on their registration to operate a government-funded midwifery service.\n\nA spokesperson for NT Health said \"details of the procurement process and existing contract between NT Health and Midwives in Darwin remain commercial in confidence\" and follow strict government standards.\n\nThe private practice midwives will be able to support births at Royal Darwin Hospital. (ABC News: Dane Hirst)\n\nAustralian Medical Association raises concerns\n\nJohn Zorbas, president of the Australian Medical Association of the NT (AMA NT), said medical staff were concerned about the contract.\n\n\"We don't see how these supervision requirements can be met whilst also providing this service,\" he said.\n\n\"[AHPRA] defines practice as any role in which the individual uses their skills and knowledge as a health practitioner in their profession.\n\n\" Whether you work for the public service or a private company, the public need to know that their healthcare providers are safe and are adhering to any conditions on their registration. \"\n\nJohn Zorbas says the Australian Medical Association NT has concerns about the private midwifery contract. (ABC News: Pete Garnish)\n\nA spokesperson for AHPRA said conditions placed on a practitioner were only removed \"if or when the board is satisfied there is no longer a risk to the public\".\n\n\"The board can also take further action at any time if it is necessary to protect the public,\" they said.\n\nSocial media posts raise concerns\n\nThe AMA NT has also raised concerns about content posted on Midwives in Darwin's social media.\n\nThe AMA says a recently deleted post raises concerns. (Supplied)\n\nOne post from October 2024 states, \"the further you birth away from the delivery suite the better the outcomes\" — a statement Dr Zorbas said was \"simply false\".\n\n\"Statements like this perpetuate myths about healthcare that can harm mothers and babies,\" he said.\n\n\"What we say as healthcare providers on social media matters.\n\n\"It's important that those working in healthcare are able to raise concerns and contribute to quality improvement, but they also can't inappropriately erode public trust in the health system.\"\n\nOther posts on the Midwives in Darwin social media page state \"there's a difference between hospital policy and evidence-based practice\" and \"between what your midwife has to say and what she wants to say\".\n\nMs Marks is the director of Midwives in Darwin, but it is unclear who the administrator of the Facebook page is.\n\nMs Marks declined to comment on the social media content.\n\nMs Marks, who has worked as a midwife for 13 years, was born in Darwin and returned to the city during the COVID-19 pandemic after studying and working in Adelaide.\n\nShe said, after working at Royal Darwin Hospital (RDH) for a time, she began her own private midwifery practice in Darwin with a focus on homebirths.\n\nShe said Midwives in Darwin would at first offer midwife-supported births at RDH for privately insured women and, while homebirths were not yet included in the contract, she hoped to expand to provide them.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/worlds-largest-battery-electric-ferry-trials-incat-china-zorilla/106239194",
        "title": "'Relief' as world's biggest electric ferry starts sea trials",
        "publish_date": "Fri, 16 Jan 2026 22:04:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "When the world's largest battery-powered vessel is moved from the Tasmanian shipyard where it was built to its new home in South America, it will need the help of a \"gargantuan\" heavy-lift ship.\n\nHull 096, built by Hobart's Incat, started sea trials on the River Derwent in Hobart on Friday, making history as the first electric ship of its size and capacity to move on its own.\n\nThe 130-metre ferry, with a capacity for 2,100 passengers and 225 vehicles, is powered by more than 5,000 batteries, weighing in about 260 tonnes.\n\nA single charge carries only enough energy for the ferry to run for 90 minutes.\n\nThe harbour trials form part of a testing and commissioning program that will continue in the lead-up to the vessel's delivery to South America. (ABC News: Mitchell Woolnough)\n\nHull 096 will be named China Zorrilla, after a Uruguayan film and theatre star who died in 2014.\n\nIt will be used by Buquebus, a South American ferry operator that connects the Uruguayan capital Montevideo and the Argentinian capital Buenos Aires, which are on opposite sides of the Rio de la Plata (River Plate).\n\nThe view from inside the China Zorrilla wheelhouse. (Supplied: Incat Tasmania)\n\nWorld's largest '100 per cent electric' ship launched Named after a famous Uruguayan actor, the brand new new ship by Tasmanian shipbuilder Incat is said to be the largest fully electric vessel ever built.\n\nThe ship's home port will be Montevideo, and it will travel the 30 nautical miles between the two cities three times a day.\n\nThe ferry trip will take just over an hour, which is within the ship's battery range.\n\nBut unlike the diesel ferries Incat has built for South America, this one will not be able to be moved such a great distance on its own.\n\nHull 096 pictured during the construction phase. (Supplied: Incat)\n\nSo how will it get there?\n\nA heavy-lift ship, which Incat's public relations and corporate affairs manager, Tom Cooper, described as \"gargantuan in size\", will be brought in to move Hull 096.\n\nThere are only a few of these vessels operating in the world. One is expected to arrive in Hobart in either February or March, depending on when Hull 096's sea trials are finished.\n\nThe trials involve testing propulsion, manoeuvrability, control systems, and onboard operational performance in \"real-world conditions\", Incat says. (ABC News: Mitchell Woolnough)\n\nMr Cooper said the use of the heavy-lift ship on the River Derwent would be a \"carefully managed process\" with exclusion zones set up.\n\n\"It'll all be done through the maritime authorities, MAST [Marine and Safety Tasmania], AMSA [Australian Maritime Safety Authority], all the port authorities will be actively involved as well,\" he said.\n\n\"Incat will work with them so there won't be any disruption to any users of the River Derwent.\n\n\" But there will be exclusion zones for the couple of days that the heavy-lift ship is here, being that it's such a large ship and we don't want to jeopardise any other marine users' safety while that process is taking place. \"\n\nHull 096's journey to South America will take about 28 days.\n\nFerry performance being tested\n\nBefore it starts plying the waters of the Rio de la Plata, the ferry is being put to the test on the River Derwent.\n\nOn Friday, it performed a series of manoeuvres to test how it responded on the water.\n\nIncat says the ship will be capable of carrying 2,100 passengers and more than 220 vehicles. (ABC News: Mitchell Woolnough)\n\nMore sea trials are planned over the coming weeks to test the ferry's onboard operational performance, control systems, propulsion, and manoeuvrability.\n\nIt is estimated the ferry will reach upwards of 25 knots during speed trials.\n\nThe ferry has been more than two years in the making, and Mr Cooper said Incat workers stepped out of their sheds on Friday morning to watch it move.\n\n\"There was a big sigh of relief when the ship started moving away from the wharf, but also a massive sense of pride here,\" Mr Cooper said.\n\n\"This is what the world — and the maritime industry globally — has been waiting for: to see this ship finally moving after more than two years of construction.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/seat-of-knowledge-tradition-lives-on-in-north-queensland/105088332",
        "title": "'Seat of knowledge' tradition lives on, but you need a sense of humour",
        "publish_date": "Fri, 16 Jan 2026 22:00:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's a far cry from the piazzas of Italy, but in Queensland's north, a centuries-old tradition is alive and well.\n\nOutside a small supermarket off the main street of Tully, a group of six men gather on a seat lovingly carved with the moniker 'Seat of Knowledge'.\n\nOlder people gather here almost every morning to share \"their two cents worth\" in a tradition that has unfolded over decades.\n\nA sense of humour and the ability to poke fun at yourself is a must when visiting Tully's Seat of Knowledge. (ABC News: Baz Ruddick)\n\nFor those who come, it's a social tonic that allows them to start their day with a laugh.\n\nNo topic is off-limits, the micky is taken often and liberally, and the jokes could make a bikie blush.\n\nDonald Steele, 85, started visiting the seat in 2009 but became a more permanent fixture in 2011 after he retired.\n\nDonald Steele, 85, loves to start his day with a laugh among mates. (ABC News: Baz Ruddick)\n\n\"It [the Seat of Knowledge] has been around for 20-something years,\" he said.\n\n\"The first people didn't have much brains, but since we've been coming here, the intellect level has gone up a bit,\" Mr Steele joked.\n\n\" We solve all the problems of the world, and we create a few ourselves. \"\n\nRaymond Downing, who lost his wife to cancer about 10 years ago, has found solace with those who gather on the corner every morning just as the sun is rising.\n\nThe origins of Tully's Seat of Knowledge are not clear, but locals say groups of people have gathered outside the supermarket for decades. (ABC News: Baz Ruddick )\n\n\"I'm nearly 80. You've got to keep your mind active and keep it going,\" Mr Downing said.\n\n\"Some people have said, 'Oh, why would you sit on that seat with all those old blokes?', and I say, 'Well, when you get up in the morning feeling a bit down, you come down here and within 10 minutes you're laughing,\" he said.\n\nEvery morning Raymond Downing walks his dog down to Tully's Seat of Knowledge to have a chat with friends. (ABC News: Baz Ruddick)\n\nHe says everyone who perches on the seat has to have a \"bloody good sense of humour\".\n\n\"You have to chuck a lot, but you cop a lot back, too,\" he said.\n\nA historic picture of the Seat of Knowledge is on the wall of the Tully supermarket. (ABC News: Baz Ruddick)\n\nTully is not the only town with a special gathering place — they are scattered across North Queensland, including at nearby Kurrimine Beach.\n\nWith arguably the best view in town, the 'Table of Knowledge' sits by the waterfront and is a fixture for locals and tourists who wander by.\n\nKurrimine Beach local John Parisi says he has reconnected with people from his past at the Table of Knowledge. (ABC News: Baz Ruddick)\n\nJohn Parisi comes most days when he is not travelling for work.\n\n\"Normally, the first guy gets here at about six-thirty in the morning and we normally depart at about eight in the morning,\" he said.\n\n\"And then a lot of times, we come back at five o'clock in the afternoon and go home at six.\n\nDawn risers say a chat around the foreshore table at Kurrimine Beach gets the day off to a good start. (ABC News: Baz Ruddick)\n\n\" Naturally, you are happy when you are talking. I'd rather do this than watch breakfast TV in the morning. \"\n\nHe said much of the chat at the table centred on the past.\n\n\"Mostly we were farmers, so we talk about different styles of farming and how it used to be done and how it's done today,\" Mr Parisi said.\n\nKurrimine Beach is a popular spot for fishing and for those seeking a quieter lifestyle. (ABC News: Baz Ruddick)\n\nRoots in the old country\n\nDr Bianka Vidonja Balanzategui, a historian with an interest in 20th-century migration, said the 'seat of knowledge' tradition had roots in the Italian communities that were established through migration to the region.\n\n\"Trees, tables, chairs of knowledge in the Italian community are gathering places for elderly gentlemen to meet,\" Dr Vidonja Balanzategui said.\n\n\"They would talk about their ailments, the world, argue about the state of the world, and [talk about] their families.\n\n\"Many of these gentlemen were farmers, so they had retired and may have moved into the township.\"\n\nBianka Vidonja Balanzategui says gathering places in North Queensland are likely a tradition that came from Italian migrants in the region. (Supplied)\n\nShe said the tradition could be traced back to the Roman forum.\n\n\"Around the forum were our main civic buildings — your important buildings,\" she said.\n\n\"All the Italian piazzas reflect that forum construction landscape. So that is the main focal point of the village for women and men and young people to gather.\"\n\nDr Vidonja Balanzategui said that although many of those who originally gathered at certain 'places of knowledge' had passed, and the tradition had declined in some areas, there was a resurgence in other areas.\n\nItalian cane cutters in the early 1920s take a break from work in the Innisfail region. (Supplied: State Library of Queensland)\n\n\"You will notice that a new generation of people getting into that retirement stage are probably picking up versions of that tradition and perhaps gathering outside a cafe and sitting there for a couple of hours of a morning,\" she said.\n\nSense of humour a must\n\nAt the end of Tully's Seat of Knowledge sits a placard reading the 'departure lounge'.\n\n\"That's where the older ones go to die,\" Mr Steele joked.\n\nA sense of humour is a must when it comes to taking up a perch at Tully's Seat of Knowledge. (ABC News: Baz Ruddick)\n\n\"When you get to my age, everyone's just waiting, but we try to avoid that if we can,\" he said.\n\n\"It's only if there are a lot of people who turn up that I get shoved up the end.\"\n\nMr Downing said it was the jokes and old friends that kept him coming every morning.\n\n\"We have a good laugh and a chat and throw a bloody lot of crap at one another,\" he said.\n\n\" It starts the day off on a good note. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/sydney-aboriginal-inmates-connection-to-country-through-art/106189742",
        "title": "'Powerful message': Courthouse purchases artworks by Aboriginal inmates",
        "publish_date": "Fri, 16 Jan 2026 21:57:02 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Sydney's Long Bay Correctional Complex is far away from home for Aboriginal man John, but while he serves out his sentence, art has been a source of comfort and connection.\n\nThe incarcerated 75-year-old, whose name has been changed for privacy reasons, said he missed seeing the goannas, kangaroos, emus and birds.\n\nBut with each stroke or dot placement on a canvas, painting brings him closer to the familiar sights, sounds and feelings of his country.\n\n\"It relaxes me thinking about my hometown and my country where I come from,\" he said.\n\n\" It does take you back to being home. \"\n\nInmate artists redecorate Sydney courthouse\n\nPainting has brought Aboriginal people together at Long Bay Correctional Facility. (ABC News: Patrick Thomas)\n\nMost of John's artwork is inspired by nature, with each piece generally taking him two weeks to make.\n\n\"I do the emu and kangaroo mostly and sometimes I get into the birds like the brolgas and the magpies and the koalas, the cockatoos,\" he said.\n\nPainting, which he learnt how to do from other artists before being imprisoned, helps him with feelings of isolation.\n\n\"A couple of Aboriginal guys want to get into the artwork but they haven't got the tools to do it with just yet — the paint, the canvas … I help them out in some ways,\" he said.\n\n\"We talk about what we're going to do and what sort of colours they might have to use on the art, things like that.\n\nThe paintings feature a mix of traditional ochre colours and some brighter ones. (ABC News: Patrick Thomas)\n\nNow artworks by John and other Aboriginal inmates have been purchased by the Department of Communities and Justice for $12,000 via the Boom Gate Gallery.\n\nThe gallery is part of Long Bay Correctional Complex and offers the public the opportunity to purchase art made by inmates.\n\nAccording to the NSW government website, prices are set by the inmates in collaboration with the gallery staff, with 75 per cent of the proceeds going back to the artist and 25 per cent going towards gallery running costs.\n\nInmates can access this money while in prison, send it to family or use it to buy their next canvas.\n\nSixteen artworks in total were purchased by the department and displayed at Sydney's Downing Centre courthouse complex as part of its recent flood-related renovations.\n\n\"They sell my work for me and give me something to look forward to when I get out,\" John said.\n\nThis artwork depicts Aboriginal people around a fire. (ABC News: Patrick Thomas)\n\nPainting 'not a privilege'\n\nLong Bay Correctional Complex psychologist and Wiradjuri man Craig Raymond said painting can \"build that bridge between family or mob back home\".\n\nMr Raymond said painting can improve wellbeing. (Supplied: Corrective Services NSW)\n\n\"Indigenous people tend to be more collective over individualistic in nature, so for an Indigenous person who is away from their mob and their community, it can impact them more than what it does for non-Indigenous people,\" he said.\n\nThere is a holistic framework called the Aboriginal and Torres Strait Islander Social and Emotional Wellbeing model, which is sometimes used in correctional settings, that emphasises important aspects of Indigenous identity.\n\n\"It's a connection to body, mind and emotions, family and kinship, community, culture, country, and spirit and ancestries,\" Mr Raymond said.\n\nHe said allowing Indigenous inmates to paint helps to fulfil these needs.\n\n\"I think people sometimes think that these offerings are a privilege, but my view is that Aboriginal artwork in prison is not a privilege, it's a prevention,\" he said.\n\n\"It reduces harm, it calms people down, it gives them that link to family and to culture, and it also helps benefit them after release.\n\n\"It gives them hope that they can, perhaps, continue this once they are released and they become an artist.\"\n\nThe 16 artworks were purchased by the Department of Communities and Justice for $12,000. (ABC News: Patrick Thomas)\n\nClosing the gap\n\nMr Raymond said Indigenous inmates creating artwork \"plays a part in the closing the gap initiatives\".\n\n\"If justice and the community are really serious about closing the gap, then culture, as in artwork, must sit basically at the centre of that rehabilitation,\" he said.\n\n\"Seeing artwork created in custody that's been purchased with proceeds going to the artist, and then more importantly displayed in institutions such as the Downing Centre, Court and Admiralty House, it sends a really powerful message to mob.\n\n\" Basically what it tells them is all those historical factors of being excluded, and racism and discrimination, and all the negative effects of colonisation, they are changing in 2026. \"\n\nMultiple artworks feature animals. (ABC News: Patrick Thomas)\n\nHe said it reflects an \"emerging commitment to recognition and respect\" that can can hopefully \"lead to change\".\n\n\"When we're only 3.8 per cent of the population, there's obviously something wrong when we're 30 to 40 per cent of the prison population,\" Mr Raymond said.\n\nUltimately for John, it makes him feel \"really proud to know that people do appreciate my work\".",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/people-first-bank-closures-spark-concern-confusion/106238954",
        "title": "People First Bank branch closures spark concern and confusion",
        "publish_date": "Fri, 16 Jan 2026 21:31:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Anthony Anderson walks into his local People First Bank branch in Queensland's south-west, staff know his name.\n\nThey ask how he's been, what he wants to do, and understand he needs assistance with his banking because he lives with an intellectual disability.\n\nWhen the financial institution announced this week that Mr Anderson's local branch at Wilsonton in Toowoomba was among 18 of its sites to close across Australia, he was \"not happy\".\n\n\"I have to go to the bank with my mum and my support worker,\" Mr Anderson said.\n\nHis mother, Gaye Toms, also lives with an intellectual disability and banks with People First.\n\nShe remembered when the Toowoomba‑based Heritage Bank merged with Adelaide's People's Choice Credit Union in 2023, promising no branches would close as a result.\n\n\"I've been a customer since 2018,\" Ms Toms said.\n\n\"It feels like they have kicked us in the back.\"\n\nCustomer habits drive closures, says bank\n\nPeople First Bank this week said 12 former Heritage Bank branches, three People's Choice Credit Union sites and three agency locations would close from 4pm on March 12, 2026.\n\nMany People First branches still had Heritage branding. (ABC Southern Qld: Dan McCray)\n\nIn Queensland, branches will close at Millmerran, Oakey, Pittsworth, Toowoomba Range, Wilsonton, Hervey Bay, Kawana Waters, Kippa‑Ring, Coomera, Tweed Heads and Runaway Bay.\n\nOne branch will close in New South Wales at Macquarie Park, one in Victoria at Caroline Springs, and two in South Australia at Millicent and Blackwood.\n\nAgency sites will also close at Laidley, Goondiwindi and Maryborough.\n\nPeople First Bank chief customer officer Maria‑Ann Camilleri told the ABC that the decision was difficult and based on \"rapidly\" changing consumer habits.\n\n\"Most of our customers are using card payments, ATMs, internet banking or our app for their day‑to‑day banking needs,\" she said.\n\nLoading...\n\n\"That means less than 1 per cent of our transactions now occur in branch.\"\n\nMs Camilleri said affected staff would be offered an alternative role and there would be no job cuts, and rejected claims the bank had broken its merger promise.\n\n\"We did make a commitment that there would be no branch closures as a result of the merger, and we've met that commitment,\" she said.\n\n\"These closures are based on low usage and a significant shift towards digital banking.\"\n\nDigital banking not an option for some\n\nNot all customers are able to bank digitally.\n\nMr Anderson said he no longer used internet banking after repeatedly having his card compromised.\n\n\"People were always hacking my card,\" he said.\n\nFor others, age and accessibility remained barriers.\n\nToni Osborne says her elderly parents will be greatly affected by People First's decision to close the Millmerran branch. (ABC Southern Queensland: Dan McCray)\n\nToni Osborne's parents live near Millmerran, about 200 kilometres west of Brisbane, and do not do digital banking.\n\n\"My mum's 86 — she doesn't know how to do internet banking,\" Ms Osborne said.\n\n\"She can't even use an ATM; she struggles to use the EFTPOS machine.\"\n\nWhen the Millmerran site closes on March 12, the Osbornes' nearest People First branch will be in Toowoomba — a 160-kilometre or three-hour round trip in the car.\n\n\"That's a lot of extra fuel and extra costs, with the price of everything going up,\" Ms Osborne said.\n\n\"And my parents aren't the only ones affected.\n\n\"There are so many elderly people who will be impacted by this.\"\n\nClosures 'bizarre' in booming towns\n\nThe shutting down of bricks and mortar branches outside capital cities is a national issue with a Senate inquiry handing down its report on bank closures in regional Australia to the federal government in 2024.\n\nThe federal government has since estimated that more than a third of all branches across regional Australia have closed since 2017.\n\nMost recently, Bendigo Bank shut 28 of its regional and rural outlets in October.\n\nLast year, three of the Big Four banks and Westpac agreed to keep their regional branches open until 2027 and 2030 respectively.\n\nOn the farming plains west of Toowoomba, Millmerran Commerce and Progress Inc said the People First Bank's announcement came as a shock in the bustling town.\n\n\"There's a lot of confidence here,\" vice-president Jan Fitzgerald said.\n\nJan Fitzgerald says the Heritage Branch will be the only empty building in town when it shuts. (ABC Southern Queensland: Dan McCray)\n\n\"We are fortunate enough to have no empty buildings in town.\n\n\"Real estate has been going well, and last year we opened a new hospital.\"\n\nThe state member for Condamine, Pat Weir, said the closures would leave Pittsworth and Oakey in his electorate without any branch-based banking services.\n\n\"It's a bizarre situation,\" he said.\n\n\" Both towns have land being developed, houses are being built, new people are moving in — more money is coming into these towns — and suddenly the last bank is being closed. \"\n\nPat Wier says Oakey and Pittsworth will be left with no local banks. (ABC Southern Queensland: Dan McCray)\n\nQueensland Treasurer David Janetzki, the member for Toowoomba South and a former Heritage Bank employee, expressed his anger on social media.\n\n\"This decision is a betrayal of the heartland and devastating news for our region,\" he said.\n\nFederal Liberal MP for Barker, Tony Pasin, whose electorate covers south-east South Australia, said he was \"incredibly disappointed\".\n\n\"My advice to people in these circumstances is to vote with your feet,\" he told ABC SA Regional Drive.\n\nPeople First Bank has confirmed it will close 15 branches across Australia in March. (ABC Southern Queensland: Dan McCray)\n\nPeople First Bank said it would help members transition to other banking options.\n\n\"This includes dedicated support lines, which will remain open for six weeks after the closures,\" Ms Camilleri said.\n\n\"We've implemented a very detailed transition program.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/boxing-nelson-asofa-solomona-calls-out-nrl-rivals/106240134",
        "title": "Asofa-Solomona plans to 'clean up the whole NRL division' after boxing debut",
        "publish_date": "Fri, 16 Jan 2026 21:29:15 +0000",
        "category": "sports",
        "authors": [],
        "text": "Nelson Asofa-Solomona wants to take out all-comers from the NRL \"and go from there\" after making an explosive professional boxing debut against ex-rugby league journeyman Jeremy Latimore.\n\nThe super-sized Asofa-Solomona knocked out Latimore with a massive uppercut just two minutes and 22 seconds into the first round of Friday night's heavyweight stoush in Brisbane.\n\nDisillusioned after missing Melbourne's past two grand final losses because of suspension, the two-time Storm premiership winner turned down a reported $800,000-a-season deal with Parramatta — one of Latimore's five former clubs — to have a crack in the ring instead.\n\nTszyu accuses 'cowardly' Zefara of quitting after grudge match called off Nikita Tszyu and Michael Zerafa hotly anticipated fight is abandoned after the second round as the crowd vents its frustration at the Brisbane Entertainment Centre.\n\n\"You can't get sent off in boxing,\" he famously said after announcing his NRL defection in November.\n\nFighting on the undercard to Nikita Tszyu's domestic blockbuster with Michael Zerafa, the so-called \"Big Nasty\" proved an instant hit — even if he was not impressed himself.\n\nLatimore, 39, was giving away 10 years and 22 kilograms to the 133kg Asofa-Solomona, and the former Eels, Warriors, St George Illawarra, Penrith and Cronulla cult figure could not last a round.\n\n\"Yeah, it feels great but I'm not happy with the performance, to be honest,\" Asofa-Solomona said.\n\n\"I'm not happy with the way I was holding my stance and stuff like that. I was a bit loose.\n\n\"But I just want to say credit to this man [Latimore] right here. A lot of people wouldn't dare to jump in this ring.\n\n\"So can we just give him a round of applause please everyone. Takes a lot of balls to get in.\"\n\nRetired former South Sydney enforcer George Burgess has already called out Asofa-Solomona, saying he was fit and primed to take on the New Zealand Test star.\n\n\"I want to clean up the whole NRL division and then we go from there,\" Asofa-Solomona said when asked who his next target was.\n\n\"Any NRL player can get it.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nNot ruling out a return to league, the 29-year-old has signed a multi-year deal with No Limit Boxing and is intent on honing his skills before making any big calls on his future in either sport.\n\n\"It [my boxing debut] was a bit wild but, look, I'm just going to go back to the drawing board and just try and perfect everything in my game,\" he said.\n\n\"Man, what a journey. We know we've got bigger and better things to come and [I'm] really excited for the future.\"\n\nAsked who his next target was, Asofa-Solomona said, \"Any NRL player can get it. I want to clean up the whole NRL division and then we can go from there.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/brisbane-boat-living-marina-housing-costs/106224448",
        "title": "Renters swapping apartments for boats for inner-city living at $500 a week",
        "publish_date": "Fri, 16 Jan 2026 21:07:23 +0000",
        "category": "finance",
        "authors": [],
        "text": "Jordan Koursaris is living the dream, but his inner-city home looks a little different to the apartments and houses that overlook the Brisbane River.\n\nAfter getting divorced in 2024, the 40-year-old moved out from his house and into an apartment, before deciding he did not like it.\n\nJordan Koursaris says he has dreamed about living on a boat for years. (ABC News: Crystalyn Brown)\n\nHe then moved alone onto a 1966 boat he bought for $18,500 called Mary Rose.\n\nMary Rose is moored at one of the 76 berths at Kangaroo Point's Dockside Marina, which Mr Koursaris said costs him $1,455 per month, including power and water.\n\nMary Rose was built in 1966 and has competed in five regatta races. (ABC News: Crystalyn Brown)\n\n\"I do have a storage shed, that's $150 a month, and I have a car space that's $275 a month,\" he said.\n\n\"So it's less than two grand a month; less than $500 a week, and that includes all my expenses.\"\n\nRenting a unit in Kangaroo Point costs an average of $720, according to Domain's December quarter data, with most renters also paying utility bills on top of that.\n\nJordan Koursaris moved onto his boat six months ago, following a recent divorce. (ABC News: Crystalyn Brown)\n\nThe realities of living on a boat\n\nFor Mr Koursaris, living on a boat is not just about saving money — it is a lifestyle he had dreamed about for years.\n\n\"I've always wanted to live on a boat. I went through a divorce and … lived in an apartment for a year and thought, now's the time to do it,\" he said.\n\n\" I just wanted to test it out and see if I liked the lifestyle. \"\n\nBut life on the marina is not without its complications.\n\nMary Rose is about 8 metres long and 2.5 metres wide. It's compact, and Mr Koursaris has to duck his head while moving around the boat.\n\n\"I don't stand much … or at all,\" he said.\n\nA bed is built into the bow, with an emergency escape hatch over the mattress.\n\nThe bed has an escape hatch overhead, in case of an emergency. (ABC News: Crystalyn Brown)\n\nMr Koursaris said while the bed was \"comfy\", he had recently struggled with a wood fungus growing under the bed.\n\nHe had to treat it with a toxic epoxy, which meant he had to sleep on a bean bag in his office building for a night.\n\nThe living area is compact, with two small benches serving as a bathroom and cooking space. A hollow, padded bench — the cabin's only available seat — is also used as a storage space.\n\nOne of the benchtops hosts a miniature rice cooker and hot plate set.\n\nMr Koursaris says the miniature appliances he bought to furnish his compact kitchen make him feel like he's \"living in a doll-house\". (ABC News: Crystalyn Brown)\n\n\"This makes me [feel] like I'm living in a doll house,\" Mr Koursaris said.\n\n\"It wasn't until after I got them that a friend said, 'You know they're for kids to learn how to cook?'… [but] they work.\"\n\nBooks and toiletries are crammed into nooks and crannies. A varnished wood chest holds his summer clothes, while his winter attire is kept in a storage space offsite, and the wardrobe is rotated according to the seasons.\n\nMr Koursaris has been inventive while trying to fit life necessities onboard. (ABC News: Crystalyn Brown)\n\nThe wood fungus on the bed is not the only challenge Mr Koursaris has faced since moving onto the boat.\n\nThe business development manager has also struggled with regular power outages and hail-damaged solar panels in the six months he has lived onboard.\n\nBut living on a boat was always a dream, and now he is living it and planning to upgrade to a larger vessel by the end of the year.\n\nThe living area on Mary Rose is compact. (ABC News: Crystalyn Brown)\n\nA 'fun new experience'\n\nHis neighbour, Josh Goodswen, is also a recent divorcee and has been living on a boat for a month.\n\nMr Goodswen said he and his ex-wife had previously lived in Noosaville and Sydney, and estimated he is now spending \"a third\" of his previous living expenses.\n\n\"I just thought I'd be in for a bit of an adventure … I thought, 'hey, time to branch off,'\" he said.\n\n\"The berthing rent is really economical. If you look at some of the apartments around, they're paying quite substantial rents.\"\n\nMr Koursaris continued to downsize, moving from a house, into a unit, then onto Mary Rose. (ABC News: Crystalyn Brown)\n\nSam Dunmore lives on the next finger over. The 22-year-old is among the younger residents at the marina.\n\n\"It's my parents' boat … we used to have it moored on the Gold Coast, just sitting there, not doing anything,\" he said.\n\n\" I wanted to live in the city … and I chose to live on the boat because it would be a fun new experience. \"\n\nIf the retail worker rented an apartment like his friends, he said he would be spending much more.\n\nCotality data shows weekly rent in Brisbane averages $708, while Domain's latest quarterly rent report found prices rose 3.1 per cent in the December quarter.\n\n\"Compared to owning or renting — with all the extras on top of that — it's a lot cheaper,\" Mr Dunmore said.\n\nRent rises by almost 50pc in five years\n\nCotality's executive research director for the Asia Pacific, Tim Lawless, said he estimates renters in Brisbane would be spending more than a third of their gross income on rent.\n\nBrisbane rents growing faster than other major cities The median asking price for a rental house in Brisbane rose by more than 3 per cent last quarter.\n\n\"The cost of renting has increased by around 49 per cent over the past five years. In dollar terms, that means renters in Brisbane are paying about $225 more a week than they were back in December 2020,\" he said.\n\n\"They're up 50 per cent across regional Queensland.\"\n\nBuying property is also out of reach for many Australians, with an average house in Queensland's capital now setting buyers back $1.13 million. An average unit costs $807,161, according to Cotality.\n\n\"While it's a little out of the box, a houseboat might be a practical and affordable option, even though it does come with its own challenges,\" Mr Lawless said.\n\nMr Koursaris uses disposable utensils, to reduce washing up in the boat’s small sink. (ABC News: Crystalyn Brown)\n\nIncrease in permanent boat residents\n\nDockside Marina manager Ken Allsop said he had seen more people residing at the marina in recent years, with boats spanning from 10 metres up to 25 metres.\n\nHe estimated a third of the boats docked are permanently lived in by the owners, many of whom utilise the bathrooms, showers and laundry in amenities blocks.\n\nKen Allsop estimates a third of the boats docked at Kangroo Point's Dockside Marina are permanently lived in. (ABC News: Crystalyn Brown)\n\n\"When I got involved with the marina … it was 75 per cent vacant,\" Mr Allsop said.\n\n\"It's a nice lifestyle, it's a waterfront apartment for nowhere near the millions that some people spend.\"\n\nMr Koursaris is planning to upgrade to a larger vessel by the end of the year. (ABC News: Crystalyn Brown)\n\nFor Mr Koursaris, his six-month trial of living on the water has been largely positive, and he is now planning to upgrade to a larger boat.\n\nBut he admitted he could eventually move back into a house or unit \"at some point\".\n\n\"Living on a boat is very fun … sometimes it's not too practical, but I'm enjoying it at the moment.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/unauthorised-ski-event-organised-without-government-aprroval/106223480",
        "title": "Unauthorised ski racing event threatens 'death of the sport' after suspension",
        "publish_date": "Fri, 16 Jan 2026 20:59:38 +0000",
        "category": "sports",
        "authors": [],
        "text": "The peak body for water ski racing in Australia says a proposed event, which it claims is unsanctioned, could \"be the death of the sport\" if it goes ahead.\n\nThe event — organised by a group called Riverland Water Ski Racing SA and promoted on Facebook in early December — is scheduled to take place at Lake Bonney in South Australia's Riverland.\n\nThe proposed program includes 17 races, with some classes scheduled to reach speeds of up to 144 kilometres an hour.\n\nIt comes as the national peak body, Ski Racing Australia (SRA), suspended all racing events as of June 2024, following the deaths of four participants in a 12-month period.\n\nThe chair of SRA's SA branch, Graeme Stegmeyer, said the Riverland event is in no way affiliated with SRA, and the peak body has not sanctioned the proposed event.\n\nGraeme Stegmeyer says Ski Racing Australia races have \" been on hold\" for two years due to investigations into the sport's safety. (Supplied: Graeme Stegmeyer)\n\n\"We've had no contact with the organisers at any stage during their planning process, and we made a request that they remove any reference to Ski Racing SA,\" Mr Stegmeyer said.\n\n\"The last thing we need is for an unsanctioned event to happen, and something serious goes wrong.\n\nSki Racing Australia's SA branch has contacted the group asking to remove any reference to Ski Racing SA in its name. (Source: Riverland Water Ski Racing SA Facebook)\n\n\"Our sport is in a very precarious position at the moment, and we need to be able to be ticking all the boxes.\"\n\nSki racing is a high-speed water sport where participants are pulled by powerboat along a river, lake or dam course, reaching speeds up to 170km/h.\n\n'No approvals provided'\n\nRiverland Water Ski Racing SA claimed it secured a public liability \"insurance certificate\" in December, with the group promoting entry fees of $350 a boat and $300 a participant on its Facebook page.\n\nIn a video posted to social media on December 11, the group claimed it had \"full support of the Berri Barmera Council and Marine SA\".\n\nA Department for Infrastructure and Transport (DIT) SA spokesperson told the ABC it had \"not been contacted by the event organisers\".\n\n\"The Department has not provided any approval for this event to take place,\" the statement read.\n\n\"An aquatic activity licence is required for any event requiring exclusive use of a waterway for an aquatic sport or activity.\"\n\nSome of the proposed events are set to reach speeds of up to 144km/h. (Source: Riverland Water Ski Racing SA lake race format)\n\nDIT requires applications for an aquatic activity licence to be submitted \"no less than four weeks prior to an event\", and at least four-weeks notice is required to \"ensure the licence can be issued before the event\".\n\nAs of September 2024, NSW Maritime had indefinitely suspended all aquatic licences related to water ski racing in NSW.\n\nLocal council support and event-specific public liability insurance of at least $20 million is required to obtain an aquatic activity licence in South Australia.\n\nIn a statement, Berri Barmera Council chief executive Tim Pfeiffer said the council had written to the event organisers and \"acknowledged that the event appears to align with council's strategic plan outcomes\".\n\n\"Council's consideration [however], is for the portion of the event to which local government is directly and legally accountable, being the land-based component of the event,\" the statement read.\n\n\" It is not within council's expertise or legislated accountabilities to consider the safety of the on-water component of the event or to grant an associated aquatic activity licence. \"\n\nThe group has outlined the start and finish locations for the proposed 6-kilometre course. (Source: Riverland Water Ski Racing SA competitor pack)\n\nAccording to Riverland Water Ski Racing SA's participation declaration, the organisers had \"limited insurances in place for both personal injury and public liability\".\n\n\"These insurances WILL NOT provide full indemnity and MAY NOT provide partial indemnity, for loss, damage or injury that you may suffer during participation in water ski racing activities,\" the document read.\n\nThe ABC contacted Riverland Water Ski Racing SA via phone and email, seeking a response to DIT's claims that approval for the event had not been provided.\n\nIn its request, the ABC asked Riverland Water Ski Racing SA whether it had applied for and received approval for the event to take place, obtained an aquatic activity licence, and had support from the local council.\n\nRiverland Water Ski Racing SA did not respond to the ABC's requests for comment.\n\nSport in limbo\n\nMore than a year since the sport was suspended due to safety concerns, the New South Wales government released its Special Purpose Investigation into Water Ski Racing last week, making eight recommendations.\n\nThe report found the odds of a skier being fatally injured were \"thirteen times greater than not being fatally injured\" when speeds are greater than 125km/h.\n\nThe report recommended the prohibition of all water ski racing on river courses and a permanently imposed speed reduction to 110km/h on all towing activities.\n\nSRA announced that it will be conducting \"member information forums\" to discuss the future of the sport in the coming weeks.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/sarah-blizzard-bobsled-dutch-team-lend-sleigh-winter-olympics/106236422",
        "title": "With a team's Olympic hopes at risk, this Aussie stepped in to help",
        "publish_date": "Fri, 16 Jan 2026 20:57:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "As the countdown to next month's 2026 Winter Olympic Games in Milano-Cortina continues, it is sometimes worth taking a step back and thinking about what the Olympics really means.\n\n\"The important thing in life is not the triumph but the struggle. The essential thing is not to have conquered but to have fought well,\" said Baron Pierre de Coubertin, founder of the modern Olympics.\n\nSportsmanship and the principles of fair play were at the heart of his Olympic vision.\n\nNobody has exemplified that more than Australian Sarah Blizzard this week.\n\nAt last weekend's World Cup meet in St Mortiz, Switzerland, the Dutch two-man team of Dave Wesselink and Jelen Franjic realised they had a problem.\n\nTheir Olympic dream was on the rocks.\n\nThe week before, in Winterburg, the Dutch pair finished in 21st place.\n\nTo meet the Netherlands' strict qualification criteria, they had to finish in the top eight in Switzerland or face a month off while their rivals were shooting down the Pista Olimpica Eugenio Monti in Cortina d'Ampezzo.\n\nDave Wesselink (right) and Jelen Franjic were facing Olympic heartbreak. (Supplied: IBSFsliding)\n\n\"We saw we had potential in the two-man bobsled but the equipment wasn't good enough,\" Wesselink told NU.nl.\n\n\"A 21st-place finish wasn't where we belonged. That result convinced us we had to do things differently if we still wanted to make it to the Games.\"\n\nBut what to do?\n\nCustom-built sleds can cost anything up to $150,000 and getting a replacement on such short notice would have been impossible.\n\nBut what about loaning one for their race?\n\nThat's when Blizzard stepped in.\n\nSarah Blizzard (right) and Desi Johnson compete together in the two-woman bobsleigh. (Supplied: IBSFsliding)\n\n\"We kind of work together already,\" Blizzard tells ABC Sport from Altenburg, where the final World Cup event on the season is set to take place this weekend.\n\n\"We have a bit of a cooperation with our team, with the Belgians and the Dutch at the track anyway.\n\n\"We have worked together, and the Dutch coaches and mechanics have helped us quite a lot in the past.\n\n\"They [the Dutch] had a race in Winterberg in Germany and it wasn't the result that they needed.\n\n\"I was actually watching the race in my hotel room and I saw it looked like a nice run. Just there wasn't a lot of speed in the sled and about five minutes later the coach calls me and goes, 'Hey, Blizzard, would you consider lending us your sled in St Moritz?'\n\n\"They said there's no speed, they needed a better sled, so I'm like, alright, let's talk about it and it kind of went from there.\"\n\nIt was still a big call to make.\n\nBlizzard's sled is her own, paid for through sponsors and family loans for about €35,000 ($60,700).\n\nThe Dutch were thrilled after realising they had achieved their goal. (Supplied: IBSFsliding)\n\nBobsled is not a cheap pursuit.\n\nBut Blizzard was happy to loan them the sled and it paid off in a big way.\n\n\"They got the result that they needed and it was very heartwarming,\" Blizzard said.\n\n\"We absolutely loved watching it. We were so excited for them, they're great guys. They've been helping us so much and I'm very, very happy for them.\n\n\"But then going forward to the Olympics as well, it's another opportunity for them to hopefully perform in a better spot too, because they're obviously capable of it.\"\n\nThe men's two-man bobsleigh race takes place the day before the women's event, so Blizzard and her brake woman, Desi Johnson, would not be using theirs on that day.\n\n\"The bobsled world is one big family and we've always had a good relationship with the Australian women,\" Wesselink said.\n\n\"We politely asked if we could borrow their two-man bobsleigh. They said yes, and we didn't even have to pay for it.\"\n\nSpot the difference. The Dutch team (top) were very happy to use the Australian team's (bottom) sled. (Supplied: IBSFsliding)\n\nThe story cuts to the heart of what the Olympic experience is supposed to represent and has incredible parallels with the Italian sliding legend whose name adorns the track where the gold medals will be decided next month.\n\nEugenio Monti was the first ever recipient of the Pierre de Coubertin Fair Play Trophy for two acts of sporting selflessness at the 1964 Games in Innsbruck.\n\nIn the four-man competition Monti helped the Canadian team fix their sled after they broke an axle during their first run and then, in the two-man competition, Great Britain's sled was damaged due to a bolt having sheared off, with Monti offering the Brits one from his sled to enable them to continue to compete.\n\nBoth teams that Monti helped went on to win gold in their events, beating Monti and his Italian teammates into the minor medals.\n\nEugenio Monti (right) was awarded the first ever Pierre de Coubertin Fair Play Trophy. (Getty Images: Keystone/Hulton Archive)\n\n\"[British driver Tony] Nash didn't win because I gave him the bolt. He won because he had the fastest run,\" Monti said amid criticism from the Italian press.\n\nMonti, at that stage in his career, had not won an Olympic gold medal, adding another level to his stellar display of sportsmanship.\n\nIt is clearly an ethos that has continued to the present day.\n\n\"Bobsleigh is a very friendly sport,\" Blizzard said.\n\n\"If you need help, you can generally find that with the team somewhere. Honestly, it's a very, very friendly sport.\"\n\nAustralia's quartet of female bobsleigh sliders (from left) Desi Johnson, Bree Walker, Sarah Blizzard and Kiara Reddingius. (Supplied: IBSFsliding)\n\nBlizzard, a former track athlete who notably competed in four-straight Stawell Gift finals before switching to the ice to partner Bree Walker in the two-woman bobsled before the last Olympics, is still in the hunt for a spot in Milano-Cortina.\n\nThe 29-year-old Victorian slider was a reserve in Beijing and is desperate to compete in Cortina.\n\nShe is currently ranked 23rd in the 2025/26 Two-Woman Bobsleigh World Cup standings, with a best performance of 17th in Winterberg at the start of January, although that only takes into account World Cup events, with Blizzard also picking up qualification points on the Europe Cup circuit where she is ranked fifth.\n\nBree Walker, who is second in the monobob World Cup standings with three wins this season, is ranked 17th in the two-woman standings.\n\nThe Aussies will find out if they make it to the Games on Friday, when the team is announced in Melbourne.\n\nThe Dutch though are already there.\n\n\"My phone is blowing up. It still feels a bit surreal,\" Wesselink said about the Olympic qualification.\n\n\"When we knew we could borrow Sarah's sled this week, we thought we might get a good result. But eighth place is surprising even for us.\"\n\nSo good, in fact, that the arrangement will continue all the way to the Games.\n\n\"We can borrow this two-man bobsled again next week for the World Cup in Altenberg and probably during the Games as well,\" Wesselink said.\n\n\"There are no rules that wouldn't allow that.\"\n\nAs for Blizzard, she's more than thankful to the Dutch team and is happy to repay them.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It's kind of like a big family, bobsleigh,\" Blizzard said.\n\n\"Everyone helps everyone. Quite often, if you need a bolt and you're at the track, someone's gonna have something and they don't mind you using it.\n\n\"Sometimes you gotta buy a case of beer or some wine or something, but everyone is incredibly helpful and a lot of people have helped me over the years.\n\n\"A lot of people have loaned me things, so I'm glad that I can repay it in a way, but I'm more than happy to help these guys, they help me so much and they've been trying so hard to get these results.\n\n\"And they deserve it.\"\n\nHopefully Blizzard's kind deed will be repaid with a spot of her own at the Games.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/bruising-week-for-peter-malinauskas-election-time/106238076",
        "title": "The SA premier faced one of his most bruising weeks yet. Will it matter come election time?",
        "publish_date": "Fri, 16 Jan 2026 20:41:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "There is an unwritten rule that guides the interaction between journalists and politicians at press conferences.\n\nThe politician gets to make an uninterrupted opening statement about whatever they want to talk about or announce.\n\nThe journalists indulge them with a handful of questions on this topic.\n\nAnd then questions shift to \"other matters\" – any issue under the sun that is in that day’s news cycle.\n\nSA premier becomes emotional during press conference Peter Malinauskas becomes tearful during a media conference where he faces extensive questions about the crisis surrounding Adelaide Writers' Week and allegations of homophobia against Adelaide United made by former player Josh Cavallo.\n\nFor South Australian Premier Peter Malinauskas, one \"other matter\" in particular followed him around for the entirety of the past week.\n\nThe intense media interest in Adelaide Writers' Week’s stunning implosion – accompanied by the dizzying crossfire of allegations, legal threats, blistering resignations and personal invective (some of which has been directed at the premier) – largely overshadowed what was likely meant to be a well-planned rollout of Labor pre-election announcements.\n\nOn Sunday, the premier fronted the cameras to announce a new opening date for the Adelaide Aquatic Centre. He received 10 questions about Writers' Week.\n\nOn Monday, it was $18.5 million for IVF rebates (11 questions about Writers' Week); on Tuesday, $200 million for Mount Barker infrastructure (eight questions about Writers' Week); and on Wednesday, a $12 million loan for a Port Augusta cement project (13 questions about Writers' Week).\n\nPeter Malinauskas fielded questions about Adelaide Writers' Week during a press conference in Port Augusta. (ABC News)\n\nTo get a sense of the frustration it has caused a government trying to move on from a negative story, consider the premier’s reaction on Wednesday when he was asked a question on a different subject.\n\n\"Really? There's other matters? There’s other things people care about?\" Mr Malinauskas quipped.\n\n\"Sorry, I’m just trying to recalibrate my brain to someone asking me a question that’s not about Writers' Week.\"\n\nA government in control\n\nThe Malinauskas government’s inability to get Writers' Week out of the news cycle is noteworthy considering its track record of sucking the oxygen out of a negative story.\n\nTake, for example, its failure to meet its past election promise to fix the ambulance ramping crisis.\n\nWhen the monthly ramping statistics are dropped, ministers routinely cite aged care bed block as a reason for hospital strain, telling reporters they are \"throwing the kitchen sink\" at the issue.\n\nThe ramping figures, which are usually released on a Friday or Saturday, get a smattering of media coverage on the lower-rating weekend nights, and by Monday, the news cycle has moved along.\n\nThe strategy compares to that of their Liberal opponents, who, in the final days of their 2022 election campaign, struggled to divert the media’s attention away from ambulance response issues and health system failures.\n\nWriters’ Week was something different.\n\nRanda Abdel-Fattah was set to appear at Adelaide Writers' Week to discuss her new novel Discipline. (ABC RN: Jennifer Wong)\n\nEvery day – sometimes every hour – there was something new that moved the story along and further out of the Labor government’s control.\n\nThe former Adelaide Festival board’s announcement last Thursday that it had – after receiving written support from the premier – disinvited Palestinian Australian author Randa Abdel-Fattah over her controversial commentary on Israel and Zionism was quickly followed by the withdrawal of about 180 authors.\n\nBy Saturday, former Adelaide Festival leaders were pressuring the board to reverse its decision; by Sunday, the board’s chair and three other directors had resigned; and by Tuesday, the 2026 event was cancelled after the exit of the entire festival board and Writers’ Week director Louise Adler, who resigned in protest of what she termed \"an act of cultural vandalism\".\n\nLouise Adler said the board's decision to cancel Abdel-Fattah came despite her \"strongest opposition\". (ABC News/7.30)\n\nThis type of criticism on a national platform is not something this government has been accustomed to, particularly given Mr Malinauskas’s leadership on issues like the teen social media ban and political donations reform.\n\nCome Wednesday, Abdel-Fattah was threatening defamation action against the premier and by Thursday, the government’s newly appointed board had reversed almost everything done by the old board – re-inviting Abdel-Fattah to the 2027 event and apologising to her \"for the harm the Adelaide Festival Corporation has caused her\".\n\nThe new board’s reversal staved off a boycott from the Adelaide Festival’s headline act Pulp, whose withdrawal would have done untold further damage to the 2026 event.\n\nWhile the board’s reversal could be interpreted as a rebuke of Mr Malinauskas’s view, Adelaide Festival executive director Julian Hobba on Thursday expressed an appreciation for the premier’s \"consistent position that the curatorial choices of Adelaide Festival, including Adelaide Writers' Week, are at the discretion of the organisation\".\n\nWhat do people care about?\n\nWhen the festival cancelled Writers’ Week, Mr Hobba said his feelings around the event were like \"[going] back to your property after it's been burned down by a bushfire\".\n\nBut has Labor’s likely March election victory also been damaged in the Writers’ Week blaze?\n\nParty figures on both sides of the aisle are very sceptical.\n\nAs one Labor source said on the controversy: \"Not every interesting news story shifts a material amount of voters.\"\n\nIf there is to be any fallout from the last week, it would likely be contained to the inner-city seats of Adelaide, Dunstan, Unley and possibly Bragg.\n\nDisaffected Labor voters in those electorates could potentially shift to the Greens or an independent, but it is unlikely they would shift to the Liberal Party, which has backed the premier’s view on Abdel-Fattah.\n\nAdelaide Writers' Week is the biggest literary festival in Australia. (ABC News: Evelyn Manfield)\n\nThe premier has repeatedly said that Writers’ Week was not his focus and that many voters were on the same page.\n\n\"While everyone’s doing the naval gazing around Writers' Week – and I get that, I’m not suggesting it’s unimportant – I’ve actually been out there making policy announcements that change people’s lives,\" he said on Friday.\n\n\"In regional South Australia they’re not talking about Writers' Week.\n\n\"In fact, I suspect in many dinner tables across the state they’re not talking about Writers' Week because people have got real lives worrying about issues that are immediate to them.\"\n\nNot to mention all those voters who agree with the premier’s approach to the issue or questioned the curation of the event.\n\nThe premier has also repeatedly pointed to the board’s role when asked about the unfolding crisis.\n\n\"I think the people who run the festival, which is the board … have got this into a pretty awful situation, which is unfortunate,\" he said on Monday.\n\nAdelaide Writers' Week was cancelled on Tuesday after days of furore. (ABC News)\n\nThe government has also pointed reporters to comments made by Jewish-American author Thomas Friedman, who told the Sydney Morning Herald on Thursday he was invited to appear at the 2024 Adelaide Writers’ Week, but was told by email a few days later \"that the timing would not work out\".\n\nAbdel-Fattah has previously said she objected to Friedman's attendance at the festival in 2024, over the language he used about the Middle East in a New York Times article entitled \"Understanding the Middle East Through the Animal Kingdom\".\n\nThe future of Writers' Week\n\nWhile the Writers' Week story might lose some steam next week, there is no sign it is going away.\n\nThe success of this year's Adelaide Festival will be under intense scrutiny, as will the artistic direction of Writers' Week in 2027. (The Jewish Community Council of South Australia's Norman Schueler has already called on the state government to defund the event).\n\nThe potential remains for a high-stakes legal case between the premier and Abdel-Fattah, as does the return of the Palestinian Australian author – and Louise Adler – to the festival fold.\n\nIn other words, Writers' Week will likely remain one of those \"other matters\" for a long time to come.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2026-01-17/steve-smith-david-warner-score-bbl-centuries/106239560",
        "title": "Smith breaks BBL record and outduels Warner as Pakistan teammate fumes",
        "publish_date": "Fri, 16 Jan 2026 20:37:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "Steve Smith has eclipsed David Warner by scoring a 41-ball century and setting a Big Bash record as the Sydney Sixers claimed a five-wicket victory over the Sydney Thunder.\n\nAfter Warner had whacked 110 not out off 65 balls at the SCG on Friday, setting the Sixers a target of 190 to win, Smith stepped up and upstaged his long-time international teammate.\n\nThe Test batsman crunched 100 in an electric knock, which included five fours and nine sixes.\n\nSmith briefly threatened to race to the fastest BBL ton (39 balls) but still left the SCG with a record to his name.\n\nAfter overruling Babar Azam to take the strike in the power surge, the former Australian captain punished Ryan Hadley with four back-to-back sixes in an over.\n\nIn total, the Sixers batter humiliated the Thunder bowler by dispatching him for a record 32 runs off a single over.\n\n\"We knew we had to go hard from the outset because Davey played a beautiful knock,\" Smith told Kayo Sports.\n\n\"I got off to a really good start with Babar. I thought he played really nicely, we got a partnership together, and that set the foundation, and we went on from there.\"\n\nAzam was dismissed for 47 off 39 deliveries shortly after being denied the strike, ending a 141-run opening stand between him and Smith.\n\nAs he walked off the ground, the star Pakistan recruit fumed and smacked the boundary rope with his bat.\n\nNot only did Smith give Hadley a hard night, but he also stole Warner's limelight and hope of pulling off an upset for the Thunder.\n\nBattling a knee complaint that ruled him out of Monday's loss to the Melbourne Renegades, the 39-year-old Warner raced to a fourth-straight 50 and left the Sixers' bowlers second-guessing themselves as he brought up his ton.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nWarner's knock takes him top of the BBL run scoring charts, and the veteran batsman even made light work of Mitchell Starc, playing his first game in the competition in 11 years, by sending the Test bowler for a six over backward point.\n\nBut any sense that would be enough to secure a win, and put a dent in the Sixers' finals hopes, was put to bed by a 141-run opening stand between Azam and Smith.\n\nOn a rapid outfield, Smith was in fine touch from the get-go before falling for 100 when he was stumped by Sam Billings as he came down the wicket to Tanveer Sangha.\n\nThe fall of Smith briefly opened the door for the Thunder after Moises Henriques, Sam Curran and Josh Philippe had all departed for single-figure scores.\n\nBut Jack Edwards (17 not out) thrashed Hadley for a six to give the Sixers a win with 16 balls to spare.\n\nThe Sixers moved up to fourth with the win and can lock in a finals berth by beating the Brisbane Heat on Sunday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/world/tim-walz-decries-ice-chaos-and-trauma-in-minneapolis-20260117-p5nur3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tim Walz decries ICE 'chaos and trauma' in Minneapolis",
        "publish_date": "Sat, 17 Jan 2026 12:59:12 +1100",
        "category": "finance",
        "authors": [],
        "text": "Tim Walz decries ICE 'chaos and trauma' in Minneapolis\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/no-coach-no-worries-as-roar-beat-glory-in-perth-20260117-p5nuqy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "No coach, no worries as Roar beat Glory in Perth",
        "publish_date": "Sat, 17 Jan 2026 12:40:25 +1100",
        "category": "sports",
        "authors": [],
        "text": "Brisbane Roar have dedicated their 2-1 win over Perth Glory to Michael Valkanis after the veteran coach made an emergency dash to Greece due to a family medical emergency.\n\nValkanis jetted to Greece just hours before Friday night’s match in Perth, leaving assistant Borja Lema in charge.\n\nGlory skipper Adam Taggart opened the scoring in the 19th minute before Christopher Long levelled the scores via a 30th-minute penalty.\n\nChristopher Long of the Roar runs with the ball across the ground during the round 13 A-League Men match between Perth Glory and Brisbane Roar at HBF Park. Credit: Getty Images\n\nSamuel Klein scored the winner in the 50th minute, with the victory snapping a three-match losing streak and lifting Brisbane, on 21 points, into third spot.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/queensland/i-think-i-m-going-to-die-hand-me-down-earbuds-save-teen-s-life-after-80m-fall-20260117-p5nuql.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘I think I’m going to die’: ‘Hand-me-down’ earbuds save teen’s life after 80m fall",
        "publish_date": "Sat, 17 Jan 2026 12:25:42 +1100",
        "category": "sports",
        "authors": [
            "Laine Clark"
        ],
        "text": "Landing on his back with a thud, teenager Jake McCollum didn’t fancy his survival chances after falling 80 metres from a mountain in a Queensland national park.\n\n“I remember thinking it was probably all over for me,” he said.\n\nThe 18-year-old was “pretty banged up” after plummeting from Mount Walsh, 90 kilometres inland from Maryborough, during his first solo bushwalk.\n\nJake McCollum said the LifeFlight helicopter “went back and forth for quite a while” before he was winched to safety. Credit: LifeFlight\n\nHe suffered a fractured spine, broken ribs, internal bleeding and a “decent” head laceration.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/promotional-video-for-sharksafe-barrier-20260117-p5nuqw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Promotional video for Sharksafe Barrier",
        "publish_date": "Sat, 17 Jan 2026 12:22:41 +1100",
        "category": "finance",
        "authors": [],
        "text": "Promotional video for Sharksafe Barrier\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/basketball/wildcats-subdue-stubborn-hawks-in-perth-hoopsfest-duel-20260117-p5nuqt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wildcats subdue stubborn Hawks in Perth HoopsFest duel",
        "publish_date": "Sat, 17 Jan 2026 11:38:43 +1100",
        "category": "sports",
        "authors": [],
        "text": "The Perth Wildcats have started a run of home NBL games with a hard-earned 92-87 win over defending champions, the Illawarra Hawks.\n\nKristian Doolittle of the Wildcats drives to the basket against Daniel Grida of the Hawks. Credit: Getty Images\n\nEven with the Wildcats appearing in control for most of Friday night’s contest at their RAC Arena home as they ended up going to the foul line 37 times to Illawarra’s 12, the Hawks kept coming.\n\nFour late triples in the final minute kept it interesting and the Hawks got within three, but Perth got the job done at the stripe to win in front of 12,507 fans as part of HoopsFest.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/the-three-moments-that-show-44-year-old-roger-federer-has-still-got-it-20260117-p5nuq8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The three moments that show 44-year-old Roger Federer has still got it",
        "publish_date": "Sat, 17 Jan 2026 11:25:51 +1100",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "It was only a practice session, but boy, was it good.\n\nIt was as if no time had passed, as a 44-year-old Roger Federer stepped onto Rod Laver Arena for a hit with world No. 13 Casper Ruud on Friday.\n\nRoger Federer walks onto Rod Laver Arena for a practice session with Casper Ruud. Credit: Getty Images\n\nAlmost four years after he announced his retirement from tennis, and six since he’d last appeared at the Australian Open, the 20-time grand slam singles champion was back at Melbourne Park to dazzle the crowd once more.\n\nBut this time it’s a little different, with Federer invited by Tennis Australia to play an exhibition match on Saturday night as part of the slam’s opening ceremony, which will also feature Andre Agassi, Pat Rafter and Lleyton Hewitt.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/meghan-shares-video-of-her-dancing-with-prince-harry-20260117-p5nuqn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan shares video of her dancing with Prince Harry",
        "publish_date": "Sat, 17 Jan 2026 11:08:54 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Meghan shares video of her dancing with Prince Harry\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/environment/weather/sydney-s-beaches-closed-as-wild-waves-hit-the-nsw-coast-20260117-p5nuq1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sydney’s beaches closed as wild waves hit the NSW coast",
        "publish_date": "Sat, 17 Jan 2026 11:02:25 +1100",
        "category": "sports",
        "authors": [
            "Julie Power"
        ],
        "text": "Most beaches along the NSW coast were closed on Saturday as large waves caused dangerous conditions for swimming, rock fishing and boating.\n\nIt was “very gnarly” at Cronulla Beach Rock Pool, said actor Patch May, who lives in Vancouver but was visiting the spot he and his brother, Mikey, had played in since they were toddlers.\n\nDespite hanging on to the wire rope barrier, a couple of big waves knocked them off. “It was an absolute washing machine,” said May.\n\nWeather. Mikey and Patch May check out the wild surf conditions from the Cronulla rock pool. Credit: Sitthixay Ditthavong\n\nPatch, 33, and brother Mikey, 31, grew up in Cronulla. The brothers suggested anyone unfamiliar with the beach, and who lacked water safety skills, should stay out of the water on Saturday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/burgess-nas-clash-after-stunning-ko-debut-20260117-p5nuqj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Burgess, NAS clash after stunning KO debut",
        "publish_date": "Sat, 17 Jan 2026 10:50:04 +1100",
        "category": "sports",
        "authors": [],
        "text": "Burgess, NAS clash after stunning KO debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/tennis/from-boom-times-to-the-big-house-boris-becker-on-serving-aces-serving-time-and-bouncing-back-20260105-p5nrti.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From boom times to the big house: Boris Becker on serving aces, serving time and bouncing back",
        "publish_date": "Sat, 17 Jan 2026 10:29:26 +1100",
        "category": "sports",
        "authors": [
            "Scott Spits"
        ],
        "text": "Becker got his nose in front 14-12 in a final set that lasted more than two hours. Instead of packing his bags and again making an early trip to the airport, then 23-year-old Becker went on to claim the title, stopping Ivan Lendl from winning three in a row, and securing the world No.1 ranking for the first and only time in his career.\n\n“We can say tanking,” Camporese recalled when asked to explain the 7-6 (7-4), 7-6 (7-5), 0-6 mid-match scoreline. “When I made the second break [in the third set], he tanked a little bit. He takes the energy for the fourth set.”\n\nIn typical gruelling January heat on court one (which later became Margaret Court Arena), Becker won the first two sets in tie-breakers, but slumped to a 6-0 deficit in the third, setting the scene for a thrilling finale.\n\nBut what followed was far from regulation. In fact, it was brutal, as Camporese – the world No.45 – pushed Becker to the limit for five hours and 11 minutes – at that point the longest match in the event’s history .\n\nIt was 1991, Becker, 23, already had three Wimbledon titles and a US Open crown when he faced little-known Italian Omar Camporese in what, theoretically, shaped as a straightforward third-round match for the No.2 seed at the Australian Open.\n\nLong before Boris Becker’s life spiralled into scandal and a prison term, the German – arguably the biggest star of tennis in the late 1980s – dodged a bullet in Melbourne.\n\nAdd articles to your saved list and come back to them any time.\n\nIn 1996, Becker was again triumphant at the Australian Open, beating Michael Chang. “I didn’t think I had a grand slam left in me,” he said afterwards.\n\nSeven years before his ’91 breakthrough, just days after his 17th birthday, he made the quarter-finals at the Open on Kooyong’s grass, a harbinger to him becoming Wimbledon’s youngest ever male champion just months later.\n\nBecker’s dazzling career included a number of big moments in Australia; the final two of his six career slams came in Melbourne.\n\n“Winning a grand slam [event] is very difficult. Very, very few players go through the rounds, not losing a set – that’s not normal.”\n\n“Yeah, for me it was good memories, for him, not so good,” Becker told this masthead.\n\nThis year’s Australian Open marks 30 years since Boris Becker’s 1996 win over Michael Chang - the sixth and final grand slam title of his career. Credit: Getty Images\n\nDecades later, Becker fondly remembers the match and the day, confirming that he and Camporese reflected on it late last year at the ATP Finals in Turin.\n\n“It’s an open secret that Novak and me are still very close. It was a wonderful time being his coach, his mentor, and we kept a close friendship ever since,” Becker said.\n\nWhen Australia was gripped by Nick Kyrgios’ charge to the Wimbledon final and a showdown against Djokovic three-and-a-half years ago, the German was watching on too – but from a prison cell. Djokovic had invited Becker’s partner (Lilian de Carvalho Monteiro, whom the German later married) and Becker’s eldest son Noah into his players’ box for the first round.\n\nIn his own words, featured in documentaries and a book published last year that detailed his incarceration, Inside – Winning. Losing. Starting Again, Becker has been humbled by the strong arm of the law.\n\nOne of the biggest names in tennis history, a highly successful player who was by Novak Djokovic’s side as his coach for six of the Serbian’s 24 grand slam titles, Becker fell foul of authorities for serious white-collar offences (tax evasion in Germany more than 20 years ago and, more recently, breaches of the UK’s Insolvency Act). In 2022, he was jailed by British authorities for 2½ years, though Becker served far less time than that in exchange for deportation to Germany.\n\nBut for all the on-court highs, there have been many more headline-grabbing lows.\n\nBut his 2022 situation was more serious and had far greater ramifications. He faced 29 counts under the Insolvency Act, and though five were dropped before the trial and he was acquitted of 20, he was convicted on four.\n\nIt was April four years ago when he was jailed in the UK for hiding millions of pounds worth of assets after being declared bankrupt in 2017. He had been found guilty of tax evasion charges in Germany two decades earlier but escaped with a suspended prison sentence – though he was fined €500,000.\n\nBecker is also commonly remembered for a paternity suit that stemmed from a brief encounter with Russian model Angela Ermakova at London’s Nobu restaurant in 1999.\n\nBecker has been synonymous with juicy tabloid stories for decades – since he famously surged into the public’s consciousness with his first Wimbledon success as a fresh-faced teen. Only late last year the 58-year-old became a father for the fifth time when Lilian gave birth to a baby girl.\n\n“Throughout all these matches, in particular in the final, I saw my wife and my son … rooting for him. That was a very emotional time while I was inside.”\n\n“Things are looking … maybe not so good. My money is … let’s just say it could be working better,” he wrote in Inside, reliving the thoughts that dominated his prison flashbacks.\n\nBecker’s financial woes are myriad. In his book, the German gave a glimpse of how his finances were spiralling out of control in 2013.\n\n“You have lost your career, reputation and all of your property as a result of your bankruptcy.”\n\nPointedly, in sentencing, judge Deborah Taylor criticised Becker for a lack of remorse, telling the German, “[you] sought to distance yourself from the offending in your bankruptcy”.\n\nThe country that played host to three of his grand slam victories, at Wimbledon, also witnessed his downfall.\n\nHe described himself as “asset rich but cash poor”, losing deals and not earning enough to keep up with the demands of his lifestyle.\n\nHe described spending more to try to get his assets saleable, and struggling to pay the interest on loans worth millions of euros. But it was good money chasing bad.\n\nLoading\n\n“This is when the sinking feeling kicks in. At first, the interest rate from [the private bank] has been manageable – five per cent. But there’s trouble ahead. I’m losing sponsors and I’m losing endorsements. My public image is not where it was. Endless tabloid stories, one shit headline after another,” he wrote.\n\n“Things start falling apart, in Germany and then everywhere else. Broadcasting is OK. They still want me to talk about tennis. I still want to talk about tennis. The rest of it is terrible. I’m losing big contracts early. Mercedes I’ve been with for ages, but now they say they have a different marketing plan, going forward. I’m not making any new contracts to replace the ones that disappear.”\n\nOnce sentenced, Becker served time at London’s notorious HMP Wandsworth prison – coincidentally close to the famed Wimbledon precinct – before being transferred to HMP Huntercombe.\n\nAs a German national living in the UK, he was eligible for an early release scheme that expedites the deportation of foreign prisoners. After serving only eight months of his sentence, he was released in December that year and sent to his native country.\n\nIn Inside, Becker points out that in other jurisdictions, his crimes would not have been dealt with so harshly.\n\n“Let me just say that there was so much nonsense written about me leading up to my trial,” he told this masthead.\n\n“I felt the necessity and the urge just to put matter-of-factly [in the book] things that happened and didn’t happen to me – and also what I was acquitted for and, and what I was sentenced for.\n\n“Once you just read it [my case] unemotionally, you’ll be surprised that someone would be sentenced for something like that, but UK law is different to German law, [it’s also] different to Italian law, so for the same mistakes, shall I say, I wouldn’t have gotten a penalty in Germany [or] Italy.\n\n“But on the other hand, I’m the last one is pointing fingers at other people, right. I’ve done my mistakes. I’ve paid my dues.”\n\nToo successful, too young?\n\nBecker speaks frankly now about his early career experiences, and readily admits that winning Wimbledon while still green behind the ears probably did more harm than good.\n\n“I think it [my story] really starts [with] winning Wimbledon at 17, and people start calling you a wunderkind, obviously you’re bound to meet a lot of people – some are good and some are not so good for you,” said Becker, who was also a celebrity poker player in retirement.\n\nThat moment at the All-England club in 1985. Credit: Fairfax archives\n\n“But you are too young to realise who has true value, who is sincere and who’s not, and that really [has been my situation] all the way up [for me] until my 40s.”\n\nAsked about the salient lessons from his life story, one of Becker’s key messages is “not to lose faith”.\n\n“There hasn’t been many, many, examples of how to deal with [winning] Wimbledon [at] 17 because nobody [else] has done it,” he said.\n\nLoading\n\n“That set me up for a very different life than a normal teenager or a normal young, young man that starts into life. But the key is always choose your friends wisely. Also after a big high, there could be a big low, and after a big low, there could be a big high.\n\n“Life’s long, life’s a marathon, and yes, you have some good years, and you have some bad years, but important is [it] to continue and not to lose faith, and ultimately listen to your family and have a couple of good friends on the side.”\n\nThe Australian connection\n\nAustralians, and a range of experiences playing tennis in Australia, are intertwined in the storied Becker career.\n\nWhen farewelled to Wimbledon’s centre court in 1999, it was Pat Rafter who delivered the knockout blow.\n\nWhen the elusive Australian Open title first fell his way 35 years ago, it was an Australian coach, Bob Brett, smiling with satisfaction in the stands.\n\nBecker on his way to his maiden Australian Open title in 1991. Credit: Allsport UK\n\nAnd when the German was striving for a third straight Wimbledon title in 1987 as one of the hottest players in the game, duelling it out with Stefan Edberg and Lendl among others, a little-known Australian, Peter Doohan, shocked him in a famous second-round boilover. Incidentally, Doohan’s moment in the sun helped pave the way for Pat Cash to claim the title that year.\n\nDespite a chequered record in Australia, the stars aligned for Becker in 1991. Pete Sampras had won his first major only months before at the US Open but was missing due to shin splints. John McEnroe, too, was absent with a shoulder injury.\n\nIn that epic match against Camporese, there was another helpful intervention.\n\n“I lost because [at] 12-12 … I think it was 40-15 and I was serving … Steffi Graf came to see the match,” Camporese said.\n\n“I was really in love with her. I saw her … I was a little bit distracted.”\n\nA dejected Omar Camporese in 1991. Credit: Craig Golding\n\nA week or so later, his he Once Becker got past Camporese, he only had to eliminate Wayne Ferriera, Guy Forget and Patrick McEnroe – yes, John McEnroe’s little brother – in the semis to reach his first Australian men’s final. There Becker overcomeovercame a 1-6 opening set to silence ruthless Czech Lendl in four sets in the final.\n\nBecker’s pivotal career moment was his to celebrate – though for a worrying period he couldn’t be found. After the buzz of match point, the German had dashed from centre court.\n\nFormer Tennis Australia president Geoff Polland recalls the confusion.\n\n“As I remember with Becker, we were getting ready for the presentation, and he disappeared!,” Pollard said with a chuckle.\n\n“Just when I was starting to worry a bit more, he reappeared!”\n\nBecker explains the moment with a smile.\n\nLoading\n\n“I was actually on my way running back to the hotel – not to the river – because I felt like I’ve been fighting for this number one spot for so long that I just wanted to be with myself,” Becker said, recalling that a “physically strong” security guard caught up with him.\n\n“He must have been quicker than I was. He followed me, and he explained to me that the whole world is waiting, and I have to take the trophy and I have to say a couple of words.”\n\nThe 1996 win over Chang was the cherry on top of more than a decade of elite tennis.\n\n“Well it’s been five years since I spoke last time to you,” Becker said in his on-court acceptance speech.\n\n“To tell you the truth I didn’t think I had a grand slam left in me.”\n\nBecker’s relationships and the rocky road\n\nHaving reached a financial rock bottom but granted the chance to “start again” with his deportation from the UK, Becker and Lilian, who stuck with him during the tumult of his life, choose to live in Italy.\n\nAsked last year to explain how an individual who had generated the wealth he had through tennis could end up in his predicament, Becker tried to provide some context – that he played at a time when prize money hadn’t yet soared through the roof.\n\n“[But] of course I was wealthy,” Becker adds.\n\n“First of all, I didn’t earn tens of millions,” Becker said on the High Performance podcast.\n\n“Another wrong story.\n\n“If you were playing now I would earn that type of money, but in the 80s and 90s, you didn’t earn that type of money.\n\n“What was the prize money for a Wimbledon champion in 1985? £300,000 before taxes – which in 1985 was a shitload of money, right? Today the winner makes £3 million, so multiply everything that we earnt – it’s 10-fold.\n\n“The prizemoney I’ve won – it’s $US25 million – that’s before taxes and before costs. In my pocket was probably half, which is still a lot of money, but it’s not ‘tens of millions’.\n\n“[But yes] I was wealthy. Of course, I was wealthy.”\n\nBecker met Lilian in 2018, and says the fact he “found relatively late in life such a woman … I’m blessed, I’m lucky. I didn’t expect that”.\n\n“God blessed me with a very special person,” Becker said on the podcast.\n\n“[In] 2018 I was in trouble. I was insolvent. I was not in a good state at all. So I meet her and I thought she was very interesting.\n\n“I ended up going back to Frankfurt every couple of weeks to meet her. But she didn’t want to meet me alone. She said ‘I didn’t know you [at] first, but I Googled you and you sound like trouble. So I stay away from you’. I said ‘probably good advice’.\n\nLoading\n\n“I’m persistent when I want something. It took me 10 months just to get her number.\n\n“Look, clearly without her, I wouldn’t be the man I am today.”\n\nBarely two months after Lilian gave birth to their daughter, Zoë Vittoria, Becker – who will cover the Australian Open for Eurosport Germany – feels he’s again bouncing back from adversity.\n\n“Obviously, it’s a wonderful, wonderful, time in my life,” he says.\n\nBut, if given the chance, would he have done things differently?\n\n“Look I always, I always wanted to have a very intense life,” he tells this masthead.\n\n“I always wanted to be the best in tennis … as a player, as a coach, as an expert. And I was happy I could have many different roles within the tennis world, and I feel like I know what I’m talking about.\n\n“Other than that, I’m a curious customer, right. I like to explore life.\n\n“I like to understand different cultures, and I think I’m a little bit wiser for it by now.\n\n“But in order to get there I had to do, many, many, many turns – some were in the right streets and some were in the wrong streets.”\n\nFollow our live Australian Open blog each day from January 18 for results, news, analysis and interviews.\n\nNews, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/the-princess-of-wales-meets-england-womens-rugby-team-20260117-p5nuq5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Princess of Wales meets England women's rugby team",
        "publish_date": "Sat, 17 Jan 2026 09:20:34 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "The Princess of Wales meets England women's rugby team\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/six-balls-32-runs-how-steve-smith-made-history-in-one-wild-over-20260117-p5nupy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Six balls, 32 runs: How Steve Smith made history in one wild over",
        "publish_date": "Sat, 17 Jan 2026 09:10:18 +1100",
        "category": "sports",
        "authors": [],
        "text": "Steve Smith has eclipsed David Warner by scoring a 41-ball century and setting a Big Bash record as the Sydney Sixers claimed a five-wicket victory over the Sydney Thunder.\n\nAfter Warner had whacked 110 not out off 65 balls at the SCG on Friday, setting the Sixers a target of 190 to win, Smith stepped up and upstaged his long-time international teammate.\n\nThe Test batsman crunched 100 in an electric knock which included five fours and nine sixes.\n\nSmith briefly threatened to race to the fastest BBL ton (39 balls) but still left the SCG with a record to his name.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/like-a-swimmer-with-a-crocodile-in-the-pool-peel-s-push-for-olympic-gold-20251125-p5ni84.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Like a swimmer with a crocodile in the pool: Peel’s push for Olympic gold",
        "publish_date": "Sat, 17 Jan 2026 09:00:00 +1100",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size To appreciate aerial skier Laura Peel’s relationship with yoga, it pays to understand the extreme nature of her sport. Peel’s good friend and Winter Olympics gold medallist Lydia Lassila has a unique way of putting it into perspective. Imagine being an Olympic swimmer, she says, with all of its physical and mental demands, and then throwing a crocodile in the pool. Now you are getting close. Laura Peel wins a world cup event in Livigno, Italy in March this year. Credit: Getty Images “You have got that fight or flight instinct going on for a number of months,” Lassila explains of a Winter Olympics campaign. “So, your levels of cortisol [stress hormone] are high. You kind of feel, not anxious, but you have always got a certain level of nervousness.”\n\nAdvertisement\n\nAdd in the demands of a gruelling competition and the thrill of performing, and it’s a heady mix. One that the summer Olympians might never understand. “I think it’s different to the likes of a swimmer,” Lassila says. “They are not diving in and thinking, ‘Shit, I might really hurt myself’. Unless they are swimming from a crocodile, then they’ll have some sense of what it is like being an extreme athlete.” Peel has been an extreme athlete at the highest level since 2009. The former gymnast is now 36 and a veteran of the Australian team heading into the 2026 Olympics. Laura Peel has taken aerial skiing to new heights in recent years. Credit: FIS But her ability to deal consistently with the mental and physical pressures can be traced back to 2015 when she found herself in a rut, a low point that led her to yoga. She had come out of ankle surgery, wasn’t training, was living at home in Canberra and became frustrated at “getting in my own way”.\n\nAdvertisement\n\n“You know, I think I was feeling a little bit sorry for myself,” Peel explains. “I had some back-to-back injuries, we’d had a lot of... coaching instability in our program, and I didn’t feel like I was doing my best. And I didn’t feel like I was at my best. “I went to yoga for something physical, but I think there was just, like, little titbits of things that I picked up, and it really helped me to look at the positive side of things and see opportunities rather than obstacles. “And then after that year [2015], when I went back to training, I went back a lot more positive. I felt like I went back a different athlete. I was just happier and healthier. When things went wrong, it wasn’t the end of the world.” Peel is in Melbourne with the Australian team, taking part in a series of pre-Games interviews. Peel launches herself skyward in St Moritz, Switzerland. Credit: Getty Images She is wearing ankle-cut blue denim jeans, a white woollen long sleeve, half-zip jumper and a statement collar, and Doc Martens pull-on boots. Her black hair is in a half-up messy bun.\n\nAdvertisement\n\nCurrently studying a Masters of Professional Accounting, her answers are considered and assured. Loading “I feel good,” she says. “Not everybody’s body or mind allows them to keep going for as long as they would like. I feel lucky to be able to so far dictate that I’m still going.” Peel has competed at the past three Winter Olympics, including as flag bearer at Beijing in 2022 where she finished fifth. She is also a two-time World Champion. But one medal has continued to elude her grasp - Olympic gold. All that could be about to change, according to Lassila, who won gold in the event at Vancouver in 2010 following Alisa Camplin’s breakthrough victory at Salt Lake City in 2002. Gold medallist aerial freestyle skier Lydia Lassila. Credit: Getty Images\n\nAdvertisement\n\n“She’s doing everything she needs to do,” Lassila says. “She had a break the year before last – she felt she needed it – and came black refreshed, revived, and jumping better than ever. “She knows what she’s doing. She’s right in the box seat to win an Olympic gold medal. That’s the reality of it.” Lassila and Peel first when they roomed together at snow camp at the end of 2009 in Ruka, Finland. Peel was 20 at the time. “Laura was just getting going with her career. I think she was doing single flips,” Lassila recalls of her rookie teammate. “I think I was very focused on what I was doing at the time, but knowing that they were always watching and learning.” Fast forward 15 years and Peel is no longer a novice. She is the sport’s No.1 ranked athlete – the third time she has won the World Cup Crystal Globe for topping the rankings – and is regularly landing triple somersaults.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/can-you-transfer-nobel-peace-prize-trump-machado/rrrtzhji6",
        "title": "Trump has been gifted a Nobel Peace Prize. Can they actually be given away?",
        "publish_date": "Sat, 17 Jan 2026 00:57:30 +0000",
        "category": "sports",
        "authors": [],
        "text": "Donald Trump is in physical possession of a Nobel Peace Prize medal, gifted to him by last year's winner, Venezuelan opposition leader María Corina Machado.\n\n\n\n\n\nBut according to the Norwegian Nobel Committee, no matter what happens to the 18-carat gold medal, the prize itself \"remains inseparably linked to the person or organisation designated as the laureate\".\n\n\n\n\n\nThe organisation issued a statement making its position clear on Saturday, after Machado gave her award to the United States president during a meeting at the White House this week.\n\n\n\n\n\nThe committee noted that laureates receive a gold medal, a diploma and prize money.\n\n\n\n\n\n\"It is and remains the original laureate who is recorded in history as the recipient of the prize,\" the statement said.\n\n\n\n\"Even if the medal or diploma later comes into someone else’s possession, this does not alter who was awarded the Nobel Peace Prize.\"\n\n\n\n\n\nThe prize cannot be shared with others, transferred, or revoked, the committee said.\n\n\n\n\n\n\"The decision is final and applies for all time.\"\n\n\n\nHas this happened before?\n\nThere are no restrictions on what a Nobel laureate can do with the medal, diploma or prize money. They are free to keep them, give them away, sell or donate them if they wish.\n\n\n\n\n\nA number of Nobel laureates have opted to sell or give away their medals.\n\n\n\n\n\nNane Annan, widow of 2001 peace prize laureate Kofi Annan, donated the medal and diploma to the United Nations Office in Geneva, where they are permanently on display.\n\n\n\nREAD MORE Could Donald Trump win the 2025 Nobel Peace Prize?\n\nIn 2022, Russian journalist Dmitry Muratov sold his peace prize medal for US$103.5 million ($154.8 million) and donated the entire sum to a UNICEF fund for Ukrainian refugee children.\n\n\n\n\n\nNorwegian author Knut Hamsun, who won the Nobel Prize in Literature in 1920, gifted his medal to Germany's propaganda minister Joseph Goebbels, a prominent Nazi, as a gesture of thanks after they met in 1943.\n\n\n\n\n\nThat medal's current whereabouts are unknown, the Nobel Committee noted.\n\n\n\nOthers have also sold their medals, loaned or donated them to museums.\n\n\n\nWhy did Machado give her medal to Trump?\n\nTrump has made no secret of his desire to win the prize. Foreign leaders seeking to curry favour with him have previously put him up for it and hailed his peacemaking efforts.\n\n\n\n\n\nA White House spokesperson complained in October that Trump was snubbed for the 2025 award because the Nobel Committee prioritised \"politics over peace\".\n\n\n\n\n\nAt the time, the Trump administration was prominently spearheading an effort to broker peace in Gaza.\n\n\n\nMachado dedicated her award to Trump after it was announced , saying Venezuela was counting on Trump and other key allies to achieve freedom and democracy. She thanked him for his \"decisive support of our cause\".\n\n\n\n\n\nEarlier this month, the US carried out a lightning strike in Caracas , kidnapping Venezuelan president Nicolás Maduro to face drug trafficking charges in New York in a move widely seen as illegal by international law experts.\n\n\n\n\n\nMachado presented her prize to Trump at the White House during their first face-to-face meeting on Thursday.\n\n\n\n\"María presented me with her Nobel Peace Prize for the work I have done. Such a wonderful gesture of mutual respect. Thank you María!\" Trump wrote on social media after the meeting.\n\n\n\n\n\nIt was widely interpreted as an effort to gain influence as the future of Machado's country — currently led on an interim basis by Maduro's former deputy Delcy Rodriguez — hangs in the balance .\n\n\n\n\n\nTrump has previously dismissed suggestions that Machado could be installed as Venezuela's leader, saying she does not have enough support among its people.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/meet-two-australians-who-are-obsessed-with-pigeons/n772z7tkf",
        "title": "She's a 'crazy pigeon lady'. He wants to revive a dying sport. This bird is their obsession",
        "publish_date": "Fri, 16 Jan 2026 23:57:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "They might have a reputation as \"rats with wings\", but to some, the humble pigeon is an \"athlete of the sky\". That's how Stevan Gazzola sees them, at least.\n\n\n\n\n\nHe keeps around 2,000 racing pigeons in his backyard, an hour outside Melbourne, and has been racing them for more than 30 years.\n\n\n\n\n\n\"I started when I was 16 and I've been racing for 30 years now on and off. This year, we won the overall championship,\" Gazzola tells SBS News. \"It's in the blood.\"\n\n\n\n\n\nEven so, his Italian family were baffled when he first got into the sport.\n\n\n\n\n\n\"My uncle got into me that I was chasing the wrong type of birds,\" he says. \"It's just grown. I'm too far in — I even bought acreage just for pigeons.\"\n\n\n\nThe 'dying' world of pigeon racing\n\nHoping to reinvigorate a sport he says is quietly disappearing, Gazzola launched the Meadow One Loft Race four years ago.\n\n\n\n\n\nEach year, hundreds of pigeons are entered from across Australia — owners pay $350 per bird — and Gazzola takes them in, vaccinates, feeds, trains, and eventually releases them up to 400km away to race home.\n\n\n\nStevan Gazzola has been racing pigeons for most of his life. But he's worried the sport is dying. Source: SBS News \"People from all over Australia send me their baby pigeons,\" he says. \"We pick them up from the airport, then we vaccinate them, look after them, train them, let them go.\"\n\n\n\n\n\nTraining builds gradually: short flights around the block first, then 10km, then 50km, then 100 km, and so on. He's seen top birds fly 1,000km in eight hours.\n\n\n\n\n\nThe final race offers $75,000 to the winner, with around $250,000 paid out overall. But overseas, it's a different story.\n\n\n\n\n\n\"They're racing for a million dollars,\" he says. \"I can send pigeons to Thailand — it's a $1,000 per pigeon to enter — and they're racing for $2.5 million in prize money.\"\n\n\n\n\n\nStill, he says it isn't a money-making sport, with the small coin he might win at local races going straight back to the pigeons. \"You don't do this to get rich,\" he says.\n\n\n\nA sport running out of time\n\nBut Melbourne's pigeon racing scene is dying.\n\n\n\n\n\nMembership at Gazzola's local club has dropped from around 300 to about 90.\n\n\n\n\n\nRacers are ageing. Many are on pensions. Keeping birds requires space, money, time, and physical labour — all of which are increasingly scarce.\n\n\n\nStevan Gazzola says there's a science to breeding pigeons — especially if you want them to be racers. Source: SBS News \"They're just dying off. There's no young people joining,\" he says. \"You put in all the hard work and try to keep it going, but as the guys are getting older. They either die or they give up because they can't do it anymore.\"\n\n\n\n\n\nSome owners send their pigeons to Gazzola, who becomes a kind of foster carer — feeding, housing and training birds on behalf of people who can't.\n\n\n\n\n\nStill, he has noticed a small resurgence in young migrant communities. \"A lot of young Filipinos and Afghans are getting into it here,\" he says.\n\n\n\n\n\n\"Forty years ago, there was nothing to do. You either played footy or cricket — or raced pigeons.\n\n\n\n\n\n\"But it is a dying sport. Who wants to sit in their backyard and clean pigeon shit these days?\"\n\n\n\nEnter: The 'crazy pigeon lady'\n\nIn Melbourne's CBD, the scene couldn't be more different.\n\n\n\n\n\nTahlia — known as 'Frill' to her 300,000+ social media followers — can often be found outside Victoria's State Library, enveloped by a cloud of pigeons.\n\n\n\n\n\nThe 26-year-old — and her rainbow coloured hair — started posting videos of herself and pigeons in January and within months, her content went viral.\n\n\n\n26-year-old Frill finds and treats 'stringfoot' pigeons in the hope of changing people's perception of the humble bird. Source: Supplied / Instagram / Frill_underscore \"I'm the crazy pigeon lady,\" she jokes. \"It's great that everyone is tuning in for the pigeons, but if I'm honest, the hair probably had a lot to do with it.\"\n\n\n\n\n\nIn her messenger bag are the tools of the trade: bird seed, sanitiser, nail scissors, and a sock she calls \"pigeon jail\".\n\n\n\n\n\nHer mission: find and treat 'stringfoot' pigeons, whose toes have been strangled by string, thread, or human hair — leading to a painful condition that can cut off circulation and sometimes lead to the loss of toes, or even the entire foot.\n\n\n\n\n\nTo help a pigeon, she gently lures it close with seed before pouncing on it and slipping it into the sock so it can't fly away. Then, she trims the string away from its feet — a task that can take up to twenty minutes.\n\n\n\n\n\n\"This is likely a thread from a piece of clothing, that's pretty common,\" she says as she destrings one. \"A lot of the time, human hair and pet hair can get stuck around their feet, too.\"\n\n\n\nShe learnt these skills from Melbourne rescue groups filled with \"pigeon enthusiasts\". While she started with stringfoot cases, she now also takes sick or injured pigeons home to rehabilitate, carrying a small box with her whenever she heads out \"just in case\".\n\n\n\n\n\n\"Stringfoot is a small symptom of a bigger issue,\" she says. \"Humans cause man-made problems that affect all the animals around them.\n\n\n\n\n\n\"Even [a person's] hair can do this to them.\"\n\n\n\n\n\nMost days, a small crowd gathers to watch her feed the birds. Children ask to hold seeds. Teenagers hover, half-curious, half-mocking.\n\n\n\n\n\n\"You'll usually get a flock of people who want to join in,\" she says. \"Others will make fun of me … I get a lot of people who will do drive-by insults.\n\n\n\n\n\n\"But a lot of people are genuinely curious … I have had people who thought I was torturing a pigeon or kidnapping it!\"\n\n\n\n\n\nFrill's favourite bird is Dovey, a gentle white pigeon who perches on her shoulder and Chicken Boy, who somehow always attracts another bird to sit on him.\n\n\n\n\n\nShe's also outspoken about racing: \"I think pigeon racing is outdated.\"\n\n\n\n\n\n\"Most pigeon racers lose part of their loft every year. They'll die, or they get lost and join other flocks. It's very common that they collapse from exhaustion … there's no benefit for the animal.\"\n\n\n\nThe Animal Justice Party's Georgie Purcell says the humble pigeon — or 'rock dove' — is a misunderstood, intelligent animal. Source: AAP / Diego Fedele The RSPCA says pigeon racing poses \"many welfare risks\", including susceptibility to predation, high physical demands on their bodies, and some birds veering off course and not returning home.\n\n\n\n\n\nAnimal Justice Party MP Georgie Purcell also condemns pigeon racing and says our perception of the bird needs to change.\n\n\n\n\n\n\"I am vehemently against this toxic so-called sport,\" Purcell tells SBS News.\n\n\n\n\n\nBut Gazzola says while he understands views that racing can be cruel, bird welfare is foundational to his operation.\n\n\n\n\n\n\"Our pigeons are bred for endurance and are conditioned gradually with structured training, vet supervision, and careful monitoring,\" he says.\n\n\n\n\n\n\"When the sport is run responsibly with proper health checks, controlled training, safe race routes, and strong oversight, the birds compete in a way that aligns with their natural instincts to fly, navigate, and return home.\"\n\n\n\nAn underrated bird\n\nPurcell is one of many who are on Team Pigeon — including actress Sarah Paulson, who recently staunchly defended the bird and called for \"pigeon hate\" to be stopped.\n\n\n\n\n\n\"Pigeons are the best example of victims of mankind,\" Purcell says.\n\n\n\n\n\n\"They are an animal that humans used and domesticated for a purpose and then immediately discarded them when they were deemed to be no longer useful.\n\n\n\n\n\n\"Now, we treat them as if they're a nuisance or something that must be eradicated.\"\n\n\n\n\n\nShe says people often underestimate the humble pigeon.\n\n\n\n\n\n\"As highly sociable animals, pigeons mate for life, and they are a true representation of equal caring responsibilities, with both female and male pigeons working together to raise their young,\" Purcell said.\n\n\n\nGeorgie Purcell says pigeons are the \"best example of victims of mankind\", formerly domesticated, then left to their own. Source: Getty / Alwin Sun Pigeons can count as well as primates, a 2011 study suggested , with a task showing they have the capacity to count from one to nine. However, they're not quick learners. While monkeys could learn the skill in a couple of months, it took the dear pigeon a year to be trained.\n\n\n\nRats with wings?\n\nDespite their differences, both Gazzola and Frill want people to rethink the humble pigeon.\n\n\n\n\n\n\"When you mention pigeons, people say they're rats with wings,\" Gazzola says. \"They think of what we do here as the average street pigeon that's pecking at chips in the city and is a nuisance.\"\n\n\n\n\n\nBut he says his birds are \"probably kept better than how some people live\".\n\n\n\n\n\n\"They're climate-controlled, heated, the food is spotless — we source the best vitamins from all over the world — there's no stone left unturned that they don't get,\" he says.\n\n\n\n\n\n\"They're athletes of the sky.\"\n\n\n\n\n\nFrill agrees that pigeons deserve care — but wants it to extend to all of them.\n\n\n\n\n\n\"A lot of people say they're rats with wings — I also like rats, so that's not an insult to me — but it is meant in a derogatory way to say they're dirty and take up space on the street,\" she says.\n\n\n\n\n\nShe wants to break that stigma: \"They have their own life and they feel and they have very complex social lives.\"\n\n\n\n\n\nShe also hopes her content will make people think more deeply.\n\n\n\n\n\n\"I want people to appreciate every animal — even little street pigeons that people might not care about.\n\n\n\n\n\n\"I want people to think more about the world around them and other animals and how we impact them.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-loneliness-the-hidden-health-danger/ybxi8kezv",
        "title": "INTERVIEW: Loneliness - the hidden health danger",
        "publish_date": "Fri, 16 Jan 2026 20:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/asian-inspired-coffees-gain-ground-in-australia/1f9qudw0z",
        "title": "Asian-Inspired coffees gain ground in Australia",
        "publish_date": "Fri, 16 Jan 2026 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Produced in collaboration with SBS Chinese\n\n\n\n\n\nListen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nFrom crema latte to pistachio matcha and soybean powders, new coffee flavours are bubbling up. In Melbourne, often described as Australia’s coffee capital, Asian-inspired trends are catching on. Cafe manager Jay Lee explains.\n\n\n\n\n\n“Australian people like more balanced acidity and less sweetness drinks. Korean or Asian customers want something more sweeter and more creamer.”\n\n\n\n\n\nWhile sales of classic coffees like flat whites and long blacks remain strong, many customers are sampling Asian-inspired blends derived from dessert making and tea brewing.\n\n\n\n\n\n“The first thing I think of is infusion — like teas I think of the mixture of coffee and tea, and flavours I haven’t tried before.”\n\n\n\n\n\nAt Cru+ café in Melbourne’s East, Jay Lee says producing exotic creations takes time, technique and precision.\n\n\n\n\n\n“Asian-style drinks usually involve more steps: syrup, powders, creams, and clear layer. Keeping everything consistent is harder than making classic Aussie order.”\n\n\n\n\n\nOnline survey platform, Pureprofile is researching our taste for fancy drinks. Australia’s senior client development director, Kate Richards explains.\n\n\n\n\n\n“Consumers want drinks that suit their mood, their energy levels, their diet, and their personal taste. And that flexibility beautifully extends to Asian inspired fusion flavours like matcha and pistachio. It's turning into beverage theatre. More than a caffeine boost, these drinks deliver texture, taste, and shareability. Presentation has become as important as flavour with dessert style lattes doubling as visually arresting performances.”\n\n\n\n\n\nPureprofile’s Social Insights tool found that Asian-inspired food and drink now accounts for 28 per cent of online share. Ms Richards says it’s part of a broader pattern.\n\n\n\n\n\n“Trends like Instagram-worthy lattes are exploding in popularity right now. For example, TikTok views of pistachio matcha lattes more than doubled in eight months. Asian inspiration is everywhere, not only in food and beverages, but in categories like fashion, beauty, travel, and tech.”\n\n\n\n\n\nA changing demographic may be driving the trend – with more than 17 per cent of people in Australia claiming Asian heritage. Among popular choices - hojicha latte — a creamy Japanese tea drink made from roasted green tea, or Earl Grey iced latte with salted cream. In the summer heat, many customers are looking for a cooler style, like grapefruit cold brew layered over sparkling water.\n\n\n\n\n\n“I think this has a bit of grapefruit in it, from what I can see and taste. I think it might have cold brew.”\n\n\n\n\n\nO ther drinks are inspired by Korean flavours, including the Kinako latte — a caffeine-free Japanese and Korean drink made from roasted soybean powder. Cru+ manager Jay Lee says broadening the café’s range is good for business.\n\n\n\n\n\n“It’s given the customers something they can’t experience before ‘inspired by the Japan, Japanese.”\n\n\n\n\n\nOf the 400 coffees sold each day —server Phillip Sim says demand for Asian styles is rising steadily.\n\n\n\n\n\n“We try to create something special, something new. And that’s why it’s getting popular and popular.”\n\n\n\n\n\nHowever, when it comes to a daily cup, not everyone is convinced. Café owner Sam Wang.\n\n\n\n\n\n““Long black, latte, cappuccino and flat white, these four different type of coffees are still our best-sellers.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-did-australias-most-liveable-city-become-the-most-affordable-to-rent-a-house/hw9jrpncd",
        "title": "How did Australia's 'most liveable' capital city become the most affordable for renting a house?",
        "publish_date": "Fri, 16 Jan 2026 19:32:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "While housing continues to become less affordable in most Australian cities and regions, Melbourne has thrown up some data quirks that experts have linked to state government policies, with houses now cheaper to rent there than they were 12 months ago.\n\n\n\n\n\nOn average, the cost of renting a house or unit increased across Australia's combined capitals in the year leading up to December 2025, according to a new Domain report.\n\n\n\n\n\nMelbourne, consistently ranked the most liveable city in the nation , is now the cheapest capital city to rent a house in at an average of $580 per week, as asking prices hit the \"affordability ceiling\".\n\n\n\n\n\nThe cost of renting a house in Melbourne fell by 1.7 per cent over the year, the only drop of any property type in any Australian city, according to the report.\n\n\n\n\n\nThe fall in value will have mixed results for renters, landlords and investors in Victoria, while the country grapples with a national shortage of new properties and low vacancy rates.\n\n\n\nWhat's caused values to fall?\n\nThe cost of renting a house in Melbourne fell $10 per week in the 12 months to December 2025, saving tenants $520 per year.\n\n\n\n\n\nYet units became more expensive in the city, rising from an average of $550 per week in December 2024 to $580 a year later — on par with house rents.\n\n\n\n\n\nMelbourne unit prices are cheaper on average per week than Sydney ($750), Brisbane and Perth (both $650), Darwin ($598) and on par with Canberra. Only Hobart and Adelaide have cheaper unit prices at $480 and $525 a week respectively.\n\n\n\nSource: SBS News Domain's chief of research and economics, Nicola Powell, told SBS News that housing supply has been stronger in Melbourne compared to other cities.\n\n\n\n\n\n\"I think supply choice has been much better for tenants,\" she said.\n\n\n\n\n\n\"And what that means from an asking rent perspective is landlords are having to be much more realistic on the price point they place on their home.\"\n\n\n\n\n\nMelbourne had the highest vacancy rate of any capital in December at 1.6 per cent.\n\n\n\nMore first home buyers, fewer investors\n\nFederal and state government policies have also made a difference.\n\n\n\n\n\nThe new national first-home buyers scheme — which allows all first-home buyers to put down a deposit of 5 per cent — has reduced demand for rentals as tenants look to purchase their first property, Powell explained.\n\n\n\nState taxation changes affecting Victorians who own, or are looking to buy, investment properties have led to an increase in the fees investment property owners pay.\n\n\n\n\n\nPowell said these changes have led to people offloading investment properties in the last couple of years and choosing to invest in other states.\n\n\n\n\n\nThe proportion of investment in Victoria is one of the lowest in the country.\n\n\n\n\n\n\"It's sitting at just under 34 per cent of loans being financed to investors,\" Powell said.\n\n\n\n\n\n\"NSW sits at 46 per cent. So you can see there's a vast difference in participation rates from investors.\"\n\n\n\nProperty Council research shows that investors are currently looking away from Melbourne due to its \"harsh tax settings\", and instead choosing states with less punitive property charges.\n\n\n\n\n\nAndrew Lowcock, Victorian deputy executive director of the Property Council, told SBS News that Melbourne's liveability has traditionally been underpinned by strong private investment in housing, infrastructure and amenity.\n\n\n\n\n\nHe said for rents to stay low, investors need to be kept onside.\n\n\n\n\n\n\"With that pipeline of investment dropping away, it is becoming harder to deliver the homes that current and future Victorians need,\" Lowcock said.\n\n\n\n\n\n\"If Victoria wants to stay competitive, we need to do more to encourage investment and create the conditions that encourage more homes to be built.\"\n\n\n\nNational data\n\nPowell predicted that the cost of renting in Melbourne would remain stable due to the \"affordability ceiling\" — the maximum a population can pay — being reached.\n\n\n\n\n\n\"We're certainly not seeing any indication that we're going to see rent suddenly start to accelerate,\" she said.\n\n\n\n\n\nAccording to Domain's December rental report, the most expensive houses per week in Australia are found in Sydney at $800.\n\n\n\n\n\nThis was followed by Darwin, Canberra and Perth, where renting a house cost $700 per week on average.\n\n\n\nSource: SBS News The cost of renting a unit has increased across the board since December 2024.\n\n\n\n\n\nSydney has the highest average weekly unit rent at $750, followed by Brisbane and Perth at $650 respectively.\n\n\n\n\n\n\"Overall competition for rentals is still quite strong, but I think affordability is increasingly capping how far and how fast rents can rise,\" Powell said.\n\n\n\n\n\n\"We have to remember that Australia is still operating in a landlord's market, which means vacancy rates are below two per cent across every single capital city.\"\n\n\n\nHow can cities be both liveable and affordable?\n\nWhen grading Australian cities on metrics like health care, education, and infrastructure, Melbourne comes in first place, according to the Economist Intelligence Unit's 2025 Global Liveability Index.\n\n\n\n\n\nIn 2025, Melbourne was ranked the fourth most liveable city in the world, followed by Sydney in sixth place and Adelaide in ninth.\n\n\n\nREAD MORE Michaela lives eight hours from her young daughter — the rental crisis is now separating families\n\nKate Raynor, an urban planning expert with the University of Melbourne's Life Course Centre, explained why Melbourne ranks so highly.\n\n\n\n\n\n\"Melbourne does public spaces and public transport connectivity and safety in the public realm really well,\" she told SBS News.\n\n\n\n\n\n\"There is less air pollution and historically has been quite affordable.\"\n\n\n\n\n\nShe explained that Melbourne has a diversity of housing types and densities, which helps improve affordability as it's easier for people to move up and down the property ladder.\n\n\n\n\n\nOn top of its varied housing stock, Victoria approves more new homes than other Australian states, Raynor said.\n\n\n\n\n\nAccording to 2025 Australian Bureau of Statistics data, Victoria accounted for 5,215 new home approvals in November out of the 18,406 reported nationwide. NSW followed with 4,848, while Queensland approved 4,558.\n\n\n\nDoes Melbourne offer lessons for other cities?\n\nCost of living presents challenges to liveability, Raynor said, which can make balancing a desirable area and cost-effectiveness difficult for governments.\n\n\n\n\n\n\"You want to be building amenities and infrastructure, but at the same time not drive people out with escalating prices,\" she said.\n\n\n\nShe said all cities, not just Melbourne, need to invest in more social housing and medium-density housing to continue thriving and keep renting affordable.\n\n\n\n\n\n\"Invest in social housing, because that is where the need is greatest, that's where the housing stress is greatest, and that is the most obvious and direct route from someone who is at risk of homelessness or severe housing stress into housing stability,\" she said.\n\n\n\n\n\nWith any new housing also comes the need for transport infrastructure, she added, so that people aren't \"locked in\" to outer and developing suburbs.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/from-americas-cup-glory-to-foiling-futures-fremantle-opens-sailgps-high-speed-next-chapter/wru9osew7",
        "title": "From America’s Cup glory to foiling futures, Fremantle opens SailGP’s high-speed next chapter",
        "publish_date": "Fri, 16 Jan 2026 08:55:57 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/as-bushfire-affected-residents-in-victoria-begin-to-put-their-lives-back-together-multicultural-groups-lend-a-hand/bfe6plx29",
        "title": "As bushfire affected residents in Victoria begin to put their lives back together, multicultural groups lend a hand",
        "publish_date": "Fri, 16 Jan 2026 08:55:17 +0000",
        "category": "finance",
        "authors": [],
        "text": "As bushfire affected residents in Victoria begin to put their lives back together, multicultural groups lend a hand\n\nPublished 16 January 2026, 5:25 am\n\nIn tough times, community generosity goes a long way. And that's been on display in the wake of Victoria's recent bushfire devastation. Including from one group that's travelled hundreds of kilometres to show victims they aren't alone.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/asx-hits-11-week-high/kt3pecnpi",
        "title": "ASX hits 11 week high",
        "publish_date": "Fri, 16 Jan 2026 07:02:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-how-is-the-social-media-ban-working-and-is-it-an-effective-measure/3u1nj0agh",
        "title": "INTERVIEW: How is the social media ban working and is it an effective measure?",
        "publish_date": "Fri, 16 Jan 2026 04:34:13 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/one-month-on-how-is-the-teen-social-media-ban-working/qco1odjuw",
        "title": "One month on, how is the teen social media ban working?",
        "publish_date": "Fri, 16 Jan 2026 04:03:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIt was a bold move, and one that was heavily criticised by major tech companies: banning under 16s from having their own accounts.\n\n\n\n\n\nBut a month on, the risk seems to have paid off - at least, according to Communications Minister Anika Wells.\n\n\n\n\n\nShe says eliminating 4.7 million accounts online, has freed teenagers to discover who they are away from the screen.\n\n\n\n\n\n\"They can spend a summer making real world connections with each other, with their siblings, with their parents. Skateboarding, writing, reading, art, music. I don't care what it is - but it's off the screen. Discovering who they are and forging connections in the real world.\"\n\n\n\n\n\nThe ban applies to social media, video and gaming platforms including X, Tik Tok, Instagram and YouTube and has the potential to be expanded.\n\n\n\n\n\nAcross just Meta's suite of platforms; including Facebook and Instagram, 550,000 user profiles were deactivated or removed.\n\n\n\n\n\nDoctor Jessamy Perriam is a digital sociologist and Associate Director at the Australian National University School of Cybernetics.\n\n\n\n\n\nShe believes it is too soon to make a call on the under 16 ban's success.\n\n\n\n\n\n'It's impressive, but we just don't know in the longterm how it is going to pan out. And especially as we have young people returning to school at the end of this month or the beginning of next month. The truth of the success of this policy will really come out then I think.\"\n\n\n\n\n\nE-Safety Commissioner, Julie Inman Grant, says her office estimated 84 percent of 8 to 12 year olds had accounts before the ban was introduced in December.\n\n\n\n\n\nShe says the figures suggest social media companies are making meaningful efforts to comply with the law.\n\n\n\n\n\n\"We said please focus on the deactivations first, but we expect continued improvement. We expect you to prevent recidivism, so the creation of additional accounts. There are a range of signals they can take to prevent that from happening.\"\n\n\n\n\n\nAustralia has become the world leader in what could be a global movement toward social media age restrictions, as nations including Malaysia and New Zealand - consider similar moves.\n\n\n\n\n\nPrime Minister Anthony Albanese says parents have spoken to him about the positive impact on their children's lives.\n\n\n\n\n\n\"The fact that in spite of some skepticism out there, it is working and being replicated around the world is a source of Australian pride.\"\n\n\n\n\n\nOther global restrictions are in the pipeline, too.\n\n\n\n\n\nGlobally, law enforcement agencies have long sounded the alarm about the potential - and reality - of sexual exploitation of people on social media, particularly children.\n\n\n\n\n\nOvernight the Philippines became the third country to ban Grok, an artificial intelligence chat bot from Elon Musk's company, X,\n\n\n\n\n\nLast week it was revealed to have been producing a flood of explicit images of women and children.\n\n\n\n\n\nMalaysia has restricted the software, as has Indonesia.\n\n\n\n\n\nVia a statement on X, the company said it had made changes, including geoblocking certain content.\n\n\n\n\n\n\"We have implemented technological measures to prevent the Grok account from allowing the editing of images of real people in revealing clothing such as bikinis, in areas in which this is illegal. This restriction applies to all users, including paid subscribers. Image creation and the ability to edit photos via X's Grok account is now only available to paid subscribers.\"]]\n\n\n\n\n\nBritain and France are now applying pressure on the company, to make good on promised changes to stop the content.\n\n\n\n\n\nUK Prime Minister Sir Keir Starmer told the British Parliament the company which owns the software, X, is on notice.\n\n\n\n\n\n\"We have made it clear that X has to act. But if not, Ofcom has our full backing and will introduce and are introducing legislation. Mr Speaker, to update the House I have been informed this morning that X is acting to ensure full compliance with UK law. If so, that is welcome, but we are not going to back down.\"\n\n\n\n\n\nCalifornia's Attorney General is investigating the software and Prime Minister Albanese, confirmed Australia has its sights on the issue, too.\n\n\n\n\n\n\"The use of generative artificial intelligence to exploit or sexualise people without their consent is abhorrent. I know that the E-Safety Commissioner is looking at this. It is, once again, an example of social media not showing social responsibility. And Australians and indeed global citizens, deserve better.\"\n\n\n\n\n\nDoctor Perriam says this is a moment that vindicates the under 16 ban in Australia - but hopes there will be some plasticity in the policy going forward.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/why-are-women-worried-about-their-financial-future/a5rv7oylr",
        "title": "Why are women worried about their financial future?",
        "publish_date": "Fri, 16 Jan 2026 03:52:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-16-january-2026/ovqkrrd5h",
        "title": "President Trump meets with Venezuelan opposition leader | SBS News In Easy English 16 January 2026",
        "publish_date": "Fri, 16 Jan 2026 03:02:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nWelcome to SBS News In Easy English. I'm Catriona Stirrat.\n\n\n\n\n\nUnited States President Donald Trump has had a meeting with Venezuelan opposition leader Maria Corina Machado.\n\n\n\n\n\nThe encounter could affect the way the US president seeks to shape the South American country's political future.\n\n\n\n\n\nMs Machado fled Venezuela in a daring seaborne escape in December, and is competing for Mr Trump's attention with members of Venezuela's government.\n\n\n\n\n\nShe wants to have a role in governing the nation, but White House press secretary Karoline Leavitt says President Trump stands by his original belief that she does not have the support to do so.\n\n\n\n\n\n\"I think the president's assessment that you just pointed out was based on realities on the ground. It was a realistic assessment based on what the president was reading and hearing from his advisers and national security team. And at this moment in time, his opinion on that matter has not changed.”\n\n\n\n\n\n—\n\n\n\n\n\nThe government says new figures showing the number of accounts deleted to comply with their social media ban is evidence that the reforms are working as intended.\n\n\n\n\n\nCommunications Minister Anika Wells says more than 4.7 million under-16 accounts have been removed allowing young teenagers to discover who they are offline.\n\n\n\n\n\n\"They can spend a summer making real world connections with each other, with their siblings, with their parents. Skateboarding, writing, reading, art, music. I don't care what it is - but it's off the screen. Discovering who they are and forging connections in the real world.\"\n\n\n\n\n\nESafety Commissioner Julie Inman Grant says her office estimated 84 percent of 8 to 12 year olds had accounts before the ban was introduced in December.\n\n\n\n\n\nShe says the figures suggest social media companies are making meaningful efforts to follow the legislation .\n\n\n\n\n\n\"We said please focus on the deactivations first, but we expect continued improvement. We expect you to prevent recidivism, so the creation of additional accounts. There are a range of signals they can take to prevent that from happening.\"\n\n\n\n\n\n—\n\n\n\n\n\nForeign Affairs Minister Penny Wong has urged Australians to leave Iran immediately if possible.\n\n\n\n\n\nMs Wong has condemned the Iranian government's bloody crackdown on nationwide protests that activists say have killed at least 2,677 people.\n\n\n\n\n\nThe United States has also threatened military retaliation for the protesters' deaths.\n\n\n\n\n\nThe Foreign Minister advises all Australians to avoid the region for the foreseeable future.\n\n\n\n\n\n\"We have advised Australians not to travel for to Iran. The security situation remains extremely volatile. If you are Australian and you are in Iran, we urge you to leave and if it is safe to do so. We do not have a bill the ability to provide consular assistance other than in the most extremely limited of circumstances.\"\n\n\n\n\n\n—\n\n\n\n\n\nA new study suggests there are major treatment gaps for people experiencing depression.\n\n\n\n\n\nThe research, from the University of Sydney Brain and Mind Centre, has found that while anti-depressants are routinely prescribed as a first treatment, they are not always effective.\n\n\n\n\n\nThe study has found people with less common depression were less likely to respond to the medication and more likely to experience side effects such as weight gain.\n\n\n\n\n\nLead author Mirim Shin says depression is an illness experienced uniquely by everyone, and the treatment needs to be tailored to address this.\n\n\n\n\n\n—\n\n\n\n\n\nTo sport,\n\n\n\n\n\nAustralian para skier Josh Hanlon has claimed a podium finish in the sitting downhill at the Para World Cup.\n\n\n\n\n\nThe Australian para alpine skier was just 2.26 seconds off first-placed Jesper Pederson of Norway to take third place on the second day of competition at Saalbach.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/world/tim-walz-decries-ice-chaos-and-trauma-in-minneapolis-20260117-p5nur3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Tim Walz decries ICE 'chaos and trauma' in Minneapolis",
        "publish_date": "Sat, 17 Jan 2026 12:59:12 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/no-coach-no-worries-as-roar-beat-glory-in-perth-20260117-p5nuqy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "No coach, no worries as Roar beat Glory in Perth",
        "publish_date": "Sat, 17 Jan 2026 12:40:25 +1100",
        "category": "sports",
        "authors": [],
        "text": "Brisbane Roar have dedicated their 2-1 win over Perth Glory to Michael Valkanis after the veteran coach made an emergency dash to Greece due to a family medical emergency.\n\nValkanis jetted to Greece just hours before Friday night’s match in Perth, leaving assistant Borja Lema in charge.\n\nGlory skipper Adam Taggart opened the scoring in the 19th minute before Christopher Long levelled the scores via a 30th-minute penalty.\n\nChristopher Long of the Roar runs with the ball across the ground during the round 13 A-League Men match between Perth Glory and Brisbane Roar at HBF Park. Credit: Getty Images\n\nSamuel Klein scored the winner in the 50th minute, with the victory snapping a three-match losing streak and lifting Brisbane, on 21 points, into third spot.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/environment/promotional-video-for-sharksafe-barrier-20260117-p5nuqw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Promotional video for Sharksafe Barrier",
        "publish_date": "Sat, 17 Jan 2026 12:22:41 +1100",
        "category": "finance",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/queensland/pedestrian-and-e-scooter-rider-hit-by-cars-on-busy-night-for-paramedics-20260117-p5nuqu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pedestrian and e-scooter rider hit by cars on busy night for paramedics",
        "publish_date": "Sat, 17 Jan 2026 12:19:52 +1100",
        "category": "finance",
        "authors": [
            "William Davis"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nA pedestrian and e-scooter rider were hit by cars within minutes of each other in the centre of Brisbane on Friday night.\n\nJust after 11pm, a teenage girl was struck on Ann Street in the CBD. She was taken to Queensland Children’s Hospital with an arm injury.\n\nThen at 11.25pm, just over a kilometre away, paramedics were called to the intersection of Berwick and Brunswick streets in Fortitude Valley, where an e-scooter rider had suffered similar injuries to his arm and shoulder after colliding with a vehicle.\n\nA girl was struck on Ann Street in the CBD just minutes before a vehicle and e-scooter collided in Fortitude Valley. Dan Peled\n\nThe man in his 50s was taken to Royal Brisbane and Women’s Hospital in a stable condition.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/basketball/wildcats-subdue-stubborn-hawks-in-perth-hoopsfest-duel-20260117-p5nuqt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wildcats subdue stubborn Hawks in Perth HoopsFest duel",
        "publish_date": "Sat, 17 Jan 2026 11:38:43 +1100",
        "category": "sports",
        "authors": [],
        "text": "The Perth Wildcats have started a run of home NBL games with a hard-earned 92-87 win over defending champions, the Illawarra Hawks.\n\nKristian Doolittle of the Wildcats drives to the basket against Daniel Grida of the Hawks. Credit: Getty Images\n\nEven with the Wildcats appearing in control for most of Friday night’s contest at their RAC Arena home as they ended up going to the foul line 37 times to Illawarra’s 12, the Hawks kept coming.\n\nFour late triples in the final minute kept it interesting and the Hawks got within three, but Perth got the job done at the stripe to win in front of 12,507 fans as part of HoopsFest.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/the-three-moments-that-show-44-year-old-roger-federer-has-still-got-it-20260117-p5nuq8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The three moments that show 44-year-old Roger Federer has still got it",
        "publish_date": "Sat, 17 Jan 2026 11:25:51 +1100",
        "category": "sports",
        "authors": [
            "Billie Eder"
        ],
        "text": "It was only a practice session, but boy, was it good.\n\nIt was as if no time had passed, as a 44-year-old Roger Federer stepped onto Rod Laver Arena for a hit with world No. 13 Casper Ruud on Friday.\n\nRoger Federer walks onto Rod Laver Arena for a practice session with Casper Ruud. Credit: Getty Images\n\nAlmost four years after he announced his retirement from tennis, and six since he’d last appeared at the Australian Open, the 20-time grand slam singles champion was back at Melbourne Park to dazzle the crowd once more.\n\nBut this time it’s a little different, with Federer invited by Tennis Australia to play an exhibition match on Saturday night as part of the slam’s opening ceremony, which will also feature Andre Agassi, Pat Rafter and Lleyton Hewitt.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/meghan-shares-video-of-her-dancing-with-prince-harry-20260117-p5nuqn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Meghan shares video of her dancing with Prince Harry",
        "publish_date": "Sat, 17 Jan 2026 11:08:54 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/burgess-nas-clash-after-stunning-ko-debut-20260117-p5nuqj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Burgess, NAS clash after stunning KO debut",
        "publish_date": "Sat, 17 Jan 2026 10:50:04 +1100",
        "category": "sports",
        "authors": [],
        "text": "Burgess, NAS clash after stunning KO debut\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/tennis/from-boom-times-to-the-big-house-boris-becker-on-serving-aces-serving-time-and-bouncing-back-20260105-p5nrti.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From boom times to the big house: Boris Becker on serving aces, serving time and bouncing back",
        "publish_date": "Sat, 17 Jan 2026 10:29:26 +1100",
        "category": "sports",
        "authors": [
            "Scott Spits"
        ],
        "text": "Becker got his nose in front 14-12 in a final set that lasted more than two hours. Instead of packing his bags and again making an early trip to the airport, then 23-year-old Becker went on to claim the title, stopping Ivan Lendl from winning three in a row, and securing the world No.1 ranking for the first and only time in his career.\n\n“We can say tanking,” Camporese recalled when asked to explain the 7-6 (7-4), 7-6 (7-5), 0-6 mid-match scoreline. “When I made the second break [in the third set], he tanked a little bit. He takes the energy for the fourth set.”\n\nIn typical gruelling January heat on court one (which later became Margaret Court Arena), Becker won the first two sets in tie-breakers, but slumped to a 6-0 deficit in the third, setting the scene for a thrilling finale.\n\nBut what followed was far from regulation. In fact, it was brutal, as Camporese – the world No.45 – pushed Becker to the limit for five hours and 11 minutes – at that point the longest match in the event’s history .\n\nIt was 1991, Becker, 23, already had three Wimbledon titles and a US Open crown when he faced little-known Italian Omar Camporese in what, theoretically, shaped as a straightforward third-round match for the No.2 seed at the Australian Open.\n\nLong before Boris Becker’s life spiralled into scandal and a prison term, the German – arguably the biggest star of tennis in the late 1980s – dodged a bullet in Melbourne.\n\nAdd articles to your saved list and come back to them any time.\n\nIn 1996, Becker was again triumphant at the Australian Open, beating Michael Chang. “I didn’t think I had a grand slam left in me,” he said afterwards.\n\nSeven years before his ’91 breakthrough, just days after his 17th birthday, he made the quarter-finals at the Open on Kooyong’s grass, a harbinger to him becoming Wimbledon’s youngest ever male champion just months later.\n\nBecker’s dazzling career included a number of big moments in Australia; the final two of his six career slams came in Melbourne.\n\n“Winning a grand slam [event] is very difficult. Very, very few players go through the rounds, not losing a set – that’s not normal.”\n\n“Yeah, for me it was good memories, for him, not so good,” Becker told this masthead.\n\nThis year’s Australian Open marks 30 years since Boris Becker’s 1996 win over Michael Chang - the sixth and final grand slam title of his career. Credit: Getty Images\n\nDecades later, Becker fondly remembers the match and the day, confirming that he and Camporese reflected on it late last year at the ATP Finals in Turin.\n\n“It’s an open secret that Novak and me are still very close. It was a wonderful time being his coach, his mentor, and we kept a close friendship ever since,” Becker said.\n\nWhen Australia was gripped by Nick Kyrgios’ charge to the Wimbledon final and a showdown against Djokovic three-and-a-half years ago, the German was watching on too – but from a prison cell. Djokovic had invited Becker’s partner (Lilian de Carvalho Monteiro, whom the German later married) and Becker’s eldest son Noah into his players’ box for the first round.\n\nIn his own words, featured in documentaries and a book published last year that detailed his incarceration, Inside – Winning. Losing. Starting Again, Becker has been humbled by the strong arm of the law.\n\nOne of the biggest names in tennis history, a highly successful player who was by Novak Djokovic’s side as his coach for six of the Serbian’s 24 grand slam titles, Becker fell foul of authorities for serious white-collar offences (tax evasion in Germany more than 20 years ago and, more recently, breaches of the UK’s Insolvency Act). In 2022, he was jailed by British authorities for 2½ years, though Becker served far less time than that in exchange for deportation to Germany.\n\nBut for all the on-court highs, there have been many more headline-grabbing lows.\n\nBut his 2022 situation was more serious and had far greater ramifications. He faced 29 counts under the Insolvency Act, and though five were dropped before the trial and he was acquitted of 20, he was convicted on four.\n\nIt was April four years ago when he was jailed in the UK for hiding millions of pounds worth of assets after being declared bankrupt in 2017. He had been found guilty of tax evasion charges in Germany two decades earlier but escaped with a suspended prison sentence – though he was fined €500,000.\n\nBecker is also commonly remembered for a paternity suit that stemmed from a brief encounter with Russian model Angela Ermakova at London’s Nobu restaurant in 1999.\n\nBecker has been synonymous with juicy tabloid stories for decades – since he famously surged into the public’s consciousness with his first Wimbledon success as a fresh-faced teen. Only late last year the 58-year-old became a father for the fifth time when Lilian gave birth to a baby girl.\n\n“Throughout all these matches, in particular in the final, I saw my wife and my son … rooting for him. That was a very emotional time while I was inside.”\n\n“Things are looking … maybe not so good. My money is … let’s just say it could be working better,” he wrote in Inside, reliving the thoughts that dominated his prison flashbacks.\n\nBecker’s financial woes are myriad. In his book, the German gave a glimpse of how his finances were spiralling out of control in 2013.\n\n“You have lost your career, reputation and all of your property as a result of your bankruptcy.”\n\nPointedly, in sentencing, judge Deborah Taylor criticised Becker for a lack of remorse, telling the German, “[you] sought to distance yourself from the offending in your bankruptcy”.\n\nThe country that played host to three of his grand slam victories, at Wimbledon, also witnessed his downfall.\n\nHe described himself as “asset rich but cash poor”, losing deals and not earning enough to keep up with the demands of his lifestyle.\n\nHe described spending more to try to get his assets saleable, and struggling to pay the interest on loans worth millions of euros. But it was good money chasing bad.\n\nLoading\n\n“This is when the sinking feeling kicks in. At first, the interest rate from [the private bank] has been manageable – five per cent. But there’s trouble ahead. I’m losing sponsors and I’m losing endorsements. My public image is not where it was. Endless tabloid stories, one shit headline after another,” he wrote.\n\n“Things start falling apart, in Germany and then everywhere else. Broadcasting is OK. They still want me to talk about tennis. I still want to talk about tennis. The rest of it is terrible. I’m losing big contracts early. Mercedes I’ve been with for ages, but now they say they have a different marketing plan, going forward. I’m not making any new contracts to replace the ones that disappear.”\n\nOnce sentenced, Becker served time at London’s notorious HMP Wandsworth prison – coincidentally close to the famed Wimbledon precinct – before being transferred to HMP Huntercombe.\n\nAs a German national living in the UK, he was eligible for an early release scheme that expedites the deportation of foreign prisoners. After serving only eight months of his sentence, he was released in December that year and sent to his native country.\n\nIn Inside, Becker points out that in other jurisdictions, his crimes would not have been dealt with so harshly.\n\n“Let me just say that there was so much nonsense written about me leading up to my trial,” he told this masthead.\n\n“I felt the necessity and the urge just to put matter-of-factly [in the book] things that happened and didn’t happen to me – and also what I was acquitted for and, and what I was sentenced for.\n\n“Once you just read it [my case] unemotionally, you’ll be surprised that someone would be sentenced for something like that, but UK law is different to German law, [it’s also] different to Italian law, so for the same mistakes, shall I say, I wouldn’t have gotten a penalty in Germany [or] Italy.\n\n“But on the other hand, I’m the last one is pointing fingers at other people, right. I’ve done my mistakes. I’ve paid my dues.”\n\nToo successful, too young?\n\nBecker speaks frankly now about his early career experiences, and readily admits that winning Wimbledon while still green behind the ears probably did more harm than good.\n\n“I think it [my story] really starts [with] winning Wimbledon at 17, and people start calling you a wunderkind, obviously you’re bound to meet a lot of people – some are good and some are not so good for you,” said Becker, who was also a celebrity poker player in retirement.\n\nThat moment at the All-England club in 1985. Credit: Fairfax archives\n\n“But you are too young to realise who has true value, who is sincere and who’s not, and that really [has been my situation] all the way up [for me] until my 40s.”\n\nAsked about the salient lessons from his life story, one of Becker’s key messages is “not to lose faith”.\n\n“There hasn’t been many, many, examples of how to deal with [winning] Wimbledon [at] 17 because nobody [else] has done it,” he said.\n\nLoading\n\n“That set me up for a very different life than a normal teenager or a normal young, young man that starts into life. But the key is always choose your friends wisely. Also after a big high, there could be a big low, and after a big low, there could be a big high.\n\n“Life’s long, life’s a marathon, and yes, you have some good years, and you have some bad years, but important is [it] to continue and not to lose faith, and ultimately listen to your family and have a couple of good friends on the side.”\n\nThe Australian connection\n\nAustralians, and a range of experiences playing tennis in Australia, are intertwined in the storied Becker career.\n\nWhen farewelled to Wimbledon’s centre court in 1999, it was Pat Rafter who delivered the knockout blow.\n\nWhen the elusive Australian Open title first fell his way 35 years ago, it was an Australian coach, Bob Brett, smiling with satisfaction in the stands.\n\nBecker on his way to his maiden Australian Open title in 1991. Credit: Allsport UK\n\nAnd when the German was striving for a third straight Wimbledon title in 1987 as one of the hottest players in the game, duelling it out with Stefan Edberg and Lendl among others, a little-known Australian, Peter Doohan, shocked him in a famous second-round boilover. Incidentally, Doohan’s moment in the sun helped pave the way for Pat Cash to claim the title that year.\n\nDespite a chequered record in Australia, the stars aligned for Becker in 1991. Pete Sampras had won his first major only months before at the US Open but was missing due to shin splints. John McEnroe, too, was absent with a shoulder injury.\n\nIn that epic match against Camporese, there was another helpful intervention.\n\n“I lost because [at] 12-12 … I think it was 40-15 and I was serving … Steffi Graf came to see the match,” Camporese said.\n\n“I was really in love with her. I saw her … I was a little bit distracted.”\n\nA dejected Omar Camporese in 1991. Credit: Craig Golding\n\nA week or so later, his he Once Becker got past Camporese, he only had to eliminate Wayne Ferriera, Guy Forget and Patrick McEnroe – yes, John McEnroe’s little brother – in the semis to reach his first Australian men’s final. There Becker overcomeovercame a 1-6 opening set to silence ruthless Czech Lendl in four sets in the final.\n\nBecker’s pivotal career moment was his to celebrate – though for a worrying period he couldn’t be found. After the buzz of match point, the German had dashed from centre court.\n\nFormer Tennis Australia president Geoff Polland recalls the confusion.\n\n“As I remember with Becker, we were getting ready for the presentation, and he disappeared!,” Pollard said with a chuckle.\n\n“Just when I was starting to worry a bit more, he reappeared!”\n\nBecker explains the moment with a smile.\n\nLoading\n\n“I was actually on my way running back to the hotel – not to the river – because I felt like I’ve been fighting for this number one spot for so long that I just wanted to be with myself,” Becker said, recalling that a “physically strong” security guard caught up with him.\n\n“He must have been quicker than I was. He followed me, and he explained to me that the whole world is waiting, and I have to take the trophy and I have to say a couple of words.”\n\nThe 1996 win over Chang was the cherry on top of more than a decade of elite tennis.\n\n“Well it’s been five years since I spoke last time to you,” Becker said in his on-court acceptance speech.\n\n“To tell you the truth I didn’t think I had a grand slam left in me.”\n\nBecker’s relationships and the rocky road\n\nHaving reached a financial rock bottom but granted the chance to “start again” with his deportation from the UK, Becker and Lilian, who stuck with him during the tumult of his life, choose to live in Italy.\n\nAsked last year to explain how an individual who had generated the wealth he had through tennis could end up in his predicament, Becker tried to provide some context – that he played at a time when prize money hadn’t yet soared through the roof.\n\n“[But] of course I was wealthy,” Becker adds.\n\n“First of all, I didn’t earn tens of millions,” Becker said on the High Performance podcast.\n\n“Another wrong story.\n\n“If you were playing now I would earn that type of money, but in the 80s and 90s, you didn’t earn that type of money.\n\n“What was the prize money for a Wimbledon champion in 1985? £300,000 before taxes – which in 1985 was a shitload of money, right? Today the winner makes £3 million, so multiply everything that we earnt – it’s 10-fold.\n\n“The prizemoney I’ve won – it’s $US25 million – that’s before taxes and before costs. In my pocket was probably half, which is still a lot of money, but it’s not ‘tens of millions’.\n\n“[But yes] I was wealthy. Of course, I was wealthy.”\n\nBecker met Lilian in 2018, and says the fact he “found relatively late in life such a woman … I’m blessed, I’m lucky. I didn’t expect that”.\n\n“God blessed me with a very special person,” Becker said on the podcast.\n\n“[In] 2018 I was in trouble. I was insolvent. I was not in a good state at all. So I meet her and I thought she was very interesting.\n\n“I ended up going back to Frankfurt every couple of weeks to meet her. But she didn’t want to meet me alone. She said ‘I didn’t know you [at] first, but I Googled you and you sound like trouble. So I stay away from you’. I said ‘probably good advice’.\n\nLoading\n\n“I’m persistent when I want something. It took me 10 months just to get her number.\n\n“Look, clearly without her, I wouldn’t be the man I am today.”\n\nBarely two months after Lilian gave birth to their daughter, Zoë Vittoria, Becker – who will cover the Australian Open for Eurosport Germany – feels he’s again bouncing back from adversity.\n\n“Obviously, it’s a wonderful, wonderful, time in my life,” he says.\n\nBut, if given the chance, would he have done things differently?\n\n“Look I always, I always wanted to have a very intense life,” he tells this masthead.\n\n“I always wanted to be the best in tennis … as a player, as a coach, as an expert. And I was happy I could have many different roles within the tennis world, and I feel like I know what I’m talking about.\n\n“Other than that, I’m a curious customer, right. I like to explore life.\n\n“I like to understand different cultures, and I think I’m a little bit wiser for it by now.\n\n“But in order to get there I had to do, many, many, many turns – some were in the right streets and some were in the wrong streets.”\n\nFollow our live Australian Open blog each day from January 18 for results, news, analysis and interviews.\n\nNews, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/the-princess-of-wales-meets-england-womens-rugby-team-20260117-p5nuq5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Princess of Wales meets England women's rugby team",
        "publish_date": "Sat, 17 Jan 2026 09:20:34 +1100",
        "category": "lifestyle",
        "authors": [],
        "text": "Remove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nSave this video for later\n\nAdd videos to your saved list and come back to them anytime.\n\nGot it",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/six-balls-32-runs-how-steve-smith-made-history-in-one-wild-over-20260117-p5nupy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Six balls, 32 runs: How Steve Smith made history in one wild over",
        "publish_date": "Sat, 17 Jan 2026 09:10:18 +1100",
        "category": "sports",
        "authors": [],
        "text": "Steve Smith has eclipsed David Warner by scoring a 41-ball century and setting a Big Bash record as the Sydney Sixers claimed a five-wicket victory over the Sydney Thunder.\n\nAfter Warner had whacked 110 not out off 65 balls at the SCG on Friday, setting the Sixers a target of 190 to win, Smith stepped up and upstaged his long-time international teammate.\n\nThe Test batsman crunched 100 in an electric knock which included five fours and nine sixes.\n\nSmith briefly threatened to race to the fastest BBL ton (39 balls) but still left the SCG with a record to his name.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/like-a-swimmer-with-a-crocodile-in-the-pool-peel-s-push-for-olympic-gold-20251125-p5ni84.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Like a swimmer with a crocodile in the pool: Peel’s push for Olympic gold",
        "publish_date": "Sat, 17 Jan 2026 09:00:00 +1100",
        "category": "sports",
        "authors": [
            "Danny Russell"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size To appreciate aerial skier Laura Peel’s relationship with yoga, it pays to understand the extreme nature of her sport. Peel’s good friend and Winter Olympics gold medallist Lydia Lassila has a unique way of putting it into perspective. Imagine being an Olympic swimmer, she says, with all of its physical and mental demands, and then throwing a crocodile in the pool. Now you are getting close. Laura Peel wins a world cup event in Livigno, Italy in March this year. Credit: Getty Images “You have got that fight or flight instinct going on for a number of months,” Lassila explains of a Winter Olympics campaign. “So, your levels of cortisol [stress hormone] are high. You kind of feel, not anxious, but you have always got a certain level of nervousness.”\n\nAdvertisement\n\nAdd in the demands of a gruelling competition and the thrill of performing, and it’s a heady mix. One that the summer Olympians might never understand. “I think it’s different to the likes of a swimmer,” Lassila says. “They are not diving in and thinking, ‘Shit, I might really hurt myself’. Unless they are swimming from a crocodile, then they’ll have some sense of what it is like being an extreme athlete.” Peel has been an extreme athlete at the highest level since 2009. The former gymnast is now 36 and a veteran of the Australian team heading into the 2026 Olympics. Laura Peel has taken aerial skiing to new heights in recent years. Credit: FIS But her ability to deal consistently with the mental and physical pressures can be traced back to 2015 when she found herself in a rut, a low point that led her to yoga. She had come out of ankle surgery, wasn’t training, was living at home in Canberra and became frustrated at “getting in my own way”.\n\nAdvertisement\n\n“You know, I think I was feeling a little bit sorry for myself,” Peel explains. “I had some back-to-back injuries, we’d had a lot of... coaching instability in our program, and I didn’t feel like I was doing my best. And I didn’t feel like I was at my best. “I went to yoga for something physical, but I think there was just, like, little titbits of things that I picked up, and it really helped me to look at the positive side of things and see opportunities rather than obstacles. “And then after that year [2015], when I went back to training, I went back a lot more positive. I felt like I went back a different athlete. I was just happier and healthier. When things went wrong, it wasn’t the end of the world.” Peel is in Melbourne with the Australian team, taking part in a series of pre-Games interviews. Peel launches herself skyward in St Moritz, Switzerland. Credit: Getty Images She is wearing ankle-cut blue denim jeans, a white woollen long sleeve, half-zip jumper and a statement collar, and Doc Martens pull-on boots. Her black hair is in a half-up messy bun.\n\nAdvertisement\n\nCurrently studying a Masters of Professional Accounting, her answers are considered and assured. Loading “I feel good,” she says. “Not everybody’s body or mind allows them to keep going for as long as they would like. I feel lucky to be able to so far dictate that I’m still going.” Peel has competed at the past three Winter Olympics, including as flag bearer at Beijing in 2022 where she finished fifth. She is also a two-time World Champion. But one medal has continued to elude her grasp - Olympic gold. All that could be about to change, according to Lassila, who won gold in the event at Vancouver in 2010 following Alisa Camplin’s breakthrough victory at Salt Lake City in 2002. Gold medallist aerial freestyle skier Lydia Lassila. Credit: Getty Images\n\nAdvertisement\n\n“She’s doing everything she needs to do,” Lassila says. “She had a break the year before last – she felt she needed it – and came black refreshed, revived, and jumping better than ever. “She knows what she’s doing. She’s right in the box seat to win an Olympic gold medal. That’s the reality of it.” Lassila and Peel first when they roomed together at snow camp at the end of 2009 in Ruka, Finland. Peel was 20 at the time. “Laura was just getting going with her career. I think she was doing single flips,” Lassila recalls of her rookie teammate. “I think I was very focused on what I was doing at the time, but knowing that they were always watching and learning.” Fast forward 15 years and Peel is no longer a novice. She is the sport’s No.1 ranked athlete – the third time she has won the World Cup Crystal Globe for topping the rankings – and is regularly landing triple somersaults.\n\nAdvertisement",
        "source": "TheAge"
    }
]