[
    {
        "url": "https://www.9news.com.au/finance/australian-share-market-down-after-wall-street-plunge-amid-nvidia-bitcoin-stock-falls/253a958e-15b4-4022-87cc-5bacf79864d6",
        "title": "Trouble for the world's richest company sends a shiver down Aussie spines",
        "publish_date": "Tue, 18 Nov 2025 01:01:08 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "The Australian share market is down almost 1.2 per cent in early trade, dragged down by a sharp plunge on Wall Street overnight.\n\nThe ASX200 hit a four-month low for the Australian market , opening 0.8 per cent down after shaving 64.8 points to hit 8571.6.\n\n\n\nThe US stock market sank overnight as Nvidia and other \"superstar\" stocks created by the frenzy around artificial intelligence technology dimmed some more.\n\nA trader works on the floor at the New York Stock Exchange on Monday (Tuesday AEST).Photographer: Michael Nagle/Bloomberg (Bloomberg)\n\nIn the US, the S&P 500 fell 0.9 per cent and pulled further from its all-time high set late last month.\n\nThe Dow Jones Industrial Average dropped 557 points, or 1.2 per cent, and the Nasdaq composite sank 0.8 per cent.\n\nNvidia was the heaviest weight on the market, as it’s often been in its last couple of tumultuous weeks. The chip company fell 1.8 per cent, while losses for other AI winners included a 6.4 per cent slide for Super Micro Computer.\n\nOther areas of the market that had been high-momentum winners also sank. Bitcoin fell below $US92,000 ($141,000) down from nearly $US125,000 last month, for example.\n\nThat helped drag down Coinbase Global by 7.1 per cent and Robinhood Markets by 5.3 per cent.\n\nJensen Huang, chief executive officer of Nvidia Corp, during the keynote address at the Nvidia AI summit in Washington, DC, last month. (Bloomberg)\n\nCritics have warned US stock market could be primed for a drop because of how high prices have shot since April, leaving them looking too expensive. Critics point in particular to stocks swept up in the AI mania, which have been surging at spectacular speeds for years.\n\nDespite its loss overnight, Nvidia is still up 39 per cent for the year so far after it doubled in price in four of the past five years.\n\nThat has Wall Street’s spotlight on Wednesday (Thursday AEST), when Nvidia will report how much profit it made during the summer.\n\nAI stocks have surged as much as they have because of expectations that they’ll produce huge growth in profits. If they fail to top analysts’ expectations, that would undercut one of the big assumptions that’s driven the US stock market to records.\n\nSuch high expectations extend beyond tech stocks, even if they are toughest for AI darlings.\n\nREAD MORE: ﻿ Pauline Hanson plans to woo Barnaby Joyce to One Nation over a hearty dinner\n\nAramark fell 5.2 per cent after the company reported a profit for the latest quarter that fell short of analysts’ expectations.\n\nThe company, which offers food and facilities management for schools, national parks and convention centres, also said it expects an underlying measure of profit to grow between 20 per cent and 25 per cent this upcoming year.\n\nWhile relatively strong, that was less than what analysts had been forecasting.\n\nThat helped offset a rise of 3.1 per cent for Alphabet, the parent company of Google, which jumped after Berkshire Hathaway said it built a $US4.34 billion ownership stake.\n\nBerkshire Hathaway, run by famed investor Warren Buffett, is notorious for trying to buy stocks only when they look like good values while avoiding anything that looks too expensive.\n\nAnother source of potential disappointment for Wall Street is what the US Federal Reserve does with interest rates.\n\nThe expectation had been that the Fed would keep cutting interest rates in hopes of shoring up the slowing job market. Wall Street loves lower rates because they can give a boost to the economy and to prices for investments.\n\nREAD MORE: ﻿ TPG confirms Sydney death after customer was unable to contact triple zero\n\nBut questions are rising about whether a third cut for the year would come out of the Fed’s next meeting in December, something that traders had earlier seen as very likely.\n\nThe downside of lower interest rates is that they can make inflation worse, and inflation has stubbornly remained above the Fed’s 2 per cent target.\n\nFed officials have also pointed to the US government’s shutdown, which delayed the release of updates on the job market and other signals about the economy.\n\nWith less information and less certainty about how things are going, some Fed officials have suggested it may be better to wait in December to get more clarity.\n\nNow that the shutdown is over, the government is preparing to release September’s delayed jobs report on Thursday (Friday AEST). That could create further swings for the market.\n\nData that’s very strong would likely stay the Fed’s hand on rate cuts, while figures that are very weak would raise worries about the economy.\n\nIn 2026, the Fed is likely to cut interest rates only in response to a slowing economy instead of trying to cut ahead of it, according to Barry Bannister, chief equity strategist at Stifel. That’s not as good an environment for stock prices, and Bannister said the “Fed’s ‘free lunch’ is over\".\n\nIn the bond market, the yield on the 10-year Treasury edged down to 4.13 per cent from 4.14 per cent late Friday.\n\nIn stock markets abroad, indexes fell modestly across much of Europe and Asia.\n\nTokyo’s Nikkei 225 slipped 0.1 per cent after the government reported that the Japanese economy contracted at a 1.8 per cent annual pace in the July-September quarter.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/world-facing-1000-years-of-deadly-heatwaves/c1afe4fa-76ce-4775-9b4d-c0cee9384d67",
        "title": "Too late to stop 1000 years of deadly heatwaves, Aussie scientists say",
        "publish_date": "Tue, 18 Nov 2025 00:26:40 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "The world is facing a thousand years of deadly heatwaves regardless of whether humanity reaches net zero emissions - but delays in achieving that target will only make things worse.\n\nResearchers working at the ARC Centre of Excellence for 21st Century Weather, and CSIRO, ﻿modelled what the next millennia of heatwaves would look like, based on the assumption global net zero would be reached between 2030 and 2060.\n\nHeatwaves were shown to be systematically hotter, longer and more frequent the longer net zero is delayed, and they may be exacerbated by long-term warming in the Southern Ocean even after net zero is reached.\n\nREAD MORE: Australia at risk of destructive weather not seen for a decade\n\nThe world faces 1000 years of deadly heatwaves. (Getty)\n\nMost trends showed no decline over the entire 1000 years of each simulation, indicating that heatwaves do not start to revert back towards pre-industrial conditions even when net zero is reached, for at least a millennium.\n\nSome regions even displayed heatwaves of significantly increasing severity when net zero occurs by 2050 or later.\n\nProfessor Sarah Perkins-Kirkpatrick of the Australian National University, the lead author of the paper , said the research showed achieving net zero would not necessarily immediately improve conditions for future generations.\n\nResearchers say urgent work to reach net zero earlier is needed. (Getty Images/iStockphoto)\n\n\"While our results are alarming, they provide a vital glimpse of the long-term future, allowing effective and permanent adaptation measures to be planned and implemented,\" she said.\n\n\"It's also vitally important that we make rapid progress to permanent net zero.\"\n\nCo-author Dr Andrew King of the University of Melbourne said adapting to this future would be the work of \"centuries, not decades\".\n\n\"Investment in public infrastructure, housing, and health services to keep people cool and healthy during extreme heat will very likely look quite different in terms of scale, cost and the resources required under earlier versus later net zero stabilisation,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/fake-claims-about-pension-age-spread-by-google-ai-technology-news/520309f1-1316-4ec0-82e8-d1eaf34b86b2",
        "title": "Fake claims about pension age rising spread online",
        "publish_date": "Mon, 17 Nov 2025 22:23:38 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "A﻿ false claim circulating online that the pension age in Australia will rise to 68 this month has been republished by Google AI.\n\nThe false information, published by HIIT5158.com.au, claims the \"official retirement age\" in Australia will move from 67 to 68 from November 10, 2025, affecting anyone \"born on or after 10 November 1958\".\n\nThe information was then picked up by Google AI and was presented in its Overview for some searches.﻿\n\nREAD MORE: Australia at risk of destructive weather not seen for a decade\n\nA screenshot of false information circulating on Facebook last week. (Facebook)\n\nAustralia does not have an official retirement age.\n\nAustralians can retire at any age if they have the financial means to do so.\n\nSuperannuation can generally be accessed when an individual reaches \"preservation age\", which is ordinarily somewhere between 55 and 60 depending on when you were born.﻿\n\nCurrently, to be eligible for the government's Age Pension you must be 67 or older.\n\nREAD MORE: The troubling sunscreen data that will set off alarm bells ﻿\n\nThe false claim was still presenting as part of Google AI's Overview on Monday morning. (Google)\n\nA spokesperson from the Department of Social Services said \"the government has no plans to change the Age Pension age\".\n\n\"The Age Pension eligibility age is 67, however you may apply up to 13 weeks earlier,\" the spokesperson said.\n\nCurrent and correct information on the Age Pension and all social security payments is available on the Services Australia website.\n\nREAD MORE: Brad Battin ousted as Victorian opposition leader ﻿\n\n(HIIT5158)\n\nIn response to questions from 9news.com.au, Google said it had investigated the issue and the response had been fixed.\n\n\"We aim to surface relevant, high quality information in all our Search features and we continue to raise the bar for quality with ongoing updates and improvements,\" a Google spokesperson said.\n\n\"When issues arise including if our features misinterpret web content or miss some context, we use those examples to improve and take appropriate action under our policies.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/frustrating-and-ridiculous-social-media-platforms-ban-photos-of-breast-cancer-survivor-tattoos/1d9a47bc-db6c-4390-8c4a-438c155c6983",
        "title": "Rachel helps breast cancer survivors, but she's not allowed to show her work",
        "publish_date": "Sun, 16 Nov 2025 18:30:51 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "A Queensland cosmetic tattoo artist who helps breast cancer survivors says it is almost impossible to share photos and videos of her work on social media.\n\nRachel Cahn, who runs Tinted Love in Noosa, specialises in creating tattoo areolas for clients who have undergone mastectomies and no longer have nipples.\n\nBeing able to provide realistic-looking, 3D areola tattoos for cancer survivors was deeply meaningful, Cahn said.\n\nREAD MORE: ﻿ Dozens of schools to close over asbestos play sand fears\n\nCosmetic tattooist Rachel Cahn is calling for change from social media companies in dealing with images and videos of breast cancer survivors. (Tinted Love)\n\n\"This art is not just about aesthetics; it's often the final step in helping survivors to reclaim their bodies and restore their sense of hope and dignity,\" she said.\n\nAreola tattooing is a relatively new procedure available for breast cancer survivors and Cahn said she was therefore keen to let as many women as possible know about it.\n\nHowever, social media platforms such as Facebook, Instagram and TikTok were constantly banning her photos and videos due to them being flagged as showing nudity, Cahn said.\n\n\"Social media platforms can't distinguish the difference between nudity and art,\" she said.\n\n\"I can't post anything on TikTok, they don't really allow any of my work.\"\n\nLikewise, Cahn said photos she posted to Facebook showing areola tattoos were often banned, after which she needed to go through a time-consuming process to have them reinstated.\n\nRachel Cahn is seen tattooing an areola on a client. (Tinted Love)\n\nCahn said other restrictions had been placed on her accounts, such as Instagram banning her from posting live videos for 12 months and Facebook blocking her from inviting people to join her page.\n\nThe cosmetic tattooist said she also suspected her accounts had been \"shadow banned\".\n\n\"Shadow banning is where you don't come up in people's feeds,\" she explained.\n\n\"You're not on the 'explore' page. People try and type in your name, and it doesn't come up.\"\n\nThe actions of the social media giants appear to directly contradict their policies on allowing photos and videos of breast mastectomies for education and advocacy purposes.\n\n\"We agree that undergoing life-changing experience and that sharing photos can help raise awareness about breast cancer and support the men and women facing a diagnosis, undergoing treatment or living with the scars of cancer,\" Facebook says on its website.\n\n\"The vast majority of these kinds of photos are compliant with our policies.\"\n\nIt is understood that the automated processes used by social media platforms to detect nudity, including nipples, is unable to distinguish between﻿ real and tattoo areolas.\n\nNine.com.au reached out to Meta, the owner of Facebook and Instagram, for comment but did not receive a response before publication.\n\nA spokesperson for TikTok said the platform had worked with Cahl to reinstate two videos which were \"incorrectly moderated by our automated systems\".\n\n﻿\"TikTok's Community Guidelines do not allow nudity or body exposure, but we do allow some content that falls within our limited exception categories,\" the spokesperson said.\n\nCahn said she was exhausted by the process of trying to fight the social media companies simply to show her work.\n\n\"It is tiring, and I'm wanting women to know that I'm here and what I do, but it doesn't get seen by anyone, and I get all these bans and restrictions and flags,\" Cahn said.\n\n\"And it is so hypocritical because then you see all the hate speech and the violence on social media.\n\n\"Even Instagram says they don't allow photos of buttocks, and I'm just like, come on, that's an absolute joke, every second woman is in a string bikini.\"\n\nFrustrated, Cahn has started a Change.org petition calling for social media companies to reform the rules for cosmetic tattooists who work with cancer survivors.\n\n\"The guidelines need to be changed so that cosmetic tattooers can post these images, so that breast cancer survivors are aware that this service is available.\n\n\"I have a lot of women that actually come in here and they say that they didn't even know the service was available until I posted something in one of the Facebook groups.\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/afl-draft-2025-club-by-club-preview/105992174",
        "title": "AFL draft club by club: Every team's picks and potential targets",
        "publish_date": "Tue, 18 Nov 2025 02:02:44 +0000",
        "category": "sports",
        "authors": [],
        "text": "The 2025 AFL draft is nearly here, and clubs will be putting the finishing touches on their plans in hopes of uncovering their next superstar.\n\nCheck out what picks each team will be bringing to draft night and which players could be in their sights.\n\nThe AFL draft will be held over two nights on November 19 and 20 and you can follow ABC Sport's live blog on both.\n\nAdelaide\n\nPicks 16, 48, 55, 61\n\nThe Crows fought extremely hard to keep their top pick, refusing to send it to Brisbane for Callum Ah Chee.\n\nAdelaide would love to get its hands on South Australian captain Dyson Sharp, but he's likely to be well out of the Crows' draft range, as will fellow Croweater Sam Cumming.\n\nHowever, the Crows could still wind up with a South Australian in the form of Mitch Marsh, a talented forward prospect.\n\nEastern Ranges halfback Oskar Taylor has also been linked to the Crows.\n\nBrisbane\n\nPicks 17, 23, 44, 51, 57\n\nWhat a brilliant position the Lions find themselves in for the second year running.\n\nDaniel Annable is a ready-made midfielder who will make the Lions even stronger. (Getty Images: Josh Chadwick)\n\nJust a few months after winning their second straight premiership, the Lions are poised to add the player some draft experts rate as the best prospect in this year's class in Daniel Annable.\n\nAnnable is an AFL-ready midfielder who is poised enough to jump straight into most midfields in the competition. The only problem for him is that Brisbane's midfield is not any normal midfield to just slide into, as Levi Ashcroft found out.\n\nThe only question for the Lions is just how early a bid on Annable, an academy prospect of theirs, will come. The timing of the bid, which many expect to be in the top five, will likely see most of the Lions' draft picks get eaten up.\n\nCarlton\n\nPicks 9, 11, 43, 54\n\nThe Blues are preparing for the exciting acquisition of key defender Harry Dean, a father-son prospect who could easily attract a bid inside the top five overall selections.\n\nThe Blues will do whatever it takes to match a bid on Dean, but will likely also try to get creative to ensure their night doesn't end there. That may mean trading pick nine, or 11 — or possibly both — to make sure it can keep a selection in this year's first round and possibly even secure another for next year.\n\nIf they do manage to keep a first-rounder this year, the Blues might like to look at someone like key forward Aidan Schubert and hope he slides. With Charlie Curnow no longer at the club, Schubert would fill a need and represent great value outside the top 10.\n\nTom De Koning's departure may see Carlton look for a new project ruck, and Louis Emmett would fit that bill. Or they could go completely the other way and look at electric small forward Lachy Dovaston, who would be an instant fan favourite.\n\nCollingwood\n\nPicks 39, 45, 56, 58, 67\n\nCollingwood's hand is not particularly compelling, but it will come into this draft with its sights set on one specific player at least.\n\nZac McCarthy is tied to the Pies through their Next Generation Academy and is a raw but exciting tall of great potential. McCarthy could yet receive a bid inside the first round, such is his potential, but the Magpies would be expected to match it.\n\nHow early that bid comes will determine the rest of Collingwood's draft, as the Magpies may only be able to select two more players should enough of those picks be swallowed up by matching an offer for McCarthy.\n\nFather-son prospect Thomas McGuane does not look likely to be picked up by the Pies in the national draft, as they opted against nominating him ahead of the cut-off. A rookie spot is not out of the question for McGuane.\n\nEssendon\n\nPicks 5, 6, 21, 27, 30\n\nEssendon is in a position to add the best available talent that falls past West Coast and Richmond.\n\nDyson Sharp is a tough contested midfielder and a strong leader at a young age. (Getty Images: Josh Chadwick)\n\nPlayers such as Sullivan Robey, Dyson Sharp and Sam Cumming have been most strongly linked to the Bombers with their first two picks, while Xavier Taylor would also fit nicely as an attacking intercept defender.\n\nThe Dons have two academy players in the draft, Adam Sweid and Hussein El Achkar, and haven't fully committed to drafting both just yet.\n\nSweid is tipped to be picked at the back end of the first round, and could land at the Bombers with one of the picks in the 20s.\n\nFremantle\n\nPicks 20, 47, 64, 72\n\nThe pressure is on Fremantle more than ever to have some tangible finals success after a disappointing elimination final exit at the hands of Gold Coast this year.\n\nFreo possesses a strong midfield and a number of game-changers forward of the ball, but its key defensive stocks can be vulnerable at times, often seeing Josh Treacy swing back into defence in tight situations, compromising the structure up the ground.\n\nKey defender Blake Thredgold from Sturt would be a nice addition for the Dockers here. Standing at 194 centimetres, Thredgold projects as an athletic defender who can become a prolific interceptor.\n\nGeelong\n\nPicks 19, 40\n\nPredicting Geelong's movements at the draft is a tricky exercise, though it is normally its later picks that bring the big surprises.\n\nWith a first-rounder at their disposal, the Cats will take best available as their list needs are few and far between. Speedy winger Harley Barker seems an excellent fit at Kardinia Park, and he would represent good value after an ACL injury halted his rise in 2025.\n\nA young tall forward like Archie Ludowyke may also appeal, and you can generally expect the Cats to fire off some bids on NGA talent rated around that pick.\n\nHunter Holmes, brother of Max, would be a sentimentally favoured pick among Cats fans later in the draft.\n\nGold Coast\n\nPicks 15, 18, 24, 28, 29, 36, 52\n\nOnce again the Suns come into a draft with peace of mind and a guarantee of a strong haul. In fact two of the best five players in this draft are guaranteed to be Suns by next Wednesday night.\n\nDylan Patterson is an excitement machine off half-back. (Getty Images: Josh Chadwick)\n\nZeke Uwland and Dylan Patterson are products of the Gold Coast academy, and even if bids come on those two inside the three or four picks on the night — which is very possible.\n\nBeau Addinsall is another highly regarded member of the Suns' academy and will garner a bid at some point, possibly late in the first or early in the second round. Jai Murray is another that Gold Coast will not want to let slip.\n\nThe Suns will be engaged in some pick swaps early on night one to ensure they are covered points-wise for any eventuality. Theirs is a very different draft experience to most clubs.\n\nGWS Giants\n\nPicks 12, 35, 73\n\nAs a team full of big-bodied midfielders and burly key forwards, the Giants are in the market to add some speed and craftiness to their list, particularly in the forward half of the ground.\n\nLively small forward Lachy Dovaston is a player who GWS would love to get its hands on, and one that would fit well with the rest of the list.\n\nSam Grlj is a chance to be selected by Richmond with one of its two top-10 picks, but if the Tigers do not take him, then he could potentially slip all the way down to the Giants' range.\n\nKeeping with the zippy forward theme, the Giants could snap up Latrelle Pickett, the cousin of Melbourne's Kysaiah, who has proven to be one of the late draft bolters this year.\n\nHawthorn\n\nPicks 10, 22, 59, 66\n\nThe Hawks will begin draft night with a top-10 pick, and though that will slide back considerably once the bids come in, it is still a great result for a club fresh off a preliminary final.\n\nMidfield improvement has been Hawthorn's stated aim this off-season, but there is unlikely to be any stand-out candidate for that area by the time its selection comes up. Jacob Farrow, who has shown promise in the middle despite playing mostly off half-back this year, could appeal in that range.\n\nThe Hawks tried to gain access to midfielder Ollie Greeves via their NGA this year but were denied, so he may still be in contention, more likely for the Hawks's second pick than the first.\n\nAnd then there's Lachy Dovaston. A Nick Watson clone, the thought of pairing those two in a forward line is one that should be encouraged — though perhaps there is a limit how many cheeky, mulleted goalsneaks one team can contain.\n\nMelbourne\n\nPicks 7, 8, 37, 63, 65\n\nThe Demons are guaranteed to bring some quality in with their two top-10 picks, though they will slide just beyond 10 after bids come in early, but are somewhat at the behest of the clubs ahead of them.\n\nSam Cumming is a versatile midfielder who can do the tough stuff and get forward to kick goals. (Getty Images: Mark Brake)\n\nDepending on which way West Coast, Richmond and Essendon go, Melbourne could have a raft of gun mids to pick from, a selection of talls or the draft's most dynamic little blokes.\n\nSam Cumming would be a dream pick for the midfield, and Dyson Sharp would fill the Clayton Oliver hole instantly. Aidan Schubert would be a fantastic boost to a struggling forward line, while Sam Grlj, Lachy Dovaston or bolter Cameron Nairn would certainly get fans through the gates.\n\nThe Demons can hardly go wrong with their two picks. They will be content to wait and see who is still available and pick their favourites from there.\n\nNorth Melbourne\n\nPicks 25, 26, 46\n\nThe Kangaroos are also in talent-acquisition mode, and will look to draft the best available player with their first pick.\n\nIt will be interesting to see whether the Roos are able to swing a draft-night trade by packaging their first two selections together to potentially move into the teens. If they do, expect a tall to be the target with Aidan Schubert and Blake Thredgold both good options.\n\nIf the Roos stay put, South Australian midfielder Harley Barker will come into their calculations.\n\nPort Adelaide\n\nPicks 49, 69\n\nThe Power will be out of action into the latter stages of this year's draft due to previous trades.\n\nPort has a high-powered midfield and will be keen on bolstering its key position departments, particularly in defence.\n\nIf it is willing to swing some of its existing big men around the ground, a prospect such as Murray Bushrangers forward Liam Hetherton would be nice selection at 49.\n\nHetherton's teammate Riley Onley could also be of interest, given he is a 195cm midfielder, a point of difference compared to other mids in the class.\n\nRichmond\n\nPicks 3, 4, 38, 68\n\nThe Tigers are in a tantalising spot courtesy of last year's draft-night trade with North Melbourne netting them a second top-five pick.\n\nSullivan Robey is a late developer whose strength and power in the midfield and forward line have seen him rocket up boards. (Getty Images: Asanka Ratnayake)\n\nRichmond will almost certainly bid on many of the players that are tied to other clubs such as Dylan Patterson, Daniel Annable and Zeke Uwland, should they remain on the board.\n\nIf West Coast doesn't opt for big man Cooper Duff-Tytler, it would be hard to see Richmond pass on him, given his blend of size and athleticism is rare. Otherwise the likes of Sullivan Robey, Sam Cumming and Xavier Taylor will appeal.\n\nThe Tigers also face a decision on whether to use one of their high picks on speedster Sam Grlj, who played for their VFL side late in the year.\n\nSt Kilda\n\nPicks 50, 62, 70\n\nOn paper the Saints do not have much to work with this year, the price of their aggressive spending spree during the trade period.\n\nKye Fincher is a member of the Saints' NGA and will draw a bid at some stage, most likely on night two, and the Saints would be keen to match.\n\nBut there are also whispers the Saints might have something else up their sleeve. Could their 2026 first-round pick be up for grabs if it was to get them a look at a target earlier on night one? And could that player be Jevan Phillipou, brother of Mattaes?\n\nExpect the unexpected when it comes to St Kilda this off-season.\n\nSydney\n\nPicks 31, 32, 42, 60, 71\n\nThe Swans have academy prospect Max King to keep an eye on and he has been tipped to have one of the widest ranges in the draft.\n\nKing could land anywhere as high as pick 20 and as low as the mid-30s, a spot which would be ideal for Sydney.\n\nSydney could also package its first three picks to potentially move into the high teens or low 20s if a player it ranks highly internally falls on draft night.\n\nHalf-back prospect Harry Kyle is also tied to the Swans, as is Lachie Carmichael. It remains to be seen whether all three get to the club.\n\nWest Coast\n\nPicks 1, 2, 13, 34, 41\n\nClubs have shown interest in West Coast's top two selections, but it seems most likely that the Eagles keep them both for themselves on draft night.\n\nCooper Duff-Tytler is a ruck-forward with a unique athletic profile and excellent skills. (Getty Images: Asanka Ratnayake)\n\nWillem Duursma is near enough to a lock to be selected with the top pick, and is a talent worthy of the mantle. At pick two the Eagles have to balance their many list needs — do they opt for the next-best regarded talent in ruck-forward Cooper Duff-Tytler, or look to belatedly bolster the midfield with Dyson Sharp, Sam Cumming or Sullivan Robey?\n\nMost expect Duff-Tytler to be the Eagles' man with that pick, and though he may be a slower burn his ceiling is sky-high.\n\nThe third first-round pick currently sits at 13, though the Eagles are said to be keen to move that up if they can. If they can't, a punt on injured winger Harley Barker could be of interest, or a more speculative look at Josh Lindsay or Noah Hibbins-Hargreaves.\n\nNGA prospects Tylah Williams and Koby Evans and father-son Charlie Banfield could all receive bids, and ideally the Eagles would see to securing all three.\n\nWestern Bulldogs\n\nPicks 14, 33, 53\n\nThe Bulldogs find themselves in an interesting position within the first round of the draft and are well placed to scoop up a slider or take their pick from a diverse range of prospects.\n\nBig-bodied midfielder Ollie Greeves is a good chance to still be on the board at the Bulldogs' pick, they could look at zippy half-back Oskar Taylor or dynamic mid-forward Noah Hibbins-Hargreaves.\n\nBut given the Bulldogs' well-publicised need for key defensive support, Blake Thredgold should be highly considered if he is available. A tall but athletic full-back, Thredgold would need a couple of years to fill out but is already dominant in the air and combative at ground level.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/schools-still-closed-in-canberra-as-coloured-sand-clean-up/106022660",
        "title": "More schools to reopen Wednesday with updated closure list due tonight",
        "publish_date": "Tue, 18 Nov 2025 01:58:38 +0000",
        "category": "finance",
        "authors": [],
        "text": "More schools will reopen in Canberra on Wednesday with a list of current closures to be updated this evening.\n\nThe ACT government shut 70 public schools on Monday after several coloured sand products were recalled by the Australian Competition and Consumer Commission (ACCC).\n\nDozens reopened today, but 25 remained closed and 16 were partially closed.\n\nAt this stage, 19 schools will remain closed in the ACT tomorrow.\n\nFifteen schools are expected to be partially open tomorrow, but the ACT Education Directorate will also provide a further update on all school closures at 6pm.\n\nACT Yvette Berry said it would still be several days before all schools were reopened.\n\nSchools expected to be fully closed on Wednesday:\n\nCampbell Primary School\n\nEvatt Primary School\n\nFlorey Primary School\n\nForrest Primary School\n\nGowrie Primary School\n\nGordon Primary School\n\nIsabella Plains Early Childhood School\n\nLatham Primary School\n\nMacgregor Primary School\n\nMacquarie Primary School\n\nMaribyrnong Primary School\n\nMiles Franklin Primary School\n\nMount Rogers Primary School\n\nNeville Bonner Primary School\n\nNgunnawal Primary School\n\nSouthern Cross Early Childhood School\n\nWanniassa School\n\nWeetangera Primary School\n\nYarralumla Primary School\n\nSchools that will be open tomorrow:\n\nAranda Primary School\n\nBlack Mountain School\n\nChapman Primary School\n\nCranleigh School\n\nEvelyn Scott School\n\nMalkara School\n\nThe Woden School\n\nMore to come.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/townsville-council-tender-contract-audit/106010876",
        "title": "Audit finds Townsville council overrode tender process in another integrity blow",
        "publish_date": "Tue, 18 Nov 2025 01:40:53 +0000",
        "category": "finance",
        "authors": [],
        "text": "Townsville City Council (TCC) breached Queensland regulations by directly appointing a contractor without calling for tenders, an external audit has found.\n\nUnder Queensland's Local Government Regulation 2012, a local government cannot enter a contract worth $200,000 or more in a financial year or over the term of the contract, without inviting written tenders first.\n\nA Queensland Audit Office (QAO) report released on November 13 found that a council employee who recommended and approved the contract, based the recommendation on incorrect costings.\n\n\"The estimated total contract value was based on one year of expenditure only, despite the contract term being three years,\" the QAO wrote.\n\n\" The final contract amount also exceeded both the quoted amount and the approved recommendation to award. \"\n\nTownsville City Council is providing refresher training to staff after the procurement breach. (ABC North Qld: Chloe Chomicki)\n\nIt comes 12 months after the council overpaid departing executives despite citing financial challenges that led to the council hiking rates, cutting subsidies and doubling parking fees.\n\nIn September, it was revealed half of TCC's projects in the three years leading up to 2024 were, on average, 26 per cent over budget.\n\nThe audit office said the failure to comply with legislative procurement thresholds undermined transparency, value for money and the integrity of the council procurement process.\n\nThe same audit found TCC did not perform independent cross-checks on related party disclosures of interest forms completed by councillors and key management personnel.\n\n\"The process currently relies entirely on employees and elected members to self-declare related interests,\" the report read.\n\nTCC told the audit office it would implement a more robust process to review and verify related party declarations.\n\nTCC has an annual budget of more than $900 million, but it will soon become a billion-dollar budget as the largest city in northern Australia continues to grow.\n\nCouncil distrust\n\nTownsville-based James Cook University policy and politics lecturer Liam Moore said the TCC audit could further challenge the public's trust in the local government.\n\nThe electorate overwhelmingly voted for change at a mayoral by-election at the weekend, which saw former KAP state MP Nick Dametto claim victory.\n\n\"Events like this are not ideal, and they might provoke a little more distrust from the electorate in what they think of Townsville City Council,\" Dr Moore said.\n\n\"[The electorate] wants to see … these public institutions complying with the rules, spending money wisely and [with] the right processes in place.\"\n\nIn a statement, a TCC spokesperson said the contract breach was identified by the council before a further purchase order and the council notified the audit office.\n\n\"The scope of works was able to be redefined and the final contract amount was approximately $120,000,\" the spokesperson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/hundreds-of-sa-schools-detect-sand-linked-to-asbestos-scare/106021664",
        "title": "More than 350 SA schools detect sand linked to asbestos scare",
        "publish_date": "Tue, 18 Nov 2025 01:20:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "South Australia's education chief has left open the option of removing all coloured sand products from public schools regardless of their brand, as the number of sites that have reported stocking items linked to an asbestos scare climbs above 350.\n\nAt about 140 of those schools and preschools — a full list of which has been posted on the Education Department's website — the sand has been reported as \"loose\", but the department said it had already been removed from several sites.\n\nAsbestos expert says coloured sand poses 'very low risk' Dozens of schools remain closed in the ACT, Tasmania and South Australia today as the clean-up and disposal of potentially asbestos-laced coloured sand continues. What risk does it actually pose?\n\nAccording to the department, the sand has either been secured at a majority of the locations or has been confined to isolated areas.\n\n\"The sand's in a pot, in a bag, it's safe, it's away, and we'll get to those sites and collect that,\" chief executive Martin Westwell told ABC Radio Adelaide.\n\n\"The other sites are sites where perhaps the sand is out, maybe even kind of stuck up on the wall, on artwork or out on a table somewhere, and the advice from SafeWork has been to get asbestos removal contractors to get in and remove that and that's exactly what we're doing.\"\n\nOur Lady of La Vang school at Flinders Park is one of two Catholic Education sites that has temporarily closed. (ABC News: Daniel Taylor)\n\nCatholic Education yesterday said it had temporarily closed two schools in Adelaide to allow for deep cleaning, but Mr Westwell said there was currently no reason for public schools to follow suit.\n\n\"I know that some sites have got particular issues just with the clean-up and how do you get it out of the sites, perhaps if it's spread around a lot, and that might be why some of those other schools are closing, just to help with the clean-up,\" he said.\n\n\" But the risk is incredibly low, and if I thought that it wasn't — if I thought that the risk was higher and that there was a real challenge for students' health — I'd close schools, I wouldn't hesitate. \"\n\nTwo Catholic schools remain closed\n\nOn Saturday, the department revealed coloured sand products linked to the contamination scare had been identified at more than 100 sites.\n\nMr Westwell said the growing list of schools that have reported finding the impacted sand products on their premises reflected the number of products themselves, with major retailers joining the ACCC in issuing recalls.\n\nAsked whether there were grounds for \"removing all of this kind of product, no matter what the brand is, given these concerns\", Mr Westwell said that possibility would be looked at.\n\n\"With the recall that we see now I don't think there's going to be much of this … coloured sand, this play sand, left in our sites anyway,\" he said.\n\n\"We'll certainly have a look at that, but what we're doing at the moment is making sure that we're responding to the advice from the ACCC and SafeWork.\"\n\nIn a statement on Monday, Catholic Education said it had temporarily closed Our Lady of La Vang Special School at Flinders Park and St Patrick's Special School at Dulwich.\n\nSt Patrick's Special School at Dulwich has also closed. (ABC News: Daniel Taylor)\n\nA spokesperson confirmed the sites remained closed today.\n\n\"A deep clean has been arranged. Students, staff and families are unable to re-enter identified learning spaces until this has happened,\" the spokesperson said.\n\n\"In separate cases in our schools, if there is any loose sand identified, we have made appropriate arrangements to re-locate students safely to other learning spaces while cleaning is undertaken.\"\n\nEducation Minister Blair Boyer said the situation at the two Catholic schools necessitated closure.\n\n\"They've done that because they didn't have space that they could move students — and special schools can be a bit more complex,\" he said.\n\n\"They didn't have space to move students so that the areas where the sand had been loose could be deep-cleaned.\"\n\nEducation authorities say there is no reason to close public schools, but they are monitoring the situation. (ABC News: Daniel Taylor)\n\nMr Boyer told ABC News Breakfast he was not surprised by the \"high number\" of schools that had reported finding the recalled coloured sand products, given their popularity.\n\nWhile he acknowledged the ACT had implemented broader school closures, Mr Boyer said circumstances were different in South Australia.\n\n\"Although, if there are circumstances where a school needed to be shut to deep-clean to take place, then of course that is what we would do,\" he said.\n\n\"I think there's a real question to be asked here about how this stuff got in in the first place.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/jake-paul-vs-anthony-joshua-boxing-match-netflix/106021412",
        "title": "Boxing is no game, despite Jake Paul's increasingly dangerous charade",
        "publish_date": "Tue, 18 Nov 2025 01:04:18 +0000",
        "category": "sports",
        "authors": [],
        "text": "If nothing else, there is one indisputable truth about the sport of boxing — it is not a sport that you play.\n\n\"You don't play boxing,\" five-weight world champion Sugar Ray Leonard once said, a sentiment similar to those echoed by countless fighters and pundits before and since.\n\n\"You really don't. You play golf, you play tennis, but you don't play boxing.\"\n\nThe risks are enormous, and the examples of just how catastrophically things can turn inside the squared circle are countless.\n\nIt's why Jake Paul's announced fight against Anthony Joshua is so reckless that foolish doesn't cover it.\n\nEven to call it idiotic is kind.\n\nJake Paul may have bitten off more than he can chew. (Getty Images: Leonardo Fernandez)\n\nThe YouTuber-turned-upstart boxer has announced that he will step into the ring against the 2012 Olympic super heavyweight gold medallist and two-time unified heavyweight champion of the world at the Kaseya Center in Miami on December 19.\n\nBoxing's propensity to plumb the depths of moral ambiguity is not new, and its shady and objectionable quest for ever-larger purses at the expense of genuine sporting merit is a constant-yet-accepted gripe among fans.\n\nBut this has the potential to be another — largely avoidable — disaster played out in front of a gore-hungry public who care little for the outcome beyond baying for the sight of blood.\n\nBoxing is dangerous.\n\nMen and women have died in the ring.\n\nEven if dramatic, instant catastrophes are mercifully rare, the well-documented long-term effect of having one's brain pounded by another person's fists in the name of entertainment means that those catastrophic outcomes are almost inevitable one way or another.\n\nJake Paul beat up 58-year-old Mike Tyson in Netflix's first boxing show. (Getty Images: Al Bello)\n\nAs was the fear ahead of Paul's shambolic fight against Mike Tyson — a fear that was thankfully not realised — the prospect of serious damage being done is very, very real.\n\nOnly this time, it's Paul in the firing line.\n\nHe alluded to the fact that this was not a game when announcing the fight.\n\n\"This isn't an AI simulation. This is Judgement Day,\" the 28-year-old said.\n\nYet the bravado of a man not entirely sure what he is getting into immediately shone through, perhaps suggesting that he believes he is, in fact, in some kind of glorified show in which he is the undoubted star.\n\n\"When I beat Anthony Joshua, every doubt disappears, and no-one can deny me the opportunity to fight for a world title,\" he said.\n\n\"To all my haters, this is what you wanted.\"\n\nJoshua, without question, marks the toughest opponent of Paul's ring career.\n\nAnthony Joshua is a different calibre of fighter to all of Jake Paul's previous opponents. (Getty Images: Richard Pelham)\n\nA professional record of 28-4, with 25 KOs — all in the monstrous heavyweight division — is one thing. A massive, 198-centimetre, musclebound frame and a boxing pedigree built from numerous battles against the world's very best is another.\n\nThe only stipulation is that Joshua must come in at under a catchweight of 245 pounds (111.1 kilograms) — the first time he has had to fight under a limit in his career.\n\nHe most recently weighed in at 114.3kg for his fight against Daniel Dubois. Paul has never weighed in at more than 103kg for a fight and most often fights under the cruiserweight limit of 90kg.\n\nBoth fighters will wear regulation 10-ounce gloves for the eight, three-minute rounds.\n\nPaul has a pro record of 12-1 with 7 KOs. The pedigree of his opponents is not quite of the same calibre, a collection carefully curated combatants for maximum exposure and minimal risk — if there is such a thing in boxing.\n\nJake Paul has carefully selected all of his opponents thus far. (Getty Images: Michael Reaves)\n\nYes, on paper, former world champion Tyson posed a formidable opponent. But the uncomfortable sight of the then-58-year-old former baddest man on the planet seemingly struggle to muster the power to punch through a paper bag highlighted a different reality.\n\nAfter Jake Paul mocked Mike Tyson, he uttered four words that nobody wanted to hear Mike Tyson's return to the ring played out exactly as everyone expected as the once-feared baddest man in boxing was reduced to an impotent husk. It's why he cannot be allowed to enter the ring again.\n\nAside from Tyson, Paul's opposition has mostly consisted of out-of-shape MMA fighters and, earlier in his career, woefully under-prepared basketball players.\n\nHis one defeat came against an actual, active boxer-turned reality TV star, Tommy Fury.\n\nBut Joshua is a different kettle of fish.\n\nYes, the 36-year-old is on the inexorable slide towards retirement and has suffered four career-defining defeats in his last six world title bouts, including a devastating defeat against fellow Brit Daniel Dubois 14 months ago.\n\nBut fighting Paul should be beneath him. Stepping into the ring with someone so obviously out of his class will not harm Joshua's considerable ring legacy among the British sporting public — unless he loses, that is.\n\nDaniel Dubois destroyed Anthony Joshua in their IBF world title fight in September, 2024. (Getty Images: Richard Pelham)\n\nWhich is the biggest issue.\n\nJoshua can't afford to take this lightly. He has to make a statement.\n\nThe Briton's threat to \"break the internet over Jake Paul's face\" is not an idle one.\n\nRising British heavyweight Moses Itauma summed it up succinctly on BBC Sport.\n\n\"He [Paul] just needs to weigh the outcomes,\" said Itauma, who is one of Joshua's training partners.\n\n\"I dunno, 50 million [versus] my health, cars and watches [versus] can't say my name.\n\n\"Is it worth it?\"\n\nFinancially, of course, this will be worth it.\n\nBoth boxers will expect to rake in tens of millions from what will likely be one of the most-watched sporting events of the year and certainly the highest-rated boxing event.\n\nMillions of people watched Jake Paul's fight against Mike Tyson. (Getty Images: Sportsfile/Stephen McCarthy)\n\nSet to be shown on Netflix on December 19, the event will likely achieve similar numbers to the streaming network's first boxing show — Paul's unsettling bout with the shadow of a man who used to be Tyson.\n\nThat was the most-streamed sporting event in history, peaking at 65 million live concurrent streams and drawing an estimated 108 million average live viewers worldwide.\n\nAs farcical as Paul's victory over Tyson was, the interest shows there is a sizeable market in it, for a sport that sometimes struggles to get the mainstream attention it used to enjoy in its 1980s heyday.\n\nAnd, despite the clear issues with that contest and others he has arranged for himself, Paul has made his mark on the sport in more ways than just fighting.\n\nHis promotion company, Most Valuable Promotions, is the driver behind the blockbuster women's showdowns between Amanda Serrano and Katie Taylor, earning two sporting legends the sort of purse money for their two groundbreaking bouts that their male counterparts regularly command.\n\nJake Paul (centre) has helped give women's boxing a far larger platform than it has previously enjoyed. (Getty Images: Sportsfile/Stephen McCarthy)\n\nA staunch advocate for women's sport, Paul backed out of fighting former lightweight world champion Gervonta Davis — which was, in itself, a ludicrous proposition anyway based on that fact that the 165cm-tall Davis has a fighting weight of less than 60kg, while Paul would typically weigh in at 90kg — after Davis was named in a lawsuit by his former partner.\n\nPaul, who described Davis as \"an actual walking human piece of garbage\", said he \"didn't want to give this woman abuser a platform to grow his fans and to grow his bank account\".\n\n\"My company champions women, \" he said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nSo what of this fight?\n\nDangerous. Yes.\n\nFoolhardy? Of course.\n\nCompelling?\n\n\"Is it a bit of a circus? Yeah, absolutely,\" former WBA lightweight champion Anthony Crolla told BBC Sport.\n\n\"I think it's an insane situation.\n\n\"It will be a very dangerous fight.\n\n\"If there were some kind of injuries inflicted on Jake Paul, then there would be a lot of people who would have to answer big questions.\n\n\"Anybody who knows boxing can't allow this to be built up like it's a serious fight.\"\n\nAnd yet …\n\n\"I think it's crazy, but will I watch it? Probably,\" Crolla said.\n\nHe is not alone. The Netflix show will no doubt do enormous numbers and legitimise what should only ever be the wildest fever dream of a fight.\n\nBoxing is not a game.\n\nLet's hope it's not game over.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/tributes-flow-paralympic-champion-paige-greco/106021934",
        "title": "Tributes flow after death of Paralympic champion Paige Greco",
        "publish_date": "Tue, 18 Nov 2025 00:48:56 +0000",
        "category": "sports",
        "authors": [],
        "text": "Heartfelt tributes from across the Australian sporting landscape have flooded social media following the death of Paralympic and world champion para-cyclist Paige Greco.\n\nGreco, 28, died at her Adelaide home on Sunday after \"experiencing a sudden medical episode\".\n\nA statement on behalf of the Greco family, released by AusCycling on Monday, announced Paige's death.\n\nGreco won Australia's first gold medal of the 2020 Tokyo Games, triumphing in the women's C1-C3 3,000m individual pursuit, setting a new world record.\n\nParalympic gold medal winner Paige Greco dies, aged 28 Australian Paralympian Paige Greco, who won Australia's first gold medal of the 2020 Tokyo Paralympic Games, has died aged 28.\n\nMost recently, the Australian competed at October's Para-cycling Track World Championships in Brazil.\n\nPara-cyclist Tara Neyland was a teammate of Greco's in Brazil, winning three gold medals.\n\nNeyland described Greco as the \"warmest, kindest, most compassionate, selfless and brightest soul\".\n\n\"Thank you for being the best roomie and an even better friend,\" Neyland wrote.\n\n\"My heart is broken. You will be sorely missed.\"\n\nGreco achieved her dream of competing at a Paralympic Games, winning one gold and two bronze medals in Tokyo. (Reuters: Lisi Niesner)\n\nErin Rowell was another teammate of Greco's at the Para-cycling Track World Championships.\n\nIn her tribute, Rowell said it was an \"honour\" to have been a teammate with Greco.\n\n\"There's a space here that can't be filled, a quiet reminder of the kind, genuine soul you were,\" Rowell wrote.\n\n\"It was an honour to ride alongside you and to share this journey as teammates.\n\n\"You brought warmth, calm, and a goodness that lifted everyone around you.\"\n\nFellow para-cyclist Alistair Donohoe wrote on social media: \"A true blessing to have known and a joy to be around. One of the kindest souls to have ever lived and to be forever missed.\"\n\nSporting prowess\n\nGreco started her sporting career as a runner in para-athletics, attempting to make the Australian team for the 2016 Paralympic Games in Rio de Janeiro.\n\nShe switched to para-cycling and took the sport by storm, breaking three world records and winning gold in the women's C3 3,000m individual pursuit and the C3 500m time trial at the 2019 Para-cycling Track World Championships.\n\nLater that year, Greco would claim a road cycling world championship in the C3 time trial, and placed fifth in the road race.\n\nIn 2021, Greco achieved her dream of participating in a Paralympics, winning gold in the women's C1-C3 3,000m individual pursuit, setting a new world record. Greco won two more bronze medals at those Games.\n\nGreco was then awarded a Medal of the Order of Australia for services to sport in 2022.\n\nLoading...\n\nAustralia's chef de mission from those Tokyo Games, Kate McLoughlin, said Greco was one of the most beloved members of the team.\n\n\"On the track she was unbelievable, but off the track she was someone that would walk into a room and just light it up,\" McLoughlin said.\n\n\"She was just a joy to have on the team; a kind, considerate, very quiet person but turned it on when it came to that athletic performance.\n\n\"She was just incredible, so she'll be sorely missed by the entire Australian Paralympic family.\"\n\nCycling great Anna Meares, Australia's chef de mission for the Paris 2024 and Los Angeles 2028 Games, said the death of Greco would be felt widely.\n\nLoading Instagram content\n\n\"Thank you for all you stood for, achieved and how you did it while you were here,\" Meares wrote.\n\n\"Your loss is felt hard. You made your impact.\n\n\"Love to your family, friends and those in the cycling, Paracycling, Paralympic and sport communities. So sorry we've lost you.\"\n\nGreco's death was felt away from para-cycling.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nDistance runner Jaryd Clifford, a three-time Paralympic medallist, knew Greco for more than a decade.\n\nClifford paid tribute to Greco's perseverance and warm nature.\n\n\"One of the nicest people I've ever met,\" Clifford wrote.\n\n\"From our first AIS camp in 2012 to the Paralympic Games, Paige was as tough as they come with one of the best smiles in sport. Rest easy Paige.\"\n\nGreco suffered a high-speed crash during a time trial in Italy in 2023, where she suffered a severe concussion, broken nose, and also lost a tooth.\n\nHer road to recovery was done with the Queensland Academy of Sport (QAS) in Brisbane.\n\nGreco missed out on qualifying for the Paris Paralympic Games in 2024, but completed a return to international success in 2025 by winning bronze in the UCI World Cup time trial in Ostend, Belgium.\n\nAt the 2025 UCI Para-cycling Road World Championships in August, also in Belgium, Greco would add another bronze medal to her list of achievements in the road race.\n\nLast week, QAS announced Greco was moving back to Adelaide and would join the South Australia Sports Institute.\n\nIn the wake of her death, a statement from QAS described Greco as an inspiration both on the bike and away from competitive cycling.\n\n\"Paige was an exceptional athlete and an extraordinary person,\" the QAS statement read.\n\n\"Her sporting achievements on the world stage inspired so many, but it was her kindness, warmth and positivity that left the deepest impression on everyone who had the privilege of knowing her.⁣\"\n\nLoading Instagram content\n\nIn a statement released on Monday announcing her death, Greco's family said Paige had enriched the lives of those who knew and loved her.\n\n\"Paige meant everything to us. Her kindness, her determination and her warmth touched our family every single day,\" Natalie Greco, Paige's mother, wrote on behalf of their family.\n\n\"She brought so much joy and pride into our lives, and the pain of her passing is something we will carry forever.\n\n\"While we are devastated by her loss, we are incredibly proud of the person she was and the way she represented Australia.\n\n\"As a family, we are deeply grateful for the support shown by so many people connected to Paige, including her teammates and friends. Paige cherished the connections she made through her sport, and we take comfort in knowing how widely she was loved.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/rescue-tasmania-south-west-mount-anne/106021974",
        "title": "Weather hampers rescue of hikers stranded on Tasmania's Mount Anne",
        "publish_date": "Mon, 17 Nov 2025 23:49:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "In short:\n\nTwo bushwalkers aged in their 20s called Triple Zero on Monday evening after worsening weather meant they were unable to continue their journey.\n\nAttempts to reach the women were not successful because of the weather conditions, including winds exceeding 100 kilometres per hour and heavy snowfall.\n\nWhat's next?\n\nRescue efforts are continuing as weather conditions allow.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/type-asbestos-found-coloured-sand-schools-closed-act-sa-tasmania/106021238",
        "title": "'Don't panic': Asbestos expert says coloured sand poses 'very low risk'",
        "publish_date": "Mon, 17 Nov 2025 23:38:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Dozens of schools remain closed in the ACT, Tasmania and South Australia today as the clean-up and disposal of coloured sand, feared to be laced with asbestos, continues across the country.\n\nEach state and territory has taken a different approach to dealing with the recalled products, with the ACT requiring licensed asbestos removalists to be called in to schools, while some other jurisdictions are advising that the products be double-bagged and disposed of according to instructions.\n\nThe asbestos that has been found in some coloured sand products is naturally occurring, and advice from officials and experts so far has been that the risk of exposure is low.\n\nWhat kind of asbestos are we dealing with?\n\nTremolite and chrysotile asbestos have been found in testing of different coloured sand products by the Australian Competition and Consumer Commission (ACCC) and WorksafeACT.\n\nThe testing prompted the ACCC to last week recall the products, and, since then, four more products sold by Kmart and Target have been pulled from the shelves.\n\nMolecular pharmacologist Ian Musgrave from the University of Adelaide said the forms of asbestos found in the sand were less likely to create fibres than other more hazardous types like blue asbestos.\n\nAsbestos fibres seen under an electron microscope. (Getty Images: Callista Images)\n\nChrysotile, also known as white asbestos, is the most common type of asbestos and is the main form used commercially.\n\nTremolite is relatively rare, and can be found in mineral talc and vermiculite deposits.\n\n\"It still can form fibres, but typically it's found in non-fibrous forms and it's less likely to form fibres that can be breathed in,\" Dr Musgrave said.\n\n\"The ACCC investigation found that the material that was found in these sands weren't the ones that can be easily lofted into the air and breathed in.\"\n\nWhat is the concern then?\n\nAll types of asbestos can cause mesothelioma and asbestosis.\n\nKadink decorative sand was among the first brands of coloured sand to be recalled. (Supplied: ACCC)\n\n“All asbestos is hazardous but the amount of hazard is different,” Dr Musgrave said.\n\nAlthough the material detected in the sand is less likely than other forms of asbestos to form fibres, authorities are not taking any chances.\n\n\"The damage caused by asbestos is due to these fibres getting breathed in [and] getting into the cells,\" Dr Musgrave said.\n\n\"Because the cells can't break them down, they generate oxidative stress which can cause damage to the lung and can also result in lung cancer.\"\n\nWhat risk does the coloured sand pose?\n\nAsbestos has not been found in all of the sand that has been analysed, and where it has been found, it has been at trace levels.\n\n\"It's fairly low level and also the material is in a form that it's not easily breathed in,\" Dr Musgrave said.\n\n\"This is a form which doesn't easily form fibres and it's not forming fibres which can be lofted into the air and breathed in by kids.\n\n\" So unless you've got an industrial sand milling machine in your school it's very unlikely that your children will be exposed to fibres that can be breathed in and cause disease. \"\n\nKmart and Target have recalled four coloured sand products over potential asbestos contamination. (Supplied: MBIE)\n\nDr Musgrave said the risk for asbestos-induced disease was related to both how much and how long a person was exposed.\n\n“Given that this has been discovered recently, it's likely that exposure to this material hasn't been long and because it's the form it doesn't easily form particles you can breathe in, and it's also in trace levels, the exposure levels are quite low,\" he said.\n\n\"So the risk of of any disease from this exposure is also low.\n\n\" It's not zero. There will never be a zero risk. But the risk is very low. \"\n\nDr Musgrave said his advice to parents whose children attend affected schools was \"don't panic\".\n\nWhat's happening in each jurisdiction today?\n\nTwenty-five public schools will remain closed across Canberra today, with another 16 partially closed.\n\nFifty-one ACT schools, which were previously closed, have fully reopened today.\n\nAsbestos removal teams are working to clean up and dispose of coloured sand products in Canberra schools. (ABC News: Matt Roberts)\n\nMore than 300 education sites in South Australia have now reported the use of coloured sand that may contain asbestos.\n\nThe Department of Education said licensed asbestos contractors began removing the recalled product from its sites yesterday.\n\nIt said the risk was low and was being managed in line with national standards and advice from SafeWork SA.\n\nMeanwhile, Catholic schools Our Lady of La Vang Special School in Flinders Park and St Patrick's Special School in Dulwich have temporarily closed due to the identification of sand products.\n\nCatholic Education South Australia said a deep clean had been arranged and students, staff and families were unable to re-enter some learning spaces until this had happened.\n\nSix Tasmanian non-government schools are closed today, while another six are partially closed. No public schools are closed.\n\nBut Tasmania's Education Union is calling on the Education Department to consider closing schools.\n\nTwenty-five schools across Canberra are closed today. (ABC News: Mark Moore)\n\nNo schools have been closed in Victoria, although 300 schools and more than 600 early childhood services have been identified as using the recalled products.\n\n\"Schools and early childhood services have been provided with updated guidance, including safe-handling instructions for the craft sand. Government schools have also been provided with advice on how to report products to be collected for disposal.\"\n\nOn Monday, WA Premier Roger Cook confirmed 76 schools in WA had been found with coloured sand products that were recalled.\n\nIn a statement, the Queensland Department of Education said it was working closely with all state schools \"that may be impacted by the coloured sand recall\".\n\n\"We do not anticipate there will be any state school closures this week and all schools are open as normal today. We are working to ensure continuity of education for all students,\" it said.\n\nConcern over lack of uniformity between jurisdictions\n\nThe Asbestos Disease Society of Australia is concerned about the different state and territory responses to potential asbestos exposure.\n\nQueensland parents question asbestos sand dilemma Queensland parents are divided over the nationwide recall of coloured sand that may have traced of asbestos.\n\nSociety head Melita Markey said varied state regulations could create a patchy national response.\n\n\"Different agencies get together and meet and they come up with what they consider to be a good national approach, but then it's all up to the individual states whether they adopt it,\" she said.\n\n\"The federal asbestos eradication agency came out with a strategic plan. Not every state signed on to that immediately and then they could pick or choose what parts they adopted.\"\n\nMs Markey also urged Australia's education sector to be more proactive in identifying and removing other forms of asbestos from schools.\n\n\"We're focusing on something that's very immediate, but what about the long-term effects of children in these ageing, deteriorating schools around Australia — ageing and deteriorating roofs, putting asbestos fibres through the gutters, washing it down around the grounds,\" she said.\n\n\"Let's start looking at the bigger picture of removing that.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/rio-tinto-cuts-production-at-gladstone-yarwun-alumina-refinery/106021782",
        "title": "Rio Tinto to slash alumina production in Queensland, impacting 180 jobs",
        "publish_date": "Mon, 17 Nov 2025 23:28:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Rio Tinto has revealed it will slash alumina production at its Queensland refinery by 40 per cent, following concerns about the future viability of the facility.\n\nThe company said it would reduce production at Gladstone's Yarwun Alumina Refinery from October next year, which would allow it to extend the site's operations until 2035.\n\nAt current production rates, the Yarwun tailings facility was predicted to reach capacity in 2031.\n\n\"This curtailment will allow another four years to explore and develop technical solutions that could further extend the refinery's life,\" it said.\n\nRio Tinto's alumina refinery near Gladstone is exploring hydrogen power. (ABC News: Kylie Gillespie)\n\nThe cut will reduce annual alumina production by about 1.2 million tonnes and impact about 180 jobs at the refinery.\n\nRio Tinto general manager for bauxite and alumina Tim McDougall said the company was not seeking government support for a new tailings development.\n\n\"This decision is about the economic viability of the tailings facility, it is not about government policy and we're very focused on solving that ourselves,\" he said.\n\nRedeployment planning underway\n\nMr McDougall said every effort would be made to find opportunities for people who want to stay in Gladstone, through Queensland Alumina Limited (QAL) and Boyne Smelters.\n\n\"We have a long lead time which allows us to work through the changes … this will give us time to talk with our people, to understand their preferences and manage this change,\" he said.\n\n\"As required, we're also very open to looking at opportunities more broadly in Queensland and also in Australia.\"\n\nRio Tinto's aluminium Pacific operations managing director Armando Torres said the company had investigated whether it could develop a second tailings facility at Yarwun, but it was not economically viable.\n\n\"Reducing production from October 2026 enables us to continue alumina production until 2035 and trial pathways to secure the longer-term future of Yarwun,\" Mr Torres said.\n\n\"It is a difficult but necessary decision that preserves future options for the site and supports continued economic contribution.\"\n\nRio Tinto says it is exploring options to further extend the refinery's life. (Reuters: David Gray)\n\nMr Torres said Rio Tinto remained committed to its alumina and aluminium operations in Gladstone.\n\nThe company said there would be no impact to its customers or other operations, with bauxite mines and aluminium smelters to continue to operate at full capacity.\n\n'I trust they will do the right thing'\n\nGladstone Regional Council Mayor Matt Burnett said the announcement was concerning, but he was hopeful there was a future for the site.\n\n\"If Rio Tinto wanted to close Yarwun early, they would go full steam ahead towards 2031,\" Cr Burnett said.\n\n\" That isn't the case, and they are actively exploring new technologies to keep the facility open and viable. \"\n\nCr Burnett said the company had been a long-term employer in Gladstone.\n\n\"I trust they will do the right thing by the people and workers of Gladstone, who have supported their operations since 1967,\" he said.\n\nAlumina is used as a feedstock in smelters to create aluminium and has a wide range of other industrial uses.\n\nThe Yarwun site currently employs about 725 people and produces about 3 million tonnes of alumina per year.\n\nIt comes less than two months after Rio Tinto announced it would potentially close the Gladstone Power Station six years earlier than expected.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/arias-australian-music-awards-where-to-watch/105995312",
        "title": "How to watch the ARIA awards ceremony",
        "publish_date": "Mon, 17 Nov 2025 23:09:46 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "The best and the brightest Australian music stars will be coming together for the ARIA awards this week.\n\nHere's what you need to know about the ceremony.\n\nWhat are the ARIAs?\n\nIt's an Australian music awards ceremony — the one with the really pointy silver trophies.\n\nARIA stands for the Australian Recording Industry Association.\n\nBut an aria is also a musical term, with the Macquaire Dictionary defining it as \"an elaborate melody for a single voice, with accompaniment, in an opera, oratorio, etc …\"\n\nThis year, the ceremony is being held at Sydney's Hordern Pavilion.\n\nTriple j Breakfast presenter Concetta Caristo and Nova's Tim Blackwell will be hosting the awards.\n\nConcetta Caristo will host the ceremony along with Tim Blackwell. (Supplied: Monica Pronk)\n\nWhen are the ARIA awards?\n\nTomorrow afternoon.\n\nWhere can I watch the ARIA awards?\n\nThe ceremony is being streamed live on Paramount+ from 5pm AEDT.\n\nYou'll be able to watch the ceremony on free-to-air television on Channel 10 later that night, with the red-carpet show starting at 7pm AEDT.\n\nAs for the actual ceremony itself, the ARIA website just says it'll come on \"following Big Brother\" instead of giving a specific time.\n\nWho is nominated?\n\nThe artist with the most nominations is Ninajirachi, who is up for eight awards.\n\nThe full list of the ARIA award nominees All the contenders are hopefuls vying for ARIA Awards glory at the music industry's glitzy ceremony, taking place next month.\n\nHer debut album I Love My Computer has earned her nominations in major categories like Album of the Year, Best Solo Artist, Best Independent and Electronic Release.\n\nAll up, there are 29 categories, but here are the nominees for the top three most talked about awards:\n\nAlbum of the Year\n\nAmyl and The Sniffers – Cartoon Darkness\n\nMissy Higgins – The Second Act\n\nNinajirachi – I Love My Computer\n\nRÜFÜS DU SOL – Inhale / Exhale\n\nThelma Plum – I'm Sorry, Now Say It Back\n\nBest Solo Artist\n\nBARKAA – Big Tidda\n\nDom Dolla – DREAMIN’\n\nKylie Minogue – Tension II\n\nMallrat – Light hit my face like a straight right\n\nMissy Higgins – The Second Act\n\nNinajirachi – I Love My Computer\n\nPaul Kelly – Fever Longing Still\n\nThe Kid LAROI – How Does It Feel?\n\nThelma Plum – I'm Sorry, Now Say It Back\n\nYoung Franco – it's Franky baby!\n\nBest Group\n\nAmyl and The Sniffers – Cartoon Darkness\n\nFolk Bitch Trio – Now Would Be A Good Time\n\nHilltop Hoods – Fall From The Light\n\nRoyel Otis – hickey\n\nRÜFÜS DU SOL – Inhale / Exhale\n\nWho is performing?\n\nBritish singer Oliva Dean is this year's major international act.\n\nOlivia Dean will perform at the ARIA awards. (Supplied: Laneway Presents)\n\nBut there will also be performances from local artists including:\n\nAlex Lahey\n\nAnna Ryan\n\nBaker Boy\n\nG Flip\n\nJanet English\n\nKeli Holiday\n\nKita Alexander\n\nMissy Higgins\n\nNeve Van Boxsel\n\nThelma Plum\n\nTouch Sensitive\n\nYou Am I\n\nYoung Franco\n\nOn top of this, all five nominees for Best Soul/R&B Release will perform with a 15-piece band, so expect a super set from:",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/nsw-tpg-telecom-sydney-person-samsumg-triple-0-death/106021692",
        "title": "Outdated Samsung software behind failed Triple Zero call death, telco says",
        "publish_date": "Mon, 17 Nov 2025 22:49:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "TPG Telecom says a Sydney customer died after outdated software blocked a Samsung phone from making Triple Zero (000) calls.\n\nThe telco said in a statement it was informed of the incident involving a person using a Lebara service on a Samsung device on November 13 by NSW Ambulance yesterday.\n\nTPG Telecom said its mobile network was operational and no outages had occurred.\n\n\"Early investigations indicate that the failed calls were due to the customer's Samsung device operating on software that was not compatible with making Triple Zero calls on the network,\" the company said in a statement.\n\n\" Samsung recently identified that certain, older devices required a software update to enable Triple Zero functionality on TPG Telecom's mobile network. \"\n\nThe telco said when it became aware of issues with these handsets on its network, it told customers \"to urgently update affected devices\".\n\nA number of older Samsung devices are listed on the company's website as needing to be replaced or updated. (ABC News: Jack Ailwood)\n\n\"Handsets not updated are blocked after a period of 28-35 days from the first contact to the customer, as required under new regulations,\" the company said.\n\n\"The most recent communications to customers with impacted devices was sent on 7 November.\"\n\nSamsung said on its website it had identified older mobile devices that do not \"correctly connect to an alternative mobile network to make Triple Zero calls when the user's primary network is not available\".\n\nIt lists dozens of devices that need to be updated or replaced to make sure they work reliably during an emergency.\n\nIt said newer model phones were not affected.\n\nTPG boss offers condolences, urges action\n\nTPG Telecom said its mobile network was operational and no outages had occurred. (ABC News: Jack Ailwood)\n\nTPG Telecom managing director and CEO Inaki Berroeta said customer safety was the company's \"highest priority\" and urged users of affected devices to update their software or replace them.\n\n\"This is a tragic incident, and our condolences and thoughts are with the individual's family and loved ones,\" he said.\n\n\"Access to emergency services is critical.\n\n\"We urge all customers with outdated software to replace or update their devices without delay to ensure they can reach Triple Zero in an emergency.\"\n\nTPG Telecom said the communications minister, NSW Government, Australian Communications and Media Authority (ACMA), Triple Zero Custodian and other relevant government and regulatory bodies had been notified of the incident.\n\nCommunications Minister Anika Wells said the \"tragic situation\" would be investigated.\n\n\"TPG's compliance with the Emergency Call Service Determination will be rigorously assessed by ACMA,\" she said in a statement.\n\nACMA said in a statement it would investigate whether there had been any non-compliance with the Triple Zero rules and enforcement action taken if any was found.\n\n\"Under rules introduced in 2024, telecommunications providers must notify their customers where the provider identifies that the customer's device may not be able to connect to triple zero and then take action to block those devices from their networks,\" it said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/westpac-pauses-closure-of-further-regional-branches/106019660",
        "title": "Westpac keeps regional branches for another three years",
        "publish_date": "Mon, 17 Nov 2025 21:29:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "One of Australia's largest banks has committed to retaining regional branches for another three years, following a federal inquiry into the impact of branch closures on country towns.\n\nOn Monday, Westpac announced it would extend its moratorium on bank closures in the regions from 2027 to 2030.\n\nThe company also said it would pilot a new Community Banking Service and implement ways to attract staff to smaller areas.\n\nBut the chair of the Senate committee, which headed the inquiry, said the recommendations handed down last year had gone largely unanswered by the federal government.\n\nCommitment to the regions\n\nIn 2024, a Senate committee report into the impact of bank closures in regional Australia was handed down.\n\nAfter receiving more than 600 submissions and touring the country to hear the concerns of local businesses and communities, the inquiry provided eight recommendations to the federal government.\n\nMore than a year later, Westpac announced a host of new initiatives to boost regional branches, including a graduate program enticing staff to the regions.\n\nChief executive Anthony Miller said it came after a full review into how the company serviced rural Australia.\n\n\"We want to make sure these [regional] areas have access to the services they need to prosper and grow,\" he said.\n\nRegional Chamber of Commerce and Industry WA chief executive Kitty Prodonovich said it was good to see the major bank respond to the grievances raised.\n\nKitty Prodonovich says a holistic approach is needed to ensure gaps are filled in regional banking services. (ABC News: Julian Robins)\n\n\"My hope is that they've listened and that people in regional WA aren't going to have another service close down or taken away,\" she said.\n\n\"They do have quite a big regional footprint in WA, but I think one of the bigger issues is how do we look at those services that are getting withdrawn, and how do we make sure something else is in their place.\n\n\"One of the concerns we have about it is often it seems to be a decision [to close] is made from far away by people who haven't worked, lived or done business in regional WA.\"\n\nRecommendations still not accepted\n\nQueensland Senator Matt Canavan, who chaired the regional banking inquiry, welcomed Westpac's commitment, but said the federal government still needed to step up.\n\n\"It's good to see there's been a moratorium on bank closures at least from the major banks, and I welcome Westpac doing this,\" he said.\n\n\"The downside is we need to try and replace financial services being lost in those towns where regional branches have already closed.\n\n\"Our report had a number of recommendations that the government still has not responded to, despite them being made more than a year ago now.\"\n\nMatt Canavan chaired the inquiry. (ABC News: Ian Cutmore)\n\nSenator Canavan said if banks had to close branches, there should be other solutions offered for regional communities.\n\n\"[Banks] should only be doing closures in a very careful way, making sure people are not simply left with no other solution,\" he said.\n\n\"That hasn't been happening, and so one of our recommendations was that it needs to be forced by the government, but we haven't gotten a response on that yet.\n\n\" I think there needs to be a role of government here to fill in these gaps, just like we do with telecommunications or education services. Financial services are essential too. \"\n\nTreasurer Jim Chalmers welcomed Westpac's announcement.\n\n\"This is welcome news and builds on the commitments we secured from the big banks in February to keep services available in regional Australia,\" he said.\n\n\"Westpac's announcement today reflects the kinds of commitment we want to see in regional Australia … and we encourage other banks to follow Westpac's lead.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/asx-markets-business-live-news-17-november-2025/106020676",
        "title": "Live: 'Unlikely' rates will move in 2026, CBA boss tells hearing",
        "publish_date": "Mon, 17 Nov 2025 20:52:35 +0000",
        "category": "finance",
        "authors": [
            "Adelaide Miller",
            "David Taylor",
            "Daniel Ziffer"
        ],
        "text": "Always love reading the take of Shane Oliver (chief economist, AMP) on the economy.\n\nHere's prices to earnings....\n\nAnd here are some of Shane's words:\n\n\"First, shares are expensive. This is nothing new but is clearly evident in relatively high price to earnings multiples. The forward price to earnings ratio on US shares is at 23.5 times, not far below the 1999-2000 tech boom high. The PE on Australian shares is well above its tech boom high despite a recent fall.\n\n\"And valuations are a poor guide to timing market movements. That said, high PEs and the low equity risk premium compared to much of the last twenty years warn of a slower return potential ahead and provide less of a buffer should things go wrong.\n\n\"Second, shares have had several years of strong gains, with the last bear market in global shares being in 2022. Shares did have sharp falls into April this year on Trump's tariffs, but the falls were less than 20% and were quickly reversed. Over the last 3 years US shares have returned 23%pa, global shares 21%pa and Australian shares 13%pa. History warns that after a run of strong above average years a weaker year and often a bear market can come along.\n\n\"Third, there are signs of a bubble forming in AI shares with investor enthusiasm for AI related exposure. Specifically, the Magnificent Seven (Apple, Microsoft, Alphabet, Amazon, Nvidia, Meta and Tesla) have risen more than 30-fold over the last decade dwarfing various other bubbles and they have disproportionately driven the US share market accounting for 50% or more of its gains since 2023.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-18/suncable-agreement-traditional-owners-northern-land-council/106014854",
        "title": "SunCable signs multi-million-dollar agreement with traditional owners",
        "publish_date": "Mon, 17 Nov 2025 20:42:40 +0000",
        "category": "finance",
        "authors": [],
        "text": "A small Northern Territory town with a shuttered pub, no library and just a single service station could one day be the hub for Australia’s biggest and most ambitious large-scale solar project.\n\nThe long-hyped SunCable project is a step closer to reality after a landmark 70-year, multi-million-dollar agreement was signed on Monday in a community on the outskirts of the NT town of Elliott.\n\nThe agreement was signed between Janigirulu, Bamayu and the Walanypirri traditional owners, the Northern Land Council, the NT government and SunCable.\n\nCommunity members watched on as the agreement between SunCable, traditional owners and the Northern Land Council was signed. (ABC News: Michael Franchi)\n\nSunCable is planning to build a 12,000 hectare solar farm on Powell Creek Station, south of Elliott.\n\nWith the new agreement comes the promise by SunCable – the company backed by billionaire Mike Cannon-Brookes – for \"multi-generational wealth\" to the region’s Aboriginal traditional owners.\n\nBamayu traditional owner Glenys Grieve said the project could benefit future generations.\n\n\"This project goes for 70 years, and is something we probably won't see out, but our children, our grandchildren, will all benefit from this project going ahead,\" she said.\n\nMatthew Ryan says engagement with native title holders and the NLC is \"key for economic development\" in the NT. (ABC News: Michael Franchi)\n\nNorthern Land Council (NLC) chairman, Matthew Ryan, said the agreement \"represents genuine partnership between big business and traditional owners\".\n\n\"Aboriginal people in the Northern Territory are open for business to grow the territory,\" he said.\n\nHe said it gave a chance for Elliott to be the hub for the region, as the project comes to fruition.\n\nThe agreement marked the culmination of three years of negotiations between SunCable and around 200 traditional owners, with more than 70 meetings taking place across the vast region.\n\nRyan Willemsen-Bell says his company's goal is \"to deliver reliable, cost-effective renewable electricity\" across the NT and South-East Asia. (ABC News: Michael Franchi)\n\nSunCable’s chief executive Ryan Willemsen-Bell, who travelled to Elliott for the milestone, promised it would offer \"long-term community benefits that will extend well beyond the life of this project\".\n\n\"The renewable energy project that we embark on today is one of the largest of its kind in the region, with a projected life span of over 70 years,\" he said.\n\n\"It will harness the power of the Sun to generate cost-effective large-scale renewable energy, positioning the Northern Territory as a leader in the clean energy transition.\n\n\"And the Barkly, where we stand today, is at the heart of this.\"\n\nThe agreement proposes the solar farm be built on Powell Creek Station near Elliott, about six-and-a-half hours south-east of Katherine (ABC News: Michael Franchi)\n\nSunCable pledges energy generation by late 2020s\n\nSunCable, which was founded in 2018, has been working for years to build its solar farm in the NT outback, despite facing financial challenges.\n\nMr Willemsen-Bell said from the outset the goal had been to harness the NT's solar resource \"to deliver reliable, cost-effective renewable electricity\" across the territory and South-East Asia.\n\nSolar farm proposed for Muckaty Station An ambitious outback solar project could soon grow even bigger, with plans lodged to build a new solar farm in remote NT.\n\nIn Elliott, he confirmed that the company was aiming to be powering parts of the NT in coming years.\n\n\"We anticipate that at the end of this decade, we will producing energy here in the Barkly region, and from there we will see further progress into Darwin, and then into South-East Asia,\" he said.\n\nIn 2024, the project was approved by the NT government and later by the then-federal environment minister, Tanya Plibersek, who issued strict conditions about protecting critical habitats and native species.\n\nSunCable said the new agreement with traditional owners would also ensure \"cultural knowledge and connections to land will be protected and will continue to be passed down through generations\".",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/national/australia-news-live-ley-concedes-new-coal-fired-power-plants-highly-unlikely-miners-farmers-and-business-groups-plead-for-deal-on-environmental-laws-20251118-p5ng5f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Wells says latest Triple Zero death will be fully investigated; UN approves Trump’s Gaza peace plan; Jess Wilson makes history as first female Victorian Liberal leader",
        "publish_date": "Tue, 18 Nov 2025 13:03:56 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine",
            "Angus Delaney"
        ],
        "text": "The Reserve Bank has signaled what it will take for official interest rates to fall further, with the jobs market and consumer spending the key swing factors.\n\nMinutes of the bank’s Melbourne Cup Day meeting, at which it left the cash rate at 3.6 per cent, released today show the discussion among bank board members about how interest rate settings could change.\n\nThere’s been a growing consensus the RBA will keep rates steady all through 2026. Commonwealth Bank boss Matt Comyn told a parliamentary hearing this morning he believed a rate cut next year was unlikely.\n\nThe RBA minutes showed board members argued there were situations where rates may need to be reduced.\n\nA material weakening of the jobs market is seen as one of the biggest risks, particularly if the private sector starts to struggle.\n\n“[Members] noted the risk that employment growth in the market sector remains soft, which could occur if the uncertain economic outlook reduces firms’ willingness to hire or if an emerging focus on cost-cutting results in lay-offs,” the minutes showed.\n\nA drop-off in the general economy, especially if shoppers become more cautious about their spending, would also put a rate cut back on the agenda.\n\nBut, the minutes showed, the bank believes rates could hold steady if the “emerging recovery in demand was stronger than expected” which would itself strengthen the jobs market.\n\nAnother risk would be if productivity growth proved weaker than expected. The RBA earlier this year reduced its long-term assumption for productivity growth.\n\nThe bank’s monetary policy committee meets once more this year, in early December, with financial markets putting the chance of a rate cut at just 7 per cent.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nfl/a-legendary-nfl-boss-says-afl-clubs-must-follow-these-eight-commandments-for-success-20251117-p5ng1o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A legendary NFL boss says AFL clubs must follow these eight commandments for success",
        "publish_date": "Tue, 18 Nov 2025 13:00:44 +1100",
        "category": "sports",
        "authors": [
            "Jake Niall"
        ],
        "text": "“I call that a prerequisite. I say that there’s a standard that these players with athletic traits...on whatever field, whatever sport you’re in. “Let’s call them A, B, C and D. If you’re E, you don’t help. Rams quarterback Matthew Stafford. Credit: AP “Once all the players, either are in A, B, C or D category, to me then it’s all intangibles. “So, if you’re an A athlete, but your intangibles are a C, they usually play to a B or a C.\n\n“Intangibles will help you either meet or exceed your expectation.” Stafford’s career was founded on intangibles, as with many quarterbacks. Players who didn’t fit in with teammates, weren’t team-first, were often shunted. “We’ve all been there, we’re like ‘I think we ought to kick those guys off the boat, they’re not helping us.’” In his office, Snead mentioned his friend, Sam Walker, whom the Los Angeles Rams employ as a consultant and who had recently been in Melbourne working with Brad Scott and Essendon on leadership. Zach Merrett and Andrew McGrath Credit: AFL Photos via Getty Images Last summer, Scott, Zach Merrett and Andy McGrath - Merrett’s probable successor as skipper - went to LA to meet with Walker, who specialises in the construction of team ethos and leadership.\n\nEssendon’s cultural issues, exemplified by Merrett’s attempted escape, seemed relevant to another commandment on the wall: “IMMERSE OUR PEOPLE IN THE RAMS WE THEN ME WAY.” “WE” was coloured yellow against blue for emphasis. Here were other striking observations from Snead which hold relevance to the AFL draft (and trading/free agency): 1. Why a gun player can slide in the draft Puka Nacua, a star wide receiver, was drafted at pick No 177, the fifth round of the 2023 draft. Snead said Pacua had been overlooked by all teams in the early rounds because he did not fit the prototype for his position - which was biased to speed.\n\nNacua, too, was injured in his final college year. “In the draft, let’s call it the higher you get... usually there’s a cleaner profile. That’s just the way the probabilities work. “His game is strength and power, probably bully ball - catch the ball and I’m now going to have to make you tackle me, and a lot of times that’s devalued in the draft. We’ve seen some of the players that fit that profile, they get devalued, because it’s a spacing game, speed, explosiveness. A young Sam Mitchell Credit: Peter Mathew “There was a strategy there. And we could probably get him a little later. Now based on all things considered we should have picked him earlier.” The AFL clubs will all be hoping, no matter the odds, of finding their version of Nacua (188 cm and 96 kilograms), who is his sport’s answer to Chris Grant, James Hird, Sam Mitchell, Tom Stewart and others who were bypassed early in the draft. The knock on Mitchell was that he was small and slow.\n\nLoading 2. Which are the hardest players to assess in the draft and why? A simple answer to this one from Snead: Quarterbacks. Why? “NFL’s the highest level of a video game... The game in college is different to the NFL and the quality is not as good....there’s more space. “In the NFL, there’s hardly any space... Can you, as that QB then, as things [happen], speed up?\n\nIn the AFL, the draft record suggests key forwards are harder to identify than midfielders. Key forwards - and some key backs - don’t necessarily replicate junior success in the AFL. Like quarterbacks, they face congestion in the big league. The Rams traded in Stafford, knowing he was a proven commodity, in the same way that the Swans acquired Curnow, and Tony Lockett, Barry Hall and Lance Franklin before him. When did Sydney last draft a quality key forward? “You cut out the risk when you trade for quarterback,” said Snead. Charlie Curnow as a Swan. Credit: Eddie Jim 3. Trading in mature players for draft picks when in the premiership window\n\nSnead follows a method similar to AFL clubs who believe you only give up draft capital when entering contention. One factor he mentioned is seldom raised in the AFL - that of the senior coach also being “in his prime”. The LA Rams win the Super Bowl in 2022. Credit: AP “In the year we won the Super Bowl … we had a lot of players in their prime. “So we used like some of our premium draft picks to make trades, to bring in other players in their prime.\n\n“That might not be the strategy if you’re not there yet.” Stafford was acquired from the Detroit Lions using that formula. “A lot of his teammates were in their prime, the head coach was in his prime. It was like, ‘OK, if we add a QB in his prime’, now you have, at least on paper, a more complete [team]. “If you’re not there and you’re getting there, you might be a little bit heavier [in the] draft.” 4. What to do once a team enters “no man’s land?” No man’s land, as defined by a senior AFL club official (to his board) was neither rebuilding, nor contending (nor the half-way house of “building”). Snead, when this was put to him, liked the concept and spoke as if he’d been in that predicament.\n\n“No man to me is you’ve got to tear it down first. Which is, ‘oh wow, we have to tear this thing down over two seasons.’ That ought to be fun and I’m sure the fans are going to have trust in us, right? Loading “Mine would be, if you’re in no man’s [land], you’ve got to tear it down. That may be you’re a team that’s older, right, and now how to do you move on... I call the rebuilding/building...or I call it remodelling.” Melbourne and Carlton, mired in no man’s land in 2025, would appear to have followed Snead’s formula, to an extent, by trading out Christian Petracca and Clayton Oliver and Charlie Curnow, as Tom De Koning walked as a free agent. Jake Niall travelled to LA as a guest of the Rams.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/the-age-good-food-guide-2026-best-places-to-eat-and-drink-in-geelong-and-the-surf-coast-20251118-p5ngaf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age Good Food Guide 2026: Best places to eat and drink in Geelong and the Surf Coast",
        "publish_date": "Tue, 18 Nov 2025 12:43:06 +1100",
        "category": "finance",
        "authors": [
            "Emily Holgate"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nFrom wine bars to bakeries, pub meals to cocktails, here’s how to spend a delicious few days in this rapidly changing region.\n\nThe best place to kick off a culinary journey of Geelong is Pakington Street – a lively stretch of boutiques, restaurants, Victorian-era architecture and cafes tucked down cobblestone alleys. Box Office is a vast warehouse-style space serving Axil coffee and brunch that goes heavy on native Australian ingredients. Hatted restaurant Tulip runs a refined snack-forward menu, while the front bar of the historic Petrel Hotel is alive with fans of well-executed pub dishes ordering hefty chicken schnitties lathered in garlic butter.\n\nChicken schnitzel with garlic butter at the Petrel Hotel. Duncan Jacob\n\nWhen it comes to morning pastries, there’s That Place in Belmont for viennoiserie by French-trained pastry chef Ashlea Allen, while the Local serves focaccia sangers, house-made pastries and Everyday coffee from a takeaway\n\nwindow near the CBD. That queue snaking down Pakington at the Newtown end?\n\nJoin it, immediately, and you’ll soon be in the sourdough haven that is Born and Bread (moving to a new location just down the road in January). You’ll want to loosen the purse strings as it’s tricky to choose a favourite, but chilli jam twists and custard-filled pecan buns are top contenders.\n\nCome Saturday evening, Geelong’s Little Malop Street pulses with energy. Get your hands dirty at Nashville-inspired bar The Hot Chicken Project, where spice levels range from mild to the blisteringly hot “evil”. Then, ascend the hidden staircase next door for a nightcap at 18th Amendment, a moody bar that nods to America’s prohibition years with cocktails named Bonnie and Clyde, and Thomas Edison.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/victorian-liberals-leadership-spill-live-brad-battin-set-to-be-challenged-by-jess-wilson-20251117-p5ng4l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victorian Liberal leadership spill LIVE: Jess Wilson takes over state party as Brad Battin accepts defeat",
        "publish_date": "Tue, 18 Nov 2025 12:30:22 +1100",
        "category": "finance",
        "authors": [
            "Cassandra Morgan",
            "Rachel Eddie",
            "Chip Le Grand"
        ],
        "text": "Brad Battin gave members of the media the thumbs-up before today’s parliamentary sitting, which has spiralled into farcical scenes in the last few minutes.\n\nIn a clear attempt to stir the Coalition, more than a dozen Labor MPs attempted to give “motions by leave” aimed at the opposition, criticising them over their tax policies.\n\nBrad Battin gives the media the thumbs-up before the parliamentary sitting. Credit: Jason South\n\nUnder parliamentary rules, these statements can only be given without objections.\n\nThe opposition benches loudly yelled “no” every time an MP rose to speak.\n\nThis led to more than a dozen Labor MPs standing up, only to be shouted down with smiles on their faces. Point Cook MP Mathew Hilakari quipped they were the “No-alition”.\n\nSandringham MP Brad Rowswell fired back, saying the first three people to stand up and criticise the new female leader were male MPs.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/tpg-customer-dies-after-failed-triple-zero-call-20251118-p5ng7j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "TPG says person dead after failed Triple Zero call",
        "publish_date": "Tue, 18 Nov 2025 12:26:29 +1100",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "Loading The Australian Communications and Media Authority (ACMA) said in a statement that it was “gathering information to establish the facts of the matter and will investigate to assess whether there has been any non-compliance with the Triple Zero rules. If any breaches are identified, appropriate enforcement action will be taken. “Public safety and reliable access to emergency services are of paramount importance. Under rules introduced in 2024, telecommunications providers must notify their customers where the provider identifies that the customer’s device may not be able to connect to Triple Zero and then take action to block those devices from their networks.” The tragedy comes just two months after three people died during a major Optus outage in mid-September, when more than 600 calls to Triple Zero emergency services failed to connect. That incident, which lasted more than 90 minutes, prompted a federal government inquiry and led to parliament fast-tracking new legislation to strengthen oversight of emergency calling services. The September Optus outage was the second major Triple Zero failure for the telco in two years. In November 2023, more than 2000 calls to emergency services failed to connect during a 12-hour national network outage, resulting in a $12 million fine from ACMA.\n\nThe incidents have shaken public confidence in Australia’s emergency services infrastructure and put intense pressure on both telcos and device manufacturers to ensure Triple Zero access. Communications Minister Anika Wells. Credit: Sitthixay Ditthavong The watchdog disclosed just last month that some older Samsung mobile phones released between 2015 and 2017 could not automatically switch to alternative networks to complete Triple Zero calls. Testing revealed that 71 Samsung models were affected, with 11 requiring replacement and 60 needing software updates. The problem stems from legacy firmware configurations that attempt to route emergency calls through Vodafone’s now-defunct 3G network. When Telstra and Optus networks are unavailable, these devices cannot successfully switch to TPG’s 4G network as a back-up. Wells last month warned that the Samsung phone problems could be “indicative of a broader systemic issue” in Australia’s telecommunications emergency services.\n\nThere are tens of thousands of devices nationwide that may be affected by the issue. Some 46,000 devices are thought to be affected across Australia’s three major carriers. TPG identified affected devices last year during preparations for the national shutdown of 3G services and blocked them from its network, sharing information with Telstra and Optus. However, Telstra engineers recently discovered during testing that the same Samsung devices were still attempting to connect Triple Zero calls via Vodafone’s decommissioned 3G infrastructure. “Why this was configured this way is a question for Samsung and Vodafone,” a Telstra spokesman said. Vodafone owner TPG described the issues as related to a “legacy configuration within the devices themselves”. The company identified additional Samsung devices this year requiring software updates, and has been blocking devices that haven’t been upgraded, as required under new regulations. “When TPG Telecom became aware of these handsets on its network, we communicated with customers to urgently update affected devices,” the company said on Tuesday morning. “Handsets not updated are blocked after a period of 28 to 35 days from the first contact to the customer, as required under new regulations.\n\n“The most recent communications to customers with impacted devices was sent on 7 November. These updates are critical to ensure compactibility with emergency services and to protect customer safety.” Under rules that took effect from November 1, telcos must test whether mobile phones can switch to other networks during Triple Zero outages, report failures in real time, and disconnect phone services within 28 to 35 days of notifying customers that their devices cannot connect to emergency services. Loading Parliament last month also passed legislation creating a new Triple Zero Custodian with compliance powers to ensure emergency services remain accessible. The custodian can impose maximum fines of $30 million for breaches of Triple Zero rules – a tenfold increase from previous penalties. The government has also ordered telcos to create separate public registers of Triple Zero outages, though carriers have raised concerns about the technical and cost challenges of real-time reporting. TPG warned that implementing real-time reporting for unplanned outages would “require substantial system changes and cost across our operations”.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/japan-deploys-army-to-deter-bear-attacks-20251118-p5ngbw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Japan deploys army to deter bear attacks",
        "publish_date": "Tue, 18 Nov 2025 12:25:53 +1100",
        "category": "finance",
        "authors": [],
        "text": "Japan deploys army to deter bear attacks\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/a-clear-no-1-bolters-and-bidders-who-your-afl-club-will-pick-in-the-draft-20251103-p5n7e7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The draft is a day away. Here’s who your club is set to pick",
        "publish_date": "Tue, 18 Nov 2025 12:18:27 +1100",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "A back stress injury meant Uwland missed this year’s championships after an outstanding bottom-age campaign last year that had him pegged as the best prospect in the 2025 class. The man viewed as Errol Gulden 2.0 did not reach those heights in the limited football he played after recovering, but his football IQ is as good as anyone’s in this draft. He boasts silky skills and can run all day. Might captain the Suns one day. If not: There has been noise for a while, which heated up during the trade period, that the Eagles might bid on Carlton father-son defender Harry Dean. They could also opt to bid on Dylan Patterson or Daniel Annable here. This is not what the Blues were hoping, but the Eagles look poised to do it. Dean is widely rated as a top-five talent. He is one of the best key defender prospects in years, and stands out because there is a major shortage of that position in this crop. He aggressively flies for marks and spoils, reads the ball superbly, and has the athleticism, composure and skills to thrive at the top level.\n\nIf not: West Coast bid on Dylan Patterson instead, or stopped bidding and went for Cooper Duff-Tytler instead. The Eagles have long been linked to Duff-Tytler, a talented ex-basketballer who boasts similar traits to AFL ruck stars Luke Jackson and Tom De Koning with his athleticism, leap, agility and follow-up work. He showed in a VFL appearance for Essendon, where he played predominantly as a forward, that he can impact the game in attack as well, even if that remains a query in some quarters. Should develop rapidly in an AFL environment. If not: There is talk that Essendon would love to try to snatch West Coast’s No.2 pick after securing Carlton’s No.9, but the likeliest scenario is Duff-Tytler is heading west.\n\nPatterson might be the most damaging and exciting player in this year’s draft. He takes the game on with his kicking and fast feet – including a nasty goose step – and sometimes tries to do too much, but showed in a VFL game against Carlton late in the season that he can rein his attacking nature in. Likened to Andrew McLeod, Patterson rejected NRL clubs’ overtures to stay on the AFL path, and could be a difference-maker for the Suns. If not: It seems West Coast will bid on Dean after Uwland. That means the Tigers will bid on Patterson, and that is now expected to be before they pick an unattached player, but maybe they make a live pick first. The Lions’ premiership window will never shut if kids like Annable keep popping up, after the Ashcroft brothers arrived in recent years. Annable racks up disposals, excels at stoppages and is creative by hand. There are all sorts of flattering comparisons ahead of the draft each year, and recruiters see a bit of Simon Black in Annable. Brisbane will gleefully match any bid on Annable, and would quietly be chuffed if it comes this late. If not: The Tigers picked an unattached player first, such as Sam Cumming, Sullivan Robey or Xavier Taylor.\n\nThe consensus view is that the Tigers would not have flown to Mildura just to do their due diligence on Cumming, so expect him to head to Punt Road. A shoulder injury cut his season short, but not before he stamped himself as a top-10 pick. He is a dual-position threat who impacts the game as a deep forward with his marking ability and knack for kicking goals, or as a midfielder, where his physicality, aggression and dynamism are all ticks. There have even been Mark Ricciuto comparisons. Recruiters also like Cumming’s defensive commitment. If not: Richmond went for Sullivan Robey or Xavier Taylor instead. Two of the three should be in yellow and black. Robey is this year’s bolter, after many clubs hoped they could keep him a secret once he graduated from Rowville’s senior side to belatedly burst onto the scene for the Ranges mid-season. He grew about 17 centimetres in the past two years and developed physically, in equal parts owing to an impressive home gym and his dedication. First made his mark as a lead-up forward, then showed his strength and power as a midfielder.\n\nIf not: The Tigers are also strongly linked to Xavier Taylor and Sam Cumming, but are not expected to consider Sam Grlj here. Taylor once polarised because of inconsistent decision-making and execution, including a habit for kicking into the man on the mark – but he has cleaned that up (mostly), and risen sharply on draft boards. Was best afield in the Ranges’ grand final triumph, where his intercepting skills, athleticism, versatility and competitiveness were on show. Importantly, there is confidence Taylor will stand up defensively in the AFL. If not: Richmond picked Taylor over Sam Cumming or, more likely, Sullivan Robey, meaning one of those latter two slipped through to the Bombers.\n\nThe suspicion is the Bombers will invest in at least one midfielder after parting with Dylan Shiel, Will Setterfield and Ben Hobbs, on top of the Zach Merrett situation, Darcy Parish’s injury history, and with Elijah Tsatas still proving himself. Sharp won the Larke Medal as the best-performed player at the championships, and is a physical, competitive onballer who wins the ball in big doses. If not: Essendon have also been linked to Sullivan Robey, Sam Cumming, Jacob Farrow, Lachy Dovaston and forward-ruck Aidan Schubert. One different move changes a lot of what comes next. The Demons are never afraid to go against the grain, but this may depend on whether Sam Cumming or Xavier Taylor are available. This is higher than Nairn has been projected, but Melbourne have him in their sights. Nairn had a seven-goal game at the championships before demonstrating his ball-winning wares with consecutive 30-plus-disposal outings to end the season. He is a high-IQ footballer, runs all day on the wing, could develop into an inside midfielder, marks well overhead and is a neat kick. If not: They would love Sam Cumming, Sullivan Robey or Xavier Taylor to still be on the board. Melbourne might select defender Jacob Farrow, or one of small forwards Latrelle Pickett or Lachy Dovaston.\n\nFarrow’s draft range starts at Essendon’s picks, and he has admirers into the mid-teens, but he should be long gone by then. He is one of the best kicks in this class – which should appeal to Melbourne – makes quick decisions, impacts the game as an interceptor, and showed his agility in combine testing. Farrow has also performed well in the midfield, but is more proven down back, where he will start and possibly stay in the AFL. If not: Small forwards Latrelle Pickett – cousin of Demon Kysaiah – or Lachy Dovaston may be considered instead, or they could look to fortify their key defensive posts for the future with Blake Thredgold. Dovaston, who hails from the same Talent League club as Nick Watson, is the best small forward in this draft. He might lack Watson’s tricks, but still has his share, and has greater running capacity and is considered superior defensively to when the star Hawk was the same age. Dovaston kicks goals for fun (and lots of them), is consistent, has become more selfless, runs hard up and down the ground, and tested brilliantly at the combine.\n\nIf not: Essendon might go for another small forward, Latrelle Pickett, instead or add forward-ruck Aidan Schubert, who has been linked to Tullamarine throughout the year. Josh Lindsay and Sam Grlj are other options. The Hawks have interviewed Taylor in recent days, so he is at least in their mix. His stocks increased the longer the year went after not playing at the championships, capped by his eye-catching results at the combine, where he set the fastest 20-metre sprint time and finished second for agility. Taylor puts that acceleration to great use to quickly create separation and get the ball moving forward. He can tidy up his kicking and improve defensively. If not: Hawthorn might opt for speedster Sam Grlj or sweet-kicking defender Josh Lindsay instead.\n\nThredgold has been linked to North Melbourne for a while, so he might be the player they have in mind, assuming they secure Carlton’s selection. Recruiters took notice of Thredgold’s solid job last year as a bottom-ager on future Collingwood forward Charlie West. He also quelled fellow first-round prospect Mitch Marsh in this year’s SANFL under-18 grand final and dominated in the air to cap a strong finals series. He is a tad undersized but a genuine lockdown defender who is strong, athletic and competitive. If not: The Roos might opt for forward-ruck Aidan Schubert, or whoever is still up for grabs between small forwards Lachy Dovaston or Latrelle Pickett. As always with bids, there is a great unknown, but there is enough noise about the Giants potentially bidding, after the Swans bid on Harry Rowston around this range three years ago. The Swans academy product finished top 10 in three tests at the combine, including winning the running vertical jump. Part of Kyle’s appeal is that this was his first year in the academy, so there is serious scope for improvement. He is a good size, has a big tank and brings positional versatility. If not: GWS will probably select from a group including Oskar Taylor, Sam Grlj or Latrelle Pickett, but they are typically tough to predict.\n\nMelbourne star Kysaiah Pickett’s cousin has top-20 interest in what is an even crop, but there is a chance he is still up for grabs in the 20s. The Demons, Essendon and North Melbourne are other possible landing points. Pickett turns 20 in December, so he is slightly older than his draft peers, but has impressed this year with his progress at Glenelg. He is quick, elusive, capable of the mercurial, and has the cheek that the best small forwards possess. If not: GWS might have the option of Oskar Taylor or Sam Grlj, both of whom they also like. West Coast are expected to make a bid on Murray, who has been mentioned in top-20 calculations in recent weeks. But the Suns rate him highly and it would be a shock if they did not match a bid on him here. A foot injury meant Murray did not play at the championships, but recruiters like his athleticism and toughness, and were impressed with how diligent he was with his rehab.\n\nIf not: The Eagles may bid on another Gold Coast academy player, Beau Addinsall. They would be doing so knowing the Suns are less likely to match a bid on Addinsall.\n\nGrlj was originally linked to Richmond, and could easily land at the Hawks or GWS. He would be difficult to pass up for the Eagles if he is still available. Grlj has speed to burn and was one of only two players to run the two-kilometre time trial quicker than six minutes at the combine. He entered top-five calculations with a superb start to the year before hitting a rough patch, but his VFL form for Richmond was excellent. Grlj could eventually become a midfielder, but will likely start at half-back. If not: There is chatter in the industry that Gold Coast academy midfielder Beau Addinsall might attract a bid in the teens, and clubs believe the only club likely to do that would be West Coast. Lindsay is an excellent decision-maker and arguably the best kick in the draft – the result of years of dedication honing his skills, including a strict morning routine – so this would be a good result for the Bulldogs. He has been a consistently high performer at all levels, and is viewed as a safe selection who could slot straight into a defensive role. There are varying opinions on whether Lindsay could develop into a midfielder.\n\nIf not: Sydney academy defender Lachy Carmichael is right in the frame here, and several clubs have him pencilled in as the Dogs’ selection. The Swans might not match this early if that eventuates. Adelaide are tipped to go local, and they have kept in close touch with Marsh, who kicked the most goals at the 2025 championships. He emerged from the carnival as a top-10 contender who some thought could play other positions, but appears to have slid after a so-so end to the season. But the talent and upside are there, and Marsh would complement the likes of Riley Thilthorpe and Darcy Fogarty as a different attacking option. If not: There will be other viable South Australian players available, such as Harley Barker, Aidan Schubert and Jevan Phillipou.\n\nInjuries impacted the start of Ison’s season, but the Blues’ next-generation academy prospect finished strongly – and opposition recruiters took notice. Ison’s height and aerial prowess make him a candidate to fill various roles across the ground, beyond just the midfield. There is still a smallish sample size on him, but the scouting report acknowledges that he can do things others in this range cannot, so Carlton will gleefully match a bid. If not: A bid on Ison might come later, with Fremantle a possibility. If the Cats don’t bid on Ison, they may bid on Gold Coast’s Beau Addinsall, and would be a good chance to get him. Archie Ludowyke has also been linked. Ludowyke started the year brightly for the Dragons and the AFL Academy after long being rated the best key forward in this class. However, he had a goalless championships – which was not all his fault, as a player relying on service – before suffering a season-ending PCL injury in Metro’s win over the Allies. This would be a classic Cats play to invest in a player with good size and athleticism who launches himself at the Sherrin. If not: There is a scenario where Geelong Falcons defender Josh Lindsay is available here, while key forward Aidan Schubert is another potential option.\n\nSome clubs think this is too early for Williams, but if anyone makes a bid, the Dockers loom as the most likely for the speedy forward. He has all the traits to be a successful small forward at AFL level, but there is some projection here. Williams starred at the combine, placing second with a scintillating 2.89-second 20-metre sprint and also finished fourth in the agility test. If not: Williams may still be available into the 30s. The Dockers could bid on others, or look for a different forward. Freo are raised as a potential bidder here, and Sweid will probably receive a bid in the 20s somewhere. He recovered well from an ACL rupture that sidelined him for much of the 2024 season, and the Essendon next-generation academy prospect enjoyed a strong campaign. He is small, but that did not stop him at any of the levels he played at this year. Sweid’s toughness, competitiveness, defensive commitment, and penchant for kicking goals while playing at half-forward endeared him to scouts.\n\nIf not: Sweid’s wait will continue. The Dockers might bid on someone like Beau Addinsall or Max King instead.\n\nThere is risk with Barker, who sustained an ACL rupture playing for Sturt after earning All-Australian honours. If a club is willing to take that on board, there is so much to like about Barker’s prospects, given he was considered a top-10 smokey after his championships performance. His size, speed, endurance and skill add up to an impressive package, and he uses his running ability to get involved at both ends. There is a chance he slides. If not: The whispers around the Dockers are that they are interested in a forward, so they might even bid on Max King or could go for Noah Hibbins-Hargreaves, and might even go for a mature-ager. Jevan Phillipou might be another option. Greeves is linked to the Hawks by virtue of their rejected application to include him in their next-generation academy program because of his Indigenous background. He also trained with them during the pre-season through the AFL Academy. Greeves is polarising – with most queries centred on his running ability – but a contested beast who has the height and ability to also impact the game when he plays as a marking forward.\n\nIf not: Hawthorn might opt for more firepower in attack, with someone such as Aidan Schubert or Liam Hetherton, who has also been linked to them. Could they place a bid on Beau Addinsall? The Bombers might snap up Schubert with one of their early picks, or North may already have drafted him with the pick they are expected to trade for from Carlton. His awkward ball drop and kicking style are talking points, and put some clubs off, while he measured shorter than some scouts expected. But Schubert had an outstanding championships to surge into the top-10 mix. Talls can sometimes drift, given the risks involved, but his competitiveness and endurance appeal. If not: Winger Harley Barker is a player of interest and would be in strong consideration if he is available. Forward-ruck Louis Emmett is another option.\n\nIn a draft where many prospects are flawed or erratic, Carmichael’s ultra-consistency across several years is a big tick. The Dogs might even bid for him with their first pick, where they would have a strong chance of retaining him. Carmichael was an All-Australian at under-16 level in 2023, and earned that same honour at this year’s under-18 championships, where he was also the Allies’ MVP. Carmichael is defensively sound, but his kicking and relative lack of athleticism may keep him in this range. If not: The Dogs might only bid on Carmichael with their first pick. If they don’t bid on him, they will likely go for a taller option instead. It becomes really difficult to know what will happen this deep into the draft, but the Bulldogs are linked to him and another athletic ruckman, Marcus Krasnadamskis. The popular view on Emmett, who finished third in the time trial at the combine, is that he will need to develop into a key-position player at either end – but there is upside here, and he will be a back-up ruck option at worst. His draft range starts earlier than this but could be wider.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/companies/keeping-costs-down-top-priority-as-nine-s-new-tv-boss-rings-in-changes-20251117-p5nfz5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Keeping costs down top priority as Nine’s new TV boss rings in changes",
        "publish_date": "Tue, 18 Nov 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "Calum Jaspan"
        ],
        "text": "Nine Entertainment’s new broadcast and streaming boss says wage costs across the media giant’s biggest division, including that of on-air talent, will be closely watched as she moves to squeeze more revenue out of the hit shows on its roster.\n\nLaing, who joined Nine from Foxtel earlier this year, told this masthead that the business needs to keep a lid on its costs as it puts Nine Network, Stan and 9Now under one roof.\n\nNine’s managing director of streaming and broadcast, Amanda Laing, has begun to make changes. Credit: Louie Douvis\n\n“We are looking at the remuneration across the entire business, from, yes, people on-air to people involved in production, to people in IT, to engineers, technology, all of these things to make sure we’ve got the right cost base and the right investment in the right areas.”\n\nLaing presided over her first cost-saving measure last week, with Nine saying it was looking to cut 50 jobs from its newly created broadcast and streaming division, with some big names from its different nightly news operations among the casualties.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/china-is-moving-in-as-trump-hurts-the-us-dollar-20251118-p5ng6u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "China is moving in as Trump hurts the US dollar",
        "publish_date": "Tue, 18 Nov 2025 11:59:05 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "When China twisted BHP’s arm last month and forced it to settle 30 per cent of its iron ore sales in yuan, it was part of a larger effort to boost the use of its currency in global transactions.\n\nWhile the tussle with BHP was also motivated by an attempt to negotiate iron ore prices down, China’s insistence on a proportion of BHP’s sales being paid for in yuan was a clear escalation of its ambition of eroding the dominance of the US dollar in global financial and economic activity.\n\nChina is looking to strengthen its geopolitical ambitions and weaken the already Trump-weakened status of the US and the dollar in global affairs. Credit: Getty Images\n\nIt doesn’t appear that it is trying to end dollar dominance, although that might be a long-term goal, but to insulate its own economy and financial system from that dominance as rapidly as it can. Increasing use of the yuan in international transactions also helps extend and expand its spheres of influence.\n\nAt China’s Fourth Plenum meeting of the Communist Party last month, the senior leaders spelled out more clearly than they had previously their plans for the yuan, saying China should “promote the internationalisation” of the currency.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/cba-boss-wants-major-cut-to-migration-level-to-aid-home-affordability-20251118-p5ng6e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CBA boss wants major cut to migration level to aid home affordability",
        "publish_date": "Tue, 18 Nov 2025 11:58:32 +1100",
        "category": "finance",
        "authors": [
            "Shane Wright",
            "Millie Muroi",
            "Clancy Yeates"
        ],
        "text": "Commonwealth Bank boss Matt Comyn wants Australia’s net migration to be tens of thousands of people a year lower than the government is forecasting to help improve housing affordability as the Coalition spoils for a fight over the issue.\n\nSpeaking at a committee hearing at Parliament House on Tuesday morning, the boss of the nation’s biggest bank said having a predictable level of migration would help housing supply and infrastructure keep up with demand.\n\nCBA boss Matt Comyn said the growth in home loans probably needed to slow down. Credit: Alex Ellinghausen\n\n“Perhaps that number is something in the order of 180,000 per annum,” said Comyn, stressing it was a personal view. “It gives both the Commonwealth and states the ability to plan for critical infrastructure, including housing.”\n\nThe government is forecasting net overseas migration to fall to 260,000 this financial year, then to 225,000 in 2026-27 and for the rest of the decade. Opposition Leader Sussan Ley has declared she would lower migration if elected, with the Coalition contemplating a cut of more than 100,000 people a year from current levels.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/cricket/better-than-ever-marnus-warning-for-archer-and-why-he-thinks-an-englishman-is-the-world-s-best-batter-20251117-p5ng4t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Better than ever’: Marnus’ warning for Archer, and why he thinks an Englishman is the world’s best batter",
        "publish_date": "Tue, 18 Nov 2025 11:55:01 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Before that series, Labuschagne had been full of brio when discussing how he knew exactly what was needed to deal with every member of England’s then bowling attack. It’s a level of confidence he lost somewhere along the way over six years of constant international cricket, but it’s back now. “[In 2019] I was averaging 60 in county cricket and just in that run scoring form when everything’s clear. It doesn’t matter who you’re facing, it’s just ‘ok I’ll do this, or this, or this is where they’re bowling and I’ll put them under pressure here’. Jofra Archer. Credit: Getty Images “When you’re not going well it’s the opposite, it’s ‘I’ve got to do this, I’ve got to defend and grind’, instead of ‘nah I’ll just play the ball like that because that’s where the field or the plan is’. “Whenever you’re not doing well or failing, there’s doubt, I don’t care who you are, that’s what happens. But I think it was more the fact that my technique was in a space where I couldn’t apply pressure to the opposition, so my only option was defensively to grind. That’s the part that’s shifted and why I’m really happy.”\n\nLoading Alongside those memories of 2019 is a remarkable admission - through much of the rich run of scoring that followed for Australia, Labuschagne does not think he was playing particularly well. “I’ve had periods of being a prolific run scorer, the 2019-20 Pakistan, New Zealand summer here,” he said. “But even then I don’t think I was necessarily batting that good. I was just a good decision-maker and I was in a rhythm of scoring runs, so you’re able to repeat that consistently.” Labuschagne does not yet know whether he is going to bat in his customary number three spot or shift back up to opening with Usman Khawaja, saying: “it’s not as simple as work out your one, two, three”. But he does know he will be batting far better than last summer, where at times he both looked and felt like a sitting duck. “My technique’s in a spot now where I can score off more deliveries and now it’s about decision-making,” he said. “I was nowhere near my best last summer, but I still managed to play some crucial innings in a series. But it’s certainly not the way I want to be playing, as restricted as I was then.\n\nLoading “When you get that space, you sit back and go, ‘OK, I don’t want to be going back to that, playing that type of cricket where I’m so restricted and feel like the only way is to grind’. I think that’s what we’ve seen this season so far, probably a different Marnus than you have in the last few years.” Labuschagne spoke glowingly of Joe Root, calling him “the best batter in the world at the moment”. “I hope we don’t see the best of Joe Root this summer, for Australia if we can keep him quiet and put him under pressure to score runs that’d be really good for us. But the reality is he’s a class player and the best batter in the world at the moment. The way he goes about it, he’s one of the greats.” But the Queenslander’s own return to the Australian top six provides another warning to England, by showing how much batting in these conditions can be required to feel at home again.\n\n“The month I had in the West Indies with [Matt] Wadey and Diva [Michael Di Venuto], working there and with Ron [Andrew McDonald] and just batting and not having any pressure on me was the start of the process of getting back,” he said. “Technically, I hadn’t landed on what I needed to land on then, but it felt like I was getting back to that freedom, and I just wouldn’t have been able to do it if I was in the team. As that progressed into coming here, I thought the only way I’m going to get back to playing my best is if I just played games. Loading “So I played four or five club T20 games to get out there and bat and be able to find that feeling of scoring runs. I played two practice games against Tasmania, and it was the same thing, building up scoring runs in the middle and getting that feeling of trusting my game.” England have played one measly warm-up game and on Tuesday will have their first session in the fast Perth Stadium nets.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/nine-wins-from-49-the-next-hoodoo-the-socceroos-are-desperate-to-break-20251118-p5ng6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Nine wins from 49: The next hoodoo the Socceroos are desperate to break",
        "publish_date": "Tue, 18 Nov 2025 11:52:00 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "As the rest of Australia celebrated the 20-year anniversary of John Aloisi’s famous penalty kick against Uruguay over the weekend, the Socceroos refused to look back. But they did go backwards, ever so slightly.\n\nCoach Tony Popovic did not sit his players through a communal re-watch in camp, nor did he ask them to channel the spirit of November 16, 2005, when they took the field against Venezuela in Houston, Texas.\n\nInstead, he watched them produce the worst performance of his year-long tenure as Socceroos coach: a disjointed 1–0 defeat that extended a different South American hoodoo.\n\n“It was a good lesson for us,” Popovic said, chalking it up largely to the inexperience in the experimental starting XI.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/workplace/employers-rostering-staff-over-xmas-holidays-put-on-notice-20251118-p5ng7l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Employers rostering staff over Xmas holidays put on notice",
        "publish_date": "Tue, 18 Nov 2025 11:47:29 +1100",
        "category": "finance",
        "authors": [
            "Elias Visontay"
        ],
        "text": "Employers have been warned that they must “request, not require” staff to work on public holidays over the end-of-year break following a landmark legal ruling that bosses cannot forcibly roster workers on to days such as Christmas.\n\nLast week, the Federal Court ordered BHP to pay almost $100,000 – $15,000 in fines and $83,700 in compensation to 85 workers – after it found the mining giant had failed to consult them before rostering them on to work Christmas Day at its Daunia coal mine in Queensland in 2019.\n\nJustice Darryl Rangiah noted in his ruling the “inherent power imbalance” between employers and employees and said the law requires there be a “request rather than a unilateral command to prompt the capacity for discussion, negotiation and a refusal”.\n\nMerry merry: Workers can’t be forced to spend Christmas in the office, a court ruling has found. Credit: Getty Images\n\nWhile an employee can refuse requests to work public holidays, Rangiah found the 85 BHP employees had been “deprived of the opportunity to raise reasonable grounds for refusing to work” on Christmas Day and Boxing Day.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/anthony-scaramucci-says-everyone-in-trump-s-orbit-hates-him-20251109-p5n8v4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Anthony Scaramucci says everyone in Trump’s orbit hates him",
        "publish_date": "Tue, 18 Nov 2025 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "Kishor Napier-Raman"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Anthony Scaramucci is mercilessly roasting me for ordering French toast. “This motherf---er, he’s got a metabolism like a coal furnace, he’s having French toast. If I had French toast, I’d be in a f---ing coma. No, I’d be an extra five kilos, but I’d also be in a coma,” he says. Scaramucci, the Wall Street financier and one-time Donald Trump whisperer, is content to enviously pick at a bowl of berries with a side of yoghurt when we meet for breakfast in the Aperture cafe at the Capella Hotel up the road from Circular Quay. “The Mooch”, as he’s affectionately known, is a man in high demand. He’s flown into Sydney to headline the Sohn Hearts & Minds conference at the Opera House, an investment community jamboree that raises money for charity. He landed in London the night before, and will leave Sydney the next day for the brutal 24-hour return to New York. Anthony Scaramucci says Trump is “into punishing people. He believes in humiliation rituals, particularly for our allies”. Credit: Sam Mooy Thanks to that punishing schedule, our “lunch with” has become a brief “breakfast with”. Not that the early start, or jet lag, stops your correspondent from getting the full Scaramucci experience. The Mooch talks fast and he talks big. He drops expletives liberally and greets me with jokes about the “fake news media” followed by a conciliatory bear hug.\n\nAdvertisement\n\nAnd he has the self-deprecating sense of humour that emerges when your claim to fame is being a global punchline. The joke that preceded the punchline was the first Trump presidency. Scaramucci became White House communications director in July 2017, and infamously lasted just 11 days in an episode that would come to symbolise the chaos and dysfunction that plagued Trump’s Washington. The whole thing began to unravel when Scaramucci phoned The New Yorker’s Washington correspondent, Ryan Lizza, and launched into a lengthy, profanity-laden tirade that involved some extremely colourful editorialising about a couple of his White House colleagues. Scaramucci insisted the conversation was off the record. Lizza, and The New Yorker, said it was not, and duly hit publish. Five days later, the Mooch was fired. There has never been a shorter-serving communications director. Anthony Scaramucci, as the director of communications for the White House, during a press briefing in July, 2017. Credit: Bloomberg “I made a mistake in trusting in a reporter. It won’t happen again,” he tweeted. Mercifully, our breakfast is entirely on the record, and the Mooch seems in a trusting enough mood. The conversation is made easier by the fact that these days, Scaramucci, 61, has no trouble telling the world how he really feels about Trump.\n\nAdvertisement\n\n“If you’re inside Trump’s near orbit you hate his guts. Don’t forget that,” he says. “He’s [Trump] in it for the money and he’s in it for the attention. He’s not in it to serve the American people or to make the country better. He’s into punishing people. He believes in humiliation rituals, particularly for our allies.” When Trump gave Prime Minister Anthony Albanese the cold shoulder for months, there were widespread fears Australia would be subject to such a humiliation ritual. Instead, Scaramucci says, the prime minister and ambassador Kevin Rudd played the Trump game well. US President Donald Trump and Australian Prime Minister Anthony Albanese in October. Scaramucci says Albo “played the game well” with Trump. Credit: Bloomberg “Remember, you’re going on stage in a live reality television show that’s being produced by Donald Trump. And so you can go in there reactive, and then you’re going to get destroyed.” Unlike Ukraine’s Volodymyr Zelensky, or South African President Cyril Ramaphosa, Rudd and Albo went in and “co-produced” the production. As for Rudd’s now-deleted mean tweets about the US president?\n\nAdvertisement\n\n“If you’re sending out critical tweets of Trump he has way more respect for you than you think because he hates himself,” Scaramucci tells me. “He’s a bad human being, prima facie bad human being. And he’s prima facie out to hurt people.” How, and why then, did Scaramucci end up working for such a bad person? A blue-collar Italian-American kid from Long Island, Scaramucci hustled and bustled his way into the East Coast elite by way of Harvard Law (where he was a contemporary of Barack Obama) and Goldman Sachs, before starting his own investment firm, SkyBridge Capital. Along the way, he crossed paths with Trump, another quintessential “New Yawker”, and the pair had known each other for two decades before the 2016 election. “You can never say that you’re friends with Donald Trump because then you’re overstating the relationship. You’re an acquaintance. It’s quite transactional,” the twice-married father of five says. Scaramucci describes himself as a lifelong Republican with a lower-case “r” (he believes in things like same-sex marriage and women’s reproductive rights, and is envious of Australia’s gun control regime).\n\nAdvertisement\n\nTruth be told, the Mooch had been a little politically flirtatious, supporting Obama in 2008, Republican Mitt Romney in 2012, and working on the doomed campaign of Republican frontrunner Jeb Bush in the 2016 primaries. When Bush dropped out, Scaramucci joined the Trump campaign. “I made a decision to go work for Donald Trump, which was a combination of ego-based decision-making and moral equivocation,” Scaramucci says. Michael Douglas as Gordon Gecko in Wall Street: Money Never Sleeps. The Mooch had a brief cameo in the 2010 movie. It was, the Mooch says, a big mistake. But it’s a mistake that has made him famous. Trump’s celebrity is radioactive. The MAGA-verse is full of people who owe money, power and influence to their decision to kiss the presidential ass. Similarly, there is a thriving cottage industry of Republican rebels, whose excoriating of their old party, coupled with insider-ish commentary on the Trump circus, has found a vast audience among liberal types equal parts fascinated and repulsed by the binfire in the Oval Office. Legend has it that Scaramucci once paid $US100,000 for a brief cameo in Oliver Stone’s Wall Street: Money Never Sleeps. Trump has given the Mooch far more fame than 15 seconds in a middling 2010 sequel ever could.\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/how-your-income-compares-australia/tm3jek6z5",
        "title": "How does your income compare? What Australians earned in a $1.3 trillion year",
        "publish_date": "Tue, 18 Nov 2025 00:18:39 +0000",
        "category": "finance",
        "authors": [],
        "text": "Workers in the mining industry enjoy the highest median employment income while those in the accommodation and food industries have the lowest, according to new Australian Bureau of Statistics (ABS) data\n\n\n\n\n\nThe ABS' latest personal income figures, released on Friday, show the median annual income in mining was $149,362, followed by electricity, gas, water and waste services at $105,158.\n\n\n\n\n\nAccommodation and food services had the lowest median employment income at $22,270 per year and arts and recreation services at $37,057.\n\n\n\nWhere are Australians getting their incomes from?\n\nThe data, which draws on incomes from the 2022-23 financial year, showed total personal pre-tax income across the country was $1.3 trillion.\n\n\n\n\n\nWhile employment was the main source of income for most Australians, more people are getting income from investments. Almost 12 per cent of the population is earning investment income, up from 11 per cent in the 2021-22 financial year.\n\n\n\nHowever, fewer people are getting income from their own businesses — it's dropped from 6.7 per cent to 6.5 per cent.\n\n\n\nWhich Australian states have the highest median income?\n\nWorkers in the Australian Capital Territory have the highest median total income at $75,643, followed by the Northern Territory at $66,831 and Western Australia at $62,207.\n\n\n\n\n\nIt was the lowest in Tasmania at $53,479.\n\n\n\n\n\nThe national personal median income was $58,216.\n\n\n\nSource: SBS News The highest income inequality was recorded in Cottesloe, Perth, where 84 per cent of the income was received by the top 10 per cent of earners. The median income in Cottesloe was $83,861.\n\n\n\n\n\nThis was followed by Walgett in northern NSW (45 per cent of income received by top 10 per cent of earners) and Flinders in north-west Queensland (37 per cent of income received by top 10 per cent of earners).\n\n\n\n\n\nThe median income in Walgett in 2022-23 was $43,197 a year, and in Flinders $56,165 a year.\n\n\n\nMen enjoy higher median incomes across the board\n\nMiddle-aged Australians (aged 45-54) received the highest median total income at $80,926, followed by those aged 35-44 years at $77,912.\n\n\n\n\n\nYounger Australians — aged 24 years and under — had the lowest at $23,840.\n\n\n\n\n\nIn every age group, men enjoyed higher median incomes compared with women.\n\n\n\nIn the 35-44 years age range, for example, men earned a median income of $92,266 a year compared with $64,602 for women.\n\n\n\n\n\nIn the 45 to 54 years age range, it was $95,400 for men and $68,570 for women.\n\n\n\nMigrants to Australia received over $300 billion in income\n\nAustralia's 4.4 million migrants, both temporary and permanent, generated $324.7 billion in total personal income.\n\n\n\n\n\nAlmost half of that income — $153.4 billion— was received by 1.6 million skilled migrants.\n\n\n\n\n\nThose on humanitarian visas received $8.6 billion in income.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/person-dies-after-triple-zero-call-fails-to-connect-tpg-telecom-says/ljqb2vk2j",
        "title": "Person dies after triple-zero call failure, TPG confirms, sparking investigation",
        "publish_date": "Mon, 17 Nov 2025 23:08:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "The federal government has said it will investigate mobile network company TPG Telecom following the death of a person after a customer's phone failed to make a triple-zero call.\n\n\n\n\n\nThe person died on 13 November, with a statement from TPG Telecom indicating the call failure was due to outdated software on the phone.\n\n\n\n\n\nCommunications Minister Anika Wells said it was a \"tragic situation that will be investigated\".\n\n\n\n\n\n\"My thoughts are with the family and loved ones of the person who has died,\" she said in a statement.\n\n\n\n\n\n\"TPG's compliance with the Emergency Call Service Determination will be rigorously assessed by [Australian Communications and Media Authority] ACMA.\"\n\n\n\nThe incident comes just two months after a 10-hour Optus triple-zero outage was linked to four deaths, sparking a parliamentary inquiry into the company.\n\n\n\n\n\nTPG Telecom said it was informed of the incident by NSW Ambulance on Monday.\n\n\n\n\n\nThe telco said the failure was not due to a network outage, but part of a recently discovered Lebara software issue affecting older devices.\n\n\n\n\n\n\"Early investigations indicate that the failed calls were due to the customer's Samsung device operating on software that was not compatible with making Triple Zero calls on the network,\" the company said in a statement.\n\n\n\n\n\n\"Samsung recently identified that certain older devices required a software update to enable Triple Zero functionality on TPG Telecom's mobile network.\"\n\n\n\n\n\nIt has recommended customers to \"urgently update affected devices\".\n\n\n\n\"Handsets not updated are blocked after a period of 2,835 days from the first contact to the customer, as required under new regulations,\" the telco said.\n\n\n\n\n\n\"The most recent communications to customers with impacted devices was sent on 7 November. These updates are critical to ensure compatibility with emergency services and to protect customer safety.\"\n\n\n\n\n\nTPG Telecom's managing director and CEO, Iñaki Berroeta, also urged all customers with outdated software to replace or update their devices.\n\n\n\n\n\n\"Customer safety remains our highest priority,\" Berroeta said in a statement.\n\n\n\n\n\n\"This is a tragic incident, and our condolences and thoughts are with the individual's family and loved ones.\n\n\n\n\n\n\"We urge all customers with outdated software to replace or update their devices without delay to ensure they can reach Triple Zero in an emergency.\"\n\n\n\nPrevious testing by Telstra found more than 70 older model Samsung handsets weren't connecting correctly to the emergency number.\n\n\n\n\n\nTelstra advised that 11 models would need to be completely replaced, while the rest required immediate software updates to resolve the issue.\n\n\n\n\n\nIt's believed up to 10,000 devices might be affected.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/uk-overhaul-of-asylum-system-slashes-key-protections-for-refugees/rhpwjwnvd",
        "title": "UK's planned overhaul of asylum system slashes key protections for refugees",
        "publish_date": "Mon, 17 Nov 2025 20:00:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "The United Kingdom government has announced sweeping changes to its asylum system, including drastically cutting protections for refugees and threatening visa bans for countries that refuse to take back irregular immigrants.\n\n\n\n\n\nUK home secretary Shabana Mahmood said on Tuesday she hopes the reforms, modelled on Denmark's strict asylum system, will discourage migrants from crossing the Channel from France on small boats.\n\n\n\n\n\nRefugee status will become temporary and will be reviewed every 30 months.\n\n\n\n\n\nRefugees will be forced to return to their home countries once those are deemed safe.\n\n\n\n\n\nThey will also need to wait for 20 years, instead of the current five, before they can apply for permanent residency.\n\n\n\nREAD MORE UK Labour strips asylum seeker rights amid surging support for Nigel Farage's Reform party\n\n\"We are obliged to offer sanctuary to those who would be in danger if they returned to their country of origin. However, should the regime change in their home country, our approach should change too,\" the government said in a statement on Tuesday.\n\n\n\n\n\nBut charities and politicians from Prime Minister Keir Starmer's Labour party slammed the plans, arguing that it could result in uprooting refugees who settle in Britain.\n\n\n\n\n\nTony Vaughan, a Labour politician and senior lawyer, was one of the first to publicly criticise the proposals, adding the rhetoric would encourage \"the same culture of divisiveness that sees racism and abuse growing in our communities\".\n\n\n\n\n\nIn the year to the end of March, 109,343 people claimed asylum in Britain, up 17 per cent on the previous 12 months. Still, fewer people claim asylum in Britain than in its European Union peers France, Germany, Italy or Spain. Most migrants arrive legally.\n\n\n\n\n\nThe government said children as well as adults could also be forcibly removed under the new measures and that it would launch a consultation on the subject.\n\n\n\nAsylum seeker support\n\nThe government said it will end a legal duty to provide support to asylum seekers and refugees who face destitution if they have the means to support themselves or if they break the law.\n\n\n\n\n\nMore than 39,000 people, many fleeing conflict, have arrived on small boats this year — more than for the whole of 2024 but lower than the record set in 2022, when the Conservatives were in power.\n\n\n\n\n\nAs of March 2025, over 106,000 asylum seekers received government support.\n\n\n\nFewer people claim asylum in Britain than in its European Union peers France, Germany, Italy or Spain. Most migrants arrive legally. Source: Getty / Dan Kitwood Home Office minister Alex Norris denied media reports that asylum seekers could have their jewellery confiscated to fund their stays.\n\n\n\n\n\nThe government has also said it will legislate to make it harder for irregular migrants and foreign criminals to use the European Convention on Human Rights (ECHR) to stop deportation.\n\n\n\n\n\nUnder the proposals, the government wants to change the interpretation of Article 8 of the ECHR, governing the right to a family life. It would make clear that a family connection means immediate family, such as a parent or child, preventing people from \"using dubious connections to stay in the UK\".\n\n\n\n\n\nIt added that Britain would also work with like-minded countries to review the application of Article 3, which prohibits torture. It argued that the \"definition of 'inhuman and degrading treatment' has expanded beyond what is reasonable\", making it too easy to challenge deportations.\n\n\n\n\n\nThe government also said it would take a \"far more hard-headed approach\" to removing people, including families, who had their claim for asylum refused.\n\n\n\nVisa bans\n\nEchoing United States President Donald Trump's travel bans restricting nationals from certain countries, the interior ministry threatened to stop granting visas to nationals from Angola, Namibia and the Democratic Republic of Congo unless the countries accepted the returns of \"their criminals and illegal immigrants\".\n\n\n\n\n\nNorris told the UK's Sky News the countries had \"one month to get this in order\", adding there were around 4,000 nationals who could be deported.\n\n\n\n\n\nOther countries could be targeted, including with an \"emergency brake\" on visas for people from countries with high rates of asylum claims, who travel to the UK by legal routes.\n\n\n\n\n\nAsylum claims in Britain are at a record high, with around 111,000 applications made in the year to June 2025, according to official figures.\n\n\n\n\n\nBut the number of initial positive decisions the UK authorities granted fell from 2023 to 2024.\n\n\n\nReactions\n\nThe tougher stance has been seen as an attempt to claw back support from the hard-right Reform UK party, which has surged in popularity on the back of public anger over immigration.\n\n\n\n\n\nReform's firebrand leader Nigel Farage celebrated the announcements, saying Mahmood \"sounds like a Reform supporter\".\n\n\n\nReform UK leader said UK home secretary Shabana Mahmood \"sounds like a Reform supporter\" over the proposed changes. Source: AAP / PA / Stefan Rousseau Kemi Badenoch, leader of the centre-right opposition Conservatives, said the proposed measures were \"steps in the right direction\" but did not go far enough.\n\n\n\n\n\nEnver Solomon, chief executive of the Refugee Council, urged the government to reconsider, warning the plans \"will not deter\" crossings and refugees who work hard should be able to build \"secure, settled lives\".\n\n\n\n\n\nSile Reynolds, head of asylum advocacy at Freedom from Torture, said the rules would \"punish people who've already lost everything\", adding this is \"not who we are as a country\".\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-sbs-talks-to-kaveh-madani-on-tehrans-water-crisis/qamlv6is5",
        "title": "INTERVIEW: SBS talks to Kaveh Madani on Tehran's water crisis",
        "publish_date": "Mon, 17 Nov 2025 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-quiet-rush-to-hide-gold-safely-away/kd41rhi9c",
        "title": "'Safer than obscure corners of the house': The hidden side to Australia's gold rush",
        "publish_date": "Mon, 17 Nov 2025 18:40:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Gold fever has gripped Australia in recent times, with scenes of queues outside stores as some, banking on continued momentum, bought up while others looked to liquidate amid the record prices.\n\n\n\n\n\nBut for others like Ekjot Kaur, gold isn't about chasing the market — it's about safeguarding what matters.\n\n\n\n\n\nKaur is quietly packing her jewellery — a collection of gold bangles, a necklace and a few small keepsakes gifted by her parents at her wedding — into a parcel bound for \"home\".\n\n\n\n\n\nShe isn't packing it for selling or gifting. She is sending it back to India because she no longer feels confident storing it at her home in south-east Melbourne.\n\n\n\n\n\nAfter hearing stories of burglaries circulating through community WhatsApp groups and watching gold prices climb, the 27-year-old said the anxiety became too much.\n\n\n\n\n\n\"It's not just fear,\" she told SBS News.\n\n\n\n\n\n\"It's the weariness of imagining what could happen every time I leave the house. I don't want to worry about losing a piece of my family's history. I'd rather it sit safely with my parents, where it belongs, than lose it forever.\"\n\n\n\nMelbourne-based jeweller Harshudeep Singh said many of his customers continue the practice of storing their jewellery in bank lockers or family homes in India, even though they buy it in Australia. Source: Supplied According to a Melbourne-based jeweller, Harshudeep Singh, Kaur reflects an existing practice among Indian Australian families.\n\n\n\n\n\nHe said many of his clients have long been sending gold jewellery to India, often through trusted relatives or friends, a trend that he said has been further driven by an increase in thefts and burglaries in Victoria.\n\n\n\n\n\n\"People aren't liquidating — they're safeguarding,\" he told SBS News.\n\n\n\n\n\n\"They see their family vault in India as safer than stowing away gold in obscure corners of the house. Even if they purchase here or in India, they prefer to keep that jewellery with their parents in India.\n\n\n\n\n\n\"And this trend is not limited to Australia. It's the same story everywhere for migrant families, be it in the United Kingdom or Canada.\"\n\n\n\n\n\nWith working parents and school-going children leaving some homes unoccupied for most of the day, a family vault in India — guarded by relatives — is often viewed as more secure than a home safe in Australia.\n\n\n\nGold as culture, not commodity\n\nThe price of gold has surged in recent times , driven by inflation and geopolitical tensions. Although that growth has since cooled somewhat , prices remain well above levels seen at the start of the year — prompting some people to rethink where they store their valuable assets\n\n\n\n\n\nThe yellow metal has always held deep significance in Indian families — gifted at weddings, inherited by daughters, and stored as a safety net for hard times. Even abroad, those traditions endure.\n\n\n\n\n\nMeena Chavan, an economic anthropologist and associate professor of international business and entrepreneurship at Macquarie Business School, said for Indian Australian families, gold isn't just a financial asset, it's an emotional and cultural inheritance that \"embodies stability, heritage, and belonging\".\n\n\n\n\n\n\"India consistently ranks as one of the world's largest gold consumers, responsible for around 25 per cent of global demand. This is primarily driven by a love for gold jewellery, which is an essential part of Indian weddings, festivals, and religious ceremonies,\" she told SBS News.\n\n\n\n\n\nShe said for some, sending gold \"home\" is about more than economics.\n\n\n\n\n\n\"It reflects deep trust in family networks and cultural continuity. It's not only about financial security but emotional security, anchoring wealth within family ties and the social fabric of the homeland. For many, it represents confidence in kinship rather than in formal systems,\" Chavan said.\n\n\n\nREAD MORE Australian families could be sitting on a goldmine, but many are torn about selling\n\nBut for others, there can be a darker side when it comes to gold.\n\n\n\n\n\nSupriya Singh is an adjunct professor at the Department of Social Inquiry at La Trobe University and a founding member of the Multicultural Women's Alliance Against Family Violence.\n\n\n\n\n\nShe said for some families, the jewellery that represents security and heritage can quietly become a means of exerting power over them.\n\n\n\n\n\n\"In my research on family violence among Indian women in Australia, a sign of economic abuse is that the woman's gold is taken away by the husband or his family,\" Singh told SBS News.\n\n\n\n\n\n\"Often she is told the gold will be kept safely in her mother-in-law's or brother-in-law's safe-deposit locker, to which the woman has no access.\n\n\n\n\n\n\"Women also tell that the husband stole her jewellery as he left home because of an intervention order. Getting the jewellery back is nearly always impossible. The woman not only loses in terms of wealth, but also loses jewellery which has been handed down her mother's line for generations.\"\n\n\n\nJewellery theft\n\nAccording to the latest Crime Statistics Agency Victoria (CSA) data, jewellery remains the second-highest priority target for thieves in Victoria, led only by cash.\n\n\n\n\n\nBetween March 2024 and 2025, nearly $29 million worth of jewellery was reported stolen from Victorian properties. The hardest-hit area was Boroondara in Melbourne's inner-east, with $3.3 million stolen, followed by nearby suburbs such as Hawthorn, Balwyn North, and Kew.\n\n\n\nNearly $29 million worth of jewellery was reported stolen from Victorian properties in the year to June 2025, according to data from the Victorian Crime Statistics Agency. Source: SBS News CSA data shows there were 30,545 burglaries of Victorian homes in the year to June 2025, up 13.9 per cent from 26,812 the previous year.\n\n\n\n\n\nA Victoria Police spokesperson told the Herald Sun in July that simple security measures could prevent most burglaries.\n\n\n\n\n\n\"Since the start of the year, around 65 per cent of all aggravated home burglaries in key hotspots have either been due to unlocked doors/windows, or an unsuccessful attempt when the offender realised the home was locked,\" the spokesperson said.\n\n\n\n\n\nMore than $55 million worth of jewellery was stolen from Victorian homes in 2017, but CSA data shows the figure has declined steadily since — although valuables of this kind remain a consistent target.\n\n\n\n\n\nSimreet Thukral, a Melbourne resident, had $8,000 worth of gold jewellery stolen from her home while on a trip to Adelaide in 2018.\n\n\n\n\n\n\"Some of it was heirloom, passed down through generations,\" she told SBS News.\n\n\n\nMelburnian Simreet Thukral had gold and diamond jewellery worth $8,000 stolen from her former home in Noble Park in south-east Melbourne when she went on a trip to Adelaide. Source: Supplied Despite filing a police report, the pieces were never recovered.\n\n\n\n\n\n\"The emotional loss was heavier than the monetary one. It's terrifying to think our most precious possessions could just vanish,\" Thukral said.\n\n\n\n\n\nWhile stories like Thukral's are prompting some people to reconsider where they store gold, not all Indian Australian families want their jewellery stored an ocean away.\n\n\n\n\n\nSydney resident Sanil (who requested his last name be withheld) said he doesn't identify with the concept of sending or storing gold in India. The 38-year-old said he would rather invest in a private vault and upgrade his home security.\n\n\n\n\n\nFor him, the question is simple: what's the point of owning jewellery you can't wear?\n\n\n\n\n\n\"We'd rather secure it here than send it somewhere we can't access it for weddings, festivals, or celebrations,\" he told SBS News. \"Gold is meant to be worn, not hidden or stored for posterity.\"\n\n\n\n\n\nCoburg-based jeweller Harshudeep Singh said moving gold across borders also requires attention to customs duties and declaration rules, particularly for larger quantities.\n\n\n\n\n\n\"When you send jewellery to India through courier companies or similar means, you will have to pay taxes and duties, which is quite a costly affair,\" he said.\n\n\n\nEkjot Kaur said sending her gold jewellery to her family in India is about protecting a tangible connection to her roots and cultural heritage. Source: Supplied But for some, like Kaur, the reassurance of family custody outweighs the logistical hurdles. She said sending her gold home isn't about distrusting Australia — it is about protecting a tangible connection to her family and her roots.\n\n\n\n\n\n\"My jewellery is more than wealth. It's memory, it's love, it's the story of who we are. Losing it would feel like losing a part of myself,\" she said.\n\n\n\n\n\n\"Distance makes me feel safer.\"\n\n\n\nFinancial and regulatory considerations\n\nAccording to Chavan, the mindset reflects more than security concerns.\n\n\n\n\n\n\"This is part of a broader pattern of diaspora wealth management where emotional and financial rationalities intertwine. First-generation migrants often maintain assets in both countries, while younger generations tend to be more globally diversified, treating wealth less as tradition and more as a strategy,\" she said.\n\n\n\n\n\nIndia allows limited quantities of gold to be brought in duty-free, but tighter reporting rules mean families prefer small, discreet transfers rather than large shipments.\n\n\n\nProfessor Santosh Jatrana (not pictured) from the Deakin Institute for Citizenship and Globalisation said factors such as the cost of storage and insurance can play a major role in the decision to transfer gold within migrant communities. Credit: Hindustan Times via Getty Images Professor Santosh Jatrana from the Deakin Institute for Citizenship and Globalisation said policy factors also play a major role in the decisions related to the transfer of gold within migrant communities.\n\n\n\n\n\n\"In Australia, the limited availability of bank safe-deposit services and high fees for private vaults make secure storage both costly and inconvenient,\" she told SBS News.\n\n\n\n\n\n\"For instance, annual locker rent in India ranges from about 1,500 rupees to 12,000 rupees, depending on size, location and the bank, which works out to roughly $26 to $207 each year — a sum many find affordable.\"\n\n\n\n\n\nJatrana said insurance policies could also affect these decisions.\n\n\n\n\n\n\"A standard home insurance provides minimal coverage for high-value jewellery unless each item is specifically listed and valued, making overseas safekeeping comparatively easier.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/new-report-measures-the-real-cost-of-childhood-poverty/xqqidn4xh",
        "title": "New report measures the real cost of childhood poverty",
        "publish_date": "Mon, 17 Nov 2025 08:32:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "New report measures the real cost of childhood poverty\n\nPublished 17 November 2025, 8:10 am\n\nNearly a quarter of a million children have fallen into poverty in just four years —a staggering 33 per cent surge — that has advocates urging the Federal Government to legislate how we define and measure its impact on childhood wellbeing. The figures released in a new report found that soaring living costs and a tight housing market are pushing families to the brink, while wages and financial support have failed to keep pace.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/new-ai-technology-in-remote-wa-helps-early-detection-of-diabetes-related-eye-disease/99sar52ux",
        "title": "New AI technology in remote WA helps early detection of diabetes related eye disease",
        "publish_date": "Mon, 17 Nov 2025 08:16:27 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/ley-confident-retains-liberal-support-leadership-speculation/owasmf1iq",
        "title": "Ley confident she retains Liberal party room support amid leadership speculation",
        "publish_date": "Mon, 17 Nov 2025 08:11:09 +0000",
        "category": "finance",
        "authors": [],
        "text": "Sussan Ley has told SBS News she is confident she has the numbers to remain as leader of the Opposition.\n\n\n\n\n\nWhen asked directly in an interview with SBS News about her ability to command a majority inside the Liberal party room Ley said: \"Yes\".\n\n\n\n\n\nShe went on to say the deal between the Liberals and Nationals to dump net zero and settle on a new energy policy was evidence of support for her leadership.\n\n\n\n\n\n\"The support that we all gave to this plan just yesterday was a demonstration of our unity of purpose when it comes to something that is vital for every single Australian, energy is the economy.\"\n\n\n\n\n\nKey Ley supporters, moderates Anne Ruston and Maria Kovacic, on Monday disputed media reports suggesting slippage in support for Ley among members of her faction.\n\n\n\nThe Australian newspaper had reported growing momentum among conservative and moderate MPs to pull support from Ley and back conservative Andrew Hastie, who quit the Coalition frontbench last month.\n\n\n\n\n\n\"Media reports this morning about the moderates are incorrect. We, along with an overwhelming majority of our moderate colleagues, continue to strongly support Sussan's leadership,\" a joint statement from Ruston and Kovacic said.\n\n\n\n\n\n\"This matter was resolved in the party room six months ago and Sussan will lead us strongly to the next election.\"\n\n\n\n\n\nBut Ley’s decision to align with The Nationals, ditch net zero and leave the door open to future taxpayer investment in coal-fired power stations has led to rumblings among some moderates about her future.\n\n\n\n\n\nAsked if she retains the support of other members of her party room, Ley told SBS News she declined to respond to \"commentary about commentary\".\n\n\n\n\"I'm just not going to be distracted for one single moment from my sole focus, which is talking to Australians about the need for affordable energy,\" she said.\n\n\n\n\n\n\"Whatever happens inside the Canberra bubble in the commentary and speculation of some reports ... I just don't focus on that.\"\n\n\n\n\n\nLey was elected Opposition leader with 29 votes, but 25 members of her party room voted against her.\n\n\n\n\n\nAfter she secured the top job, conservative leadership aspirants appeared unlikely to challenge in the short term, particularly given she was elevated as the first woman to lead the party.\n\n\n\n\n\nThe Liberal party room gathered in Canberra for the net zero debate last week and there was no challenge then either.\n\n\n\nLey '100 per cent committed' to ditching net zero\n\nLey and National Party leader David Littleproud unveiled the Coalition’s climate and energy policy on Sunday following joint party room talks, touting a platform that prioritises \"affordable energy and responsible emissions reduction\".\n\n\n\n\n\nAmid mounting internal pressure over emissions reduction targets and swirling questions over Ley’s grip on the leadership, the Liberal Party followed its junior Coalition partner last week in dropping its commitment to net zero by 2050.\n\n\n\n\n\nThe Liberals instead propose backing coal and gas projects with the aim of bringing down power bills.\n\n\n\n\n\nAt the same time, the party says it will pursue year-on-year emissions reductions, but will scrap Labor’s legislated targets.\n\n\n\nAsked if she personally supports ditching net zero in its entirety, Ley told SBS News she was: \"100 per cent committed to the plan that I'm talking about today that was signed off by our entire party room and indeed, the whole Opposition yesterday\".\n\n\n\n\n\nAnthony Albanese has described the Opposition’s posture on climate and energy as a step backwards.\n\n\n\n\n\nSpeaking to reporters on Monday, the prime minister described the new policy as \"friendless\" and \"nonsensical\".\n\n\n\n\n\n\"They say that they want to stay in [the Paris agreement], but Paris is about the road to net zero, and you can’t backslide.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/uk-cuts-asylum-seeker-rights-in-major-overhaul/il4723ly1",
        "title": "UK cuts asylum seeker rights in major overhaul",
        "publish_date": "Mon, 17 Nov 2025 08:05:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\n\nFor months, there have been protests and rallies, demonstrating against asylum seekers in Britain.\n\n\n\n\n\nMore than 109,000 people claimed asylum in the UK in the year ending March 2025, a 17 per cent rise on the previous year and six per cent above the 2002 peak [[of 103,081]].\n\n\n\n\n\nNow, sweeping changes have been announced to Britain's controversial asylum system as polls show immigration has overtaken the economy as voters' top concern.\n\n\n\n\n\nInterior Minister Shabana Mahmood told the BBC the government was tackling a critical issue.\n\n\n\n\n\n\"It is important that we deal with illegal migration into this country. It is an issue that is dividing our country, and I see this polarisation all over the country, including in my own constituency. We have a system that is out of control, it's unfair and is putting huge pressure on communities.\"\n\n\n\n\n\nThe Home Office says the statutory duty to provide housing support and allowances to certain asylum seekers will be revoked, refugee status will become temporary and subject to regular review, and those granted asylum will have to wait 20 years before even being able to apply for permanency.\n\n\n\n\n\nShabana Mahmood again.\n\n\n\n\n\n\"What the new reforms will do is change that generations-old assumption that sanctuary provided to refugees can very quickly lead to permanent settlement and all of the rights that go alongside that. We will be changing that to a more temporary process, and the situation will be assessed every two and a half years. So if your country becomes safe in that intervening period and you are remaining on this essentially core protection model, you will be returned to your country.\"\n\n\n\n\n\nShe also says there will be new routes for asylum seekers to be able to work while in the U-K.\n\n\n\n\n\n\"If you are working and contributing, you will be able to earn an earlier settlement in this country and the totality of that package will promote fairness and contribution.\"\n\n\n\n\n\nThe formal announcement has not taken anyone by surprise.\n\n\n\n\n\nEarlier this year, a delegation of senior Home Office officials visited Copenhagen to study Denmark's approach to asylum, where migrants are only granted temporary residence permits, usually for two years, and must reapply when these expire.\n\n\n\n\n\nSince coming to power in 2019, Prime Minister Mette Frederiksen has pursued a \"zero refugee\" policy.\n\n\n\n\n\nThe Home Office says the approach has reduced asylum claims to a 40-year low and resulted in the removal of 95 per cent of rejected applicants.\n\n\n\n\n\nJust 860 asylum requests were granted last year.\n\n\n\n\n\nThe decline in Denmark comes as the European Union is preparing plans on how they will implement overhauled rules for asylum seekers to be operational in mid-2026.\n\n\n\n\n\nBack in Britain, Shabana Mahmood says the new policy is not about turning away people who need help.\n\n\n\n\n\n\"We still believe very strongly, and I believe that we must provide sanctuary (to) those who are fleeing wars and danger and conflict abroad. We still want to be a country that does that. But at the moment, our system is particularly generous compared to other countries in Europe, where after five years, you'll be automatically settled in this country, we will change that.\"\n\n\n\n\n\nThe Labour government has been hardening its immigration policies as it seeks to stem the surging popularity of the populist Reform UK party, which has driven the immigration agenda and forced Labour to adopt a tougher line.\n\n\n\n\n\nWhile some government MPs have welcomed the changes, others have privately expressed concerns the policy could create division in the community and push Labour voters towards the Greens.\n\n\n\n\n\nThe opposition Conservative Party is calling for the reforms to go further, as Shadow Home Secretary Chris Philp told the BBC.\n\n\n\n\n\n\"I don't think these proposals are radical enough at all. Legal and illegal immigration is in danger of breaking Britain. We need radical solutions to that, including coming out of the ECHR so we can then deport every single illegal arrival within a week of their feet touching the shore. Stop paying benefits to foreign citizens and making sure the people who come here illegally can't claim asylum at all.\"\n\n\n\n\n\nThe government says the changes are designed to reduce the so-called \"pull factors\" by making Britain less attractive to would-be asylum seekers.\n\n\n\n\n\nBut advocates are horrified.\n\n\n\n\n\nChief Executive of Britain's Refugee Council Enver Solomon told the BBC the plan would fail.\n\n\n\n\n\n\"This policy will not stop the boats, it will not deter people. Refugees flee for their lives, and they go to countries where they may know people, family, they can speak the language or because of historical connections. So this policy will fall flat on its face.\"\n\n\n\n\n\nMore than 100 British charities have written to the Home Secretary, urging her to end what they've called the scapegoating of migrants and performative policies that only cause harm.\n\n\n\n\n\nAnti-immigration sentiment has been growing in the UK, with recent protests taking place outside hotels sheltering asylum seekers with state funding.\n\n\n\n\n\nTheir letter says such steps are only fuelling racism and violence.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-goes-one-on-one-with-federal-opposition-leader-sussan-ley/4fi9gxm9m",
        "title": "SBS News goes one on one with Federal Opposition Leader Sussan Ley",
        "publish_date": "Mon, 17 Nov 2025 07:42:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/child-poverty-australian-children-future/c2lpnm276",
        "title": "'Gets under the skin': The disadvantage shaping the future of 950,000 Australian kids",
        "publish_date": "Mon, 17 Nov 2025 07:19:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Faiq Alyasare knows all too well the impact Australia's rising cost of living is having on the country’s children.\n\n\n\n\n\nAlyasare, who moved to Perth from Iraq more than 25 years ago, is married with four kids between the ages of three and 14.\n\n\n\n\n\nAs the sole income earner, the 50-year-old fly-in fly-out worker told SBS News he pushes himself to work as much as possible throughout the year, putting his hand up for extra weeks and avoiding taking sick days.\n\n\n\n\n\nEven then, he says it's become increasingly difficult to afford the basics, and stretching every dollar on essentials like rent and bills leaves little left over.\n\n\n\n\n\nHe remembers being able to pay $50 to fill up a supermarket trolley with all the groceries he needed.\n\n\n\n\"You go now, $50 isn't enough for one small bag,\" he said.\n\n\n\n\n\nThen there are costs such as clothing for his children. \"Kids are always asking.\"\n\n\n\nClose to 1 million Australian children living in poverty\n\nOther families are also doing it tough. Data released by the Bankwest Curtin Economics Centre and the Valuing Children Initiative on Monday found 950,000 children will live in poverty in 2025 — more than 15 per cent of all kids in Australia. That's up from 713,000 four years ago.\n\n\n\n\n\nThe data, based on information provided by the Household, Income and Labour Dynamics in Australia survey, found the child poverty rate had spiked 33 per cent in four years.\n\n\n\n\n\nChild poverty is when a child lives in a household with a disposable income of less than 50 per cent of the national median income.\n\n\n\n\n\nAccording to the Australian Bureau of Statistics, the median personal income in Australia for the 2022-23 financial year was $58,216.\n\n\n\n\n\nAdvocates say the report shows that when Australia's families struggle with costs, children often pay the price — and that has serious consequences for the future.\n\n\n\n\n\nCurtin economics professor Alan Duncan said the rise in child poverty was not a statistical anomaly but \"the predictable result of housing stress, inadequate income support, and policy drift\".\n\n\n\n\n\n\"Without meaningful intervention, Australia risks crossing the one-million-child threshold within months.\"\n\n\n\nRising rents a big factor\n\nDuncan said skyrocketing rents were a major factor in the surge in poverty, with the median advertised rent for units rising 40 per cent in Sydney, 34 per cent in Melbourne and 41 per cent in Brisbane between 2021 and 2023.\n\n\n\n\n\nThe country's west coast hasn't been immune either. Alyasare said that two years ago, he paid $500 a week in rent. Today, it’s $800 a week.\n\n\n\n\n\nThe median rental price for a house in Perth is $850 a week, according to REA Group, rising 9.7 per cent in the past 12 months. The median rental price for a unit is $695, up 6.9 per cent in the past 12 months.\n\n\n\n\n\nAlyasare's lease is set to end in the next six months. He says if his landlord tries to increase the rent, he won’t be able to refuse, because he can't risk returning to the rental market and looking for another house.\n\n\n\nIn the wake of the report, the End Child Poverty campaign has called for a \"child-centred\" definition of poverty and a method of measuring how poverty affects young people's wellbeing that is nationally agreed upon.\n\n\n\n\n\nCampaign lead Sarah Quinton said poverty left children increasingly isolated, at a time when they should be developing important connections.\n\n\n\n\n\nThe report has also called for increases to relief payments and action to fix the structural causes of housing unaffordability.\n\n\n\n\n\nFor Alyasare, the cost of living has meant being unable to afford activities and programs that he knows would be beneficial for his kids.\n\n\n\n\n\n\"For my son, I couldn't put him in the soccer team this year,\" he said. \"I took him off the team for this year and said: 'Let's see next year.'\"\n\n\n\nFaiq Alyasare could not afford the costs for his son's football team this year. Source: SBS News / Christopher Tan Larissa Muir is the CEO of 12 Buckets, a Perth-based charity that provides mentoring to students facing disadvantage.\n\n\n\n\n\n\"Children are sensitive to their environment,\" she said. \"Missing out on sport or excursions undermines their sense of belonging. These inequalities shape their future.\"\n\n\n\nLong-lasting impacts\n\nDuncan agreed that poverty had long-lasting impacts on a child's life.\n\n\n\n\n\n\"We find that poverty gets under the skin,\" he told SBS News. \"It's something you carry with you for a large part of your life.\"\n\n\n\n\n\nAlyasare worries about his children's future and how their potential may be damaged by not being able to afford the support they need to grow.\n\n\n\n\n\nHis son \"likes to play soccer, but if you don't get professional coaching … he'll never go high-level,\" he said. \"Maybe he's talented, but nobody knows until he starts training.\"\n\n\n\nSimilarly, Alyasare can't afford extra lessons outside school to further his son’s education. \"Maybe he's smart, bright, but he needs a push,\" Alyasare said.\n\n\n\n\n\n\"If he doesn't get help now to get a better future, that future is going to be downwards. And it will affect all society.\"\n\n\n\n\n\nA Department of Social Services spokesperson said \"all children in Australia deserve the best start to life\".\n\n\n\n\n\nThey said the Australian government is \"working to break the cycle of disadvantage, support people in need, and improve the wellbeing of families and children\", adding that the government had injected more than $11 billion in additional funding into the social security safety net in recent years.\n\n\n\n\n\n— With additional reporting by the Australian Associated Press.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/three-day-us-government-shutdown-ends-but-investors-still-nervous/5h0s17ups",
        "title": "Three day US government shutdown ends, but investors still nervous",
        "publish_date": "Mon, 17 Nov 2025 06:20:43 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/national/australia-news-live-ley-concedes-new-coal-fired-power-plants-highly-unlikely-miners-farmers-and-business-groups-plead-for-deal-on-environmental-laws-20251118-p5ng5f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Australia news LIVE: Wells says latest Triple Zero death will be fully investigated; UN approves Trump’s Gaza peace plan; Jess Wilson makes history as first female Victorian Liberal leader",
        "publish_date": "Tue, 18 Nov 2025 13:03:56 +1100",
        "category": "finance",
        "authors": [
            "Emily Kaine",
            "Angus Delaney"
        ],
        "text": "The Reserve Bank has signaled what it will take for official interest rates to fall further, with the jobs market and consumer spending the key swing factors.\n\nMinutes of the bank’s Melbourne Cup Day meeting, at which it left the cash rate at 3.6 per cent, released today show the discussion among bank board members about how interest rate settings could change.\n\nThere’s been a growing consensus the RBA will keep rates steady all through 2026. Commonwealth Bank boss Matt Comyn told a parliamentary hearing this morning he believed a rate cut next year was unlikely.\n\nThe RBA minutes showed board members argued there were situations where rates may need to be reduced.\n\nA material weakening of the jobs market is seen as one of the biggest risks, particularly if the private sector starts to struggle.\n\n“[Members] noted the risk that employment growth in the market sector remains soft, which could occur if the uncertain economic outlook reduces firms’ willingness to hire or if an emerging focus on cost-cutting results in lay-offs,” the minutes showed.\n\nA drop-off in the general economy, especially if shoppers become more cautious about their spending, would also put a rate cut back on the agenda.\n\nBut, the minutes showed, the bank believes rates could hold steady if the “emerging recovery in demand was stronger than expected” which would itself strengthen the jobs market.\n\nAnother risk would be if productivity growth proved weaker than expected. The RBA earlier this year reduced its long-term assumption for productivity growth.\n\nThe bank’s monetary policy committee meets once more this year, in early December, with financial markets putting the chance of a rate cut at just 7 per cent.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nfl/a-legendary-nfl-boss-says-afl-clubs-must-follow-these-eight-commandments-for-success-20251117-p5ng1o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A legendary NFL boss says AFL clubs must follow these eight commandments for success",
        "publish_date": "Tue, 18 Nov 2025 13:00:44 +1100",
        "category": "sports",
        "authors": [
            "Jake Niall"
        ],
        "text": "“I call that a prerequisite. I say that there’s a standard that these players with athletic traits...on whatever field, whatever sport you’re in. “Let’s call them A, B, C and D. If you’re E, you don’t help. Rams quarterback Matthew Stafford. Credit: AP “Once all the players, either are in A, B, C or D category, to me then it’s all intangibles. “So, if you’re an A athlete, but your intangibles are a C, they usually play to a B or a C.\n\n“Intangibles will help you either meet or exceed your expectation.” Stafford’s career was founded on intangibles, as with many quarterbacks. Players who didn’t fit in with teammates, weren’t team-first, were often shunted. “We’ve all been there, we’re like ‘I think we ought to kick those guys off the boat, they’re not helping us.’” In his office, Snead mentioned his friend, Sam Walker, whom the Los Angeles Rams employ as a consultant and who had recently been in Melbourne working with Brad Scott and Essendon on leadership. Zach Merrett and Andrew McGrath Credit: AFL Photos via Getty Images Last summer, Scott, Zach Merrett and Andy McGrath - Merrett’s probable successor as skipper - went to LA to meet with Walker, who specialises in the construction of team ethos and leadership.\n\nEssendon’s cultural issues, exemplified by Merrett’s attempted escape, seemed relevant to another commandment on the wall: “IMMERSE OUR PEOPLE IN THE RAMS WE THEN ME WAY.” “WE” was coloured yellow against blue for emphasis. Here were other striking observations from Snead which hold relevance to the AFL draft (and trading/free agency): 1. Why a gun player can slide in the draft Puka Nacua, a star wide receiver, was drafted at pick No 177, the fifth round of the 2023 draft. Snead said Pacua had been overlooked by all teams in the early rounds because he did not fit the prototype for his position - which was biased to speed.\n\nNacua, too, was injured in his final college year. “In the draft, let’s call it the higher you get... usually there’s a cleaner profile. That’s just the way the probabilities work. “His game is strength and power, probably bully ball - catch the ball and I’m now going to have to make you tackle me, and a lot of times that’s devalued in the draft. We’ve seen some of the players that fit that profile, they get devalued, because it’s a spacing game, speed, explosiveness. A young Sam Mitchell Credit: Peter Mathew “There was a strategy there. And we could probably get him a little later. Now based on all things considered we should have picked him earlier.” The AFL clubs will all be hoping, no matter the odds, of finding their version of Nacua (188 cm and 96 kilograms), who is his sport’s answer to Chris Grant, James Hird, Sam Mitchell, Tom Stewart and others who were bypassed early in the draft. The knock on Mitchell was that he was small and slow.\n\nLoading 2. Which are the hardest players to assess in the draft and why? A simple answer to this one from Snead: Quarterbacks. Why? “NFL’s the highest level of a video game... The game in college is different to the NFL and the quality is not as good....there’s more space. “In the NFL, there’s hardly any space... Can you, as that QB then, as things [happen], speed up?\n\nIn the AFL, the draft record suggests key forwards are harder to identify than midfielders. Key forwards - and some key backs - don’t necessarily replicate junior success in the AFL. Like quarterbacks, they face congestion in the big league. The Rams traded in Stafford, knowing he was a proven commodity, in the same way that the Swans acquired Curnow, and Tony Lockett, Barry Hall and Lance Franklin before him. When did Sydney last draft a quality key forward? “You cut out the risk when you trade for quarterback,” said Snead. Charlie Curnow as a Swan. Credit: Eddie Jim 3. Trading in mature players for draft picks when in the premiership window\n\nSnead follows a method similar to AFL clubs who believe you only give up draft capital when entering contention. One factor he mentioned is seldom raised in the AFL - that of the senior coach also being “in his prime”. The LA Rams win the Super Bowl in 2022. Credit: AP “In the year we won the Super Bowl … we had a lot of players in their prime. “So we used like some of our premium draft picks to make trades, to bring in other players in their prime.\n\n“That might not be the strategy if you’re not there yet.” Stafford was acquired from the Detroit Lions using that formula. “A lot of his teammates were in their prime, the head coach was in his prime. It was like, ‘OK, if we add a QB in his prime’, now you have, at least on paper, a more complete [team]. “If you’re not there and you’re getting there, you might be a little bit heavier [in the] draft.” 4. What to do once a team enters “no man’s land?” No man’s land, as defined by a senior AFL club official (to his board) was neither rebuilding, nor contending (nor the half-way house of “building”). Snead, when this was put to him, liked the concept and spoke as if he’d been in that predicament.\n\n“No man to me is you’ve got to tear it down first. Which is, ‘oh wow, we have to tear this thing down over two seasons.’ That ought to be fun and I’m sure the fans are going to have trust in us, right? Loading “Mine would be, if you’re in no man’s [land], you’ve got to tear it down. That may be you’re a team that’s older, right, and now how to do you move on... I call the rebuilding/building...or I call it remodelling.” Melbourne and Carlton, mired in no man’s land in 2025, would appear to have followed Snead’s formula, to an extent, by trading out Christian Petracca and Clayton Oliver and Charlie Curnow, as Tom De Koning walked as a free agent. Jake Niall travelled to LA as a guest of the Rams.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/the-age-good-food-guide-2026-best-places-to-eat-and-drink-in-geelong-and-the-surf-coast-20251118-p5ngaf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age Good Food Guide 2026: Best places to eat and drink in Geelong and the Surf Coast",
        "publish_date": "Tue, 18 Nov 2025 12:43:06 +1100",
        "category": "finance",
        "authors": [
            "Emily Holgate"
        ],
        "text": "Add articles to your saved list and come back to them anytime.\n\nFrom wine bars to bakeries, pub meals to cocktails, here’s how to spend a delicious few days in this rapidly changing region.\n\nThe best place to kick off a culinary journey of Geelong is Pakington Street – a lively stretch of boutiques, restaurants, Victorian-era architecture and cafes tucked down cobblestone alleys. Box Office is a vast warehouse-style space serving Axil coffee and brunch that goes heavy on native Australian ingredients. Hatted restaurant Tulip runs a refined snack-forward menu, while the front bar of the historic Petrel Hotel is alive with fans of well-executed pub dishes ordering hefty chicken schnitties lathered in garlic butter.\n\nChicken schnitzel with garlic butter at the Petrel Hotel. Duncan Jacob\n\nWhen it comes to morning pastries, there’s That Place in Belmont for viennoiserie by French-trained pastry chef Ashlea Allen, while the Local serves focaccia sangers, house-made pastries and Everyday coffee from a takeaway\n\nwindow near the CBD. That queue snaking down Pakington at the Newtown end?\n\nJoin it, immediately, and you’ll soon be in the sourdough haven that is Born and Bread (moving to a new location just down the road in January). You’ll want to loosen the purse strings as it’s tricky to choose a favourite, but chilli jam twists and custard-filled pecan buns are top contenders.\n\nCome Saturday evening, Geelong’s Little Malop Street pulses with energy. Get your hands dirty at Nashville-inspired bar The Hot Chicken Project, where spice levels range from mild to the blisteringly hot “evil”. Then, ascend the hidden staircase next door for a nightcap at 18th Amendment, a moody bar that nods to America’s prohibition years with cocktails named Bonnie and Clyde, and Thomas Edison.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/victorian-liberals-leadership-spill-live-brad-battin-set-to-be-challenged-by-jess-wilson-20251117-p5ng4l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Victorian Liberal leadership spill LIVE: Jess Wilson takes over state party as Brad Battin accepts defeat",
        "publish_date": "Tue, 18 Nov 2025 12:30:22 +1100",
        "category": "finance",
        "authors": [
            "Cassandra Morgan",
            "Rachel Eddie",
            "Chip Le Grand"
        ],
        "text": "Brad Battin gave members of the media the thumbs-up before today’s parliamentary sitting, which has spiralled into farcical scenes in the last few minutes.\n\nIn a clear attempt to stir the Coalition, more than a dozen Labor MPs attempted to give “motions by leave” aimed at the opposition, criticising them over their tax policies.\n\nBrad Battin gives the media the thumbs-up before the parliamentary sitting. Credit: Jason South\n\nUnder parliamentary rules, these statements can only be given without objections.\n\nThe opposition benches loudly yelled “no” every time an MP rose to speak.\n\nThis led to more than a dozen Labor MPs standing up, only to be shouted down with smiles on their faces. Point Cook MP Mathew Hilakari quipped they were the “No-alition”.\n\nSandringham MP Brad Rowswell fired back, saying the first three people to stand up and criticise the new female leader were male MPs.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/technology/tpg-customer-dies-after-failed-triple-zero-call-20251118-p5ng7j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "TPG says person dead after failed Triple Zero call",
        "publish_date": "Tue, 18 Nov 2025 12:26:29 +1100",
        "category": "finance",
        "authors": [
            "David Swan"
        ],
        "text": "Loading The Australian Communications and Media Authority (ACMA) said in a statement that it was “gathering information to establish the facts of the matter and will investigate to assess whether there has been any non-compliance with the Triple Zero rules. If any breaches are identified, appropriate enforcement action will be taken. “Public safety and reliable access to emergency services are of paramount importance. Under rules introduced in 2024, telecommunications providers must notify their customers where the provider identifies that the customer’s device may not be able to connect to Triple Zero and then take action to block those devices from their networks.” The tragedy comes just two months after three people died during a major Optus outage in mid-September, when more than 600 calls to Triple Zero emergency services failed to connect. That incident, which lasted more than 90 minutes, prompted a federal government inquiry and led to parliament fast-tracking new legislation to strengthen oversight of emergency calling services. The September Optus outage was the second major Triple Zero failure for the telco in two years. In November 2023, more than 2000 calls to emergency services failed to connect during a 12-hour national network outage, resulting in a $12 million fine from ACMA.\n\nThe incidents have shaken public confidence in Australia’s emergency services infrastructure and put intense pressure on both telcos and device manufacturers to ensure Triple Zero access. Communications Minister Anika Wells. Credit: Sitthixay Ditthavong The watchdog disclosed just last month that some older Samsung mobile phones released between 2015 and 2017 could not automatically switch to alternative networks to complete Triple Zero calls. Testing revealed that 71 Samsung models were affected, with 11 requiring replacement and 60 needing software updates. The problem stems from legacy firmware configurations that attempt to route emergency calls through Vodafone’s now-defunct 3G network. When Telstra and Optus networks are unavailable, these devices cannot successfully switch to TPG’s 4G network as a back-up. Wells last month warned that the Samsung phone problems could be “indicative of a broader systemic issue” in Australia’s telecommunications emergency services.\n\nThere are tens of thousands of devices nationwide that may be affected by the issue. Some 46,000 devices are thought to be affected across Australia’s three major carriers. TPG identified affected devices last year during preparations for the national shutdown of 3G services and blocked them from its network, sharing information with Telstra and Optus. However, Telstra engineers recently discovered during testing that the same Samsung devices were still attempting to connect Triple Zero calls via Vodafone’s decommissioned 3G infrastructure. “Why this was configured this way is a question for Samsung and Vodafone,” a Telstra spokesman said. Vodafone owner TPG described the issues as related to a “legacy configuration within the devices themselves”. The company identified additional Samsung devices this year requiring software updates, and has been blocking devices that haven’t been upgraded, as required under new regulations. “When TPG Telecom became aware of these handsets on its network, we communicated with customers to urgently update affected devices,” the company said on Tuesday morning. “Handsets not updated are blocked after a period of 28 to 35 days from the first contact to the customer, as required under new regulations.\n\n“The most recent communications to customers with impacted devices was sent on 7 November. These updates are critical to ensure compactibility with emergency services and to protect customer safety.” Under rules that took effect from November 1, telcos must test whether mobile phones can switch to other networks during Triple Zero outages, report failures in real time, and disconnect phone services within 28 to 35 days of notifying customers that their devices cannot connect to emergency services. Loading Parliament last month also passed legislation creating a new Triple Zero Custodian with compliance powers to ensure emergency services remain accessible. The custodian can impose maximum fines of $30 million for breaches of Triple Zero rules – a tenfold increase from previous penalties. The government has also ordered telcos to create separate public registers of Triple Zero outages, though carriers have raised concerns about the technical and cost challenges of real-time reporting. TPG warned that implementing real-time reporting for unplanned outages would “require substantial system changes and cost across our operations”.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/japan-deploys-army-to-deter-bear-attacks-20251118-p5ngbw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Japan deploys army to deter bear attacks",
        "publish_date": "Tue, 18 Nov 2025 12:25:53 +1100",
        "category": "finance",
        "authors": [],
        "text": "Japan deploys army to deter bear attacks\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/a-clear-no-1-bolters-and-bidders-who-your-afl-club-will-pick-in-the-draft-20251103-p5n7e7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The draft is a day away. Here’s who your club is set to pick",
        "publish_date": "Tue, 18 Nov 2025 12:18:27 +1100",
        "category": "sports",
        "authors": [
            "Marc Mcgowan"
        ],
        "text": "A back stress injury meant Uwland missed this year’s championships after an outstanding bottom-age campaign last year that had him pegged as the best prospect in the 2025 class. The man viewed as Errol Gulden 2.0 did not reach those heights in the limited football he played after recovering, but his football IQ is as good as anyone’s in this draft. He boasts silky skills and can run all day. Might captain the Suns one day. If not: There has been noise for a while, which heated up during the trade period, that the Eagles might bid on Carlton father-son defender Harry Dean. They could also opt to bid on Dylan Patterson or Daniel Annable here. This is not what the Blues were hoping, but the Eagles look poised to do it. Dean is widely rated as a top-five talent. He is one of the best key defender prospects in years, and stands out because there is a major shortage of that position in this crop. He aggressively flies for marks and spoils, reads the ball superbly, and has the athleticism, composure and skills to thrive at the top level.\n\nIf not: West Coast bid on Dylan Patterson instead, or stopped bidding and went for Cooper Duff-Tytler instead. The Eagles have long been linked to Duff-Tytler, a talented ex-basketballer who boasts similar traits to AFL ruck stars Luke Jackson and Tom De Koning with his athleticism, leap, agility and follow-up work. He showed in a VFL appearance for Essendon, where he played predominantly as a forward, that he can impact the game in attack as well, even if that remains a query in some quarters. Should develop rapidly in an AFL environment. If not: There is talk that Essendon would love to try to snatch West Coast’s No.2 pick after securing Carlton’s No.9, but the likeliest scenario is Duff-Tytler is heading west.\n\nPatterson might be the most damaging and exciting player in this year’s draft. He takes the game on with his kicking and fast feet – including a nasty goose step – and sometimes tries to do too much, but showed in a VFL game against Carlton late in the season that he can rein his attacking nature in. Likened to Andrew McLeod, Patterson rejected NRL clubs’ overtures to stay on the AFL path, and could be a difference-maker for the Suns. If not: It seems West Coast will bid on Dean after Uwland. That means the Tigers will bid on Patterson, and that is now expected to be before they pick an unattached player, but maybe they make a live pick first. The Lions’ premiership window will never shut if kids like Annable keep popping up, after the Ashcroft brothers arrived in recent years. Annable racks up disposals, excels at stoppages and is creative by hand. There are all sorts of flattering comparisons ahead of the draft each year, and recruiters see a bit of Simon Black in Annable. Brisbane will gleefully match any bid on Annable, and would quietly be chuffed if it comes this late. If not: The Tigers picked an unattached player first, such as Sam Cumming, Sullivan Robey or Xavier Taylor.\n\nThe consensus view is that the Tigers would not have flown to Mildura just to do their due diligence on Cumming, so expect him to head to Punt Road. A shoulder injury cut his season short, but not before he stamped himself as a top-10 pick. He is a dual-position threat who impacts the game as a deep forward with his marking ability and knack for kicking goals, or as a midfielder, where his physicality, aggression and dynamism are all ticks. There have even been Mark Ricciuto comparisons. Recruiters also like Cumming’s defensive commitment. If not: Richmond went for Sullivan Robey or Xavier Taylor instead. Two of the three should be in yellow and black. Robey is this year’s bolter, after many clubs hoped they could keep him a secret once he graduated from Rowville’s senior side to belatedly burst onto the scene for the Ranges mid-season. He grew about 17 centimetres in the past two years and developed physically, in equal parts owing to an impressive home gym and his dedication. First made his mark as a lead-up forward, then showed his strength and power as a midfielder.\n\nIf not: The Tigers are also strongly linked to Xavier Taylor and Sam Cumming, but are not expected to consider Sam Grlj here. Taylor once polarised because of inconsistent decision-making and execution, including a habit for kicking into the man on the mark – but he has cleaned that up (mostly), and risen sharply on draft boards. Was best afield in the Ranges’ grand final triumph, where his intercepting skills, athleticism, versatility and competitiveness were on show. Importantly, there is confidence Taylor will stand up defensively in the AFL. If not: Richmond picked Taylor over Sam Cumming or, more likely, Sullivan Robey, meaning one of those latter two slipped through to the Bombers.\n\nThe suspicion is the Bombers will invest in at least one midfielder after parting with Dylan Shiel, Will Setterfield and Ben Hobbs, on top of the Zach Merrett situation, Darcy Parish’s injury history, and with Elijah Tsatas still proving himself. Sharp won the Larke Medal as the best-performed player at the championships, and is a physical, competitive onballer who wins the ball in big doses. If not: Essendon have also been linked to Sullivan Robey, Sam Cumming, Jacob Farrow, Lachy Dovaston and forward-ruck Aidan Schubert. One different move changes a lot of what comes next. The Demons are never afraid to go against the grain, but this may depend on whether Sam Cumming or Xavier Taylor are available. This is higher than Nairn has been projected, but Melbourne have him in their sights. Nairn had a seven-goal game at the championships before demonstrating his ball-winning wares with consecutive 30-plus-disposal outings to end the season. He is a high-IQ footballer, runs all day on the wing, could develop into an inside midfielder, marks well overhead and is a neat kick. If not: They would love Sam Cumming, Sullivan Robey or Xavier Taylor to still be on the board. Melbourne might select defender Jacob Farrow, or one of small forwards Latrelle Pickett or Lachy Dovaston.\n\nFarrow’s draft range starts at Essendon’s picks, and he has admirers into the mid-teens, but he should be long gone by then. He is one of the best kicks in this class – which should appeal to Melbourne – makes quick decisions, impacts the game as an interceptor, and showed his agility in combine testing. Farrow has also performed well in the midfield, but is more proven down back, where he will start and possibly stay in the AFL. If not: Small forwards Latrelle Pickett – cousin of Demon Kysaiah – or Lachy Dovaston may be considered instead, or they could look to fortify their key defensive posts for the future with Blake Thredgold. Dovaston, who hails from the same Talent League club as Nick Watson, is the best small forward in this draft. He might lack Watson’s tricks, but still has his share, and has greater running capacity and is considered superior defensively to when the star Hawk was the same age. Dovaston kicks goals for fun (and lots of them), is consistent, has become more selfless, runs hard up and down the ground, and tested brilliantly at the combine.\n\nIf not: Essendon might go for another small forward, Latrelle Pickett, instead or add forward-ruck Aidan Schubert, who has been linked to Tullamarine throughout the year. Josh Lindsay and Sam Grlj are other options. The Hawks have interviewed Taylor in recent days, so he is at least in their mix. His stocks increased the longer the year went after not playing at the championships, capped by his eye-catching results at the combine, where he set the fastest 20-metre sprint time and finished second for agility. Taylor puts that acceleration to great use to quickly create separation and get the ball moving forward. He can tidy up his kicking and improve defensively. If not: Hawthorn might opt for speedster Sam Grlj or sweet-kicking defender Josh Lindsay instead.\n\nThredgold has been linked to North Melbourne for a while, so he might be the player they have in mind, assuming they secure Carlton’s selection. Recruiters took notice of Thredgold’s solid job last year as a bottom-ager on future Collingwood forward Charlie West. He also quelled fellow first-round prospect Mitch Marsh in this year’s SANFL under-18 grand final and dominated in the air to cap a strong finals series. He is a tad undersized but a genuine lockdown defender who is strong, athletic and competitive. If not: The Roos might opt for forward-ruck Aidan Schubert, or whoever is still up for grabs between small forwards Lachy Dovaston or Latrelle Pickett. As always with bids, there is a great unknown, but there is enough noise about the Giants potentially bidding, after the Swans bid on Harry Rowston around this range three years ago. The Swans academy product finished top 10 in three tests at the combine, including winning the running vertical jump. Part of Kyle’s appeal is that this was his first year in the academy, so there is serious scope for improvement. He is a good size, has a big tank and brings positional versatility. If not: GWS will probably select from a group including Oskar Taylor, Sam Grlj or Latrelle Pickett, but they are typically tough to predict.\n\nMelbourne star Kysaiah Pickett’s cousin has top-20 interest in what is an even crop, but there is a chance he is still up for grabs in the 20s. The Demons, Essendon and North Melbourne are other possible landing points. Pickett turns 20 in December, so he is slightly older than his draft peers, but has impressed this year with his progress at Glenelg. He is quick, elusive, capable of the mercurial, and has the cheek that the best small forwards possess. If not: GWS might have the option of Oskar Taylor or Sam Grlj, both of whom they also like. West Coast are expected to make a bid on Murray, who has been mentioned in top-20 calculations in recent weeks. But the Suns rate him highly and it would be a shock if they did not match a bid on him here. A foot injury meant Murray did not play at the championships, but recruiters like his athleticism and toughness, and were impressed with how diligent he was with his rehab.\n\nIf not: The Eagles may bid on another Gold Coast academy player, Beau Addinsall. They would be doing so knowing the Suns are less likely to match a bid on Addinsall.\n\nGrlj was originally linked to Richmond, and could easily land at the Hawks or GWS. He would be difficult to pass up for the Eagles if he is still available. Grlj has speed to burn and was one of only two players to run the two-kilometre time trial quicker than six minutes at the combine. He entered top-five calculations with a superb start to the year before hitting a rough patch, but his VFL form for Richmond was excellent. Grlj could eventually become a midfielder, but will likely start at half-back. If not: There is chatter in the industry that Gold Coast academy midfielder Beau Addinsall might attract a bid in the teens, and clubs believe the only club likely to do that would be West Coast. Lindsay is an excellent decision-maker and arguably the best kick in the draft – the result of years of dedication honing his skills, including a strict morning routine – so this would be a good result for the Bulldogs. He has been a consistently high performer at all levels, and is viewed as a safe selection who could slot straight into a defensive role. There are varying opinions on whether Lindsay could develop into a midfielder.\n\nIf not: Sydney academy defender Lachy Carmichael is right in the frame here, and several clubs have him pencilled in as the Dogs’ selection. The Swans might not match this early if that eventuates. Adelaide are tipped to go local, and they have kept in close touch with Marsh, who kicked the most goals at the 2025 championships. He emerged from the carnival as a top-10 contender who some thought could play other positions, but appears to have slid after a so-so end to the season. But the talent and upside are there, and Marsh would complement the likes of Riley Thilthorpe and Darcy Fogarty as a different attacking option. If not: There will be other viable South Australian players available, such as Harley Barker, Aidan Schubert and Jevan Phillipou.\n\nInjuries impacted the start of Ison’s season, but the Blues’ next-generation academy prospect finished strongly – and opposition recruiters took notice. Ison’s height and aerial prowess make him a candidate to fill various roles across the ground, beyond just the midfield. There is still a smallish sample size on him, but the scouting report acknowledges that he can do things others in this range cannot, so Carlton will gleefully match a bid. If not: A bid on Ison might come later, with Fremantle a possibility. If the Cats don’t bid on Ison, they may bid on Gold Coast’s Beau Addinsall, and would be a good chance to get him. Archie Ludowyke has also been linked. Ludowyke started the year brightly for the Dragons and the AFL Academy after long being rated the best key forward in this class. However, he had a goalless championships – which was not all his fault, as a player relying on service – before suffering a season-ending PCL injury in Metro’s win over the Allies. This would be a classic Cats play to invest in a player with good size and athleticism who launches himself at the Sherrin. If not: There is a scenario where Geelong Falcons defender Josh Lindsay is available here, while key forward Aidan Schubert is another potential option.\n\nSome clubs think this is too early for Williams, but if anyone makes a bid, the Dockers loom as the most likely for the speedy forward. He has all the traits to be a successful small forward at AFL level, but there is some projection here. Williams starred at the combine, placing second with a scintillating 2.89-second 20-metre sprint and also finished fourth in the agility test. If not: Williams may still be available into the 30s. The Dockers could bid on others, or look for a different forward. Freo are raised as a potential bidder here, and Sweid will probably receive a bid in the 20s somewhere. He recovered well from an ACL rupture that sidelined him for much of the 2024 season, and the Essendon next-generation academy prospect enjoyed a strong campaign. He is small, but that did not stop him at any of the levels he played at this year. Sweid’s toughness, competitiveness, defensive commitment, and penchant for kicking goals while playing at half-forward endeared him to scouts.\n\nIf not: Sweid’s wait will continue. The Dockers might bid on someone like Beau Addinsall or Max King instead.\n\nThere is risk with Barker, who sustained an ACL rupture playing for Sturt after earning All-Australian honours. If a club is willing to take that on board, there is so much to like about Barker’s prospects, given he was considered a top-10 smokey after his championships performance. His size, speed, endurance and skill add up to an impressive package, and he uses his running ability to get involved at both ends. There is a chance he slides. If not: The whispers around the Dockers are that they are interested in a forward, so they might even bid on Max King or could go for Noah Hibbins-Hargreaves, and might even go for a mature-ager. Jevan Phillipou might be another option. Greeves is linked to the Hawks by virtue of their rejected application to include him in their next-generation academy program because of his Indigenous background. He also trained with them during the pre-season through the AFL Academy. Greeves is polarising – with most queries centred on his running ability – but a contested beast who has the height and ability to also impact the game when he plays as a marking forward.\n\nIf not: Hawthorn might opt for more firepower in attack, with someone such as Aidan Schubert or Liam Hetherton, who has also been linked to them. Could they place a bid on Beau Addinsall? The Bombers might snap up Schubert with one of their early picks, or North may already have drafted him with the pick they are expected to trade for from Carlton. His awkward ball drop and kicking style are talking points, and put some clubs off, while he measured shorter than some scouts expected. But Schubert had an outstanding championships to surge into the top-10 mix. Talls can sometimes drift, given the risks involved, but his competitiveness and endurance appeal. If not: Winger Harley Barker is a player of interest and would be in strong consideration if he is available. Forward-ruck Louis Emmett is another option.\n\nIn a draft where many prospects are flawed or erratic, Carmichael’s ultra-consistency across several years is a big tick. The Dogs might even bid for him with their first pick, where they would have a strong chance of retaining him. Carmichael was an All-Australian at under-16 level in 2023, and earned that same honour at this year’s under-18 championships, where he was also the Allies’ MVP. Carmichael is defensively sound, but his kicking and relative lack of athleticism may keep him in this range. If not: The Dogs might only bid on Carmichael with their first pick. If they don’t bid on him, they will likely go for a taller option instead. It becomes really difficult to know what will happen this deep into the draft, but the Bulldogs are linked to him and another athletic ruckman, Marcus Krasnadamskis. The popular view on Emmett, who finished third in the time trial at the combine, is that he will need to develop into a key-position player at either end – but there is upside here, and he will be a back-up ruck option at worst. His draft range starts earlier than this but could be wider.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/companies/keeping-costs-down-top-priority-as-nine-s-new-tv-boss-rings-in-changes-20251117-p5nfz5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Keeping costs down top priority as Nine’s new TV boss rings in changes",
        "publish_date": "Tue, 18 Nov 2025 12:00:00 +1100",
        "category": "finance",
        "authors": [
            "Calum Jaspan"
        ],
        "text": "Nine Entertainment’s new broadcast and streaming boss says wage costs across the media giant’s biggest division, including that of on-air talent, will be closely watched as she moves to squeeze more revenue out of the hit shows on its roster.\n\nLaing, who joined Nine from Foxtel earlier this year, told this masthead that the business needs to keep a lid on its costs as it puts Nine Network, Stan and 9Now under one roof.\n\nNine’s managing director of streaming and broadcast, Amanda Laing, has begun to make changes. Credit: Louie Douvis\n\n“We are looking at the remuneration across the entire business, from, yes, people on-air to people involved in production, to people in IT, to engineers, technology, all of these things to make sure we’ve got the right cost base and the right investment in the right areas.”\n\nLaing presided over her first cost-saving measure last week, with Nine saying it was looking to cut 50 jobs from its newly created broadcast and streaming division, with some big names from its different nightly news operations among the casualties.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/china-is-moving-in-as-trump-hurts-the-us-dollar-20251118-p5ng6u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "China is moving in as Trump hurts the US dollar",
        "publish_date": "Tue, 18 Nov 2025 11:59:05 +1100",
        "category": "finance",
        "authors": [
            "Stephen Bartholomeusz"
        ],
        "text": "When China twisted BHP’s arm last month and forced it to settle 30 per cent of its iron ore sales in yuan, it was part of a larger effort to boost the use of its currency in global transactions.\n\nWhile the tussle with BHP was also motivated by an attempt to negotiate iron ore prices down, China’s insistence on a proportion of BHP’s sales being paid for in yuan was a clear escalation of its ambition of eroding the dominance of the US dollar in global financial and economic activity.\n\nChina is looking to strengthen its geopolitical ambitions and weaken the already Trump-weakened status of the US and the dollar in global affairs. Credit: Getty Images\n\nIt doesn’t appear that it is trying to end dollar dominance, although that might be a long-term goal, but to insulate its own economy and financial system from that dominance as rapidly as it can. Increasing use of the yuan in international transactions also helps extend and expand its spheres of influence.\n\nAt China’s Fourth Plenum meeting of the Communist Party last month, the senior leaders spelled out more clearly than they had previously their plans for the yuan, saying China should “promote the internationalisation” of the currency.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/cba-boss-wants-major-cut-to-migration-level-to-aid-home-affordability-20251118-p5ng6e.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "CBA boss wants major cut to migration level to aid home affordability",
        "publish_date": "Tue, 18 Nov 2025 11:58:32 +1100",
        "category": "finance",
        "authors": [
            "Shane Wright",
            "Millie Muroi",
            "Clancy Yeates"
        ],
        "text": "Commonwealth Bank boss Matt Comyn wants Australia’s net migration to be tens of thousands of people a year lower than the government is forecasting to help improve housing affordability as the Coalition spoils for a fight over the issue.\n\nSpeaking at a committee hearing at Parliament House on Tuesday morning, the boss of the nation’s biggest bank said having a predictable level of migration would help housing supply and infrastructure keep up with demand.\n\nCBA boss Matt Comyn said the growth in home loans probably needed to slow down. Credit: Alex Ellinghausen\n\n“Perhaps that number is something in the order of 180,000 per annum,” said Comyn, stressing it was a personal view. “It gives both the Commonwealth and states the ability to plan for critical infrastructure, including housing.”\n\nThe government is forecasting net overseas migration to fall to 260,000 this financial year, then to 225,000 in 2026-27 and for the rest of the decade. Opposition Leader Sussan Ley has declared she would lower migration if elected, with the Coalition contemplating a cut of more than 100,000 people a year from current levels.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/cricket/better-than-ever-marnus-warning-for-archer-and-why-he-thinks-an-englishman-is-the-world-s-best-batter-20251117-p5ng4t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Better than ever’: Marnus’ warning for Archer, and why he thinks an Englishman is the world’s best batter",
        "publish_date": "Tue, 18 Nov 2025 11:55:01 +1100",
        "category": "sports",
        "authors": [
            "Daniel Brettig"
        ],
        "text": "Before that series, Labuschagne had been full of brio when discussing how he knew exactly what was needed to deal with every member of England’s then bowling attack. It’s a level of confidence he lost somewhere along the way over six years of constant international cricket, but it’s back now. “[In 2019] I was averaging 60 in county cricket and just in that run scoring form when everything’s clear. It doesn’t matter who you’re facing, it’s just ‘ok I’ll do this, or this, or this is where they’re bowling and I’ll put them under pressure here’. Jofra Archer. Credit: Getty Images “When you’re not going well it’s the opposite, it’s ‘I’ve got to do this, I’ve got to defend and grind’, instead of ‘nah I’ll just play the ball like that because that’s where the field or the plan is’. “Whenever you’re not doing well or failing, there’s doubt, I don’t care who you are, that’s what happens. But I think it was more the fact that my technique was in a space where I couldn’t apply pressure to the opposition, so my only option was defensively to grind. That’s the part that’s shifted and why I’m really happy.”\n\nLoading Alongside those memories of 2019 is a remarkable admission - through much of the rich run of scoring that followed for Australia, Labuschagne does not think he was playing particularly well. “I’ve had periods of being a prolific run scorer, the 2019-20 Pakistan, New Zealand summer here,” he said. “But even then I don’t think I was necessarily batting that good. I was just a good decision-maker and I was in a rhythm of scoring runs, so you’re able to repeat that consistently.” Labuschagne does not yet know whether he is going to bat in his customary number three spot or shift back up to opening with Usman Khawaja, saying: “it’s not as simple as work out your one, two, three”. But he does know he will be batting far better than last summer, where at times he both looked and felt like a sitting duck. “My technique’s in a spot now where I can score off more deliveries and now it’s about decision-making,” he said. “I was nowhere near my best last summer, but I still managed to play some crucial innings in a series. But it’s certainly not the way I want to be playing, as restricted as I was then.\n\nLoading “When you get that space, you sit back and go, ‘OK, I don’t want to be going back to that, playing that type of cricket where I’m so restricted and feel like the only way is to grind’. I think that’s what we’ve seen this season so far, probably a different Marnus than you have in the last few years.” Labuschagne spoke glowingly of Joe Root, calling him “the best batter in the world at the moment”. “I hope we don’t see the best of Joe Root this summer, for Australia if we can keep him quiet and put him under pressure to score runs that’d be really good for us. But the reality is he’s a class player and the best batter in the world at the moment. The way he goes about it, he’s one of the greats.” But the Queenslander’s own return to the Australian top six provides another warning to England, by showing how much batting in these conditions can be required to feel at home again.\n\n“The month I had in the West Indies with [Matt] Wadey and Diva [Michael Di Venuto], working there and with Ron [Andrew McDonald] and just batting and not having any pressure on me was the start of the process of getting back,” he said. “Technically, I hadn’t landed on what I needed to land on then, but it felt like I was getting back to that freedom, and I just wouldn’t have been able to do it if I was in the team. As that progressed into coming here, I thought the only way I’m going to get back to playing my best is if I just played games. Loading “So I played four or five club T20 games to get out there and bat and be able to find that feeling of scoring runs. I played two practice games against Tasmania, and it was the same thing, building up scoring runs in the middle and getting that feeling of trusting my game.” England have played one measly warm-up game and on Tuesday will have their first session in the fast Perth Stadium nets.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/nine-wins-from-49-the-next-hoodoo-the-socceroos-are-desperate-to-break-20251118-p5ng6n.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Nine wins from 49: The next hoodoo the Socceroos are desperate to break",
        "publish_date": "Tue, 18 Nov 2025 11:52:00 +1100",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "As the rest of Australia celebrated the 20-year anniversary of John Aloisi’s famous penalty kick against Uruguay over the weekend, the Socceroos refused to look back. But they did go backwards, ever so slightly.\n\nCoach Tony Popovic did not sit his players through a communal re-watch in camp, nor did he ask them to channel the spirit of November 16, 2005, when they took the field against Venezuela in Houston, Texas.\n\nInstead, he watched them produce the worst performance of his year-long tenure as Socceroos coach: a disjointed 1–0 defeat that extended a different South American hoodoo.\n\n“It was a good lesson for us,” Popovic said, chalking it up largely to the inexperience in the experimental starting XI.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/workplace/employers-rostering-staff-over-xmas-holidays-put-on-notice-20251118-p5ng7l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Employers rostering staff over Xmas holidays put on notice",
        "publish_date": "Tue, 18 Nov 2025 11:47:29 +1100",
        "category": "finance",
        "authors": [
            "Elias Visontay"
        ],
        "text": "Employers have been warned that they must “request, not require” staff to work on public holidays over the end-of-year break following a landmark legal ruling that bosses cannot forcibly roster workers on to days such as Christmas.\n\nLast week, the Federal Court ordered BHP to pay almost $100,000 – $15,000 in fines and $83,700 in compensation to 85 workers – after it found the mining giant had failed to consult them before rostering them on to work Christmas Day at its Daunia coal mine in Queensland in 2019.\n\nJustice Darryl Rangiah noted in his ruling the “inherent power imbalance” between employers and employees and said the law requires there be a “request rather than a unilateral command to prompt the capacity for discussion, negotiation and a refusal”.\n\nMerry merry: Workers can’t be forced to spend Christmas in the office, a court ruling has found. Credit: Getty Images\n\nWhile an employee can refuse requests to work public holidays, Rangiah found the 85 BHP employees had been “deprived of the opportunity to raise reasonable grounds for refusing to work” on Christmas Day and Boxing Day.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/anthony-scaramucci-says-everyone-in-trump-s-orbit-hates-him-20251109-p5n8v4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Anthony Scaramucci says everyone in Trump’s orbit hates him",
        "publish_date": "Tue, 18 Nov 2025 11:30:00 +1100",
        "category": "finance",
        "authors": [
            "Kishor Napier-Raman"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Anthony Scaramucci is mercilessly roasting me for ordering French toast. “This motherf---er, he’s got a metabolism like a coal furnace, he’s having French toast. If I had French toast, I’d be in a f---ing coma. No, I’d be an extra five kilos, but I’d also be in a coma,” he says. Scaramucci, the Wall Street financier and one-time Donald Trump whisperer, is content to enviously pick at a bowl of berries with a side of yoghurt when we meet for breakfast in the Aperture cafe at the Capella Hotel up the road from Circular Quay. “The Mooch”, as he’s affectionately known, is a man in high demand. He’s flown into Sydney to headline the Sohn Hearts & Minds conference at the Opera House, an investment community jamboree that raises money for charity. He landed in London the night before, and will leave Sydney the next day for the brutal 24-hour return to New York. Anthony Scaramucci says Trump is “into punishing people. He believes in humiliation rituals, particularly for our allies”. Credit: Sam Mooy Thanks to that punishing schedule, our “lunch with” has become a brief “breakfast with”. Not that the early start, or jet lag, stops your correspondent from getting the full Scaramucci experience. The Mooch talks fast and he talks big. He drops expletives liberally and greets me with jokes about the “fake news media” followed by a conciliatory bear hug.\n\nAdvertisement\n\nAnd he has the self-deprecating sense of humour that emerges when your claim to fame is being a global punchline. The joke that preceded the punchline was the first Trump presidency. Scaramucci became White House communications director in July 2017, and infamously lasted just 11 days in an episode that would come to symbolise the chaos and dysfunction that plagued Trump’s Washington. The whole thing began to unravel when Scaramucci phoned The New Yorker’s Washington correspondent, Ryan Lizza, and launched into a lengthy, profanity-laden tirade that involved some extremely colourful editorialising about a couple of his White House colleagues. Scaramucci insisted the conversation was off the record. Lizza, and The New Yorker, said it was not, and duly hit publish. Five days later, the Mooch was fired. There has never been a shorter-serving communications director. Anthony Scaramucci, as the director of communications for the White House, during a press briefing in July, 2017. Credit: Bloomberg “I made a mistake in trusting in a reporter. It won’t happen again,” he tweeted. Mercifully, our breakfast is entirely on the record, and the Mooch seems in a trusting enough mood. The conversation is made easier by the fact that these days, Scaramucci, 61, has no trouble telling the world how he really feels about Trump.\n\nAdvertisement\n\n“If you’re inside Trump’s near orbit you hate his guts. Don’t forget that,” he says. “He’s [Trump] in it for the money and he’s in it for the attention. He’s not in it to serve the American people or to make the country better. He’s into punishing people. He believes in humiliation rituals, particularly for our allies.” When Trump gave Prime Minister Anthony Albanese the cold shoulder for months, there were widespread fears Australia would be subject to such a humiliation ritual. Instead, Scaramucci says, the prime minister and ambassador Kevin Rudd played the Trump game well. US President Donald Trump and Australian Prime Minister Anthony Albanese in October. Scaramucci says Albo “played the game well” with Trump. Credit: Bloomberg “Remember, you’re going on stage in a live reality television show that’s being produced by Donald Trump. And so you can go in there reactive, and then you’re going to get destroyed.” Unlike Ukraine’s Volodymyr Zelensky, or South African President Cyril Ramaphosa, Rudd and Albo went in and “co-produced” the production. As for Rudd’s now-deleted mean tweets about the US president?\n\nAdvertisement\n\n“If you’re sending out critical tweets of Trump he has way more respect for you than you think because he hates himself,” Scaramucci tells me. “He’s a bad human being, prima facie bad human being. And he’s prima facie out to hurt people.” How, and why then, did Scaramucci end up working for such a bad person? A blue-collar Italian-American kid from Long Island, Scaramucci hustled and bustled his way into the East Coast elite by way of Harvard Law (where he was a contemporary of Barack Obama) and Goldman Sachs, before starting his own investment firm, SkyBridge Capital. Along the way, he crossed paths with Trump, another quintessential “New Yawker”, and the pair had known each other for two decades before the 2016 election. “You can never say that you’re friends with Donald Trump because then you’re overstating the relationship. You’re an acquaintance. It’s quite transactional,” the twice-married father of five says. Scaramucci describes himself as a lifelong Republican with a lower-case “r” (he believes in things like same-sex marriage and women’s reproductive rights, and is envious of Australia’s gun control regime).\n\nAdvertisement\n\nTruth be told, the Mooch had been a little politically flirtatious, supporting Obama in 2008, Republican Mitt Romney in 2012, and working on the doomed campaign of Republican frontrunner Jeb Bush in the 2016 primaries. When Bush dropped out, Scaramucci joined the Trump campaign. “I made a decision to go work for Donald Trump, which was a combination of ego-based decision-making and moral equivocation,” Scaramucci says. Michael Douglas as Gordon Gecko in Wall Street: Money Never Sleeps. The Mooch had a brief cameo in the 2010 movie. It was, the Mooch says, a big mistake. But it’s a mistake that has made him famous. Trump’s celebrity is radioactive. The MAGA-verse is full of people who owe money, power and influence to their decision to kiss the presidential ass. Similarly, there is a thriving cottage industry of Republican rebels, whose excoriating of their old party, coupled with insider-ish commentary on the Trump circus, has found a vast audience among liberal types equal parts fascinated and repulsed by the binfire in the Oval Office. Legend has it that Scaramucci once paid $US100,000 for a brief cameo in Oliver Stone’s Wall Street: Money Never Sleeps. Trump has given the Mooch far more fame than 15 seconds in a middling 2010 sequel ever could.\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/step-back-aussie-leader-quits-233246746.html",
        "title": "Aus leader quits after daughter in doco",
        "publish_date": "2025-11-18T01:59:44Z",
        "category": "finance",
        "authors": [],
        "text": "NSW Nationals leader Dugald Saunders has called it quits less than three years into the job and a day after his 19-year-old daughter featured in a documentary on the adult industry.\n\nSaunders shocked colleagues by resigning suddenly as leader on Monday, saying he wanted to focus on family.\n\nA spokesperson for the member for Dubbo said it was simply a coincidence that the resignation followed his daughter’s appearance in the online pornography documentary, The Australian reports.\n\nNSW National's MP Dugald Saunders pictured with his family. Dugald Saunders with wife Karen, and children Georgie and Charlie, Picture: Supplied.,\n\nDugald Saunders' daughter and OnlyFans creator Charlie Saunders. Picture: Spicy Summer: Bondi Beach / YouTube\n\nThe publication said multiple family members are battling serious illness.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn a statement on Monday, Mr Saunders said he was stepping down from the role to “take a step back” and focus on his family.\n\n“For the past 2½ years I have had the privilege of leading the NSW Nationals,” the Dubbo MP said.\n\n“It’s been an honour to lead the parliamentary team during a challenging time in opposition and I’ve always done my best to represent regional NSW.\n\n“It’s also the right time to allow a new leader to take up the fight ahead of the next election.”\n\nNSW will return to the polls in March 2027.\n\n“I thank my family, my staff, my team and the party, for all of their support,” Mr Saunders continued.\n\nDugald Saunders has stepped down as the leader of the NSW Nationals. Picture: NewsWire / Nikki Short\n\n“I will continue to serve the people of the Dubbo electorate as their local member.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nJust 24 hours ago, his daughter Charlie - who also goes by Willow - was revealed to be the star of a reality show about OnlyFans creators.\n\nThe barely-legal teen appeared in the first episode of ‘Spicy Summer’, telling producers that she started making adult content as soon as she turned 18.\n\n“Tiktok inspired me to make it,” she said.\n\n“If they can do it, I can do it.”\n\nThe 19-year-old spoke out about struggling with bullying earlier in her life. Picture: YouTube\n\nCharlie then went on to accuse older women of being “jealous” because OnlyFans “wasn’t around when they were younger and they just had to be a housewife.”\n\nThe 19-year-old is then filmed getting to her knees to do a ‘beer bong’ - a funnel with long tube that allows someone to rapdily drink alcohol.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhen it came to declaring what content she was happy to produce, nothing was off the table for the bubbly teen.\n\n“Up until now, I’ve been doing solo content and have been a ‘faceless’ creator,” she said.\n\n“I’ve literally done everything, without my face in it.”\n\nCharlie also goes by the name Willow Ray on her content platforms. Picture: YouTube\n\nMr Saunders has led the party since 2023 after defeating former deputy premier Paul Toole in a leadership ballot.\n\nOpposition Leader Mark Speakman said Mr Saunders would remain a “champion for his Dubbo electorate”.\n\nHe recalled meeting the former ABC Western Plains broadcaster several times before he entered politics, stating he was “notable for his fairness, intelligence and warmth”.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“People still remember him from calling the Sydney Olympics and his years on ABC Radio, giving locals a voice across the west,” Mr Speakman said.\n\n“When he entered politics, those strengths as a broadcaster readily moved across.\n\n“I’ve valued very much his steady, collegiate and constructive counsel and diligence when we were ministers together and later as party leaders together.”\n\nFormer deputy prime minister Michael McCormack thanked Mr Saunders for his work.\n\n“Having worked closely with Dugald since he became Dubbo’s MP in 2019, I know how passionate he is about country people and regional outcomes,” he wrote on X, formerly Twitter.\n\nMr Saunders’ departure comes at a difficult time for the NSW opposition Picture: NewsWire / Christian Gilles.\n\nThe NSW Nationals and the NSW Farmers, a non-governmental organisation, also thanked Mr Saunders.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn recent weeks, Mr Saunders has been vocal in parliament on a range of issues affecting regional NSW, including youth crime, fallout from the Great Koala National Park, and assistance for flood-affected communities.\n\nHis departure comes at a difficult time for the NSW opposition after both the federal Liberal and Nationals parties voted to can net-zero targets.\n\nThe NSW Nationals last week resolved to dump net-zero targets despite Opposition Leader Mark Speakman continuing to back the targets.\n\nPolling presented to state MPs last week reportedly showed a majority of voters in all but one of the Liberal-held seats were in favour of keeping net zero as a policy position.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/nut-allergy-brain-injury-happened-015248424.html",
        "title": "Nut allergy to brain injury: what happened to Max?",
        "publish_date": "2025-11-18T01:52:48Z",
        "category": "lifestyle",
        "authors": [],
        "text": "As he lay in an ambulance on his way to hospital, a 15-year-old boy feared he was going to die.\n\nMax McKenzie had accidentally consumed nuts while at a relative's house and became short of breath.\n\nThe teen had used his Epipen and asthma puffer as paramedics were called.\n\nIn the first ambulance to arrive, just before 2pm on August 6 2021, were advanced life support paramedics who found Max had laboured breathing and gave him adrenaline and an oxygen mask.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWithin 10 minutes, his breathing became worse so a MICA intensive care ambulance was requested.\n\nHe was given a second adrenaline shot and placed on a nebuliser, which was initially not working and then corrected when he got into the ambulance.\n\n\"In the process of being removed from the house and settled in the ambulance, Max became increasingly agitated and restless,\" counsel assisting the coroner Rachel Ellyard said.\n\n\"He was pulling on equipment. He expressed a fear that he was going to die. He was visibly hypoxic and understandably very distressed.\"\n\nAn enlarged photo of Max sat on an easel inside Melbourne Coroners Court on Tuesday as an inquest into his death began in front of his grieving parents.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nCoroner David Ryan is investigating the circumstances around Max's death and the appropriateness of all medical care he received on August 6.\n\nMax McKenzie was unresponsive when he arrived at Box Hill Hospital. (Diego Fedele/AAP PHOTOS)\n\nMax suffered a seizure on his way to Box Hill Hospital, was given more adrenaline and ventilated with a bag valve mask.\n\nHe was unresponsive when he arrived at the hospital, and was taken to a resuscitation bay where a bag valve mask for oxygen was administered.\n\nThe coroner will investigate the \"very live\" question of whether he was given appropriate ventilation after arriving at hospital, Ms Ellyard said.\n\nSix minutes after arriving a code blue was called, Max's heart rate slowed and he was given CPR. Drugs were administered to relax his vocal chords so a tube could be inserted to help him breathe.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nJust after 3pm an emergency incision was made to create an airway, and the timeliness and appropriateness of this intervention is another question for the coroner.\n\nMax was then transferred to The Alfred where scans revealed he had suffered a brain injury.\n\nThe teenager was transferred to The Alfred and then the Royal Children's Hospital. (Diego Fedele/AAP PHOTOS)\n\n\"It's clear that that injury must have been caused, or at least the initial insult to the brain must have been suffered, sometime in the period between 2.30 and shortly after 3 o'clock,\" Ms Ellyard said.\n\nHe was taken to the Royal Children's Hospital for management and investigation into his neurological injuries, where further scans found he had suffered a significant hypoxic ischemic brain injury.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nOn August 19, Max experienced a sudden cardiac arrest which he could not be resuscitated from.\n\nForensic pathologist Victoria Francis was called to give evidence on Tuesday about Max's cause of death and she said his brain injury was the \"most likely contributor\" to the arrest he suffered before dying.\n\nThe inquest will continue on Wednesday.",
        "source": "Yahoo"
    }
]