[
  {
    "url": "https://www.9news.com.au/world/donald-trump-tariffs-update-billionaire-ray-dalio-worried-tariff-war-could-spark-something-worse-than-recession/cc41af32-b8d6-4c64-95ae-52ec069e466b",
    "title": "Ray predicted the 2008 GFC. He fears something worse is around the corner",
    "publish_date": "Mon, 14 Apr 2025 17:10:47 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Billionaire Ray Dalio says US President Donald Trump's tariff war has helped push America close to a recession — or perhaps even \"something worse.\"\n\n\"Right now, we are at a decision-making point and very close to a recession,\" the founder of Bridgewater Associates, one of the world's largest hedge funds, told NBC's Meet the Press on Sunday.\n\n\"And I'm worried about something worse than a recession if this isn't handled well.\"\n\nRay Dalio is pictured speaking onstage at a festival hosted by The Wall Street Journal in New York City in May 2024. (Dia Dipasupil/Getty Images via CNN Newsource)\n\nDalio, who correctly predicted the 2008 financial crisis, is part of a growing chorus, including major Wall Street banks, worried that tariffs could hamstring the US economy, the world's largest.\n\n\"If you take tariffs, if you take debt, if you take the rising power challenging existing power, if you take those factors and look at the factors, those changes in the orders, the systems, are very, very disruptive. How that's handled could produce something that is much worse than a recession. Or it could be handled well,\" he said.\n\nDalio added that whether tariffs are implemented in a \"stable\" way or a \"chaotic and disruptive way\" makes \"all the difference in the world\".\n\nPanic on Wall Street as Trump announces new tariffs View Gallery\n\nBut, so far, the way Trump has pursued his tariff plan — designed to reshore manufacturing to the US and boost jobs and tax revenue — has been \"very disruptive\", Dalio said, adding the tariffs are \"like throwing rocks into the production system\".\n\nTrump's tariff offensive on the world has triggered global market turmoil in recent weeks, raising fears of an economic downturn. Last week, Trump declared a 90-day pause on all \"reciprocal\" tariffs, except those imposed on China, which increased to at least 145 per cent.\n\nYet some Chinese electronic goods, including smartphones and computer monitors, will be exempt from that 145 per cent, according to a US Customs and Border Protection notice posted late on Friday. Those goods are still, however, subject to a 20 per cent levy imposed on China.\n\nA recession refers to a sustained decline in economic activity, often measured by two or more consecutive quarters of negative growth.\n\nREAD MORE: Family packing car when boy reaches for gun\n\nPresident Donald Trump speaks at a cabinet meeting as Secretary of State Marco Rubio, left, and Defense Secretary Pete Hegseth look on in the Cabinet Room of the White House, on Thursday, April 10, 2025, in Washington. (Pool via AP)\n\nGoldman Sachs economists expect a 45 per cent chance of a recession in the US over the next 12 months. Before Trump announced the 90-day pause, they had forecast a recession as the \"base case\", meaning it was highly likely to occur.\n\n\"The prospect of a recession has increased, with growing indications that economic activity is slowing down around the world,\" company CEO David Solomon told analysts on a Monday call.\n\nCurrent levels of uncertainty have \"constrained\" the ability of Goldman Sachs' clients to make important decisions, Solomon said. \"Fears over the potentially escalating effects of the trade war have created material risks to the US and global economy,\" he added.\n\nDalio is worth $US16 billion ($25 billion), according to Bloomberg's Billionaires Index.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/mark-zuckerberg-defends-metas-social-media-acquisitions-in-first-day-of-antitrust-trial/87553551-32f7-417a-ba79-168097fd8bde",
    "title": "Mark Zuckerberg defends Meta's social media acquisitions in first day of antitrust trial",
    "publish_date": "Tue, 15 Apr 2025 01:43:20 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Meta CEO Mark Zuckerberg took the witness stand today to defend his company against accusations by the US Federal Trade Commission that it bought competing social media companies to dominate the market with a monopoly.\n\nIt was the first of what is expected to be two days of testimony for Zuckerberg, who will seek to explain two of his company's most important acquisitions, Instagram and WhatsApp.\n\nAnd although Zuckerberg is no stranger to defending his company, the stakes in this case may be higher than ever before.\n\nMeta CEO Mark Zuckerberg took the witness stand to defend his company. (CNN)\n\nIf the FTC wins, Meta could be forced to break itself apart and spin off WhatsApp and Instagram, which would upend the company's core digital advertising business and reshape the broader social media ecosystem.\n\nMeta relies on the 3.3 billion daily users it claims across its platforms as one of the core selling points of its ad business, which last year alone raked in more than $US160 billion ($252.4 billion) in revenue.\n\nBut the government argued repeatedly in opening statements that Meta's large user base reflected not simple success, but a lack of choice, saying that \"consumers do not have reasonable alternatives\" to Meta's platforms.\n\nLawyers for Meta argued that its platforms have plenty of competition in the social media space and that regulators approved the purchases years ago when they were made.\n\nThe FTC, however, argued that the acquisitions were intended to prevent Meta from having to compete with nascent, would-be challengers by buying them instead.\n\nMark Zuckerberg's Meta empire claims to have 3.3 billion daily users. (NurPhoto via Getty Images)\n\nOne email dating to 2011 from Zuckerberg to Facebook executives detailed the company's reasoning for buying Instagram, relating to the company's stalled efforts to develop an app called Facebook Camera.\n\n\"In the time it has taken us to get our act together on this, Instagram has become a large and viable competitor to us on mobile photos, which will increasingly be the future of photos,\" Zuckerberg wrote at the time.\n\nThe company ended up acquiring Instagram in April 2012.\n\nThe FTC questioned Zuckerberg about the transformation of Facebook from a platform designed to facilitate connections between friends and family to one focused more on showing users interesting third-party content, including the launch of features like the news feed and groups.\n\n\"It's the case that over time, the 'interest' part of that has gotten built out more than the 'friend' part,\" Zuckerberg said.\n\n\"(Users are) connected to a lot more groups and other kinds of things. The 'friend' part has gone down quite a bit, but it's still something we care about.\"\n\nMeta could be forced to break up its platforms if it loses the case. (AP)\n\nA large portion of Zuckerberg's testimony, however, focused on the messaging features built into many of Meta's platforms, from Facebook to Instagram to WhatsApp, which could be key to how the FTC defines the \"market\" Meta dominates with its platforms.\n\nZuckerberg said that messaging is \"symbiotic\" to Facebook's larger offerings, as it allows users to share content they find with friends, after the FTC attorney asked if Zuckerberg considered messaging to be a \"complement\" to the platform's core services.\n\nSeparately, Zuckerberg conceded that in one 2022 email exchange with Chief Product Officer Chris Cox and Facebook President Tom Alison, he was, as FTC attorney Daniel Matheson put it, \"discussing strategies that Meta might employ to ensure there's a vision for Facebook in light of concern for cultural relevance,\" — a reference to Facebook's declining popularity compared to Instagram and third-party platforms like TikTok.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/donald-trump-considers-pausing-vehicle-tariffs/8f6748d0-2413-4248-a215-b44784460cd6",
    "title": "Trump considers pausing his vehicle tariffs",
    "publish_date": "Tue, 15 Apr 2025 00:17:57 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "US President Donald Trump has suggested that he might temporarily exempt the vehicle industry from tariffs he previously imposed on the sector, to give carmakers time to adjust their supply chains.\n\n\"I'm looking at something to help some of the car companies with it,\" Trump said on Monday (Tuesday AEST).\n\nThe US president said vehicle manufacturers needed time to relocate production from Canada, Mexico and other places, \"And they need a little bit of time because they're going to make them here, but they need a little bit of time. So I'm talking about things like that.\"\n\nUS President Donald Trump has suggested that he might temporarily exempt the vehicle industry from tariffs he previously imposed on the sector. (Bloomberg)\n\nUS President Donald Trump and Vice President JD Vance on the South Lawn of the White House, on Monday, April 14, 2025, in Washington. (AP Photo/Alex Brandon) (AP)\n\nMatt Blunt, president of American Automotive Policy Council, an association representing Ford, General Motors and Stellantis, said the group shared Trump's goals of increased domestic production.\n\n\"There is increasing awareness that broad tariffs on parts could undermine our shared goal of building a thriving and growing American auto industry, and that many of these supply chain transitions will take time,\" Blunt said.\n\nTrump's statement hinted at yet another round of reversals on tariffs as Trump's onslaught of import taxes has panicked financial markets and raised deep concerns from Wall Street economists about a possible recession.\n\nWhen Trump announced the 25 per cent vehicle tariffs on March 27, he described them as \"permanent.\" His hard lines on trade have become increasingly blurred as he has sought to limit the possible economic and political blowback from his policies.\n\nLast week, after a bond market sell-off pushed up interest rates on US debt, Trump announced that for 90 days his broader tariffs against dozens of countries would instead be set at a baseline 10 per cent to give time for negotiations.\n\nAmerican car manufacturers say they need more time to relocate production from overseas to the US. (AP Photo/Carlos Osorio) (AP)\n\nAt the same time, Trump increased the import taxes on China to 145 per cent, only to temporarily exempt electronics from some of those tariffs by having those goods charged at a 20 per cent rate.\n\nLast week, after a bond market sell-off pushed up interest rates on US debt, Trump announced that for 90 days his broader tariffs against dozens of countries would instead be set at a baseline 10 per cent to give time for negotiations.\n\nAt the same time, Trump increased the import taxes on China to 145 per cent, only to temporarily exempt electronics from some of those tariffs by having those goods charged at a 20 per cent rate.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/gene-hackman-property-had-dead-rodents-in-outbuildings/b3191422-e765-4236-a35b-190908645229",
    "title": "Dead rodents found in outbuildings on Gene Hackman property",
    "publish_date": "Mon, 14 Apr 2025 21:18:27 +0000",
    "category": "lifestyle",
    "authors": [
      "Apr"
    ],
    "text": "Public Health records obtained by CNN revealed findings of dead rodents and rodent nests throughout eight detached outbuildings on late actor Gene Hackman and his wife Betsy Arakawa's property.\n\nThe homesite environmental assessment of the sprawling property in New Mexico was conducted last month, one week after the Hackman and his wife were discovered dead in their home in February .\n\nArakawa died from hantavirus pulmonary syndrome , a rare disease that humans can contract from contact with rodents, rodent faeces, saliva and urine, according to the New Mexico medical investigator's office. She was 65.\n\nActor Gene Hackman and his wife Betsy Arakawa were found dead in their New Mexico home in February. (AP Photo/Mark J. Terrill, File) (AP)\n\nAccording to the report, rodent faeces were found in three garages, two casitas and three sheds. A live rodent, a dead rodent and a rodent nest were found in the three detached garages.\n\nThe New Mexico Department of health staff conducted the risk assessment on March 5 as part of the death investigation of Hackman and Arakawa to ensure the safety of first responders and family members who had access to the property.\n\nThe risk of exposure in the primary residence was low, according to New Mexico State Public Health Veterinarian Erin Phipps. The report said it showed no signs of rodent activity and was clean.\n\nThe other eight buildings on the property were accessible to rodents, the report stated. In two vehicles on the property (listed as a working or abandoned vehicle or farm equipment), there were also sightings of rodents, a nest and faeces. Investigators also found live traps in the outbuildings.\n\nHantavirus is a rare but serious disease that has resulted in fatalities for 41 per cent of patients in New Mexico. The south-western US state has had the most reported cases of hantavirus in the country.\n\nThe house owned by actor Gene Hackman and his wife Betsy Arakawa, in Santa Fe, New.Mexico. (AP Photo/Roberto E. Rosales) (AP)\n\nLegendary actor Gene Hackman's life in pictures View Gallery\n\nThe Mayo Clinic advises to avoid contact with rodents if possible and to wear protection when cleaning up rodent habitats due to limited treatments for the disease.\n\nThere is currently no specific treatment for the hantavirus and symptoms, which present as flu-like at the beginning, may take up to two months to show up according to health experts.\n\nHeather Jarrell, the chief medical examiner for the New Mexico Office of the Medical Investigator, said Arakawa died suddenly from hantavirus.\n\nHackman died days later from complications of hypertensive and atherosclerotic cardiovascular disease with advanced Alzheimer's disease as a contributing factor to his death. He was 95.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/taco-bell-to-close-stores-in-australia/bd2f402f-32ea-4839-9685-2c96cf1b54fa",
    "title": "Fast food giants face the axe in Australia",
    "publish_date": "Tue, 15 Apr 2025 01:29:24 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "The parent company of Taco Bell Australia has announced plans to either close or sell off its national network of stores.\n\nCollins Foods, which also operates hundreds of KFC locations in Australia, said in a statement to investors it has decided to exit the Taco Bell business.\n\nIf a buyer isn't found within a year, the group said it may consider other \"exit options\" for Australian Taco Bell stores. There are no plans to close any KFC locations.\n\nTaco Bell's Australian parent company Collins Foods announced plans to shut down or sell off stores. (Sipa USA)\n\n\"Discussions are currently underway with Taco Bell International (TBI) regarding a potential transition of the business to new ownership,\" Collins Foods said in a statement.\n\n\"Collins Foods intends to complete the transition within the next 12 months, subject to formal terms being agreed.\n\n\"A further update will be provided, including estimated exit costs, as matters progress.\n\n\"If a new operator cannot be identified and/or an agreement cannot be reached, other exit options will be explored.\"\n\nThere are 27 Taco Bell locations across Australia.\n\nThe US-owned Mexican fast-food giant first launched in Australia back in 1981, however a Sydney restaurant with the name Taco Bell's Casa took it to court.\n\nThere are 27 Taco Bell locations across Australia. (Supplied/Taco Bell Corp)\n\nTaco Bell made a second attempt to crack into the Australian market in 1997 but it shut doors again after eight years.\n\nIn 2017, Taco Bell made its third and final venture into Australia with plans to open more than 50 stores by late 2021.\n\nManaging director and chief executive Xavier Simonet said Collins Foods will continue to invest in its most successful operation, KFC, including expanding in Germany.\n\n\"Collins Foods has successfully operated KFC restaurants for over 50 years, building a reputation as a trusted operator,\" Simonet said.\n\n\"In a challenging economic environment, the customer remains at the heart of our business.\n\n\"We will continue to deliver high-quality food at accessible prices, leveraging the heritage of the KFC brand at a time when consumer trust has never been more important.\"\n\nFollowing the announcement, former general manager of Taco Bell in Australia﻿ Krystal Zugno has been promoted to general manager of Australian operations for both Taco Bell and KFC.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/climate-anxiety-what-is-it-rising-tide-protester-alexa-stuart/eb8f9558-3e00-4060-9a6b-2ca0afabc48e",
    "title": "Alexa has been grappling with 'climate anxiety' since she was a teenager",
    "publish_date": "Tue, 15 Apr 2025 00:20:41 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Young voters are forming a rallying cry for the federal government to address one of their greatest concerns: climate change .\n\nThe climate crisis has become so alarming to some Australians it's given rise to a little-known term called climate anxiety, also known as eco-anxiety.\n\nAlexa Stuart, 21, has already spent years of her life anxious about the climate.\n\nAlexa Stuart, Rising Tide climate activist, said she has \"eco-anxiety\". (Supplied)\n\nThe Newcastle environmentalist, who gate-crashed PM Anthony Albanese's campaign pitstop earlier this month to protest the federal government's climate policies, told 9news.com.au climate anxiety is a very real issue for many young Australians.\n\n\"I'd say from about 15 I've had climate anxiety,\" Stuart, a member of the climate advocacy group Rising Tide, explained.\n\n\"That's when things started to really sink in for me about the seriousness of the climate crisis, I remember like late nights trying to research the science of it and, and feeling quite emotional about it quite often.\"\n\nStuart recalls the devastating 2019/20 bushfires in Australia as a turning point for her passion – and horror – over the state of the environment.\n\nShe, like millions of others, felt a sense of despair as she watched the country burn.﻿\n\n\"It feels like almost a universal experience of young people seeing those bushfires and feeling so deeply that this is what every summer﻿ may look like,\" Stuart said\n\n\"The fear was pretty vivid around that time.﻿\n\n\"And I've just felt a really intense concern about the impact the climate crisis will have on my future.\"\n\nThe young protester interruped the PM's mental health campaign announcement on Tuesday. (Alex Ellinghausen)\n\nOne in 10 Australian adults is experiencing \"significant eco-anxiety\" like Stuart is, said the Black Dog Institute's Chloe Watfern.\n\nMore than 80 per cent of 16 to 25-year-olds are worried about climate change, according to research published in The Lancet.\n\nWatfern said this currently undiagnosed feeling can be akin to \"the feeling of homesickness that you have when you're home\" or even pre-traumatic stress.\n\nIt can also be known as \"ecological grief\", which is \"a sense of mourning for ecosystems, biodiversity and species lost to environmental damage\".\n\nThe prevalence of climate anxiety has the potential to sway voters during the 2025 federal election too.﻿\n\nA recent report also found 74 per cent of young Australian voters thought the government needs to do more to address climate change.﻿\n\nStuart sees herself as the voice for millions like her who want to see real change in their lifetime.\n\n\"I want my 15-year-old self to be proud of me and I want to be able to tell my grandkids that I did everything that I could,\" she said.\n\n\"That's really what drives me to just keep fighting every day.\"\n\nThe young climate advocate said she spoke up because the \"antidote to despair is action\". (Alex Ellinghausen)\n\nClimate anxiety was front of mind for Stuart when she heckled the PM as he announced Labor's $1 billion mental health package.\n\nStuart accused Albanese of hypocrisy for his government's coal policies as he pledged big money for youth mental health.\n\n\"You're condemning young people like me to a life of climate disaster,\" she told the PM.\n\nThe young climate advocate said she spoke up because she believes \"antidote to despair is action\".\n\n\"I feel the anger so deeply and the grief that the best way that I can channel those emotions is through action,\" Stuart said.\n\n\"And, and that's why on Tuesday when I confronted the Prime Minister, my heart was racing before I did it.\n\n\"But as I started talking about the emotion of it… all of these years of emotions and feeling powerless and helpless and dismissed by our politicians, they just all came out so easily.\"\n\nReaders seeking support can contact Lifeline on 13 11 14 or beyond blue on 1300 22 4636.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.9news.com.au/national/federal-election-2025-labor-and-coalition-housing-policies-explained-expert-commentary/413d9d4e-1774-403a-a106-36919fc1b0c9",
    "title": "House prices will skyrocket by $159k if buyers pull super, expert warns",
    "publish_date": "Mon, 14 Apr 2025 19:27:43 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Labor and the Coalition unveiled sweeping policies over the weekend aimed at tackling the housing crisis in Australia, and young first homebuyers are firmly in each party's sights.\n\nPeter Dutton's pitch to voters is all about maximising borrowing power with a push to let Australians draw from their superannuation accounts, while Anthony Albanese's housing scheme focused on deposit sizes.\n\nEach plan is all about helping young people achieve the dream of home ownership without the \"bank of mum and dad\", however according to the experts,﻿ making mortgages easier to obtain isn't the solution.﻿\n\nAnthony Albanese and Peter Dutton both unveiled new housing policies on Sunday. (Nine)\n\nUsing $50,000 from your superannuation\n\nDutton﻿'s \"super for housing\" policy , which he pledged earlier this year, would allow Australians to pull a maximum of $50,000 from their retirement accounts to help pay for house deposits.\n\n\"Your super is your money – not the government's,\" the opposition leader said on Sunday during his campaign launch in western Sydney.\n\nBut early superannuation withdrawal could have significant impacts on someone's financial future, warns ﻿executive director of The Mckell Institute Rebecca Thistleton.\n\nThistleton said a sudden surge in young people having a house deposit in their bank account will only drive property prices up, particularly in capital cities.\n\n\"Our analysis shows that a super-for-housing scheme would add at least $69,000 to the price of the average house in Sydney, $108,000 in Melbourne and $159,000 in Adelaide,\" she said.\n\nExperts warn pulling from your super account could result in higher home prices and a big hit to your retirement fund. (Getty Images/iStockphoto)\n\n\"We also pinpointed how much a homebuyer would need to take from their super to realistically boost buying power.\n\n\"We found that using $10,000 to $30,000 to buy a home would do little to help a first homebuyer get into the market, but would leave them worse off at retirement compared to leaving that amount in their super long-term.﻿\"\n\nFounder of Home Loan Experts Otto Dargan agrees extra borrowing power isn't the solution, and instead said both parties should invest in boosting supply.\n\n\"They're focused on the levers that they can pull easily as a federal government, whereas the issues are more to do with planning, development approvals and zoning which are the domain of the states,\" Dargan said.\n\n'Almost impossible': Dutton's son Harry said he can't afford a house deposit View Gallery\n\nFive per cent deposits\n\nLabor's solution to getting young people on the property ladder is a scheme that would allow most first homebuyers to buy a property with just a five per cent, with the federal government guaranteeing a portion of the loan.﻿\n\nThis would help a Sydneysider to purchase a $1 million property with a $50,000 deposit.﻿\n\nDargan said this policy may help people who can't rely on their parents to be guarantors on a home loan.\n\n\"This policy is particularly good for immigrants and people from less affluent backgrounds, it bypasses the bank of mum and dad﻿,\" he said.\n\nHowever, mortgage broker Siddhartha Bajracharya said the cost of a five per cent deposit may get a lot bigger as house prices skyrocket under low supply.\n\n\"This will help more first-home buyers purchase houses as long as they can service and qualify but I think rather than this creating unmanageable home loans, it would only make the property prices go up,\" he said.\n\n\"I think the government should push the land and construction side as well.\n\n\"More houses will probably bring the housing prices under control and I think the economy could benefit.\"\n\nREAD MORE: How the teal and other independents could shape the federal election\n\nUnder the scheme, first-home buyers with a 5 per cent deposit wouldn't have to pay lenders mortgage insurance (LMI), saving the average person around $23,000.\n\n\"You won't have to pay a single dollar in mortgage insurance, our government will cover it,\" Albanese said on Sunday.\n\n\"Australia will be better for helping people to get over this hurdle,\" Dargan said of this promise.\n\nLabor's solution to getting young people on the property ladder is a scheme to allow people access mortgages with a smaller deposit. (Dion Georgopoulos / Australian Financial Review)\n\nDeducting mortgage interest payments from income tax﻿\n\nEasing mortgage stress was the second pillar of Dutton's housing policy.\n\nThe Coalition said it would let first-time homeowners of newly built properties make mortgage interest payments tax deductible, which would save an average of $12,000 per year.\n\nThe scheme is limited to five years, is against only the first ﻿$650,000 of a home loan and is means-tested, with income caps of $175,000 for singles and $250,000 for couples.\n\nDargan said it would only make home ownership more accessible if banks took the scheme into account.\n\n\"The government would need to work with the Australian Prudential Regulation Authority (APRA) or consider amendments to the National Consumer Credit Protection Act to allow banks to include the tax-deductible interest when calculating borrowing power,\" he explained.\n\nEasing mortgage stress was the second pillar of Dutton's housing policy. (Getty)\n\n$10 billion to build more homes﻿\n\nThe federal government said, if re-elected, it will invest $10 billion into building 100,000 homes reserved just for first homebuyers to address the housing shortage.\n\nLabor's package will include $2 billion in grants and $8 billion in zero-interest loans or equity investments.\n\nExperts have consistently pointed to increasing supply as one of the only real ways to move the needle on house prices.\n\n\"Homebuyer incentives must come with more housing supply, otherwise prices will rise,\" Thistleton said.\n\nThe federal government said it will invest $10 billion into building 100,000 homes. (Henry Zwartz)\n\n\"Building more homes depends on having enough workers, and while Labor's free TAFE and apprentice support will help, we need a clear construction workforce plan.\"\n\n\"Labor's policy appeals to people struggling to save for a deposit while paying rent.\n\n\"Importantly, Labor's policy includes new housing construction specifically for first homebuyers.\"\n\nDargan agreed and said extra housing might not look like the white picket fence dream – but it would do the job.\n\n\"It means building high rises and being unpopular with people in those suburbs,\" he said.\n\n\"It means letting go of the dream of the quarter-acre block.\n\n\"Let's be honest, first home buyers don't want a backyard and Hills Hoist anymore, they just want somewhere to live.﻿\"\n\nThe Coalition said in March it has a plan for a $5 billion housing infrastructure fund.﻿",
    "source": "9News",
    "cluster_id": 6
  },
  {
    "url": "https://www.9news.com.au/national/federal-election-2025-coalition-releases-diss-track-in-style-of-kendrick-lamar/5fa659e1-eeab-4866-8d78-772b8446b3a3",
    "title": "'Albo's gotta leave': Coalition drops first 'diss track' of the election",
    "publish_date": "Mon, 14 Apr 2025 02:12:45 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "The Liberal Party has taken the 2025 federal election up a notch with a new tongue-in-cheek \"diss track\" targeting Labor's economic policies.\n\nThe Coalition dropped the song Leaving Labor today just hours after Peter Dutton's official campaign launch in western Sydney yesterday , marking the first studio-produced rap track of this year's election season.\n\nThe song is described by the Liberal Party as a \"Kendrick [Lamar] meeting Question Time – lyrical, direct and as with all the best raps, political\".\n\nThe Coalition dropped the song \"Leaving Labor\" today just hours after Peter Dutton's official campaign launch. (Bloomberg)\n\n\"Bring them prices down, this is what we need, cause Albo's gotta leave, Albo's gotta leave,\" the unidentified rapper quips.\n\n\"I just want to buy some eggs and cheese, $100? You kidding me?... I just want to put food on the table.\"\n\nThe song, shared via SoundCloud , already has close to 1000 streams after it was released earlier today.\n\n\"It's a serious message in a new format,\" a Coalition spokesperson said of the minute-long track.\n\n\"This drops harder and faster than interest rates under Labor.\"\n\nThe album cover used by the Liberal Party. (Liberal Party of Australia)\n\nAn album cover using Anthony Albanese's face photoshopped onto the iPhone shrug emoji was also used to promote the song.﻿\n\n'Almost impossible': Dutton's son Harry said he can't afford a house deposit View Gallery\n\nThe Coalition hired a commercial artist, who remains unknown, to sing the lyrics.\n\nIt's not the first time the Liberals have used catchy lyrics during an election campaign.\n\nVoters may not soon forget Scott Morrison's campaign song with the lyrics \"there's a hole in your budget, dear Labor\", which drew inspiration from the children's rhyme, There's a Hole in My Bucket.",
    "source": "9News",
    "cluster_id": 7
  },
  {
    "url": "https://www.9news.com.au/world/top-10-wealthiest-cities-in-the-world-2025/a8f125ca-1031-47ea-83c3-4dde4a59a757",
    "title": "The top 10 wealthiest cities in the world",
    "publish_date": "Mon, 14 Apr 2025 02:58:56 +0000",
    "category": "finance",
    "authors": [
      "April"
    ],
    "text": "1 of 11 Attribution: AP\n\nThe world's wealthiest cities for 2025 have been revealed in new rankings by Conde Nast Traveler magazine.\n\nResearchers drew on data by Henley & Partners and the wealth intelligence firm New World Wealth showing the numbers of billionaires and millionaires in every city to establish the global hubs of the super-rich.\n\nAnd this year, one Australian city broke into the top 10. Click through for more.﻿",
    "source": "9News",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-15/coachella-2025-highlights-weekend-one/105175420",
    "title": "Lady Gaga dazzles Coachella while Amyl and the Sniffers get political",
    "publish_date": "Tue, 15 Apr 2025 01:29:48 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "With lower ticket sales, grumbles about the star power of its line-up and so much competition for peoples' dwindling entertainment budgets, Coachella is perhaps not the culture-defining event it once was.\n\nAny criticisms of the festival's ability to present the world's key artists were proven unfounded over the weekend, as the Californian desert played host to yet another dazzling array of acts spanning just about all genres.\n\nThe headlines from its first weekend — it will be repeated with the same line-up this weekend coming — have been kind to the event this year, focused largely on celebrity spotting and fashion.\n\nUS politics is never far away from anything these days and a surprise appearance from 83-year-old Vermont senator Bernie Sanders before Clairo's set brought a little of the current situation to the festival.\n\nIn his speech, Sanders urged the young audience to demand more from the current political class, and took a few swipes at US President Donald Trump's stance on climate change.\n\nBut for most of us, Coachella remains about the music. If you're looking at settling in to watch some of it this Easter weekend, here's our take on some of the biggest sets.\n\nLady Gaga wows with pop opera epic\n\nLady Gaga's Coachella performance included several costume changes, before ending on this feathered bodysuit for encore 'Bad Romance'. (Kevin Mazur/Getty Images for Coachella)\n\nYou'd be forgiven for forgetting that Lady Gaga's headlined Coachella before.\n\nIn 2017, she slotted in after Beyoncé, then-pregnant, pulled out from headlining. In the throes of denim-and-diamonds album Joanne, the set came at a limbo period — and while excellent, it left no major pop-culture mark. (It doesn't help that Beyoncé returned the next year for Beychella.)\n\nWhen announcing her 2025 return to the desert, Gaga wrote on Instagram that this performance would be \"fully realised\" in a way 2017 couldn't be \"for reasons beyond our control\". She wasn't lying: Closing in on 20 years of pop-superstardom, Gaga shows signs of entering a new creative peak.\n\nPerforming off the back of March's dipped-in-darkness pop album, Mayhem, Gaga's set was decadently theatrical — a near-two-hour gothic pop opera where forces of light and evil fought for Gaga's soul over five acts and 22 songs.\n\nBeginning with 'Bloody Mary' — a 2011 album cut that had a 2023 TikTok resurgence — Gaga arrived centre-stage several storeys tall, her torso atop a blood-red hooped skirt.\n\nLady Gaga told crowds she wanted to bring the opera to Coachella, her set resembling a nightmarish version of a classical opera house complete with balconies. (Kevin Mazur/Getty Images for Coachella)\n\nAfter screaming \"dance or die\" as the relentless industrial synths of Mayhem highlight 'Abracadabra' kicked in, she descended through her towering skirt before its pillowing fabric opened, revealing a cage with entrapped dancers.\n\nIt was just the first of many elaborate and awe-inspiring scenes, including a life-or-death chess match against a 'Bad Romance'-era Gaga (but set to 'Poker Face'), a sandbox with more creepy-crawlies than Dune ('Perfect Celebrity') and a dance with death ('Zombieboy', where a troupe of dancers hump skeletons).\n\nSkipping a whole decade of albums — 2013's Artpop, 2016's Joanne and 2020's Chromatica — Gaga kept things moody and atmospheric, with a nightmarish Alice-in-Wonderland journey through fame, celebrity and maintaining one's own identity among it all.\n\nDespite the darkness, Gaga's set was pure light — especially as early hits such as 'Born This Way' or encore track 'Bad Romance' saw Coachella's infamously tame crowds erupt.\n\nTravis Scott has unlimited flames, yet we still feel cold\n\nTravis Scott has wanted to headline Coachella for years, rapping about it on 2018 album ASTROWORLD. (Kevin Mazur/Getty Images for Coachella)\n\nThe massive marching band that appeared at the start of Travis Scott's headline set on night two might have had a few of us dreaming about the best Coachella set of all time, but the Houston rapper offered something far darker and less impressive.\n\nBarely acknowledging the crowd, Scott churned through a directionless 30-song set that saw his songs — mainly from latest album Utopia and 2018 breakthrough Astroworld — chopped and changed so much that it just ended up exhausting.\n\nWhile the rationale behind dropping two brand-new tracks into the start of a set being watched by an enormous global audience is questionable, we do give him full marks for the set's production.\n\nBetween the endless pyrotechnics, the moving stages, and the acrobatic dancers suspended in midair, there was plenty to look at even if Scott's distant vibe and autotuned modern rap left your cold.\n\nIt's hard to argue this is one of the great Coachella headline sets.\n\nCharli XCX enlists Billie, Troye and Lorde to prove Brat summer should last forever\n\nTeased as an end to Brat summer via a scratched-out billboard, Charli XCX's set proved that her blend of bright and brash green electro-pop still has plenty of life in it.\n\nWhere Lady Gaga's set was maximalist production, Charli kept to the pared-back performances of the Brat era, hitting the stage solo in sunglasses, thrashing around to her own songs in front of a strobing screen.\n\nWell, for the most part she stood alone. Charli brought out a handful of best friends for some help, including: Troye Sivan appearing for the sinewy 'Talk Talk'; Lorde strutting alongside Charli for their feud-ending 'Girl, So Confusing'; and Billie Eilish for the irresistible, throbbing 'Guess'.\n\nCharli XCX has brought out Troye Sivan, Lorde and Billie Eilish to perform with her during the Brat era, but never all three during the one set. (Instagram/Charli xcx)\n\nBut it was the end of Charli's set that offered the biggest surprises. While the singer danced to early EDM hit 'I Love It', her screens offered a slightly existential message.\n\n\"Does this mean that Brat summer is finally over?\", the screen asked. \"Idk? Maybe? Wait was it? No?? Yeah cuz duh it was already over like last year. Wait. Was it? NO??? I don't know who I am if it's over???\" F–KKKKKKKK.\"\n\nBut then, a moment of clarity: \"Wait. I remembered. I'm Charli… and honestly… I just want this moment to last forever.\"\n\nWith a message \"PLEASE DON'T LET IT BE OVER\" taking over the screen as Charli left the stage, fans are speculating whether she's teasing Brat 2.0, whatever that looks like.\n\nIn the meantime, there's always weekend two. (Though a year of booked shows and festival slots suggests Brat is far from over just yet.)\n\nA rare, mind-blowing set from a true trailblazer\n\nFor my money, the weekend's highlight came from hip hop impresario Missy Elliott, who delivered a breathless career-spanning set packed with incredible costumes, choreography, and an unimpeachable set list.\n\nShe arrived onstage as a kind of Transformer, sauntered into the crowd mid-verse without dropping a beat, and gave us a dazzling array of dance moves that made it truly impossible to look away from her set.\n\nBut it was those songs that truly made the set special. While she will always be considered a musical trailblazer for the way she propelled the sound and attitude of hip hop in the 90s and 2000s, Missy Elliott's songs are now genuine classics and seeing them rolled out in this overwhelming procession of brilliance was almost too much to bear.\n\nIt's been 15 years since she toured down here. Australian promoters: give her a blank cheque.\n\nMegan Thee Stallion brings lots of friends out to play\n\nWhile her guests — Queen Latifah, Victoria Monet, Ciara, Spiritbox — were incredible, Megan Thee Stallion was the force of nature we know her to be in her main-stage slot on the final day of the festival.\n\nQueen Latifah was one of several guests during Megan Thee Stallion's set, alongside Ciara and Victoria Monét. (Kevin Mazur/Getty Images for Coachella)\n\nMuch like Missy's the night before, the set was a seamless display of both the artist's sheer star power and the quality of her output.\n\nWhether you're a fan or a naysayer, this set is worth catching on weekend two. Megan is quickly cementing herself as one of the better live performers in the new breed of rap stars and these might be her best sets yet.\n\nUnfortunately, it might not have been timed out quite as well as it should have, as the rap star was cut off during her final song. A sour end to a very sweet set.\n\nGreen Day bring punk to stadium rock\n\nDespite the fact they air three songs from their classic 1994 album Dookie, we must come to terms with the fact that Green Day are a very different band than they were when they first started visiting Australia in the 90s.\n\nTheir Saturday night Coachella performance was snotty punk dressed up as stadium rock, a lane the band have made their own for the past couple of decades. They do it well, but when you hear 90s songs like 'Brain Stew' and 'Welcome To Paradise', one can't help but yearn for their simpler, snottier past.\n\nWhether or not you approve of their change in musical direction, the band at least don't betray their reputation as agitators, as Billie Joe Armstrong sings \"I'm not part of the MAGA agenda\" in 'American Idiot', and \"running away from pain like the kids from Palestine\" in 'Jesus Of Suburbia'.\n\nSmall contributions, perhaps, but when made on a stage as big as this, in front of this big a global audience, it felt significant.\n\nAmyl & The Sniffers put it all out there\n\nMelbourne punks Amyl and the Sniffers made Green Day's political stance look pretty insignificant at their set late on the festival's final day.\n\nWhile their ferocious, high-energy performance was as strong as ever, the most memorable moment was a short, heartfelt speech from frontwoman Amy Taylor as she addressed the present social and political climate.\n\n\"It's a super-tough time all across America and I just want to extend my love and support to all the trans people, all the gay people, all the black people, all the immigrants — illegal and legal — and everybody else including women and the f***in' men, because everybody's getting f***ed up from it.\n\n\"I'd also like to extend my heart to the people in Palestine and the people in Ukraine, because f**k dying in any capacity and f**k getting murdered by other people for bullshit.\"\n\nThe band delivered another scintillating set, giving American audiences yet another reason to fall in love with the now-LA-based quartet.\n\nThe Original Misfits fit in just nicely\n\nSince their historic 2016 reformation, The Original Misfits have played just a couple of shows per year. Their first appearance at Coachella felt like a throwback to organisers Goldenvoice’s roots of promoting punk rock shows in Southern California, and the band delivered in spades.\n\nA set list heavy on the band’s earliest material – almost the whole set was made up of the Static Age and Walk Among Us albums – reminded us just how much of an impact this band had on the development of punk and garage rock through the 80s, their influence still heard across the genre to this day.\n\nIt all started off a bit messy, but once the band were locked in, it’s hard to imagine a better punk rock show. At 69 years old, Glenn Danzig’s voice remains a treasure, while the band’s energy and aggression was as immense as any band of any age at Coachella this year.\n\nIf you don’t respect them for their music, at least give them props for being the only band in Coachella history to get their logo on the festival’s infamous poster.\n\nWeekend two of Coachella 2025 streams on YouTube from Saturday morning Australian time.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-15/pre-workout-hot-cross-bun-snack/105133652",
    "title": "Social media says hot cross buns are good pre-workout food. Is it true?",
    "publish_date": "Tue, 15 Apr 2025 01:02:42 +0000",
    "category": "sports",
    "authors": [],
    "text": "It's hot cross bun season and on social media, the Easter treat is being promoted as an ideal pre-workout snack.\n\nScroll through Instagram or TikTok and you're likely to come across a hot cross bun getting slathered in peanut butter, honey or butter ahead of a workout or run.\n\nSports dietitians Emilie Burgess and Dannielle Hibberd have worked with elite teams and athletes in Tasmania and New South Wales. They share whether hot cross buns are a good choice, plus what and when to eat before exercising.\n\nSuitable before high-intensity activity\n\nLike a piece of toast or crumpets, a hot cross bun is a great way to get carbohydrates into your body before training or exercise, Ms Burgess says.\n\nA traditional hot cross bun with dried fruit delivers roughly 40 grams of carbohydrates, however this can vary depending on size and toppings, Ms Burgess says.\n\nOne traditional hot cross bun ahead of exercise can keep blood sugar stable and assist muscles to contract appropriately for an hour of moderate activity.\n\nSports dietitian Emilie Burgess. (Supplied: Emilie Burgess)\n\n\"That could be running, it could be sprinting, it could be intermittent-based team sports, such as Monday night basketball,\" Ms Burgess says.\n\n\"Equally someone lifting weights, that kind of high-intensity effort of moving weights, that's also a pretty carb-hungry activity.\n\n\"If you need more [carbohydrates], have it with honey or jam, or have it with a smoothie.\n\n\" If you need a bit less, I don't suggest having half a hot cross bun, because happiness does not live there but that could be something you would consider. \"\n\nDifferent activities have different carbohydrate needs.\n\nMs Burgess says a \"gentle paced, chatty walk with a friend\" may not require a pre-workout snack.\n\nToppings can be added to increase carbohydrates needed for activities. (ABC Life: Thalia Ho)\n\nWhen to eat before exercise\n\nThere's no black-and-white answer on how far in advance to eat before rigorous training, however Ms Hibberd says longer is better.\n\n\"Ideally the longer amount of time, the more time you have to digest, so it's less likely to cause gut upsets or cramps,\" Ms Hibberd says.\n\nIf you're focused on sports performance, a high-carbohydrate meal three to four hours before exercise is advised, with a small snack two hours before exercise.\n\nBut if waking early to exercise, a meal the night before and a small snack when you wake and before you exercise should be enough.\n\nWhen choosing what to eat, Ms Burgess says foods with a high-glycemic Index (GI), are ideal as carbohydrates will be digested rapidly and utilised by the body straight away.\n\nHigh-GI foods include white bread, cornflakes and instant noodles.\n\nRapidly digesting carbohydrates can be used for exercise fuel straight away. (Supplied: Secret Squirrel Run Club)\n\n\"Something like a hot cross bun comes in beautifully, of course depending on how thick you layer the butter on top,\" Ms Burgess says.\n\n\"They're going to provide that higher-GI so in theory should be better tolerated than a really heavily grained bread or crackers.\"\n\nFor afternoon activity, depending on how rigorous, the food eaten throughout the day may provide enough fuel with little to no change to usual eating habits.\n\n\"It might mean that lunch contains a bit more carbohydrate or perhaps afternoon tea does,\" Ms Burgess says.\n\nPantry items ideal for exercise\n\nIf you're looking for ideas for pre-workout snacks, Ms Burgess suggests a banana, a date with peanut butter, a slice of toast, a couple of pikelets or rice crackers.\n\nShe says a milk-based coffee can get protein circulating in the body and deliver carbohydrates.\n\nMs Hibberd suggests plain white toast with peanut butter or jam, rice cakes, fresh or dried fruit or a muesli bar as possible snacks ahead of high levels of exercise, but says it depends on the individual's needs.\n\nSimilarly, Ms Burgess says pre-training needs for fibre, protein and fat vary for individuals and some will be fine with grainy options and nut bars.\n\nRather than seeking out food marketed for exercise, which Ms Burgess says can sometimes be diet foods in disguise and therefore low in carbs, purchase the foods you know you'll reach for.\n\n\"If it's not actually eaten by the person because they don't like it, or it doesn't transport well to work, then they're not going to consume it, and that's kind of useless.\n\n\"Which is why the Easter bun appeals so nicely, because they are pretty universally enjoyed.\"\n\nBut more importantly, Ms Burgess and Ms Hibberd say to still enjoy that traditional hot cross bun.\n\n\"You don't need to be training to have earned a hot cross bun,\" Ms Burgess says.\n\nThis is general information only. For personal advice, you should see a qualified medical practitioner.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-15/aussie-georgia-amoore-pick-six-in-wnba-draft/105177604",
    "title": "Aussie star Amoore picked sixth in WNBA draft",
    "publish_date": "Tue, 15 Apr 2025 00:55:33 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian basketball player Georgia Amoore has been selected as the sixth draft pick the Washington Mystics in the WNBA.\n\nThe 24-year-old from Ballarat plays college ball for the Kentucky Wildcats, but played in the NBL1 for Ballarat Rush in 2019.\n\nShe played four years with Virginia Tech before making the shift to Kentucky for her final year, following head coach Kenny Brooks.\n\nShe averaged 19.6 points per game for Kentucky, starting 31 games in the NCAA season.\n\nAmoore, a guard, has represented Australia at youth level in both basketball and 3X3, winning under age gold medals in both at Asia level.\n\nOn the WNBA's orange carpet, Amoore wore clothes designed by NBA star Russell Westbrook, who has a clothing brand called Honor The Gift.\n\nAmoore said Westbrook designed her outfit and was amazing to work with since they first got together on a Zoom session last November.\n\nThe Washington Mystics, with a new coach and general manager, were very busy in the first round.\n\nGeorgia Amoore wore clothes designed by NBA point guard Russell Westbrook. (Getty Images: NBAE/David L. Nemec)\n\nThey selected Notre Dame's Sonia Citron with the third pick, and Southern Cal's Kiki Iriafen with number four before Amoore was drafted.\n\nUConn star guard Paige Bueckers was the overall number one pick for the Dallas Wings.\n\nBueckers had drawn comparisons to retired WNBA legend Diana Taurasi long before high school and her ascension to the first pick in the draft was almost a foregone conclusion after she hoisted the championship with her Huskies earlier this month.\n\nABC Elite Athletes in Australian Women's Sport Survey: We want to hear from you Photo shows A stylised graphic with three silhouettes of unidentified a female footballer, tennis player, basketballer ABC Sport and Deakin University have partnered to produce the first ABC Elite Athletes in Australian Women’s Sport Survey.\n\n\"You don't ever want to assume anything in life,\" Bueckers told reporters after she hoisted the Wings jersey on stage in front of cheering fans at the Manhattan ceremony.\n\n\"It's a fresh start and we're all ready to do something special.\"\n\nBueckers and her UConn Huskies dismantled South Carolina 82-59 in the championship earlier this month, giving her the fairytale send-off she craved after overcoming multiple injuries in her college career.\n\nShe earned the Naismith Trophy in her freshman year but her collegiate career nearly derailed as she missed 19 games during her sophomore year due to a knee injury and sat out the entire 2022-23 season after tearing her anterior cruciate ligament.\n\nDallas fans will hope that Bueckers, a famously efficient scorer with terrific defensive intuition, will give the Wings a lift as they seek to recover from a dismal 9-31 season.\n\nTowering centre Dominique Malonga, who was part of the silver medal-winning French Olympic basketball team, went second overall to Seattle.\n\nABC/Wires",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-15/kings-letter-100-year-old-woman-sunshine-coast/105173518",
    "title": "How radio helped deliver King's letter to centenarian",
    "publish_date": "Tue, 15 Apr 2025 00:44:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "A royal seal on an otherwise blank envelope was a sign Dianne Johnson had received something special.\n\nBut it wasn't for her.\n\n\"We got a letter from the King, the Governor-General and the Premier,\" Ms Johnson said.\n\nShe said they were addressed to Thelma Petty.\n\n\"I didn't know how long it would take to get redirected, or it was just too important,\" she said.\n\nThe resident of Yandina, on Queensland's Sunshine Coast, then decided to put the call out — literally.\n\n\"I just had a moment where I thought 'well maybe I could contact the ABC and they could help me'.\"\n\nRecognising a name\n\nMs Johnson sent a text to ABC Sunshine Coast's Breakfast program on Wednesday last week.\n\n\"Such an amazing milestone & wondered if you could but a call out to try & locate her,\" the text read.\n\nMeanwhile, about 40 kilometres away in the suburb of Wurtulla, it was just another morning for Lorraine Kelty who was listening to the radio.\n\nShe heard Ms Petty's name and her ears immediately pricked up.\n\nLorraine Kelty heard a call out to help deliver Thelma Petty her letter. (ABC Sunshine Coast: Tim Wong-See)\n\n\"I listened a bit more intently,\" Ms Kelty said.\n\n\"I thought 'oh my goodness if she's missed a letter from the King, that's pretty important'.\n\n\"I thought I better ring up, and so I did.\"\n\nMs Kelty then connected Ms Johnson with Ms Petty's sister who she knew through church.\n\nA royal surprise\n\nMs Petty said she was delighted when she received the letters.\n\n\"It was quite a surprise,\" she said.\n\nThe 100-year-old — whose birthday was in March — has outlived two husbands and two of her four children.\n\nShe said she had more grandchildren and great-grandchildren than she could remember — and recently became a great-great-grandmother.\n\n\"There's so many of them,\" she said.\n\nThelma Petty admires her prestigious letter. (ABC Sunshine Coast: Tim Wong-See)\n\nShe said she had experienced great joys and great sorrows and credited her Christian faith for getting her through.\n\n\"I've had a good life,\" she said.\n\nHer other secrets to a long life were to keep the mind and body active by reading and exercising.\n\nMs Petty said her longevity must be in her genes because her mother lived to 103.\n\nThelma Petty credits her centenarian milestone to staying physically active and her strong Christian faith (ABC Sunshine Coast: Tim Wong-See)\n\n\"When she was asked how did she manage to live that long she said, 'I don't know, I just got here' and I understand exactly what she meant,\" Ms Petty said.\n\nMs Johnson said she was still mystified how the letters arrived at her place because she later learned that Ms Petty had never lived in the area.\n\n\"I've lived in this house for over 20 years … yet someone the mail has come through to me,\" Ms Johnson said.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-15/tas-hobart-rapid-bus-transport-funding-pitch/105176958",
    "title": "Fifteen years and 30 studies later, Tasmania to seek federal funds for 'rapid bus' line",
    "publish_date": "Tue, 15 Apr 2025 00:39:35 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Tasmanian government says it wants to start work on a rapid bus line in Hobart's northern suburbs \"as quickly as possible\" — but will need a funding promise from the Commonwealth.\n\nDeveloping the northern suburbs rail corridor has been the subject of more than 30 reports spanning 15 years, before the government settled on rapid bus instead of light rail two years ago.\n\nCould trains make a comeback in Tasmania? Photo shows A composite image of a train, bus and a question mark. Passenger trains, along with trams and trolley buses, were once part of Tasmania's transport mix. Could rail ever make a comeback?\n\nThe government hopes the rapid bus system can transport between 3 and 6 per cent of patrons to and from the proposed Macquarie Point stadium, along with being a regular part of the city's public transport system.\n\nThe rapid bus upgrades remain uncosted, however.\n\nThe government planned to finish a strategic business case \"in early 2025\", but it has not yet been completed.\n\nThe first stage involves a specific bus lane from Glenorchy to near the New Town hockey centre on the former rail corridor, before the buses then join the road network along Park Street, Letitia Street, Campbell Street and Davey Street into the CBD.\n\nThe proposed rapid bus route in Hobart's northern suburbs with stage one stops marked. (Supplied: Cox Architecture)\n\nOn stadium event days, the route could alter to include a proposed bus plaza at the stadium.\n\nA government spokesperson said federal funding would be sought.\n\n\"After the completion of the business case, and once costs have been identified, the Tasmanian government will seek funding from the Commonwealth based on an 80:20 funding split,\" the spokesperson said.\n\n\" Rapid buses will be rolled out as quickly as possible once a funding agreement is secured. \"\n\nThe Coalition has promised to reintroduce the 80:20 funding model with the states for infrastructure, which was used for the Bridgewater Bridge project.\n\nMore studies into 'most-studied' transport project\n\nDeveloping the rail corridor has been a long road.\n\nHobart's bus network has faced significant disruptions and service changes in recent years (ABC News: Luke Bowden)\n\nIn 2019, a government-commissioned report estimated the rapid bus would cost $385 million from the city to Berriedale, including escalation and contingency.\n\nThe length of the proposed bus route has shortened significantly since then, and will not end at the proposed stadium.\n\nThe same report estimated that light rail would cost between $517 million and $685 million.\n\nThe stadium means there is no space for light rail at Macquarie Point.\n\nResidents near the corridor in Glenorchy have been receiving notices that \"condition assessment\" works are being carried out in the area. Similar works were already undertaken in 2021.\n\nConcept plans for the stadium with, in dark blue, four rapid bus stops and in light blue, CBD bus stops and in pink, an events bus hub. In orange is a shared bridge for road and bike transport. (Supplied: Macquarie Point Development Corporation)\n\nClark independent MP Kristie Johnston — who was Glenorchy mayor throughout much of the public debate over the corridor — said the government was trying to \"retrofit\" Hobart's transport system just to suit the stadium.\n\n\"Clearly they are looking for a transport solution for their stadium, but not genuinely for the benefit of southern Tasmania,\" she said.\n\n\"Rapid bus is not a genuine city-shaping project.\n\n\" I welcome the call for federal funding for a genuine city-shaping transport plan, but the government needs to listen to the experts. \"\n\nMs Johnston said she believed light rail was still the preferable option for the corridor.\n\nIn releasing its northern suburbs transit corridor growth strategy last year, minister Eric Abetz said consultation would be carried out to guide increased development near the corridor as rapid bus develops.\n\nElwick independent MLC Bec Thomas — who was also a Glenorchy mayor — said communities had been waiting far too long.\n\n\"This must be the most-studied public transport infrastructure project,\" she said.\n\n\" My position has been, for a long time: just do something. \"\n\nBus connectivity headache ahead for stadium\n\nBus connectivity issues were among some of the strongest criticisms of the proposed Macquarie Point stadium made in a scathing Tasmanian Planning Commission's (TPC) draft report, released last month.\n\nAbout one-in-four patrons are estimated to take the bus to events.\n\nThe proposed stadium is expected to hold 23,000 spectators during a sports match. (Supplied: MPDC)\n\nA bus plaza is proposed at the northern access to the stadium, but the TPC highlighted a range of potential issues.\n\nThese included curved kerbs that do not allow for disability access on buses and insufficient bus stops to cater for expected commuter numbers, among other issues.\n\nAttendees could need to wait at least one hour in an area that could be \"overcrowded\".\n\n\"To achieve a pedestrian environment where people's circulation and movement is somewhat restricted due to difficulty on passing others, it is likely that an additional area of approximately 1,200 square metres would be required,\" the report reads.\n\n\" Given the constraints in the area, it is not clear how this type of area could be achieved. \"\n\nThe government plans to introduce special legislation to enable the stadium to go ahead, thereby ending the TPC's involvement.\n\nThe state government hopes to start construction by the end of the year. (ABC News: Luke Bowden)\n\nPremier Jeremy Rockliff said the issues highlighted by the TPC could be managed by conditions inserted into the legislation.\n\nHobart's public bus network has experienced significant disruptions and service reductions in recent years, which the government blames on a driver shortage.\n\nThe TPC estimates that a further 80 buses would be needed to service the stadium on event days.\n\nRegatta point housing proposal being considered\n\nThe government also needs to ensure that essential worker, affordable and social housing is included in the Macquarie Point precinct in order to receive $240 million in Commonwealth funding.\n\nThe current plan is for this housing to be built at regatta point, on the shoreline north of the stadium.\n\nThe government is preparing a \"precinct master plan\", including housing, and will provide a briefing to the Commonwealth mid this year.\n\nA government spokesperson said the housing development was scheduled for \"after the start of the construction of the stadium\".\n\n\"Before taking to market any development parcels, an update to the planning scheme will be sought through a revised master plan,\" the spokesperson said.\n\nThe TPC was also critical of the chosen location for the housing, despite stating that this was beyond its scope for its analysis of the stadium.\n\nIt described the land as \"isolated\", \"unsuited to residential amenity\" and with \"a high potential for land use conflicts\" with the adjacent Macquarie wharf.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-15/max-king-rugby-league-ashes-for-england-or-australia/105177342",
    "title": "King eyeing international honours, whether it's for Australia or England",
    "publish_date": "Mon, 14 Apr 2025 23:49:54 +0000",
    "category": "sports",
    "authors": [],
    "text": "Max King would love the chance to follow in his grandfather's footsteps and play in this year's Ashes series.\n\nBut who for?\n\nThe Canterbury prop is yet to decide, with his form and a player drain to the Pacific nations putting the Huddersfield-born forward in the conversation to represent either the Kangaroos and England.\n\nThe ex-Melbourne forward has been one of the key cornerstones of Canterbury's revival under Cameron Ciraldo, with the Dogs heading into Good Friday's clash against South Sydney with a 5-0 record.\n\nKing has yet to win representative honours but with Kangaroos regulars Payne Haas and Tino Fa'asuamaleaui set to represent Samoa at the end of this season, his chances of donning the green and gold this year have increased.\n\nBut the 27-year-old says he remains open to accepting an England call-up.\n\nMax King is looking forward to extending the Bulldogs's excellent start to the season against South Sydney. (Getty Images: Cameron Spencer)\n\nKing's mother is from Dewsbury and the prop was born in Yorkshire while his father Dave was finishing his career in the Super League with Huddersfield.\n\n\"My mum's side of the family would love that,\" King told AAP.\n\n\"I always say I'm half English and half Aussie … I'd love to be able to get a call off anyone.\n\n\"The phone is always on and I'm always available to any caller.\"\n\nA call-up for Australia would mean King gets the chance to follow the trail blazed by his paternal grandfather Johnny King, who won 15 caps for the Kangaroos and played in three Ashes series.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I didn't think about it like that and it is so cool to share that family history but it would also be cool to pave my own path,\" King said.\n\nKing arrived at Belmore in 2022 and having been through some of the club's darkest days is loving the fact the ladder-leading Dogs have hit top gear under Ciraldo.\n\nThe former Gold Coast prop says he is only being spoken of as a representative player due to the club's good results under Ciraldo.\n\n\"These things come from team success with everyone else performing,\" King said.\n\n\"It puts your name in those [selection] pictures.\n\n\"That's one thing that I'm thankful for is the way this club is going and the way my teammates are playing.\n\n\"It brings other names into selection [debates], Jacob Preston is doing a great job and I hope he gets a call [for the NSW State of Origin side].\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-15/rory-mcilroy-earns-widespread-praise-after-masters-win/105176952",
    "title": "Rory McIlroy earns wide praise after showstopping Masters win",
    "publish_date": "Mon, 14 Apr 2025 22:24:01 +0000",
    "category": "sports",
    "authors": [],
    "text": "British royalty have hailed a new king of golf as tributes poured in from both sides of the Atlantic after Northern Ireland's Rory McIlroy claimed a career slam with a stunning Masters triumph.\n\nThe 35-year-old became the first European man to win the four majors as he sank a birdie putt on the first hole of a sudden-death playoff against Englishman Justin Rose, a dramatic finish for McIlroy in his 11th attempt to win the tournament.\n\nHe previously won at the US Open (2011), PGA Championship (2012, 2014) and Open Championship (2014).\n\n\"Congratulations @McIlroyRory on your historic win at @TheMasters!\" the X account for King Charles and his wife Queen Camilla posted on Monday.\n\nMcIlroy is the sixth man in history to complete the career grand slam, joining Gene Sarazen, Ben Hogan, Gary Player, Jack Nicklaus and Tiger Woods.\n\nSky Sports pundit and renowned coach Butch Harmon called the Augusta win \"one of the greatest days in golf we will ever see.\"\n\n\"It had an ebb and flow that a Hollywood producer could not have come up with,\" said Harmon.\n\nOne of sport's greatest final-day battles ends with McIlroy's name in lights Photo shows Rory McIlroy holds his head as the crowd celebrates behind him Rory McIlroy has finally achieved golfing immortality in a modern masterpiece of sporting theatre, its flawed brilliance so relatable and so wonderfully symbolic of the Northern Irishman's career as a whole.\n\n\"He was like a gladiator in the way he came back. Did he quit? No. Did he hang his head? No. Did he feel sorry for himself? No. Now he has a Green Jacket.\n\n\"I've known Rory since he was 16, done a little work with him at times, and this is one of the most amazing victories I have ever seen.\"\n\nThe Belfast Telegraph captured the national mood with the rapturous headline, \"Putting man on the moon? What Rory McIlroy has just achieved is statistically even more impressive.\"\n\nThe tributes were all the more meaningful after a long and winding road to golfing immortality, as McIlroy endured years of close calls, finishing in the top five four times at Augusta before his success.\n\nThe BBC chronicled his path from heartbreak to triumph, revisiting his disastrous 2011 outing, when he let a four-shot lead slip through his fingers on a haunting final day at Augusta.\n\n\"The boy from Holywood finally gets his Hollywood ending,\" read The Telegraph's headline.\n\nFellow grand slam legends salute McIlroy\n\nRory McIlroy finally ended an 11-year wait to become a grand slam winner. (Getty Images: Michael Reaves)\n\nMcIlroy's elevation to golf's most exclusive club was greeted by its remaining living members.\n\n\"I want to extend my heartfelt congratulations to Rory McIlroy on his historic win at the Masters and completion of the career Grand Slam,\" Gary Player, the only other non-American grand slam winner, wrote on X.\n\nLoading...\n\n\"The drama of today capped off with his play-off victory was simply meant to be. I would be remiss if I didn't mention my admiration for Justin Rose, who embodies the true spirit of a gentleman in our game.\n\n\"This is one of the rarest and most difficult achievements in all of sport, something only now six golfers in history have ever accomplished. We are proud to add Rory to our exclusive club and no doubt he has set the standard for his era.\n\n\"To win all four major championships takes unwavering perseverance and the courage to overcome adversity time and time again in the face of immeasurable pressure few have ever experienced. Rory showed true grit today and also through the entire tournament.\n\n\"It was 11 years ago when Rory first started the final leg of his career Grand Slam journey. And throughout this time, he's carried himself with class, led with principle, and played with passion.\n\n\"For him to finally don the Green Jacket in golf is a moment to be celebrated by fans around the world. Rory has made his mark on history, and all of us who love this game are incredibly proud.\n\n\" Well done, my friend. Welcome to our club. \"\n\nTiger Woods also commented on his friend's achievement.\n\n\"Welcome to the club,\" the 15-time major winner wrote.\n\n\"Completing the grand slam at Augusta is something special.\n\n\"Your determination during this round, and this entire journey has shown through, and now you’re a part of history.\n\n\"Proud of you!\"\n\nNorthern Ireland looks forward to Open at Portrush\n\nRory McIlroy sunk to his knees following his win. (Getty Images: Richard Heathcote)\n\nNow, Irish eyes are looking towards an Open championship that is going to be held at Northern Ireland's Royal Portrush course for just the third time.\n\nRoyal Portrush is located about an hour's drive from McIlroy's hometown of Holywood.\n\nMcIlroy's 61 at age 16 in the 2005 North of Ireland championship still stands as the old course record at Royal Portrush.\n\n\"He has given us one of Northern Ireland's biggest sporting achievements,\" Emma Little-Pengelly, the country's deputy first minister, posted on X.\n\n\"He will undoubtedly get a deserved hero's welcome when he comes home. The reception when he steps onto the first tee at Royal Portrush in July will be incredible. Hopefully he can give the home fans plenty to cheer as he bids to win a second Open Championship.\"\n\nFormer world snooker champion Dennis Taylor declared McIlroy Northern Ireland's \"greatest ever sportsman\".\n\nThat's no small assertion for a country that has produced soccer great George Best and snooker star Alex Higgins.\n\n\"Massive congratulations to Rory McIlroy on his incredible victory at The Masters — making history as the first ever from our island to win the prestigious Green Jacket!\" Northern Ireland's First Minister Michelle O'Neill said on X.\n\n\"This is a huge moment in sporting history, and one that has filled everyone back home with great pride.\"\n\nIreland's Taoiseach (Prime Minister) Micheál Martin described the win as \"epic\".\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"It was an incredible evening and we were all up late in the morning,\" Martin added on Monday.\n\nMartin said the occasion reminded him of Ireland's 1990 World Cup penalty shootout win over Romania and George Hamilton's famous \"the nation holds its breath\" commentary.\n\n\"Well, we were holding our breath every five minutes for a good few hours yesterday,\" Martin said.\n\n\"Literally holding our breath at every putt and every tee shot. It was a marvelous national occasion and it's a moment in time that we will all remember.\"\n\nUlster Unionist leader Mike Nesbitt called for McIlroy to be knighted.\n\n\"For a country the size of Northern Ireland, it is remarkable how many sports people have become icons in their fields. Think George Best, Mike Gibson (rugby), and Mary Peters (athletics), to name just three. Rory McIlroy has just trumped all of them and, with the Grand Slam monkey off his back, looks set for even more success,\" Nesbitt said.\n\n\"This universally popular figure deserves the highest praise the nation can bestow, and a knighthood is just that.\"\n\nABC/wires",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-15/sean-diddy-combs-pleads-not-guilty-to-expanded-charges/105176870",
    "title": "Diddy pleads not guilty to expanded sex trafficking charges as trial looms",
    "publish_date": "Mon, 14 Apr 2025 21:46:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Sean \"Diddy\" Combs has pleaded not guilty to an expanded federal indictment charging the hip-hop mogul with five criminal counts, including sex trafficking and racketeering.\n\nMr Combs, 55, entered his plea to the new charges at a Manhattan hearing on Monday.\n\nHe had previously pleaded not guilty to an earlier three-count indictment.\n\nEarlier this month, Mr Combs's media representatives supplied a statement from his lawyers.\n\n\"These are not new allegations or new accusers,\" they said.\n\n\"These are the same individuals, former long-term girlfriends, who were involved in consensual relationships.\"\n\nThe lawsuits and charges filed against Sean 'Diddy' Combs Photo shows A photo of P Diddy at the Met Gala wearing a black and white stripped suit Here's a breakdown of the lawsuits against Sean \"Diddy\" Combs.\n\nJury selection for Mr Combs's trial remains scheduled for May 5, with opening statements due to begin on May 12.\n\nMarc Agnifilo, one of Mr Combs's lawyers, said the defence may seek a two-week delay to opening statements to allow it to review emails it wants an alleged victim to turn over.\n\nUS District Judge Arun Subramanian said if the defence wanted a delay, it must submit a formal request within two days.\n\n\"We are a freight train moving towards trial,\" the judge said.\n\nProsecutors with the Manhattan US Attorney's office say Mr Combs used his business empire to sexually abuse women between 2004 and 2024.\n\nThe alleged abuse included having women take part in recorded sexual performances called \"freak offs\" with male sex workers, who were sometimes transported across state lines.\n\nMr Combs has been jailed in Brooklyn since September. He also faces dozens of civil lawsuits by women and men who accused him of sexual abuse.\n\nLoading...\n\nMr Combs's legal team has forcefully denied that he did anything wrong.\n\nMr Agnifilo has said Mr Combs never forced anyone to engage in sexual acts against their will, and that the freak offs were consensual sexual activity.\n\nAlso known during his career as Puff Daddy and P Diddy, Mr Combs founded Bad Boy Records.\n\nHe is credited with helping turn rappers and R&B singers such as Mary J Blige, Faith Evans, Notorious BIG and Usher into stars in the 1990s and 2000s.\n\nBut prosecutors have said his success concealed a dark side, citing a number of incidents.\n\nThey include one in March 2016 when Mr Combs was captured on a surveillance video kicking, dragging, and throwing a vase at a woman trying to leave a Los Angeles hotel.\n\nCNN last year broadcast a surveillance video showing Mr Combs striking and dragging his former girlfriend Casandra Ventura, an R&B singer known as Cassie.\n\nMr Combs apologised following the broadcast.\n\nMr Agnifilo has said the video was not evidence of sex trafficking, and that Mr Combs and Ms Ventura had \"a toxic, loving 11-year relationship\".\n\nABC/Reuters",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-15/police-investigate-paris-roubaix-bottle-attack-van-der-poel/105176846",
    "title": "Man hands himself to police after Paris-Roubaix bottle attack",
    "publish_date": "Mon, 14 Apr 2025 21:39:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "A man who threw a full bottle of water at Dutch racer Mathieu van der Poel during this year's Paris-Roubaix cycling race has handed himself to police, according to Belgian newspaper Het Nieuwsblad.\n\nVan der Poel was struck in the face by the bottle on his way to a third-consecutive victory in the queen of the classics.\n\nThe 30-year-old Dutch rider, a 10-time world champion across road, cyclo-cross and gravel cycling disciplines, was leading the 259.2 kilometre one-day event with 33km remaining.\n\nThe Dutchman shook off the incident and continued on his way to victory but was furious when asked about it by media at the finish line in northern France.\n\n\"I got hit in the face with a bottle at 50 kilometres per hour. That's enough to break a jaw,\" van der Poel said.\n\n\"We can't just let that slide.\"\n\nHe added in a further interview with Sporza that the incident was akin to \"attempted manslaughter\".\n\nVan der Poel also had beer thrown at him during the race by spectators, who have no restrictions on how close they are able to get to the sport's biggest stars on the side of the road.\n\nMathieu van der Poel was showered in beer as well during the race. (Getty Images: Pool/Bernard Papon)\n\nFrench police confirmed that an investigation had begun into the incident.\n\n\"An investigation was opened into the charge of violence with a weapon in order to identify and arrest the perpetrator,\" Lille prosecutor Carole Etienne wrote on X.\n\nCycling's governing body the UCI expressed its support for the former world champion.\n\n\"The Union Cycliste Internationale and the associations representing the families of cycling unanimously condemn, in the strongest terms, the unacceptable behaviour of a spectator during the 122nd edition of Paris-Roubaix from the side of the road on 13 April,\" the UCI said in a statement on Monday.\n\n\"Such behaviour cannot be tolerated in the context of a cycling event.\n\n\"The UCI and representatives of cycling's families express their support for the rider and will explore, in conjunction with the competent authorities, all the legal channels at their disposal so that such behaviour is duly and severely punished, as has already been the case in the past.\n\n\"They will take the same action in the future against any act that threatens the physical integrity of riders.\"\n\nCyclists often have to dodge cheering spectators on the side of the road. (Getty Images: Bernard Papon)\n\nSpectators have previously been fined for causing crashes on the side of the road, including a French woman who bought down the Tour de France peloton in 2021 with a cardboard sign, who was fined 1,200 Euros.\n\nVan der Poel's Alpecin-Deceuninck team said later on Monday that they were seeking sanctions over the bottle throwing, describing it as \"a dangerous and unacceptable incident\".\n\n\"We will be filing an official complaint against the perpetrator to formally denounce this behaviour,\" a team statement read.\n\n\"This issue goes beyond that single act. Too often, we observe that such misconduct is either caused by or accompanied by excessive alcohol consumption.\n\n\"It jeopardises the safety of our riders, overshadows the enjoyment and reputation of genuine cycling enthusiasts, and diverts attention from the sporting achievements.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nVan der Poel, one of cycling's modern greats, has repeatedly been the target of abuse from spectators, perhaps stemming from his intense sporting rivalry with Belgian favourite Wout van Aert.\n\nEarlier this year, van der Poel was spat at by a spectator during the E3 Saxo Classic, a race he also won.\n\nVan der Poel has been criticised for hitting back at supporters who have overstepped the mark.\n\nIn 2023, van der Poel reacted to frequent beer-throwing during a cyclo-cross race in Hulst by spitting at a group of spectators on the side of the course.\n\nIn 2022, van der Poel was arrested at his hotel, just hours before he was due to compete in the men's UCI World Championship Road Race in Wollongong, after allegedly assaulting two girls who he claimed repeatedly knocked on the door of his room during the night at the Novotel in Brighton Le Sands.\n\nThe Dutchman was later convicted of two counts of common assault and fined $1,500, but more tellingly was unable to finish the race the following day, one he was favourite to win.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-15/asx-markets-business-live-news-15-april-2025/105176872",
    "title": "Live: Wall Street rises as tariff exemptions boost tech stocks",
    "publish_date": "Mon, 14 Apr 2025 21:22:13 +0000",
    "category": "finance",
    "authors": [
      "Stephanie Chalmers",
      "Gareth Hutchens"
    ],
    "text": "The Trump administration is kicking off investigations into imports of pharmaceuticals and semiconductors as part of a bid to impose tariffs on both sectors on national security grounds, notices posted to the US Federal Register on Monday showed.\n\nThe filings set to be published on Wednesday set a 21-day deadline from that date for the submission of public comment on the issue and indicate the administration intends to pursue the levies under authority granted by Section 232 of the Trade Expansion Act of 1962. Such section 232 probes need to be completed within 270 days after being announced.\n\nThe administration of President Donald Trump has started 232 investigations into imports of copper and lumber, and probes completed in Mr Trump's first term formed the basis for tariffs rolled out since his return to the White House in January on steel and aluminum and on the auto industry.\n\nThe US began collecting 10 per cent tariffs on imports on April 5.\n\nPharmaceuticals and semiconductors are exempt from those duties, but Mr Trump has said they will face separate tariffs.\n\nHe said on Sunday (US time) he would be announcing a tariff rate on imported semiconductors over the next week, adding that there would be flexibility with some companies in the sector.\n\nThe US relies heavily on chips imported from Taiwan, something then-president Joe Biden sought to reverse by granting billions in Chips Act awards to lure chipmakers to expand production in the United States.\n\nThe investigation will include both pharmaceuticals and pharmaceutical ingredients as well as other derivative products, the notice showed.\n\nDrugmakers have argued that tariffs could increase the chance of shortages and reduce access for patients.\n\nStill, Mr Trump has pushed for the fees, arguing that the US needs more drug manufacturing so it does not have to rely on other countries for its supply of medicines.\n\nCompanies in the industry have lobbied Mr Trump to phase in tariffs on imported pharmaceutical products in hopes of reducing the sting from the charges and to allow time to shift manufacturing.\n\nLarge drugmakers have global manufacturing footprints, mainly in the US, Europe and Asia, and moving more production to the US involves a major commitment of resources and could take years.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-15/apollo-bay-camping-recreation-reserve-great-ocean-road/105138566",
    "title": "Great Ocean Road campground to get a glow-up, but not everyone's happy",
    "publish_date": "Mon, 14 Apr 2025 21:00:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "Heather Ennor remembers waking up to the sound of waves echoing through the walls of her humble caravan, parked just a stone's throw from the Great Ocean Road.\n\nNestled within the Apollo Bay Recreation Reserve, she refers to the site as \"paradise\" and her second home for seven years.\n\nMs Ennor's annual site, where she spent almost every weekend and school holidays, acted as a reprieve from daily life in Geelong.\n\nHeather Ennor and her family regularly camped at the Apollo Bay Recreation Reserve for seven years. (ABC News: Natasha Schapova)\n\nBefore long, she forged connections within the recreation reserve and the wider community, befriending regular campers and locals.\n\n\"The kids knew the park and the [people with annual sites] in the park got to know those families and they soon knew that everybody was looking out for their kids,\" Ms Ennor said.\n\n\"It was like a big family once everyone was there, especially in holiday times, everybody came.\"\n\nBut that's now a distant memory after the organisation in charge of the reserve, the Great Ocean Road Coast and Parks Authority (GORCPA), asked annual site holders like Ms Ennor to vacate in April last year.\n\nMs Ennor stayed at the site almost every weekend, and during school holidays. (Supplied)\n\nThe move is part of GORCPA's 10-year master plan to transform the reserve, which has so far received $5.5 million in state government funding.\n\nThe reserve is closed for the first stage of renovations and is due to reopen in the middle of the year, complete with 10 safari eco tents and 10 pop-up tents, along with upgrades to roads and green spaces.\n\nPreviously, the reserve had 185 sites year-round. However once it reopens, there will be 128 sites available in the high season — between the start of September and the end of April — and only 47 for the rest of the year.\n\nThe master plan will cut the number of sites from 185 to 128 in the high season and 47 in the low season. (Source: Great Ocean Road Coast and Parks Authority)\n\nBut campers are concerned the reserve will become too exclusive by significantly reducing the number of total sites and forgoing annual sites.\n\nMs Ennor said she was \"devastated\" by the changes and would not be returning to the reserve as she fears it will no longer be an affordable accommodation option.\n\nGORCPA has not released prices for the reserve, but a spokesperson said they would be in line with market rates.\n\nThe Apollo Bay Recreation Reserve has temporarily closed but is due to reopen mid-year. (ABC News: Natasha Schapova)\n\n\"If you keep changing everything there's going to be nothing for those people that can't afford to go to BIG4s or other caravan parks and the price will keep going up,\" Ms Ennor said.\n\nThe recreation reserve is the only public caravan park in Apollo Bay, with the closest public caravan parks located in the nearby towns of Marengo and Skenes Creek, each offering less than half the number of sites previously available in Apollo Bay.\n\nApollo Bay has a population of about 1,800 people but this number swells to around 15,000 during the warmer months.\n\nA GORCPA report from 2023 stated the transition to seasonal camping was supported by a commercial review of the caravan park and would help free up space for sports events.\n\nThe closest public caravan parks to the Apollo Bay Recreation Reserve are in the nearby towns of Marengo and Skenes Creek. (ABC News: Natasha Schapova)\n\nThe local council, the Colac Otway Shire, also identified that parts of the land occupied by the reserve were subject to inundation and erosion.\n\n\"This is all about making the reserve more inclusive, enjoyable and accessible for everyone who comes to experience it,\" a GORCPA spokesperson said.\n\nLocal business sees drop in sales\n\nFor the owners of Sweet View — The Great Ocean Road Lolly Shop, Graham and Sue Gentry, their business was a longtime retirement wish, granted early.\n\nThe couple opened the store in 2017 after relocating from Melbourne and have cemented themselves in the community, employing dozens of kids over their seven years in Apollo Bay.\n\nStreetview has employed dozens of kids from the Apollo Bay community, including some that would stay at the recreation reserve over weekends and school holidays. (ABC News: Natasha Schapova)\n\nMany of the teenagers they employed were those who regularly camped at the reserve with their families, on weekends and during school holidays.\n\nSix of their teenage staff members quit due to a lack of accommodation after being forced out of the recreation reserve last year.\n\nMr Gentry thinks back to his most fruitful days in business, when customers poured in from the recreation reserve, keeping him afloat even during the quieter periods.\n\nHe said the reduction in clientele had been palpable since annual sites were removed in April last year, costing him between $10-15,000 a year in sales.\n\nLolly shop owner Graham Gentry says he's already noticed a drop in sales since the reserve's annual site permits were discontinued. (ABC News: Natasha Schapova)\n\n\"There is a lack of customers over the quieter winter holidays — normally the rec reserve would have people in there,\" he said.\n\n\"The rec reserve are the visitors that utilise our shop a lot, along with the pubs and the supermarket.\"\n\nThe reserve's popularity grew by 6 per cent between 2021 and 2024, with an average total occupancy rate of 27 per cent last year, according to GORCPA.\n\n\n\nIn the high season, between the start of September and the end of April, occupancy rates rose from an average of 29 per cent in 2021 to 39 per cent last year.\n\nGraham Gentry and his wife opened up the lolly shop in Apollo Bay in 2017. (ABC News: Natasha Schapova)\n\nOccupancy rates in the low season, between the start of May and the end of August, increased from 3 per cent in 2021 to 7 per cent last year.\n\nAlongside being an affordable accommodation option for Apollo Bay visitors, Mr Gentry said the reserve also doubled as a housing option for essential workers struggling to secure a rental property.\n\n\"I don't think [the recreation reserve is] going to get utilised the way [GORCPA] believe they are going to get utilised,\" Mr Gentry said.\n\n\"I think there's a lot of people in Torquay, Geelong, the city, making decisions on a town that they've actually got no idea about.\"\n\nFootball netball club fears sponsorships will dwindle\n\nWithin the reserve lies the Apollo Bay Football Netball Club — a community centrepiece for nearly a century.\n\nWith more than 200 players across the two sports, an average of 500 spectators regularly swarm to the oval, which is separated from the ocean by just a sandbar, a pony club and the Great Ocean Road.\n\nIt's a humble club housed within a well-loved building, offering winter sport as a reprieve to local players who would otherwise have to brave a long and windy drive to Colac or Geelong.\n\nMichael Wright fears changes to the recreation reserve would impact businesses and therefore sponsors of his club. (ABC News: Natasha Schapova)\n\nBut club president Michael Wright fears a decrease in campsites would have a domino effect on the club by putting local businesses — the club's key sponsors — under financial stress.\n\n\"If their businesses are impacted in a financial way then that may impact on their ability to sponsor our local community clubs such as ours,\" he said.\n\n\"Our numbers are continuing to grow however it's a matter of being able to afford that and being able to afford that and to deck out our players out in uniform, and balls and equipment and also paying associated costs.\"\n\n'Run-down' reserve needed upgrading\n\nDespite some community backlash, the group representing Apollo Bay residents says the reserve was \"run-down\" and in need of upgrades.\n\n\"We do particularly support some of the upgrades proposed: the community playground, all abilities playground, upgrades to the toilets to make them more accessible, some of the changes to the sports areas, particularly female-friendly change facilities,\" Apollo Bay Community Voice vice president Graham Costin said.\n\n\"It will bring the standard of this reserve up to the standard of commercial providers, and we look forward to that,\" Mr Costin said.\n\nApollo Bay Community Voice vice president Graham Costin says upgrades to the reserve were overdue. (ABC News: Natasha Schapova)\n\nIn the year to September 2024, the Colac Otway Shire had 963,000 visitors, contributing just over $200 million to the local economy.\n\nThe board representing regional tourism along the Great Ocean Road is supportive of diversifying accommodation offerings across the region to cater for all markets.\n\nGreat Ocean Road Regional Tourism general manager Liz Price said it welcomed GORCPA's master plan and that free camping sites were available through Parks Victoria.\n\n\"Glamping will create new audiences for the rec reserve and hopefully encourage year-round stays,\" she said.",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-15/federal-election-2025-live-updates-albanese-dutton-campaign-/105175764",
    "title": "Live: Albanese downplays risk to extend access to first home buyer scheme",
    "publish_date": "Mon, 14 Apr 2025 20:58:42 +0000",
    "category": "finance",
    "authors": [
      "Courtney Gould",
      "Andrew Thorpe",
      "Joshua Boscaini",
      "Tom Crowley",
      "On The Trail With Dutton"
    ],
    "text": "A reporter asks Dutton about the rediscovery of the grassland earless dragon, which she says is holding up the construction of tens, if not hundreds of thousands of homes in Victoria.\n\n\"Will you commit to fast-tracking that process [of protecting the dragon's habitat]?\" she asks.\n\nShe adds a follow-up, too, about whether Victorian Liberal leader Brad Battin's reluctance to back the federal Coalition's nuclear policy is a problem.\n\nThe opposition leader decides to speak about the government's record on environment issues more generally, touching on the relationship between the PM and Tanya Plibersek — which he says \"clearly went sour\" — and its push to take back inner-city seats from the Greens.\n\nHe does say \"we would deal with matters as quickly as possible and get approvals in place,\" though.\n\nIn relation to nuclear energy, he simply asks those present to \"look at the top 20 economies in the world\".",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/politics/federal/federal-election-2025-live-voters-weigh-in-on-trump-impact-to-election-campaign-dutton-quizzed-again-over-son-s-house-deposit-20250415-p5lrrg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Federal election 2025 LIVE updates: Dutton’s son joins him on campaign trail again amid housing deposit questions; PM sets sights on third term",
    "publish_date": "Tue, 15 Apr 2025 11:56:10 +1000",
    "category": "finance",
    "authors": [
      "Sarah Mcphee"
    ],
    "text": "In a campaign increasingly dominated by housing, Anthony Albanese has argued his polices will add to property supply while the Coalition’s will only add to home prices.\n\nBoth parties used their campaign launches on Sunday to announce big housing plans. The Coalition will allow first home buyers earning less than $240,000 year to claim up to $12,000 a year in mortgage interest off their tax for five years.\n\nThe government has promised to effectively act as a guarantor for first home buyers so they will only require a 5 per cent deposit on a loan. It is also planning a $10 billion injection of grants and equity into schemes to build 100,000 homes for first time buyers over the next 8 years.\n\nEconomists have criticised both sides, arguing they will add to price house growth.\n\nBut Albanese said since coming to office the government had pursued policies aimed at lifting the number of homes built across the country, accusing the Coalition and Greens of actively blocking them.\n\nHe accused economic critics of not looking at the government’s policies.\n\n“Some of the things that they’ve spoken about don’t match what we’re actually doing,” he said.\n\n“The key difference between the two approaches is supply. We have a supply side answer on public housing through the Housing Australia Future Fund. On private rentals through the build-to-rent scheme. On home building and construction for first home buyers.\n\n“If you just have demand side measures, which is what they [the Coalition] have, then you put upward pressure on prices.”",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/sport/rory-mcilroy-the-baseball-superstar-and-the-inside-story-behind-this-moment-20250415-p5lruh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rory McIlroy, the baseball superstar and the inside story behind this moment",
    "publish_date": "Tue, 15 Apr 2025 11:55:12 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "It will go down as one of the most iconic images in Masters history. An emotional Rory McIlroy on his knees at the 18th, sobbing with relief after winning a playoff and ending the torment of decades of near-misses and despair.\n\nBut this photograph also has a hidden layer of sporting fame. It was taken by a Hall of Fame baseballer.\n\nRory McIlroy on the 18th green after winning the Masters. Credit: Augusta National/Ken Griffey Jr/Getty Images\n\nKen Griffey Jr. is a former American outfielder who played in Major League Baseball for over two decades, and he was no slouch. Playing for the Seattle Mariners, Cincinnati Reds and Chicago White Sox, Griffey was a 13-time All-Star and sits at seventh on the list of most home runs, with 630.\n\nBut since retiring in 2010, Griffey has also become an enthusiastic sports photographer and he was invited to shoot the Masters last week, for the tournament website Masters.com.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/back-off-boomer-you-didn-t-have-to-go-bush-to-buy-a-house-20250415-p5lrtz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Back off Boomer! You didn’t have to go bush to buy a house",
    "publish_date": "Tue, 15 Apr 2025 11:53:37 +1000",
    "category": "finance",
    "authors": [
      "Meg Kanofski"
    ],
    "text": "Like many Gen Zs, I’ve come to terms with the fact I will never be able to give my hypothetical future children the opportunities I was afforded: opportunities like their own bedrooms.\n\nYoung Sydneysiders are frequently told there are homes available, we’re simply too precious to move further away to get them. As an only child, “spoilt princess” allegations are nothing new, but I won’t accept them staining the record of our generation. Here’s the truth defence.\n\nIllustration by Andrew Dyson Credit:\n\nThe average Australian loan size of about $660,000 has been thrown around a lot this election season. Let’s do a quick search for houses listed for under $700,000 in Greater Sydney (that surely won’t sell for a penny under $800,000 at auction). Hurrah, maybe the Boomers have got it right after all. Cancel the Netflix subscription and get saving because results are popping up.\n\nMany of them are in the foothills of the Blue Mountains. I can sense the charge of “indulged” on the tip of your tongue, but hold on. This isn’t about refusing to leave the inner-city suburb with the best iced strawberry matcha. For someone who works in-office at least four days a week – with no option of paying for parking without taking out … a mortgage – it’s a mega-commute.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/culture/art-and-design/faces-can-be-trains-buses-mountains-this-unique-artist-might-turn-your-world-on-its-head-20250414-p5lrkv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Faces can be trains, buses, mountains’: This unique artist might turn your world on its head",
    "publish_date": "Tue, 15 Apr 2025 11:45:40 +1000",
    "category": "entertainment",
    "authors": [
      "Matthew Westwood"
    ],
    "text": "Thom Roberts is in his element as he weaves through the crowd, greeting friends and well-wishers with a hug, a tap on their head or by gently placing two fingers across their brow. It is the opening night of The Immersive World of Thom Roberts at the National Portrait Gallery in Canberra.\n\n“Faces can be trains, buses, mountains, the stone rock and the same the other way around”: Thom Roberts Credit: Martin Ollman\n\nWith 100 works from across the past decade of Roberts’ professional art-making career, the exhibition is a substantial solo show for an artist with lived experience of intellectual disability. Roberts, 49, can be shy and a little reserved, but tonight he is exuberant.\n\nGovernor-General Sam Mostyn is here to officially open the show. Roberts has dubbed her “the Excellent Antonio”, and she gets a tap on the head, too. Later, when the crowd cheers its approval at Roberts, he raises both arms above his head in a show of victory.\n\nThe exhibition brings together Roberts’ paintings and works on paper, painted sculptures, installations and animations. The subjects are people but also trains, skyscrapers, fast-food motifs and Muppets.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/environment/climate-change/how-risk-of-climate-disasters-is-leaving-suburbs-looking-like-a-boxer-s-mouth-20250414-p5lrpe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The electorates most exposed to climate risk revealed",
    "publish_date": "Tue, 15 Apr 2025 11:44:00 +1000",
    "category": "finance",
    "authors": [
      "Caitlin Fitzsimmons"
    ],
    "text": "The climate crisis is already here for one in 23 properties in Australia that are at high risk of natural disasters fuelled by global warming.\n\nThe analysis by Climate Valuation on behalf of the Climate Council considered risks of flooding, bushfires, tropical cyclone winds, coastal inundation and extreme wind for 15 million commercial and residential properties.\n\nAcross Australia, 652,424 homes and businesses are at high risk and another 1.55 million are at moderate risk and facing abnormally high insurance costs.\n\nClimate Councillor and economist Nicki Hutley said the main risk was the natural disaster itself, but the second problem was insurance costs. In areas where climate risk was high, insurance companies were charging $20,000-30,000 for premiums or offering a basic package with flood or fire cover excised.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/galvin-set-be-dropped-for-tigers-clash-with-eels-20250415-p5lrse.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tigers set to drop Galvin, Moses in line to return for Eels on Easter Monday",
    "publish_date": "Tue, 15 Apr 2025 11:40:56 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi",
      "Michael Chammas"
    ],
    "text": "Lachlan Galvin looks set to be axed by the Wests Tigers for their Easter Monday clash against Parramatta.\n\nThe news that the wantaway five-eighth is set to be dropped comes as Parramatta are poised to welcome back halfback Mitchell Moses two weeks earlier than expected, with the Eels playmaker to be named in the squad on Tuesday afternoon.\n\nLachlan Galvin Credit: Getty/NRL Imagery\n\nSources with knowledge of the situation not authorised to speak publicly confirmed Adam Doueihi was in line to wear Galvin’s No.6 jersey against the Eels.\n\nAs for Moses, he hasn’t played for the Eels this year due to a foot injury and wasn’t due to return until round nine. He will be named in the squad on Tuesday afternoon and is firming to take his place in the team against his former club.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/business/markets/australian-sharemarket-set-to-open-higher-20250415-p5lrr9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian sharemarket lifts on open, led by energy stocks",
    "publish_date": "Tue, 15 Apr 2025 11:40:28 +1000",
    "category": "finance",
    "authors": [
      "Gemma Grant"
    ],
    "text": "The Australian sharemarket has opened slightly higher on Tuesday following a positive lead from Wall Street overnight after a day of relative calm in US markets.\n\nThe S&P/ASX200 was up 11.5 points, or 0.2 per cent, to 7760.1 points as of 10.38am AEST. The Aussie dollar also strengthened, fetching US63.29¢ shortly after the market opened.\n\nInvestors are struggling to game out the economic spillovers of the trade war given the back-and-forth in negotiations. Credit: Dominic Lorrimer\n\nThe energy sector was among the best performers in morning trade, with Santos lifting 1.7 per cent. Woodside Energy was also in the green, up 0.6 per cent. The results come as petrol prices across most Australian capitals are slated to fall, following the fallout from Donald Trump’s tariff announcements.\n\nThe big four banks were mixed during the morning trade, with Commonwealth Bank – the nation’s biggest lender – up 0.3 per cent. NAB shed 0.4 per cent while ANZ lost 0.3 per cent and Westpac was trading flat.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/who-is-isaac-moses-and-why-does-he-have-so-much-influence-on-the-nrl-20250415-p5lrsv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Who is Isaac Moses and why does he have so much influence on the NRL?",
    "publish_date": "Tue, 15 Apr 2025 11:36:56 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "At a time when the influence of NRL player managers is again in the spotlight, there is none more powerful than Isaac Moses.\n\nUpon graduating from Parramatta Marist High School, Moses worked at ANZ Stadium in membership under Todd Greenberg, the future chief executive of the NRL and then Cricket Australia. Moses then moved into player management, initially with other established agents, before branching out on his own.\n\nWhy does Moses wield so much influence?\n\nMoses’ Cove Agency manages some of the NRL’s biggest names, from established stars Mitchell Moses and Luke Brooks to young guns Lachlan Galvin and Blaize Talagi. He also has a slew of head coaches – including Newcastle’s Adam O’Brien, St George Illawarra’s Shane Flanagan, Manly’s Anthony Seibold, New Zealand’s Andrew Webster and North Queensland’s Todd Payten – on his books.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/national/victoria/review-calls-for-dismissal-of-exam-authority-board-following-vce-bungle-20250415-p5lrts.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Review calls for dismissal of exam authority board following VCE bungle",
    "publish_date": "Tue, 15 Apr 2025 11:36:07 +1000",
    "category": "finance",
    "authors": [
      "Alex Crowe",
      "Rachel Eddie"
    ],
    "text": "A review of last year’s VCE exam bungle has revealed systemic shortfalls in the management of Victoria’s curriculum authority and recommended the dismissal of its board to avoid a repeat of the scandal, which advantaged thousands of students over their peers.\n\nThe report published on Tuesday found sample cover pages containing exam content had been viewed about 6000 times.\n\nEducation Minister Ben Carroll ordered the review of the scandal after questions on 65 VCE exams were leaked. Credit: Chris Hopkins\n\nSome students saved the sample cover pages directly to their hard drives, internet forum activity revealed, but the review was unable to determine how many students had done so.\n\nThe report made eight recommendations, including instating a new Victorian Curriculum and Assessment Authority (VCAA) board and creating a more senior executive role to improve accountability.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/basketball/aussie-picked-sixth-in-wnba-draft-20250415-p5lrvp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie picked sixth in WNBA draft",
    "publish_date": "Tue, 15 Apr 2025 11:34:49 +1000",
    "category": "sports",
    "authors": [],
    "text": "Aussie picked sixth in WNBA draft\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 11
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/experts-stumped-as-wrampling-escapes-20250415-p5lrvl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Experts stumped as Wrampling escapes",
    "publish_date": "Tue, 15 Apr 2025 11:30:16 +1000",
    "category": "finance",
    "authors": [],
    "text": "Experts stumped as Wrampling escapes\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/rugby-union/could-oconnor-take-on-the-lions-20250415-p5lrvm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Could O'Connor take on the Lions?",
    "publish_date": "Tue, 15 Apr 2025 11:29:58 +1000",
    "category": "sports",
    "authors": [],
    "text": "Could O'Connor take on the Lions?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/politics/well-help-them-with-the-deposit-at-some-stage-dutton-20250415-p5lrvk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'We'll help them with the deposit at some stage': Dutton",
    "publish_date": "Tue, 15 Apr 2025 11:28:51 +1000",
    "category": "finance",
    "authors": [],
    "text": "'We'll help them with the deposit at some stage': Dutton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/goodfood/recipes/quick-fish-and-cauliflower-skillet-pie-with-horseradish-20250227-p5lfrb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Quick fish and cauliflower skillet pie with horseradish",
    "publish_date": "Tue, 15 Apr 2025 11:26:11 +1000",
    "category": "lifestyle",
    "authors": [
      "Jessica Brook"
    ],
    "text": "Preheat the oven to 200C fan-forced (220C conventional). Melt the butter in a 22cm-diameter skillet over medium heat. Add the cauliflower, season with salt and pepper, and cook for 4 minutes.\n\nStep 2\n\nDust the fish fillet with flour. Add the fish, tarragon, sour cream, cream and horseradish to the skillet and season with salt and pepper. Lay the pastry strips across the skillet, overlapping slightly. Press them over the edges of the skillet and brush the top with extra butter.",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/money/borrowing/spending-super-on-housing-could-ruin-your-retirement-here-s-a-better-idea-20250415-p5lrti.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Spending super on housing could ruin your retirement. Here’s a better idea",
    "publish_date": "Tue, 15 Apr 2025 11:24:24 +1000",
    "category": "finance",
    "authors": [
      "Grace Bacon"
    ],
    "text": "Should I raid my super to buy a home? It’s the question more young Australians are asking, as the great Australian dream of homeownership that their parents and grandparents enjoyed moves further out of their reach.\n\nAt an age where they’d traditionally be looking to buy, many in their 20s and 30s are disillusioned by the unattainable property prices, high interest rates, stagnating wage growth and continuing cost of living pressures that put a dampener on their homeownership goals.\n\nTreating super as a piggy bank risks undermining the very reason our superannuation system was established. Credit: AFR\n\nWith politicians of both sides of the aisle searching for viable solutions, the debate continues over whether it’s wise to allow young Australians to access superannuation to buy their first home.\n\nGenerally, securing a home loan means providing a 20 per cent deposit, which can equate to upwards of $200,000 in major metropolitan areas. That’s a significant amount to save at a time of life when you may be juggling student debt, rent, childcare and early career responsibilities.",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/the-vampire-diaries-stars-arielle-kebbel-and-zach-roerig-confirm-romance-20250415-p5lrv7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Vampire Diaries stars Arielle Kebbel and Zach Roerig confirm romance",
    "publish_date": "Tue, 15 Apr 2025 11:09:25 +1000",
    "category": "finance",
    "authors": [],
    "text": "The Vampire Diaries stars Arielle Kebbel and Zach Roerig confirm romance\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.smh.com.au/money/investing/bold-and-chunky-80s-knits-are-back-in-fashion-if-you-can-afford-them-20250415-p5lrtd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bold and chunky, 80s knits are back in fashion (if you can afford them)",
    "publish_date": "Tue, 15 Apr 2025 11:00:24 +1000",
    "category": "finance",
    "authors": [
      "Stephen Crafti"
    ],
    "text": "Knitwear reached its zenith in the 1980s, with bold graphics and oversized silhouettes ruling the roost. From knitted coats to long tube skirts (knitted as one piece), these 1980s designs weren’t complete without large shoulder pads a gridiron player would be proud to wear.\n\nThis writer produced knitwear in the 1980s, oversized, unisex and often Japanese-inspired. While one can’t simply relive that fashion period, there have been rumblings of its return for the last few years.\n\nJenny Kee’s Blinky Jumper, famously worn by Princess Diana in the 80s.\n\nPiero Gesualdi was at the epicentre of 1980s fashion with his boutiques in both Melbourne and in Sydney. Knitwear featured strongly throughout the decade, starting with discovering John Ashpool’s collections in the late 1970s, with Jean Paul Gaultier and Claude Montana making a statement from the early 1980s.\n\n“The prices were high even at that time, starting at $500 and heading north to $2,000, a figure that would equate to up to $12,000 in today’s value,” says Gesualdi, who was the first retailer to carry the Crafti label, with a respectable price tag of $240.",
    "source": "SMH",
    "cluster_id": 36
  },
  {
    "url": "https://www.smh.com.au/politics/pm-deflects-question-on-converting-golf-courses-into-homes-20250415-p5lruy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "PM deflects question on converting golf courses into homes",
    "publish_date": "Tue, 15 Apr 2025 10:52:42 +1000",
    "category": "sports",
    "authors": [],
    "text": "PM deflects question on converting golf courses into homes\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/after-steep-premium-hikes-australias-insurance-companies-post-6-1-billion-profit/bloy0i5hf",
    "title": "After steep premium hikes, Australia's insurance companies post $6.1 billion profit",
    "publish_date": "Tue, 15 Apr 2025 00:34:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Insurance companies have collectively banked $6.1 billion in annual profit after raising premiums and facing fewer significant weather events.\n\n\n\n\n\nAustralia's insurance industry recorded an annual after-tax profit of $6.1 billion in 2024, according to financial consultancy firm KPMG's annual review of the sector.\n\n\n\n\n\nThat's three times higher than the five-year average of $2 billion.\n\n\n\nThere were no weather catastrophes in 2024 and only two significant events — the Valentine's Day storms in Victoria and severe weather in NSW and Queensland in April.\n\n\n\n\n\nInsurance companies had $566 million in losses from 49,000 claims, well down from the $2.356 billion paid out across 143,900 claims from catastrophes and significant events in 2023.\n\n\n\n2024 a 'benign weather year'\n\nKPMG assurance and risk partner Scott Guse said 2024 was a benign weather year for insurers.\n\n\n\n\n\n\"We probably recall the massive Christmas Day storms that went through the Gold Coast and hinterland in December 2023 and we all recall the most recent Cyclone Alfred in February and March this year,\" he told AAP.\n\n\n\n\n\n\"They didn't get caught in this particular year that we're looking at.\n\n\n\n\n\n\"It's really those catastrophic weather events that drive or make the insurance result.\"\n\n\n\n\n\nAs such, insurance-related profits totalled $3.1 billion, with the other $3 billion coming from investment income, also triple the five-year average.\n\n\n\n\n\n\"That shouldn't be surprising to the public because most of us saw good investment returns for our superannuation funds in 2024,\" Guse said.\n\n\n\nAnnual premium revenue jumped from $65.5 billion to $68 billion from 2023 to 2024.\n\n\n\n\n\nThe average customer paid 19.3 per cent more for home insurance coverage ($1277 up from $1070) and 12 per cent more for car insurance coverage ($845 up from $945).\n\n\n\n\n\nThe return to positive profits was a sign double-digit premium hikes were hopefully behind customers, Guse said.\n\n\n\n\n\n\"We do need our insurers to be viable and survive, and to do that they need to make profit,\" he said.\n\n\n\n\n\n\"Because they were making losses, they need to put through price increases.\n\n\n\n\n\n\"But on top of that we then saw, through COVID, supply-chain issues, price inflation, the cost of builders all going up.\"\n\n\n\nInsurers continue to face pressure from the increasing frequency, severity and longevity of natural disasters, including floods, bushfires and cyclones.\n\n\n\n\n\nGuse said it was impossible to tell what was around the corner amid climate change.\n\n\n\n\n\n\"We always know that it's a bad season from October through to May and we're not through that season as yet,\" he said.\n\n\n\n\n\n\"The profits that were made last year could be largely eroded if we have a bad year.\"\n\n\n\n\n\nWithout more intervention, the report warned premium costs would continue to rise in high-risk areas and make insurance unaffordable for many customers.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/article/how-common-are-errors-in-ivf-labs-can-they-be-prevented/c004lrulb",
    "title": "How common are errors in IVF labs? Can they be prevented?",
    "publish_date": "Mon, 14 Apr 2025 21:27:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "The news of a woman unknowingly giving birth to another patient’s baby after an embryo mix-up at a Brisbane IVF lab has made headlines in Australia and around the world. The distress this incident will have caused to everyone involved is undoubtedly significant.\n\n\n\n\n\nA report released by Monash IVF, the company which operates the Brisbane clinic, states it \"adheres to strict laboratory safety measures (including multi-step identification processes) to safeguard and protect the embryos in its care\".\n\n\n\n\n\nIt also says the company’s own initial investigation concluded the incident was \"the result of human error\".\n\n\n\n\n\nAn independent investigation will follow which presumably will shed light on how human error could occur when multi-step identification processes are in place.\n\n\n\n\n\nOn a broader level, this incident raises questions about how common IVF errors are and to what extent they’re preventable.\n\n\n\nLISTEN TO \"Very rare\" IVF mix up expected to lead to renewed policies, regulation SBS News 11/04/2025 06:25 Play\n\nThe booming IVF industry\n\nBecause people have children later in life than they used to, some struggle to conceive and turn to assisted reproductive technologies.\n\n\n\n\n\nThese include in-vitro fertilisation (IVF) and intracytoplasmic sperm injection (ICSI) which both involve handling of sperm and eggs (gametes) in the laboratory to form embryos. If there’s more than one embryo available after a treatment cycle, they can be frozen and stored for later use.\n\n\n\nIncreasingly, assisted reproductive technologies are also being used by single women, same-sex couples, and women who freeze their eggs to preserve their fertility.\n\n\n\n\n\nFor these reasons, the fertility industry is booming. In 2022 there were more than 100,000 assisted reproductive treatment cycles performed in Australian fertility clinics, up more than 25 per cent on the number of cycles performed in 2017.\n\n\n\nRegulation of the IVF industry\n\nIn Australia, the IVF industry is more regulated than in many other parts of the world.\n\n\n\n\n\nTo operate, clinics must be licensed by the Reproductive Technology Accreditation Committee and adhere to its code of practice.\n\n\n\n\n\nIn relation to storage and accurate identification of embryos, the code states clinics must provide evidence of the implementation and review of:\n\n\n\nPolicies and procedures to identify when, how and by whom the identification, matching, and verification are recorded for gametes, embryos and patients at all stages of the treatment process including digital and manual record-keeping.\n\nThe code further states clinics must report serious adverse events to the Reproductive Technology Accreditation Committee. The list of what’s considered a serious adverse event includes any incident that \"arises from a gamete or embryo identification mix up\".\n\n\n\n\n\nClinics must also adhere to the National Health and Medical Research Council’s ethical guidelines on the use of reproductive technology in clinical practice and research.\n\n\n\n\n\nLastly, states and territories have laws that regulate aspects of the IVF industry such as requirements to report adverse events and other data to state authorities.\n\n\n\nThousands of pregnancies in Australia each year are conceived using assisted reproductive technologies. Source: Shutterstock, The Conversation / Lee Charlie In the United Kingdom, the Human Fertilisation and Embryology Authority regulates the IVF industry and requires clinics to report adverse incidents. These are reported as grade A, B or C, where A is the most serious and involves \"severe harm to one person, or major harm to many\". Data on adverse incidents is reported in a publicly available annual report.\n\n\n\n\n\nIn the United States, however, the IVF industry is largely unregulated, and clinics don’t have to report adverse incidents. However, the American Society for Reproductive Medicine states clinics should have rigorous procedures to prevent the loss, damage, or misdirection of gametes and embryos and have an ethical obligation to disclose errors to all impacted patients.\n\n\n\nHow common are IVF errors?\n\nThere’s no global data on IVF errors so it’s not possible to know how common they are. But we learn about some of the more serious incidents when they’re reported in the media.\n\n\n\n\n\nWhile the recent embryo mix-up is the first known incident of this nature in Australia’s 40-year IVF history, we have seen reports of other errors in Australian clinics. These include the alleged use of the wrong donor sperm, embryos being destroyed due to contamination, and inaccurate genetic testing which resulted in the destruction of potentially viable embryos.\n\n\n\nIn the UK, the Human Fertilisation and Embryology Authority’s most recent report states there was one Grade A incident in 2023–24. This was the first Grade A incident reported since 2019–20 when there were two.\n\n\n\n\n\nIn the US some notable errors include storage tank malfunctions in two clinics which destroyed thousands of eggs and embryos.\n\n\n\n\n\nLawsuits have also been filed for embryo mix-ups. In a 2023 case a woman from Georgia delivered a Black baby even though she and her sperm donor are both white. The biological parents subsequently demanded custody of the child. Despite wanting to raise him the woman who had given birth gave up the five-month-old boy to avoid a legal fight she couldn’t win, she said.\n\n\n\n\n\nIn the US, some argue most errors go unreported because reporting is not mandated and due to the absence of meaningful regulation.\n\n\n\nThere’s no global data on IVF errors, so we don’t know how common they are. Source: Shutterstock, The Conversation / SeventyFour\n\nAre IVF errors preventable?\n\nDespite Australia’s stringent regulation and oversight of the IVF industry, an incident with far-reaching psychological and potentially legal consequences has occurred.\n\n\n\n\n\nUntil the independent investigation reveals how \"human error\" caused this mix-up, it’s not possible to say what additional measures Monash IVF should take to ensure this never happens again.\n\n\n\nAn IVF laboratory is a high-pressure environment, and any investigation should look at whether staffing levels are adequate. Staff training is also relevant, and it’s essential all junior lab staff have adequate supervision.\n\n\n\n\n\nFinally, perhaps Australia should adopt the UK’s model and make data about adverse events reported to the Reproductive Technology Accreditation Committee, available to the public in an annual report. To reassure the public, this report could include what measures clinics take to avoid the errors happening again.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/article/10-out-of-10-katy-perry-among-all-female-celebrity-crew-on-jeff-bezos-blue-origin-rocket/5zy4wglaz",
    "title": "'10 out of 10': Katy Perry among all-female celebrity crew on Jeff Bezos' Blue Origin rocket",
    "publish_date": "Mon, 14 Apr 2025 20:45:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points Katy Perry joins first all-female spaceflight since 1963 aboard Blue Origin.\n\nThe six women experienced weightlessness on an 11-minute suborbital flight.\n\nBlue Origin’s New Shepard aims to make space tourism more affordable long-term.\n\nPop star Katy Perry and five other women launched into space on a Blue Origin rocket and successfully returned to Earth overnight, marking the first all-female spaceflight in more than 60 years.\n\n\n\n\n\nThe crew lifted off from West Texas at 9.31am Monday local time and travelled to the edge of space, where they experienced a brief period of weightlessness before returning to Earth in a flight lasting around 11 minutes, according to a live broadcast by Blue Origin, the space company founded by billionaire Jeff Bezos.\n\n\n\n\n\nThe spaceflight was a high-profile success for Bezos' New Shepard launch vehicle, which has been developed for space tourism.\n\n\n\nREAD MORE Above the sharks: Historic space mission captures images of Australia as it returns to Earth\n\nThe six-person crew also included Bezos' fiancée Lauren Sanchez, CBS host Gayle King, former NASA rocket scientist Aisha Bowe, scientist Amanda Nguyen and film producer Kerianne Flynn.\n\n\n\n\n\nKing said that when the crew returned to their seats after weightlessness, Perry sang the Louis Armstrong song What a Wonderful World.\n\n\n\n\n\n\"I feel super connected to love,\" Perry said after landing back on Earth.\n\n\n\n\n\n\"It's a 10 out of 10. That's my review. Definitely go for it.\"\n\n\n\nPerry was holding a daisy, a flower she took into space, to remind her of her daughter, Daisy.\n\n\n\n\n\nAmong celebrities in attendance at the launch pad were a tearful Oprah Winfrey, a close friend of King, and show business personalities Kris Jenner and Khloe Kardashian.\n\n\n\n\n\nIt was the first all-female spaceflight since Soviet cosmonaut Valentina Tereshkova — the first woman in space — orbited Earth during a nearly three-day solo flight in 1963.\n\n\n\nBlue Origin does not disclose the average cost of a seat on one of its rockets. On its website, the company says potential passengers have to pay US$150,000 ($237,000) in the form of a refundable deposit to start the \"order process.\"\n\n\n\n\n\nIn 2021, the company revealed the highest bid for a seat on its New Shepard spacecraft was US$28 million ($44.2 million). That same year, Star Trek actor William Shatner flew free of charge as a guest of Blue Origin.\n\n\n\nREAD MORE Amazon's Jeff Bezos aims to take people to the moon by 2024\n\nBlue Origin says on its website it aims to radically reduce the cost of access to space, with its rockets designed for reusability.\n\n\n\n\n\nLoizos Heracleous, a professor of strategy and organisation at Warwick Business School in Britain, estimates each launch of the New Shepard costs between US$1 million ($1.58 million) and US$3 million ($4.74 million).\n\n\n\n\n\n\"It will take a long long time before space tourism can be a financially sustainable business available to the public at large,\" Heracleous said.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/article/australias-real-estate-industry-has-pumped-70m-into-homely-but-is-it-playing-fair/bk273znk4",
    "title": "Australia's real estate industry has pumped $70 million into Homely, but is it playing fair?",
    "publish_date": "Mon, 14 Apr 2025 19:44:20 +0000",
    "category": "finance",
    "authors": [],
    "text": "If you've sold or leased a property through a real estate agent in the last few years, you'll probably be familiar with the advertising process: Your agent suggests some property listing platforms, organises for an ad to be placed — perhaps even arranges styling and photography — and then bills you for the cost.\n\n\n\n\n\nThis practice, known as vendor-paid advertising (VPA), only exists in a few countries around the world.\n\n\n\n\n\nThe VPA model — along with the market dominance of property listing companies realestate.com.au and Domain — has given Australia the most expensive real estate advertising fees in the world.\n\n\n\n\n\nThe increasingly steep prices set by the two major players will also be familiar to those who've sold or leased property in recent years.\n\n\n\n\n\nWhat may come as a surprise, however, is that some agents are receiving a monthly cashback incentive to help promote a third company — one seeking to disrupt the market dominance of the other two — Melbourne-based listing platform Homely.\n\n\n\nSBS News has received information from a source close to the company suggesting more than 200 agencies around Australia are taking part in the scheme.\n\n\n\n\n\nParticipating real estate agents can get a monthly cashback payment worth around a third of the fees paid to Homely for advertising and marketing purposes. The question, however, is whether vendors are told by their agent about this incentive — and how much, if any, of the money paid back to agents is coming out of vendors' pockets.\n\n\n\n\n\nBoth monetary and non-monetary incentives that are not disclosed to vendors, sometimes referred to as 'kickbacks', are illegal in Australia.\n\n\n\n\n\nHomely denies the scheme is facilitating kickbacks, saying it's a \"legitimate marketing services program\" and that the money being returned to real estate agents comes from membership fees paid by the agents to Homely, rather than vendors.\n\n\n\n\n\nSome experts say it's a relationship that should be transparent.\n\n\n\nAustralia is among the most expensive places to sell property, partly due to the dominance of realestate.com.au and Domain. Source: AAP / Paul Miller\n\nA 'jumbo' challenger, with industry backing\n\nHomely started in 2007 as a website called StreetAdvisor, through which Australians could share ratings and reviews of streets and suburbs.\n\n\n\n\n\nIt transitioned into a property listing company in 2014, offering agents a free listing service without \"any obligation to upgrade\". Three years later, it was promoting itself as the \"third largest national real estate portal in Australia\".\n\n\n\n\n\nIn August 2024, the company announced a listings syndication partnership with Gumtree \"to create a jumbo No. 3 challenger\" to realestate.com.au and Domain, industry media outlet Aim Group reported.\n\n\n\n\n\nA spokesperson for Gumtree told SBS News the company was \"not aware of this [Homely's cashback] program or involved in any way\".\n\n\n\nAccording to promotional material, Homely has convinced more than 700 Australian real estate directors, principals, and other industry figures to buy a direct stake in the company.\n\n\n\n\n\nIt has collected over $70 million from these investors, whom it variously describes as \"members\" or \"strategic partners\".\n\n\n\n\n\nAn internal company marketing slideshow from 2020 boasts that they include notable industry figures such as Barry Plant (of Barry Plant Real Estate Agents), Dean O'Brien (of OBrien Real Estate), and former Real Estate Institute of New South Wales board member Ewan Morton.\n\n\n\n\n\nThe involvement of the industry is something Homely is keen to emphasise.\n\n\n\n\n\nIn an April 2024 mailout to agencies, co-CEOs and founders Jason and Adam Spencer said they want \"to introduce a cost-effective, industry-owned portal that champions significant industry involvement\".\n\n\n\n\n\nBut are the interests of the industry always compatible with those of property owners?\n\n\n\nLISTEN TO Money laundering crackdown targets real estate agents, lawyers and accountants SBS News 09/07/2024 05:33 Play\n\n'We want to give back to the industry'\n\nIn a February 2024 webinar, a Homely representative told existing and prospective investors: \"We want to be the industry player here.\"\n\n\n\nWe want to give back to the industry.\n\nThe representative then explained how the company proposes to do this, telling attendees Homely would offer agents \"monthly cashback incentives\", equal to roughly 35 per cent of an agency's total advertising spend with Homely, paid back on one condition: That the agent helps promote and market Homely.\n\n\n\n\n\nThe webinar presenter explained this can be done through \"simple marketing tasks that are set and forget\", for example, putting a Homely sticker on a shopfront window, writing an app review for Homely or posting a link to a Homely listing on social media.\n\n\n\n\n\nThe incentives are a revenue-sharing component of the company's 'Homely Plus Uplift' program.\n\n\n\nAn internal spreadsheet seen by SBS News shows almost 200 real estate agencies nationwide were taking part in Uplift as of early 2024.\n\n\n\n\n\nAccording to SBS News' source, dozens more have joined since.\n\n\n\n\n\nMany of these are branches of well-known agencies such as Ray White, LJ Hooker, Raine and Horne and RT Edgar.\n\n\n\n\n\nNone of those four agencies provided comment after being approached by SBS News.\n\n\n\n\n\nIn a statement, a spokesperson for Homely described the Uplift program as \"a standard business-to-business marketing arrangement\".\n\n\n\n\n\n\"To participate in the Homely Plus Uplift Program, agents pay a membership fee to Homely for access to premium branding and profiling across our platforms. The average membership fee paid by each agent for this access is approximately $650 per month,\" the spokesperson said.\n\n\n\nThis fee is paid by the agents and not the vendors.\n\nThe statement goes on to explain that, on average, the company pays \"approximately $220 per month to each participating agent from the membership revenues for their marketing services\" — roughly equal to 35 per cent of their monthly membership fees.\n\n\n\nIn an investor seminar, Homely sought to recruit more agencies to its Uplift program by citing a recent cash payment it made to one agency, totalling $3,605. Source: Supplied However, according to a slide taken from a February 2024 investor seminar obtained by SBS News, one agency reportedly received a cashback payment of $3,605 in one month — significantly higher than the quoted $220 that would be paid back based on average membership fees alone.\n\n\n\n\n\nIn the same seminar, a representative from Homely describes the cashback incentive as a percentage of an agency's \"total spend in supporting Homely\" — which may include VPA.\n\n\n\n\n\nThe company did not respond to SBS News' follow-up questions about why this phrasing was used if the cashback payments are solely coming from membership fees. Nor did it respond to questions seeking to clarify whether participating agencies might be charging vendors for Uplift membership fees.\n\n\n\n\n\nSome experts say the arrangement appears to be skirting close to laws prohibiting kickbacks and should, at the very least, be disclosed to vendors.\n\n\n\n'It should be declared'\n\nJohn Keating, a veteran estate agent and former chairman of the Real Estate Institute of Victoria's ethics committee, says any link between an agency's advertising spend and a cashback incentive is worthy of further scrutiny.\n\n\n\n\n\n\"If it's [the cashback amount is] directly proportional with the advertising spend to Homely, there's a link,\" he tells SBS News.\n\n\n\n\n\n\"If that 35 per cent is paid back … the payment that they make to Homely — it should be declared.\"\n\n\n\nReal estate agent John Keating has been a vocal critic of unethical practices in his industry for decades. Source: Supplied \"If I recommend [a customer] a higher package, which costs the client more money because I get a bigger rebate, that's a secret commission. No doubt about it, it's crystal clear in my mind,\" Keating said.\n\n\n\n\n\nHomely has repeatedly rejected the suggestion that its cashback payments constitute a commission or rebate.\n\n\n\n\n\nSBS News contacted the Real Estate Institute of Australia (REIA), the national peak body for the real estate sector, to ask about Homely's Uplift scheme.\n\n\n\n\n\nA spokesperson for REIA said in a statement that it was not aware of the scheme, but added: \"Agents should disclose any financial or commercial arrangements that may influence their choice of marketing services, ensuring transparency for their clients.\"\n\n\n\n\n\nStephanie Tonkin, CEO at Consumer Action Law Centre, agrees.\n\n\n\n\n\n\"It's incredibly important when we are talking about something like the sale of a home, that all the information is transparent and people can make choices about where they spend their money, what they're buying, given the high-stakes nature of the transaction,\" Tonkin tells SBS News.\n\n\n\nTonkin (pictured) says real estate agents \"have a position of power in the [sale or lease] transaction and therefore must be really transparent about their associations and profits\". Source: Supplied \"To hear that there's a potential that in the sale [of a property] that some of the expenses could be obscured or it's not abundantly clear where all the money is going, including maybe being redirected back into the pockets of a real estate agent, I think that it sounds like it could be a case of misleading or deceptive conduct,\" Tonkin says.\n\n\n\n[It] certainly would be unfair conduct and would warrant investigation by a professional body or regulator.\n\nRebates, commissions and the law\n\nLaws forbidding undisclosed rebates or commissions vary across Australia's states and territories.\n\n\n\n\n\nIn Victoria, for instance, guidance from Consumer Affairs states: \"It is illegal for an agent to keep a rebate, either monetary or non-monetary. It must immediately be paid to the client except if in anticipation you have already paid the amount or reduced the expenses charged.\"\n\n\n\n\n\nIn every jurisdiction, agents must, at the bare minimum, declare rebates and commissions to their clients.\n\n\n\n\n\nHomely says the fees it charges real estate agents are \"paid by the agents, and not the vendors\".\n\n\n\n\n\nThe company did not answer questions about whether the Uplift contract contains provisions requiring agents not to pass on costs to their clients.\n\n\n\nA document seen by SBS News titled Homely Plus Uplift Program Terms & Conditions also does not outline conditions for how agencies fund their participation.\n\n\n\n\n\nIt does, however, contain advice for a situation in which an agency \"can't get vendor paid on an occasional listing\" — meaning the agency can't convince a particular vendor to pay for their property to be listed on Homely.\n\n\n\n\n\nIt says participants' \"earnings will vary from month to month and are dependent on a number of factors, including marketing tasks completed, overall effectiveness of the marketing and success of the Homely business\".\n\n\n\n\n\nBy claiming the scheme relies on agency-paid fees for \"marketing tasks\" instead of vendor-paid fees for advertising, Homely is, in effect, saying the cashback payments do not need to be disclosed or passed on to vendors.\n\n\n\nIn internal Homely Slack messages seen by SBS News, Homely founder Adam Spencer suggests eligibility for the cashback payments depends not just on marketing tasks, but also \"spending on VPA\" — the advertising fees paid by the vendor.\n\n\n\n\n\n\"I've heard some language used around direct Uplift payment for VPA. This is simply not the case, as Uplift payments will not be made just for spending on VPA,\" Spencer wrote on Slack in late 2023.\n\n\n\n\n\n\"Unless the agencies do the marketing work, then we simply will not pay them.\"\n\n\n\n\n\nFrom both the volume of certain payments and the company messaging, it appears the cashback payments could be made based on an agency's membership fees and VPA in exchange for marketing work. This makes it, at best, a grey area if such incentive payments aren't disclosed to vendors.\n\n\n\nSBS News contacted over 80 agencies believed to be current or former participants of the Uplift scheme to ask whether the money paid back to them by Homely is treated as a commission or rebate, or if it's disclosed to their customers.\n\n\n\n\n\nMost did not respond.\n\n\n\n\n\nFour said the fees they paid to Homely as part of the Uplift scheme were paid by the agency itself and not by clients.\n\n\n\n\n\nOne agent told SBS News he passed the anticipated discount, \"plus more usually\", on to clients.\n\n\n\n\n\nContrary to this, Homely has told SBS News the payments it makes to agents under the Uplift scheme \"are not 'savings' to be passed on to vendors\".\n\n\n\nMost Australians rely on real estate agents to buy, sell and lease property, but surveys show that most view the occupation as unethical. Source: Moment RF / Oscar Wong/Getty Images\n\n'The local paper test'\n\nWhile the onus for disclosing rebates or commissions rests on the real estate agent, Homely's insistence that the scheme doesn't meet the requirements for disclosure means many of its participating agents may not have sought their own advice about whether they are breaching the law.\n\n\n\n\n\nSBS News understands the Uplift scheme was reviewed and given the all-clear by law firm MinterEllison, which is named as Homely's legal advisers in a 2020 document seen by SBS News.\n\n\n\n\n\nMinterEllison did not respond to a request for comment.\n\n\n\n\n\nKeating says regardless of whether the Uplift model poses a legal compliance risk for agents, any real estate sector business should ask themselves whether their actions pass \"the local paper test\".\n\n\n\nWould we be embarrassed if anything we do appears on the front page of our local paper? If so, don't do it.\n\nKeating has long been an outspoken critic of certain practices in the industry, such as dummy bidding — planting a false bidder at an auction — and underquoting.\n\n\n\n\n\nHe says the at times duplicitous conduct of real estate agents underpins the findings of the Governance Institute of Australia's 2024 Ethics Index, which shows real estate agents are the least trusted occupation in Australia.\n\n\n\nThe Governance Institute of Australia's Ethics Index 2024 found Australians consider real estate agents to be the least ethical occupation. Source: SBS News / Governance Institute of Australia \"We've got a long way to go as a profession to increase the level of trustworthiness and respect and integrity amongst the public,\" he says.\n\n\n\n\n\nAs part of this investigation, SBS News put a number of claims to Homely that the company outright rejected.\n\n\n\n\n\nWhen asked whether the Uplift scheme is working against the interests of vendors, co-CEO Adam Spencer said: \"Our mission has always been to provide vendors with a free and cost-effective alternative, and we categorically reject any assertion that we are working against their interests.\n\n\n\n\n\n\"We exist to represent and support vendors — approximately 97 per cent of vendors who list on Homely do so for free, lowering the barrier to entry and costs associated with selling their property. Approximately 3 per cent of vendors boost their listing with paid spend.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/its-not-adding-up-australias-mediocrity-in-maths-and-how-to-fix-it/vsjl3eraq",
    "title": "It's not adding up: Australia's 'mediocrity in maths' and how to fix it",
    "publish_date": "Mon, 14 Apr 2025 09:31:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Grattan Institute says Australian students are falling behind in maths - one of eight key learning areas in the national curriculum.\n\n\n\n\n\nThe report found one in three students were not proficient in numeracy in 2024 NAPLAN testing.\n\n\n\n\n\nOf the students that underwent the NAPLAN test, 36 per cent of girls were deemed not proficient, compared to 43 per cent of students whose schools were outside major cities.\n\n\n\n\n\nAlso deemed not proficient were 67 per cent of Indigenous students, and 28 per cent of students from non-English speaking backgrounds.\n\n\n\n\n\nThe Deputy Director of the Grattan Institute's Education Program, Amy Haywood says these outcomes disadvantage individual students, and society as a whole.\n\n\n\n\n\n\"So we know that costs individuals - maths is really important for everyday life, but also future careers - but it also costs us as a nation as well. When we look at what are the outcomes for students with poorer math skills, we know that they have less strong life outcomes, for instance, in employment and earnings as well. So we know that if we're not meeting that mark, and really reaching our full potential, it has a big impact on Australia's future growth.\"\n\n\n\n\n\nMs Haywood also says not enough Australian students are excelling in maths.\n\n\n\n\n\nThe report compares the results of Australian students with trends in a large-scale global assessment called the International Mathematics and Science Study.\n\n\n\n\n\nIn 2023, 13 per cent of Year 4 students were classed as excelling, and this reduced to 11 per cent for Year 8.\n\n\n\n\n\nThose scores were above the international median of 7 per cent, but below countries including England and Singapore.\n\n\n\n\n\nA survey conducted to inform the report found some teachers lack confidence in their ability to teach maths, as well as their colleagues'.\n\n\n\n\n\nIt's a finding that resonates with Chelsea Heights Primary School Principal, Steven Capp.\n\n\n\n\n\n“The variation in teacher confidence in teaching mathematics and really understanding the sequencing you need from foundation to grade six, has really been a leadership challenge that we’ve had to really dig deep with some of our teachers and train them around.”\n\n\n\n\n\nBut some experts say the report doesn’t provide an accurate snapshot of primary school teachers - surveying fewer than 1,800.\n\n\n\n\n\nKaren Yager is the President of the Australian Professional Teachers Association.\n\n\n\n\n\n“Not even 10 per cent of teachers were sampled for the survey - particularly Tasmania is only two per cent, Northern Territory is one per cent.”\n\n\n\n\n\nMs Yager says school communities need more support.\n\n\n\n\n\n“We need to look at the fact that, in regional areas and remote parts of Australia, is there enough support there for the kids and the teachers? I mean, we have a teacher shortage, we have teachers teaching out of field in mathematics. It is a real problem for this country – and this sort of report damning teachers isn’t going to help.”\n\n\n\n\n\nAmy Haywood says the Grattan Institute is calling for an annual investment of $152 million dollar to fund a 10-year strategy that includes explicit teaching practices, primary maths master teacher roles, and special maths hubs.\n\n\n\n\n\n“We want all state governments and systems to take that on board, otherwise unfortunately we’re committing ourselves to further mediocrity in maths.”\n\n\n\n\n\nFederal Education Minister Jason Clare says the government has reached new funding agreements with all states and territories and this puts all public schools on a path to full and fair funding.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/chinas-trade-balance-swells-gold-continues-to-trade-at-near-record/l4phu98j4",
    "title": "China's trade balance swells & gold continues to trade at near record",
    "publish_date": "Mon, 14 Apr 2025 07:25:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 43
  },
  {
    "url": "https://www.sbs.com.au/news/article/peter-duttons-son-harry-says-hes-saving-like-mad-to-get-into-the-housing-market/wm8bziixl",
    "title": "Peter Dutton's son is saving for a home. But the Coalition leader won't reveal if he'll help",
    "publish_date": "Mon, 14 Apr 2025 05:18:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "Opposition leader Peter Dutton took his son out on the campaign trail as he assured his government would offer housing hope for young Australians like 20-year-old Harry.\n\n\n\n\n\nDutton was joined by his son Harry at a press conference in Brisbane to spruik the Coalition's plan to offer tax breaks on first-home loan repayments.\n\n\n\n\n\nDespite his father's position of power, the 20-year-old apprentice carpenter said the market was still difficult to navigate for him and his family.\n\n\n\n\n\n\"I'm saving up for a house and so is my sister and a lot of my mates but it's almost impossible to get in the current state,\" he told reporters on Monday.\n\n\n\n\n\n\"We're saving like mad but it doesn't look much better in the near future.\n\n\n\n\"But we'd love that to change.\"\n\n\n\n\n\nAsked if he would be a guarantor as the bank of mum and dad, Peter Dutton did not directly answer the question.\n\n\n\n\n\n\"I don't want to be accepting a situation where only mums and dads who can afford to give their kids hope — that they're the kids that can buy homes,\" he said.\n\n\n\nIt has previously been reported by the Nine newspapers that Dutton has made $30 million of property transactions across 26 pieces of real estate over 35 years.\n\n\n\n\n\nDutton and his son were travelling together in the north-west Brisbane seat of Ryan, which the Liberals hope to win back from the Greens.\n\n\n\n\n\nIt is held on a 2.6 per cent margin and could be a crucial electorate in an increasingly close contest.\n\n\n\nCoalition's housing policy targets young voters\n\nDutton pitched the party's new housing policy, revealed on Sunday, as a way to get Australians into home ownership.\n\n\n\n\n\n\"It kills me when you hear young Australians saying, 'I'm working hard, we're putting money aside but we just can't afford and we don't ever think we're going to be able to afford a home',\" he said.\n\n\n\n\n\n\"That's the common story — I'm not going to accept that as prime minister.\"\n\n\n\n\n\nThe policy would allow first-time buyers of newly built homes to deduct interest payments from their income taxes on the first $650,000 of a mortgage.\n\n\n\n\n\nIt's part of the Coalition's broader effort to court the youth vote as gen Z and millennials are poised to become the dominant voting bloc at the 3 May election .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 44
  },
  {
    "url": "https://www.sbs.com.au/news/article/in-trade-war-china-holds-a-lot-more-cards-than-trump-may-think-in-fact-it-might-have-a-winning-hand/5i4c6ljka",
    "title": "In trade war, China holds more cards than Trump may think — in fact, even a winning hand",
    "publish_date": "Mon, 14 Apr 2025 05:04:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "When United States President Donald Trump pulled back on his plan to impose eye-watering tariffs on trading partners across the world, there was one key exception: China.\n\n\n\n\n\nWhile the rest of the world would be given a 90-day reprieve on additional duties beyond the new 10 per cent tariffs on all US trade partners, China would feel the squeeze even more. On 9 April, Trump raised the tariff on Chinese goods to 125 per cent.\n\n\n\n\n\nThe move, in Trump's telling, was prompted by China's \"lack of respect for global markets\". But Trump may well have been smarting from China's apparent willingness to confront US tariffs head-on.\n\n\n\n\n\nWhile many countries opted not to retaliate against Trump's now-delayed reciprocal tariff hikes, instead favouring negotiation and dialogue, China took a different tack. It responded with swift and firm countermeasures.\n\n\n\nREAD MORE How Australia could benefit from a US-China trade war\n\nOn 11 April, China dismissed Trump's moves as a \"joke\" and raised its own tariffs against the US to 125 per cent .\n\n\n\n\n\nThe two economies are now locked in an all-out, high-intensity trade standoff. And China is showing no signs of backing down.\n\n\n\n\n\nAnd as an expert on US-China relations, I wouldn't expect China to. Unlike the first US-China trade war during Trump's initial term, when China eagerly sought to negotiate with the US, China now holds far more leverage.\n\n\n\n\n\nIndeed, China believes it can inflict at least as much damage on the US as vice versa, while at the same time expanding its global position.\n\n\n\nA changed calculus for China\n\nThere's no doubt that the consequences of tariffs are severe for China's export-oriented manufacturers — especially those in the coastal regions producing furniture, clothing, toys and home appliances for American consumers.\n\n\n\n\n\nBut since Trump first launched a tariff increase on China in 2018, a number of underlying economic factors have significantly shifted China's calculus.\n\n\n\n\n\nCrucially, the importance of the US market to China's export-driven economy has declined significantly. In 2018, at the start of the first trade war, US-bound exports accounted for 19.8 per cent of China's total exports. In 2023, that figure had fallen to 12.8 per cent.\n\n\n\n\n\nThe tariffs may further prompt China to accelerate its \"domestic demand expansion\" strategy, unleashing the spending power of its consumers and strengthening its domestic economy.\n\n\n\nAmid tariffs, China's President Xi Jinping senses a historic opportunity. Source: Getty / Carlos Barria And while China entered the 2018 trade war in a phase of strong economic growth, the current situation is quite different. Sluggish real estate markets, capital flight and Western \"decoupling\" have pushed the Chinese economy into a period of persistent slowdown.\n\n\n\n\n\nPerhaps counter intuitively, this prolonged downturn may have made the Chinese economy more resilient to shocks. It has pushed businesses and policymakers to factor in the existing harsh economic realities, even before the impact of Trump's tariffs.\n\n\n\n\n\nTrump's tariff policy against China may also allow China a useful external scapegoat, allowing it to rally public sentiment and shift blame for the economic slowdown onto US aggression.\n\n\n\n\n\nChina also understands that the US cannot easily replace its dependency on Chinese goods, particularly through its supply chains. While direct US imports from China have decreased, many goods now imported from third countries still rely on Chinese-made components or raw materials.\n\n\n\nBy 2022, the US relied on China for 532 key product categories — nearly four times the level in 2000 — while China's reliance on US products was cut by half in the same period.\n\n\n\n\n\nThere's a related public opinion calculation: Rising tariffs are expected to drive up prices, something that could stir discontent among American consumers, particularly blue-collar voters. Indeed, China believes Trump's tariffs risk pushing the previously strong US economy toward a recession.\n\n\n\nPotent tools for retaliation\n\nAlongside the changed economic environments , China also holds a number of strategic tools for retaliation against the US.\n\n\n\n\n\nIt dominates the global rare earth supply chain — critical to military and high-tech industries — supplying roughly 72 per cent of US rare earth imports, by some estimates. On 4 March, China placed 15 American entities on its export control list, followed by another 12 on 9 April. Many were US defence contractors or high-tech firms reliant on rare earth elements for their products.\n\n\n\nREAD MORE Donald Trump spares smartphones, computers and other electronics from tariffs\n\nChina also retains the ability to target key US agricultural export sectors such as poultry and soybeans — industries heavily dependent on Chinese demand and concentrated in Republican-leaning states. China accounts for about half of US soybean exports and nearly 10 per cent of American poultry exports. On 4 March, China revoked import approvals for three major US soybean exporters.\n\n\n\n\n\nAnd on the tech side, many US companies — such as Apple and Tesla — remain deeply tied to Chinese manufacturing. Tariffs threaten to shrink their profit margins significantly, something China believes can be used as a source of leverage against the Trump administration. Already, China is reportedly planning to strike back through regulatory pressure on US companies operating in China.\n\n\n\n\n\nMeanwhile, the fact that Elon Musk, a senior Trump insider who has clashed with US trade adviser Peter Navarro against tariffs, has major business interests in China is a particularly strong wedge that Beijing could yet exploit in an attempt to divide the Trump administration.\n\n\n\nA strategic opening for China?\n\nWhile China thinks it can weather Trump's sweeping tariffs on a bilateral basis, it also believes the US broadside against its own trading partners has created a generational strategic opportunity to displace American hegemony.\n\n\n\n\n\nClose to home, this shift could significantly reshape the geopolitical landscape of East Asia. Already on 30 March — after Trump had first raised tariffs on Beijing — China, Japan, and South Korea hosted their first economic dialogue in five years and pledged to advance a trilateral free trade agreement.\n\n\n\n\n\nThe move was particularly remarkable given how carefully the US had worked to cultivate its Japanese and South Korean allies during the Biden administration as part of its strategy to counter Chinese regional influence. From China's perspective, Trump's actions offer an opportunity to directly erode US sway in the Indo-Pacific.\n\n\n\nCould China's dragon economy slay Trump's tariffs? Source: Getty / Wang Zhao Similarly, Trump's steep tariffs on Southeast Asian countries, which were also a major strategic regional priority during the Biden administration, may push those nations closer to China. Chinese state media announced on 11 April President Xi Jinping will pay state visits to Vietnam, Malaysia and Cambodia from 14-18 April, aiming to deepen \"all-round cooperation\" with neighbouring countries.\n\n\n\n\n\nNotably, all three Southeast Asian nations were targeted with now-paused reciprocal tariffs by the Trump administration — 49 per cent on Cambodian goods, 46 per cent on Vietnamese exports and 24 per cent on products from Malaysia.\n\n\n\n\n\nFarther away from China lies an even more promising strategic opportunity. Trump's tariff strategy has already prompted China and officials from the European Union (EU) to contemplate strengthening their own previously strained trade ties, something that could weaken the transatlantic alliance that had sought to decouple from China.\n\n\n\n\n\nOn 8 April, the president of the European Commission held a call with China's premier, during which both sides jointly condemned US trade protectionism and advocated for free and open trade.\n\n\n\n\n\nCoincidentally, on 9 April, the day China raised tariffs on US goods to 84 per cent, the EU also announced its first wave of retaliatory measures — imposing a 25 per cent tariff on selected US imports worth over €20 billion ($36 billion) — but delayed implementation following Trump's 90-day pause.\n\n\n\nLISTEN TO Decoding the tariff war: Trump, Xi and the global fallout SBS News 11/04/2025 25:12 Play\n\nNow, EU and Chinese officials are holding talks over existing trade barriers and considering a full-fledged summit in China in July.\n\n\n\n\n\nFinally, China views Trump's tariff policy as a potential weakening of the international standing of the US dollar. Widespread tariffs imposed on multiple countries have shaken investor confidence in the US economy, contributing to a decline in the dollar's value.\n\n\n\n\n\nTraditionally, the dollar and US Treasury bonds have been viewed as haven assets, but recent market turmoil has cast doubt on that status. At the same time, steep tariffs have raised concerns about the health of the US economy and the sustainability of its debt, undermining trust in both the dollar and US Treasury bonds.\n\n\n\n\n\nWhile Trump's tariffs will inevitably hurt parts of the Chinese economy, China appears to have far more cards to play this time around. It has the tools to inflict meaningful damage on US interests — and perhaps more importantly, Trump's all-out tariff war is providing China with a rare and unprecedented strategic opportunity.\n\n\n\n\n\nLinggong Kong is a PhD candidate in political science at Auburn University.",
    "source": "SBS",
    "cluster_id": 45
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/geoff-huegill-the-pressure-of-perfection/h06p1ui12",
    "title": "Geoff Huegill: The Pressure of Perfection",
    "publish_date": "Mon, 14 Apr 2025 05:00:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "Geoff was a guest on Insight episode, Second Chances , broadcast in 2024.\n\n\n\n\n\nFollow Insightful on the SBS Audio App , Apple Podcasts , Spotify , or wherever you get your podcasts.\n\n\n\n\n\nHost: Kumi Taguchi\n\n\n\nSupervising Producers: Rebecca Baillie and Maria Nguyen-Emmett\n\n\n\nExecutive Producer: Ross Scheepers\n\n\n\nStory Editor: Madox Foster\n\n\n\nSenior Post Producer: Saber Baluch\n\n\n\nProduction Coordinator: Kate Hrayssi\n\n\n\nArtwork: Aaron Hobbs\n\n\n\nAudio Operations Supervisor: Jonathan Hochman\n\n\n\nMastering and mixing by Micky Grossman\n\n\n\nLISTEN TO Geoff Huegill: The Pressure of Perfection SBS News 14/04/2025 25:11 Play\n\n\n\n\n\nTranscript\n\n\n\n\n\nGeoff: You've got to be a unique cat to want to put your head in a bucket and swim for 345 hours a day.\n\n\n\n\n\nKumi: I'm Kumi Taguchi. Welcome to Insightful. Geoff Huegill was someone I have always been aware of.\n\n\n\n\n\nGeoff: I was basically trained to be the best of the best.\n\n\n\n\n\nKumi: I remember watching him swimming and winning golds for Australia, and I knew he'd had some tougher times in the public eye.\n\n\n\n\n\nGeoff: I'm the first to put my hand up and say that I make a lot of mistakes. I had no idea though what he was like behind the headlines. One of the things that I've learned within myself is that my whole life was all about pain, pain from.\n\n\n\n\n\nGeoff: Parents separating, pain from my father passing away and watching him pass away, the pain of having to channel my emotions and energy into doing something that I did very, very well.\n\n\n\n\n\nKumi: What struck me was how polite and humble Geoff was and how honest, and he was up for a chat.\n\n\n\n\n\nKumi: It's so good to see you.\n\n\n\n\n\nGeoff: Yeah, and you too.\n\n\n\n\n\nKumi: You were born in Nhulunbuy, this is a small peninsula town in the Northern Territory. Your mum is Thai, your dad was a FIFO miner. How did they meet?\n\n\n\n\n\nGeoff: So my mum grew up in rural Thailand and she was a chef. So she had a cooking cart, being the eldest daughter of three daughters, one of her responsibilities at that particular stage of life was being one of the main financiers of the family and to help out as much as possible. So she had a love for cooking, had a passion for cooking, and listening to her story of how she started off and then raising a little pig and then growing this pig and then selling it off to be able to buy a food cart to then be able to take it from rural Thailand down to Bangkok, and I believe my father was with one of his mates and,\n\n\n\n\n\nGeoff: They were having some time off and relaxing and met my mum, and basically she just cooked for him and fed him for the whole time. He was literally in Bangkok, which was quite amazing. So, you talk about by chance of how do you get this opportunity to not only just be on this planet, but this opportunity to do things you do. It's quite a unique story. It's quite different, and obviously everyone has their own unique story, but quite a spin out.\n\n\n\n\n\nKumi: You've spoken about values a lot Geoff, and one of the things that really struck me when you were in the Insight studio was, I felt this real sense of humility, like you treated everyone there with such,\n\n\n\n\n\nKumi: Generosity and care and support, and I remember thinking, oh, there's a lot more to this guy than I know from what I've read. Where have those aspects of your personality come from?\n\n\n\n\n\nGeoff: I believe I've got my work ethic from my mum, to tell you the truth. There's no, from my mum and from my dad, but also too from the key influential people that have been in my life, like my swimming coach, one of my first swimming coaches who I got to live with after my father passed away. I've always been a,\n\n\n\n\n\nGeoff: Big believer that things happen in life for a reason. For me, if my father didn't pass away, I don't know whether or not I would have had the determination to be able to stick through the hard challenges of just fighting to get to the Olympics. And Ken, my former coach, he, what people don't realise is he put a swimmer on every Australian team from 1976 to 2016.\n\n\n\n\n\nGeoff: So for 40 years, he created this environment and there was method to his madness. One of the best things that he taught me is always be good to the people you pass on the way up because they're going to be the first people you pass on the way back down. I learned pretty quick through my journey in sport that obviously everyone does have a story.\n\n\n\n\n\nGeoff: You know, I remember going into my first Olympic Games and multiple Olympic gold medalists pulled me aside and told me this story, and the moral of the story is, it doesn't matter who you are, where you come from, or what you've done. When you step up to the final of the 100 metres butterfly, he said, I guarantee that everyone walks out of the food hall with food down the front of their shirt, right? So,\n\n\n\n\n\nGeoff: Everyone trips over their own feet, and these are the people that are the best of the best, right? So he said, just go out there and do what you have to do. So, I've had some really, really good mentors or people that have influenced my life, and I've been very lucky throughout that journey so far. So yeah, I can't really complain.\n\n\n\n\n\nKumi: Just to backtrack, you were 12, I understand when your dad died of a heart attack. That's right. What do you remember about that day?\n\n\n\n\n\nGeoff: It was hard. I remember coming home from training, it was a Tuesday night. My dad was already in bed. He wasn't feeling 100%. He literally just said to me, well, I said to him, because Ken had told me, my coach had told me that he was gonna send me off to my first a nationals. So I was really, really excited.\n\n\n\n\n\nGeoff: About that and came home it just before my 13th birthday. And I remember just telling him while he was in bed and then had my dinner and went to bed and didn't think anything of it. And then during the middle of the night, he woke up and I heard him go into the bathroom and turn the shower on, and then he collapsed in the shower and I was up and, and obviously woke up the whole household and called the ambulance and, you know, I think when I reflect and and look back on it,\n\n\n\n\n\nGeoff: It was the parts that were really hard were just how sudden everything changed. Like literally in the blink of an eye. It was like he's there and then he wasn't there.\n\n\n\n\n\nGeoff: This is like 12 a.m. and by 6:30 in the morning, I got the news that he passed away and. Just a whole mix of emotions just run through you, right? Like, what now, and how did this happen and,\n\n\n\n\n\nGeoff: Yeah, it's, it's a lot for a 12 year old to sort of take on board. And, uh, yeah, it took me, I, I didn't realise how long it actually took to, uh, deal with that situation. And as you can see or hear, it does still make me pretty emotional at times.\n\n\n\n\n\nKumi: Yeah, thanks for sharing that, Geoff, and sorry to bring that up. I'm so glad you got to tell him about.\n\n\n\n\n\nKumi: What you were about to do with your swimming, that you had that chat with him, but he knew.\n\n\n\n\n\nGeoff: Funny you say that because I, I've never looked at it that way.\n\n\n\n\n\nKumi: Yeah, I feel like, oh what an amazing thing for your dad to know about you, about your son, you know, definitely.\n\n\n\n\n\nKumi: So Ken, would the man, your coach, your mentor who you went to live with, you suddenly living in a new home and still putting effort into your swimming, was that in a way, I don't know, like a kind of saviour in a way when everything was different and everything changed in an instant. You've got this thing that you can still rely on.\n\n\n\n\n\nGeoff: When I reflect back at it, I was very lucky that I had my swimming and had my swimming club. I mean, God knows what would have happened if I wasn't in that environment, and if I wasn't in that club. You know, obviously I've got a tendency of wanting to have a good time and to, uh, you know, want to have a little bit of fun, um, without a doubt. But, uh, so I never know. I mean, that's a, it's a hypothetical. I tend not to look down these hypothetical questions, but,\n\n\n\n\n\nGeoff: What I do appreciate, and this is why I'm a firm believer that things happen in life for a reason, cause not long after that, Sydney won the bid for the Olympics. It was about 6 months after. And then I knew at that stage, I was in the right environment. I had the right coach to be able to go from 8 nationals into Olympic medalists, being a champion.\n\n\n\n\n\nGeoff: On the international scene and stage, and it was quite easy to put the roadmap together. And it's funny we touch upon this because I was back in Australia a couple of weeks ago, and I literally did this similar exercise with a bunch of up and coming children or athletes that are at that 1012, 14 years of age where,\n\n\n\n\n\nGeoff: To look forward 8 years, if you're 12, that means you're gonna be 20 in the 2032 Olympics. Yes. So, when you look back on the stats and where things are, I think in swimming Australia, 90% of athletes have won their first international medal before the age of 21, and of that 90%.\n\n\n\n\n\nGeoff: And 90% of them have been with the same coach since the age of 15. So, the stats don't lie. And so it's a bit of a spin out to reflect on it from that side, to have the opportunity to work with the younger generation of kids that are coming through to building roadmaps, building strategies, building plans on using sport for life after sport.\n\n\n\n\n\nNEWS ANCHOR: Hugo and Slim, Klim and Huegill, Huegill's in front, Huegill, Klim, the touch, the touch, and there it is. Huegill wins by 100.\n\n\n\n\n\nKumi: You walked away from swimming after the 2004 Athens Olympics. You had a really public kind of battle with weight gain. I mean, God, everyone kind of commenting. It took another, I think, 60 years. You lost 40 kg, then you made an international swimming comeback at the Delhi Commonwealth Games in 2010. What was it like getting that chance again, that pressure in a way of that second chance and the public's expectations on you?\n\n\n\n\n\nGeoff: For me it was, it was something that just seemed natural, right? I mean, I've always been a goal oriented person. It would be like, it's time to start taking care of my health, or start looking after myself and moving on a daily basis. And it's not like one day I woke up and had this epiphany of, oh, I'm just gonna get back into the pool again and hopefully swim on the international circuit. A lot of thought, a lot of planning, a lot of consulting and understanding what the journey was going to be like getting back into it again. I, I mean, I took a lot of time to think.\n\n\n\n\n\nGeoff: About that, because one of the things I sort of realised was just how much pain I was going to be in from a physiological sort of sense, right? How much effort was required on a daily basis to push myself to get back to that level again. And once I made up my mind, that was something I actually wanted to do again, then it was all systems go, right? I, I went in 110%.\n\n\n\n\n\nKumi: One of the things I think about swimming are the endless laps, like this monotony.\n\n\n\n\n\nKumi: And repetition and I just don't think I could do that. Is there a particular mindset of a swimmer who can just get in that pool day in, day out?\n\n\n\n\n\nGeoff: You've got to be a unique cat to want to put your head in a bucket and swim for 345 hours a day, and then when you're out of the pool, you're in the gym, pushing yourself to extremes. I think when you talk about the unique mindset of a swimmer, everyone's got their own goals and their purposes, or the reasons of why they actually do that. And I think for anyone, whether you want to be successful in a media career, successful in a sporting career, you have to understand what the purpose is.\n\n\n\n\n\nGeoff: As to why you are going to put yourself through that physical and mental exhaustion and mental pain. So for me, it was, I had purpose. I, I understood exactly why I was getting into the water every single day. I understand the job and the task ahead of me. So to make that call, it was quite an easy thing to do.\n\n\n\n\n\nKumi: So you went well in Delhi, you walked away with gold and silver. That same year you were voted the 2010 Australian Sport Performer of the Year. Did you feel like it was a great comeback for all the doubters?\n\n\n\n\n\nGeoff: Sort of, yeah, no, but, I think the biggest thing was just proving it to myself, and that was the most important thing, that all of the accolades and the celebrations and the things that came after, because I was doing it for myself, it didn't really faze me about those things. And it's not until you get a little bit older in life and you reflect on your career that you actually realise how big a task that was to actually execute 51.6 seconds at a particular moment in time.\n\n\n\n\n\nKumi: Let's fast forward 4 years, the tough year where you and your then ex-wife were charged with drug possession. I'm just so fascinated with what you remember about that day.\n\n\n\n\n\nGeoff: Obviously, I was a little bit inebriated, had quite a few drinks and.\n\n\n\n\n\nGeoff: I didn't think about anything, to tell you the truth. I didn't have any care or responsibility in the world. I was just living my life at that particular point in time. Obviously, once things started to get real, being that I got pulled aside by the police and taken into a room and questioned, that's when my mindset shifted really, really quick. It goes from being proactive into reactive, because I understood,\n\n\n\n\n\nGeoff: And realised that things were gonna change and things were gonna change really, really quick. So, I think you're starting to get a bit of an idea into some of the wacky ways my mind works, but it was about having a bit of a plan and a strategy and a solution in terms of how we're going to deal with this, who are the people we need to contact, and then putting a plan in place to be able to get the results that we were looking for to.\n\n\n\n\n\nGeoff: have no criminal conviction. Being a global frequent flyer and travelling a lot throughout my career, I understand the damages that it sets you back if you do actually have a criminal conviction. So, it just makes life a little bit harder, obviously. So, recognising and realising what needed to be done and how do we execute it, my mind just went straight into, um, problem solving.\n\n\n\n\n\nKumi: So much of your identity is still tied to being a swimmer. Have you had to separate part of your identity to that part of what you did?\n\n\n\n\n\nGeoff: I've always tried to, but there's always the public perception.\n\n\n\n\n\nGeoff: And every time I've tried to walk away from the sport, I actually still am really happy being in the water. Whether it's working with the next generation of kids that are coming through, or even working with a bunch of adults that are trying to swim the English Channel or do half Ironman triathlons, or even working with a bunch of.\n\n\n\n\n\nGeoff: where we're doing teambuilding projects, I guess a lot of my experience comes back from being in the environments that I was in that swimming environments, but also to the environment of being an Olympian, so to speak. So, every time I try and escape it, to try and get away, it's been an education.\n\n\n\n\n\nGeoff: Throughout my career, I look back and we talk about some of these challenging things that I've been through in my life. The only way that I've been able to get through it is because of all of the challenging things I've learned through sport. And I think when we talk about success, or most importantly, when we talk about people having confidence, right? Cause,\n\n\n\n\n\nGeoff: Confidence and self-confidence and self-belief. Ultimately, these things are internal, right? So to be able to have more confidence, to be able to face the challenges or the hurdles of life, it's because you in particular have overcome those challenges and those hard moments and periods of life. So, I think if I reflect back onto 2014…\n\n\n\n\n\nGeoff: In the arrest of 2014, I knew that I'd been through a lot of harder things, and this was only just going to be another blip in the radar. You know, I got the Olympic rings tattoo on my wrist when I was going into Athens Olympics in 2004. I didn't get it after the 2000 Olympics and,\n\n\n\n\n\nGeoff: The reason why it holds a lot more significance is because the challenges of getting behind the blocks in 2004 were a lot harder than in 2000. Different mindsets, different approaches, different environment, different stages and phases of life, and,\n\n\n\n\n\nGeoff: To me that challenge in itself meant a hell of a lot and obviously having a chance to represent my country at a home Olympics, and those are the successes that I've had or the challenges that I had to overcome, which helped me line up behind the blocks when I raced in 2010.\n\n\n\n\n\nNEWS ANCHOR: What's 20 metres when you've conquered 40 kg. Geoff Huegill of Australia, Geoff Huegill of Australia goes in for the kill. A happy ending for Geoff Huegill, happily ever after it is, it's a Commonwealth Games record.\n\n\n\n\n\nKumi: You're now living in Singapore where you met your second wife, Roxanne. How did you guys meet?\n\n\n\n\n\nGeoff: We met through friends, to tell you the truth. We were introduced, which is quite amazing, and look, within the 1st 90 seconds of meeting Roxy, I just realised that she was a different cat. And I said that to her straight away. It was like, well, hang on here, you're a different cat. And then literally, we just connected and gelled. We had so much in common, and it's been,\n\n\n\n\n\nGeoff: Like everything, though, you have your ups and downs, but it's been a journey that I've really enjoyed.\n\n\n\n\n\nKumi: How would you react if any of your kids wanted to be an elite athlete?\n\n\n\n\n\nGeoff: Obviously, I'm gonna support them in whatever it is they want to do, because that's what you do when you have children, I guess, or that's what I would do because that's what my parents did for me. So, the endless love and care and support and, and assistance, I think I would help them put their roadmap from A to B.\n\n\n\n\n\nGeoff: Or A to Z and work out whatever it is that they want to do, but also be there for them and, and support them. Give them as much love and comfort and recognition for the things that they do want to do. And about 12 months ago, I had a call with my eldest daughter, Mila, and she rang me up and said, Hey, Dad, I love you, but I, I don't want to swim anymore. And I was like, Yeah, great. Well, that's the, you know, and, and at the time, I was obviously heartbroken because she's top 3 in Australia and\n\n\n\n\n\nGeoff: You know, obviously state champion I she purely gifted and talented, and if she doesn't want to swim, then I can't force her to swim. You can't cage animals, right? People have to learn these things for themselves and I think what's very lucky though is she's still at an age where,\n\n\n\n\n\nGeoff: If she wanted to pick it up, she can still do it, but she's obviously got to put a lot more work into it. But you, when you've got a surname of Hui and you're standing behind the blocks of anywhere in the pool, you're naturally gonna have a lot of eyeballs on you, and, and that in itself is a lot of pressure. If my children, as long as they do something, I mean, you can't sit around in the afternoon and do nothing. You either have to have an earn or learn mentality. So if you're not earning $1 you've got to be continuing your studies.\n\n\n\n\n\nGeoff: So these are the things I try and share with my daughters and my sons, and we share with them is having direction, what's your plan? What's your strategy, how do we get there, and then the simple things of short, medium and long-term goals, because we all need purpose every single day of and reason to get out of bed. And that in itself can be a challenge for a lot of people depending on where they are at that particular stage and phase of life. When we look at things like mental health or just life challenges in itself, it's,\n\n\n\n\n\nGeoff: It's quite easy to give up on the spark of life and get engaged in life, and everyone can have a million reasons why they don't want to participate or engage anymore. And I think for an individual, it's finding the purpose or the why. Why do you want to engage in this? What is the purpose, and why do you actually love what you do? As a friend told me the other day, there's a big difference obviously between love and like, right? Perfect analogy is, I like my wife, um, you know.\n\n\n\n\n\nGeoff: You know, when someone actually says that to you, it's like, yeah, I like my wife. It's like, yeah, but liking something and loving something are two different things, right?\n\n\n\n\n\nGeoff: And I do love my wife.\n\n\n\n\n\nKumi: Have there ever been moments, given that you lost your dad so young, but you had this wonderful mentor? Who do you look to or who do you imagine in terms of, that's how I'm gonna be as a dad? Like, how do you make those choices?\n\n\n\n\n\nGeoff: It's pretty challenging. And look, I'm, I'm the first to put my hand up and say that I make a lot of mistakes on the go, because the hardest thing is being present.\n\n\n\n\n\nGeoff: That's the first challenge. And then through those emotions or through those challenges at that particular point of time, obviously, there's a, everyone, every individual has certain things that trigger us, things that trigger us from our own childhood, things that, when we look back on our children and we, we reflect and we say, oh my gosh, I don't wanna be this type of parent, I don't wanna do this, and\n\n\n\n\n\nGeoff: Through those triggers, obviously sets off a range of emotions, and then from the emotions, we can choose to have a reaction. I'm always constantly self-reflecting, understanding, trying to see things from a different time and a different point of view, recognising and realising that we're dealing with little individuals, things that were or may have been,\n\n\n\n\n\nGeoff: Dealt with when I was growing up, obviously isn't acceptable today, you know, I can't just put my children in the pool and tell them to swim for 5 or 10 kilometres to just sort of get the energy out, right?\n\n\n\n\n\nKumi: No, you left like child services exactly.\n\n\n\n\n\nGeoff: Right, you know, but you gotta be able to laugh about these things, but that, that being said, it's, it just means I've, I've got to continually grow, and you've just got to be kind with yourself. I think that's one of the other things as well is kindness to yourself, especially as a parent, because we don't deliberately go out there and try and,\n\n\n\n\n\nGeoff: Rock the boat and make things hard. I mean, obviously there's a, there's a reason to why we have our values and our beliefs, but ultimately, at the end of the day, most people are doing the best that they can at those particular points of time, you know, so the forgiveness of yourself is also a big challenge. It's pretty hard. Parenting is one of the hardest things I've ever done, Kumi. I think when\n\n\n\n\n\nGeoff: You get annoyed with someone and you're in the swimming pool, you can just get in the other lane and just swim, right? Or get out of the pool and come back later. There's just no off switch with kids, right? Like they're. And, and my boys as well, right? They're just one pace, and that's just full on, right? And boys are totally different. Boys are totally different to girls, right? Girls can just sit and just do craft and everything boys are like, they're just, my boys are just animals, right? I love them. They're just, they're just.\n\n\n\n\n\nGeoff: They're just animals, right, they're just gonna tear the place apart, and they've got one speed and that's just full on, and I shake my head and it's just like, Jesus, is that life biting me on the arse again? Like, it's just like, wow, I've got I've gotta work out a way to deal with this.\n\n\n\n\n\nKumi: Life sounds pretty good for you though at the moment. Sounds like you're in a good spot.\n\n\n\n\n\nGeoff: Look, Kumi, why be so serious, right? It's only a matter of life and death.\n\n\n\n\n\nKumi: That's right. Two options.\n\n\n\n\n\nGeoff: Look, life is, life is in a good spot. It's in a good spot today, and that's all I can deal with. I can just deal with today. A couple of years ago, I was diagnosed, I finally sought treatment for my ADHD. That's been a big change in my life and my career, in particular, being able to be more present, not as, I don't want to say all over the shop, but easily distracted.\n\n\n\n\n\nGeoff: Is a big thing as well, and, um, I'm going on this path of sobriety, right, so my aim is to not pick up a drink today, uh, because I've got too much work and things to do, but, uh, today for me has lasted almost 18 months, and that in itself has been a journey because,\n\n\n\n\n\nGeoff: Especially when you look at trauma or challenges that in particularly I've been through in life, one of the things that I guess is dealing with emotional sobriety, right? So, stopping drinking was never an issue, you know, for me it was, is what do I need to do to not use my emotions to pick up a drink. Going on this journey, I think one of the things that I've learned within myself is that my whole life was all about pain, right? I was constantly in pain, pain from,\n\n\n\n\n\nGeoff: Parents separating pain from my father passing away and watching him pass away, having to live in an environment that wasn't what I thought was going to be home. The pain of having to channel my emotions and energy into doing something that I did very, very well. And I was basically trained to be the best of the best, and that is ultimately, how do you deal with pain, and how do you manage pain and channel it in the right direction. And\n\n\n\n\n\nGeoff: You know, obviously I've succeeded in that area of life, but it's not until I got a little bit older that I realised that, hey, I don't want to be in pain anymore. So, going on this path of emotional sobriety, I laugh, it's the, it's the eat, pray, love, Kumi, right, that part of life, right? I've I've obviously done a lot of eating if I put on 50 kilogrammes and had to lose it.\n\n\n\n\n\nGeoff: Being a Cleo, former Cleo's most eligible bachelor, I've sort of knocked that part of my life out. But now it's like, obviously, the spiritual aspect of life, which is the most important thing to me, because I realised that as a role model and for my children, I need to be a better partner or a better, better coach or a better individual. I have to have, I need to be more centred with what's going on within me, and\n\n\n\n\n\nGeoff: When you made the comment of, like, I seem to be in a, a good place or a happy place, it's, um, I mean, that can change pretty quick, but I've, I now have the tools to be able to deal with those challenges when they come up. So, just because I stopped drinking doesn't make my problems go away.\n\n\n\n\n\nKumi: Geoff, I could speak to you all day. Thanks, Geoff. Have a great day.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 46
  },
  {
    "url": "https://www.sbs.com.au/news/article/no-receipts-needed-how-would-albos-1k-instant-tax-write-off-work/22rr7rf9b",
    "title": "No receipts needed. How does Labor's $1,000 instant tax write off work?",
    "publish_date": "Mon, 14 Apr 2025 04:59:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "Working Australians will be able to claim an instant $1,000 tax deduction to cover work expenses under a new Labor government.\n\n\n\n\n\nPrime Minister Anthony Albanese said this election commitment will \"provide more permanent cost of living relief and make tax time quicker and easier for 5.7 million taxpayers\".\n\n\n\n\n\nThe proposed reform is designed to cut down on paperwork, reduce reliance on professional tax advice, and deliver cost-of-living relief.\n\n\n\nWho would be eligible?\n\nTo qualify for the instant deduction, taxpayers must earn an income from working. Those whose income comes solely from business or investments won’t be eligible for the $1,000, but can continue to claim deductions as usual.\n\n\n\n\n\nTaxpayers whose work-related expenses exceed $1,000 can still itemise and claim them individually.\n\n\n\nAlbanese said everybody — including part-time workers and those working from home — will be able to claim the deduction without having to keep records or receipts.\n\n\n\n\n\nAccording to Labor, more than one in three Australians currently claim under $1,000 in deductions and would benefit from the simplified process.\n\n\n\nHow will it work?\n\nInstead of itemising individual deductions and keeping track of receipts, taxpayers could opt for the instant deduction from 2026/27.\n\n\n\n\n\n\"This will guarantee that everyone can opt for an automatic tax deduction of $1,000 on their work expenses. No paperwork, no box of receipts, no scrolling through your online banking. Just tick the box and your return's ready to go,\" Albanese said.\n\n\n\n\n\nThe government says these taxpayers would be able to complete their return in as few as six clicks, saving time and effort. However the automatic deduction will only be available for taxpayers claiming less than $1,000 with the existing process remaining in place for those who lodge higher claims.\n\n\n\nProfessor Robert Deutsch from The Tax Institute said the proposal could result in some people claiming more than they would normally be entitled to under the current system.\n\n\n\n\n\n\"There will be people who would typically receive, say, a $650 deduction, who will now be able to simply tick a box and, once this proposal is enacted, claim a $1,000 deduction,\" he said.\n\n\n\n\n\n\"But there will also be others with slightly higher deductions who might still opt for the $1,000 flat rate, so there’ll be swings and roundabouts.\"\n\n\n\n\n\nRobert added that while he welcomed Labor's initiative, it highlighted a need for a broader and modernised approach to tax time.\n\n\n\n\n\n\"The bigger concern is that I think the proposal should be expanded in time, to embrace a bigger percentage of people to enable them to get rid of the necessity to provide, keep and be able to produce receipts as a whole.\"\n\n\n\nHow much could you save?\n\nAccording to Labor the average amount of tax relief under the instant deduction is expected to be $205.\n\n\n\n\n\nFor those earning between $45,001 and $135,000, the benefit could be as much as $320.\n\n\n\n\"When our tax cuts to every taxpayer are fully implemented, the average full time income earner on $103,000 will receive $2,790. This will rise to up to $3,110 when combined with this reform, for those taxpayers who weren’t already claiming deductions,\" Labor said in a statement.\n\n\n\n\n\nLabor estimates the time saving alone from reducing the burden of record keeping on millions of taxpayers is estimated to be worth about $200 million a year.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 47
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/more-details-of-housing-policies-launched-by-major-parties-midday-news-bulletin-14-april-2025/5003b0byi",
    "title": "More details of housing policies launched by major parties | Midday News Bulletin 14 April 2025",
    "publish_date": "Mon, 14 Apr 2025 02:11:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nMore details of housing policies launched by major parties\n\nA class action lawsuit filed against Bupa aged care homes...\n\nDutch cyclist Mathieu van der Poel wins the Paris-race for the third-straight year.\n\nThe federal government says it believes it housing election policy announced over the weekend will go some way to addressing the supply issue.\n\n\n\n\n\nLabor's policy would allow all Australian first home buyers to purchase their first home with a 5 per cent deposit, avoiding lenders mortgage insurance, in an expansion of an existing scheme.\n\n\n\n\n\nThe party says it would allocate $10 billion to build 100,000 homes exclusively for first home buyers.\n\n\n\n\n\nAustralia Future Fund, which provides loans and grants for projects that increase the supply of affordable housing across Australia.\n\n\n\n\n\n\"Our government has been assiduously working on building more homes for three years now - and it's working. Let me just share some numbers with you. We've got a commitment to build 1.2 million homes with the states over the coming five years. We are making real progress on that. We've built half a million homes across the country since we came to government and that has been assisted by the policies we have put into place. Fee-free TAFE has trained half a million people around the country - 40,000 of them in construction professions.\"\n\n\n\n\n\nEconomists have expressed concern with the housing policies of both major parties, saying making it easier to buy a first home would increase house prices by fuelling demand.\n\n\n\n\n\nThe Coalition's plan would see first-time buyers deduct interest payments against their taxable incomes on the first $650,000 of a mortgage on newly-built homes.\n\n\n\n\n\nThe Coalition says it is also reviving a policy it first introduced in 2022, ahead of the last federal election.\n\n\n\n\n\nThe Super Home Buyer Scheme would allow first homebuyers to withdraw up to 40 per cent of their superannuation balance – capped at $50,000 – to purchase a home.\n\n\n\n\n\nCoalition leader Peter Dutton told Channel Seven, he feels good about the party's policies.\n\n\n\n\n\n\"It shows that we're serious about being the party for home ownership again. People have lost that dream - that hope. And we believe very strongly that because it only applies to new builds, new units, new homes; it's going to increase the supply. And that is the view of the HIA (Housing Industry Association), the housing industry experts as well. It's going to encourage housing construction, which is really important. This just means for young couples, for individuals as well - there is a huge opportunity now to get into the housing market.\"\n\n\n\n\n\nThe Greens party has launched its election policy on education, outlining a 46.5 billion-dollar-plan for free university and TAFE.\n\n\n\n\n\nGreens leader Adam Bandt party says the cost of the policy over three years would be offset by its corporate tax policy, which would involve taxing coal, gas, oil and mining companies, as well as excessive profits of big corporations.\n\n\n\n\n\n\"In a wealth country like ours, everyone should be able to afford the basics - and that includes a good quality free public education from early childhood - right the way through to TAFE and university. And we can fund it. One in three big corporations in this country pays no tax at all. Meanwhile, Gina Rinehart and Australia's billionaires, well billionaires doubled their wealth over the last six years; while everyone else was doing it tough.\"\n\n\n\n\n\nA class action lawsuit has been launched against Bupa aged care homes by residents who allege they received substandard care between 2019 and 2025.\n\n\n\n\n\nThe class action alleges that, by failing to provide staffing levels that would meet minimum acceptable standards, Bupa has breached contractual obligations and Australian Consumer Law.\n\n\n\n\n\nEcho Law has filed the case in the Federal Court, with support from Australian litigation funder CASL.\n\n\n\n\n\nHugh Evans has become the first Australian to win the Sunhak Peace Prize.\n\n\n\n\n\nThe award is announced in Seoul every two years to a person who has made significant contributions to peace and human development.\n\n\n\n\n\nThe co-founder and CEO of Global Citizen, Evans since he is proud that the organisation has seen $78.5 billion committed to ending poverty, impacting the lives of 1.3 billion people.\n\n\n\n\n\n\"During challenging geopolitical times we see up close, the dangers of parochialism and isolationism. Look what happens when we ignore humanitarian crisis or when we turn a blind eye to climate change. Leaders who do so, do so at their own peril - and that of global stability. These are all ultimately man-made global issues. And as such, they can ultimately only be solved by global citizens demanding global solutions from their leaders.\"\n\n\n\n\n\nIn cycling, Mathieu van der Poel overcame a fierce challenge by Tadej Pogacar to claim his third straight victory in the Paris-Roubaix.\n\n\n\n\n\nPogacar had been looking to become the first Tour de France winner to also prevail in this race since 1981. But he overcooked a turn and lost his balance on a cobbled section of the route.\n\n\n\n\n\nThe Dutch cyclist says an opportunity arose and he took it.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 48
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/mianne-bagger-trans-were-not-a-voice-for-women/yeyibbq87",
    "title": "Mianne Bagger: Trans - We’re Not A Voice for Women",
    "publish_date": "Mon, 14 Apr 2025 02:00:38 +0000",
    "category": "sports",
    "authors": [],
    "text": "Mianne was a guest on our Insight episode, Gender Games , broadcast in 2022; and The Gender Spectrum , broadcast in 2022.\n\n\n\n\n\nFollow Insightful on the SBS Audio App , Apple Podcasts , Spotify , or wherever you get your podcasts.\n\n\n\n\n\nHost: Kumi Taguchi\n\n\n\nSupervising Producers: Rebecca Baillie and Maria Nguyen-Emmett\n\n\n\nExecutive Producer: Ross Scheepers\n\n\n\nStory Editor: Madox Foster\n\n\n\nSenior Post Producer: Saber Baluch\n\n\n\nProduction Coordinator: Kate Hrayssi\n\n\n\nArtwork: Aaron Hobbs\n\n\n\nAudio Operations Supervisor: Jonathan Hochman\n\n\n\nMastering and mixing by Micky Grossman\n\n\n\nLISTEN TO Mianne Bagger: Trans - We’re Not A Voice for Women SBS News 14/04/2025 23:38 Play\n\n\n\n\n\nTranscript\n\n\n\n\n\nMianne: I don't know many other transsexual women, for example, but the few I do know, we know there are some places that are reserved for women that we won't go. We don't have rights to be a voice for women. Yes, we're living as women, but that's not, we've had our own journey and have that respect for women, and that mutual respect has existed, and that's now been pretty much destroyed. And now society is understandably having a backlash.\n\n\n\n\n\nKumi: Hi, I'm Kumi Taguchi. Welcome to Insightful.\n\n\n\n\n\nMianne: It almost becomes to be anyone with blue hair that doesn't agree with their observed sex at birth, and you're trans.\n\n\n\n\n\nKumi: Mianne Bagger transitioned in the 90s. In 2004, she became the first openly transitioned woman to play in a professional golf tournament.\n\n\n\n\n\nMianne: I clearly wasn't as strong, and I knew that was the case also just with general life, and the girls got to meet me as well and play against me and could see my game was no different.\n\n\n\n\n\nKumi: What struck me is how incredibly honest Mianne is and thoughtful.\n\n\n\n\n\nMianne: I was just surviving. This wasn't working, I was dying, I was suffocating.\n\n\n\n\n\nMianne: I'd rather live.\n\n\n\n\n\nKumi: And he is one of those people who's constantly learning and evolving.\n\n\n\n\n\nKumi: Mianne, it's so great to see you again. Welcome.\n\n\n\n\n\nMianne: Thank you for the invitation.\n\n\n\n\n\nKumi: You transitioned in 1992. When did you become aware of your gender identity issues?\n\n\n\n\n\nMianne: From my earliest memories is about 7 or 8 years old, and you know, it's really hard to,\n\n\n\n\n\nMianne: Explain or define what that is. It's just an awareness that happens, and a common thing I'll relate to is maybe left or right-handed, you know, it's not something that people chose, it's just something people are. And if you ask people when did you know you were left or right-handed, well,\n\n\n\n\n\nMianne: You don't, you just are, and for me as well, that's just my earliest recollections, and it's more an awareness of maybe somehow being different, having different likes, not having things in common with other kids or other boys at the time.\n\n\n\n\n\nMianne: So you go on this, you, you start this journey of self-discovery going, what's going on? Why do I feel like this is, this isn't like everyone else?\n\n\n\n\n\nKumi: Can you think of specific things that you liked or disliked that made you feel that difference?\n\n\n\n\n\nMianne: It seems superficial to pinpoint specific things. A bit like the rough and tumble play of boys, you know, doing rugby and, and all of that kind of thing, and, and, and rough sports. I hated it.\n\n\n\n\n\nMianne: And I remember going through early stages of high school in the UK and then because I've always been good at sports, being kind of athletic, good at hand-eye coordination.\n\n\n\n\n\nMianne: And then I was almost kind of mandated in school to join the rugby team, and I thought, oh God. And that's pretty rough tackling and whatever. And I hated it. I think I played two matches and I always came out with a horrible headache and getting beaten around, and I hated it. But it's not to belittle and say, oh, there must be some gender issue, because I don't like playing rough and tumble sports. You know, it's not as, it's not that simplistic. It is far more complex.\n\n\n\n\n\nMianne: And that, and it's kind of a whole package, if you like. It is just an inner sense and this is a kind of an affinity with more things that girls liked and a, and a yearning for that. And I, I don't know what it was. A lot of disconnect from things that a lot of boys did, and just an internal sense of self. There's also that physical feeling of self, the physical wrongness of the body, so it's also an internal thing.\n\n\n\n\n\nKumi: You describe yourself as transsexual. How is that different to transgender? I'm so interested in this terminology.\n\n\n\n\n\nMianne: I know. It's become such a melting pot these days. It used to have trans or transgender came about because it was a bit of a softer term than transsexual. I always hated the term just because of the connotations that it contained the word sex or sexual, which was fine, but now, of course, we were in this.\n\n\n\n\n\nMianne: Weird climate today of well which has amounted to gender activists and everything being lumped under the trans label. It almost becomes to be anyone with blue hair that doesn't agree with their observed sex at birth, and you're trans, and then transsexual people that, let's say be diagnosed with gender dysphoria, I'll put that in quotes, whatever that might mean, because that might be fluid as well. But we've at the time had a recognised psychological condition.\n\n\n\n\n\nMianne: And have then gone through medical treatment to allay that discomfort and for the vast majority of us it's\n\n\n\n\n\nMianne: Quite successful, it's quite an appropriate treatment and enables us to get on with life. So transsexual refers to someone diagnosed with gender dysphoria and then going through the medical treatment of hormone therapy and then eventual surgical intervention, and then get on with life. And trans and transgender now doesn't even involve any medical intervention whatsoever, so we're going into the self ID and it's it.\n\n\n\n\n\nMianne: It's almost become meaningless, but unfortunately there are so many people in the trans category and so few in the transsexual category that we barely have a voice in this big screaming and noise that's going on in the public domain by gender activists that we end up not having a voice and we just fade into the background, but we also then end up getting tarred with the same brush as all the gender activists and you kind of understand.\n\n\n\n\n\nMianne: The standoff position that a lot of people in society might have, and it's like, and people don't understand the difference and don't know the difference, and I think that's why it's also important to have a bit of a voice like you're giving me now as well, to hopefully provide a bit of a, an explanation or clarity in the difference of these terms and provide that separation or that difference.\n\n\n\n\n\nKumi: What voice are you losing by being under that same umbrella?\n\n\n\n\n\nMianne: It's not so much about losing a voice, but we've also had, we, we've almost had a, a definition imposed on us. Like we're some radical or we want to demand society bend over to our whims and do whatever we say. That's not what we're about. The vast majority\n\n\n\n\n\nMianne: of transsexual men and women, we basically merge into life. We work out how do we merge, respectfully merge into life with everyone else and also almost have this mutual respect with society. And for decades prior to this, that mutual respect has existed.\n\n\n\n\n\nMianne: Women and men know this happens, but we go through a transition and then we carry on. We go and get work, and we have friends and boyfriends and girlfriends and whatever it is, some get married and get on with life, and then everyone's happy, and we also know that there are just some places that we don't really have access to. I don't know.\n\n\n\n\n\nMianne: Many other transsexual women, for example. But the few I do know, we know there are some places, for example, that are reserved for women that we won't go. We won't take positions, for example, you know, Women of the Year or Sportswoman of the Year or whatever. It's like, we don't really have rights to that title. We don't have rights to be a voice for women.\n\n\n\n\n\nMianne: Yes, we're living as women, but that's not, we've had our own journey and have that respect for women, and that mutual respect has existed, and that's now been pretty much destroyed. And now everyone's society is understandably having a backlash, you know, access to toilets and changing rooms and, and taking a quite a crowbar approach.\n\n\n\n\n\nMianne: To go, that's it, no flexibility, that's it. Game's over, full restriction, and we're probably going to be impacted by that in some regard. But I think what'll happen quite likely, it'll drive transsexual men and women underground again to live, you know, stealth, to not be able to be open about our lives, which of us, a majority of us or many of us would be.\n\n\n\n\n\nMianne: Capable of doing, and it's just a difficult life to lead. I mean, I've really enjoyed being able to live my life openly and just have friends and people accept me for just who and what I am.\n\n\n\n\n\nMianne: Uh, so who knows what the future's gonna be like?\n\n\n\n\n\nKumi: I want to go to golf. When did you first pick up a golf club and what was it about golf that appealed to you?\n\n\n\n\n\nMianne: It was basically when my mum and dad started playing golf, and I was about, I think I was about 7 or 8 years old at the time. It's probably part of my personality, you know, golf is just such an individual sport. And I'm a technical and detailed kind of person as well. And if anyone that's played a lot of golf understands that it's not just something you don't just grab a stick and hit a ball and hit it where you want it, there's, it can get really, really complex and to get proficient.\n\n\n\n\n\nMianne: At it, it takes a lot of practise, a lot of effort, a lot of really focused and targeted effort and practise with all the the little details. And I think there was some part of golf that just appealed to me immediately, and it was a family thing, so we we then lived in Denmark. We lived in a street with two other families that were a member of the same golf club with their kids.\n\n\n\n\n\nMianne: And so a lot of weekends, particularly in summer, would be at the golf club, and it was filled with fun, so the kids we'd go running around, eating ice-cream, hitting balls on the range, putting, parents were out playing.\n\n\n\n\n\nKumi: Like a lot of pro players in their rookie year, Mianne's scores this summer have been less than stellar, but she staged a powerful comeback.\n\n\n\n\n\nKumi: You took a break from the sport while you transitioned, after your surgery, you returned to amateur golf this time in the women's division. Did the game feel any\n\n\n\n\n\nMianne: different? I just wanted to go back and play golf because I loved it and I missed it. Yeah, I joined a golf club and I was just doing my own thing.\n\n\n\n\n\nMianne: With my personality, I just like doing things well. So I started practising. I'd get there early and wanted to go and play golf well. And good players at golf clubs, they get noticed. So it didn't take long, a few people, you get to know a few people, and then I play with other people, my game gets better. And then someone approached me to join a local pennant team in Adelaide, a women's team.\n\n\n\n\n\nMianne: And of course that surprised me and I thought, really, I mean they all knew who I was. I was always open about my past even then.\n\n\n\n\n\nMianne: And they approached me regardless, and I did question, are you sure? Is that OK? And they go, yeah, yeah, and you know, we discussed it, it's happening around the country. So then I was asked to join a local pennant squad, and I was really tentative because I I was thinking, look, is this fair? Is this OK?\n\n\n\n\n\nMianne: And I stepped into it slowly and I got to play with some of the better players in the state.\n\n\n\n\n\nKumi: Jumping in there, did you express that feeling that you're having of, is this fair? Should I be doing this?\n\n\n\n\n\nMianne: Yes, I, I did because I did question if that was sure this is OK and they reassured me. So I played with some of the players and then playing some of these interclub competitions, I got to meet some of the better players in the state and then played a few more competitions and got to meet some of the better players in the country.\n\n\n\n\n\nMianne: And that's when I learned that my game was kind of average. I wasn't even among the longest hitters. And then I really tried, I'm gonna, you know, smash the ball, and there was plenty of girls, top ranked girls that were out hitting me and outplaying me.\n\n\n\n\n\nMianne: And I thought wow, well this seems OK and obviously this impact of transition has been very real because I know my game was was different after the impact of loss of testosterone.\n\n\n\n\n\nKumi: So you felt you weren't as strong as you had been.\n\n\n\n\n\nMianne: I clearly wasn't as strong, and I, I knew that.\n\n\n\n\n\nMianne: That was the case also just with general life. And the girls got to meet me as well and play against me and could see my game was no different. It was the same as anyone else, and I had to work just as hard as everyone else for my game to get better and to be competitive.\n\n\n\n\n\nMianne: But of course I'm just a sample size of one, you know, and they can't speak to populations. And so while me individually might have been OK, but that doesn't speak for the majority, and now the 20 years since that time has obviously been shining up.\n\n\n\n\n\nMianne: Brighter light on the issue where it has become problematic. Clearly this can't go unrestricted. There needs to be some rules in some context, even if it does mean the complete restriction, for example, to someone like me to uh women's competitive sport.\n\n\n\n\n\nKumi: If you felt like you had an advantage in a sport, would you withdraw yourself from a women's competition?\n\n\n\n\n\nMianne: Well, now I just, I, I won't go and compete. I won't go and play. I've sometimes thought about it. It would be really lovely, even just to play the Pro-Am series here in Australia. And I've got a good friend that I, I, I've known from amateur golf days, from the very beginning in playing state women's golf, who I've sometimes toured with. We've played a bit in Europe and we travelled in Australia. And, you know, she's asked if I'm gonna go and play.\n\n\n\n\n\nMianne: Uh, the next upcoming season. And as much as I'd love to, I have sometimes thought about it, because my game's still generally pretty good. I keep fit. Um, my game is good enough, but I, I just can't do it in principle, with everything that's going on in the country and globally, I can't do it. I like to consider that I go through life with some integrity, and it just wouldn't sit well with me, and I, as much as I'd like to, I, I just can't.\n\n\n\n\n\nKumi: In 2003, you had an emotional episode that you say changed your life. You were in your late thirties at the time. What happened?\n\n\n\n\n\nMianne: That was a really a weird period. I was still working full-time and I was obviously playing amateur golf.\n\n\n\n\n\nMianne: And it's just one of these things sometimes that happens in our lives, in the universe, things were coming to an end. One day I got home from work, sat down, shut the door, and I started crying. I just felt this overwhelm, and I just can't explain it. I don't know if it's an emotional breakdown or what do you, I don't know what to call it.\n\n\n\n\n\nMianne: But uh I've never experienced it before and I was crying and so I look, I made some dinner and I was crying, I ate dinner crying. I thought I'll go and have a shower and go to bed and I was crying. I went to bed, went to sleep crying.\n\n\n\n\n\nMianne: I finally slept and as soon as I woke up the next morning, I started crying, and I got ready and I thought what the hell is going on, like I, I just didn't understand it.\n\n\n\n\n\nMianne: And I thought, look, I'll just keep going and get into it, it'll probably wear off, and I was crying and I got in the car and I drove out of the gate and, you know, there was a car coming down the road. I'll quickly just nip out and onto the road, and I turned a bit sharply and smashed into a parked car, and, you know, smashed the front of my car up and I just, whatever, who cares, and I kept driving and I drove to work.\n\n\n\n\n\nMianne: I thought I'll get busy with work and I was still crying, and then I just, I had to go into to the office and just say, look, I don't know what's going on, but I can't stop crying.\n\n\n\n\n\nMianne: I'm gonna go.\n\n\n\n\n\nMianne: So I went home and then eventually it subsided, and it was just this, look, I'm a bit of a philosophical person and spiritual person in some sense, and,\n\n\n\n\n\nMianne: We have these times in life where it's like the universe is speaking to us, it's giving us a bit of a nudge. It's like, hey, are you listening here, and then it sort of pushes it a bit harder and then it gives us a punch in the face and the hints get harder and\n\n\n\n\n\nMianne: louder. Can you hear me? Because women's amateur golf was coming to an end. I was at the same job for 16 years, which was amazing.\n\n\n\n\n\nMianne: Amazing at doing research and development with, uh, loudspeakers, hi fi cinema speakers. Loved my job. I loved going to work every single day. Relationships weren't happening because I was opening about my life, and this was in Adelaide. It's a pretty small conservative city, so that wasn't happening. And kind of everything was like coming to a stop.\n\n\n\n\n\nMianne: And I wanted to go and see if I could pursue professional golf, because at the time I'd been playing amateur golf for a number of a few years and was on the state team, and I thought, look, I'm gonna see if I can do this.\n\n\n\n\n\nMianne: So that it basically started my journey, and I thought, whatever it is, I've got to get out of here. There's a big wide world out there, and I want to go and live life. I was in a place with a mortgage and a car loan and interest-free furniture, and there was no light at the end of the tunnel, and I thought, this isn't living. And I think I was probably feeling the suffocation of the restriction of this life, in quotes.\n\n\n\n\n\nMianne: And I thought, I'm not doing this, I need to live lives, and I don't know how I'm gonna do this. So I sold everything. I sold my house, car, furniture. I left my job because I couldn't just keep one bit because I needed a job to pay for the mortgage, but if I sold the house, well, I'll need somewhere to live if I'm gonna work, so I had to get rid of all of it.\n\n\n\n\n\nKumi: In what time frame did this happen?\n\n\n\n\n\nMianne: Pretty quickly, 3 to 6 months.\n\n\n\n\n\nKumi: Wow, I guess. It takes a lot of courage to do that.\n\n\n\n\n\nMianne: You know, it's really funny people use.\n\n\n\n\n\nMianne: With courage a lot with my life, which is lovely. But the analogy I always use, like, imagine you're in a small boat out a few kilometres out in the ocean and it sinks, and you're there floating in the water and you can see land just over there. Are you just gonna give up and drown, or are you gonna swim because you can see the land just there? And it's not brave. It's survival. And you just do it. That's what we do as humans. And that's all I was doing. I was just surviving. This wasn't working, I was dying. I was suffocating.\n\n\n\n\n\nMianne: I'd rather live. So I did what I needed to do to live, and it was just in a different journey because of my life, the way my life has gone. I haven't had the same kind of, I'll call it privileges in life as as other people. I don't just get to meet a guy and have an open relationship and see how it transpires. No, my past comes out.\n\n\n\n\n\nMianne: Most of the time they freak out and it all comes to a crashes in a burning heap. That's fine. I look, I get it. Uh, there's not a complaint about that. And with other journeys in life, there's always these restrictions or obstacles I have to overcome. So I decided, look, I'm gonna go and live life my way. I have to find my journey in life.\n\n\n\n\n\nMianne: And how I can walk my path, whatever that might be, but it's not going to be sitting in a house paying a mortgage when there's this big wide world out there, so I, I'm gonna go live life and if I'm gonna sort of have an early, an early demise, an early death, well let's at least give it a crack, and as they say, let's dive sliding into the grave kind of thing.\n\n\n\n\n\nMianne: So I wanted to see if I could change the rules of golf around the world, so I wrote to some of the main tours Europe, US and Australia, going, hey, they already knew who I was and I approached them and asked them about.\n\n\n\n\n\nMianne: Whether they would consider changing their rules, and it just happened to coincide with the IOC, the International Olympic Committee, first introducing their policy of sex reassignment in sport, which obviously made it easier for different sporting bodies to change their rules, and a long story short, I eventually ended up having rules changed in 6 countries on 3 continents.\n\n\n\n\n\nMianne: And then I was eligible to compete, and I went to the European tour, got my tour card and then had an 1112 year touring career ensued.\n\n\n\n\n\nKumi: How did you get them to change their mind?\n\n\n\n\n\nMianne: It wasn't about me getting them to change their mind.\n\n\n\n\n\nMianne: I just walked through life with honesty and integrity is generally how I put it. But I think it was important for me to go and meet them, sit face to face with someone. It's easy to have a, an opinion against someone when you're dealing with them remotely, but when you're sitting face to face, you get that human connection. And maybe it was unfair that I did it that way, cause it's a bit harder to cast someone off when they're sitting in front of you. But they'd seen me on TV, they knew who I was, and\n\n\n\n\n\nMianne: Just want to hear how I presented things.\n\n\n\n\n\nMianne: And well, they made their decisions without any\n\n\n\n\n\nMianne: I say, look, it's not like I was threatening them with legal action. That was never going to be a modus operandi of my journey into this. This was to be based on any knowledge of science or humanity at the time, which primarily it was whether misguided or not, they made the best decisions at that time.\n\n\n\n\n\nMianne: To my benefit.\n\n\n\n\n\nKumi: Have you ever wondered what your life would look like had you not had that emotional episode?\n\n\n\n\n\nMianne: No, I don't really entertain thoughts like that, I guess, because they're they're somewhat meaningless, you know, our life is what they are, and they're not any different.\n\n\n\n\n\nKumi: Now, it was hard to get you into the studio, Mianne, because we need to time you being in Sydney with your travels and the lifestyle you have, which is living in a caravan. Tell us about that lifestyle and, yeah, just tell us about your caravan maybe first and that lifestyle.\n\n\n\n\n\nMianne: So it's not a caravan, I live out of a van, a van, OK, so it's a small van. So when I was touring, obviously I sold everything and,\n\n\n\n\n\nMianne: I hadn't had a car for 18 years, you know, the government had closed down borders and we couldn't travel, and I needed to travel. So I bought a van and I converted it myself. You know, I do web development, so I set it up with a monitor so I can sit and work in my van. And I just need to have, I don't know what it is, again, my personality, uh, and I don't know if maybe it's a disorder I've got, but I need to keep moving, keep travelling, and I need to be in sunshine and warmth. It's just crucial to our health.\n\n\n\n\n\nMianne: But I love people and I love travelling new destinations. So now I generally go north in winter, obviously for sunshine, it just gets too cold down south. And I do different kind of work. I do obviously some web development. It's more of a, I don't know, what do we call it, a boutique web development business, just a personal connection with businesses and people. I'm a sometimes barista, so I work as a\n\n\n\n\n\nMianne: and places I'm a complete coffee snob. That's so good. Yeah, so I do some of that. I look, I've done hostel cleaning, cleaning jobs, and a bit of farm work and, and just go out and do new things. It's tied in also to changing our ideals because it's so easy to keep walking the same worn path. And as the saying goes, it's impossible to be a tourist in your own town.\n\n\n\n\n\nMianne: So I wanted to do new things and meet new people, so I had to get out of what was familiar to me and do new things. I'd never worked in a shop before.\n\n\n\n\n\nKumi: What do your family and friends think about how you live in your van?\n\n\n\n\n\nMianne: Huh? Well, my friends, you know, they love it, they think it's great. One thing I do love, you know, even when I was touring, because I would spend summer in Europe and summer in Australia, and people would often say, when I turn up, ohh, my Anna's here, it must be summer.\n\n\n\n\n\nMianne: And I love that. It's like, you're the season. I'm the sunshine. You're the sunshine. And I love that. I bring a different energy into places, and I like that I do that too. And when I go and stay with people, one of the things I love doing is coming in and cooking dinner, because I don't often get to use kitchens. I can cook out of my van and everything. It's all self-powered and all of that kind of thing. But there's nothing like using a proper big kitchen. So I come into people's homes and cook dinner a couple of times.\n\n\n\n\n\nKumi: Mianne, it is such a pleasure to see you again. Thank you so much for dropping in on your journey South.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 49
  },
  {
    "url": "https://www.sbs.com.au/news/article/devil-in-the-detail-will-first-home-buyers-benefit-from-labor-and-coalition-promises/z6bwv9vx5",
    "title": "'Devil in the detail': Will first home buyers benefit from Labor and Coalition promises?",
    "publish_date": "Mon, 14 Apr 2025 01:43:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "Economists and industry leaders have expressed concern over housing promises made by both Labor and the Coalition during the election campaign .\n\n\n\n\n\nAt the weekend, Prime Minister Anthony Albanese committed to expanding a scheme that allows first home buyers to purchase a home with a 5 per cent deposit; and said Labor would also build up to 100,000 new affordable homes for first home buyers.\n\n\n\n\n\nMeanwhile, Opposition leader Peter Dutton unveiled a plan that would make interest payments on the first $650,000 of a first home buyer's mortgage tax deductible for the first five years for those who purchase a newly built home.\n\n\n\n\n\nEconomist Chris Richardson described both parties' approaches as \"pretty dumb\", warning that their housing pledges would only worsen inflation and fail to address Australia’s housing affordability crisis.\n\n\n\nRichardson added that property prices would likely continue to rise as a result of these promises.\n\n\n\n\n\n\"Both sides are promising to give us extra money … this doesn’t make Australia more prosperous. It’s just more money, chasing the same amount of stuff [and resulting in] prices higher than they need to be,\" he said.\n\n\n\nHow is housing affordability being defined?\n\nIndependent senator Jacqui Lambie also hit out at both leaders for failing to deliver on previous housing commitments.\n\n\n\n\n\n\"I mean, you’ve got to be kidding me,\" Lambie said in an interview on Channel Nine's Today on Monday.\n\n\n\n\n\n\"How about you turn the first lot of soil on the first 50 or 60,000 homes that you’ve promised?\"\n\n\n\n\n\nLabor's Housing Australia Future Fund to build 20,000 new social housing properties over five years from 2024 has been criticised for not yet delivering any new homes, although Labor has blamed delays in getting legislation passed on the Greens and Coalition.\n\n\n\nExperts have also questioned the way housing affordability is being defined in the national conversation.\n\n\n\n\n\nLiam Davies, a lecturer in sustainability and urban planning at RMIT, argued that many of the new schemes on offer are mislabelled as being aimed at housing affordability.\n\n\n\n\n\n\"They’re actually about 'accessibility'— we’ve just made it easier to get really big loans and that we call 'housing affordability'.\"\n\n\n\nTwo solutions for two different groups\n\nDavies noted that the two major housing schemes target different demographics.\n\n\n\n\n\nLabor is helping those without a deposit and the Coalition is focusing on those who already have one, but both face the same fundamental issue: a reliance on new builds.\n\n\n\n\n\nDavies said the \"devil in the detail\" is that the policies are only for new builds.\n\n\n\nREAD MORE The voters who could see more misinformation this election\n\n\"So it really depends on when those new builds are built, where they’re built,\" he said.\n\n\n\n\n\n\"If it’s just suburban housing on the fringe, that doesn’t really help.\"\n\n\n\n\n\nHe added that given the scale of government expenditure involved, there needed to be a longer-term strategy to ensure sustained housing accessibility and genuine affordability.\n\n\n\nMore support needed to keep up with demand\n\nFrom an industry perspective, Property Council of Australia CEO Mike Zorbas welcomed the proposed injection of new builds as a \"shot in the arm\" but warned more support for local planning systems was needed to ensure supply could keep pace.\n\n\n\n\n\n\"Coupled with supply improvement policies, deductibility of mortgage repayments on new builds will help first home buyers who are watching their dream of home ownership slip away,\" he said.\n\n\n\n\n\n\"A stronger demand pipeline allows building businesses to plan for the future with confidence, translating to more new homes across the country and is a hedge against global uncertainty.\n\n\n\n\n\n\"Whoever forms government will need to apply additional direct incentives to boost state and local government supply and approval capacity, keeping the market in equilibrium, to build the homes the nation needs.\"\n\n\n\nLabor and the Coalition defend their housing plans\n\nBoth major parties have backed their policies.\n\n\n\n\n\n\"On our advice, we're not expecting there to be a substantial impact on demand or on prices,\" Treasurer Jim Chalmers told ABC about Labor's 5 per cent deposit plan.\n\n\n\n\n\n\"We are extremely confident that this is a very responsible way to get more first home buyers into the market.\"\n\n\n\n\n\nLISTEN TO Who will make an impact, minor parties moves and the teal wave future SBS News 10/04/2025 29:05 Play\n\nHe also noted the government had a $43 billion agenda and the primary focus was to build more homes.\n\n\n\n\n\nMeanwhile Opposition leader Peter Dutton side-stepped economists' concerns his tax deductibility policy would only drive up prices and disproportionately benefit higher income earners, arguing it would help boost housing supply.\n\n\n\n\n\n\"It's going to encourage construction, which is really important,\" he told Seven's Sunrise program.\n\n\n\n\n\nCorrection: An earlier version of this story noted that Labor's policy to allow first home buyers to purchase a home with a 5 per cent deposit only applied if they bought a newly built or substantially renovated home. This is incorrect, the policy also covers existing homes.\n\n\n\n\n\n",
    "source": "SBS",
    "cluster_id": 50
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/di-sheehan-the-church-stole-my-baby/kgijtoo6t",
    "title": "Di Sheehan: The Church Stole my Baby",
    "publish_date": "Mon, 14 Apr 2025 01:00:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Di was a guest on our Insight episode, Secrets and Lies , broadcast in 2024.\n\n\n\n\n\nFollow Insightful on the SBS Audio App , Apple Podcasts , Spotify , or wherever you get your podcasts.\n\n\n\n\n\nHost: Kumi Taguchi\n\n\n\nSupervising Producers: Rebecca Baillie and Maria Nguyen-Emmett\n\n\n\nExecutive Producer: Ross Scheepers\n\n\n\nStory Editor: Madox Foster\n\n\n\nSenior Post Producer: Saber Baluch\n\n\n\nProduction Coordinator: Kate Hrayssi\n\n\n\nArtwork: Aaron Hobbs\n\n\n\nAudio Operations Supervisor: Jonathan Hochman\n\n\n\nMastering and mixing by Micky Grossman\n\n\n\nLISTEN TO Di Sheehan: The Church Stole my Baby SBS News 14/04/2025 23:50 Play\n\nTranscript\n\n\n\n\n\nDi: The issue for me is that what the Catholic Church in particular and other churches.\n\n\n\n\n\nDi: What they were doing, which was so cruel in their mind, they were turning a child that they labelled as illegitimate into a legitimate child, a child that needed to be saved from the young, unmarried mother.\n\n\n\n\n\nKumi: You discovered that the baby you had been told had died at birth, was in fact alive. What was it like to learn that?\n\n\n\n\n\nDi: I was trying to work out what happened. I was trying to remember to breathe again. I was also trying to work out how I would tell my other children and my family, because with this secret, to me, I hadn't told anyone.\n\n\n\n\n\nKumi: Hi, I'm Kumi Taguchi. Welcome to Insightful. It's impossible to forget Di Sheehan.\n\n\n\n\n\nDi: I turned to my then husband and I turned to him and said, I want another baby.\n\n\n\n\n\nDi: Because there was a void there.\n\n\n\n\n\nKumi: I was so happy that Di wanted to chat again for this podcast.\n\n\n\n\n\nKumi: Hi Di. How nice is it to see you again? I was just smiling as you were walking in.\n\n\n\n\n\nDi: Alright, OK.\n\n\n\n\n\nKumi: Thank you so much for coming to chat.\n\n\n\n\n\nKumi: Di, you were one of 5 children. You grew up in a big Catholic family. What was it like growing up in that family in the sort of 50s and 60s?\n\n\n\n\n\nDi: It was a difficult childhood as such. My brother and sisters, we had a really good relationship, but we didn't as such have a conventional upbringing. We were raised in hotels.\n\n\n\n\n\nDi: I quite often say that I come from an Irish Catholic alcoholic background, and that's quite literally true. My father was a publican. My first memory is that downstairs was a pub, you know, old fashioned hotel.\n\n\n\n\n\nDi:. So my sisters and my brother, we were like a little gang because we just roamed through the hotel, you know, went into the guest rooms, jumped on the bed, got into trouble, all those sorts of things. And from a very early age, we all tried to stay out of the way of our father, because you would never know what would set him off when you're living in that environment.\n\n\n\n\n\nDi: There's a lot of alcohol, you know, obviously a lot of drinking, a lot of smoking, you know, the smells. To this day, I can't walk past a hotel and I get a whiff from the cellar of beer and it just turns my stomach, as does the smell of cigarettes. It was just that that environment.\n\n\n\n\n\nKumi: I understand you stood up to your father when you were about 11. What happened there?\n\n\n\n\n\nDi: I did stand up to my father. I can remember distinctly it was my mother's birthday and he had bought her a piece of jewelry. He had it in a box. But he was drunk. He was, he was pissed. We were all, you know, wanting to have cake and all laughing and talking, etc. and I don't know what set him off and\n\n\n\n\n\nDi: He just threw the box with the ring or whatever was inside at my mother and hit her.\n\n\n\n\n\nDi: And I, I did try to stand up to him.\n\n\n\n\n\nDi: And tell him that that wasn't right. We were, all of us were concerned, we were in tears and he hit me.\n\n\n\n\n\nDi: So I ran out. I, I left.\n\n\n\n\n\nDi: I just ran out the door and I thought, I'll go somewhere safe, which was the local Catholic Church. And the priest listened to what I said and then drove me back and put me back inside.\n\n\n\n\n\nDi: And then of course, my father says, I'll come in for a drink. And then the priest says, well, well, you know, it's good to have her home. I'll stay and have some drinks with you. It must be difficult having a daughter that age that isn't obedient or doesn't respect you or things like that.\n\n\n\n\n\nDi: And that was a betrayal. That was a betrayal. I had, I can remember, I felt such hatred, you know, having been told that the church was a sanctuary.\n\n\n\n\n\nDi: And in fact, the priest, that priest and other priests were just my father's drinking buddies.\n\n\n\n\n\nKumi: You must have felt so let down and that kind of trust.\n\n\n\n\n\nDi: Absolutely, and abandoned. And when that happens when you're a child, you start to put up those barriers to protect yourself.\n\n\n\n\n\nKumi: You've said that sort of the only way that you could survive your childhood was to sort of get out as soon as you could and getting an education and\n\n\n\n\n\nKumi: Studying to be a vet, it feels like they, that was such a huge part of having an adulthood or moving out of that childhood.\n\n\n\n\n\nDi: It was important for me earlier on.\n\n\n\n\n\nDi: To take control of my life. I can remember that I.\n\n\n\n\n\nDi: And I didn't think this straight away. It was a conscious thought that I was never.\n\n\n\n\n\nDi: Going to let anyone have any control over my life, that sort of control over my life, that I was going to be responsible for myself.\n\n\n\n\n\nDi: And I knew that I needed to, I needed to educate myself, and that's what I focused on.\n\n\n\n\n\nKumi: You fall in love, you're unwed. You fall pregnant.\n\n\n\n\n\nKumi: When you found out you were pregnant, what went through your mind?\n\n\n\n\n\nDi: First of all, I think I was in denial. It was, I can't be, it's.\n\n\n\n\n\nDi: Not possible, um, you know, all the things that go through here.\n\n\n\n\n\nDi: And I had a baby.\n\n\n\n\n\nDi: And I was told that the baby had died. I didn't ever, after he was born, I didn't hold him. They.\n\n\n\n\n\nDi: Took him away, and I don't even know that anyone told me that I'd had a boy.\n\n\n\n\n\nDi: And then I was left isolated. I can remember they took him away and everyone left. And I was freezing cold. I can remember.\n\n\n\n\n\nDi: I just was shivering.\n\n\n\n\n\nDi: And I was on, you know, I remember it as a stainless steel table by myself, left there by myself.\n\n\n\n\n\nDi: And I don't know for how long. And I can remember that.\n\n\n\n\n\nDi: I think it was a doctor because a man went past the door.\n\n\n\n\n\nDi: With a white coat on and she said, Are you all right? And I was shivering, I was crying. I was bleeding. I had no blanket on me, nothing.\n\n\n\n\n\nDi: And he said, are you all right? And I said, I just went no. And he just walked a few paces and he said,\n\n\n\n\n\nDi: She must have been the nurses standing there.\n\n\n\n\n\nDi: Someone get in there and look after her.\n\n\n\n\n\nDi: That…that was the only kindness that I received at that time.\n\n\n\n\n\nKumi: So you're all alone, you've given birth to a baby. You haven't held him, you don't even know it's a him.\n\n\n\n\n\nKumi: Do they then come in and say, your baby died?\n\n\n\n\n\nDi: No, nothing.\n\n\n\n\n\nDi: From that time, having seen that doctor.\n\n\n\n\n\nDi: I don't have a lot of memories after that. I can't remember whether it was like death by 1000 cuts where they came in and said that he was.\n\n\n\n\n\nDi: Unwell or, but I do know that they said that he hadn't survived.\n\n\n\n\n\nKumi: You then signed papers which you believed were sort of discharge papers to get you out of the hospital, but in fact, you were signing adoption you were handing over your child to the, to the state.\n\n\n\n\n\nDi: Yes. That's exactly what happened. I was told that I couldn't leave the hospital until I'd signed the papers, so I signed the papers. Then I left.\n\n\n\n\n\nKumi: You went on to marry and have 2 more children, when you held those babies in your arms and you brought them home.\n\n\n\n\n\nKumi: What was that like?\n\n\n\n\n\nDi: It was absolutely. It was absolutely wonderful. It was.\n\n\n\n\n\nDi: Most wonderful, wonderful feeling.\n\n\n\n\n\nDi: To be responsible for this child, to have this love that I did have, and I understand more now. For my eldest son, I had maternal connection and I had love for him, but no child to.\n\n\n\n\n\nDi: To give it to and then having buried all those feelings when I had.\n\n\n\n\n\nDi: My other children, it was I.\n\n\n\n\n\nDi: Just poured myself, I just.\n\n\n\n\n\nDi: I just rank up their smell, their touch, they feel, their noises and fully accepted the responsibility to look after them.\n\n\n\n\n\nDi: I know that when, because I had a daughter with my then husband and then a son.\n\n\n\n\n\nDi: And when I had my son.\n\n\n\n\n\nDi: I turned to my then husband and I turned to him and said, I want another baby.\n\n\n\n\n\nDi: Because there was a void there, it was his toe.\n\n\n\n\n\nDi: I wanted my first child to be part of this family.\n\n\n\n\n\nKumi: Did you ever tell your then husband about your firstborn?\n\n\n\n\n\nDi: No.\n\n\n\n\n\nDi: No, when I buried all this, and then started virtually a new life.\n\n\n\n\n\nDi: I'd buried it so deeply, I didn't have.\n\n\n\n\n\nDi: The skills, I didn't have the understanding to be able to talk about this to anyone and.\n\n\n\n\n\nDi: Not to him either.\n\n\n\n\n\nKumi: 42 years later, you received an email. Who was it from?\n\n\n\n\n\nDi: I received an email from a young man saying with his birth date in the hospital saying he thought.\n\n\n\n\n\nDi: That I was his mother.\n\n\n\n\n\nDi: And I couldn't breathe. I I couldn't breathe.\n\n\n\n\n\nDi: It was uh very difficult to take in and then I had to process.\n\n\n\n\n\nDi: What had happened in the context of me personally because I had blocked out exactly what had happened. And I think the issue for me is that what society in general at that time and the Catholic Church in particular and other churches and doctors, etc. what they were doing, which was so cruel and so lacking in the form of\n\n\n\n\n\nDi: Kindness at all.\n\n\n\n\n\nDi: was that they were in their mind, they were turning.\n\n\n\n\n\nDi: A child that they labelled as illegitimate into a legitimate child, a child that needed to be saved from the young, unmarried mother.\n\n\n\n\n\nKumi: You discovered that the baby you had been told had died at birth, was in fact alive, and that you have a son who is now in his 50s. What was it like to learn that?\n\n\n\n\n\nDi: It was… It was sheer joy. It was unbridled joy.\n\n\n\n\n\nDi: That what I'd buried so deeply in the secret that I'd held.\n\n\n\n\n\nDi: And what I'd been told was not true. And the fact that he he was alive wasn't just a relief, it was just.\n\n\n\n\n\nDi: Joy, even as I was trying to work out what happened, I was trying to remember to breathe again. I was also trying to work out how I would tell my other children and my family, because with this secret, to me, I hadn't told anyone.\n\n\n\n\n\nDi: Mm.\n\n\n\n\n\nKumi: It's just extraordinary. I can't even imagine that moment and so much to process in an instant, in an instant. You were initially quite reluctant to talk about your story. Why was that?\n\n\n\n\n\nDi: The story is very personal, even though it happened to, you know, the same situation in various forms happened to probably around 240, 250,000 young women that were either coerced or lied to and their babies were then taken and given to couples, other couples.\n\n\n\n\n\nDi: But I didn't want to be seen as a victim or.\n\n\n\n\n\nDi: Being gratuitous in this very, very personal situation. And I think just thinking about it now with that question that you've asked is,\n\n\n\n\n\nDi: I think that I didn't want to be judged.\n\n\n\n\n\nDi: I think, and, ah, I think that was a big.\n\n\n\n\n\nDi: Being part of it.\n\n\n\n\n\nDi: It kept this secret for decades, you know, like with me, it was 40 years. It was important to be able to say that, to be able to sit there and let people know that this actually happened and it had a devastating effect on the young women and the children involved.\n\n\n\n\n\nKumi: What sort of judgement were you thinking might happen or what were you afraid?\n\n\n\n\n\nKumi: That people might say, what did you think people would say?\n\n\n\n\n\nDi: I always thought of myself as having been brought up in the Catholic Church. I labelled myself as a Catholic girl gone bad. And\n\n\n\n\n\nDi: Even when I, when I think of it now, that's.\n\n\n\n\n\nDi: It's very painful.\n\n\n\n\n\nDi: To think that I, well, it's sad to think that that's how I labelled myself but.\n\n\n\n\n\nDi: When you're a young girl and you've been brought up and told by nuns and involved in the Catholic Church, then that label became a part of me. I know it's not rational, but it was.\n\n\n\n\n\nDi: That understanding that, what I'd been taught as a Catholic child and the strict moral code that I'd done something just.\n\n\n\n\n\nDi: Absolutely awful, which was to fall in love with a young man and have a relationship.\n\n\n\n\n\nDi: And not be buried and then have a baby. So that was in society these days, I mean, you would think, wouldn't do that. We've come a long way. But that background and that indoctrination is very entrenched, becomes entrenched. And you, you can tell I get transported back a bit to.\n\n\n\n\n\nDi: What happened, even though I don't have whole memories of that time, I lost probably more than 2, closer to 4 years of my life. After that, just trying to cope without any support, etc. and nobody talking about anything, just trying to move on.\n\n\n\n\n\nDi: And when that happens, that is the judgement and the pain. Some people have called me brave, which I don't think that I am, but I think\n\n\n\n\n\nDi: If you don't talk about a secret, if you don't acknowledge it, then.\n\n\n\n\n\nDi: I don't believe you can move on, and I probably would have if my son hadn't.\n\n\n\n\n\nDi: Hadn't sent me an email, I probably would have gone to my grave without sounding melodramatic.\n\n\n\n\n\nDi: Without telling anyone. Whereas now that I've spoken about it to my family and my friends, and that is all part of the healing process and an understanding too of\n\n\n\n\n\nDi: Our history, which was so devastating to a group of society that we're actually innocent young women.\n\n\n\n\n\nKumi: When did you tell your then adult children? About him and what was that like?\n\n\n\n\n\nDi: We always have a family dinner once a week. And my youngest was still at home. He was at university and my daughter would come over. And so I said, OK, then, come over for dinner. We'll have a family meeting. I've got something I want to tell you. So they were there in the kitchen, meal was going out onto the table. And my youngest stood in the kitchen and said, OK, you've got something to tell us. And I said, yes. I said, but we'll have dinner and then I'll talk to you.\n\n\n\n\n\nDi: And he went, I know what it is.\n\n\n\n\n\nDi: And I went, I don't think so. He was adamant, yes, I know what it is.\n\n\n\n\n\nDi: I went, OK, what is it, then, what do you think it is? And he went, you've found God.\n\n\n\n\n\nKumi: So there was something different about you and you've kind of flagged that there's something you want to talk about. When he said that, did you laugh? What the fuck?\n\n\n\n\n\nKumi: What the fuck?\n\n\n\n\n\nDi: I said, Tom, where did you get? Why would you think that? I mean, that's absurd. I said, you know what I think about religion. And I said to him, you don't know your mother very well at all, do you?\n\n\n\n\n\nKumi: Yeah.\n\n\n\n\n\nKumi: And so you say, no, I'm not, I'm not, that's not what's happened. I haven't found God, but this is what's happened.\n\n\n\n\n\nDi: And by the time I had told them, just I told them briefly that I had a relationship and that I've been contacted and my son and I'd been told that he died and now he was here and\n\n\n\n\n\nDi: And then I said, and by the way, I'm a grandmother, and they burst out.\n\n\n\n\n\nDi: I mean, you're a grandmother. Oh God, like this. And then I had the email and I gave it to them. And then I was crying and my daughter hugged me and\n\n\n\n\n\nDi: Then we talked a bit about what had happened, etc. and they accepted it. They accepted that they had a brother.\n\n\n\n\n\nDi: And they had two cousins as well. So it was then we moved on to, well, when can we meet them? How can we do this, etc. etc. So.\n\n\n\n\n\nDi: It was wonderful. It was absolutely wonderful.\n\n\n\n\n\nKumi: What is your relationship like with your eldest son now?\n\n\n\n\n\nDi: It's a very relaxed relationship now. I was overjoyed the first time that I heard him.\n\n\n\n\n\nDi: Refer to me as my mother sit like this, and that relationship is.\n\n\n\n\n\nDi: I think getting stronger and we're understanding.\n\n\n\n\n\nDi: More about each other. We celebrate holidays and birthdays and things like that. And I wouldn't say we, it's not that we're working on it. It's, it's, he's part of the family, we're part of his family.\n\n\n\n\n\nDi: And it's respectful and kind. It's a lovely relationship.\n\n\n\n\n\nKumi: You've described the shame you felt and feeling worthless and judged. Do you still feel that way about yourself when you look in the mirror, who's the dye that you see?\n\n\n\n\n\nDi: No, I don't feel that way, I think.\n\n\n\n\n\nDi: My son finding me has meant that I can.\n\n\n\n\n\nDi: Accept what happened without the guilt, have a better understanding of what was going on.\n\n\n\n\n\nDi: And I'm probably less angry than I was, you know, holding on to a secret like that.\n\n\n\n\n\nDi: I don't want to sound melodramatic in that it eats you away, but it's there and.\n\n\n\n\n\nDi: You can't be your true self if you're not honest with.\n\n\n\n\n\nDi: With yourself, with your family, you know, with your friends. So having that secret, it was cathartic as such and\n\n\n\n\n\nDi: And I am allowing myself to be.\n\n\n\n\n\nDi: Happier, more content, and enjoying.\n\n\n\n\n\nDi: The things that go on with in my life, but also with my family.\n\n\n\n\n\nKumi: Di, it is such a pleasure to chat to you again and see you again.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 51
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-kids-are-struggling-with-maths-due-to-unproven-teaching-methods/fchn1x8xr",
    "title": "Australian kids are struggling with maths due to 'unproven' teaching methods, report shows",
    "publish_date": "Mon, 14 Apr 2025 00:44:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "A Grattan Institute study has found that not only are Australia's students struggling with maths, but many teachers lack the confidence to teach it even at a Year Six level.\n\n\n\n\n\nThe institute has called for a number of government commitments, including a long-term goal of 90 per cent numeracy proficiency on NAPLAN testing, clearer guidance to schools on teaching methods and more professional development for teachers.\n\n\n\n\n\nJust 13 per cent of Australian Year Four students excelled on a 2023 international maths test, compared with 22 per cent in England, 16 per cent in Ireland and 32 per cent in Japan.\n\n\n\n\n\nAt Year Eight level, just 11 per cent of Australians excelled.\n\n\n\n'Faddish' teaching methods criticised\n\nJordana Hunter, education program director at Grattan Institute, said Australia had deprioritised maths for decades.\n\n\n\n\n\n\"Governments have also been too slow to rule out faddish but unproven maths teaching methods,\" she said.\n\n\n\n\n\n\"To turn rhetoric into reality, governments need to take seriously the evidence base on how humans, including children, learn maths most effectively.\"\n\n\n\nThe institute's survey found some teachers lacked the confidence to teach Year Six maths, while many were concerned about their colleagues' ability to teach the subject.\n\n\n\n\n\nHunter said a 10-year 'maths guarantee strategy' would only cost about $67 per primary school student a year.\n\n\n\nREAD MORE Is your kid getting too much screen time? Take our quiz to find out\n\nJoanna Barbousas, education expert at La Trobe University, said the study made it clear action was needed to halt the \"numeracy crisis\".\n\n\n\n\n\n\"The lifetime impact for students who fall behind on these core skills is substantial, affecting long-term employment, health and social outcomes and perpetuating cycles of disadvantage.\n\n\n\n\n\n\"Teachers are telling us they feel unprepared for the classroom … when half of our 15-year-olds fail to achieve national standards in maths, it's not the students who are failing, it's our approach to education.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.theage.com.au/politics/federal/federal-election-2025-live-voters-weigh-in-on-trump-impact-to-election-campaign-dutton-quizzed-again-over-son-s-house-deposit-20250415-p5lrrg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Federal election 2025 LIVE updates: Dutton’s son joins him on campaign trail again amid housing deposit questions; PM sets sights on third term",
    "publish_date": "Tue, 15 Apr 2025 11:56:10 +1000",
    "category": "finance",
    "authors": [
      "Sarah Mcphee"
    ],
    "text": "In a campaign increasingly dominated by housing, Anthony Albanese has argued his polices will add to property supply while the Coalition’s will only add to home prices.\n\nBoth parties used their campaign launches on Sunday to announce big housing plans. The Coalition will allow first home buyers earning less than $240,000 year to claim up to $12,000 a year in mortgage interest off their tax for five years.\n\nThe government has promised to effectively act as a guarantor for first home buyers so they will only require a 5 per cent deposit on a loan. It is also planning a $10 billion injection of grants and equity into schemes to build 100,000 homes for first time buyers over the next 8 years.\n\nEconomists have criticised both sides, arguing they will add to price house growth.\n\nBut Albanese said since coming to office the government had pursued policies aimed at lifting the number of homes built across the country, accusing the Coalition and Greens of actively blocking them.\n\nHe accused economic critics of not looking at the government’s policies.\n\n“Some of the things that they’ve spoken about don’t match what we’re actually doing,” he said.\n\n“The key difference between the two approaches is supply. We have a supply side answer on public housing through the Housing Australia Future Fund. On private rentals through the build-to-rent scheme. On home building and construction for first home buyers.\n\n“If you just have demand side measures, which is what they [the Coalition] have, then you put upward pressure on prices.”",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/sport/rory-mcilroy-the-baseball-superstar-and-the-inside-story-behind-this-moment-20250415-p5lruh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rory McIlroy, the baseball superstar and the inside story behind this moment",
    "publish_date": "Tue, 15 Apr 2025 11:55:12 +1000",
    "category": "sports",
    "authors": [
      "Iain Payten"
    ],
    "text": "It will go down as one of the most iconic images in Masters history. An emotional Rory McIlroy on his knees at the 18th, sobbing with relief after winning a playoff and ending the torment of decades of near-misses and despair.\n\nBut this photograph also has a hidden layer of sporting fame. It was taken by a Hall of Fame baseballer.\n\nRory McIlroy on the 18th green after winning the Masters. Credit: Augusta National/Ken Griffey Jr/Getty Images\n\nKen Griffey Jr. is a former American outfielder who played in Major League Baseball for over two decades, and he was no slouch. Playing for the Seattle Mariners, Cincinnati Reds and Chicago White Sox, Griffey was a 13-time All-Star and sits at seventh on the list of most home runs, with 630.\n\nBut since retiring in 2010, Griffey has also become an enthusiastic sports photographer and he was invited to shoot the Masters last week, for the tournament website Masters.com.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/back-off-boomer-you-didn-t-have-to-go-bush-to-buy-a-house-20250415-p5lrtz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Back off Boomer! You didn’t have to go bush to buy a house",
    "publish_date": "Tue, 15 Apr 2025 11:53:37 +1000",
    "category": "finance",
    "authors": [
      "Meg Kanofski"
    ],
    "text": "Like many Gen Zs, I’ve come to terms with the fact I will never be able to give my hypothetical future children the opportunities I was afforded: opportunities like their own bedrooms.\n\nYoung Sydneysiders are frequently told there are homes available, we’re simply too precious to move further away to get them. As an only child, “spoilt princess” allegations are nothing new, but I won’t accept them staining the record of our generation. Here’s the truth defence.\n\nIllustration by Andrew Dyson Credit:\n\nThe average Australian loan size of about $660,000 has been thrown around a lot this election season. Let’s do a quick search for houses listed for under $700,000 in Greater Sydney (that surely won’t sell for a penny under $800,000 at auction). Hurrah, maybe the Boomers have got it right after all. Cancel the Netflix subscription and get saving because results are popping up.\n\nMany of them are in the foothills of the Blue Mountains. I can sense the charge of “indulged” on the tip of your tongue, but hold on. This isn’t about refusing to leave the inner-city suburb with the best iced strawberry matcha. For someone who works in-office at least four days a week – with no option of paying for parking without taking out … a mortgage – it’s a mega-commute.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/culture/art-and-design/faces-can-be-trains-buses-mountains-this-unique-artist-might-turn-your-world-on-its-head-20250414-p5lrkv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Faces can be trains, buses, mountains’: This unique artist might turn your world on its head",
    "publish_date": "Tue, 15 Apr 2025 11:45:40 +1000",
    "category": "entertainment",
    "authors": [
      "Matthew Westwood"
    ],
    "text": "Thom Roberts is in his element as he weaves through the crowd, greeting friends and well-wishers with a hug, a tap on their head or by gently placing two fingers across their brow. It is the opening night of The Immersive World of Thom Roberts at the National Portrait Gallery in Canberra.\n\n“Faces can be trains, buses, mountains, the stone rock and the same the other way around”: Thom Roberts Credit: Martin Ollman\n\nWith 100 works from across the past decade of Roberts’ professional art-making career, the exhibition is a substantial solo show for an artist with lived experience of intellectual disability. Roberts, 49, can be shy and a little reserved, but tonight he is exuberant.\n\nGovernor-General Sam Mostyn is here to officially open the show. Roberts has dubbed her “the Excellent Antonio”, and she gets a tap on the head, too. Later, when the crowd cheers its approval at Roberts, he raises both arms above his head in a show of victory.\n\nThe exhibition brings together Roberts’ paintings and works on paper, painted sculptures, installations and animations. The subjects are people but also trains, skyscrapers, fast-food motifs and Muppets.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/environment/climate-change/how-risk-of-climate-disasters-is-leaving-suburbs-looking-like-a-boxer-s-mouth-20250414-p5lrpe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The electorates most exposed to climate risk revealed",
    "publish_date": "Tue, 15 Apr 2025 11:44:00 +1000",
    "category": "finance",
    "authors": [
      "Caitlin Fitzsimmons"
    ],
    "text": "The climate crisis is already here for one in 23 properties in Australia that are at high risk of natural disasters fuelled by global warming.\n\nThe analysis by Climate Valuation on behalf of the Climate Council considered risks of flooding, bushfires, tropical cyclone winds, coastal inundation and extreme wind for 15 million commercial and residential properties.\n\nAcross Australia, 652,424 homes and businesses are at high risk and another 1.55 million are at moderate risk and facing abnormally high insurance costs.\n\nClimate Councillor and economist Nicki Hutley said the main risk was the natural disaster itself, but the second problem was insurance costs. In areas where climate risk was high, insurance companies were charging $20,000-30,000 for premiums or offering a basic package with flood or fire cover excised.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/galvin-set-be-dropped-for-tigers-clash-with-eels-20250415-p5lrse.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Tigers set to drop Galvin, Moses in line to return for Eels on Easter Monday",
    "publish_date": "Tue, 15 Apr 2025 11:40:56 +1000",
    "category": "sports",
    "authors": [
      "Christian Nicolussi",
      "Michael Chammas"
    ],
    "text": "Lachlan Galvin looks set to be axed by the Wests Tigers for their Easter Monday clash against Parramatta.\n\nThe news that the wantaway five-eighth is set to be dropped comes as Parramatta are poised to welcome back halfback Mitchell Moses two weeks earlier than expected, with the Eels playmaker to be named in the squad on Tuesday afternoon.\n\nLachlan Galvin Credit: Getty/NRL Imagery\n\nSources with knowledge of the situation not authorised to speak publicly confirmed Adam Doueihi was in line to wear Galvin’s No.6 jersey against the Eels.\n\nAs for Moses, he hasn’t played for the Eels this year due to a foot injury and wasn’t due to return until round nine. He will be named in the squad on Tuesday afternoon and is firming to take his place in the team against his former club.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/business/markets/australian-sharemarket-set-to-open-higher-20250415-p5lrr9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Australian sharemarket lifts on open, led by energy stocks",
    "publish_date": "Tue, 15 Apr 2025 11:40:28 +1000",
    "category": "finance",
    "authors": [
      "Gemma Grant"
    ],
    "text": "The Australian sharemarket has opened slightly higher on Tuesday following a positive lead from Wall Street overnight after a day of relative calm in US markets.\n\nThe S&P/ASX200 was up 11.5 points, or 0.2 per cent, to 7760.1 points as of 10.38am AEST. The Aussie dollar also strengthened, fetching US63.29¢ shortly after the market opened.\n\nInvestors are struggling to game out the economic spillovers of the trade war given the back-and-forth in negotiations. Credit: Dominic Lorrimer\n\nThe energy sector was among the best performers in morning trade, with Santos lifting 1.7 per cent. Woodside Energy was also in the green, up 0.6 per cent. The results come as petrol prices across most Australian capitals are slated to fall, following the fallout from Donald Trump’s tariff announcements.\n\nThe big four banks were mixed during the morning trade, with Commonwealth Bank – the nation’s biggest lender – up 0.3 per cent. NAB shed 0.4 per cent while ANZ lost 0.3 per cent and Westpac was trading flat.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/who-is-isaac-moses-and-why-does-he-have-so-much-influence-on-the-nrl-20250415-p5lrsv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Who is Isaac Moses and why does he have so much influence on the NRL?",
    "publish_date": "Tue, 15 Apr 2025 11:36:56 +1000",
    "category": "sports",
    "authors": [
      "Adrian Proszenko"
    ],
    "text": "At a time when the influence of NRL player managers is again in the spotlight, there is none more powerful than Isaac Moses.\n\nUpon graduating from Parramatta Marist High School, Moses worked at ANZ Stadium in membership under Todd Greenberg, the future chief executive of the NRL and then Cricket Australia. Moses then moved into player management, initially with other established agents, before branching out on his own.\n\nWhy does Moses wield so much influence?\n\nMoses’ Cove Agency manages some of the NRL’s biggest names, from established stars Mitchell Moses and Luke Brooks to young guns Lachlan Galvin and Blaize Talagi. He also has a slew of head coaches – including Newcastle’s Adam O’Brien, St George Illawarra’s Shane Flanagan, Manly’s Anthony Seibold, New Zealand’s Andrew Webster and North Queensland’s Todd Payten – on his books.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/victoria/review-calls-for-dismissal-of-exam-authority-board-following-vce-bungle-20250415-p5lrts.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Review calls for dismissal of exam authority board following VCE bungle",
    "publish_date": "Tue, 15 Apr 2025 11:36:07 +1000",
    "category": "finance",
    "authors": [
      "Alex Crowe",
      "Rachel Eddie"
    ],
    "text": "A review of last year’s VCE exam bungle has revealed systemic shortfalls in the management of Victoria’s curriculum authority and recommended the dismissal of its board to avoid a repeat of the scandal, which advantaged thousands of students over their peers.\n\nThe report published on Tuesday found sample cover pages containing exam content had been viewed about 6000 times.\n\nEducation Minister Ben Carroll ordered the review of the scandal after questions on 65 VCE exams were leaked. Credit: Chris Hopkins\n\nSome students saved the sample cover pages directly to their hard drives, internet forum activity revealed, but the review was unable to determine how many students had done so.\n\nThe report made eight recommendations, including instating a new Victorian Curriculum and Assessment Authority (VCAA) board and creating a more senior executive role to improve accountability.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/basketball/aussie-picked-sixth-in-wnba-draft-20250415-p5lrvp.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie picked sixth in WNBA draft",
    "publish_date": "Tue, 15 Apr 2025 11:34:49 +1000",
    "category": "sports",
    "authors": [],
    "text": "Aussie picked sixth in WNBA draft\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 11
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/experts-stumped-as-wrampling-escapes-20250415-p5lrvl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Experts stumped as Wrampling escapes",
    "publish_date": "Tue, 15 Apr 2025 11:30:16 +1000",
    "category": "finance",
    "authors": [],
    "text": "Experts stumped as Wrampling escapes\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/rugby-union/could-oconnor-take-on-the-lions-20250415-p5lrvm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Could O'Connor take on the Lions?",
    "publish_date": "Tue, 15 Apr 2025 11:29:58 +1000",
    "category": "sports",
    "authors": [],
    "text": "Could O'Connor take on the Lions?\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/politics/well-help-them-with-the-deposit-at-some-stage-dutton-20250415-p5lrvk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'We'll help them with the deposit at some stage': Dutton",
    "publish_date": "Tue, 15 Apr 2025 11:28:51 +1000",
    "category": "finance",
    "authors": [],
    "text": "'We'll help them with the deposit at some stage': Dutton\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/goodfood/recipes/quick-fish-and-cauliflower-skillet-pie-with-horseradish-20250227-p5lfrb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Quick fish and cauliflower skillet pie with horseradish",
    "publish_date": "Tue, 15 Apr 2025 11:26:11 +1000",
    "category": "lifestyle",
    "authors": [
      "Jessica Brook"
    ],
    "text": "Preheat the oven to 200C fan-forced (220C conventional). Melt the butter in a 22cm-diameter skillet over medium heat. Add the cauliflower, season with salt and pepper, and cook for 4 minutes.\n\nStep 2\n\nDust the fish fillet with flour. Add the fish, tarragon, sour cream, cream and horseradish to the skillet and season with salt and pepper. Lay the pastry strips across the skillet, overlapping slightly. Press them over the edges of the skillet and brush the top with extra butter.",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/money/borrowing/spending-super-on-housing-could-ruin-your-retirement-here-s-a-better-idea-20250415-p5lrti.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Spending super on housing could ruin your retirement. Here’s a better idea",
    "publish_date": "Tue, 15 Apr 2025 11:24:24 +1000",
    "category": "finance",
    "authors": [
      "Grace Bacon"
    ],
    "text": "Should I raid my super to buy a home? It’s the question more young Australians are asking, as the great Australian dream of homeownership that their parents and grandparents enjoyed moves further out of their reach.\n\nAt an age where they’d traditionally be looking to buy, many in their 20s and 30s are disillusioned by the unattainable property prices, high interest rates, stagnating wage growth and continuing cost of living pressures that put a dampener on their homeownership goals.\n\nTreating super as a piggy bank risks undermining the very reason our superannuation system was established. Credit: AFR\n\nWith politicians of both sides of the aisle searching for viable solutions, the debate continues over whether it’s wise to allow young Australians to access superannuation to buy their first home.\n\nGenerally, securing a home loan means providing a 20 per cent deposit, which can equate to upwards of $200,000 in major metropolitan areas. That’s a significant amount to save at a time of life when you may be juggling student debt, rent, childcare and early career responsibilities.",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/the-vampire-diaries-stars-arielle-kebbel-and-zach-roerig-confirm-romance-20250415-p5lrv7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The Vampire Diaries stars Arielle Kebbel and Zach Roerig confirm romance",
    "publish_date": "Tue, 15 Apr 2025 11:09:25 +1000",
    "category": "finance",
    "authors": [],
    "text": "The Vampire Diaries stars Arielle Kebbel and Zach Roerig confirm romance\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 35
  },
  {
    "url": "https://www.theage.com.au/money/investing/bold-and-chunky-80s-knits-are-back-in-fashion-if-you-can-afford-them-20250415-p5lrtd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Bold and chunky, 80s knits are back in fashion (if you can afford them)",
    "publish_date": "Tue, 15 Apr 2025 11:00:24 +1000",
    "category": "finance",
    "authors": [
      "Stephen Crafti"
    ],
    "text": "Knitwear reached its zenith in the 1980s, with bold graphics and oversized silhouettes ruling the roost. From knitted coats to long tube skirts (knitted as one piece), these 1980s designs weren’t complete without large shoulder pads a gridiron player would be proud to wear.\n\nThis writer produced knitwear in the 1980s, oversized, unisex and often Japanese-inspired. While one can’t simply relive that fashion period, there have been rumblings of its return for the last few years.\n\nJenny Kee’s Blinky Jumper, famously worn by Princess Diana in the 80s.\n\nPiero Gesualdi was at the epicentre of 1980s fashion with his boutiques in both Melbourne and in Sydney. Knitwear featured strongly throughout the decade, starting with discovering John Ashpool’s collections in the late 1970s, with Jean Paul Gaultier and Claude Montana making a statement from the early 1980s.\n\n“The prices were high even at that time, starting at $500 and heading north to $2,000, a figure that would equate to up to $12,000 in today’s value,” says Gesualdi, who was the first retailer to carry the Crafti label, with a respectable price tag of $240.",
    "source": "TheAge",
    "cluster_id": 36
  },
  {
    "url": "https://www.theage.com.au/politics/pm-deflects-question-on-converting-golf-courses-into-homes-20250415-p5lruy.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "PM deflects question on converting golf courses into homes",
    "publish_date": "Tue, 15 Apr 2025 10:52:42 +1000",
    "category": "sports",
    "authors": [],
    "text": "PM deflects question on converting golf courses into homes\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 37
  },
  {
    "url": "https://au.news.yahoo.com/aussie-mums-scary-insurance-dilemma-after-double-disaster-nowhere-is-untouched-211344961.html",
    "title": "Aussie mum's scary insurance dilemma after double disaster: 'Nowhere is untouched'",
    "publish_date": "2025-04-14T21:13:44Z",
    "category": "finance",
    "authors": [],
    "text": "Chay Khamsone, who has faced two extreme weather disasters in five years, is one of millions struggling to find affordable insurance.\n\nNSW mum Chay Khamsone (left) has faced two extreme weather disasters in five years, and isn't sure she wants her kids to follow her into the volunteer fire service. Source: Supplied\n\nAn Aussie mum-of-two whose family has faced two extreme weather disasters in five years is struggling to find affordable insurance for her home. But 44-year-old Chay Khamsone is far from being alone — her town on the NSW Mid North Coast is one of dozens facing unacceptable danger, according to new analysis by the Climate Council.\n\nLooking nationally, more than 2 million properties are now difficult to insure. Over 652,000 (4.4 per cent) are considered at high risk of extreme weather events, and 1.55 million properties (10.4 per cent) are at moderate risk.\n\nChay lives an hour away from Port Macquarie in the tiny town of Pappinbarra, which was hit by bushfires in 2019 and then floods in 2021.\n\n\"We're really in the thick of this climate whiplash feeling. And I know communities across Australia are experiencing this now too, so it feels like nowhere is untouched,\" she told Yahoo News. \"It's just really disruptive and really expensive. Our local council is still cleaning up from the 2021 floods.\"\n\nADVERTISEMENT\n\nChay doesn’t want to move, and she’d like her kids to stay in the area too. But she’s not sure she’d like them to follow her footsteps as a firefighter. It's a common concern many volunteers face as they weigh up the risk to their kids against keeping the community protected by the next generation of firefighters.\n\n“My kids have expressed interest in joining the bushfire brigade. I'm really proud of them wanting to do that, but I also would feel worried that we're sending them into unfightable fires in the future,” Chay said.\n\nChay defended properties in the area during the 2019/2020 Black Summer bushfires (left), but she worries blazes are getting too difficult for her kids (left) and the next generation to fight. Source: Supplied\n\nClimate change at 'doorstep' of everyday Aussies\n\nThe Climate Council’s new At the Front Door report categorised 86 suburbs as “critical climate risk zones”, where 80 to 100 per cent of properties are classified as high-risk. The non-profit has also updated its data suburb analysis tool with information from Climate Valuation, a company that assesses how climate change affects the risk to property.\n\nADVERTISEMENT\n\nFor a long time, global warming has been a conceptual idea for most people, but the Climate Council’s chief economist Nicki Hutley said the report highlights that it's now \"literally at the doorstep of Australian households”.\n\n“We keep getting hit by disasters in Australia and that’s driving insurance bills through the roof, but we cannot insure our way out of this crisis,” she said.\n\nKarl Mallon is an insurance industry expert and the founder of Climate Valuation. Given the immediacy of the problem, he’s called on governments to provide communities with a clear understanding of how they plan to keep them safe and mitigate the impacts of natural disasters.\n\n“Our data draws on 15 million commercial and residential properties in over 15,000 Australian suburbs and 150 electorates. The numbers show us that climate change is not a far-off future event: it threatens entire communities today,” he said.\n\nThese are just some of the regions facing a high risk of climate-related disaster. Source: Climate Council\n\nAussie mum's climate change plea\n\nAccording to the Bureau of Meteorology, Australian temperatures have risen by more than 1.5 degrees between 1910 to 2023. The problem is only expected to get worse because pollution from the burning of fossil fuels is continuing to increase, and this leads to more frequent and severe extreme weather events.\n\nADVERTISEMENT\n\nFor Chay, her focus is on the upcoming election and what stance political parties are taking on protecting communities and families from the threat of climate change. \"As a firefighter, I would feel like Australians have my back if they vote for a safer climate,” she said.\n\n“[Climate change] has dropped off the agenda a bit, but I’d love for them to keep talking about it. Because we trust what the scientists are saying. They are cautious people, but they need regular people to be banging on about it.”\n\nLove Australia's weird and wonderful environment? 🐊🦘😳 Get our new newsletter showcasing the week’s best stories.",
    "source": "Yahoo",
    "cluster_id": 52
  },
  {
    "url": "https://au.news.yahoo.com/warning-to-aussies-after-driver-landed-with-1200-shock-bill-rise-in-cost-080921112.html",
    "title": "Warning to Aussies after driver landed with $1,200 'shock' bill: 'Rise in cost'",
    "publish_date": "2025-04-14T08:09:21Z",
    "category": "finance",
    "authors": [],
    "text": "Holly Petricevich was shocked to pay $1,199 for her car service at the MG Wangara service centre. Source: Supplied & TikTok/hollypetricevich0\n\nA driver who alleges she was duped after paying $1,199 for a recent car service is the latest Aussie to grow suspicious of high repair and maintenance fees associated with car ownership.\n\nHolly Petricevich told Yahoo News she dropped her 2022 MG HS off for its standard 60,000 kilometre service at the MG dealer in Wangara in Perth's north on April 3. She was under the impression it would cost her roughly $500 and she would be notified if any additional work was needed.\n\nHowever, when she arrived back to collect her car, she was instructed to pay $1,199. The dealership has since claimed to Yahoo that was the amount she was quoted.\n\n\"They said they'd call me if they needed to do anything different, which I was fine with. But then they were like, oh, that'll be $1,199 please. They said they had to do a little bit to the car but they never consulted me,\" Holly claimed. \"I was shocked, and I was a bit upset actually.\"\n\nADVERTISEMENT\n\nAfter questioning why the service was costing so much, the worker allegedly explained to Holly the service \"was a big one\" and included making changes to the spark plugs and transmission fluid.\n\n\"I just thought, oh gosh, what if I didn't have the money? I think it's important to let customers know so they can say yes or no to these things being done to their car,\" she said.\n\nDriver questions car service price\n\nMG Wangara provided Holly with a detailed breakdown of the service cost which included $496.49 for parts, $51.60 for petrol, oil and lubricant supplies (POL), $18.01 for miscellaneous, $109 for tax and $523.90 for labour.\n\nHolly explained she was happy to pay the necessary amount for a thorough service but is sceptical about taking her car there again as she felt the cost was much higher than she first expected. \"For my next service I'll be taking my car somewhere else,\" she said.\n\nThe MG service centre provided a detailed list of Holly's cost. Source: Supplied\n\nADVERTISEMENT\n\nYahoo News enquired about the price of a 60,000 kilometres service for the same car at the MG service centre on April 10 and was quoted at $1,015 — $194 cheaper than what Holly paid one week earlier. When the price discrepancy was queried, a worker at the service centre said he \"just bashed the numbers in the computer\" and $1,015 is what appeared on his screen.\n\nThe worker claimed Holly was quoted $1,199 prior to her service. However, in response, Holly told Yahoo \"they absolutely did not\".\n\n\"I never got quoted hence why I was so shocked... They also were meant to return my call four times and never once did, I think that speaks volumes,\" she alleged.\n\nHolly was concerned she had been taken advantage of by the mechanics. Source: TikTok/hollypetricevich0\n\nDrivers warned over 'rise in labour and parts costs' for cars\n\nHenry Man, from Compare the Market, confirmed drivers should always be updated when changes need to be made to a car and given an outline of what the subsequent cost will be.\n\nADVERTISEMENT\n\n\"Before the dealer even touches your car, you should know the price. They should quote the price for you and outline how much it will cost and consent before they even get the keys to your car,\" he said.\n\nWhile he couldn't speak to Holly's specific situation, he did warn that the price of car services have increased in recent years and drivers should ready themselves to dig deeper into their pockets.\n\n\"In recent times, we've seen a rise in the cost of labour and parts, plus the inclusion of more advanced technologies in some new models,\" he told Yahoo.\n\nThis has had a knock-on effect to driver behaviour, with recent Compare the Market research finding that one quarter of Aussies admit to servicing their car less due to cost-of-living pressures.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 53
  }
]