[
  {
    "url": "https://www.9news.com.au/world/us-seeks-to-impose-3500-per-cent-tariffs-on-solar-panels-from-southeast-asia/757a2cee-b26f-4e69-88b7-f911c2426b04",
    "title": "US imposes staggering new tax on planet-saving technology",
    "publish_date": "Wed, 23 Apr 2025 01:41:11 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "U﻿S trade officials have unveiled plans to impose tariffs of up to 3500 per cent on solar panels from some South-East Asian countries.\n\nIt marks a key step towards wrapping up a year-old trade case in which American manufacturers accused Chinese companies of flooding the market with unfairly cheap goods, CNN reports.\n\nThe case was brought last year by Korea's Hanwha Qcells, Arizona-based First Solar Inc and several smaller producers seeking to protect billions of dollars in investments in US solar manufacturing.\n\nUS manufacturers of solar panels have accused Chinese competitors of flooding the market with unfairly cheap goods. (Chinatopix via AP) (AP)\n\nThe petitioner group, the American Alliance for Solar Manufacturing Trade Committee, accused big Chinese solar panel makers with factories in Malaysia, Cambodia, Thailand and Vietnam of shipping panels priced below their cost of production and of receiving unfair subsidies that make US goods uncompetitive.\n\nFor the tariffs to be finalised, the International Trade Commission must vote in June on whether the industry was materially harmed by the dumped and subsidised imports.\n\nThe tariffs unveiled on Monday vary widely depending on the company and country but are broadly higher than the preliminary duties announced late last year.\n\nCombined dumping and countervailing duties on Jinko Solar products from Malaysia were among the lowest at 41.56 per cent. Rival Trina Solar's products from its operations in Thailand face tariffs of 375.19 per cent.\n\nNeither Jinko nor Trina were immediately available for comment.\n\nThe US solar panel market is worth more than $US10 billion. (AP Photo/File) (AP)\n\nProducts from Cambodia would face duties of more than 3500 per cent because its producers elected not to co-operate with the US probe.\n\n\"These are very strong results,\" said Tim Brightbill, a lawyer for the US manufacturing group.\n\n\"We are confident that they will address the unfair trade practices of the Chinese-owned companies in these four countries, which have been injuring the US solar manufacturing industry for far too long.\"\n\nThe threat of tariffs on countries that supplied more than $US10 billion ($16 billion) of solar products to the US last year, accounting for the vast majority of domestic supplies, has caused a dramatic shift in the global solar trade.",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/donald-trump-says-he-will-substantially-lower-tariffs-on-china/7d5c510f-d66d-44a2-b2ab-46fcb50873ab",
    "title": "Trump backs down on China tariffs",
    "publish_date": "Tue, 22 Apr 2025 23:16:26 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "President Donald Trump says the US will not play \"hardball\" with China, telling reporters in the White House that tariffs on China will ultimately not be \"anywhere near\" the current 145 per cent.\n\nDuring comments in the Oval Office on Tuesday (Wednesday AEST), Trump insisted the tariffs on Chinese imports would be reduced \"substantially\".\n\nAsked if the US was going to play hardball with China in order to make a deal, or if officials would mention the COVID-19 pandemic, Trump quickly responded: \"No.\"﻿\n\nUS President Donald Trump said his administration won't be playing \"hardball\" with China on Tuesday, April 22, 2025, in Washington. (AP Photo/Alex Brandon) (AP)\n\n\"I'm not going to mention COVID. I'm not going to say: 'Oh, I'm going to play hardball with China. I'm going to play hardball with you, President Xi,'\" Trump said.\n\n\"No, no, we're going to be very nice. They're going to be very nice, and we'll see what happens,\" the president said.\n\n\"But ultimately, they have to make a deal, because otherwise they're not going to be able to deal in the United States, and we want them involved.\"\n\nSpeaking on the additional tariffs he slapped on China, Trump said that 145 per cent was \"very high\" and that \"it won't be that high.\"\n\n\"It won't be anywhere near that high. It'll come down substantially, but it won't be zero,\" Trump said. \"Used to be zero.\"\n\nTrump said tariffs on Chinese imports to the US would be reduced \"substantially\". (AP)\n\nThe president later reiterated he thought the US would make a deal with China.\n\n\"I think we're going to live together very happily and ideally work together, so I think it's going to work out very well,\" he said.\n\nTrump also said he had \"no intention of firing\" Federal Reserve Bank chair Jerome Powell.\n\n\"I don't want to talk about that, because I have no intention of firing him.\n\nTrump-backing billionaires poised to lose nearly a trillion dollars in two days View Gallery\n\n\"I would like to see him be more active in terms of his idea to lower interest rates. It's a perfect time to lower interest rates.\"\n\nTrump has attacked the Federal Reserve chair several times in recent days, calling on him to lower interest rates as economic uncertainty over tariffs has rattled the markets.\n\nHe has previously suggested that he does have the power to fire the independent Federal Reserve chair, whose term doesn't expire until 2026.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/world/world-news-tesla-profit-results-have-plunged-as-elon-musk-blamed-over-role-in-donald-trump-administration/7d9df6bd-cefe-4204-a208-e7ffbe9cc92a",
    "title": "Panic at Tesla as profits go into freefall",
    "publish_date": "Tue, 22 Apr 2025 22:26:19 +0000",
    "category": "finance",
    "authors": [
      "Apr"
    ],
    "text": "Elon Musk says he will dedicate more time to Tesla starting in May after the company reported a big drop in first-quarter profit, and faces ongoing backlash and protests over his leadership of a federal government jobs-cutting group that has divided the country.\n\nThe Austin, Texas, company said on Tuesday (Wednesday AEDT) that quarterly profits fell by 71 per cent to to $US409 million ($642 million), or 12 cents a share. That’s far below analyst estimates.\n\nTesla ’s revenue fell 9 per cent to $US19.3 billion in the January through March period, below Wall Street’s forecast.\n\nElon Musk's controversial role inside the White House is being blamed for Tesla's woes. (AP)\n\nThe disappointing results come as the company struggles to sell cars to consumers who are angry over Musk's role in the Trump administration. Musk also has publicly supported far-right politicians in Europe and alienated potential buyers there, too.\n\nSome Tesla investors have complained that Musk has been too distracted by his role at the Department of Government Efficiency, or DOGE, to effectively run Tesla.\n\n\"This is a big step in the right direction,\" said Wedbush Securities' Dan Ives, referring to Musk's time commitment. \"Investors wanted to see him recommit to Tesla.\"\n\nTesla' stock has fallen more than 40 per cent this year but rose more than 3 per cent in after-hours trading.\n\nMorningstar analyst Seth Goldstein said earlier reports of plunging sales that had tanked the stock made the results almost predictable.\n\n\"They're not particularly surprising given that deliveries were down,\" Goldstein said, adding that the company is still generating cash. \"It was good to see positive cash flow.\"\n\nThe company generated $US2.2 billion in operating cash versus $US242 million a year earlier.\n\nThere are concerns inside Tesla about Musk and whether he is equipped to continue leading the company. (Bloomberg)\n\nTesla investors will be listening closely for updates on several strategic initiatives. The company is expected to roll out a cheaper version of its best-selling vehicle, the Model Y SUV later in the year. Tesla has also said it plans to start a paid driverless robotaxi service in Austin, Texas, in June.\n\nIts closely watched gross margins, a measure of earnings for each dollar of revenue, fell to 16.3 per cent from 17.4 per cent.\n\nThe company that once dominated EVs is also facing fierce competition for the first time.\n\nEarlier this year, Chinese EV maker BYD announced it had developed an electric battery charging system that can fully power up a vehicle within minutes. And Tesla's European rivals have begun offering new models with advanced technology that is making them real alternatives, just as popular opinion in Europe has turned against Musk.\n\nInvestors expect Tesla will be hurt less by the Trump administration's tariffs than most US car companies because it makes most of its US cars domestically. But Tesla won't be completely unscathed. It sources some materials for its vehicles from abroad that will now face import taxes.\n\nTesla warned that tariffs will hit its energy storage business, too.\n\nDemonstrators protest against Elon Musk and Department of Government Efficiency cuts outside a Tesla dealership in Kansas City. (AP)\n\n\"While the current tariff landscape will have a relatively larger impact on our energy business compared to automotive,\" the company said, \"we are taking actions to stabilise the business in the medium to long-term and focus on maintaining its health.\"\n\nRetaliation from China will also hurt Tesla. The company was forced earlier this month to stop taking orders from mainland customers for two models, its Model S and Model X. It makes the Model Y and Model 3 for the Chinese market at its factory in Shanghai.\n\nThe company side business of selling \"regulatory credits\" to other car makers that fall short of emission standards boosted results for the quarter.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/how-the-pope-spent-his-final-hours-and-his-last-words-of-thanks-to-nurse-revealed/feb7c72f-f4b1-48b2-a0ee-084bb3440e79",
    "title": "How the Pope spent his final hours and his last touching words to nurse",
    "publish_date": "Tue, 22 Apr 2025 22:50:36 +0000",
    "category": "entertainment",
    "authors": [
      "Apr"
    ],
    "text": "In his final hours, the late Pope Francis expressed his heartfelt thanks to the personal nurse who cared for him around the clock during his illness.\n\nAmong the Argentine pontiff's final words was a conversation with his personal healthcare assistant, Massimiliano Strappetti, with Pope Francis thanking him for enabling him to take one last ride in the popemobile and greet the throngs of people in St Peter's Square on Easter, a day before he died , the Vatican News reports.\n\n\"Thank you for bringing me back to the Square,\" the Pope was reported to have said to Strappetti.\n\nREAD MORE: Pope Francis was a source of controversy and spiritual guidance in his Argentine homeland\n\nPope Francis tours St Peter's Square in his popemobile with his nurse by his side. (AP)\n\nPope Francis initially had some doubts about whether he would be able to get to the square, having been hospitalised recently for five weeks with pneumonia.\n\n\"Do you think I can manage it?'' the pope asked Strappetti, his personal health care assistant, according to the Vatican News .\n\nThe pope was reassured, and he stopped to reach out to people, especially children, as he was driven through the crowd of 50,000 — the first time since his release from the hospital that he had mixed with the faithful at large.\n\nThe life of Pope Francis View Gallery\n\nThe Pope then rested on Sunday afternoon and had a quiet dinner.\n\nThe pontiff showed the first signs of illness around 5.30am the next day.\n\nAround an hour later, he made a gesture of farewell with his hand to Strappetti.\n\nAs he lay in bed in his second-floor apartment at the Casa Santa Marta, the Pope fell into a coma and died shortly after, aged 88.\n\nStrappetti had stayed by the Pope's side during his 38-day hospital stay at Rome's Gemelli Hospital, and oversaw his recovery at the Casa Santa Marta.\n\nMassimiliano Strappetti watches Pope Francis walking during a general audience in August 2022. (AP)\n\nPope Francis has previously credited Strappetti with saving his life after the nurse suggested he undergo colon surgery.\n\nStrappetti was appointed by the Pope as his personal healthcare assistant in 2022.\n\nFuneral set for Saturday\n\nFrancis' funeral will be held Saturday at 10am (6pm AEST) in St Peter's Square, celebrated by the dean of the College of Cardinals, Cardinal Giovanni Battista Re.\n\nUS President Donald Trump said he and first lady Melania Trump plan to attend, and Argentine President Javier Milei is also expected.\n\nHe will lie in state starting Wednesday in St. Peter's Basilica, where the faithful are expected to flock to pay their respects to history's first Latin American pontiff.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/world/cardinals-meet-at-vatican-to-choose-date-for-pope-francis-funeral/04c698c3-30ac-44b9-9258-6e3eb884573b",
    "title": "The Vatican releases first images of Pope Francis in open casket",
    "publish_date": "Tue, 22 Apr 2025 08:02:06 +0000",
    "category": "lifestyle",
    "authors": [
      "Apr"
    ],
    "text": "The Vatican has released the first images of Pope Francis , showing him in his casket with the Vatican secretary of state praying over him.\n\nCardinals gathered on Tuesday (local time) at the Vatican to begin scheduling Pope Francis' funeral and burial, planning the conclave to elect his successor and making other decisions about running the Catholic Church as world leaders and ordinary faithful grieved the death of history's first Latin American pope.\n\nMost immediately, they will determine when his body can be moved into St Peter's Basilica for public viewing.\n\nPope Francis's body is laid out in state inside his private chapel at the Vatican, Monday, April 21, 2025. (AP)\n\nThe first images of Francis show him in the wooden casket, in red vestments and his bishop's miter, with the Vatican secretary of state praying over him in the chapel of the Domus Santa Marta hotel where he lived.\n\nFrancis died on Monday at age 88 after suffering a stroke that put him in a coma and led his heart to fail.\n\nHe had been recovering in his apartment after being hospitalised for five weeks with pneumonia .\n\nHe made his last public appearance on Sunday, delivering an Easter blessing and making what would be his final greeting to followers from his popemobile, looping around St Peter's Square.\n\nPope Francis's body is laid out in state inside his private chapel at the Vatican, Monday, April 21, 2025. From left front row, Secretary of State Pietro Parolin, Dean Cardinal Giovanni Battista Re, unidentified person, Master of Ceremonies Archbishop Diego Giovanni Ravelli, Cardinal Camerlengo Kevin Joseph Farrell, and Master of Ceremonies Lubomir Welnitz. (Vatican Media via AP, HO) (AP)\n\nIn retrospect, his Easter appearance from the same loggia where he was introduced to the world as the first Latin American pope on March 13, 2013, was a perfect bookend to a 12-year papacy that sought to shake up the church and return it to its Gospel-mandated mission of caring for the poorest.\n\nThe Vatican announced that the first meeting of the Congregation of Cardinals, the gathering of the cardinals currently in Rome, would begin on Tuesday at 9am in the Vatican's synod hall.\n\nThey could decide to allow public viewing of Francis as soon as Wednesday morning in St Peter's Basilica.\n\nDevotees carry a cutout of the late Pope Francis during a procession ahead of a prayer in Dili, East Timor, Tuesday, April 22, 2025. (AP Photo/Lorenio L.Pereira) (AP)\n\nFaithful attend a Rosary in homage to Pope Francis following his death in Saint Peter's Square, on April 21, 2025 in Vatican City, Vatican. The Vatican announced that Pope Francis, 88, died on Monday at 07:35 local time (05:35 GMT) and \"the Bishop of Rome, Francis, returned to the home of the Father\". His death comes after he appeared in St Peter's Square on Easter Sunday, greeting thousands of worshippers. (Photo by Antonio Masiello/Getty Images) (Getty)\n\nUnder norms approved by Francis last year, the funeral and burial must occur between Friday and Sunday.\n\nIn his final will, Francis confirmed he would be buried at St Mary Major basilica, which is outside the Vatican and home to his favorite icon of the Virgin Mary.\n\nAfter every foreign trip, Francis would go to the basilica to pray before the Byzantine-style painting that features an image of Mary, draped in a blue robe, holding the infant Jesus, who in turn holds a jeweled golden book.\n\nFrancis stopped by the basilica on his way home from the Gemelli hospital on March 23, after his 38-day hospital stay, to deliver flowers to be placed before the icon.\n\nHe returned April 12 to pray before the Madonna for the last time.\n\nThe world reacts\n\nBells tolled in chapels, churches and cathedrals around the world and flags flew at half staff in Italy, India, Taiwan and the US after Francis' death was announced by the Vatican camerlengo.\n\nSoccer matches in Italy and Argentina were suspended in honour of the Argentine pope who was a lifelong fan of the San Lorenzo soccer club.\n\nWorld leaders praised Francis for his moral leadership and compassion, while ordinary faithful remembered his simplicity and humanity.\n\nWho are the contenders to be the next pope? View Gallery\n\n“Like every Argentine, I think he was a rebel,” said 23-year-old Catalina Favaro, who had come to pay her respects in the Buenos Aires church where Francis discovered his priestly vocation. “He may have been contradictory, but that was nice, too.”\n\nIn East Timor, where Francis’ final outdoor Mass drew nearly half of the population last September, President Jose Ramos-Horta praised Francis’ courage.\n\n“Papa Francisco was a brave man who was not afraid to speak out against the rulers of the world who seek war, but do not want to seek peace,” Ramos-Horta said.\n\n“He challenged the powerful to act with justice, called nations to welcome the stranger, and reminded us that our common home — this Earth — is a gift we must protect for future generations,” said Nigeria’s President Bola Tinubu, who is Muslim. Nigeria is Africa’s most populous country and has around 30 million Catholics, representing about 14 per cent of the total population.\n\nViewing the pope's coffin\n\nThe pope's formal apartments in the Apostolic Palace were sealed on Monday evening, following a centuries-old ritual. Cardinal Kevin Farrell, who as camerlengo had the task of announcing the death and confirming it once the cause was determined, presided over the ritual.\n\nFrancis chose not to live in the palace, though, but in the Domus Santa Marta hotel on the other side of Vatican City. He died there and his body was transferred to the hotel chapel in the lobby, where a private viewing was being held on Tuesday for Vatican officials and members of the pontifical household.\n\nVatican Secretary of State Cardinal Pietro Parolin, left, prays in front of the body of Pope Francis laid out in state inside his private chapel at the Vatican, Monday, April 21, 2025. (Vatican Media via AP, HO) (AP)\n\nIn changes made by Francis last year, his body was not placed in three wooden coffins, as it had been for previous popes. Rather, Francis was placed in a simplified wooden coffin with a zinc coffin inside.\n\nOnce in St Peter's, his coffin will not be put on an elevated bier, but will just be be placed simply facing the pews, with the Pasqual candle nearby.\n\nFuneral and burial\n\nThe burial must take place between the fourth and sixth day after his death, meaning a likely date is Saturday or Sunday.\n\nUS President Donald Trump has announced he and first lady Melania Trump plan to attend.\n\nArgentine President Javier Milei is also expected.\n\nBarack Obama meeting Pope Francis. (Twitter)\n\nThe funeral will be presided over by the dean of the College of Cardinals or, if that is not possible, by the vice dean or another senior cardinal. The current dean is Italian Cardinal Giovanni Battista Re, 91. The vice dean is Argentine Cardinal Leonardo Sandri, 81.\n\nRe and Farrell, the camerlengo, will have key roles in the coming days as they summon the cardinals and prepare for the conclave to elect Francis' successor.\n\nChoosing the next pope\n\nAfter the funeral, there are nine days of official mourning, known as the “novendiali\".\n\nDuring this period, cardinals arrive in Rome to participate in meetings before the conclave to elect the next pope.\n\nTo give everyone time to assemble, the conclave must begin 15-20 days after the “sede vacante” — the “vacant See” — is declared, although it can start sooner if the cardinals agree.\n\nOnce the conclave begins, cardinals vote in secret sessions. After voting sessions, the ballots are burned in a special stove. Black smoke indicates that no pope has been elected, while white smoke indicates that the cardinals have chosen the next head of the Catholic Church.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/pope-francis-death-worldwide-mourning-rites-and-rituals-begin-following-the-death-of-pope-francis/9ffbd6e8-682f-4983-9e48-aa49a6eca4ef",
    "title": "Crowds gather for procession of Pope's body",
    "publish_date": "Wed, 23 Apr 2025 01:52:09 +0000",
    "category": "lifestyle",
    "authors": [
      "April"
    ],
    "text": "1 of 69 Attribution: Graphic: Polly Hanning\n\nThe world has reacted quickly to the news of the death of Pope Francis at age 88 on Easter Monday.\n\nWithin hours of hearing of his passing, mourners flocked to churches to pay their respects to the leader.\n\nThe death of a pope sets in motion a series of carefully orchestrated rites and rituals well before the conclave to elect his successor begins.﻿\n\nThey involve the certification of death and public display of his body for the faithful to pay their respects, followed by the funeral and burial.\n\nSee all the photos here.﻿",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/telecommunications-mobile-coverage-federal-election-promises/105080674",
    "title": "Mobile coverage is an election issue in the regions. What's been promised?",
    "publish_date": "Wed, 23 Apr 2025 01:37:27 +0000",
    "category": "finance",
    "authors": [],
    "text": "Eleven Mile Beach is as dangerous as it is spectacular.\n\nA short drive from Esperance on Western Australia's remote and rugged south coast, the sand dunes are popular among weekend adventurers.\n\nBut veteran paramedic Paul Gaughan has seen things go pear-shaped here far too often.\n\nFederal election 2025 live: Get the latest updates from the campaign trail Catch the latest interviews and in-depth coverage on ABC iview and ABC Listen\n\n\"The beach itself is quite soft,\" the Esperance station manager for St John WA said.\n\n\"It's quite a mission to retrieve people here.\"\n\nIn his line of work, a phone signal can be the difference between life and death.\n\nParamedics like Paul Gaughan remain frustrated by a lack of phone reception in regional and remote areas. (ABC Esperance: Emily Smith)\n\nBut at Eleven Mile, and numerous other local beaches, the lack of reliable connection remains a major frustration.\n\n\"Often there's a delay in people being able to communicate where they are,\" he said.\n\n\"Sometimes they have to try and run to the top of a hill somewhere.\n\n\"Often we have to call for backup, and that can be a difficulty for us as well.\"\n\nReforms promised\n\nIf re-elected, the Albanese government has pledged to legislate universal mobile coverage across Australia.\n\nThe move would require telcos to guarantee basic voice and SMS coverage nationwide.\n\nIt is made possible largely by the advent of low-Earth orbit (LEO) satellites, such as Starlink, and would be implemented by 2027.\n\nThe announcement has been well received by regional stakeholders, including the National Farmers' Federation (NFF).\n\nPrime Minister Anthony Albanese has pledged to legislate universal SMS and voice coverage if re-elected. (Twitter: Anthony Albanese)\n\nHowever, NFF president David Jochinke said investment in the terrestrial network needed to continue.\n\nSatellites to fill mobile dead zones under Labor election pledge Photo shows man with tower in bakground Low-orbit satellites would provide mobile voice and SMS services to vast areas of the country under a pre-election pledge from Labor.\n\n\"Satellite-based connectivity is just one piece of the puzzle, and the need for continued co-investment in mobile towers by telco providers and government isn't going away,\" he said.\n\n\" Land-based coverage from mobile towers will still be the gold standard for years to come. \"\n\nThe Coalition has said a Dutton government would \"improve access to telecommunications and high-speed internet\" for regional Australians, though further details have not been provided.\n\n\"Regional communities deserve the same quality of services as those in the city,\" Shadow Communications Minister Melissa McIntosh said.\n\nShe said the \"bungled\" handling of the 3G network closure had set regional communities back.\n\nThe Albanese government said further reforms would be announced as it \"considered recommendations\" from the 2024 Regional Telecommunications Review.\n\nWhen it comes to telecommunications reforms, those living in some of the most remote corners of the country want to ensure their voices are heard.\n\n'Better off 10 years ago'\n\nKirk Whiting runs a broadacre cropping operation about 100 kilometres west of Esperance.\n\n\"We've got nine staff on this farm and trying to coordinate is a massive, massive job,\" he said.\n\nHe said the farm's mobile coverage was patchy at best.\n\n\"Along the highway it's quite good,\" he said.\n\n\"But as soon as you leave the highway, it's near-on non-existent.\"\n\nKirk Whiting says mobile coverage on his farm has become worse over the years. (ABC Esperance: Emily Smith)\n\nMr Whiting said black spots created challenges for marketing grain and keeping track of staff.\n\nHave Your Say: What matters to you this federal election? Photo shows A graphic showing a range of reader comments about potential issues in Australia's 2025 federal election. What do you need to know before you vote in the upcoming federal election? What would you ask the candidates? Have Your Say.\n\n\"If we miss prices, that can be tens of thousands of dollars … real-time connectivity is very important in this day and age,\" he said.\n\n\"And you've just got to be careful with staff. If you don't hear from someone for a while, you've got to check on them.\"\n\nDespite the advancements in technology, he said the mobile coverage on his farm had regressed over the past decade.\n\nHe said the problem had been compounded by the closure of the 3G network.\n\n\"With the data loads that the towers are taking now, we were definitely better off 10 years ago,\" he said.\n\nMr Whiting says black spots in mobile signal can affect workers' safety. (ABC Esperance: Emily Smith)\n\nThe 2024 Regional Telecommunications Review recommended the government \"prioritise funding to improve existing terrestrial mobile network capacity, service quality, and resilience\".\n\nMr Whiting implored all sides of politics to listen to farmers.\n\n\"Mining booms come and go,\" he said.\n\n\" Farming is here for as long as humans need to eat … governments need to back us and give us the infrastructure we need. \"\n\nLives on the line\n\nA few months ago, a local farmer was holidaying at a remote beach east of Esperance when he suffered a cardiac arrest.\n\nThere was no mobile reception.\n\nSt John WA paramedics hope to see an improvement in mobile phone coverage throughout regional and remote parts of the state. (ABC Esperance: Emily Smith)\n\nThankfully, another camper had access to a private satellite system.\n\n\"They were able to call [emergency services] from there,\" Mr Gaughan said.\n\nBy using a St John WA defibrillator, which was fortuitously located at the beach, family members kept the man alive until an ambulance arrived.\n\n\"That patient survived,\" Mr Gaughan said.\n\n\"I'd hate to think, if they couldn't get through to an ambulance, what the result would have been.\"\n\nLoading\n\nLoading...\n\nHaving trouble seeing this form? Try this link.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/keith-stackpole-australia-test-cricketer-dies-aged-84/105204754",
    "title": "Australian Test cricketer Keith Stackpole dies aged 84",
    "publish_date": "Wed, 23 Apr 2025 01:34:04 +0000",
    "category": "sports",
    "authors": [],
    "text": "Former Australia Test opener Keith Stackpole has died, aged 84, after a dynamic career including seven centuries and a brilliant Ashes double ton.\n\nHis career trajectory mirrored that of modern great Steve Smith, first picked at number eight in the 1965/66 Ashes series on account of his leg spin, before moving up the order three years later.\n\nStackpole played 33 of his 43 Tests at the top of the order, hailed as an aggressive batter to complement the more staid Bill Lawry.\n\nStackpole's stats Tests: 43\n\n43 Runs: 2,807\n\n2,807 100s: 7\n\n7 50s: 14\n\n14 Avg: 37.42\n\nHe finished his Test career in 1974 with 2,807 runs, a top score of 207 amongst seven centuries, and an average of 37.42.\n\n\"Stacky was a great team man,'' former teammate Doug Walters told News Corp.\n\n\"He was also great to watch. The first ball could go out of the ground. He had a particularly good hook shot. He had shots everywhere. He will be missed.''\n\nStackpole's aggressive style also worked well for the shorter form of the game, and he played in the first four one-day international matches ever played, against England in 1971 and 1972.\n\nHe ultimately only played six ODIs in total — scoring three half-centuries — before retiring from the game and moving into commentary roles on TV and radio for the ABC, Nine and Seven.\n\nFellow Victorian Merv Hughes wrote on social media that it was \"very sad news\".\n\n\"Stacky was a fantastic cricketer but more so a great bloke,\" he said.\n\n\"And one hell of a cricket coach — I learnt a hell of a lot from both him and Ian Redpath.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nHe was described as \"a dynamic and influential figure in Australian cricket\" by the sport's national governing body.\n\n\"Keith was one of the great contributors to the game of cricket and his legacy will live long into the future,\" Cricket Australia chair Mike Baird said.\n\n\"Not only was he an outstanding player for Australia and Victoria, his work in the media, radio and TV commentary and as a mentor to many players who followed in his footsteps demonstrated his enduring passion and influence in the game.\n\n\"It is testament to his talent and standing that he was one of the five 'Wisden Cricketers of the Year' in 1973 and was awarded the MBE in 1974 for services to cricket.\n\n\"He will be sadly missed and his wife Pat and their family and many friends are in our thoughts.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/taronga-zoo-sydney-elephants-en-route-to-sa/105205042",
    "title": "After a century in Sydney, Taronga Zoo says goodbye to its elephants",
    "publish_date": "Wed, 23 Apr 2025 01:21:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Taronga Zoo's last elephants have packed their trunks and are ready for a mammoth move.\n\nIt's early morning, and before the zoo gates open to throngs of school holiday visitors, keepers are busy helping Asian elephant Tang Mo get used to the crate that she'll soon be travelling more than 20 hours in to her new home in South Australia.\n\nShe ambles confidently into its narrow confines and happily scoops up trunkfuls of hay.\n\nAsian elephant Tang Mo's new home will be in South Australia. (ABC News: Greg Bigelow)\n\nWith gentle words of encouragement from her keepers, she flips up one giant foot as if for a pedicure, so a safety belt wrapped around her ankle can be attached to the container.\n\nThe other foot soon follows, and she is rewarded with more snacks tossed into her open mouth by the keepers.\n\n\"Snacks are the way to win an elephant's heart,\" senior elephant keeper Johny Wade said.\n\n\"They're very much the key to building a lasting relationship with the elephants,\" Mr Wade said.\n\nEn route to South Australia\n\nBy the end of April, Tang Mo and her companion Pak Boon will be settling in to a new life with a new herd of elephants at the Monarto safari park on the Malee Plains, about an hour's drive east of Adelaide.\n\nMr Wade said the elephants would be accompanied by two support teams who would attend to their every need, and the safety belts would help keep the animals safe during the trip.\n\n\"It basically allows them to brace themselves on the journey, a bit like the handle you have on the bus when standing up,\" Mr Wade said.\n\n\"On the journey we will be checking them regularly, making sure they're doing well.\"\n\nSenior elephant keeper Johny Wade provides snacks and more for the elephants on the move. (ABC News: Greg Bigelow)\n\nThe CEO of the Taronga Conservation Society Cameron Kerr, said the elephants had been a \"beloved\" part of the zoo for many years, but the move was in their best interests.\n\n\"We've always been looking for another big site where we can bring elephants from different groups together to form a new community, because they are very complex social animals,\" he said.\n\n\"They are dearly loved by all our teams and so many of our visitors and zoo friends as well, so it's very sad to see them go. But there's two of them here and we feel there needs to be a bigger social group than that.\"\n\nTaronga Conservation Society CEO Cameron Kerr said the elephants would benefit from a larger social group. (ABC News: Greg Bigelow)\n\nTaronga's first elephant Jessie, arrived in 1916 and transporting the giant creatures has always been a feat of epic proportions.\n\nIn September 1916, Jessie, who had been living in the Zoological Gardens at Moore Park, was walked through the main streets of Sydney and through the Domain in the early hours of the morning on a mission to the harbour.\n\nAsian elephant Jessie with a Taronga elephant keeper in an undated photo from the late 1910s. (Supplied: Taronga Zoo)\n\nAlmost two decades before the Harbour Bridge opened, she crossed the water on a ferry then walked up Taronga's steep hill to her new enclosure — the Elephant Temple which was built in the style of an Indian house of worship.\n\nToday the heritage-listed building serves as a reminder of a very different era where two elephants were chained up in a tiny, dark cavern side by side and brought out for elephant rides and other forms of entertainment.\n\nImages from the 1930s show a crane being used to unload another elephant bound for Taronga, from a steamboat on the harbour.\n\nAsian Elephant Juanita (or Jill) who arrived at Taronga in November 1935 from Rangoon (Yangoon). (Supplied: Taronga Zoo)\n\nWhile their trip to South Australia will be a very long road trip, Mr Kerr said Tang Mo and Pak Boon had previously gained a reputation as jet-setters, having flown in from Thailand in 2006.\n\n\"Just to give you an indication of how smart these elephants are, after the very first take off and landing on Cocos Keeling Island, when they took off again when they heard the engines start up they knew to lean forward — that's incredible.\"\n\nFor all those who have been involved in their care, farewelling the zoo's final pair of elephants will be an emotional moment.\n\n\"We are part of their family, they're part of our family — we call us one big dysfunctional herd of humans and elephants,\" Mr Wade said.\n\n\"So it is going to be bittersweet; we are going to miss them when they go. But ultimately their welfare and their future is key to what we are doing.\"\n\nPack of elephants move to Werribee Photo shows A young elephant It took five days for a team to transport nine Asian elephants across Melbourne to a new home in Werribee.\n\nMr Wade said the elephants' different personalities meant keepers had to use quite different approaches to prepare them for the journey.\n\n\"They are very much chalk and cheese when it comes to personality; one is very food motivated, very stubborn, very strong-willed. The other one is very much about the relationship, she a bit airy-fairy, soft in nature.\"\n\nOnce the elephants have moved, their current habitat at the zoo will get some new tenants — who will have big shoes to fill.\n\nMr Kerr said Hari, the one-horned rhino who was born at Taronga Western Plains Zoo in Dubbo in 2021, would soon take up residence along with some water buffalo.\n\n\"We are calling this the great migration, so it's very exciting. We are bringing down Indian rhino, greater one-horned rhinos, \" he said.\n\n\"They are the most wonderful creatures — they're enormous rhinos, they've got the big wrinkly skin and they're gentle giants.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/white-cliffs-public-bus-service-to-broken-hill/105197980",
    "title": "Outback bus service 'essential' to far-flung opal mining town",
    "publish_date": "Wed, 23 Apr 2025 01:20:17 +0000",
    "category": "finance",
    "authors": [],
    "text": "You might not think twice about the logistics of going to the grocery store, getting a haircut or treating yourself at the bakery, but these everyday events are not straightforward for some residents in far west NSW.\n\nA group of locals in the town of White Cliffs relies on a fortnightly bus service for many essential services and appointments.\n\nEvery second Thursday, bus driver Rob Dyson rolls out of the opal town at 7am with about eight to 10 residents on board to make the six-hour — or 600-kilometre — round trip to Broken Hill.\n\nWhite Cliffs has a corner store and a pub, but the town's 150 or so residents must travel to Broken Hill for medical appointments and shopping beyond the basics.\n\nBefore the bus, many older residents like artist Cree Marshall would go without or, if they really needed to make the trip, found it taxing in their time, energy and finances.\n\nCree Marshall catches the fortnightly bus to Broken Hill from White Cliffs. (ABC Broken Hill: Katherine Spackman)\n\nBut today, Ms Marshall can travel in comfort to Broken Hill when she needs to collect art supplies and do her banking.\n\nShe has been using the service since it started three and a half years ago.\n\n\"I'm like the farm dog, you start up the ute and I jump on … he starts the bus and I'm on it. There are so many advantages,\" Ms Marshall said.\n\nTreats, car parts and social visits\n\nPeter Indermuhle said the four-hour stopover in Broken Hill allowed him time to enjoy some treats before doing his shopping.\n\n\"I usually go to IGA, get some cookies, iced coffee and go to the park, consume it and then I go to the flower shop and have a coffee there on the footpath. And when that's done I go to McDonald's and get chips and coke and then I go shopping at Woolies,\" he said.\n\nWhite Cliffs say the bus service to Broken Hill is an essential for their remote community. (ABC Broken Hill: Katherine Spackman)\n\nEnid Black, who has just retired as the town's pool lifeguard after 20 years, uses the bus service to purchase items she cannot get in White Cliffs.\n\nToday she is relying on the service to source parts for her broken down car.\n\n\"[I] may pick up a [medical] script and gotta get spark plugs for the car and price a few other things and grab a bit of fresh fruit,\" she said.\n\nWhite Cliffs has many dugout homes built underground due to the heat. (ABC TV)\n\nEsther David is on the bus to get her driver's licence and to set up a mailbox in Broken Hill.\n\nIrmhild Bawker is making the trip catch up with friends.\n\nShe said the bus service had changed her life.\n\n\"I was happy before because we didn't know anything else, but it used to be a big shopping trip for me maybe every six weeks [or] two months,\" Ms Bawker said.\n\n\" If you forgot something tough luck, so it's really changed things for me. \"\n\nThe service also supports the community, with four extra trips to Broken Hill a year for workshops and events.\n\nRob Dyson drives the public bus from White Cliffs and Tibooburra to Broken Hill. (ABC Broken Hill: Katherine Spackman)\n\nService expands\n\nMr Dyson has lived in White Cliffs for 15 years and has been driving buses for eight.\n\nThe White Cliffs bus service he drives is approaching the four-year mark.\n\n\"It's really satisfying for me to be able to watch the people … and I just know that it's made a difference,\" he said.\n\n\" People say that this service now is essential. \"\n\nThe service is funded by Transport NSW and initially began as a two-year trial but was extended for another two years until October this year.\n\n\"You never know how Transport NSW work with their funding and everything, but hopefully they see this as an essential service and continue to fund it for the community,\" Mr Dyson said.\n\nThe cost of a ticket $10 for adults, $5 for kids and $2.50 for pensioners for a round trip.\n\nAfter the success of White Cliffs route, Mr Dyson approached Transport NSW about setting up a service for Tibooburra to Broken Hill, via Milparinka and Packsaddle.\n\nThe bus from Tibooburra stops off at Packsaddle on its way to Broken Hill. (ABC Broken Hill: Katherine Spackman)\n\nTransport NSW agreed to a two-year trial operating two days a month, on a Friday and then the following Monday.\n\nThe new bus service began on the first day of the April school holidays and transported school children from Broken Hill to Tibooburra.\n\nA public consultation on the White Cliffs to Broken Hill trial ended in February and the NSW government is reviewing the submissions.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/candlelit-vigil-for-south-west-rocks-death-kaison-greaves/105204506",
    "title": "Hundreds attend candlelit vigil to honour boy who died off NSW beach",
    "publish_date": "Wed, 23 Apr 2025 01:05:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "The family of a nine-year-old boy who died on the New South Wales Mid North Coast on Easter Sunday say they are overwhelmed by the huge community turnout at a vigil in his honour.\n\nHundreds of people gathered in the twilight at South West Rocks' Main Beach on Tuesday to mark the tragic death of Kaison Greaves.\n\nHe died after he became wedged between rocks at the beach on Sunday afternoon.\n\nParents David and Brook Greaves said they were grateful for the people who showed up to remember their son.\n\nDavid and Brook Greaves are overwhelmed by the community support. (ABC Mid North Coast: Nakita Jager)\n\n\"Everyone here isn't here for us,\" Mr Greaves said.\n\n\"Everyone here is to support Kaison and to cherish Kaison's memory.\n\n\"It's overwhelming. Every time we turned around it seemed to grow. Every time we looked around there was more people and more people.\n\n\"All the donations are a godsend — they will help us get Kaison home, back to Brisbane, and help with the funeral.\"\n\nDavid Greaves swam to the rocks where his son died with a bouquet of flowers. (ABC Mid North Coast: Nakita Jager)\n\nThe family also thanked those who were part of frantic rescue efforts on the day.\n\n\"There were a couple of guys jumping off the rocks that found Kaison … and made sure he wasn't alone,\" Mr Greaves said.\n\nHundreds of people have laid flowers and candles in Kaison's memory. (ABC Mid North Coast: Nakita Jager)\n\n\"One of the boys jumping off the other rock, I think he might have heard Kaison and waved [me] down and I ran straight in there and I didn't leave Kaison till the end.\n\n\"There is one of the rescuers here tonight and they told us they did everything they can possibly.\"\n\nKaison remembered as 'an explorer'\n\nThe Brisbane-based family was visiting the popular holiday destination where Mr Greaves grew up — a trip they made every year.\n\n\"I brought my kids here to share what I shared, what I experienced when I was a kid,\" Mr Greaves said.\n\n\"Every time I've come here they've absolutely loved it, this time — tragedy.\n\nKaison, (right), is being remembered as \"an explorer, an adventurer\". (Supplied)\n\n\" He was a little me. I'm an outdoor person. He did everything with me and copied me in every way. I've lost my best friend. \"\n\nMs Greaves said a floral tribute dedicated to Kaison on the beach was \"the perfect way to say goodbye\" to her son.\n\nDavid and Brook Greaves say they are grateful for people who honoured Kaison. (ABC Mid North Coast: Nakita Jager)\n\n\"He's an explorer, an adventurer, loves being outside, always chasing waterfalls — that's what we did,\" Ms Greaves said.\n\nOutpouring of community support\n\nFourteen-year-old Portia Hili was among those attending the vigil.\n\nShe said the rocks were a popular place for visiting and local children.\n\n\"It's somewhere that we all hang out and have always gone to since we were younger, so it's pretty scary to think of it as something like that, as somewhere someone could get hurt,\" Portia said.\n\nPortia Hili and Matilda Clarke show their support for the Greaves family. (ABC Mid North Coast: Nakita Jager)\n\nThe teenager attended the vigil alongside friend Matilda Clarke to offer their condolences to the Greaves family.\n\n\"It could have been anyone,\" Matilda said.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/trump-says-us-tariffs-on-china-will-come-down-substantially/105204860",
    "title": "Trump says US will 'substantially' reduce tariffs on China",
    "publish_date": "Wed, 23 Apr 2025 00:33:45 +0000",
    "category": "finance",
    "authors": [],
    "text": "United States President Donald Trump says American tariffs on Chinese imports will come down \"substantially\" from the current rate of 145 per cent.\n\n\"It won't be that high, not going to be that high,\" he told an Oval Office press conference on Tuesday, local time.\n\nMr Trump said he believes a tariff deal with China could happen \"pretty quickly,\" adding he isn't going to \"play hardball\" during negotiations.\n\n\"They're gonna do very well, and I think they're going to be happy, and we're gonna live together very happily and ideally work together,\" he said.\n\n\"So I think it's gonna work out very well.\"\n\nLoading...\n\nHis comments came after US Treasury Secretary Scott Bessent said in a speech on Tuesday that the ongoing tariffs showdown against China was unsustainable and that he expects a \"de-escalation\" in the trade war between the world's two largest economies.\n\nBut in a private speech in Washington for JPMorgan Chase, Mr Bessent also cautioned that talks between the US and China had yet to formally start.\n\nDetails of the speech were confirmed to The Associated Press by two people familiar with the remarks who insisted on anonymity to discuss them.\n\n\"I do say China is going to be a slog in terms of the negotiations,\" Mr Bessent said, according to a transcript obtained by AP.\n\n\"Neither side thinks the status quo is sustainable.\"\n\nWashington to be 'very good' to Beijing\n\nMr Trump has placed import taxes of 145 per cent on China, which has countered with 125 per cent tariffs on US goods.\n\nWashington has placed tariffs on several dozen countries, causing the stock market to stumble and interest rates to increase on US debt as investors worry about slower economic growth and higher inflationary pressures.\n\nTrump could be fighting a losing battle in a US-China trade war Photo shows A close up shot of Donald Trump looking at Xi Jinping. There are no winners in a US-China trade war. The question is which country can endure the most pain and emerge with the least damage.\n\nAsked about the China negotiations on Tuesday afternoon during the swearing in of SEC chair Paul Atkins, Mr Trump did not say whether he had spoken to Chinese President Xi Jinping.\n\nHowever, he said he was not going to \"play hardball with China\" and expects a deal to be reached soon.\n\n\"They have to, and other countries have to, make a deal. And if they don't make a deal, we'll set the deal,\" Mr Trump said.\n\nBut quickly added, \"We're gonna be very good to China.\"\n\nThe Trump administration has met for talks with counterparts from Japan, India, South Korea, the European Union, Canada and Mexico, among other nations.\n\nBut the US president has shown no public indications that he plans to pullback his baseline 10 per cent tariff, even as he has insisted he is looking for other nations to cut their own import taxes and remove any non-tariff barriers that the administration says have hindered exports from the US.\n\nChina calls on trade partners to oppose unilateral bullying\n\nBeijing on Monday warned other countries against making trade deals with the US that could negatively impact China.\n\n\"China firmly opposes any party reaching a deal at the expense of China's interests,\" China's Commerce Ministry said in a statement.\n\n\"If this happens, China will never accept it and will resolutely take countermeasures in a reciprocal manner. China is determined and capable of safeguarding its own rights and interests.\"\n\nMr Bessent said earlier this month the countries currently negotiating trade deals with the US should \"approach China as a group\" together with Washington.\n\nThe US tariffs on other countries amount to economic bullying, according to a statement from the Commerce Ministry attributed to an unnamed spokesperson.\n\n\"Appeasement cannot bring peace, and compromise cannot win respect,\" it added.\n\n\"For one's own temporary selfish interests, sacrificing the interests of others in exchange for so-called exemptions is like seeking the skin from a tiger. It will ultimately only fail on both ends and harm others without benefiting themselves.\"\n\nChina said it is open to talks with Washington but no meetings have been announced.\n\nABC/AP",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/grief-camp-for-children-who-have-lost-a-parent/105196830",
    "title": "Grief camp connecting kids who understand the pain of losing a parent",
    "publish_date": "Wed, 23 Apr 2025 00:18:11 +0000",
    "category": "finance",
    "authors": [],
    "text": "A beachside camp surrounded by friends would be a typical teenager's dream.\n\nBut when Alexis Versaci's mother told her she'd be driving eight hours to attend a special camp for grieving children, the 14-year-old was filled with dread.\n\n\"My dad passed away [when I was] 10,\" she said.\n\n\"He passed away in a truck accident in Pilbara … that's why I'm here, I guess.\"\n\nLisa Versaci (right) drove her three daughters, including Alexis (pictured), eight hours to attend the camp. (ABC Wide Bay: Lucy Loram)\n\nAfter her husband died, Lisa Versaci searched tirelessly for a program to connect her three daughters with other grieving kids in their hometown of Mackay in North Queensland.\n\nThe search finally ended when she stumbled upon a social media post about a \"grief camp\" in the southern coastal city of Hervey Bay, about 700 kilometres away.\n\n\"When I saw it, I was like, 'Yes, this is what my girls need', and I actually wish I had known of this years ago when it all started for us,\" Ms Versaci said.\n\nMs Versaci would like to see more programs for children who have lost a parent in regional Queensland. (ABC Wide Bay: Lucy Loram)\n\nLosing a parent\n\nAlexis, who attended the camp with her two teenage sisters, said her grief had felt isolating, as few of her peers were able to relate to the pain of losing a parent.\n\n\"It's something that just kind of hits you very hard, and as someone who was 10, I didn't really know what I was supposed to do, how I was supposed to feel,\" she said.\n\nAngelo Versaci (third from left) died in a trucking incident in Western Australia in 2021. (Supplied: Lisa Versaci)\n\nThat was until she spent four days surrounded by 25 kids from around the state who were also grieving the loss of a parent or sibling.\n\n\"I've made lots of friends here, and I feel like the people that I've made connections with here understand what I'm going through and they are just free to talk about it,\" Alexis said.\n\nInside grief camp\n\nThe organiser of Hervey Bay's inaugural Grief Camp — a collaboration between charities Rally for a Cause and Angel Families — said it was a passion project 12 months in the making.\n\n\"We know that one in 20 Australian kids are going to experience the loss of a sibling or a parent, so for us, that's too big of a number to not do something,\" said Jess Lane from Angel Families.\n\nAbout 25 children attended the inaugural camp in Hervey Bay. (Supplied: Jess Lane)\n\nMs Lane said during the four-day camp the youths bonded over a range of activities, including outdoor adventures and a candlelit vigil for their loved ones.\n\nShe said they arrived at the camp with their individual experiences of loss but left with shared memories and support.\n\n\"It's been a balance of grief tending exercises and adventure-based activities … that really cemented the opportunities for those guys to connect on a deeper level,\" Ms Lane said.\n\nOrganisers say they plan to make the camp an annual event. (Supplied: Jess Lane)\n\nAn opportunity to connect\n\nCarolyn Johns, a child bereavement counsellor with the National Centre for Childhood Grief (NCCG), said camp environments could be valuable for grieving children.\n\n\"Camps and groups for bereaved children provide a wonderful opportunity for them to connect with others in a relaxed, safe way,\" Ms Johns said.\n\n\" I have seen the inspiring transformation that occurs … a transformation in terms of the child's confidence, social integration, and ability to share stories about their parent or parents who have died. \"\n\nMs Johns said the NCCG also offered bespoke weekend camps for children with family members that had died.\n\nThe four-day camp offered activities like paintball, kayaking and minigolf. (Supplied: Jess Lane)\n\nWhile the Versacis hold out hope that a similar service will be established in Mackay, they are planning to return to Hervey Bay next year.\n\n\"The girls 100 per cent [will be coming back], to the point where I think they want to come back as volunteers at some point, which will be so beautiful … I'm so, so proud,\" Ms Versaci said.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/toafofoa-sipley-banned-for-hip-drop-tackle-mat-feagai/105204428",
    "title": "Manly prop banned for four games to 'send a clear message' on hip drops",
    "publish_date": "Tue, 22 Apr 2025 22:18:52 +0000",
    "category": "sports",
    "authors": [],
    "text": "Manly prop Toafofoa Sipley has been banned for four games for a hip-drop tackle that broke the leg of Dragons winger Mathew Feagai.\n\nSipley was referred straight to the judiciary after Thursday's 20-18 loss at Brookvale Oval for the tackle that left Feagai needing surgery on a broken fibula and a syndesmosis ankle injury.\n\nSipley pleaded guilty to his dangerous contact charge, with the judiciary reducing his suspension from five to four games as a result, meaning he will miss clashes with the Panthers, Sharks, Cowboys and Eels.\n\nThe judiciary panel accepted Sipley's explanation that he was knocked off balance by running into Feagai's shoulder at the start of the tackle but they were unanimous in their decision.\n\nMathew Feagai suffered a broken leg and a syndesmosis injury to his ankle in the tackle. (Getty Images: Cameron Spencer)\n\n\"The panel were prepared to accept that the player was, to use a neutral term, 'stunned' by the contact but did not consider that the evidence was sufficient to support a conclusion that he was affected to the point where he had lost control of his faculties, although they certainly did not consider that the player's actions were intentional,\" judiciary chair Geoff Bellew said.\n\n\"The panel considered it necessary to send a clear message to all players that dangerous contact of this kind will, if established, meet with significant penalties.\"\n\nBellew said the style of tackle, where defenders drop their weight to try to drag ball-runners to ground, carried \"significant risk of injury and in this case, that risk materialised\".\n\nLoading YouTube content\n\nSipley said after the hearing that he had reached out to apologise to Feagai.\n\n\"Obviously you can see that they are trying to take the hip drop tackle out of the game, so I guess it is just one of those cases where it is what it is,\" Sipley said.\n\n\"I do feel [sorry] for injuring Mat, I did send out a message to him, and I will just do the four weeks.\"\n\nABC Sport is live blogging every round of the AFL and NRL seasons in 2025.\n\nSipley's team suggested a three-week ban based on an Elliott Whitehead tackle from last year that left Brandon Smith with a torn ACL last year, but the panel said the fact that another serious injury had occurred meant a bigger punishment was warranted.\n\n\"Given that it is now season 2025, the panel took the view that the only available conclusion was that penalties such as those imposed on player Whitehead were not acting as a sufficient deterrent,\" Bellew said.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/bluesfest-goers-feel-betrayed-by-final-festival-marketing/105202614",
    "title": "Punters at final Bluesfest feel 'betrayed' as festival renewed for 2026",
    "publish_date": "Tue, 22 Apr 2025 21:52:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Byron Bay's Bluesfest has been resurrected for Easter next year, but it is leaving a bitter taste in the mouths of music lovers who bought into the 2025 event believing it would be the last.\n\nLocal Jeff Barnes said he stopped attending the festival years ago because it had gotten too big but bought tickets this year to mark what he thought was an historic event.\n\nOn Good Friday he said an \"unbelievable\" announcement rang out over the festival grounds spruiking 2026 ticket sales.\n\nJeff Barnes (left) at the festival in earlier times with friend Mick Gunn. (Supplied: Jeff Barnes)\n\n\"I just thought, 'We've been screwed over',\" he said.\n\n\"Officially this was the last ever Bluesfest and we felt like we had to be a part of it.\n\n\" We just feel like we have been totally betrayed. \"\n\nBluesfest founder Peter Noble has previously said 2025 could be the last Bluesfest event. (Supplied: Bluesfest)\n\nIn a statement, Bluesfest said this year's event had attracted 109,000 patrons, the third largest crowd in the event's 35 years.\n\nFestival director Peter Noble said the support of patrons and artists since the announcement that 2025 might be the final year had been a \"clarion call\".\n\n\"That support means Bluesfest fans have kept this dream alive,\" he said.\n\n\"People want this event, people want it to continue.\"\n\nMarketing strategy\n\nTicket sales to the 2025 event gained momentum after the announcement in August last year it would be the last.\n\nBy October, the promoter was advising its mailing list that 80 per cent of tickets had been sold.\n\nSpeaking at a federal parliamentary inquiry into the live music industry in October, Mr Noble conceded the suggestion Bluesfest might be ending was part of a strategy to sell tickets.\n\n\"They're going to sit on that money unless you find a way to make them spend it,\" he told the inquiry.\n\n\"It's Taylor Swift coming, it's Cold Chisel's tour which is once every five or 10 years, or Bluesfest might just be ending.\"\n\nThe festival's director says good ticket sales for 2025 were a \"clarion call\" to run the event again. (ABC North Coast: Hannah Ross)\n\nMr Noble told the inquiry the tactic had helped the festival sell tickets.\n\n\"We made very sure underneath that we said, 'We don't want this to be the last festival, we're doing everything we can for it not to be', but in the end that's the sort of stuff you've gotta do nowadays,\" he said.\n\n\" And is that right … [that] people have got to be coerced to spend their money? \"\n\nBoon for business\n\nThe news Bluesfest will be on in 2026 is music to the ears of the Byron Bay Chamber of Commerce.\n\nPresident Matthew Williamson said the event was a vital part of the region's economy, particularly following the demise of other major festivals in Byron Shire.\n\n\"These types of events allow businesses to keep their heads above water,\" he said.\n\nMatt Williamson says news of the 2026 event is welcome, despite \"vaudevillian\" tactics. (Supplied)\n\nMr Williamson said he hoped public sentiment over the \"final Bluesfest\" marketing would not deter people from attending in future.\n\n\"I think Mr Noble's approach to marketing is his own business,\" he said.\n\n\"There has always been a little bit of a vaudevillian nature to Bluesfest, and its promotion, so if people choose to not respond to that, well, then that's up to them.\n\n\"He's free to promote his business as he sees fit.\"\n\nTraffic woes\n\nByron Shire Council said it was aware of reports of problems with patron transport, parking, and pedestrian control.\n\nThe council said it would be meeting with festival organisers to look at the event's management and what needed to be improved or changed prior to the next event.\n\nMr Williamson said the situation was disappointing.\n\n\"A lot of people come from out of the region and they want to enjoy the beaches and go to the shops and have a nice meal on town, and also go out to the festival,\" he said.\n\n\"People being able to move back and forth between Byron town and the festival is really important to local businesses.\"\n\nCoronavirus restrictions have hit live music and festivals particularly hard. (ABC: Margaret Burin)\n\nMr Noble said there were always aspects of major events that could be improved, but people had been warned to book bus tickets and parking ahead of time.\n\n\"It's very difficult. We don't know how to plan if we don't know what's happening,\" the festival director said.\n\n\" Every single week we said, 'Buy your bus tickets so we know what to put on'. Then people don't, and then that entitlement jumps up at you. \"",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/mornington-island-renal-dialysis-life-saving-treatment/105196586",
    "title": "Remote dialysis unit reunites families after 'scary, lonely' journeys",
    "publish_date": "Tue, 22 Apr 2025 21:38:38 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "After spending two years away from home for life-saving medical treatment, Mornington Island resident Frank Watt says reuniting with his family has brought him \"back to life\".\n\n\"When you're home you get more support from your family … [it] brings you back to life because you feel happy inside,\" Mr Watt said.\n\nBetween 2022 and 2024, Mr Watt received treatment for end-stage kidney disease at Townsville — 850 kilometres away on a multi-day, mutli-flight commute — because there were no suitable renal facilities on the island.\n\nIt was a \"scary, lonely\" time that made him homesick, the 54-year-old said.\n\nFrank Watt on his first day in the new Mornington Island unit. (Supplied: North West Hospital and Health Service)\n\nBut that has changed since a permanent renal dialysis unit was established at Mornington Island Hospital, enabling patients like Mr Watt to receive critical treatment on country.\n\n\"Indigenous people that come from this place, it's a privilege for them to come home and have dialysis,\" Mr Watt said.\n\nFrank Watt is relieved to be back home. (Supplied: North West Hospital and Health Service)\n\nThe ex-police liaison officer said receiving treatment locally was life-changing and he wanted other remote Indigenous communities to have the same opportunity.\n\n\"I reckon every community, Doomadgee, Normanton … they all need them,\" he said.\n\n\"They can go down the beach and do some fishing when they got day off, sit out with families and have a talk, a yarn, like they used to before they got sick.\"\n\nMelinda Foster and Dorita Escott benefit from the new service. (Supplied: North West Hospital and Health Service)\n\nDisplaced for years\n\nThe rate of kidney disease is disproportionately higher among First Nations people than the general population.\n\nKidney Health Australia said Indigenous patients were four times as likely to die from the condition.\n\nLast year, dialysis was the leading cause of hospitalisations for Indigenous Australians accounting for 44 per cent of admissions — 11 times higher than the non-Indigenous population, according to the Aboriginal and Torres Strait Islander Health Performance Framework.\n\nPatients with kidney disease require treatment multiple times a week to stay alive, taking hours at a time.\n\nWhen that is not able to be delivered locally, remote patients like Mr Watt travel hundreds of kilometres to a treatment centre and can be displaced from home for years.\n\nFishing is an important part of family life on the island. (Supplied: Des Mellican)\n\nMornington Island, nestled in the Gulf of Carpentaria off the north coast of Queensland, is home to about 1,000 residents.\n\nMr Watt recalled family members who were being treated for dialysis on the mainland sometimes died there, away from their loved ones back home.\n\n\"Most of them couldn't make it back,\" Mr Watt said.\n\n\"It cost a lot of money to bring home a family member back on the island for a funeral.\"\n\n'Significant improvement', but more centres needed\n\nMr Watt was one of the first patients to be treated at the new renal dialysis unit at Mornington Island Hospital when it opened in June last year.\n\nThe six-chair unit caters to those who independently dialyse and those requiring clinical support from specialist dialysis nurses.\n\nIt was a boost from the previous temporary two-chair, satellite supported haemodialysis unit.\n\nScott Windor has seen how patients' lives have improved. (Supplied: North West Hospital and Health Service)\n\nMornington Island director of nursing Scott Windsor said it was a \"significant improvement\" in the quality of life for dialysis patients.\n\n\"Having access to such critical services locally means that patients can maintain their routines and support networks, which is vital to their wellbeing,\" Mr Windsor said.\n\nNorth West Hospital and Health Service chief executive Sean Birgan said the response from the island's patients was encouraging.\n\n\"The new, more permanent renal dialysis unit allows us to deliver healthcare services more efficiently and effectively, providing better continuity of care and enhancing overall patient experience,\" Mr Birgan said.\n\nBack on the mainland, 150km south-east, Normanton Hospital is currently undergoing a significant upgrade, due to open mid-2025.\n\nIn 2024 the federal government announced $18.58 million for additional dialysis units across multiple locations in remote Australia, including Normanton.\n\nA specific timeline for dialysis at Normanton has not been confirmed, but Mr Birgan said it would be coming to the new hospital.\n\n\"They want the capability to deliver dialysis. That's a service they don't currently have,\" he said.\n\n\"I can confirm that the new building will have the capability of delivering renal dialysis.\"\n\nThe old hospital was knocked down for new pre-fabricated modules. (Supplied: North West Hospital and Health Service)\n\nAnother 400km south-west in the border town of Camooweal, dialysis chairs are scheduled to be installed in the local primary health clinic.\n\nActing health service chief executive Damien Searle said the chairs had been ordered and he was awaiting a delivery date.\n\n\"We endeavour to inform the community and our patients waiting for dialysis treatment in Camooweal as soon as this service is available,\" Mr Searle said.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/qld-brisbane-olympics-whitewater-venue-cost-to-council/105196748",
    "title": "'It's got no water': Councillors and locals question Olympic canoe venue",
    "publish_date": "Tue, 22 Apr 2025 21:33:09 +0000",
    "category": "sports",
    "authors": [],
    "text": "Opponents of a whitewater centre planned for south-east Queensland say they've \"drawn the short straw\" of Olympic venues.\n\nA Senate inquiry into Australia's preparedness to host the Games found a \"high likelihood\" the Redland Whitewater Centre could become a drain on the community when the Games are over.\n\nThe future precinct would host the canoe slalom event and has been touted as \"Australia's northern home of international-level whitewater events\".\n\nBut ratepayers in the bayside council are worried it will leave them with a massive \"ongoing financial burden\".\n\nOpponents of the facility say they are concerned about its environmental impact. (ABC News: Kenji Sato)\n\nRedland City Councillor Wendy Boglary voted against the facility.\n\n\"It's a fantastic community site, but it's got no infrastructure,\" Cr Boglary said.\n\n\"It's got no water, no sewerage, no roads, no car parks. We'll pay for the enabling infrastructure and when the baby's born we get it for life. It's the families of Redlands that'll be paying for it.\"\n\nA 100-day review of Olympic infrastructure found the project represents \"value for money\" for the state government because of \"significant co-investment\" by the Redland City Council.\n\nLavinia Wood, part of an alliance of community groups against the plan, said locals would rather have a new pool.\n\n\"We have a 50-metre swimming pool that our council has been unable to maintain properly, and yet they're putting their hand up to carry the costs of this major Olympic venue,\" she said.\n\nAvoiding a 'white elephant'\n\nNew International Olympic Committee requirements are supposed to make hosting the games more affordable by not requiring new infrastructure to be built and encouraging the use of temporary venues.\n\nPrevious host cities have been left saddled with huge infrastructure projects, built at a massive cost only to lie unused and become so-called \"white elephants\".\n\nThere are images of abandoned stadiums and empty pools in Athens and Brazil, regularly cited as modern examples of poor planning.\n\nDeputy Premier Jarred Bleijie said the facility would be part of the state's $7.1 billion commitment to the 2032 Olympic infrastructure but did not elaborate on how much it was expected to cost.\n\nDeputy Premier Jarrod Bleijie said the centre will also operate as a training facility for swift-water rescues. (ABC News: Kenji Sato)\n\nThere are plans for the centre to be used for swift-water rescue training after the Games.\n\nCurrently training is only available in north Queensland or Tasmania.\n\n\"We are the disaster capital of Australia so having a dedicated training facility is a game-changer,\" said Mr Bleijie.\n\nAsked about the cost to ratepayers beyond 2032, Mr Bleijie said discussions with council were ongoing.\n\nDoubling up concerns\n\nThe stadium would be Australia's second dedicated whitewater facility.\n\nThe first was built in 1999 for the Sydney 2000 Games and run by the Penrith City Council until 2023, when it was taken over by the state government.\n\nAnnual reports show the facility ran at a loss almost every year since 2008.\n\nSisters Noemie (left) and Jess Fox (right) did most of their Olympic training at Penrith Whitewater Stadium. (ABC News: Sean Tarek Goodwin)\n\nEvent management expert Professor Judith Mair said any legacy project needs the backing of those most likely to use it beyond the Games.\n\n\"It really needs to be thought about very carefully in relation to who's going to support it and so that it doesn't become a burden just on local resident taxpayers,\" she said.\n\n\"It's always concerning when new pieces of infrastructure are built because we can all see an obvious use for it for two weeks.\n\n\" What is going to happen to it after that is something that is a worry. \"\n\nPaddle Australia — the representative organisation for whitewater sports — has welcomed the proposal.\n\nIn a statement when the Olympic venues were revealed last month, the organisation said it would be a \"game changer\" for canoe slalom in Australia.\n\nCanoe slalom was one of Australia's most successful sports at the Paris Olympic Games in 2024. (Paddle Australia via AAP: John Rohloff)\n\nThey said the sport's growth had been limited by only having one dedicated facility — Penrith Whitewater Stadium.\n\nIn their submission to the Senate inquiry, the group said there had been increased demand for whitewater access off the back of the sport's most successful Olympic Games result in Paris, where sisters Jess and Noemie Fox won three gold medals between them.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/youtube-social-media-ban-exemption-decided-government-says/105201088",
    "title": "Emails reveal government's mixed messaging on YouTube's 'sweetheart deal'",
    "publish_date": "Tue, 22 Apr 2025 21:31:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "The federal government has doubled down on its decision to give YouTube a carve-out from the teen social media ban, despite privately assuring rival platforms that \"no final decisions\" have been made, the ABC can reveal.\n\nThe government disputes that it has made contradictory statements, but the revelation further complicates what competitors have described as a ''sweetheart deal\" for the video streaming giant.\n\nFrom December, all Australians will have to prove they are older than 16 to use most social media sites, but Communications Minister Michelle Rowland is yet to formalise which platforms will be covered.\n\nThe legislation states the minister must seek advice from the eSafety Commissioner first — something Ms Rowland has not yet done.\n\nDespite that, the government now appears to be discussing the exemption for YouTube as if it is a done deal.\n\nThe government told the ABC the decision to exclude YouTube was made five months ago, and it had not wavered since, but emails seen by the ABC suggest Ms Rowland's office gave a very different message to a YouTube rival as recently as last month.\n\nYouTube's rivals slam draft ban for 'sweetheart deal' Photo shows A high school student poses with her mobile showing her social media applications. The federal government has been accused of making a \"sweetheart deal\" to exempt YouTube from the teen social media ban, as YouTube's competitors kick off a co-ordinated public campaign against the move.\n\nThe email from early March, sent by a senior ministerial staffer to a YouTube competitor in reply to concerns over the YouTube exemption, stated: \"I can reassure you that no final decisions are imminent and will not occur until the full consultation is complete.\"\n\nIt went on to acknowledge that the minister has an obligation to seek advice from regulators such as the eSafety Commissioner first.\n\n\"Once the current stakeholder phase of consultation is completed, the next phase will be to seek the advice of the relevant regulators, per our legislative obligation,\" the staffer wrote.\n\nMs Rowland's office responded to questions from the ABC by doubling down on its claim that the decision to exempt YouTube is nothing new.\n\n\"The Minister's decision to exclude YouTube was made in November last year, publicly stated in a media release and reflected in the second reading of the legislation,\" a spokesperson said.\n\n\"That decision has been made and there has been zero reconsideration or communication to suggest otherwise — despite misleading attempts by Snapchat, Facebook and TikTok to imply that it was.\"\n\nThe spokesperson did not provide any further clarification on the matter.\n\nLoading...\n\nHow did we get here? The YouTube saga so far\n\nThe government has stated its intention to exempt YouTube several times since the policy was first announced, although the language has sometimes shifted depending on the context.\n\nWhen the teen social media ban was announced in November, Ms Rowland said YouTube would be part of the ban, and that there were \"no outs\" for social media giants.\n\nYouTube Kids might be an exception, she said at the time, because of its educational role for children and families.\n\nTwo weeks later, by the time the bill was making its way through parliament, the government's position changed, and YouTube was earmarked for an \"expected\" exemption.\n\nSeveral weeks after that, the minister wrote a letter to YouTube's global CEO, in which she said she \"reaffirms\" the government's \"commitment\" that YouTube would avoid the ban.\n\nThe letter only came to light last week under Freedom of Information laws, more than four months after it was sent.\n\nYouTube's rivals hit back at proposed exemption\n\nOfficially, the rules to determine once and for all which platforms will be exempt are only at a draft phase.\n\nThe version of those rules made public in February this year singled out YouTube for an exemption from the ban, triggering a backlash from Snapchat, Meta and TikTok.\n\nThey accused the government of making a \"sweetheart deal\" to exempt the platform, with TikTok arguing it was \"akin to banning the sale of soft drinks to minors but exempting Coca-Cola\".\n\nIn March, Meta, the parent company of Instagram and Facebook, said the notion of exempting YouTube \"makes a mockery of the Government's stated intention … to protect young people\".\n\nIt argued the platform uses all the same features the government has deemed unsafe for children, including algorithmic content recommendations, never-ending auto-play, and persistent notifications and alerts.\n\n\"YouTube's exemption is at odds with the purported reasons for the [teen social media ban],\" a Meta spokesperson told the ABC.\n\nA timeline of the shifting statements on YouTube's social media ban exemption",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/asx-markets-business-live-news-23-april-2025/105204468",
    "title": "Live: Tesla profit plunges 70pc as sales take a hit",
    "publish_date": "Tue, 22 Apr 2025 21:28:43 +0000",
    "category": "finance",
    "authors": [
      "Stephanie Chalmers",
      "Nadia Daly"
    ],
    "text": "Economist Justin Wolfers says a recession in the US is now likely, but he's more upbeat about the broader global outlook.\n\nIt follows the International Monetary Fund slashing its global growth forecast for 2025 from 3.3 to 2.8 per cent amid the fallout of Donald Trump's tariffs.\n\nAustralia's economic growth was downgraded to 1.6 per cent in 2025, significantly down from the 2.1 per cent growth forecast by the IMF in January.\n\nThe professor of economics at the University of Michigan noted that betting markets have the odds of a recession in the US at 60 per cent.\n\n\"'Likely' is the correct answer, 'certain' is definitely wrong,\" Professor Wolfers said. \"The thing to remember about things that are a three-in-five chance is that they don't happen two out of five times. \"So may not happen, we're yet to see. We've seen a lot of pessimism in the soft data. \"When you ask people how they feel, what their expectations are about the future — very, very dark times. \"But if you look at what people are doing so far, they haven't yet much changed their actions. \"Now, that said, there are stories starting to circulate, and so maybe the bad data is just a few weeks away.\n\nLoading...",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/darwin-waterfront-corporation-rejects-inquiry-call-allegations/105203274",
    "title": "'I am the minister': NT government shuts down call for Darwin Waterfront inquiry",
    "publish_date": "Tue, 22 Apr 2025 21:25:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Northern Territory government has shut down calls for an independent public inquiry into allegations of the misuse of public funds at the Darwin Waterfront Corporation (DWC).\n\nThe Darwin Waterfront is one of the most popular recreational facilities in the Top End, drawing in more than 1 million visitors in 2023-24, according to the corporation's most recent annual report.\n\nWhile the DWC operates outside of local government boundaries, its annual report showed it received more than $25 million in NT government grants in that same financial year.\n\nOnline media outlet the NT Independent has published a weeks-long investigation into historical allegations that public money was being misused by senior figures within the corporation, reporting allegations about the potential mismanagement of conflicts of interest.\n\nThe opposition and crossbencher Justine Davis have been calling for an independent inquiry into the allegations. (ABC News: Pete Garnish)\n\nPart of the investigation centred around claims that senior staff had invented jobs to put friends and relatives into lucrative positions.\n\nThe DWC has \"categorically refuted\" any suggestion of impropriety of any kind.\n\nNT Chief Minister Lia Finocchiaro has declined to answer questions related to the allegations about the DWC, of which her husband Sam Burke is the deputy chief executive.\n\n\"Obviously in making sure that I deal with matters appropriately … clear separations are appropriately and properly in place,\" she told ABC Radio Darwin on Tuesday.\n\nThe Labor opposition and crossbencher Justine Davis have been calling for an independent inquiry into the allegations.\n\nHowever later on Tuesday, Tourism Minister Marie-Clare Boothby announced she had assessed the matter and believed there had been \"no wrongdoing\".\n\nMarie-Clare Boothby says a departmental briefing found \"no wrongdoing\" and \"nothing untoward\". (ABC News: Pete Garnish)\n\n\"The allegations that have been made against the Darwin Waterfront are historical,\" she said.\n\n\"I requested a briefing from the Department of Chief Minister.\n\n\"I received that briefing, I read that briefing, and I can see that the due process under those allegations was actually followed.\n\n\" So there is nothing untoward there. I will not be calling for an inquiry, that matter is now done. \"\n\nMs Boothby did not agree to release the departmental briefing publicly but said that based on the internal government information she had received, she did not believe there was reason for a further \"expensive and lengthy\" inquiry.\n\n\"I am the minister, I make the decisions on what happens under my ministries,\" she said.\n\nCalls for further inquiry continue\n\nBoth Labor and Ms Davis voiced their frustration and disappointment about Ms Boothby's decision, with Opposition Leader Selena Uibo saying there were still \"many unanswered questions\".\n\n\"There are far too many serious questions surrounding the Darwin Waterfront — and far too few answers from a government that claims to stand for transparency,\" she said.\n\nSelena Uibo has been calling for an inquiry into the allegations despite acknowledging they date back to Labor's time in office. (ABC News: Pete Garnish)\n\n\"Territorians expect integrity and transparency from public bodies that spend public money and this is no exception.\n\n\" I acknowledge much of this occurred under a former Labor government but that does not change my position — I am calling for an inquiry regardless. \"\n\nIndependent MLA Justine Davis said it was \"disappointing that the minister has ruled out a public inquiry into potential misconduct at the [DWC]\".\n\n\"When serious allegations like this are raised, Territorians deserve confidence that they'll be thoroughly and independently investigated,\" she said.\n\nThe corporation says \"all internal staff appointments, promotions and shared services have been fully documented and have followed proper procedures\". (ABC News: Pete Garnish)\n\n\"This is why we need strong, properly resourced oversight bodies — free from actual or perceived conflict of interest — because that's how we protect the integrity of our institutions and rebuild public trust.\"\n\nAllegations 'categorically refuted'\n\nIn a statement on Tuesday evening, a DWC spokesperson said the \"allegations, assertions and imputations which have been published\" were \"categorically refuted\".\n\nThe spokesperson said there was \"no substance to any suggestion\" of financial or procedural impropriety and the DWC had complied with the relevant processes, policies and legislation \"at all times\".\n\nThey said all board appointments were made by the minister of the day, with all remuneration \"set by statutory tribunal approved by the minister\".\n\n\"All internal staff appointments, promotions and shared services have been fully documented and have followed proper procedures, approved by the board,\" they said.\n\n\"Since creation, the corporation has been annually audited by the Auditor-General in accordance with both Northern Territory and relevant Commonwealth corporations law and has received successive unqualified audit reports.\"\n\nIn a statement, the NT Independent said it \"stands behind its reporting on this matter that has been sourced from internal government documents, raising concerns that should be investigated thoroughly in the public interest\".",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-04-23/student-visa-dutton-international-university-housing-jobs-cost/105161424",
    "title": "Dutton's enrolment cap plan 'demonises' foreign students, union says",
    "publish_date": "Tue, 22 Apr 2025 20:58:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "The federal opposition has promised to restore the Australian home ownership dream by slashing international students.\n\nBut for those directly impacted, the proposal is cause for concern.\n\nJanvi Abrol is an international student from India studying a Bachelor of Information Technology at Federation University's Berwick campus, an hour's drive south-east of Melbourne's CBD.\n\n\"For many international students, their Australian dream [could be] shattered,\" she said.\n\nMs Abrol's university fees contributed to the $51 billion that the Australian Bureau of Statistics (ABS) reports international education contributed to the Australian economy in 2023–24.\n\nPeter Dutton has pledged to limit the number of international students able to start studying in Australia each year to 240,000, after blocking Labor's attempts to pass legislation to cap enrolments last year.\n\nThe opposition's proposed cap is 30,000 fewer students annually than Labor's earlier proposal.\n\nFederation University has the largest regional presence in Victoria. (Supplied: Federation University)\n\nAn 'easy target'\n\nMelbourne-based migration agent Gurpreet Dhawan said Mr Dutton's plan may have a devastating impact on regional communities.\n\nShe said the changes would hit regional areas \"like a freight train\" if implemented.\n\n\"Students aren't the problem; they're the easy target,\" she said.\n\nMigration agent Gurpreet Dhawan is based in Springvale. (Supplied: Gurpreet Dhawan)\n\nUnder the Coalition's plan, the student visa application fee will also be increased to $5,000 for overseas students at Group of Eight institutions, while all other international students would be charged about $2,500.\n\nThe visa application fees for international students hoping to study in Australia — approximately $1,600 — already dwarf the United States (roughly $850), Canada (roughly $170), and New Zealand (roughly $700).\n\nMs Dhawan said the Liberals' proposed fee hike would result in high-performing students applying to study in countries other than Australia.\n\n\"Students we desperately need won't stick around,\" she said.\n\n\"They'll head to Canada for affordable fees and a permanent residency pathway in two years, or the US where [the visa] opens doors to global careers.\n\n\"We'd be left with the leftovers, students who see us as a last-ditch option, not their top pick.\"\n\nThe Coalitions says it will cap annual international student enrolments at 240,000 if elected. (ABC News)\n\nThe ABS reports international students were the largest temporary visa group in Australia in the 2023–24 financial year with 207,000 arrivals — down from 278,000 in 2022–23.\n\nBoth major parties have focused this election on international students — which account for roughly half of all temporary migrants — as their main mechanism to bring migration rates back to pre-pandemic levels.\n\nThe Labor Party did not respond to requests for comment regarding international student numbers.\n\nHowever, last year the federal government said it would attempt to suppress international student numbers by ordering a \"go-slow\" on visa processing once applications reach a target for each university as a workaround for its failed legislation.\n\n'Misleading' housing policy\n\nShadow Minister for Education Sarah Henderson said her party's policy would \"help restore the Australian dream of home ownership\" by addressing housing pressures.\n\nSarah Henderson says she is aware of \"special issues\" affecting regional universities. (ABC News: Matt Roberts)\n\nBut National Tertiary Education Union president Alison Barnes said the policy was \"misleading\" and short-sighted.\n\n\"It's going to really impact the fabric of regional universities and metropolitan universities,\" Ms Barnes said.\n\n\"It's going to lead to issues like job cuts, and when you're looking at losses to jobs, that has a devastating impact on the individual who is impacted, but it has a devastating impact on the communities in which people live and work.\"\n\nMs Barnes told ABC Ballarat the Liberals' pledge painted international students in a way that was not accurate or fair.\n\n\"A big study came out of universities in South Australia that demonstrates there was no link to international students and the cost of renting,\" Ms Barnes said.\n\nStudy finds international students 'thrown under the bus' Photo shows a female students at an exam table International students have been \"thrown under the bus\" and unfairly blamed for the rental crisis, according to new study.\n\n\" It's an argument I think that plays to people's concerns and fears around cost of living, and they're very fair and valid concerns, but it unfairly demonises international students. \"\n\nMs Henderson said the policy would focus on \"restoring the balance\" especially in Sydney and Melbourne, where most international students live and study.\n\nA Coalition campaign spokesperson said they expected the cap on public universities would be \"around the range of 25 per cent\" of current enrolments.\n\n\"But we will work with the higher education sector in government with access to the latest data, as the only publicly available information [on international student enrolments at Australian universities] available is from 2023,\" they said.\n\n\"We are aware there are special issues in relation to various regional public universities, which is why we will work with the sector to avoid unintended consequences.\"\n\nMr Dutton and Ms Henderson declined to elaborate on planned caps at specific universities.\n\nRegional hub hopeful\n\nDuncan Bentley is the vice chancellor of Federation University, which has campuses in regional Victoria and outer Melbourne.\n\nProfessor Bentley said a 25 per cent cap on international student enrolments was more favourable than the 52.3 per cent cut from 2023 enrolments proposed by the 2024 Senate Education and Employment Legislation Committee.\n\nUnder the proposal, institutions each had their own individual caps within the national total of 270,000 places.\n\n\"We were quite badly hit by the numbers given to us in our [2024 Senate Education and Employment Legislation Committee proposed] cap and the certainty that will increase under a Coalition government for regional universities like ours where we had an under allocation of international places is vitally important for regional skills growth,\" Mr Bentley said.\n\nAlec Webb is the CEO of the Regional Universities Network. (Supplied: RUN)\n\nRegional Universities Network chief executive officer Alec Webb met the policy with scepticism.\n\n\"The devil will be in the policy detail, which we currently do not have,\" Mr Webb said.",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/world/europe/danish-princess-reveals-18th-birthday-portrait-one-detail-sets-it-apart-20250423-p5ltkz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Danish princess reveals 18th birthday portrait. One detail sets it apart",
    "publish_date": "Wed, 23 Apr 2025 11:57:39 +1000",
    "category": "entertainment",
    "authors": [
      "James Rothwell"
    ],
    "text": "Denmark’s 18-year-old Princess Isabella has caused a stir online after posing for a strikingly modern photograph in which she is holding her mobile phone.\n\nThe daughter of Australian-born Queen Mary and King Frederik X is seen smiling for the camera in a tiara – and holding her smartphone, in a break with royal protocol.\n\nDanish Princess Isabella holds her phone in a portrait shared on the royal family’s social media. Credit: Instagram / @detdanskekongehus\n\nThe photograph, taken in celebration of her 18th birthday, was posted on the Danish royal family’s official website and social media channels.\n\nIt was captured by Steen Evald, who has been an official photographer for the family for more than two decades, in the Knight’s Hall of Frederik VIII’s Palace in Amalienborg.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/earthquake-jolts-hunter-region-20250423-p5ltpm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Earthquake jolts Hunter region",
    "publish_date": "Wed, 23 Apr 2025 11:55:18 +1000",
    "category": "finance",
    "authors": [],
    "text": "Earthquake jolts Hunter region\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/western-australia/wa-news-live-pm-dutton-in-perth-today-on-campaign-trail-20250422-p5ltj4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: PM, Dutton in Perth today on campaign trail",
    "publish_date": "Wed, 23 Apr 2025 11:47:48 +1000",
    "category": "finance",
    "authors": [],
    "text": "Peter Dutton is about to arrive at a defence manufacturing business in Belmont to spruik his military spending plan.\n\nThe contingent travelling with the opposition leader is at Blacktree Technologies in the Labor-held seat of Swan.\n\nSwan is one of four seats in WA that Labor snatched off the Liberal Party in 2022.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/the-data-that-shows-piastri-has-edge-over-verstappen-and-norris-in-f1-title-fight-20250423-p5ltmw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The data that shows Piastri has edge over Verstappen and Norris in F1 title fight",
    "publish_date": "Wed, 23 Apr 2025 11:47:43 +1000",
    "category": "sports",
    "authors": [
      "Luke Slater"
    ],
    "text": "On average, so far, the McLaren has been just over a quarter of a per cent faster than the Red Bull, even if it has taken “only” three poles from six qualifying sessions. That equates to 0.27 seconds on a theoretical one-minute and 40-second lap. Who, though, has been getting the most from their car? Not Norris, whose average qualifying position is 4.67. That is not just below Piastri (2.0) and Verstappen (3.0), but also George Russell (3.5) in a Mercedes. As he said, he is letting himself down and making life (and his championship hopes) harder than it needs to be.\n\nPiastri is yet to qualify worse than third and has four front-row starts compared to Norris, who has started in the top two only twice. In the last two rounds, he has been in grid spots six and 10. Verstappen has two poles and one other front-row start. Maximising lap time Another useful measure of how well a driver is performing over one qualifying lap is whether they are maximising their potential. You can work this out by looking at the difference between a driver’s best lap time and comparing it to their theoretical best – calculated by totalling a driver’s best three sector times. For instance, a driver may have recorded best sector times of 20.1seconds, 32.5 seconds and 29.4 seconds (1 minute 22 seconds in total) but their best lap time in qualifying could be 1 minute 22.2 seconds, which means they left two-tenths on the table from what they theoretically could have achieved. Looking at the data from the lead trio, it is painfully obvious that Norris trails by this metric. He has put together his theoretical best in the decisive final qualifying period twice. That is the same as Piastri, but one fewer than Verstappen.\n\nOscar Piastri and Lando Norris after the Australian won the Bahrain grand prix. Credit: Getty Images However, dig a little deeper and the picture is worse. His best lap time is on average 0.187 seconds down on his theoretical best, giving away seven-tenths in the Chinese sprint race, 0.147 seconds in qualifying for the Chinese Grand Prix and two-tenths in Bahrain. By contrast, Piastri is giving away just 0.061 seconds and Verstappen 0.043 seconds. Piastri has only given away more than a tenth on two occasions, and Verstappen once. Clearly, this has been driven by those well-noted Norris errors. Races There are several metrics you can look at, but again, the lack of quality in the second Red Bull makes any team-mate comparison almost pointless. Away from Verstappen’s utter dominance at Red Bull, Piastri has finished as the lead McLaren in three of the five grands prix.\n\nNorris, though, has the higher average finishing position at McLaren at 2.4 compared to 3.0, excluding the sprint race. That is largely because of Piastri’s ninth-place finish in Australia. Piastri has been the stronger driver since that point. Verstappen’s average finishing position of third, then, is more impressive than both Piastri and Norris. China was a tough race for him (not as tough as Bahrain), but he still extracted close to the maximum from the car. Perhaps the only race he did not maximise the performance of the RB21 was in Saudi Arabia, when he let a lead slip at the start and incurred a five-second time penalty. Looking at laps led, Piastri leads the way with 124, with Verstappen on 66 and then Norris on 60. Of course, it is better to lead the final lap of the race than to have led all of the previous ones. Still, it is clear who is doing better.\n\nWinning margins can be a misleading statistic because there are so many other factors involved such as race and tyre management, as well as safety cars. They provide a decent guide overall, but come with caveats. Of the meaningful races there is only really Verstappen’s 1.4 second-margin in Japan and Piastri’s 15 seconds in Bahrain (after 22 laps of racing) and his 2.8 seconds in Saudi Arabia. Verdict: Verstappen the better driver, Piastri the more likely champion There are other intangible factors that will play a part in the destination of the title in the next 19 rounds. Errors will be one of them, as will mentality and luck, especially if it stays as close as it is. Considering what we have looked at above, we would rate Verstappen as the top-performing driver by a small margin over Piastri. The Dutchman will likely have a battle on his hands to stay in championship contention, though, because of his car. Red Bull driver Max Verstappen. Credit: Getty Images",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/politics/federal/federal-election-2025-live-updates-20250422-p5ltk3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Federal election 2025 LIVE updates: Half a million votes cast on first day of early voting; Trump tariff war to blow $13b hole in economy",
    "publish_date": "Wed, 23 Apr 2025 11:47:08 +1000",
    "category": "finance",
    "authors": [
      "Angus Dalton"
    ],
    "text": "On 3AW, host Tom Elliott asked Dutton if he was nervous about saying the Coalition would bring down power, gas and grocery prices.\n\nElliott: “I mean, it’d be great to wave a magic wand and make everything cheaper for everyone, but it’s not really that simple, is it?”\n\nLoading\n\nDutton: “Tom, it’s not simple, but it’s achievable if you’ve got the ability to do it. And the Coalition government will always manage the economy more effectively and to address cost of living … The government spent more money than any government in the last 40 years. It’s the worst government since the Whitlam government, and the price of everything has gone up as a result of that. And this blind pursuit of a renewables-only policy is all about trying to win over Greens voters in industry in Melbourne and Sydney, and it’s hurting people right across the economy.”\n\nEarlier in the campaign, Dutton referred to the Albanese government being the worst since Whitlam in terms of spending.\n\nAnd last week in this blog, senior economics correspondent Shane Wright revealed that Dutton’s signature planned mortgage interest rate deduction policy, which experts have described as “ridiculous” and a danger to the tax system, was a policy of Whitlam.\n\nDutton told 3AW a record 30,000 small businesses had closed over the past three years and Australia couldn’t afford to continue on that path.\n\nHe said an east coast gas reservation would bring down prices of wholesale gas by almost a quarter.\n\n“If we’re lowering the price of gas by 23 per cent, then we can help lower the cost of construction, and we can help lower the cost of storing food and cold storage and transporting food, etc,” he said.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/business/companies/liberals-remove-tiktok-after-influencer-calls-in-lawyers-over-stolen-content-20250422-p5ltbw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Liberals remove TikTok after influencer calls in lawyers over ‘stolen’ content",
    "publish_date": "Wed, 23 Apr 2025 11:30:08 +1000",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "The Liberal Party has removed a social media post after a Gold Coast influencer threatened to sue the Federal opposition for allegedly twisting a pro-Greens video to attack the minor party.\n\nHolly MacAlpine posted a video in March, posing a “true or false” statement to Greens senator Larissa Waters, which was edited by the Liberal Party’s official TikTok page to appear critical of the party.\n\nGreens Senator Larissa Waters, left, with content creator Holly MacAlpine.\n\nLegal representatives for MacAlpine sent a concerns notice to the Liberal Party on Tuesday evening over the video, the initial step in defamation proceedings. The letter also included allegations her moral rights were infringed by subjecting her to derogatory treatment, an infringement of copyright in repurposing the content.\n\nThe post in question took a five-second grab from a video in late March, cutting the statement “the Greens just protest, they don’t actually get anything done” (which required an answer) and presenting it alone as a statement of fact, followed by an official party authorisation.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/nsw/developers-want-to-build-1100-apartments-two-sydney-councils-are-alarmed-20250415-p5lryv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Developers want to build 1100 apartments. Two councils are alarmed",
    "publish_date": "Wed, 23 Apr 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Megan Gorrey"
    ],
    "text": "An inner Sydney council is fighting a mammoth $880 million proposal to build more than 1000 apartments beside Parramatta Road, arguing the towers would overshadow houses on the opposite side of the busy thoroughfare, despite the development sitting outside the council’s boundaries.\n\nThe Inner West Council has objected to property giant Deicorp’s plan to build 1185 homes, including 219 affordable housing units, in six towers up to 31 storeys between Parramatta Road and Queens Road in Five Dock.\n\nThe City of Canada Bay council has also lodged a formal objection to the “state significant” Kings Bay Village proposal, which will be decided by the NSW government.\n\nThe proposed Kings Bay Village development will bypass the local council and be decided by the state government.\n\nDeicorp reportedly purchased the 3.12-hectare industrial “super site” next to Rosebank College for $260 million in 2023.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/afl/adem-yze-and-richmond-media-shut-down-noah-balta-questions-20250423-p5ltp8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Adem Yze and Richmond media shut down Noah Balta questions",
    "publish_date": "Wed, 23 Apr 2025 11:29:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "Adem Yze and Richmond media shut down Noah Balta questions\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/national/victoria/how-building-more-apartments-could-make-these-rich-melbourne-suburbs-more-inclusive-20250421-p5lt56.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How building more apartments could make these rich Melbourne suburbs more inclusive",
    "publish_date": "Wed, 23 Apr 2025 11:20:05 +1000",
    "category": "finance",
    "authors": [
      "Daniella White"
    ],
    "text": "Building more apartments in some of Melbourne’s most affluent postcodes would desegregate rich suburbs and allow more middle-class people to live in desirable locations, a new analysis by advocates of higher density living suggests.\n\nBut prominent planners have criticised the Victorian government’s activity centre scheme, and say it won’t deliver the affordable housing it promises but will instead radically alter Melbourne’s cultural heritage.\n\nThe location of Melbourne’s proposed activity centres within the city’s socioeconomic status Credit: Asanka Epa\n\nRMIT University Emeritus Professor Michael Buxton last week told an inquiry into new planning rules that the government had held “secretive” consultation into key changes that would allow greater housing density and fewer avenues for community and council objections.\n\nThe Allan government has unveiled 60 planned activity centres, which are slated for higher-density living as part of the plan to encourage developers to build hundreds of thousands of new homes.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/sport/afl/no-more-questions-yze-prickly-at-media-conference-after-balta-sentencing-20250423-p5ltn0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘No more questions’: Yze prickly at media conference after Balta sentencing",
    "publish_date": "Wed, 23 Apr 2025 11:16:48 +1000",
    "category": "sports",
    "authors": [
      "Danny Russell"
    ],
    "text": "Earlier, Yze had said the club and Balta accepted the court’s punishment and would now set a plan for him, “understanding which games he won’t be allowed to play”. “To go through an appeal process would be almost giving him the license to get back in and [say that] footy was more relevant than the sanction,” Yze said. “He knew that he did wrong, and he was going to be punished. So to go through that for another six weeks, we just thought it was too hard, not only on him, but on our footy club and our playing group, so we accept the decision, and we move on.” Yze said the club had not expected a curfew, but they knew the defender was going to be sanctioned.\n\nLoading “Dealing with that is just part of it,” he said. “Like I said, he’s really remorseful. We knew that he was going to be punished, and we went through that process yesterday, and now that’s one little element that we’ll have to play around with and deal with as a club. “But at the same time we have got to wrap our arms around him and help him through this.” Richmond banned Balta, 25, for four AFL games and two pre-season matches after it was revealed he had assaulted a man outside Mulwala Water Ski Club in the early hours of December 30 last year. But Yze defended Balta’s decision to not speak publicly about the court case.\n\nLoading “He will speak in time,” the Tigers coach said. “It’s pretty tough to go through. There’s a fair few players that don’t like speaking in front of the media, and they’re not trained for that. “And going through what he went through yesterday, you’re obviously a little bit worried about what he could say. “He was he’s obviously disappointed, he’s flat, he’s emotional, so we’ve just got to protect him with that. He’ll speak when he when it’s his right time to speak and you will sense how remorseful he is.” Balta played his first game of the season against the Gold Coast last Saturday, and will be expected to line up for the Tigers again against Hawthorn in a day match at the MCG in round eight.\n\nYze said Richmond would bring in 195-centimetre youngster Campbell Gray, 21, to make his debut on Thursday night. Gray was taken at pick 16 in the 2024 mid-season rookie draft. Roos lash out at ‘coach bashing’ of Clarkson AAP North Melbourne have come out swinging in defence of Alastair Clarkson with football boss Todd Viney lashing “disrespectful” criticism and “coach bashing” of the Kangaroos mentor. North have lost their past four games by an average of almost 59 points and reached a season-low with an embarrassing 82-point defeat to Carlton on Good Friday.\n\nClarkson has come under fire, but Viney, who also worked with him at Hawthorn, scoffed at any suggestion the four-time premiership mentor had lost his edge. “I find it amusing, really. I find it probably disrespectful,” Viney said on SEN on Wednesday. Tough days: Alastair Clarkson is working to turn North Melbourne’s fortunes around. Credit: AFL Photos “This is not only to Clarko but this is something that’s pointed at senior coaches all the time. It’s almost like a sport ... There is a sport around putting undue pressure on senior coaches in my view.” Viney pointed out 2025 was the first season where Clarkson hadn’t also been dealing with the fallout from the Hawthorn racism saga.\n\n“Not many clubs can really perform at their best when they’ve got such distractions going on,” Viney continued. “... He’s had enormous distractions, unwarranted criticisms, judged unfairly – it’s taken an enormous toll on him over those two years. “Eventually we’re into this third year, two years and six games in. He’s a rejuvenated person, back to his old self, a lot of energy, seeing the game as well as he’s ever seen it.” Viney was adamant Clarkson was well supported and seeing the game “as well as he ever has” but the Kangaroos were in the early stages of building their game. “The criticism is really unwarranted,” he said. “I think it’s a bit of a sport, the coach-bashing thing. “It’s a tall-poppy syndrome which is the Australian culture – we pick on the guys who have been successful and in time ultimately bring them down.”\n\nLoading Ahead of Saturday’s away clash with Port Adelaide, Viney was adamant the Kangaroos were strong and aligned across the board and wouldn’t deviate from their plans. “A lot of things are going well so we won’t be fractured, we won’t fall into jumping at shadows with all the noise,” he said. “We understand the game gives us nothing and we need to deserve to win games. “No one’s going to give us anything and we don’t expect it, we expect to cop our right whack with performances like the weekend. “But we won’t hear that everything we’re doing is not right because there is a lot of positive things that are going right.”",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/queen-of-funk-works-hard-to-overcome-sonic-flaws-in-anniversary-concert-20250414-p5lrjg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Queen of Funk works hard to overcome sonic flaws in anniversary concert",
    "publish_date": "Wed, 23 Apr 2025 11:13:03 +1000",
    "category": "entertainment",
    "authors": [
      "Bernard Zuel"
    ],
    "text": "Still, given the night closed with Ain’t Nobody, not the best song in her repertoire but a perfect mix of slink, simplicity, groove and glee to send ’em home happy, there’s a sound engineer who might think he just about got away with this. MUSIC\n\nTOTO WITH CHRISTOPHER CROSS\n\nDarling Harbour Theatre, ICC, April 19\n\n★★★\n\nReviewed by James Jennings What to do when you’ve got, say, three songs that are bulletproof crowd-pleasers, yet you’ve been asked to perform a gig that lasts at least an hour or more? Toto in Sydney. Original member Steve Lukather, on guitar, still leads the band. Credit: Ashley Mar If you’re Christopher Cross, a man who could justifiably be credited with creating the genre known as yacht rock (smooth, adult-contemporary music of the late ’70s and early ’80s) thanks to his 1980 hit singles Sailing and Ride Like The Wind, you strategically spread them out to one killer track every half an hour. Arthur’s Theme (Best That You Can Do) completes Cross’s crowd-pleasing trifecta.\n\nThe rest of his set is wisely padded out with songs from his hit 1979 self-titled debut album, although a tune he refers to as a “deep cut” called Dreamers and a new song called You both sound good enough to prove he’s more than just a guy with a few 45-year-old hits. American pop-rock band Toto have a few better-known songs to their name, but the rule of three bulletproof crowd-pleasers applies to them, too. One of those, 1982’s Rosanna, is second cab off the rank and goes down as well as you’d expect, even if only one person on stage – guitarist and singer Steve Lukather – is an original Toto member. The seven band members are all masterful musicians, particularly new keyboardist and singer Dennis Atlas, who plays his instrument as if he’s been teleported straight from the ’80s, even though he’s the youngest by far at 27. Despite the skills on display, some sins are committed: several songs turn into extended jams (always more fun for players than audience; in that vein we also get solos on keyboard (two) and drum). There are a few decent songs along the way such as 99 and I’ll Supply the Love, but more that feel like a chore to get through. It all becomes a bit of an AM radio-friendly soup.\n\nThen, finally, bulletproof, crowd-pleasing redemption: 1978 pop-rock classic Hold the Line livens things up considerably, the perfect entree for Toto’s defining song, 1982’s Africa, which seems to have only increased in popularity as the decades have rolled on thanks to numerous remixes, covers and pop culture references. It’s a glorious note to go out on and makes up for a gig that could have done with a few more songs of the same calibre. MUSIC\n\nSYDNEY PHILHARMONIA CHOIRS\n\nSydney Opera House Concert Hall, April 17\n\n★★★½\n\nReviewed by Harriet Cunningham Sydney Philharmonia Choirs’ Vox and Chamber ensembles have come together with the Australian Romantic and Classical Orchestra (ARCO) to present Bach’s St Matthew Passion in the 1841 arrangement of the work by Felix Mendelssohn. St Matthew Passion: the choir responded to conductor Elizabeth Scott with impressive precision and energy. Credit: Keith Saunders\n\nIn the 300 or so years since Bach’s St Matthew Passion was first performed, it has undergone myriad transformations: there have been changes in instrumentation, pitch and structure and it has been staged as an opera and a ballet. Mendelssohn’s version, as recreated by ARCO’s team of specialists, is notable for its orchestration. In place of a largely improvised keyboard and viola da gamba continuo, we hear Mendelssohn’s written-out accompaniments for two cellos and bass. In place of the obsolete oboes da caccia, Mendelssohn writes for the new-fangled clarinet and basset horn. At times it feels like a revelation, a radically different palette of tone colours, bringing unfamiliar texture and suspense to the score. At others, it feels like an unfamiliar intrusion, especially when pitch goes awry between historic instruments and contemporary voices. The period interpretation also features romantic styles of rubato, which sound mannered to this modern ear. The Passion is a drama of many characters, some represented by singers, some by instruments. The choristers are particularly versatile, at one moment playing the mob, angry and ready to roar, and at another lulling us into contemplative wonder with a pianissimo chorale. It may be a small army of voices but it responds to conductor Elizabeth Scott with impressive precision and energy.\n\nScott has also assembled an excellent line-up of soloists: Andrew O’Connor plays many roles with consummate skill and Penelope Mills brings fine clarity to the soprano roles, while Emily Edmonds’ mezzo soprano voice is full of warmth. Concertmaster Rachael Beesley and flutist Melissa Farrow bring mellifluous virtuosity to their obligato accompaniments while Teddy Tahu Rhodes shines as a charismatic and eloquent Christus. Finally, the hero of the evening is Andrew Goodwin as the Evangelist, his voice reaching into the heavens with sublime ease. BLUES\n\nGary Clark Jr\n\nEnmore Theatre, April 17\n\n★★★½\n\nReviewed by Bernard Zuel The clue was in his entrance. Long, extravagantly lean and topped by a high, wide and handsomely white hat, Texan Gary Clark Jr ambled on like he was just passing through. He sang of suspicion and resistance: Gary Clark Jnr Credit: Ashley Mar\n\nIt was like purpose was at his disposal – like time was flexible, elastic even, and to be shaped not so much by will as by example. And it was. Even as the band began playing, a long, atmosphere-heavy introduction was measured in its tempo but deliberately vague in its intentions, all possibilities open. Then this moody, chugging blues emerged and Maktub took shape: decidedly north African in its desert airy expansiveness, it suggested both movement and stasis, with Clark’s slide guitar in long strides rather than stealthy steps. He sang of suspicion and resistance in the tone of someone wearied by the fight but not bent by it; he warned “just tell ’em, we’re coming” but cautioned “we gotta move in the same direction”, with the patience of someone who has been this way before. And so it went, always undulating rather than surging, for almost 10 minutes, time immaterial. And so it went for the rest of the night: as the hour mark ticked over, Clark and band had only just started on their seventh song. There would be only four more, including an encore, in a show of almost two hours. In that time-defying space, variety was not as pronounced as in his most recent albums, which have seen Clark expand his remit well beyond Texas blues. Still, you could hear echoes of Parliament/Funkadelic in the loose, odd, rhythmically insistent Alone Together, while the hands of Curtis Mayfield and D’Angelo – old soul and nu-soul - could be felt in R&B-driven numbers like the righteously moved Feed The Babies, the first time Clark’s falsetto emerged.\n\nOne of those predecessors would probably have encouraged Clark to shorten the too-long preamble to the set’s closer, Habits, which seemed a culmination of the noodling that crept in during the final stages of the night and served to speed the exit of some in the audience. But then the man might have responded by pointing out how the Catherine wheel of a solo which climaxed said noodling and the night all but washed away such thoughts – as if they, like time, didn’t matter. THEATRE\n\nSNAKEFACE\n\nBelvoir Street 25A, April 11\n\nReviewed by HARRIET CUNNINGHAM\n\n★★★★★\n\nAliyah Knight, playwright and performer, is already on stage as the audience files into Belvoir Street’s downstairs theatre and is still there when the lights go up. It feels like there is nowhere else to go. Just a scrim at the back (used to project text, sometimes readable, sometimes censored) and a block of stone – which turns out to be clay – centre stage. Music fills up the remaining space, enveloping and energising a young queer figure of colour as they spin, sway and groove.\n\nA coming-of-age story, a myth, a fever dream and a mystery: Snakeface is written and performed by Aliyah Knight. Credit: Abraham de Souza, Fruit Box Theatre Snakeface is many things: a coming-of-age story, a myth, a fever dream and a mystery. Its title references the murderous, snake-haired Medusa of Greek myth. Knight’s imagination transforms Medusa into a victim, made into a monster by sexual violence. This becomes a springboard into the mind and body of a woman whose transformation is anything but mythical. Loading There’s a gritty, joyful authenticity about much of Knight’s script, which captures the wide-eyed curiosity and liminal sensation of a life-hungry teenager. They watch two beads of sweat running down a naked man’s chest and wonder which wins the race; they catch eyes with a stranger in a bar and hallucinate with pleasure. There’s poetry in the prose of the young woman’s words, and it clashes with the ugly words jumping out from the poetry projected on the backdrop. Knight delivers it all with fluency, flipping from chatter to chant in a sustained monologue, which I would be fascinated to read.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-gain-after-bets-on-trade-deals-boost-wall-street-20250423-p5ltki.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX gains after bets on trade deals boost Wall Street",
    "publish_date": "Wed, 23 Apr 2025 11:01:28 +1000",
    "category": "finance",
    "authors": [
      "Gemma Grant"
    ],
    "text": "The Australian sharemarket has jumped this morning after US stocks rallied overnight, wiping out Monday’s plunge, amid bets that the White House will clinch crucial trade deals with America’s top economic partners as President Donald Trump said he “won’t play hardball” with China.\n\nThe S&P/ASX200 was up 125.70 points, or 1.6 per cent, to 7942.40 as of 10.40am AEST. All eleven industry sectors were trading in the green on the second day of this short trading week, led by energy, health and IT stocks. Following the long Easter weekend, the market will be closed again on Friday for Anzac Day.\n\nUS stocks rebounded overnight on hopes the trade war could de-escalate. Credit: Bloomberg\n\nThe Australian dollar was trading at US63.83¢ as of 10.20am AEST. The ASX finished flat on Tuesday, with falls in tech and energy stocks offset by rises in materials, financials and consumer staples.\n\nThe strong morning performance came as a degree of optimism emerged for a de-escalation in Trump’s trade war. The US president said this morning he will substantially lower his unprecedented 145 per cent tariffs on Chinese goods in recognition the bitter trade war between the world’s two largest economies cannot last.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/culture/music/it-s-a-clarion-call-bluesfest-boss-delivers-update-on-festival-s-future-20250423-p5ltlo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It’s a clarion call’: Bluesfest boss delivers update on festival’s future",
    "publish_date": "Wed, 23 Apr 2025 10:50:16 +1000",
    "category": "finance",
    "authors": [
      "Farid Farid"
    ],
    "text": "Byron Bay Bluesfest will return after all, bucking a global industry trend and despite its director’s claim that the 2025 edition was its last.\n\nMore than 40 music festivals across Australia have been cancelled since 2022 after the COVID-19 pandemic decimated the live music sector.\n\nChristone “Kingfish” Ingram, one of the headliners at the 2025 Bluesfest, in action in Byron Bay. Credit: Edwina Pickles\n\nBluesfest appeared set to join the list when it announced its artist line-up in August, with bombastic festival director Peter Noble declaring the 2025 event would be the “last ever”.\n\nThat announcement proved marketing gold, with 97 per cent of tickets snapped up – and Saturday entry sold out – before gates opened on Thursday afternoon.",
    "source": "SMH",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/australian-cricket-mourns-death-of-former-test-opener-keith-stackpole-20250423-p5lto1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘He had that aura’: Australian cricket mourns death of former Test opener Keith Stackpole",
    "publish_date": "Wed, 23 Apr 2025 10:47:54 +1000",
    "category": "sports",
    "authors": [
      "Andrew Wu",
      "Jon Pierik"
    ],
    "text": "Australian cricket is mourning the death of former Test opener Keith Stackpole, who died on Tuesday at the age of 84.\n\nStackpole was an aggressive opening batter who was an important member of the Australian sides captained by Bill Lawry and Ian Chappell from 1966-74.\n\nKeith Stackpole in action against New Zealand in 1974, when he was Australian vice captain. Credit: Fairfax Media\n\nPicked initially as a middle-order batter who could bowl leg-spin, Stackpole flourished after being moved to the top of the order by close friend and Victoria teammate Lawry for the Sydney Test against the West Indies in the 1968-69 series.\n\nTogether, the pair, with vastly different styles, became one of the finest opening combinations Australia had seen. Stackpole’s hard hitting and love of the hook shot - his feature shot - was in contrast to Lawry’s more sedate game.",
    "source": "SMH",
    "cluster_id": 7
  },
  {
    "url": "https://www.smh.com.au/national/victoria/get-your-gotcha-moment-somewhere-else-man-rebuked-at-kooyong-forum-20250423-p5lto2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Get your gotcha moment somewhere else': man rebuked at Kooyong forum",
    "publish_date": "Wed, 23 Apr 2025 10:35:01 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Get your gotcha moment somewhere else': man rebuked at Kooyong forum\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/national/coalition-reveals-extra-21-billion-defence-spending-boost-20250423-p5lto0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Coalition reveals extra $21 billion defence spending boost",
    "publish_date": "Wed, 23 Apr 2025 10:34:07 +1000",
    "category": "finance",
    "authors": [],
    "text": "Coalition reveals extra $21 billion defence spending boost\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.smh.com.au/national/victoria/television-ad-for-the-military-from-2016-of-david-finney-20250423-p5ltnw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Television ad for the military from 2016 of David Finney",
    "publish_date": "Wed, 23 Apr 2025 10:28:44 +1000",
    "category": "finance",
    "authors": [],
    "text": "Television ad for the military from 2016 of David Finney\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/article/here-is-why-the-imf-is-slashing-the-economic-growth-forecast-for-australia/jxf506qa7",
    "title": "Why the IMF is slashing Australia's economic growth forecast",
    "publish_date": "Wed, 23 Apr 2025 01:31:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's growth outlook has taken a severe cut in a dire assessment of the global economy by the International Monetary Fund (IMF).\n\n\n\n\n\nIn its World Economic Outlook for April, the United Nations' financial agency said economic uncertainty has surged to unprecedented levels as a result of United States President Donald Trump's upheaval of global trade.\n\n\n\n\n\nAustralia's economic growth projection for 2025 was downgraded to 1.6 per cent from 2.1 per cent in January.\n\n\n\n\n\nBut the 0.5 percentage point trim is not as bad as the hit to the projection for US growth, which was cut from 2.7 per cent to 1.8 per cent.\n\n\n\n\n\nGlobal growth is also expected to be 0.5 percentage points lower at 2.8 per cent.\n\n\n\nImpact of US tariffs on global markets\n\n\"Major policy shifts are resetting the global trade system and giving rise to uncertainty that is once again testing the resilience of the global economy,\" the IMF said in the document.\n\n\n\n\n\nDespite equity markets suffering a correction since Trump's tariff announcement on 2 April, US stocks potentially had further to fall, given price-to-earnings ratios remain at historical highs, the IMF said.\n\n\n\n\n\nTariffs will dominate meetings between global financial leaders gathering at the IMF and World Bank meetings in Washington this week.\n\n\n\n\n\nFinance ministers from around the globe will be eagerly seeking meetings with Trump's lead tariffs negotiator, treasury secretary Scott Bessent, to strike a tariff exemption deal.\n\n\n\nBut a notable absentee will be Australia's Treasurer Jim Chalmers, who is tied up campaigning for the federal election .\n\n\n\n\n\nChalmers said Australians would be worse off and more vulnerable to global economic uncertainty if Opposition leader Peter Dutton won the election on 3 May.\n\n\n\n\n\n\"At a time of extreme global uncertainty, our responsible approach to economic management has never been more important,\" he said.\n\n\n\n\n\n\"We're not immune from the turmoil in the global economy but the progress we've made together puts us in good stead.\"\n\n\n\n\n\nAustralian GDP growth is expected to pick up to 2.1 per cent in 2026, from 2.2 per cent projected in January.\n\n\n\nREAD MORE Coalition pledges to increase Australia’s defence spend to 3 per cent of GDP\n\nInflation is projected to come in 0.8 percentage points lower this year than previously forecast, at 2.5 per cent, before accelerating strongly to 3.5 per cent in 2026.\n\n\n\n\n\nIn its Global Financial Stability report, also released on Tuesday, the IMF warned stretched asset valuations and highly leveraged financial markets could amplify shocks and exacerbate economic downturns.\n\n\n\n\n\nFinancial authorities should be ready to intervene to address severe liquidity or market function stress, the IMF cautioned.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/donald-trump-has-no-plans-to-fire-federal-reserves-jerome-powell/5hhl5anuz",
    "title": "Donald Trump has no plans to fire Federal Reserve's Jerome Powell",
    "publish_date": "Wed, 23 Apr 2025 01:01:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "United States President Donald Trump has said he has \"no intention of firing\" Federal Reserve chair Jerome Powell, but wants interest rates to be lower.\n\n\n\n\n\n\"I would like to see him be a little more active in terms of his idea to lower interest rates,\" Trump told reporters in the Oval Office on Tuesday.\n\n\n\n\n\nIt's a reversal from recent remarks Trump made about Powell , including a declaration last week that \"if I want him out of there, he'll be out real fast,\" and a social media post branding Powell a \"major loser\".\n\n\n\n\n\nTrump repeatedly complained the Fed was not cutting interest rates quickly enough.\n\n\n\nREAD MORE US dollar plunges after Donald Trump attacks Federal Reserve boss\n\nWhat does the Federal Reserve do?\n\nThe Federal Reserve is in charge of maximising and maintaining stable inflation.\n\n\n\n\n\nThe Federal Reserve has been holding off on further rate cuts as inflation has stayed stubbornly above the Fed's target rate of 2 per cent per year.\n\n\n\n\n\nIn response to post-pandemic inflation, it raised interest rates to help cool down rising prices, later initiating a series of rate cuts as inflation eased and the US job market stayed strong.\n\n\n\nREAD MORE How can trillions just disappear? What you may not know about the stock market\n\nHow does Trump's opinion of Powell affect the US stock market?\n\nTrump's clarification on Powell brought a measure of stability to financial markets, which had reacted with alarm to the prospect of political interference at the Fed.\n\n\n\n\n\nThe S&P 500 rose 2.5 per cent, and the Nasdaq climbed 2.7 per cent on Tuesday, lifted by Trump's comments and growing optimism about a potential easing of tensions in the US-China trade war.\n\n\n\n\n\nTrump has long argued the Fed should cut rates to stimulate growth and offset the impact of his tariffs, which have introduced inflationary pressures and disrupted international trade.\n\n\n\n\n\nPowell, meanwhile, has warned against slashing rates too quickly, citing the need to maintain inflation expectations and preserve policy credibility.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/sparks-fly-in-third-leaders-debate/ajnov4ibx",
    "title": "Sparks fly in third leaders' debate",
    "publish_date": "Tue, 22 Apr 2025 20:52:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPrime Minister Anthony Albanese and Opposition leader Peter Dutton have butted heads for their third and penultimate leaders debate, hosted by Channel Nine.\n\n\n\n\n\nAfter a political truce from the leaders during the day as they paid their respects to Pope Francis, both began by reiterating their condolences.\n\n\n\n\n\nOpposition leader Peter Dutton won the coin toss and opened the debate, starting by repeating the coalition's mantra that Australians are not better off than they were three years ago.\n\n\n\n\n\n“Over the course of last three years, people have gone through the biggest drop in living standards in any other country compared to any other country in the world, we need to make sure that we can get our country back on track that we can help manage the economy”\n\n\n\n\n\nPrime Minister Anthony Albanese instead looking to the future.\n\n\n\n\n\n“Labor's plan is to build Australia's future, to build your family's future. We have immediate support through cost of living assistance, whilst making sure that we invest in the future.”\n\n\n\n\n\nThe latest Roy Morgan survey suggests Labor would be returned to government with an increased majority of 55.5 per cent on a two-party preferred basis, if the election was held today.\n\n\n\n\n\nThis compares to the Coalition on 44.5 per cent.\n\n\n\n\n\nPeter Dutton blamed the coalition's sliding polls on Labor, who he says have spent the campaign slinging mud.\n\n\n\n\n\n“Well, Ally, the Labor Party spent $20 million throwing mud and negative ads, and that has an impact, and I get that but for a lot of Australian families over the course of the next few days they're going to have to make a decision about what's in their best interest and what's in our country's best interest.”\n\n\n\n\n\nWith host Ally Langdon encouraging the pair to avoid using their time repeating familiar talking points, both leaders were asked to nominate the \"biggest lie\" the other has told about them and given the chance to refute it.\n\n\n\n\n\nDespite being asked for just one, Peter Dutton couldn't help but offer more.\n\n\n\n\n\n“Just one? Geez Charles. Making it hard. The $600 billion figure comes from a company that is a donor to the Labor party, full of donors, Labor staffers. Discredited, and it is at odds with a hundred and twenty billion dollar figure for the construction of nuclear power sites, which is the CSIRO figure. In relation to Medicare, the whole Medicare scare campaign which has been going on at subsequent elections for a long period of time. The fact is that bulk building has plummeted under this Prime Minister, people can't afford to go to the doctors because the out of pocket expense now is about $43 per person when you going to the doctor.”\n\n\n\n\n\nBut Anthony Albanese says it's Mr Dutton who has the numbers wrong.\n\n\n\n\n\n“Medicare is at the centre of this campaign, and we will strengthen Medicare. Peter uses a figure about about bulk billing that takes into account the fact that Australians had to get COVID shots during the pandemic, and that boosted artificially the numbers. But the truth is, bulk billing was in free fall because the incoming Liberal government, the last time they won ripped $50 billion out of the hospital system. This Minister, when Peter was the health minister, tried to introduce the GP tax, which would have abolished bulk billing, all together, and when he couldn't do that, what happened was that there was a six year freeze on the Medicare rebate which sent off billing into a free fall.”\n\n\n\n\n\nThe pair went on for a while about the numbers, before things turned a little more personal.\n\n\n\n\n\n“ALBANESE: In the budget, prior to you coming to office, you ripped $80 billion out of those two items in 2014.\"\n\n\n\n\n\nDUTTON: \"Prime Minister, you couldn't lie straight in bed. Honestly, this is unbelievable.\"\n\n\n\n\n\nALBANESE:\" Well, you can go to abuse. You can go to personal abuse. that's a sign of desperation.\"\n\n\n\n\n\nDUTTON: \"Well as is lying\"\n\n\n\n\n\nALBANESE: \"That's a sign of desperation, go to the 2014 budget papers. People can do that online. It's all available for all to see”\n\n\n\n\n\nWith their biggest clash of the night out of the way early on, the pair moved to some of the biggest talking points of the campaign so far.\n\n\n\n\n\nOn housing, Peter Dutton says the coalition has no plans to make any changes to negative gearing or capital gains tax.\n\n\n\n\n\n“I want to make sure that we can have the tax settings in place so that we can encourage investment, because young Australians have to rent for a period of time until they can afford to get into their own home and if we don't have investors in the market, then we don't have that rental accommodation and we reduce the stock of housing.”\n\n\n\n\n\nThe Prime Minister says his government is focusing on supply.\n\n\n\n\n\n“What we are concentrating on is supply. We won't be making the changes that you suggest because we're concerned that it would have a negative impact on supply and would push up rents. That is why we are not making those changes, and we haven't done so. But this idea that the housing crisis has occurred over the last two years is just a nonsense, just a nonsense, and everyone out there knows that it's the case and they didn't even bother to have a Housing Minister for half of the time that they were in government.”\n\n\n\n\n\nOn the cost of living, Mr Albanese says that while he knows people are doing it tough, Labor is offering real relief.\n\n\n\n\n\n“We understand that many people are doing it tough, which is why we've provided significant cost of living relief but we've had to do it in a way that put that downward pressure on inflation. As a result, inflation as a two in front of it 2.4 But at the same time, we've created a million jobs.”\n\n\n\n\n\nPeter Dutton says the government has squandered a commodities windfall and rising interest rates are a home-grown problem of the government's making.\n\n\n\n\n\nThe cuts the Coalition would rely upon to pay for policies are still under wraps.\n\n\n\n\n\nMr Dutton says the coalition's plan to cut fuel costs will deliver relief to every Australian.\n\n\n\n\n\n“It goes across the economy. So it's not just for families who are doing it tough. Pensioners are really doing it tough because they've got fixed incomes and rising costs under this government. Electricity is up by thirty two percent. Gas is up by thirty four percent and for those pensioners and self funded retirees, for small businesses as well, they benefit. So whether petrol is at two dollar a litre or a dollar fifty a litre, it will always be 25 cents cheaper under us.”\n\n\n\n\n\nWhen asked what the biggest risk to Australia is right now, Mr Albanese took the opportunity to revisit one of Mr Dutton's less flattering moments.\n\n\n\n\n\n“Complacency and the uncertain world that we inherit, In an uncertain times it's the last, last time where you'd want to take a risk. Peter spoke about his long experience, and that's true, but that's the problem. Every pacific leader remembers him joking about water lapping at their doors. For the Pacific Island neighbours. It's not a joke, climate change, it's something that is the entry fee to credibility in our region.”\n\n\n\n\n\nIn the end, the panel of Nine journalists delivered their verdict, and Peter Dutton has won 2-1.\n\n\n\n\n\nThis debate coincided with the opening of early voting across the country, with time running out for leaders to convince voters of their policies.\n\n\n\n\n\nBy midday, the Australian Electoral Commission reported 230,000 Australians had already cast their vote.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/anthony-albanese-and-peter-dutton-have-third-leaders-debate-morning-news-bulletin-23-a-2025/ylx28cxox",
    "title": "Anthony Albanese and Peter Dutton have third leaders debate |Morning News Bulletin 23 April 2025",
    "publish_date": "Tue, 22 Apr 2025 20:46:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nAnthony Albanese and Peter Dutton go head to head for the third leaders debate\n\nA date set for Pope Francis' funeral\n\nA freak accident forces Moroccan surfer Ramzi Bouhkhiam out of the Rip Curl Pro\n\nPrime Minister Anthony Albanese and Opposition leader Peter Dutton have faced each other in the third leaders' debate, hosted by Channel Nine.\n\n\n\n\n\nAfter a political truce from the leaders during the day as they paid their respects to Pope Francis, both began by extending their condolences.\n\n\n\n\n\nWhile the debate was generally light on policy, the more unusual questions homed in on the two leaders' character.\n\n\n\n\n\nIt wasn't long however before the debate took a personal turn, with Peter Dutton accusing the Prime Minister of dishonesty.\n\n\n\n\n\n\"In the budget, prior to you coming to office, you ripped $80 billion out of those two items in 2014.\"\n\n\n\n\n\nDutton: \"Prime Minister, you couldn't lie straight in bed. Honestly, this is unbelievable.\"\n\n\n\n\n\nAlbanese: \"Well, you can go to abuse. You can go to personal abuse. that's a sign of desperation.\"\n\n\n\n\n\nDutton: \"Well as is lying\"\n\n\n\n\n\nAlbanese: \"That's a sign of desperation, go to the 2014 budget papers. People can do that online. It's all available for all to see\"\n\n\n\n\n\nWith less than two weeks until voters make their final decision on May 3, Tuesday's debate was one of the last opportunities for the leaders to win over undecided Australians.\n\n\n\n\n\nThe esteemed panel of Nine journalists delivered their verdict, declaring Peter Dutton the winner 2-1.\n\n\n\n\n\nCoalition has made an election pledge to spend $21 billion over the next five years on defence, which would take its share of Australia's gross domestic product to 2.5 per cent.\n\n\n\n\n\nOpposition Peter Dutton says if his party is elected, the level of defence spending - as a percentage of Australia's economy - would then rise further to three per cent within the decade.\n\n\n\n\n\nWhile the Coalition said it would use the money to reinstate a fourth joint strike fighter squadron, it did not say where else the funding would go.\n\n\n\n\n\nMr Dutton says the extra spending on defence was needed in uncertain times globally.\n\n\n\n\n\nLocal security sources say at least 28 people are feared killed, after suspected militants opened fire on tourists in Indian-administered Kashmir.\n\n\n\n\n\nThe attack occurred in Pahalgam, a popular holiday destination in the scenic mountainous region where mass tourism, especially during the summer months, has resurged as Islamist militant violence has eased in recent years.\n\n\n\n\n\nIt's the worst attack in the region on civilians for years.\n\n\n\n\n\nThe Vatican has announced that the funeral for Pope Francis will take place on April 26 at St Peter's Basilica.\n\n\n\n\n\nIn a break from tradition, Pope Francis has elected to be buried in Rome's Basilica of Saint Mary Major, and not St Peter's Basilica.\n\n\n\n\n\nCardinals of the Catholic Church will gather to select the next pontiff, but no clear frontrunner has emerged yet.\n\n\n\n\n\nBritish Cardinal Timothy Ratcliffe says he trusts the process.\n\n\n\n\n\n\"I think that we always open ourselves to be surprised. All recent popes have been quite different from each other. And often we think, will the pope in fact continue the legacy of the previous one? But we trust that the bishop of Rome, whom we need now, will be given us. And we may be surprised.\"\n\n\n\n\n\nTreasurer Jim Chalmers says a revised growth forecast for the global economy shows \"trade tensions are weighing heavily on the global outlook and putting upward pressure on inflation around the world\".\n\n\n\n\n\nThe International Monetary Fund now forecasts global growth at 2.8 percent for 2025, a sharp 0.5 percentage points reduction from its January estimate, with a further slowdown to 3 percent projected for 2026.\n\n\n\n\n\nIMF chief economist Pierre-Olivier Gourinchas says the revised forecast is due to escalating trade conflicts and heightened policy uncertainty.\n\n\n\n\n\n\"The surge in policy uncertainty is a major driver of the economic outlook. If sustained, the increase in trade tensions and uncertainty will slow global growth significantly. Reflecting this complexity, our report presents a reference forecast which incorporates policy announcements up to April 4th by the US and trading partners.\"\n\n\n\n\n\nIn a statement, Dr Chalmers says the election provides voters with a choice on the major party's approaches to managing the \"turmoil in the global economy\".\n\n\n\n\n\nPre-polling booths are opening across the country and with more than half of the electorate expected to vote this way, voters in parts of the Tiwi Islands have cast their ballots.\n\n\n\n\n\nVoting services visited the small community of Pirlangimpi yesterday offering voters their only chance to cast a ballot in person.\n\n\n\n\n\nThe community sits within the marginal seat of Lingiari, which Labor currently holds, but opposition leader Peter Dutton is hoping to flip.\n\n\n\n\n\nThis voter told NITV what he is hoping to see from whoever wins government.\n\n\n\n\n\n\" Hopefully the government will, you know, change their mind and bring some money to the Tiwi Islands, and like I said, the roads, housing - we're living in an overcrowded house. Move those COVID containers, so that way when there's COVID we get to spend more times at our homeland rather than in that community.\"\n\n\n\n\n\nTo surfing now...\n\n\n\n\n\nA freak accident at Bells Beach has forced Moroccan surfer Ramzi Boukhiam out of the Rip Curl Pro with a serious-looking knee injury.\n\n\n\n\n\nBoukhiam did not surf his elimination-round heat after the accident, knocking him out of the competition.\n\n\n\n\n\nThe 31-year-old had finished his opening-round heat earlier on Tuesday and was nearly on the beach when his foot was apparently caught in the reef close to the shoreline.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/petrol-prices-at-20-year-low/yy0j80euo",
    "title": "Petrol prices at 20 year low",
    "publish_date": "Tue, 22 Apr 2025 07:57:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "And you can find more On the Money podcasts by subscribing to On the Money\n\n, or wherever you get your podcasts.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/article/us-dollar-plunges-after-donald-trump-attacks-federal-reserve-boss/uoirt4lec",
    "title": "US dollar plunges after Donald Trump attacks Federal Reserve boss",
    "publish_date": "Tue, 22 Apr 2025 07:44:39 +0000",
    "category": "finance",
    "authors": [],
    "text": "The dollar languished near its lowest level in three years on Tuesday as President Donald Trump's attacks on the Federal Reserve chairman eroded investor confidence in the US economy.\n\n\n\n\n\nThe US currency sagged close to the decade-low reached the previous day against the Swiss franc, and hovered near a three-and-a-half trough versus the euro.\n\n\n\n\n\nTrump ramped up his criticism of Federal Reserve chief Jerome Powell on Monday in a Truth Social post, calling him a \"major loser\" and demanding that he lower interest rates \"NOW\" or risk an economic slowdown.\n\n\n\n\n\nThe Federal Reserve, after a series of rate cuts late last year, has left its benchmark policy rate on hold in the range of 4.25 per cent to 4.50 per cent since December.\n\n\n\nOn Friday, White House economic adviser Kevin Hassett said the president and his team were continuing to study whether they could sack Powell, a day after Trump said Powell's termination \"cannot come fast enough\".\n\n\n\n\n\nThere is no direct legal precedent, since no president has ever tried to fire a Federal Reserve Chief.\n\n\n\n\n\nTrump's onslaught comes after Powell said last week the central bank can afford to be patient in judging how to set policy, and that rates should not be lowered until it is clearer US tariff plans won't stoke persistently higher inflation.\n\n\n\n\n\nTrump's tariffs have rocked financial markets in recent weeks and also remain a big concern for investors.\n\n\n\nUS President Donald Trump has ramped up his criticism of Federal Reserve boss Jerome Powell. Source: AAP / Tom Williams/CQ-Roll Call/Sipa USA \"There's this terrible stalemate between Trump and Powell, fomenting concern that there will be some sort of action taken to replace Powell, which would create a real panic in the dollar,\" said Eric Kuby, chief investment officer at North Star Investment Management.\n\n\n\n\n\nMoreover, on the trade front, \"every day that there are no deals struck to provide any relief, it creates continued anxiety\" that Trump's policies in their current form could be destructive for the economy, Kuby said.\n\n\n\nOn Monday, China accused Washington of abusing tariffs and warned countries against striking a broader economic deal with the United States at its expense, ratcheting up its rhetoric in a spiralling trade war between the world's two biggest economies.\n\n\n\n\n\n\"The longer the speculation about the independence of US monetary policy continues, the longer the USD is at risk of falling,\" said Joseph Capurso, head of international and sustainable economics at Commonwealth Bank of Australia.\n\n\n\n\n\n\"It may take another sell‑off in the US government bond market or U.S. equity market to encourage President Trump to refrain from such comments.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/meet-the-aussie-twins-taking-the-internet-by-storm-for-speaking-in-unison/h2mfva4f0",
    "title": "'We don’t notice it': Meet the Aussie twins taking the internet by storm for speaking in unison",
    "publish_date": "Tue, 22 Apr 2025 07:32:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Queensland twin sisters Bridgette and Paula Powers have tried not to speak in unison, but they say it's impossible.\n\n\n\n\n\n\"You know it's hard,\" Bridgette told SBS News on the phone, with her sister occasionally answering in the background throughout the interview.\n\n\n\n\n\n\"We don't notice it ourselves when we're getting interviewed.\"\n\n\n\n\n\nThe pair's unique trait has garnered new attention after a video of the sisters being interviewed by a news crew on the Sunshine Coast went viral around the world.\n\n\n\nThe 51-year-old twins were recounting their distress as witnesses to a collision involving a carjacked vehicle on Monday. Speaking in unison while wearing identical clothing, they described how their mother went to help a man with blood all over his face only to be threatened by the gun-toting man.\n\n\n\n\n\n\"One guy, he was up there with our mum. He went up there and he was coming back down toward us,\" one said, as the other finished her sister's sentences.\n\n\n\n\n\n\"And he goes 'run, he's got a gun!'\" the sisters said at the same time.\n\n\n\n\n\nThe video has been described as one of \"the greatest news interviews of all time\" by media figures, while others were stunned at the unique characteristic trait: \"This can't be real, right?\".\n\n\n\nTwin sisters Bridgette and Paula Powers rescue and rehabilitate water birds and seabirds at their sanctuary in Queensland. Credit: Facebook/Twinnies Rescue But not everyone has been gracious.\n\n\n\n\n\nBridgette told SBS News the pair, known as the 'Twinnies' first became aware that their interview had gone viral after they saw people talking about it online.\n\n\n\n\n\n\"There is a lot of negative comments on Facebook ... because some people are saying, 'It's fake. How can you rehearse a conversation?'\n\n\n\n\n\n\"You can't. It's us, and we've tied not to talk together, and it's impossible.\"\n\n\n\n\n\nThis is not the first time the sisters have gained global attention for their unique ability. In 2016, the sisters did an interview with British TV, with former Good Morning Britain presenter Piers Morgan saying: \"It is one of the greatest interviews I have ever conducted in my life.\"\n\n\n\n\n\nAsked how they were able to speak together at the same time, the sisters said in unison: \"It comes automatically.\n\n\n\n\n\n\"We don't know how it happens. Some people say, 'Do you rehearse a conversation?', and we said: 'no, how can you rehearse a conversation?'\"\n\n\n\nREAD MORE These birds could be extinct in 20 years. Meet the people fighting to change that\n\nThe pair has run the Twinnies Pelican and Seabird Rescue in Landsborough for the past 25 years, rehabilitating seabirds and pelicans who've been injured in the wild.\n\n\n\n\n\nTwo years ago they were at risk of losing the sanctuary until a businessman made a generous donation to keep it going.\n\n\n\n\n\nBridgette says they're hoping the video will raise awareness of their cause.\n\n\n\n\n\n\"It would be great. Yeah, because all wildlife need to be saved,\" she said.\n\n\n\n\n\n\"We won't give it up, until we can't. No, no, we're just hoping we can continue our work ... for a while.\"\n\n\n\n\n\nShe said the negative comments that they've received over the years about their ability to speak together don't worry them.\n\n\n\n\n\n\"We used to worry, but we don't worry no more. We just giggle at them.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/article/albanese-dutton-face-different-australia-pollsters-say/k5uppqikw",
    "title": "Peter Dutton's 'only solution' for poll turnaround, as leaders face a 'very different' Australia",
    "publish_date": "Tue, 22 Apr 2025 06:58:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Anthony Albanese is ahead in a low-approval federal election campaign, according to pollsters, who say Peter Dutton must sharpen his focus on the cost of living and win over younger voters if the Coalition hopes to form government.\n\n\n\n\n\nMillions of Australians are expected to vote early ahead of the 3 May election, narrowing the field of undecided voters every day.\n\n\n\n\n\nWith less than two weeks to go, pollsters say their research indicates many voters are drifting away from the two major parties do not rate the prime minister or Opposition leader highly.\n\n\n\nApproval ratings are down\n\nJessica Elgood, director at market research company Ipsos Australia, told the National Press Club on Tuesday that Australians don't view either candidate as a \"great\" politician, but that Dutton's popularity is especially dire.\n\n\n\n\n\n\"We see that Peter Dutton's approval rating is sitting at 27 per cent. Clearly, our relationship with politicians has changed over the decades, but it's the lowest approval rating we have measured for an Opposition leader this century,\" Elgood said on Tuesday.\n\n\n\n\n\nShe said a quarter of those surveyed don't have an opinion on Dutton's performance, while 30 per cent would prefer him as prime minister.\n\n\n\nREAD MORE The voters who could see more misinformation this election\n\nAlbanese's ratings were not much higher than those of Dutton.\n\n\n\n\n\n\"At the end of his first term, only a third of the country thinks he's [Albanese] on the right track,\" Elgood said. \"Forty-two per cent think Labor has done a poor job and someone else should have a go.\"\n\n\n\n\n\nA recent Newspoll, published in The Australian newspaper on Monday, showed a lift in Labor's primary vote to 34 per cent, with the Coalition on 35 per cent.\n\n\n\n\n\nOn a two-party preferred basis, Labor is at 52 per cent, ahead of the coalition's 48 per cent.\n\n\n\n\n\nDutton was favoured as preferred leader in areas such as defence and the economy, but Albanese was preferred on the electorate's dominant concern, the cost of living, along with housing and health.\n\n\n\nSupport for a majority government is 'really weak'\n\nElgood said that back-to-back Easter and Anzac Day public holidays could mean voters take leave from work and disengage from the election campaigns, which could make it harder for candidates to get their messages across to the public.\n\n\n\n\n\n\"I don't feel that the electorate are particularly switched on with the campaign. Also, the government's ability in getting its message out there is not particularly compelling,\" she said.\n\n\n\n\n\nShaun Ratcliff, a political scientist from research firm Accent Research, said voters are also moving away from the two major parties, with support for a majority government \"really weak\".\n\n\n\nLISTEN TO Party Time: The Players SBS News 10/04/2025 29:05 Play\n\nThis could result in more people turning towards the Greens and independents, Ratcliff said.\n\n\n\n\n\n\"Only 56 per cent of voters actually think that a majority Labor or Coalition government is better for Australia than some other alternative,\" he told the National Press Club.\n\n\n\n\n\n\"Forty-four per cent believe that some kind of minority government would actually be better for the country. And this is a real generational divide.\"\n\n\n\nMoving away from the major parties\n\nA large share of \"important demographics\" would prefer a minority government, where neither Labour nor the Coalition would hold the balance of power, Ratcliff said.\n\n\n\n\n\n\"Sixty per cent of those aged 18 to 34 think a minority government would be better for Australia. As do 58 per cent of those aged 35 to 49,\" he said.\n\n\n\n\n\n\"Fifty-nine per cent of those in a great deal of financial stress believe a minority government would be better for Australia, and 62 of renters.\"\n\n\n\n\n\nThese groups are \"actively seeking an alternative\".\n\n\n\n\n\n\"They're driving the fragmentation of the Australian political system and pushing us towards minority government,\" he said.\n\n\n\nREAD MORE What if no one wins? What to know about minority government\n\nKos Samaras, director at the political consultancy firm Redbridge, said the Coalition needs to change tactics if it wants to see an improvement in the polls.\n\n\n\n\n\n\"We're dealing with a very different Australia,\" Samaras said. \"And I think the only solution for the Coalition if they're to turn the polls around in the next two weeks, is to pivot and find a way to talk to those younger voters that they're losing to their flank.\"\n\n\n\n\n\nSamaras said RedBridge's research suggested both Labor and the Coalition were losing gen Z and millennial voters to minor parties, but the Coalition in particular was struggling to win them back.\n\n\n\nGreens winning among younger voters\n\nSamaras said: \"Within gen Z, our most recent analysis, where we're just surveying Liberal versus Labor contests — the Greens primary is the highest at 33 per cent. Higher than Labor, higher than the Liberal Party.\"\n\n\n\n\n\nHe said focusing more on outer suburban home buyers and tax reforms could help the Coalition \"turn some of those polls around\".\n\n\n\nElgood said the cost of living remains the main issue for voters this election, which could be an opening for Dutton.\n\n\n\n\n\n\"The Liberals need to do more to convince voters they can meaningfully impact the cost of living crisis, and that Peter Dutton can deliver that stability they lack from Albanese,\" she said.\n\n\n\n\n\n\"There's only a short amount of time available, and they need to do something slightly more risky.\"\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/pope-francis-vision-for-a-modern-multicultural-church/i8oeopm24",
    "title": "Pope Francis' vision for a modern multicultural church",
    "publish_date": "Tue, 22 Apr 2025 04:24:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPalestinian Catholics in Gaza chanting at a ceremony in honour of Pope Francis.\n\n\n\n\n\n\n\nThe sounds of worship and mourning in a Catholic parish in Gaza following the passing of Pope Francis.\n\n\n\n\n\nDubbed the \"pope of the people\", he was lauded for his simplicity, humility and compassion for many of the world's most vulnerable communities.\n\n\n\n\n\n\n\nWhen he was elected as head of the Roman Catholic Church in 2012, Francis, born in Buenos Aires s as Jorge Mario Bergoglio was the first non-European pope in nearly 13 centuries.\n\n\n\n\n\nAs pope, he transformed the way the church viewed the role of women, how it treated the L-G-B-T-I-Q+ community and how it responded to events such as the climate crisis and international conflicts.\n\n\n\n\n\nBut perhaps the pontiff's most lasting impact on the Catholic tradition has been his concerted effort to shift the Church away from its Eurocentric roots to better reflect the diverse, global face of Catholicism.\n\n\n\n\n\n“I am pleased to be here in the midst of this Christian community that clearly manifests its 'Catholic' face: a universal face, a church made up of people from various parts of the world who come together to profess our one faith in Christ. This is the strength of the Christian community. Let us seek to be guardians and builders of unity!”\n\n\n\n\n\nOne of the ways Francis sought to build this cross cultural unity was through his many visits abroad, such as this historic visit to Timor-Leste last Septembe.\n\n\n\n\n\nWhile it may not have seemed like an obvious destination for the pope to some, Timor-Leste has the highest proportion of Catholics outside of the Vatican, at 97 per cent of the population.\n\n\n\n\n\nThe three-day visit drew estimated crowds of 600,000, considered the biggest event since the country gained independence from Indonesia in 2002.\n\n\n\n\n\nTimor-Leste's President Jose Ramos-Horta makes it clear how much the faith leader meant to his country.\n\n\n\n\n\n\"I just received information that Papa Francisco has passed away a few minutes ago. Not only we the Catholic Church, all religions and all humanity have suffered a tremendous loss. We all remember the Pope's Visit to Timor Leste last September, before boarding the plane to return to Rome, while holding my hand for the last time and telling me, 'please pay close attention to this beloved people.\"\n\n\n\n\n\nPope Francis also understood the need for flexibility in how Catholic liturgy was disseminated to different cultural communities across the world.\n\n\n\n\n\nIn November 2024, Francis approved liturgical adaptations to the needs and circumstances of indigenous communities in southern Mexico, the Amazon Australia’s Aboriginal communities in the Diocese of Broome.\n\n\n\n\n\nThe pope's awareness that the future of the Catholic Church may lay outside of its European origin point was also reflected in his choices for cardinal appointments.\n\n\n\n\n\nFor many centuries, most Catholic cardinals were Italian, a norm that had begun to be broken down by Pope Paul VI in the 1960s and accelerated by Polish Pope John Paul II, who was the first non-Italian pope in 455 years.\n\n\n\n\n\nFrancis appointed more than 20 cardinals from countries that had never previously had a cardinal, nearly all of them from developing countries such as Rwanda, Bangladesh, Cape Verde, Tonga, Myanmar, Mongolia and South Sudan, or countries with very few Catholics such as Sweden.\n\n\n\n\n\nIn South Sudan, worshipper and activist Jacob Chol says his community is mourning an advocate of peace in Sudan and South Sudan.\n\n\n\n\n\n\"Today is very sad news for all of us in South Sudan and in Sudan, that we lost our great hero who actually worked for peace for this country. We remember when our leaders went to Rome, when he went and kissed their feet. We tell them a message, which is actually very, very important, that I want you guys, when you go back home, make sure those who are left behind, let them be the fruits of this country. Because he really urged our leaders in the country that we have peace.\"\n\n\n\n\n\nWhen electing cardinals, he repeatedly overlooked vacancies in major European cities that traditionally had cardinals, often looking to where he believed the Church had more potential to grow in comparison to the mostly stagnant West.\n\n\n\n\n\nThis includes three cardinals appointed in the Philippines, which has Asia's largest Catholic population.\n\n\n\n\n\nFilipino Cardinal Luis Antonio Tagle, one of Francis's likely successors, would be the first pope from Asia if elected as a result of the conclave.\n\n\n\n\n\n\"Being a small minority doesn't mean the church is dead. We believe that Jesus is alive, and he was born, and he ministered, and he rose from the dead in Asia.\"\n\n\n\n\n\nIn the final years of his life Pope Francis's advocacy for Christians across the world was seen in his calls for peace in Ukraine and his special attention to Palestinian Christians suffering in Gaza.\n\n\n\n\n\nSome of the world's oldest churches have been destroyed by Israel's devastating bombardment of the territory amid their war with Hamas.\n\n\n\n\n\nParish priest of Gaza's Catholic Church, father Gabriel Romanelli, praised the late pope for his daily calls of support which he maintained right up until his death.\n\n\n\n\n\n\"So, for us, this is a very special day, very sad day, because today died the Pope Francis, he show us his paternity. He's very close to us, all the time here he called us during all this war, this horrible war. For more than one year and a half daily, he called us and to ask for peace, to pray for peace, and to give the blessing for all Gazan people and for all the Palestinian.\"\n\n\n\n\n\nPope Francis's success at championing efforts at forming a new, inclusive and multicultural Catholic Church can be evidenced by the mourning felt by Catholic communities the world over.\n\n\n\n\n\nMexican President Claudia Sheinbaum says her country and much of the world will remember him as a fierce champion of peace.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 43
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/the-pope-has-died-what-happens-next/467lpr3h7",
    "title": "The Pope has died: What happens next?",
    "publish_date": "Tue, 22 Apr 2025 03:21:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAfter 12 years of spiritual leadership over the Roman Catholic Church, Pope Francis has died at the age of 88.\n\n\n\n\n\nHis death has triggered a mourning period which involves centuries-old rites, some dating back to ancient Rome.\n\n\n\n\n\nThe date of both the funeral and burial will be decided by the Pope's camerlengo, which administers the property and revenues of the Holy See.\n\n\n\n\n\nThe funeral is likely to be held in St Peter's Square four to six days after the death.\n\n\n\n\n\nIt will trigger a nine-day mourning period called the 'Novendiale'.\n\n\n\n\n\nProfessor of Liturgical Studies and Sacramental Theology, Clare Johnson, explains.\n\n\n\n\n\n\"They're official days of mourning where masses of suffrage or masses of intercession are prayed each day. So, it's a novena of nine days where the Pope is remembered specifically on each of those days. The funeral itself will be dominated by red, which is the colour of mourning. The challenge of course with celebrating these masses within the season of Easter is that it's a season of joy. So, we've got this kind of contrast between joy and sorrow.\"\n\n\n\n\n\nThe Pope had approved funeral protocols for himself last year.\n\n\n\n\n\nIn typical Franciscan tradition, he opted to cut some of the papal funeral traditions and to simplify some rituals.\n\n\n\n\n\nAs part of that, his body is to be laid in a single coffin of wood and zinc in the Santa Marta chapel.\n\n\n\n\n\n\"Previously the Pope would've been buried in three coffins. So, one coffin nested in another coffin, nested in another coffin. Pope Francis has simplified that so that he will be buried just in one zinc lined wooden coffin. He also changed some of the protocols so that there would not be visitation in his private chapel prior to the visitation that will take place – the public visitation in St. Peter's Basilica where there are three days of visitation.\"\n\n\n\n\n\nHe has also elected to buried at Santa Maria Maggiore in Rome, rather than the crypt of St. Peter's Basilica in the Vatican – a choice Professor Johnson says speaks to his humble character.\n\n\n\n\n\n\"He found that that was a place that he liked to pray before and after he would go on any of his official visits. So, that place obviously has a close affinity for him and really the only thing he wants on his tomb is his name 'Francisco'. I think it's well in keeping with his character, he began his papacy by not wanting to stay in the papal apartment by himself. He wanted to be with the people and I think that's partly what he's done in wanting to be buried in Santa Maria Maggiore as well.\"\n\n\n\n\n\nThe College of Cardinals will oversee day-to-day business during a period called the 'interregnum' – during which much of the central Church administration grinds to a halt.\n\n\n\n\n\nThat will continue until the election of a successor, which involves a secretive voting ritual.\n\n\n\n\n\nA papal conclave – involving around 120 cardinals – will begin in the Vatican's Sistine Chapel between 15 and 20 days after the death.\n\n\n\n\n\nAmong them: Melbourne-based Cardinal Mykola Bychock, Australia's highest-ranking Catholic.\n\n\n\n\n\nDr Miles Pattenden, program director at The Europaeum and a regular commentator on Pope Francis' papacy, explains the process.\n\n\n\n\n\n\"The form and procedure of the conclave has been developed over the course of about 1,000 years, starting back with a papal bull from 1059 In Nomine Domini which said that, you know, the cardinals alone are the men who have the right to elect the pope, but the procedure developed in the subsequent centuries: from the 13th century came the idea that the cardinals need to be locked up in isolation to make this choice.\"\n\n\n\n\n\nAll cardinals under the age of 80 can take part in the secret ballot.\n\n\n\n\n\nThey need a majority of at least two-thirds plus one to elect the new pope, so the voting can take several rounds spread over many days.\n\n\n\n\n\nDr Pattenden says discussions around a successor have likely been in motion for some time.\n\n\n\n\n\n\"The church has often oscillated between periods when they've been very relaxed about making a choice and others where they felt a very strong imperative to make it very quickly, and we are in one of those phases at the moment. I think the Catholic Church would lack a great deal of credibility if we were all waiting and it was 2 weeks, 3 weeks, and the cardinals still couldn't reach a consensus. They're very aware of that. So, probably there'll have been a lot of discussions going on already.\"\n\n\n\n\n\nWhen the conclave is concluded, the new pope is asked if he accepts and what name he wishes to take.\n\n\n\n\n\nThe world learns a pope has been elected when an official burns the paper ballots doused in chemicals to make white smoke pour from the chapel's chimney.\n\n\n\n\n\nThey use other chemicals to make black smoke, which indicates an inconclusive vote.\n\n\n\n\n\nDr Pattenden says that tradition isn't as old as some would initially think.\n\n\n\n\n\n\"It dates from the 19th century, and the origin of it, of course, is that the cardinals needed to burn the ballot papers after each ballot so that you didn't find out who had voted for whom. That the outsiders like the Catholic faithful didn't see that there was in fact disagreement amongst the cardinals. They were very concerned to protect the new pope's reputation from that.\"\n\n\n\n\n\nThe process of electing a new pope is very political, with power struggles between the traditionalists and the modernisers.\n\n\n\n\n\nDuring his leadership, Pope Francis was considered a progressive reformist, who appointed a record number of non-Europeans as cardinals who will now take part in the voting.\n\n\n\n\n\nNearly 80 per cent of the current electors were appointed by him.\n\n\n\n\n\nThat legacy could make a progressive successor more likely, or for the first time in centuries, the next pope could come from Africa or Asia.\n\n\n\n\n\nBut Cardinal Timothy Radcliffe has warned against premature speculation.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 44
  },
  {
    "url": "https://www.sbs.com.au/news/video/australian-dairy-farmers-face-shrinking-industry/mlh1uj4j8",
    "title": "Australian dairy farmers face shrinking industry",
    "publish_date": "Tue, 22 Apr 2025 02:36:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australian dairy farmers face shrinking industry\n\nPublished 21 April 2025, 8:41 am\n\nThe number of dairy farms in Australia has been rapidly decreasing. In 1980, there were more than 20,000 dairy farms in Australia, now there are less than five thousand. Farmers say the combination of natural disasters and a lack of support are driving people away from the industry.",
    "source": "SBS",
    "cluster_id": 45
  },
  {
    "url": "https://www.theage.com.au/world/europe/danish-princess-reveals-18th-birthday-portrait-one-detail-sets-it-apart-20250423-p5ltkz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Danish princess reveals 18th birthday portrait. One detail sets it apart",
    "publish_date": "Wed, 23 Apr 2025 11:57:39 +1000",
    "category": "entertainment",
    "authors": [
      "James Rothwell"
    ],
    "text": "Denmark’s 18-year-old Princess Isabella has caused a stir online after posing for a strikingly modern photograph in which she is holding her mobile phone.\n\nThe daughter of Australian-born Queen Mary and King Frederik X is seen smiling for the camera in a tiara – and holding her smartphone, in a break with royal protocol.\n\nDanish Princess Isabella holds her phone in a portrait shared on the royal family’s social media. Credit: Instagram / @detdanskekongehus\n\nThe photograph, taken in celebration of her 18th birthday, was posted on the Danish royal family’s official website and social media channels.\n\nIt was captured by Steen Evald, who has been an official photographer for the family for more than two decades, in the Knight’s Hall of Frederik VIII’s Palace in Amalienborg.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/earthquake-jolts-hunter-region-20250423-p5ltpm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Earthquake jolts Hunter region",
    "publish_date": "Wed, 23 Apr 2025 11:55:18 +1000",
    "category": "finance",
    "authors": [],
    "text": "Earthquake jolts Hunter region\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/western-australia/wa-news-live-pm-dutton-in-perth-today-on-campaign-trail-20250422-p5ltj4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA news LIVE: PM, Dutton in Perth today on campaign trail",
    "publish_date": "Wed, 23 Apr 2025 11:47:48 +1000",
    "category": "finance",
    "authors": [],
    "text": "Peter Dutton is about to arrive at a defence manufacturing business in Belmont to spruik his military spending plan.\n\nThe contingent travelling with the opposition leader is at Blacktree Technologies in the Labor-held seat of Swan.\n\nSwan is one of four seats in WA that Labor snatched off the Liberal Party in 2022.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/the-data-that-shows-piastri-has-edge-over-verstappen-and-norris-in-f1-title-fight-20250423-p5ltmw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The data that shows Piastri has edge over Verstappen and Norris in F1 title fight",
    "publish_date": "Wed, 23 Apr 2025 11:47:43 +1000",
    "category": "sports",
    "authors": [
      "Luke Slater"
    ],
    "text": "On average, so far, the McLaren has been just over a quarter of a per cent faster than the Red Bull, even if it has taken “only” three poles from six qualifying sessions. That equates to 0.27 seconds on a theoretical one-minute and 40-second lap. Who, though, has been getting the most from their car? Not Norris, whose average qualifying position is 4.67. That is not just below Piastri (2.0) and Verstappen (3.0), but also George Russell (3.5) in a Mercedes. As he said, he is letting himself down and making life (and his championship hopes) harder than it needs to be.\n\nPiastri is yet to qualify worse than third and has four front-row starts compared to Norris, who has started in the top two only twice. In the last two rounds, he has been in grid spots six and 10. Verstappen has two poles and one other front-row start. Maximising lap time Another useful measure of how well a driver is performing over one qualifying lap is whether they are maximising their potential. You can work this out by looking at the difference between a driver’s best lap time and comparing it to their theoretical best – calculated by totalling a driver’s best three sector times. For instance, a driver may have recorded best sector times of 20.1seconds, 32.5 seconds and 29.4 seconds (1 minute 22 seconds in total) but their best lap time in qualifying could be 1 minute 22.2 seconds, which means they left two-tenths on the table from what they theoretically could have achieved. Looking at the data from the lead trio, it is painfully obvious that Norris trails by this metric. He has put together his theoretical best in the decisive final qualifying period twice. That is the same as Piastri, but one fewer than Verstappen.\n\nOscar Piastri and Lando Norris after the Australian won the Bahrain grand prix. Credit: Getty Images However, dig a little deeper and the picture is worse. His best lap time is on average 0.187 seconds down on his theoretical best, giving away seven-tenths in the Chinese sprint race, 0.147 seconds in qualifying for the Chinese Grand Prix and two-tenths in Bahrain. By contrast, Piastri is giving away just 0.061 seconds and Verstappen 0.043 seconds. Piastri has only given away more than a tenth on two occasions, and Verstappen once. Clearly, this has been driven by those well-noted Norris errors. Races There are several metrics you can look at, but again, the lack of quality in the second Red Bull makes any team-mate comparison almost pointless. Away from Verstappen’s utter dominance at Red Bull, Piastri has finished as the lead McLaren in three of the five grands prix.\n\nNorris, though, has the higher average finishing position at McLaren at 2.4 compared to 3.0, excluding the sprint race. That is largely because of Piastri’s ninth-place finish in Australia. Piastri has been the stronger driver since that point. Verstappen’s average finishing position of third, then, is more impressive than both Piastri and Norris. China was a tough race for him (not as tough as Bahrain), but he still extracted close to the maximum from the car. Perhaps the only race he did not maximise the performance of the RB21 was in Saudi Arabia, when he let a lead slip at the start and incurred a five-second time penalty. Looking at laps led, Piastri leads the way with 124, with Verstappen on 66 and then Norris on 60. Of course, it is better to lead the final lap of the race than to have led all of the previous ones. Still, it is clear who is doing better.\n\nWinning margins can be a misleading statistic because there are so many other factors involved such as race and tyre management, as well as safety cars. They provide a decent guide overall, but come with caveats. Of the meaningful races there is only really Verstappen’s 1.4 second-margin in Japan and Piastri’s 15 seconds in Bahrain (after 22 laps of racing) and his 2.8 seconds in Saudi Arabia. Verdict: Verstappen the better driver, Piastri the more likely champion There are other intangible factors that will play a part in the destination of the title in the next 19 rounds. Errors will be one of them, as will mentality and luck, especially if it stays as close as it is. Considering what we have looked at above, we would rate Verstappen as the top-performing driver by a small margin over Piastri. The Dutchman will likely have a battle on his hands to stay in championship contention, though, because of his car. Red Bull driver Max Verstappen. Credit: Getty Images",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/politics/federal/federal-election-2025-live-updates-20250422-p5ltk3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Federal election 2025 LIVE updates: Half a million votes cast on first day of early voting; Trump tariff war to blow $13b hole in economy",
    "publish_date": "Wed, 23 Apr 2025 11:47:08 +1000",
    "category": "finance",
    "authors": [
      "Angus Dalton"
    ],
    "text": "On 3AW, host Tom Elliott asked Dutton if he was nervous about saying the Coalition would bring down power, gas and grocery prices.\n\nElliott: “I mean, it’d be great to wave a magic wand and make everything cheaper for everyone, but it’s not really that simple, is it?”\n\nLoading\n\nDutton: “Tom, it’s not simple, but it’s achievable if you’ve got the ability to do it. And the Coalition government will always manage the economy more effectively and to address cost of living … The government spent more money than any government in the last 40 years. It’s the worst government since the Whitlam government, and the price of everything has gone up as a result of that. And this blind pursuit of a renewables-only policy is all about trying to win over Greens voters in industry in Melbourne and Sydney, and it’s hurting people right across the economy.”\n\nEarlier in the campaign, Dutton referred to the Albanese government being the worst since Whitlam in terms of spending.\n\nAnd last week in this blog, senior economics correspondent Shane Wright revealed that Dutton’s signature planned mortgage interest rate deduction policy, which experts have described as “ridiculous” and a danger to the tax system, was a policy of Whitlam.\n\nDutton told 3AW a record 30,000 small businesses had closed over the past three years and Australia couldn’t afford to continue on that path.\n\nHe said an east coast gas reservation would bring down prices of wholesale gas by almost a quarter.\n\n“If we’re lowering the price of gas by 23 per cent, then we can help lower the cost of construction, and we can help lower the cost of storing food and cold storage and transporting food, etc,” he said.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/business/companies/liberals-remove-tiktok-after-influencer-calls-in-lawyers-over-stolen-content-20250422-p5ltbw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Liberals remove TikTok after influencer calls in lawyers over ‘stolen’ content",
    "publish_date": "Wed, 23 Apr 2025 11:30:08 +1000",
    "category": "finance",
    "authors": [
      "Calum Jaspan"
    ],
    "text": "The Liberal Party has removed a social media post after a Gold Coast influencer threatened to sue the Federal opposition for allegedly twisting a pro-Greens video to attack the minor party.\n\nHolly MacAlpine posted a video in March, posing a “true or false” statement to Greens senator Larissa Waters, which was edited by the Liberal Party’s official TikTok page to appear critical of the party.\n\nGreens Senator Larissa Waters, left, with content creator Holly MacAlpine.\n\nLegal representatives for MacAlpine sent a concerns notice to the Liberal Party on Tuesday evening over the video, the initial step in defamation proceedings. The letter also included allegations her moral rights were infringed by subjecting her to derogatory treatment, an infringement of copyright in repurposing the content.\n\nThe post in question took a five-second grab from a video in late March, cutting the statement “the Greens just protest, they don’t actually get anything done” (which required an answer) and presenting it alone as a statement of fact, followed by an official party authorisation.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/nsw/developers-want-to-build-1100-apartments-two-sydney-councils-are-alarmed-20250415-p5lryv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Developers want to build 1100 apartments. Two councils are alarmed",
    "publish_date": "Wed, 23 Apr 2025 11:30:00 +1000",
    "category": "finance",
    "authors": [
      "Megan Gorrey"
    ],
    "text": "An inner Sydney council is fighting a mammoth $880 million proposal to build more than 1000 apartments beside Parramatta Road, arguing the towers would overshadow houses on the opposite side of the busy thoroughfare, despite the development sitting outside the council’s boundaries.\n\nThe Inner West Council has objected to property giant Deicorp’s plan to build 1185 homes, including 219 affordable housing units, in six towers up to 31 storeys between Parramatta Road and Queens Road in Five Dock.\n\nThe City of Canada Bay council has also lodged a formal objection to the “state significant” Kings Bay Village proposal, which will be decided by the NSW government.\n\nThe proposed Kings Bay Village development will bypass the local council and be decided by the state government.\n\nDeicorp reportedly purchased the 3.12-hectare industrial “super site” next to Rosebank College for $260 million in 2023.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/afl/adem-yze-and-richmond-media-shut-down-noah-balta-questions-20250423-p5ltp8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Adem Yze and Richmond media shut down Noah Balta questions",
    "publish_date": "Wed, 23 Apr 2025 11:29:43 +1000",
    "category": "finance",
    "authors": [],
    "text": "Adem Yze and Richmond media shut down Noah Balta questions\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/national/victoria/how-building-more-apartments-could-make-these-rich-melbourne-suburbs-more-inclusive-20250421-p5lt56.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "How building more apartments could make these rich Melbourne suburbs more inclusive",
    "publish_date": "Wed, 23 Apr 2025 11:20:05 +1000",
    "category": "finance",
    "authors": [
      "Daniella White"
    ],
    "text": "Building more apartments in some of Melbourne’s most affluent postcodes would desegregate rich suburbs and allow more middle-class people to live in desirable locations, a new analysis by advocates of higher density living suggests.\n\nBut prominent planners have criticised the Victorian government’s activity centre scheme, and say it won’t deliver the affordable housing it promises but will instead radically alter Melbourne’s cultural heritage.\n\nThe location of Melbourne’s proposed activity centres within the city’s socioeconomic status Credit: Asanka Epa\n\nRMIT University Emeritus Professor Michael Buxton last week told an inquiry into new planning rules that the government had held “secretive” consultation into key changes that would allow greater housing density and fewer avenues for community and council objections.\n\nThe Allan government has unveiled 60 planned activity centres, which are slated for higher-density living as part of the plan to encourage developers to build hundreds of thousands of new homes.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/sport/afl/no-more-questions-yze-prickly-at-media-conference-after-balta-sentencing-20250423-p5ltn0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘No more questions’: Yze prickly at media conference after Balta sentencing",
    "publish_date": "Wed, 23 Apr 2025 11:16:48 +1000",
    "category": "sports",
    "authors": [
      "Danny Russell"
    ],
    "text": "Earlier, Yze had said the club and Balta accepted the court’s punishment and would now set a plan for him, “understanding which games he won’t be allowed to play”. “To go through an appeal process would be almost giving him the license to get back in and [say that] footy was more relevant than the sanction,” Yze said. “He knew that he did wrong, and he was going to be punished. So to go through that for another six weeks, we just thought it was too hard, not only on him, but on our footy club and our playing group, so we accept the decision, and we move on.” Yze said the club had not expected a curfew, but they knew the defender was going to be sanctioned.\n\nLoading “Dealing with that is just part of it,” he said. “Like I said, he’s really remorseful. We knew that he was going to be punished, and we went through that process yesterday, and now that’s one little element that we’ll have to play around with and deal with as a club. “But at the same time we have got to wrap our arms around him and help him through this.” Richmond banned Balta, 25, for four AFL games and two pre-season matches after it was revealed he had assaulted a man outside Mulwala Water Ski Club in the early hours of December 30 last year. But Yze defended Balta’s decision to not speak publicly about the court case.\n\nLoading “He will speak in time,” the Tigers coach said. “It’s pretty tough to go through. There’s a fair few players that don’t like speaking in front of the media, and they’re not trained for that. “And going through what he went through yesterday, you’re obviously a little bit worried about what he could say. “He was he’s obviously disappointed, he’s flat, he’s emotional, so we’ve just got to protect him with that. He’ll speak when he when it’s his right time to speak and you will sense how remorseful he is.” Balta played his first game of the season against the Gold Coast last Saturday, and will be expected to line up for the Tigers again against Hawthorn in a day match at the MCG in round eight.\n\nYze said Richmond would bring in 195-centimetre youngster Campbell Gray, 21, to make his debut on Thursday night. Gray was taken at pick 16 in the 2024 mid-season rookie draft. Roos lash out at ‘coach bashing’ of Clarkson AAP North Melbourne have come out swinging in defence of Alastair Clarkson with football boss Todd Viney lashing “disrespectful” criticism and “coach bashing” of the Kangaroos mentor. North have lost their past four games by an average of almost 59 points and reached a season-low with an embarrassing 82-point defeat to Carlton on Good Friday.\n\nClarkson has come under fire, but Viney, who also worked with him at Hawthorn, scoffed at any suggestion the four-time premiership mentor had lost his edge. “I find it amusing, really. I find it probably disrespectful,” Viney said on SEN on Wednesday. Tough days: Alastair Clarkson is working to turn North Melbourne’s fortunes around. Credit: AFL Photos “This is not only to Clarko but this is something that’s pointed at senior coaches all the time. It’s almost like a sport ... There is a sport around putting undue pressure on senior coaches in my view.” Viney pointed out 2025 was the first season where Clarkson hadn’t also been dealing with the fallout from the Hawthorn racism saga.\n\n“Not many clubs can really perform at their best when they’ve got such distractions going on,” Viney continued. “... He’s had enormous distractions, unwarranted criticisms, judged unfairly – it’s taken an enormous toll on him over those two years. “Eventually we’re into this third year, two years and six games in. He’s a rejuvenated person, back to his old self, a lot of energy, seeing the game as well as he’s ever seen it.” Viney was adamant Clarkson was well supported and seeing the game “as well as he ever has” but the Kangaroos were in the early stages of building their game. “The criticism is really unwarranted,” he said. “I think it’s a bit of a sport, the coach-bashing thing. “It’s a tall-poppy syndrome which is the Australian culture – we pick on the guys who have been successful and in time ultimately bring them down.”\n\nLoading Ahead of Saturday’s away clash with Port Adelaide, Viney was adamant the Kangaroos were strong and aligned across the board and wouldn’t deviate from their plans. “A lot of things are going well so we won’t be fractured, we won’t fall into jumping at shadows with all the noise,” he said. “We understand the game gives us nothing and we need to deserve to win games. “No one’s going to give us anything and we don’t expect it, we expect to cop our right whack with performances like the weekend. “But we won’t hear that everything we’re doing is not right because there is a lot of positive things that are going right.”",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/queen-of-funk-works-hard-to-overcome-sonic-flaws-in-anniversary-concert-20250414-p5lrjg.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Queen of Funk works hard to overcome sonic flaws in anniversary concert",
    "publish_date": "Wed, 23 Apr 2025 11:13:03 +1000",
    "category": "entertainment",
    "authors": [
      "Bernard Zuel"
    ],
    "text": "Still, given the night closed with Ain’t Nobody, not the best song in her repertoire but a perfect mix of slink, simplicity, groove and glee to send ’em home happy, there’s a sound engineer who might think he just about got away with this. MUSIC\n\nTOTO WITH CHRISTOPHER CROSS\n\nDarling Harbour Theatre, ICC, April 19\n\n★★★\n\nReviewed by James Jennings What to do when you’ve got, say, three songs that are bulletproof crowd-pleasers, yet you’ve been asked to perform a gig that lasts at least an hour or more? Toto in Sydney. Original member Steve Lukather, on guitar, still leads the band. Credit: Ashley Mar If you’re Christopher Cross, a man who could justifiably be credited with creating the genre known as yacht rock (smooth, adult-contemporary music of the late ’70s and early ’80s) thanks to his 1980 hit singles Sailing and Ride Like The Wind, you strategically spread them out to one killer track every half an hour. Arthur’s Theme (Best That You Can Do) completes Cross’s crowd-pleasing trifecta.\n\nThe rest of his set is wisely padded out with songs from his hit 1979 self-titled debut album, although a tune he refers to as a “deep cut” called Dreamers and a new song called You both sound good enough to prove he’s more than just a guy with a few 45-year-old hits. American pop-rock band Toto have a few better-known songs to their name, but the rule of three bulletproof crowd-pleasers applies to them, too. One of those, 1982’s Rosanna, is second cab off the rank and goes down as well as you’d expect, even if only one person on stage – guitarist and singer Steve Lukather – is an original Toto member. The seven band members are all masterful musicians, particularly new keyboardist and singer Dennis Atlas, who plays his instrument as if he’s been teleported straight from the ’80s, even though he’s the youngest by far at 27. Despite the skills on display, some sins are committed: several songs turn into extended jams (always more fun for players than audience; in that vein we also get solos on keyboard (two) and drum). There are a few decent songs along the way such as 99 and I’ll Supply the Love, but more that feel like a chore to get through. It all becomes a bit of an AM radio-friendly soup.\n\nThen, finally, bulletproof, crowd-pleasing redemption: 1978 pop-rock classic Hold the Line livens things up considerably, the perfect entree for Toto’s defining song, 1982’s Africa, which seems to have only increased in popularity as the decades have rolled on thanks to numerous remixes, covers and pop culture references. It’s a glorious note to go out on and makes up for a gig that could have done with a few more songs of the same calibre. MUSIC\n\nSYDNEY PHILHARMONIA CHOIRS\n\nSydney Opera House Concert Hall, April 17\n\n★★★½\n\nReviewed by Harriet Cunningham Sydney Philharmonia Choirs’ Vox and Chamber ensembles have come together with the Australian Romantic and Classical Orchestra (ARCO) to present Bach’s St Matthew Passion in the 1841 arrangement of the work by Felix Mendelssohn. St Matthew Passion: the choir responded to conductor Elizabeth Scott with impressive precision and energy. Credit: Keith Saunders\n\nIn the 300 or so years since Bach’s St Matthew Passion was first performed, it has undergone myriad transformations: there have been changes in instrumentation, pitch and structure and it has been staged as an opera and a ballet. Mendelssohn’s version, as recreated by ARCO’s team of specialists, is notable for its orchestration. In place of a largely improvised keyboard and viola da gamba continuo, we hear Mendelssohn’s written-out accompaniments for two cellos and bass. In place of the obsolete oboes da caccia, Mendelssohn writes for the new-fangled clarinet and basset horn. At times it feels like a revelation, a radically different palette of tone colours, bringing unfamiliar texture and suspense to the score. At others, it feels like an unfamiliar intrusion, especially when pitch goes awry between historic instruments and contemporary voices. The period interpretation also features romantic styles of rubato, which sound mannered to this modern ear. The Passion is a drama of many characters, some represented by singers, some by instruments. The choristers are particularly versatile, at one moment playing the mob, angry and ready to roar, and at another lulling us into contemplative wonder with a pianissimo chorale. It may be a small army of voices but it responds to conductor Elizabeth Scott with impressive precision and energy.\n\nScott has also assembled an excellent line-up of soloists: Andrew O’Connor plays many roles with consummate skill and Penelope Mills brings fine clarity to the soprano roles, while Emily Edmonds’ mezzo soprano voice is full of warmth. Concertmaster Rachael Beesley and flutist Melissa Farrow bring mellifluous virtuosity to their obligato accompaniments while Teddy Tahu Rhodes shines as a charismatic and eloquent Christus. Finally, the hero of the evening is Andrew Goodwin as the Evangelist, his voice reaching into the heavens with sublime ease. BLUES\n\nGary Clark Jr\n\nEnmore Theatre, April 17\n\n★★★½\n\nReviewed by Bernard Zuel The clue was in his entrance. Long, extravagantly lean and topped by a high, wide and handsomely white hat, Texan Gary Clark Jr ambled on like he was just passing through. He sang of suspicion and resistance: Gary Clark Jnr Credit: Ashley Mar\n\nIt was like purpose was at his disposal – like time was flexible, elastic even, and to be shaped not so much by will as by example. And it was. Even as the band began playing, a long, atmosphere-heavy introduction was measured in its tempo but deliberately vague in its intentions, all possibilities open. Then this moody, chugging blues emerged and Maktub took shape: decidedly north African in its desert airy expansiveness, it suggested both movement and stasis, with Clark’s slide guitar in long strides rather than stealthy steps. He sang of suspicion and resistance in the tone of someone wearied by the fight but not bent by it; he warned “just tell ’em, we’re coming” but cautioned “we gotta move in the same direction”, with the patience of someone who has been this way before. And so it went, always undulating rather than surging, for almost 10 minutes, time immaterial. And so it went for the rest of the night: as the hour mark ticked over, Clark and band had only just started on their seventh song. There would be only four more, including an encore, in a show of almost two hours. In that time-defying space, variety was not as pronounced as in his most recent albums, which have seen Clark expand his remit well beyond Texas blues. Still, you could hear echoes of Parliament/Funkadelic in the loose, odd, rhythmically insistent Alone Together, while the hands of Curtis Mayfield and D’Angelo – old soul and nu-soul - could be felt in R&B-driven numbers like the righteously moved Feed The Babies, the first time Clark’s falsetto emerged.\n\nOne of those predecessors would probably have encouraged Clark to shorten the too-long preamble to the set’s closer, Habits, which seemed a culmination of the noodling that crept in during the final stages of the night and served to speed the exit of some in the audience. But then the man might have responded by pointing out how the Catherine wheel of a solo which climaxed said noodling and the night all but washed away such thoughts – as if they, like time, didn’t matter. THEATRE\n\nSNAKEFACE\n\nBelvoir Street 25A, April 11\n\nReviewed by HARRIET CUNNINGHAM\n\n★★★★★\n\nAliyah Knight, playwright and performer, is already on stage as the audience files into Belvoir Street’s downstairs theatre and is still there when the lights go up. It feels like there is nowhere else to go. Just a scrim at the back (used to project text, sometimes readable, sometimes censored) and a block of stone – which turns out to be clay – centre stage. Music fills up the remaining space, enveloping and energising a young queer figure of colour as they spin, sway and groove.\n\nA coming-of-age story, a myth, a fever dream and a mystery: Snakeface is written and performed by Aliyah Knight. Credit: Abraham de Souza, Fruit Box Theatre Snakeface is many things: a coming-of-age story, a myth, a fever dream and a mystery. Its title references the murderous, snake-haired Medusa of Greek myth. Knight’s imagination transforms Medusa into a victim, made into a monster by sexual violence. This becomes a springboard into the mind and body of a woman whose transformation is anything but mythical. Loading There’s a gritty, joyful authenticity about much of Knight’s script, which captures the wide-eyed curiosity and liminal sensation of a life-hungry teenager. They watch two beads of sweat running down a naked man’s chest and wonder which wins the race; they catch eyes with a stranger in a bar and hallucinate with pleasure. There’s poetry in the prose of the young woman’s words, and it clashes with the ugly words jumping out from the poetry projected on the backdrop. Knight delivers it all with fluency, flipping from chatter to chant in a sustained monologue, which I would be fascinated to read.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-gain-after-bets-on-trade-deals-boost-wall-street-20250423-p5ltki.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "ASX gains after bets on trade deals boost Wall Street",
    "publish_date": "Wed, 23 Apr 2025 11:01:28 +1000",
    "category": "finance",
    "authors": [
      "Gemma Grant"
    ],
    "text": "The Australian sharemarket has jumped this morning after US stocks rallied overnight, wiping out Monday’s plunge, amid bets that the White House will clinch crucial trade deals with America’s top economic partners as President Donald Trump said he “won’t play hardball” with China.\n\nThe S&P/ASX200 was up 125.70 points, or 1.6 per cent, to 7942.40 as of 10.40am AEST. All eleven industry sectors were trading in the green on the second day of this short trading week, led by energy, health and IT stocks. Following the long Easter weekend, the market will be closed again on Friday for Anzac Day.\n\nUS stocks rebounded overnight on hopes the trade war could de-escalate. Credit: Bloomberg\n\nThe Australian dollar was trading at US63.83¢ as of 10.20am AEST. The ASX finished flat on Tuesday, with falls in tech and energy stocks offset by rises in materials, financials and consumer staples.\n\nThe strong morning performance came as a degree of optimism emerged for a de-escalation in Trump’s trade war. The US president said this morning he will substantially lower his unprecedented 145 per cent tariffs on Chinese goods in recognition the bitter trade war between the world’s two largest economies cannot last.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/culture/music/it-s-a-clarion-call-bluesfest-boss-delivers-update-on-festival-s-future-20250423-p5ltlo.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It’s a clarion call’: Bluesfest boss delivers update on festival’s future",
    "publish_date": "Wed, 23 Apr 2025 10:50:16 +1000",
    "category": "finance",
    "authors": [
      "Farid Farid"
    ],
    "text": "Byron Bay Bluesfest will return after all, bucking a global industry trend and despite its director’s claim that the 2025 edition was its last.\n\nMore than 40 music festivals across Australia have been cancelled since 2022 after the COVID-19 pandemic decimated the live music sector.\n\nChristone “Kingfish” Ingram, one of the headliners at the 2025 Bluesfest, in action in Byron Bay. Credit: Edwina Pickles\n\nBluesfest appeared set to join the list when it announced its artist line-up in August, with bombastic festival director Peter Noble declaring the 2025 event would be the “last ever”.\n\nThat announcement proved marketing gold, with 97 per cent of tickets snapped up – and Saturday entry sold out – before gates opened on Thursday afternoon.",
    "source": "TheAge",
    "cluster_id": 14
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/australian-cricket-mourns-death-of-former-test-opener-keith-stackpole-20250423-p5lto1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘He had that aura’: Australian cricket mourns death of former Test opener Keith Stackpole",
    "publish_date": "Wed, 23 Apr 2025 10:47:54 +1000",
    "category": "sports",
    "authors": [
      "Andrew Wu",
      "Jon Pierik"
    ],
    "text": "Australian cricket is mourning the death of former Test opener Keith Stackpole, who died on Tuesday at the age of 84.\n\nStackpole was an aggressive opening batter who was an important member of the Australian sides captained by Bill Lawry and Ian Chappell from 1966-74.\n\nKeith Stackpole in action against New Zealand in 1974, when he was Australian vice captain. Credit: Fairfax Media\n\nPicked initially as a middle-order batter who could bowl leg-spin, Stackpole flourished after being moved to the top of the order by close friend and Victoria teammate Lawry for the Sydney Test against the West Indies in the 1968-69 series.\n\nTogether, the pair, with vastly different styles, became one of the finest opening combinations Australia had seen. Stackpole’s hard hitting and love of the hook shot - his feature shot - was in contrast to Lawry’s more sedate game.",
    "source": "TheAge",
    "cluster_id": 7
  },
  {
    "url": "https://www.theage.com.au/national/victoria/get-your-gotcha-moment-somewhere-else-man-rebuked-at-kooyong-forum-20250423-p5lto2.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Get your gotcha moment somewhere else': man rebuked at Kooyong forum",
    "publish_date": "Wed, 23 Apr 2025 10:35:01 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Get your gotcha moment somewhere else': man rebuked at Kooyong forum\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/national/coalition-reveals-extra-21-billion-defence-spending-boost-20250423-p5lto0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Coalition reveals extra $21 billion defence spending boost",
    "publish_date": "Wed, 23 Apr 2025 10:34:07 +1000",
    "category": "finance",
    "authors": [],
    "text": "Coalition reveals extra $21 billion defence spending boost\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://www.theage.com.au/national/victoria/television-ad-for-the-military-from-2016-of-david-finney-20250423-p5ltnw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Television ad for the military from 2016 of David Finney",
    "publish_date": "Wed, 23 Apr 2025 10:28:44 +1000",
    "category": "finance",
    "authors": [],
    "text": "Television ad for the military from 2016 of David Finney\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 35
  },
  {
    "url": "https://au.news.yahoo.com/fisherman-captures-spectacular-frenzy-off-quiet-aussie-beach-unprecedented-074551691.html",
    "title": "Fisherman captures spectacular frenzy off quiet Aussie beach: 'Unprecedented'",
    "publish_date": "2025-04-22T07:45:51Z",
    "category": "sports",
    "authors": [],
    "text": "A huge school of salmon at a beach west of Albany made for an exciting day of fishing on Easter Sunday. Source: Farhan Kerbelker\n\nExcited fishers are flocking to the southwest of the country to chase an unprecedented salmon run with witnesses saying they \"haven't seen anything like it\".\n\nLarge schools of huge salmon arrived in time for the Easter holiday in the south of Western Australia. The fish are moving in big numbers along the beaches of Albany, making their way around the capes and up the west coast of the country.\n\nAvid fisherman and photographer Farhan Kerbelker was among the thousands chasing the salmon over Easter. It is something he does this time every year, but he's never seen a season like this one and he captured some incredible drone footage of a school of salmon near Albany on Sunday.\n\nADVERTISEMENT\n\n\"Everyone is finding the size of the salmon much bigger than normal,\" Farhan told Yahoo News on Monday. \"We've not seen anything like it.\"\n\nAs a result holidays parks in the south over Easter were bursting at the seams with people after a piece of the action, and with the Anzac Day long weekend just days away the crowds chasing the fish will again take over the coastal towns in the southwest of WA.\n\n\"You can't get accommodation, people are camping anywhere, it's fully booked up,\" Farhan said.\n\nSwirling salmon ball off WA beach stuns campers\n\nOn Sunday the Perth-based fisherman was at a remote beach west of Albany with a group of friends just hooking the odd salmon straying from its school when the day changed suddenly.\n\n\"We saw this little bit of a dark patch in front us, and no one thought much of it as it was pretty weedy,\" Farhan explained.\n\nADVERTISEMENT\n\n\"I sent the drone up and I saw this ball swirling and immediately we knew it was a school. The whole beach shouted for everyone just to go to follow the school.\"\n\nA pod of dolphins chased the salmon towards the beach and then the school just parked in a channel close to the shore. From that point it was on — people were casting whatever they had, using lures and trying to pull the huge fish in.\n\n\"I had to stop because my arms and wrists were sore,\" Farhan said. Using 12-pound lines the group were snapping lines and bending hooks, so they had to change to a 30lb lines just to get the fish out of the water.\n\nWhen Farhan was too exhausted to continue he relaunched his drone to capture the scene including spectacular vision of the ball of salmon just off the shore.\n\nThe school of salmon resembled a swirling black ball. Source: Farhan Kerbelker.\n\nThe school of salmon were pushed to the shore by dolphins. Source: Farhan Kerbelker.\n\nADVERTISEMENT\n\nThe footage was shared on social media where many anglers shared their excitement of seeing the salmon and their efforts to successfully land the huge fish.\n\nThe Easter weekend frenzy follows similar scenes recently shared around the southwest of WA including a day at Cheynes Beach earlier in the month when there were so many salmon that fishers were pulling them out of the water by hand.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 46
  }
]