[
    {
        "url": "https://www.9news.com.au/national/queensland-premier-david-crisafulli-blasts-anthony-albanese-federal-government-over-hospital-funding/86b9bebf-c651-42eb-892b-4d00376f347c",
        "title": "Queensland premier ends 'cannoli diplomacy' with PM over hospital funding snub",
        "publish_date": "Sun, 09 Nov 2025 00:20:06 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "David Crisafulli once said of Prime Minister Anthony Albanese that there's nothing that the pair can't solve over a bit of common sense and an Italian meal.\n\nBut seems Crisafulli has found the dealbreaker in their so-called \"cannoli diplomacy\".\n\nThe Queensland﻿ premier is expected today to formally reject the federal government's hospital funding proposal and has blasted the PM for shortchanging the state.\n\nQueensland Premier David Crisafulli is expected to reject the federal government's hospital funding plan. (Jamila Filippone)\n\nThe proposal would see Australian states and territories share in about 35 per cent of the Commonwealth's share of hospital funding – a major shortfall of the 42.5 per cent originally promised.\n\nIt was originally proposed that the federal share of public hospital funding will rise from 40.3 per cent to 42.5 per cent by 2030.\n\nThe premier said this new figure is not something he is willing to accept for Queensland.﻿\n\n\"We will not allow the Commonwealth to short-change Queensland's health system,\" Crisafulli said.\n\n\"Cannoli diplomacy is off the menu until a fair health deal is back on the table.\"\n\nThe premier said his longstanding \"cannoli diplomacy\" with the PM has come to an end. (Dominic Lorrimer)\n\nCrisafulli has also accused the government of leaving hundreds of Queenslanders with mild disabilities stranded in the state's hospital system.\n\nPart of the hospital deal would see states co-fund new supports which are aimed at moving people with mild autism off the NDIS.\n\nCrisafulli said earlier he expects other state leaders to follow suit.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/aussies-starting-side-hustles-out-of-financial-necessity-exclusive/dc008c47-a5b4-4a4b-a8d2-57e686e7e2b6",
        "title": "Aussies like Cassie have resorted to selling their clothes to make ends meet",
        "publish_date": "Sat, 08 Nov 2025 19:12:07 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Exclusive: Melbourne woman Cassie Walker started selling her old clothes online as a way to \"make quick cash when times are tough\".\n\nNew research shows she's not the only one.﻿\n\nIt's estimated that millions of Australians ﻿have recently picked up a side hustle to cope with financial pressure in the cost-of-living crisis.\n\nCassie Walker started selling her old clothes as a way to \"make quick cash when times are tough\". (Supplied)\n\nOne in four Aussies currently have a side hustle according to an Omnisend survey , and more than three-quarters of them started out of financial need – not for \"fun money\".\n\nAlmost 50 per cent started within the last 12 months.\n\nMost spend up to 10 hours on their side hustle per week.﻿\n\nBut only one in five make more than $1000 per month (around $250 per week).\n\nIt doesn't sound like much but Aussies are collectively earning an extra $14.3 billion per month from side hustles, based on the Omnisend data.\n\nThe survey also revealed that about 45 per cent of Aussies with side hustles have turned to online sales, using resale platforms like eBay and Facebook Marketplace to make quick cash off their old clothes and household items.﻿\n\nWalker has been freelancing in TV and media production for the past three years and relies on the extra cash from her side hustle to get by between contracts.\n\n\"I first started selling on [fashion marketplace] Depop five years ago,\" she told 9news.com.au.\n\n\"I was working full-time but my hours were cut to one day per week [so] it was a financial decision first.\"\n\nSome of the pieces she sells are from her own wardrobe, others she picks up cheap at op shops and resells at a higher value.\n\nOften this is because she's upcycled the piece, turning a $2 buy into a $20 sale with a few small repairs.﻿\n\nREAD MORE: How to maximise public holidays and make the most of your annual leave in 2025\n\nHighest-paying jobs in Australia that don't need a degree View Gallery\n\nWalker also sells items on her social media pages from time to time, using Facebook and Instagram stories to advertise to her friends and followers.﻿\n\nNow she makes an average of $100 per week from the side hustle, sometimes more.\n\nLast week, she pocketed $160 – enough to cover common monthly expenses like a phone bill or insurance fees for the average Aussie.\n\n\"It's also helpful for those unexpected bills or more expensive weeks,\" she said.\n\n\"I can easily sell something and have that cashflow.\"\n\nWalker spends about a day a month organising her side hustle. (Supplied)\n\nThe best part about Walker's side hustle?\n\nShe doesn't have to invest loads of time into it.\n\n\"I put aside one day per month on photos, uploading, managing existing listings, et cetera,\" Walker said.\n\n\"I do maintenance a few times a week, like sending offers to those liking my items, sending discount offers, changing photo orders and prices.\"\n\nThe majority of Aussies with side hustles are the same.\n\nAbout 35 per cent spend less than five hours on their side hustle per week.\n\nMore than 40 per cent spend just five to 10 hours on it per week.\n\nFor most, including Walker, it allows them to make enough to bridge the gap between their main source of income and the rising cost of living.\n\n﻿Especially in an age of job insecurity and growing adoption of AI in the workplace.\n\n\"As a woman approaching 40 I'm finding it very hard to find permanent work,\" Walker confessed.\n\n\"I know I'm not alone in this, but while I'm juggling [freelance work] this is a great side hustle.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/weather-news-ctemperature-drops-melbourne-sydney-victoria-new-south-wales/25949fd3-1bb4-4715-b1a5-8c7b5491bd7b",
        "title": "Punters brave Flemington as wild weather lashes Melbourne",
        "publish_date": "Sat, 08 Nov 2025 08:16:43 +0000",
        "category": "sports",
        "authors": [
            "Nov"
        ],
        "text": "Wild weather has lashed Melbourne on the final day of the Melbourne Cup carnival.\n\nRaincoats and umbrellas were the accessory of the day for racegoers who braved the spring soaking.﻿\n\nThe 65,000-strong crowd at Flemington were hit with sideways rain, strong winds and a downpour for Stakes Day.\n\nREAD MORE: Labor legend Graham Richardson dies at 76 ﻿\n\nRaincoats and umbrellas were the accessory of the day for racegoers who braved the spring soaking.﻿ (9News)\n\nThe temperature dropped to 10 degrees ﻿with a 'feels like' temperature just shy of six degrees across the day.\n\nIt was a dramatic contrast to yesterday's weather, which was a maximum of 28 degrees with a \"feels like\" temperature of about 25 degrees.\n\nThe 65,000-strong crowd at Flemington were hit with sideways rain, strong winds and a downpour for Stakes Day. (9News)\n\nYoung racegoers are seen in the rain during Champions Day at Flemington Racecourse. (Getty)\n\n﻿Today's showers are expected to continue in the Victorian capital until Tuesday but temperatures will rise slightly.\n\nThe mercury will climb to 15 degrees for Sunday, warm up to 20 degrees on Monday before the forecast dips back to 15 degrees on Tuesday.\n\nREAD MORE: Salad pulled from shelves due to salmonella fears after 44 people become ill\n\n12:25 AEDT 12:30 AEDT 12:35 AEDT 12:40 AEDT 12:45 AEDT 12:50 AEDT 12:55 AEDT\n\nMeanwhile the heat is peaking in eastern parts of NSW, with temperatures expected to reach at 36 degrees in Penrith and 33 degrees in Sydney.\n\nNowra on the state's south coast and Dubbo in the central west could reach a ﻿top of 33 degrees.﻿\n\nWeatherzone predicts many locations lose at least 10 degrees for their Sunday maximums .﻿\n\nLarge hail stones and damaging winds could affect parts of these communities this afternoon.﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sophadophaa-sophia-begg-all-for-mimi-founder-secrets-to-success/6374bbca-4a4a-4495-8719-86b3fb02cbbd",
        "title": "21-year-old business owner reveals mistake jobseekers keep making",
        "publish_date": "Fri, 07 Nov 2025 19:58:53 +0000",
        "category": "finance",
        "authors": [
            "Nov"
        ],
        "text": "Exclusive: In a new nine.com.au series starting today we'll be talking to some of Australia's smartest and sharpest ﻿entrepreneurs, founders and CEOs to find out what makes them tick - and what advice they'd have for anyone starting out.\n\nSophia Begg (known online as @sophadophaa) is one of Australia's most recognisable young influencers ﻿with more than 2 million combined social media followers.\n\nShe's also co-founder of All For Mimi, the wildly successful fashion brand she launched in 2023 that shot to fame for its viral sell-out tank tops.\n\nNow a successful internet personality and business owner, she's juggling two lucrative careers ﻿at just 21 years old.\n\n﻿ These are her secrets to success.\n\nSophia Begg is one of Australia's most recognisable young influencers and co-founder of fashion brand All For Mimi. (Supplied)\n\nHow do you start the day to set yourself up for success?\n\nI love to start the day with a morning walk with my partner before making my Tropeaka matcha to enjoy a quiet moment before the chaos!\n\nWhat are three daily habits you always stick to?\n\nMorning matcha, daily gratitude, and 'no-phone' time before bed.\n\nLots of Aussies are looking for a career change — what small action can help them get ahead of other candidates?\n\nWhat stands out to me is when applicants take the time to attend to the finer details.\n\nYou'd be surprised at how many applications don't have a cover letter or have spelling errors!\n\nBegg revealed a surprising number of people who apply to work with her don't include a cover letter. (Supplied)\n\nWhat financial myth do you wish you never bought into?\n\nIn my first ever car, when I was 18, I believed that if I put my windows down the car would go slower and therefore use more petrol.\n\nSo even in summer, in 30 degree heat, I would keep my windows up and never use the aircon to save money.\n\nWhat do you wish you could tell your 20-year-old self?\n\nLast year [Begg turned 20 in 2024] was a wild one as it was the first year of my brand All For Mimi.\n\nI would tell my 20-year-old self to speak kindly to herself, take each \"mistake\" as a learning curve, and keep moving forward.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/new-zealand-fire-tongariro-national-park/105989176",
        "title": "'Hellscape' fire in Tongariro National Park, New Zealand",
        "publish_date": "Sun, 09 Nov 2025 02:00:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "A business owner says Tongariro National Park, on New Zealand's North Island, resembles a hellscape as a massive forest fire continues to burn out of control.\n\nFire and Emergency New Zealand (FENZ) said the blaze has swelled in size and is now estimated to be covering about 1000ha.\n\nDozens of hikers have been evacuated from the park, and the public is asked to stay away from the area.\n\nLoading Instagram content\n\nSkotel Alpine Resort owner Sam Clarkson said the resort had a grandstand view of the fire on Saturday night.\n\n\"It was like a hellscape — welcome to Mordor — it really was,\" he said.\n\n\"Last night, there was quite a brisk westerly wind, which pushed the fire both east and northwards and the wall of flame was enormous … I would estimate some of those flames are 30 metres high.\n\n\"It was hard to see across the flames to the far side, but any time we did, it was just this wall of orange that was at least 4 kilometres long. Everything the fire service was valiantly trying to throw at it was achieving nothing.\"\n\nHe said, fortunately, the fire was heading away from his resort, progressing up the Mangatepopo Road towards the Tongariro Crossing.\n\nSpring bushfire outlook released Parts of Western Australia, South Australia and Victoria will see increased fire risk this spring, as emergency services unveil their outlook for the season.\n\nThe wind had since dropped along with a blanket of fog on Sunday morning, but rain was not forecast until Monday, Mr Clarkson said.\n\n\"I watched, literally weeping as the fire went closer and closer and closer to the hill, Pukeonake, which is a sensitive sub-alpine environment where the little communities of plant life all huddle together and live out their lives, and it just got toasted,\" he said.\n\n\"It's just an ecological disaster. There is no risk to people or structures, unless the wind really got up.\"\n\nDespite six weeks of rain, the fire has proven to be insatiable, he added.\n\n\"The park was utterly saturated and then it fined up about a week ago, and I think we'd only had seven or eight days of fine weather in a row after a good six weeks of solid rain, so you would not think it's that tinder dry,\" Mr Clarkson said.\n\n\"But the predominant species in the park, at least on the flats, is tea tree, and tea tree is the most flammable native plant there is — once it's off, it's away.\"\n\nThe community had rallied together in the face of the evacuation and closure of Tongariro National Park, he said.\n\nOn Saturday, 43 hikers and a warden from Mangatepopo Hut were airlifted out in response to the fire, according to the Department of Conservation (DOC).\n\n\"In fact, we ended up putting up those people and feeding them … we were part of the effort to look after everybody,\" Mr Clarkson said.\n\nOn Sunday morning, a further nine hikers were evacuated from the national park, having left Waihohonu Hut, a DOC spokesperson said.\n\nDOC said it expects there will be \"significant biodiversity impacts\", given the size of the fire.\n\n'Pretty chill about it'\n\nA local who runs a food truck in Waimarino, a township near Tongariro National Park, said locals were hopeful the fire would not be fanned by winds that had picked up slightly on Sunday.\n\nJohnny Ryburn said he was down swimming at the Whakapapa River on Saturday when the blaze began.\n\n\"It pretty much kicked off while I was out there,\" he said. \"It was pretty small when it started, and from what I know it started around the the road that takes you towards the Tongariro Crossing. From there it just got massive and went up the road and stuck towards the side of Tongariro.\"\n\nDespite this, locals were not too worried, Mr Ryburn said.\n\n\"Everybody's still pretty chill about it, you know? I think because it seems to be staying a lot closer to Tongariro and [Mount] Ngauruhoe people aren't super concerned,\" he said.\n\nA number of helicopters with monsoon buckets and planes are fighting the blaze in Tongariro National Park. (RNZ: Hamish Cardwell)\n\nSix fire trucks, five tankers, six helicopters and two planes\n\nFirefighters from Taranaki and Manawatū-Whanganui were briefed on Sunday morning before beginning work on the second day of operations.\n\nAssistant Commander Nick West said the fire service will have six fire trucks and five tankers on the fireground, supported by six helicopters and two aeroplanes.\n\nThere are no reports of structures being damaged or destroyed and no residents were evacuated overnight.\n\nMr West said it could take a full day of operations to bring the fire under control.\n\nAn RNZ reporter on the scene said the southern line of the fire stretched from State Highway 47 a number of kilometres east into the scrub and young pine, but it was not clear whether the fire had reached the Tongariro crossing track itself.\n\nThe were huge flames in a couple of places in the line, and helicopters appeared to be concentrating on those areas.\n\nThe cause of the fire has not been established and a specialist wildfire investigator will be working on Sunday.\n\nWeather outlook raises bushfire risk An atmospheric \"tug of war\" for control of Australia's weather is taking place this spring, and it is a forecasting nightmare.\n\nResidents in the area are being urged to stay alert to the fire, and keep doors and windows shut to minimise exposure to the smoke. Anyone who feels unsafe, or is vulnerable to smoke is encouraged to self-evacuate and stay with family or friends.\n\nFENZ advises those to the north of the fire should go towards Turangi and those to the south of the fire should go towards National Park.\n\nState Highway 47 Waimarino to Tongariro remains closed between the intersections with State Highway 48 and State Highway 46 with no detours available.\n\nThe Department of Conservation has closed the Tongariro Crossing and associated areas.\n\nA no-fly zone is in place covering the airspace over the fireground and surrounding area, so that firefighting aircraft are not endangered by other aircraft or drones.\n\nRadio New Zealand",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/labor-party-members-vote-for-fracking-ban-to-be-extended/105987602",
        "title": "Blanket ban on controversial mining practice one step closer",
        "publish_date": "Sun, 09 Nov 2025 01:56:35 +0000",
        "category": "finance",
        "authors": [],
        "text": "A controversial mining technique — hydraulic fracturing, or fracking — is one step closer to ending in Western Australia, after WA Labor party members voted for a blanket ban.\n\nFracking involves drilling and pumping fluid into the ground to create fractures, allowing oil and gas to flow to the surface.\n\nCurrently, the fracking ban applies to 98 per cent of WA. The technique is permitted in parts of the Kimberley and Mid West regions under strict regulations and approval processes.\n\nLoading...\n\nHowever Labor party members voted to extend the ban to all parts of WA at the party's state conference on Saturday, the first since WA Labor started its third term in government.\n\nThe move is a departure from the WA Government's current policy, implemented under former premier Mark McGowan, to allow fracking in two per cent of the state.\n\nWA Labor under pressure over fracking ban WA Labor called on to ban fracking to 100 per cent of the state.\n\nIn order for the total ban to be implemented, legislation would need to be passed by the WA parliament.\n\nWhen asked about the issue on Saturday morning, Premier Roger Cook said it was important to balance environmental needs with energy and economic considerations.\n\n\"We want to make sure that we protect the environment, and we want to make sure that Western Australians have access to gas,\" Mr Cook said.\n\n\"Ninety eight per cent of Western Australia is currently not eligible for fracking … so in Western Australia we already have incredibly stringent arrangements in relation to that sort of resource.\"\n\nRoger Cook says WA has placed strict conditions on fracking. (ABC News: Courtney Withers)\n\nEnvironment groups back blanket ban\n\nEnvironmental group Environs Kimberley executive director Martin Pritchard threatened to campaign against a fourth Labor term in government if it didn't rule out fracking.\n\n\"We're going to be working really hard to make sure that people understand what the threat is to the Kimberley, and we believe that's going to be a major problem for Labor,\" Mr Pritchard said.\n\n\"Fracking is banned in the South West, Perth and Peel, and we want it extended to ban fracking in the Kimberley.\"\n\nMartin Pritchard has called for a total fracking ban in the Kimberley. (ABC Kimberley: Dunja Karagic )\n\nMangala Martu Traditional Owner Nuriah Jadai said fracking had the potential to contaminate natural waterways.\n\n\"We just want to keep it safe, we want to keep it clean, we want to keep it fresh for us, and also for the next generation,\" Ms Jadai said.\n\nNuriah Jadai is concerned about the environmental impact of fracking in the Kimberley. (ABC News)\n\nThe state's Environmental Protection Authority is assessing a proposal by US-based oil and gas company Black Mountain Energy to develop a fracking project in the West Kimberley.\n\nThe company is proposing to develop \"one of the world's last large scale onshore unconventional undeveloped gas projects\".\n\n\"Black Mountain Energy is committed to protecting the environment to achieve long-term sustainable operations,\" the company's environment policy statement said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/grampians-hosts-international-ultra-marathon-event/105973226",
        "title": "Beer-fuelled strategy the key to success in 100-mile race",
        "publish_date": "Sun, 09 Nov 2025 01:52:22 +0000",
        "category": "sports",
        "authors": [],
        "text": "More than 700 athletes from 27 nations descended on the Grampians/Gariwerd National Park in western Victoria this week, chasing glory in Australia's first internationally recognised ultra-distance trail event.\n\nAmong the runners in the 100-mile race was Nepal's Sangé Sherpa, whose beer-fuelled strategy and mountain-hardened endurance made him a crowd favourite, even if he did not take the win when he crossed the line on Saturday.\n\n\"Sometimes if there's a beer [offered en route], I just drink it,\" he said.\n\n\"Usually after the race we enjoy [a beer] a lot, so why not during the race?\n\n\"It can change your mind and help you overcome the pain and struggle.\"\n\nSangé Sherpa has competed in ultramarathon races across the globe. (ABC News: Peter Quattrocelli)\n\nThe 44-year-old works as a porter on Kangchenjunga in Nepal's eastern region, and he said his transition into trail running was a natural progression from his life at home.\n\n\"I was born in a very remote village,\" he said.\n\n\" No cars, no transportation — everything you do is on your feet. Since childhood I've been in nature. \"\n\nThe 100-mile event took most competitors more than 24 hours to complete. (Supplied: GPT 100)\n\nIn 2025, Sherpa has already completed ultra-distance races in Hong Kong, France, Spain, Switzerland, Thailand and Indonesia.\n\nAfter taking line honours in last year's Grampians race, he faced stiff competition from a field of international runners this year, drawn by the event's official recognition as part of the World Trail Majors circuit.\n\nSherpa finished the 100-mile course in just over 26 hours, finishing sixth in the men's category.\n\nAmerican athlete Caleb Olsen, currently ranked as the second-best 100-miler in the world, claimed victory in a course record time of just over 21 hours.\n\nHong Kong competitor Man Yee Cheung won the women's 100-mile race in just under 28 hours.\n\nGrampians joins global trail running elite\n\nThe Grampians race is the only leg of the tour in Oceania, joining events held in iconic locations like Mt Fuji in Japan and the Pyrenees in France.\n\n\"What a privilege it is for the Grampians to play host to the Australian leg, representing this region on a global stage,\" event director Colin Taylor said.\n\nMore than 700 runners from 27 nations competed this year across two events — a 50-kilometre race and a 100-mile race.\n\n\"For many of them, it was their very first time in Australia and their first time in the Grampians,\" Mr Taylor said.\n\nSangé Sherpa racing on the Grampians Peak Trail in 2024. (Supplied: GPT 100)\n\nHe said the race followed the entire Grampians Peak Trail across the mountain range, from Mount Zero in the north to Dunkeld in the south.\n\n\"There are lots of 100-mile races throughout the world, but what's unique about this one is that it's single-track,\" he said.\n\n\"What that means is incredibly technical terrain underfoot — your body and mind are constantly having to work.\"\n\nMore than 700 athletes took part in this year's events. (Supplied: Kate Proctor)\n\nThe Victorian and federal governments invested a combined $34 million into the national park, with the Grampians Peak Trail opening in 2021.\n\nWhile trail running might still be considered niche in some circles, the sport has a dedicated following, and the Grampians event has grown sevenfold since its inception in 2023.\n\nThe state government believes the event could become a major tourism drawcard for western Victoria.\n\nTourism Minister Steve Dimopoulos compared it to the Cadel Evans Great Ocean Road Race, citing the positive impact it could have on local accommodation and hospitality businesses.\n\n\"It will start gaining gravitas, and we can help it become even more prominent — this kind of sport lends itself so well to tourism,\" Mr Dimopoulos said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/annemarie-manders-lavender-farmer-victoria-yarra-valley/105968732",
        "title": "Former nurse turns 'absolute passion' for lavender into 35-year career",
        "publish_date": "Sun, 09 Nov 2025 01:43:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Annemarie Manders has hitchhiked across Europe, nursed patients for hours on end, raised two sons and grieved for her late husband, but one of her greatest challenges has involved a small purple flower.\n\n\"I stumbled into growing lavender,\" she said.\n\n\"All I knew was it was a purple flower with a lovely fragrance, so I started out very green.\"\n\nAnnemarie Manders grows two varieties of lavender. (ABC Rural: Faith Tabalujan)\n\nMs Manders has been growing lavender in Victoria's picturesque Yarra Valley for 35 years, but she never dreamed of becoming a farmer.\n\n\"I trained and worked as an operating theatre nurse, so I knew nothing about agriculture,\" she said.\n\n\"But my husband and I bought this old cherry orchard block and wanted to make use of the land.\"\n\nToday the farm is home to more than 12,000 plants of the Lavandula intermedia and Lavandula angustifolia classifications.\n\nMs Manders she and her husband faced a steep learning curve.\n\n\"We had no equipment and no buildings — we didn't even have a tractor,\" she said.\n\n\"But I'm quite impetuous, so I just jumped in the deep end and made plenty of mistakes along the way.\"\n\nAnnemarie Manders has transformed an old cherry orchard into a lavender agritourism business. (ABC Rural: Faith Tabalujan)\n\nToday the farm attracts lavender lovers from around Australia and beyond.\n\n\"We've turned it into an agritourism destination,\" Ms Manders said.\n\n\"So people flock here from November to January when the lavender is in full bloom and we also teach them how it is grown and harvested.\"\n\nA 'neat, tidy' crop\n\nMs Manders said she was immediately drawn to lavender.\n\n\"I'm a very organised person, which was always important when arranging instruments on the operating table,\" she said.\n\n\"So I just love how lavender grows in such neat, tidy rows.\"\n\nBut Ms Manders said it was also a versatile crop.\n\n\"We grow two kinds of lavender — one to put into food products such as teas, ice creams, scones, and cakes,\" she said.\n\n\"The other is used in craft products or sold as bunches to wholesale flower markets as far as Sydney and Brisbane.\"\n\nLavender can be added to various food, including scones. (ABC Rural: Faith Tabalujan)\n\nMs Manders said timing was crucial when it came to harvesting.\n\n\"We pick the edible lavender at the end of November and then the non-edible lavender about a month later,\" she said.\n\nLavender is best picked in the morning, according to Ms Manders.\n\n\"We start picking very early, at around 5:30am or 6am, because that's when the flowers are crisp and the lavender fragrance is at its strongest,\" she said.\n\n\"We then hang all the bunches upside down in the drying shed, where they dry for about two weeks.\"\n\nVictoria's lavender plants are in full bloom from late spring. (ABC Rural: Faith Tabalujan)\n\nOnce the lavender is dried, it is sifted to remove sticks and leaves and poured into a large container.\n\nMs Manders said her approach was positively old-fashioned.\n\n\"You could automate this process, but I'd prefer it to be hands-on so people can see, touch, and smell all the stripped lavender,\" she said.\n\n\"And it's a gorgeous experience.\"\n\nAn 'absolute passion'\n\nFor Ms Manders, growing lavender is a labour of love.\n\n\"From the start I knew I wouldn't make much money,\" she said.\n\n\"But it's an absolute passion of mine and I was determined that the farm would not fail.\"\n\nAnnemarie Manders says she hopes to keep growing lavender for years to come. (ABC Rural: Faith Tabalujan)\n\nMs Manders said she had no intention of retiring.\n\n\"I've been doing this for 35 years and don't think I'll stop anytime soon,\" she said.\n\n\"But when I do, I'll be pushing up another lavender bush I think!\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/kangaroo-collisions-up-on-regional-south-australian-roads/105985252",
        "title": "'Dodging them everywhere': Warning to SA drivers over kangaroo risk increase",
        "publish_date": "Sun, 09 Nov 2025 01:14:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Kangaroo collisions are on the rise across South Australia and regional drivers are urged to take extra care on country roads.\n\nRAA, the state's peak motoring body, has observed a sharp increase in insurance claims from kangaroo collisions over the past year.\n\nIn the South East, casual school bus driver Graeme White says mobs of kangaroos are regularly lining the roads during his morning run into Narracorte.\n\nGraeme White says kangaroo activity has increased all around the South East and into western Victoria. (ABC South East SA: Elsie Adamo)\n\nMr White, who has done the route on-and-off for the past eight years and has been driving on these rural roads for more than 50 years, said he and other bus drivers were seeing more kangaroos than they ever had.\n\n\"You're dodging them everywhere now,\" he said.\n\n\"When you head out of town, the numbers of kangaroos that are feeding in the mornings out in the paddock have increased ... you could see 15 to 40 kangaroos at one time.\"\n\nThis increased activity has caused him concern about road safety in the region.\n\nWhile a kangaroo would not likely cause an injury to passengers when hit by a bus, the damage it could do is still significant.\n\nA mob of kangaroos near the road on the outskirts of Naracoorte. (Supplied: Graeme White)\n\nBut the safety risk is much higher for smaller vehicles.\n\nTwo of Mr White's family members have had car collisions with kangaroos in recent months on local regional roads.\n\nWhile both came away uninjured, it reminded the family how risky regional roads can be.\n\n\"At 6:45am in the morning when you're heading out of town on your run … you're dodging them everywhere now,\" he said.\n\n\"They are a danger for sure.\"\n\nIncreased collision claims across state\n\nIt is not just drivers in the South East who have noticed the increase in kangaroo activity on the roads.\n\nEarlier this year, the RAA released updated statistics which showed a big jump in claims connected to kangaroos across the state.\n\nSurvey results of South Australia's kangaroo population are expected to be released by the end of the year. (Supplied: Macro Group Australia)\n\n\"We've seen a pretty significant jump in kangaroo collisions this year, probably about 40 per cent higher on what we have been seeing over the past couple of years,\" RAA senior traffic engineer Matthew Vertudaches said.\n\n\"We've seen over the course of this year pretty dry weather conditions, which often do cause wildlife to come closer to the road.\"\n\nKangaroo collisions are the most reported collision with wildlife that is reported to the RAA, with over three quarters taking place on regional roads.\n\n\"The real concern with this is that we're travelling at high speed,\" Mr Vertudaches said.\n\nFarmers face growing kangaroo problem in SA Farmers are calling for a cull of kangaroos, which they say are being forced onto farmland by drought and dry conditions and consuming what little feed and water they have.\n\n\"Whilst the collision directly with an animal won't usually result in any serious injuries to vehicle occupants, the risk of potentially swerving and colliding with something else on the roadside certainly are there.\n\n\"When you do come across wildlife, don't suddenly swerve because a collision with a tree or a Stobie pole or rolling over on the roadside could be a far worse outcome.\"\n\nOf regional towns Mount Gambier had the highest kangaroo collision claims with RAA in the last year, followed by Whyalla, Port Augusta, Mount Compass, McLaren Vale and Naracoorte.\n\nRoos make up majority of crash repairs\n\nManaging director at Bricey's South East Collision Repairs Leon Brice has been working in the industry for more than four decades.\n\nLeon Brice says a mix of both locals and tourists need repairs from collisions with kangaroos. (ABC South East SA: Elsie Adamo)\n\nAbout 70 per cent of repair work is due to collisions with kangaroos, but that was not always the case.\n\n\"Previously there was a large … variety of collision incidents, we used to do a lot of rollovers, a lot of single-car and two-car impacts,\" he said.\n\n\"But with the introduction of safety features on vehicles … it's definitely made a difference over the years to our work supply for sure.\n\n\"Now it's mostly kangaroo collisions we are fixing.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/international-students-struggle-with-costs-in-australia/105815354",
        "title": "$200 a week and tinned fish: Cost of living hits international students",
        "publish_date": "Sun, 09 Nov 2025 01:07:05 +0000",
        "category": "finance",
        "authors": [],
        "text": "Alipriya Biswas was so short of money when she began studying in Australia, she lived on rice and tinned tuna for a year.\n\nWhen the 21-year-old journalism student moved from India to Melbourne, she had no friends or family for support — and spent her first night without a bedsheet.\n\n\"$200 a week is nothing for an Australian to live on,\" she said.\n\n\"But that's all I had.\"\n\nNow four years into her studies at the University of Melbourne, Ms Biswas said the experience of international students in Australia was \"completely misunderstood\".\n\nAlipriya says she had no references to help her smoothly secure a job. (Supplied: Alipriya Biswas )\n\n\"Many people think we come here with endless money from rich families and have everything set up when we get off the plane,\" she said.\n\n\"But that's not true.\"\n\nInternational students are frequently blamed for adding to rising costs in Australia since the COVID pandemic — despite reports finding they had not been a major driver of higher rents and inflation.\n\nBut international students have told the ABC of their own experiences with Australia’s cost-of-living crisis, saying they were struggling to make ends meet.\n\nResearchers studying the pressures on Australia’s international students say many find themselves in highly precarious financial and living situations.\n\nAlipriya says her first job in Australia was a \"not quite legal\" bartending job in a club. (Unsplash: Naitian Wang)\n\n\"There is a lot of suffering out there amongst international students, an enormous amount of stress and anxiety as they try to not only deal with their academic studies, but also try and survive financially,\" said Alan Morris, a professor focusing on urban and housing studies at the University of Technology, Sydney.\n\nHe expects even more international students are experiencing financial hardship since he co-authored a 2020 report finding that one in five were skipping meals because they were short of money.\n\n\" For some students, they are very isolated and it's a battle from day one. \"\n\nInternational students come to Australia under visa rules limiting how much they can work while studying, and that require them to have money for living costs before arriving.\n\nThey have to prove they have access to $30,000 in order to secure their visas.\n\nStudents are only allowed to work 48 hours a fortnight while studying — a rule aiming to let them focus on their learning.\n\nBut experts warn the solution to their financial stress is not as simple as changing these visa rules — which they say risks creating other problems for students.\n\n'I was under huge stress'\n\nMs Biswas's parents made \"countless sacrifices\" to fund her studies — including cutting back on meals and surviving mostly on lentils and rice back home.\n\nWhile she proved she had access to $30,000 for living costs and secured her visa, she said the family could only afford to release small amounts after she moved to Melbourne.\n\nThe money was not enough, and after six months looking for work, she found a bartending job that helped support her through her studies.\n\nMore uncertainty on the cards for international students The past year has seen the international education sector thrown into turmoil, as Labor targeted students in their plan to drive down migration. That uncertainty is set to continue into 2025.\n\nProfessor Morris said in many cases, while families of international students paid tuition fees, they expected them to work and pay their own living costs.\n\nAbout 36 per cent of students relied on paid work for their main income, and for students from low-income countries, that figure was 78 per cent, according to the 2020 report on international students.\n\n\"Those students that come from low-income families [are] especially vulnerable because they can't go back to their parents necessarily and ask for more money,\" Professor Morris said.\n\nOthers who could receive more help from their families were reluctant to ask.\n\nInternational students have not driven rents and inflation substantially higher, RBA says An RBA paper suggests the rapid growth in foreign students post-pandemic did not play a big role in pushing rents higher.\n\nOne international student from China studying at the Australian National University, who asked to remain anonymous, said she was surprised at the high cost of food in Australia.\n\n\"In China, restaurants are very cheap. We eat out a lot — it's part of our lifestyle,\" she said.\n\n\"Here, it's impossible. I ate instant noodles or fast food until I found work.\"\n\nShe started working up to the maximum 48 hours a fortnight on top of her studies to keep up with costs, rather than ask her family for more help.\n\nThe pressures of working while studying felt overwhelming at times.\n\n\"Uni is very hard … and I was under huge stress at that time,\" she said.\n\n\"I couldn't really sleep well and … I was very anxious about many things.\"\n\nEven for international students who work, the income does not always cover living costs, according to Queenie Kwan Yee Siu, an ANU researcher focusing on the Hong Kong diaspora.\n\nSome international students are surprised by the cost of eating out in Australia compared to their home countries. (Unsplash: Angelyn Sanjorjo)\n\nProfessor Morris said international students also found paid work impacted their studies.\n\n\"Some students find themselves working two to three jobs and of course their academic results suffer dramatically,\" he said.\n\n\"They tend to underplay their academic work because they're so focused on trying to survive.\"\n\nPhil Honeywood, chief executive of the International Education Association of Australia, warned against letting international students work more hours, saying it could backfire on their academic performance.\n\nExperts say income from work does not always cover living costs for international students. (ABC News: Maani Truu)\n\n\"They're here to study first — work is there to supplement living costs,\" he said.\n\n\"Working more hours won't solve the crisis.\"\n\nBut experts also express doubts about requiring students to have access to more savings to pay living costs, to secure their visas.\n\n\"The problem is that cuts out a lot of opportunities for some students to get here in the first place … in a sense, it's robbing Peter to pay Paul,\" said Gaby Ramia, a professor of policy and society at the University of Sydney.\n\nLooking for a 'win-win' on housing\n\nFor My Huynh Ngoc Giang, a 21-year-old IT student from Vietnam, the decision to study in Australia was about comfort and opportunity.\n\nBut when she settled on moving to Melbourne, she had not factored in its soaring living costs — especially in housing.\n\nMy Huynh Ngoc Giang says international students face some barriers in finding housing. (ABC News: Libby Hogan)\n\n\"The rental market is so competitive,\" she said.\n\n\"It took me months to find a place. International students don't stand a chance [without] rental history.\"\n\nAt first, she moved into student accommodation, which cost $500 a week for what she described as \"a tiny space\".\n\n\"You can touch both walls with your arms,\" she said.\n\n\" Even military barracks have more space. \"\n\nShe found a cheaper share house in the suburbs after several months, although that came with new trade-offs, including long commutes and safety concerns such as travelling home late from class.\n\nProfessor Morris said Australia's rising housing costs were likely to have left international students even more financially vulnerable since the pandemic.\n\n\"Even finding accommodation would be very difficult,\" he said.\n\nAustralia could look to innovations overseas for solutions, including in Canada, where some international students were living with older people, Professor Morris said.\n\n\"In exchange for cheaper rents, the student helps the elder person in terms of washing up, taking the dustbins out, maybe watches TV a couple of nights a week with them,\" he said.\n\n\"It's a win-win situation.\n\n\"I really do feel that there's capacity for [universities] to think of more innovative solutions rather than just letting international students find their way.\"\n\nProfessor Ramia said access to public transport concessions equal to domestic students, and access to healthcare benefits would also help relieve pressure.\n\nWhat it’s really like to be an international student in Australia A report reveals international students experience poorer mental health than their domestic counterparts.\n\nExperts also said there was information available to help students research Australia's living costs before deciding to move, while the Australian government also has an online calculator tool.\n\nA spokesperson for Assistant Minister for International Education, Julian Hill, said the federal government was \"sympathetic to the financial stress that some international students may face while studying in Australia\".\n\n\"It is important to remember that international students are required to demonstrate their ability to financially support their studies prior to coming to Australia as part of the student visa application process,\" they said.\n\n\"We want international students to be able to do what they came here to do. Settings around work hours are designed to strike a balance between providing opportunities for international students to work without compromising their education.\"\n\nAdapting to cost of living pressures\n\nDespite its living costs, researchers say Australia remains attractive for international students compared to other countries.\n\nThere were more than 1 million international student enrolments last year.\n\n\"We're one of the only countries where students can bring their partners, who can work full-time,\" Mr Honeywood said.\n\nAustralia also offers two to three years of full-time post-study work, helping graduates repay loans and build careers, he said.\n\nMs Queenie Siu, the ANU researcher, said many students were also using their experiences of the cost-of-living crisis as a chance to pick up new skills helping them cut costs, like cooking or driving.\n\n\"That's still very attractive to international students,\" she said.\n\nMy Huynh says finding housing took months of networking and searching. (ABC News: Libby Hogan)\n\nFor My Huynh, adapting to her new home means finding ways to make savings where she can.\n\n\"Late-night supermarket discounts help too. You just have to be proactive and try things you never thought you would before.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/20-years-triplej-j-awards-autralian-music-awards-trophies/105982742",
        "title": "The history of the J Awards aligns with Australia's best music",
        "publish_date": "Sat, 08 Nov 2025 21:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Every November, triple j celebrates Ausmusic Month, commemorating the best and brightest in homegrown music talent.\n\nThe centrepiece? The J Awards, a tradition that celebrates its 20th anniversary in 2025.\n\nSimilar to station staples like the Hottest 100, Like A Version and One Night Stand, the J Awards is a way for triple j and its sister networks — triple j Unearthed and Double J — to honour the sheer excellence blossoming in our backyard each year.\n\nThis year's awards — taking place on Wednesday — is a particularly special milestone, marking two decades of handing out trophies and coinciding with triple j's 50th birthday.\n\nTo mark the occasion, we're taking a trip back down Ausmusic memory lane.\n\nMeet all your 2025 J Awards nominees It's time again to crown the annual J Awards winners, celebrating the cream of the crop of Australian music in 2025.\n\nHow did the J Awards start?\n\nTo commemorate triple j's 30th birthday, the station launched a new annual prize: The J Award.\n\nInitially, it was a single category, Australian Album of the Year, designed — as it does to this day — to celebrate an outstanding record for \"its creativity, musicianship, contribution to Australian music, and audience impact.\"\n\nThere were 15 nominees in that first year, reflecting a diverse range of genres, sounds, and scenes from around the nation.\n\n\"We knew there'd be one winner but wanted to honour and pay respects to some of the great albums that have come out in the past 12 months,\" then triple j music director and head of the judging panel, Richard Kingsmill, said at the time.\n\nContenders included the solo debut from Powderfinger frontman Bernard Fanning, albums from singer-songwriters Ben Lee, Clare Bowditch and Lior, as well as Aussie hip hop acts Downsyde and The Herd.\n\nHeavy rock trio Cog and revered noise rock band The Drones were also in the mix, alongside releases from Architecture In Helsinki, The Beautiful Girls, Faker, Pivot, and WA bands The Panics and Gyroscope.\n\nHowever, the victor ended up being Sydney-bred rockers Wolfmother with their self-titled debut album, whose woolly, galloping riffs, mystical lyricism and organ-tinged progressive rock harkened back to genre titans like Led Zeppelin and Black Sabbath.\n\nWolfmother members (from left) Chris Ros, Andrew Stockdale and Myles Heskett accept the inaugural J Award. (triple j)\n\nLed by singer-guitarist Andrew Stockdale, Wolfmother stood apart not only from indie-electro favourites and Modular label-mates The Presets and Cut Copy, but also the rootsy surf rock and homegrown hip hop that was trending around Australia.\n\n\"Thanks to triple j for asking for our demo a year-and-a-half ago when we'd played one show at Vic On The Park on a Sunday night,\" Stockdale told the crowd assembled for the inaugural 2005 J Award ceremony, hosted and broadcast from Sydney's storied Annandale Hotel.\n\nWolfmother's debut swiftly made them a success at home and abroad, achieving Gold status in the UK, Germany, Canada and the US. In 2006, the band's burly single Woman won the Grammy award for Best Hard Rock Performance, the first Australian Grammy victory in any category since Men At Work in 1984.\n\nThe album also won the group three ARIA Awards (Breakthrough Artist, Best Rock Album, Best Group), while six songs charted in triple j's Hottest 100 of 2005 — establishing a record for most songs in a single countdown that lasted almost 20 years.\n\nWhere are they now? Wolfmother has struggled to reach the same stratospheric heights since, but Stockdale continues to tour and release albums, including the group's sixth, Rock Out, in late 2021.\n\nThe J Awards expand\n\nHilltop Hoods won the award in 2006 with fourth album The Hard Road, and a second category was added in 2007: the triple j Unearthed Artist of the Year award.\n\nCreated to tie in with the online platform and digital radio station, the Unearthed J Award has featured many names who would go on to establish impactful careers.\n\nAmong them is Boy & Bear (winners in 2010), Townsville folk collective The Middle East (2009), The Rubens (in 2012, who'd go on to top the Hottest 100), and Meg Mac (2014).\n\nBeloved Brisbane band Ball Park Music, who are currently supporting Oasis on their reunion tour, were named Unearthed Artist of the Year back in 2011.\n\nTheir debut album Happiness and Surrounding Suburbs also earned a nod in the album category, giving them the distinction of being the first act in J Awards history with a double nomination.\n\nBall Park Music accept their Unearthed Artist of the Year award at the 2011 J Awards. (triple j)\n\nFirst Nations talent like Miss Kaninna, King Stingray and JK-47 win the Unearthed category in recent years, along with Kenyan-Australian artist Elsy Wameyo and Melbourne-based producer and rapper, Lithe.\n\nThe very first Unearthed Artist of the Year winner, in 2007, was Young + Restless, beating out nominees Cuthbert and the Nightwalkers, Illzilla, Institut Polaire, and Leroy Lee.\n\nHailing from Canberra and sporting the angular guitars and club-friendly disco pulse redolent of many late '00s indie acts, Young + Restless won an Unearthed competition to play Homebake festival in 2006 and are best remembered for their singles Police Police and Satan.\n\nWhere are they now? Following the release of their debut album in 2007, the band broke up but high school friends, frontwoman Karina Utomo and guitarist Ash Pegram, went on to form hard rock and metal group High Tension in 2012.\n\nUtomo would also front black metal trio Kilat and collaborative project Rinuwat, drawing on her Indonesian heritage and, with the latter, traditional Southeast Asian instrumentation.\n\nVideo (did not) kill the radio star\n\nThe 2008 J Awards saw club-honed Sydney duo The Presets win Australian Album of the Year with their second album, Apocalypso, while Brisbane six-piece John Steel Singers picked up the Unearthed J Award.\n\nThat same year also birthed a new category, Australian Music Video of the Year — a gong that has since been co-presented and evaluated alongside ABC TV's long running late night program, rage.\n\nLoading Instagram content\n\nNotable music video winners over the years include wig-wearing pop sensation Sia with 2014's Chandelier, Client Liaison’s 2017 clip A Foreign Affair featuring Tina Arena, Korean-Australian rap group 1300's 2022 video for Oldboy, and Clubfeet for Everything You Wanted in 2013, which caused a stir when One Direction were accused of copying the clip.\n\nThe inaugural 2008 winner, besting videos from The Presets, Angus & Julia Stone, TZU and Josh Pyke, was The Herd's 2020, a critique on Australia's involvement with North America's War On Terror.\n\nDirected by Mike Daly, the clip features members of The Herd — including Elefant Traks co-founder Urthboy — digitally integrated into newspaper print headlines and articles.\n\nWhere are they now? Pioneering label Elefant Traks is, sadly, no more, but The Herd are still going strong. In fact, they're heading on tour in February to mark the 20th anniversary of their album The Sun Never Sets.\n\nDirector Danny Cohen (third from left), Tash Sultana, D.D Dumbo, and members of King Gizzard & the Lizard Wizard pose with their 2016 J Awards. (triple j)\n\nSignificant Accolades\n\nSarah Blasko became the first female solo artist to taste J Awards glory in 2009, with her third studio album As Day Follows Night, while Washington achieved the same feat the following year in the Australian Music Video category (for Sunday Best, directed by Mairi Cameron and Stephen Lance).\n\nIn 2010, the Australian Album of the Year went to InnerSpeaker, the debut from Tame Impala, on which West Australian polymath Kevin Parker lifted from the playbooks of late 1960s and 1970s rock and blues and fused it with psychedelic, homespun textures.\n\nThe globally renowned follow-up, 2012's Lonerism, suffused more pop into his kaleidoscopic production. It made Tame Impala the first, and to this day only, artist to have taken out the Australian Album of the Year J Award more than once. Every single one of Tame Impala's subsequent albums has been nominated, including this year's Deadbeat.\n\nA.B. Original, the rap power couple of Briggs and Trials, became the first Indigenous artist to win a J Award, with their 2017 award-hoovering debut Reclaim Australia.\n\nA.B. Original's debut album would win the Australian Music Prize and five trophies at the AIR Awards. (triple j: Zak Kaczmarek)\n\nGotye scored 2011's marquee J Award with his album Making Mirrors, featuring worldwide hit Somebody That I Used To Know. Meanwhile, super producer Flume's self-titled debut scored the Australian Album of the Year in 2013.\n\nBoth instances saw triple j getting ahead of the awards season both locally and internationally, awarding Gotye and Flume before the ARIAs and Grammys did.\n\nWhere are they now? After his global success, Gotye, or Wally de Backer to his folks, stepped back from the spotlight to focus on other projects. Namely, launching independent record label Spirit Level with bandmate and former Double J presenter Tim Shiel and embarking on preservation projects for electronic music pioneer Jean-Jacques Perrey and backing the Melbourne Electronic Sound Studio (MESS).\n\nHe continues to produce and release music, often with his first band The Basics, but at a much more grassroots scale. Oh, and Kimbra is still somebody that he knows.\n\nA new station, a new award\n\nIn 2014, following the launch of Double J, which aimed at an older listening demographic, the Double J Australian Artist of the Year category joined the J Awards festivities.\n\nEstablished to celebrate an Australian artist of group with a stand-out year through the release of new music, live performances, or making an impact on Australian arts and culture, the inaugural winner was Mia Dyson.\n\nHer more mature songwriting and assured roots-rock sound suited an audience perhaps no longer drawn to the triple j sound, epitomised by Chet Faker and his blue-eyed soultronica on Built On Glass, an album that not only took out the 2014 Australian Album of the Year but dominated the Hottest 100 and ARIA Awards.\n\nMia Dyson continues to record and tour new music, including her 2024 Double J Feature Album Tender Heart. (triple j)\n\nOther Double J Hall of Famers include rock icons Midnight Oil and Tim Rogers; late, great Indigenous inspirations Archie Roach and Gurrumul; singer-songwriters Jen Cloher and Missy Higgins.\n\nIn 2016, the wildly prolific King Gizzard & the Lizard Wizard became the first act to score multiple J Award wins, taking out Double J Australian Artist of the Year and Australian Music Video of the Year (for People-Vultures, directed by Danny Cohen and Jason Galea).\n\nA few years later, dynamic Zambian-Australian rapper Sampa The Great mirrored that milestone, winning the 2019 Double J Australian Artist of the Year and Australian Music Video of the Year (Final Form directed by Sanjay De Silva).\n\nSpeaking of double dippers, Claudia Sangiorgi Dalimore is the only director to win the music video J Award twice. First, helming the 2018 clip for Mo'Ju's Native Tongue, and again last year, for Emily Wurramara's Lordy Lordy featuring Tasman Keith.\n\nLoading Instagram content\n\nDone Good and Live Act\n\nIn 2019, the J Awards expanded to five categories with the addition of the Done Good Award, designed to recognise achievements outside of traditional music formats.\n\nThat included those who might not necessarily be musos themselves, with the initial round of nominees including Paralympian Dylan Alcott, the National Indigenous Music Awards, behind-the-scenes hit-maker Sarah Aarons, and *checks notes* Harry 'the Poo Roadie' for Boy & Bear.\n\nThe first Done Good Award went to Heidi Lenffer, recognising her work fronting environmental organisation FEAT.\n\nThe category ran for four years, awarding philanthropy work by Kobie Dee, Jaguar Jonze's fearlessness combatting sexual misconduct in the music industry, and COVID-era concert series Isol-Aid.\n\nHeidi Lenffer accepts the 2019 Done Good J Award. (triple j: Jess Gleeson)\n\nIn 2023, Done Good was retired for the Australian Live Act of the Year award, celebrating the mind-blowing shows and tours that fans couldn't stop talking about.\n\nAngie McMahon took out the gong last year, while previous J Award victor Genesis Owusu was named the live music winner in its first year.\n\nThat made the Ghanian-born, Canberra-based dynamo the artist with the most J Awards to date, following his 2021 sweep of the Australian Album of the Year (for his debut Smiling With No Teeth) and Australian Music Video of the Year (The Other Black Dog directed by Riley Blakeway).\n\nWhere are they now? Heidi Lenffercontinues to work with FEAT. on a range of eco-minded campaigns and initiatives to reduce live music’s carbon footprint. She also found time to reunite with the members (including her brother) of Sydney band Cloud Control for a 15th anniversary tour of their J Award-nominated debut album, Bliss Release.\n\nWith homegrown music struggling on the ARIA charts, along with Australian festivals and live music venues suffering complex changes, the simple act of recognising the brilliant things happening here at home, honouring and cultivating it, is always welcome.\n\nThe 2025 J Awards happens on triple j, Double J, and triple j Unearthed on Wednesday, 12 November. Get all the info here.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/oasis-leave-australia-triumphant-after-gigantic-sold-out-tour/105989138",
        "title": "Oasis leave Australia triumphant after gigantic sold-out tour",
        "publish_date": "Sun, 09 Nov 2025 01:05:19 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "\"I've waited 20 years for this,\" the stranger said to me, post hug, about halfway through Oasis's classic Don't Look Back in Anger.\n\nIn front of us, another duo — strangers or not — were having the exact same moment, together, arm in arm.\n\nOver to the left, grown men in their 50s, adorned in Oasis Live 25 bucket hats openly wept. For this, after so long and so much disappointment, this was their therapy.\n\nThis pure outpouring of emotion was no doubt replicated thousands of times during Oasis's five Australian concerts, in Sydney and Melbourne, over the past week and a half.\n\nLiam Gallagher, on stage in Melbourne, was in fine form for the Australian leg of the world tour. (AAP: Joel Carrett)\n\nPlaying to a combined audience of about 320,000 people, Liam and Noel Gallagher's return to Australia for this much-hyped tour has been nothing short of a triumph.\n\nIt has taken over social media.\n\nSparked singalongs on the street.\n\nLoading Instagram content\n\nGiven the manufacturers of bucket hats — the unofficial Oasis uniform — an early pathway to retirement.\n\nAnd even given an economic boost to the two cities — a small bar in Melbourne personally thanked the Gallagher brothers for giving the city's bar scene a much-needed shot in the arm, with fans drinking a week's worth of takings in one day alone.\n\nBut, most importantly, this tour, their first in Australia since 2005, has put the spotlight back on Oasis's music: soaring anthems that too often were overshadowed by controversy or petty bickering between the brothers Liam and Noel.\n\nNo, not this time.\n\nNo way.\n\nI was lucky enough to attend two shows of the Australian tour, one in Melbourne and the band's final show in Sydney on Saturday night.\n\nComing out hand-in-hand at those two shows (and all five Australian shows), age — and no doubt the promise of as much as $100 million each in takings over the 41-show tour — has seemingly matured the Gallaghers.\n\nThis was a celebration; a joyous occasion.\n\nOne of the great living rock 'n' roll bands saying: it's good to be back.\n\nThere was no sign of past squabbles from Liam and Noel Gallagher in a seamless Australian tour. (AAP: Joel Carrett)\n\nGood to be back\n\nThis tour, announced way back in October last year with such fanfare, followed the UK and European tours and, like them, sold out promptly. It was perhaps only rivalled in hype, in recent memory, by Taylor Swift's Era's tour (and yes, she played to more people — about double). But as it has been put to me \"this is Eras, Gen X edition\".\n\nBut still, on the back of the announcement, there were the obvious concerns:\n\nThey hate each other, don't they?\n\nWould they actually make it to Australia?\n\nAren't they just doing it for the money?\n\nFrom the first chords of Hello, the opener of Oasis's beautifully curated 23-song set, it was obvious: this time things would be different.\n\nSurrounded by gigantic LED screens, the brothers and their brilliant cohort of backing musicians were on song.\n\nThey sounded gigantic.\n\nThis was a different line-up from last time, when in 2009 the siblings' bitter feud boiled over into a scuffle moments before arriving on stage to play Rock en Seine festival in Paris.\n\nThis was a band that appreciated the past and did not feel squeamish about it, embracing it and making it soar.\n\nFireworks marked the end of the Australian tour in Sydney on Saturday night. (ABC News: Nick Sas)\n\nLeaning heavily on their glory years of the mid-1990s, the boys led the adoring masses in front of them on a singalong of their greatest hits set, leaving no-one disappointed.\n\nLive Forever.\n\nStand By Me.\n\nChampagne Supernova.\n\nWonderwall\n\nDon't Look Back in Anger.\n\nThey were all there — the last three in an encore that was utterly euphoric.\n\nWatch Take 5 with Zan Rowe on ABC iview Icons in music and screen join Double J host Zan Rowe to delve deep into intimate moments in their lives as they share five songs they love.\n\n\"There was a moment where Oasis started to play one of my songs and everyone joined in,\" Noel Gallagher, nicknamed The Chief, told Zan Rowe in 2023, reminiscing about the writing of the band's first album.\n\n\"And at that moment I was like, 'We are going to rule the f***ing world!'\"\n\nLooking around at both the Melbourne and Sydney shows, you could not argue otherwise.\n\nLive forever\n\nOf course, the tour was served up with a heavy dose of nostalgia.\n\nBut interestingly, amongst the archetypal English lad crowd (yes, there were tens of thousands of them, absolutely loving it) a new generation has discovered these tunes.\n\n\"I was up at the Etihad [Stadium] in Manchester last night and a couple of young lads, teenagers — could've only been one or two when we broke up — were like … massive fans and getting giddy,\" Noel said in the same 2023 interview.\n\n\"It's an amazing thing that it's stood the test of time.\"\n\nThey have. And if the hundreds of thousands of Australians Oasis fans — both young and old — are anything to go by, they'll continue to live on through the generations.\n\nAs Noel's brother, Liam, said as they left the stage in Sydney on Saturday night: \"I know we can be twats, but thanks for sticking with us.\"\n\nIt's good to be back.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/wallabies-hurting-after-test-rugby-loss-to-italy/105989132",
        "title": "Stunned Wallabies 'hurting' after shock capitulation to Italy",
        "publish_date": "Sun, 09 Nov 2025 00:49:29 +0000",
        "category": "sports",
        "authors": [],
        "text": "Wallabies captain Harry Wilson says he is \"hurting\" after Australia's 26-19 loss to Italy, while coach Joe Schmidt is lamenting his side's \"flat performance\".\n\nDisplaying all-too-familiar ill-discipline, the Wallabies surrendered a second-half lead to slump to a sixth defeat in their past eight Tests under Schmidt in another hammer blow ahead of next month's 2027 Rugby World Cup draw.\n\nCurrently ranked seventh in the world, the Wallabies will likely need to beat powerhouses Ireland and France in their remaining two spring tour fixtures to snatch an all-important top-six seeding for the global showpiece in Australia in two years' time.\n\nItaly vs Wallabies live The Wallabies slump to consecutive defeats on their spring tour, as Italy comes from behind to win in Udine.\n\nSuch a scenario looks highly unlikely after the Wallabies produced another insipid performance, a week after falling 25-7 to England at Twickenham.\n\nThe last time Australia lost to Italy, for a first time ever three years ago in Florence, fellow New Zealand coach Dave Rennie was sacked barely a month later.\n\nRugby Australia has already locked in Les Kiss to take over from Schmidt in mid-2026.\n\nNarrow wins over Argentina and Japan have been Australia's only two victories in eight Tests since the Wallabies' mighty triumph over the world champion Springboks at Ellis Park in August.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\nSchmidt's winning strike rate has now slumped to 42 per cent, one of the worst Wallabies coaching returns in history.\n\n\"I'm pretty gutted, to be honest,\" Schmidt told Stan Sport.\n\n\"We just look a bit flat. I said progress isn't linear, but that was a flat performance. That's a dip we can't afford to have.\n\n\"And we've got two massive games coming up now, so we're going to have to just recuperate as best we can and throw everything into the Irish game now.\"\n\nSkipper Harry Wilson was also unable to hide his anguish after the latest setback.\n\n\"We're hurting,\" he said.\n\n\"We wanted to fix up from last week. We said 'we're going to fix it up' and we didn't.\n\n\"We want to be a team that does what we said we're going to do and we didn't do that tonight.\"\n\nThe Wallabies face Ireland next Sunday morning (AEDT) in Dublin, before finishing their spring tour against France in Paris.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/celebration-of-wa-s-food-history/105985950",
        "title": "Spearmint milk and Hawaiian packs: WA's food delicacies in exhibition",
        "publish_date": "Sun, 09 Nov 2025 00:46:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "\"Everyone has a relationship with food,\" David Craddock, manager of heritage and engagement at the State Library of Western Australia, says.\n\nIn A Recipe for Life: The Food That Shapes Us, the library has delved into its archives of photography, films and even old menus and advertisements to tell the story of how we eat, from pre-colonial times to the present day.\n\n\"We all need to eat, and we've found food has enabled us to explore all kinds of things — migration, gender, economics, commerce,\" Mr Craddock says.\n\nThe Recipe for Life exhibition celebrates WA's food culture and history. (ABC News: Emma Wynne)\n\nIt is all there on the walls of the ground floor, the maps and early photographs, the oral history, the menus of once-fashionable, long-forgotten restaurants that the librarians of the time were savvy enough to add to their collection.\n\nAnd on one panel, the story of WA's part in an industry that never wins Michelin stars but which figures in many fond childhood memories.\n\nThe founders of WA's early takeaway venues were enterprising and looked to America for new ideas.\n\nWhile fish and chips had long been a staple, the rising affordability of chicken in the 1970s and the entry to Australia of US brand Kentucky Fried Chicken inspired locals to have a go.\n\nThe official opening of a new Red Rooster Barbecued Chicken store in Perth, 1973. (Supplied: State Library of Western Australia)\n\nThe first Red Rooster outlet in Australia opened in Kelmscott, in Perth's south-eastern fringe.\n\nThe founders were Peter and Theo Kailis, a family of Greek migrants famous, then as now, for their involvement in the seafood industry.\n\n\"The Kailis family is all throughout this exhibition,\" Mr Craddock says.\n\n\"Their family has made an inordinate contribution to food in Western Australia.\"\n\nChicken Treat in 1990. (Supplied: State Library of Western Australia)\n\nWhile the family's heart may have been in fish, they were quick to spot how popular chicken and chips would prove to be.\n\n\"Fast food really did spring up in the 70s. We had things like fish and chip shops and that sort of fast food, but when we're talking about chains and things like that, it was the 70s,\" food historian Lauren Samuelsson says.\n\n\"Australians had always loved films. We would go to the cinema quite a bit, and so a lot of American influence came through that,\" Dr Samuelsson says.\n\n\"We were pretty obsessed with America at that time.\"\n\nAnd while they might have been inspired by KFC, there was a local spin on the preparation — the rotisserie chicken.\n\nLauren Samuelsson says deep-fried pineapple is a very Australian thing. (Supplied: Lauren Samuelsson)\n\n\"The rotisserie chicken was definitely an Australian thing,\" Dr Samuelsson says.\n\n\" I can't think of a fast-food restaurant in America that does the rotisserie chicken like Red Rooster does. \"\n\nIt was also the time when chicken was in transition from being a luxury food in the post-war decades — more expensive than beef or lamb — to becoming a more affordable, everyday food.\n\n\"For Australians in the 1970s, chicken had only just become really affordable for people,\" Dr Samuelsson says.\n\n\"People didn't eat out as much, so if you're going to have a takeaway or something, then a roast chicken would seem like a pretty special thing to be eating.\"\n\nWas this Perth's first fast food joint? When Bernard Hardwick started selling finger food from caravans in 1939, he may have become the first to sell fast food in Perth and quickly became a city institution.\n\nThe American influence was added to with the addition of the Hawaiian pack, devised by Peter Kailis to throw a deep-fried banana and pineapple ring into the meal.\n\nDr Samuelsson believes it fits with the trends at the time.\n\n\"The pineapple is a very Australian thing. If you think of an Aussie burger or whatever, the thing that defines that is the pineapple and the beetroot. It's something that we really adopted pretty quickly,\" she says.\n\n\"And then that Hawaiian, tropicana vibe was really popular throughout the 50s and 60s, you think tiki bars and stuff like that were really popular.\n\n\" So I can see why he would think that a bit of pineapple and a banana fritter would be the way to go with a piece of chicken. \"\n\nWhile the Kailis brothers sold the Red Rooster business in 1981, Peter Kailis continued to enjoy Hawaiian packs into his 90s and remained proud of his role in the business.\n\nA host of other local chicken takeaways sprang up, many now lost to history or subsumed by Red Rooster, but Chicken Treat, the chain founded by Frank Romano, still remains a WA-only chain, despite sharing an owner with Red Rooster.\n\nHungry Jack's on William Street in Perth, circa 1977. The menu board shows the price of a Whopper was 85 cents. (Supplied: State Library of Western Australia)\n\nIn line with the craze for all things American, after McDonald's entered Australia in 1971, local businessman Jack Cowin looked at US rival Burger King.\n\nBut, with another restaurant already named Burger King, Mr Cowin named the local version Hungry Jack's and opened the first outlet in the Perth suburb of Innaloo in 1971.\n\nIt has now spread across Australia and is still owned by Jack Cowin's private company.\n\nWhile fast-food outlets are generally prized for the uniformity and consistency of their offering, leaving little room for state differences, there are some West Australian treats that stand out.\n\nA Masters Milk truck in 1954. (Supplied: State Library of Western Australia)\n\nWhile many dairies experimented with flavoured milk, Masters Dairy, which was established just outside Perth in Byford in 1925, put its own twist on the product.\n\nAs well as coming out with chocolate and strawberry, they also came out with a green-coloured, spearmint-flavoured milk.\n\n\"We do tend to have our own little unique bubbles,\" Mr Craddock says.\n\n\" Spearmint milk, I think, is a very WA thing. \"\n\nSpearmint milk was developed in 1964 and seems to have remained a West Australian delicacy. (ABC News: Emma Wynne)\n\nEvidence for its existence in other states is patchy.\n\n\"I have never heard of it, and I grew up in Queensland,\" Dr Samuelsson says.\n\n\"I can give you anecdotal evidence that it wasn't around in Queensland in the 80s and 90s.\"\n\nBut she's keen to try it.\n\n\"I really like chocolate mint ice cream. I'm imagining a similar sort of vibe.\"\n\nA Recipe for Life: The Food That Shapes Us is at the State Library of Western Australia's ground floor gallery until March 22, 2026, and entry is free.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/womens-pain-inquiry-victoria-released/105988930",
        "title": "Women's pain inquiry finds health system based on 'Caucasian male biology'",
        "publish_date": "Sun, 09 Nov 2025 00:35:45 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "The first inquiry of its kind into women's pain in Australia has found widespread experiences of dismissal, disrespect and inadequate treatment in the health system coupled with limited local and international research into women's health.\n\nThe inquiry was conducted by the Victorian government's Women's Health Advisory Council and a panel of experts between January and October 2024.\n\nIt examined barriers to accessing care, the effectiveness of current services and the reforms needed to improve pain management and healthcare outcomes.\n\nThere were more than 13,000 responses from Victorian women and girls, clinicians, researchers and peak bodies.\n\n\"The results can make for difficult reading,\" Health Minister Mary-Anne Thomas said on Sunday while releasing the inquiry's report.\n\n\"The most common conditions that women are experiencing include period, pain, endometriosis and arthritis.\n\n\"The report goes on to tell us that the impacts of these are not just the physical pain itself, but this leads to poor mental health, fatigue, poor sleep and low self-esteem.\"\n\nThe report found a health system built around the biology of white males left many women without effective diagnosis and treatment. (Supplied: Endometriosis Australia)\n\nThe report found 90 per cent of respondents experienced pain that lasted over a year, with half saying they were experiencing it daily and a third saying they were in pain constantly.\n\nWomen with disabilities and from the LGBTIQA+ community reported higher rates of prolonged pain.\n\nThe report found the healthcare system was built around \"Caucasian male biology\", making it difficult for women and girls to access care and support for pain.\n\nIt said historically low investment in women's health research left many without effective pain relief or treatment, causing their symptoms to worsen and forcing them to spend substantial amounts of money on therapies, some of which may not work.\n\n\"Many medical models and clinical guidelines overlook sex and gender differences, leading to gaps in diagnosing and treating conditions that affect women, girls and gender diverse people,\" the report said.\n\nNinety per cent of respondents told the inquiry they had experienced pain that lasted more than a year. (Unsplash: Anthony Tran)\n\nMore than half of the respondents said their pain affected their recreation and hobbies as well as their intimate relationships, while 44 per cent said it had an impact on their work, studies, or volunteering.\n\nAn overwhelming majority of women with disabilities — 89 per cent — said their pain also affected their mental wellbeing, sleep, caused feelings of shame, guilt and helplessness, and thoughts of self-harm for some.\n\nWomen living in regional and rural Victoria often had to travel long distances to access health care, while Aboriginal and Torres Strait Islander women experienced systemic discrimination.\n\n\"Women want to be heard without bias or judgement, treated with empathy and respect, empowered to make informed decisions about their health, and able to access affordable, effective care easily,\" the report authors wrote.\n\n\" Women, girls and gender diverse people with living and lived experiences of pain deserve to live fulfilling lives and participate fully in the economy and society. \"\n\nThea Baker made a submission to the inquiry after receiving multiple surgeries for endometriosis and adenomyosis, as well as a hip replacement for arthritis over the past 10 years.\n\nShe now works as a psychotherapist treating women with complex trauma.\n\n\"I'm really hoping that this inquiry and the results and the initiatives that are announced today are the beginning of really widespread systemic change within our medical system … so that women are believed, they are validated, their experiences are understood but primarily that they get efficient access to effective and evidence-based and above all compassionate care,\" she said.\n\n\"Women make up 51 per cent of the population so I don't really understand why we're considered a special population.\"\n\nThea Baker says she hopes the report into women's page leads to systemic change. (ABC News)\n\nThe report has made 27 recommendations in seven key areas, including:\n\nmore focus and funding for women's health research\n\nthe development of a women's pain action plan\n\nimproved education and training for health providers\n\na culture change to reduce gender bias and stigma\n\nclearer referral pathways and cross-sector information sharing\n\nattracting and retaining clinicians to regional and rural areas\n\nadvocating for the federal government to help make health care more affordable and accessible, including an increased investment in women's pain services.\n\n\"Women and girls told the Victorian government how to put an end to their unnecessary suffering and eradicate the barriers they face when seeking help,\" the report concluded.\n\n\"Your voices are now being heard.\n\n\"We hope that, in time, we can improve pain care and the overall health and wellbeing of all Victorian women and girls.\"\n\nDelayed report release accompanied by IUD pain relief announcement\n\nThe inquiry's final report has been delayed by more than half a year.\n\nVictorian inquiry into women's pain quietly delayed Women who have spent years navigating the health system seeking care for extreme pain say they are frustrated at the slow pace of a government inquiry into the issue.\n\nIt was due to be made public early this year, then an updated release date was given as \"mid-2025\".\n\nIt has finally been released on Sunday.\n\nMs Thomas attributed the delay to the \"overwhelming\" number of submissions it received.\n\nShe said she did not expect \"the breadth of the challenge\" faced by Victoria.\n\n\"This is not just a challenge for the Victorian health system,\" she said.\n\n\" This is a challenge across the nation and, indeed, around the world. \"\n\nShe said Victoria would develop a new clinical pain standard to help women receive more effective treatment.\n\n\"We need to work with our healthcare workforce, with our universities, with the medical colleges to address this issue.\n\n\"It's a big system issue, so it's going to take some time to change.\"\n\nMary-Anne Thomas says the report was difficult to read. (ABC News)\n\nShe also announced the establishment of a specialist clinic at the Royal Children's Hospital.\n\nThe hospital's head of gynaecology, Sonia Glover, said some girls were missing school every month because of period pain, yet their experiences were being overlooked.\n\n\"That changes today,\" Professor Glover said.\n\nShe said early intervention could have lifelong benefits.\n\n\"A beautiful study done out of Oxford [university] recently published showed that teenagers who had horrible period pain have got a 75 per cent chance of having chronic pain of any sort 10 years later,\" she said.\n\n\"I hope that we can have fewer adult women with chronic pain problems, fewer problems with infertility.\"\n\nJoining Ms Thomas in releasing the report was the premier Jacinta Allan, who announced Penthrox — commonly known as the green whistle — would be offered at 20 sexual and reproductive health hubs in Victoria to women receiving IUDs.\n\nFrankston Hospital, in Melbourne's south, began trialling the use of the pain relief for the procedure in 2023.\n\n\"What the green whistle does is give women control over managing their pain but also over their body and their reproductive choices,\" Ms Allan said.\n\nJacinta Allan announces the green whistle will be used for pain relief during IUD procedures at 20 reproductive health clinics. (ABC News)\n\nShe also revealed the difficulties she had experienced when she was younger as she tried to find help to diagnose and treat her endometriosis and subsequent fertility issues.\n\n\"Whether it's the heavy periods, the crippling cramps … we're taught we just have to push through it and put up with it,\" she said.\n\nWhy can getting an IUD be so painful? IUDs are one of the most effective forms of contraception, but for some women getting one inserted can be excruciating. Here's why.\n\n\"For too many women and girls, they're not being listened to, which means in turn they're not getting the treatment they need and deserve.\"\n\nNisha Kot, an obstetrician and senior leader at the Royal Australian and New Zealand College of Obstetricians and Gynaecologists, welcomed the rollout of the green whistle.\n\n\"We all know that an IUD is an excellent contraceptive, it's also good for heavy periods,\" Dr Kot said.\n\n\"It seemed like such a shame that women were not able to use an IUD because their experience of getting an IUD inserted or changed was so painful.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/uncertainty-for-small-scale-farmers-over-new-food-safety-rules/105987666",
        "title": "Uncertainty for small-scale Tasmanian farmers over new food safety rules",
        "publish_date": "Sun, 09 Nov 2025 00:31:19 +0000",
        "category": "finance",
        "authors": [],
        "text": "At Sparrow Foot Farm in Tasmania's Huon Valley, selling produce directly to customers has been relatively straightforward for co-owners Ines Santos and David Simmons.\n\nThe pair's 3-hectare market garden supplies a vegetable box program along with stalls at farmers' markets.\n\nBut proposed food safety standards for leafy greens, berries and melons have them and other small- and medium-scale producers uncertain about the viability of their businesses.\n\nBiosecurity Tasmania is consulting on the new regulations, which were developed by Food Standards Australia and New Zealand following increased foodborne illness outbreaks in Australia linked to horticultural products.\n\nThe new regulations would apply to leafy vegetables, berries and melons. (ABC News: Madeleine Rojahn)\n\nBiosecurity Tasmania said the regulations would help protect the state's industry and reputation.\n\n\"Between 2011 and 2019 there were a number of outbreaks [of] salmonella,\" Biosecurity Tasmania's product integrity manager Jim Beck told ABC Mornings last week.\n\n\"There were also 10 deaths and 275 reported cases.\"\n\nMr Beck said other viruses, including hepatitis A had also been found in horticultural products.\n\nThe changes would bring the state into line with national standards.\n\nThe regulations would bring Tasmania into line with other states. (ABC News: Madeleine Rojahn)\n\nCalls for a 'tiered' approach\n\nIn the draft released for public consultation, the regulations outline an \"annual accreditation fee\" that is set according to a farm's number of full-time employees. The cost ranges from $175 to $750.\n\nBut a tiered approach is not stated for other accreditation fees and auditing requirements that are set out in the regulations.\n\nIt has smaller growers worried they will have to meet commercial standards.\n\nMr Simmons said farms such as Sparrow Foot did not pose the same risk as large operations where products were handled more from seed to sale.\n\n\"In terms of vegetables going across the country, some of the regulations there make sense,\" Mr Simmons said.\n\n\" But in terms of local growers and farms selling direct to their customers, I don't think it makes a lot of sense. \"\n\nDavid Simmons says some of the regulations do not make sense for producers who sell directly to customers. (ABC News: Madeleine Rojahn)\n\nBiosecurity Tasmania has said it was \"looking at a tiered approach\" to make the new regulations \"practical and achievable\" for small and medium-sized growers.\n\nBut that tiered approach was not included in the draft being consulted on.\n\nIt has left a cloud of uncertainty over growers such as Mr Simmons.\n\n\"A big concern for me is new growers and farmers getting into producing food, not being able to due to the costs and time considerations that we're now [potentially] going to have to meet,\" he said.\n\n\"That doesn't seem fair to an industry that is already quite hard to make a living off.\"\n\nBerries are included in the proposed food safety regulations. (ABC News: Brett Worthington)\n\nProducers' group 'perplexed'\n\nSprout Tasmania, an agriculture non-profit representing producers, is frustrated by the lack of clarity.\n\nChief executive Jennifer Robinson said other states had had success with a tiered approach, \"and it was a good opportunity to put those into the draft regulations\".\n\n\"It just perplexes us somewhat that this really could have been in the draft regulations to start with,\" Ms Robinson said.\n\n\" When your livelihood is put at risk foreseeably by something that's out of your control, it can feel quite daunting and pretty overwhelming. \"\n\nSmaller producers want a tiered system. (ABC News: Madeleine Rojahn)\n\nMs Robinson is urging Biosecurity Tasmania to review the draft paper.\n\n\"Given … they're not tiering in the current draft, [producers] are slightly concerned that the public consultation won't be genuine,\" she said.\n\nSubmissions can be made until December 5.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/nayte-scott-duchenne-muscular-dystrophy-cq/105980892",
        "title": "The rare genetic disorder shortening the life span of boys",
        "publish_date": "Sun, 09 Nov 2025 00:10:30 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Nayte Scott is a patient little boy who loves playing with his Lego and watching movies at his home in central Queensland.\n\nHis mum, Skye, never imagined her six-year-old's lethargy and habit of walking on his tiptoes would be symptoms of a life-changing medical diagnosis.\n\n\"I just felt numb,\" Ms Scott said.\n\n\" I can remember the doctor saying that it's terrible to meet under these circumstances and just thinking, 'Oh, OK, this is huge.' \"\n\nSkye Scott is determined to raise awareness and fundraise for Duchenne muscular dystrophy. (ABC Capricornia: Jasmine Hines)\n\nNayte was diagnosed with Duchenne muscular dystrophy in September, a genetic disease where the average life expectancy is about 30.\n\n\"We packed up and drove home from Brisbane and that's when I started reading all the statistics,\" Ms Scott said.\n\n\" I was in the car with my children, and I had to sob quietly and my poor partner … I couldn't say anything to him. We just had to get home and go from there. \"\n\nSkye Scott says her son is a sweet little boy. Her family proudly displays his art on their fridge. (Supplied)\n\nSave Our Sons Duchenne Foundation is the peak body for the disorder in Australia.\n\nChief executive Sandy Kervin said it was a rare and progressive muscle-wasting condition that mostly affected boys because it was linked to the X chromosome.\n\nMs Kervin said on average, about one in every 5,000 boys were affected but it was rarer in girls, affecting one in every 50 million.\n\n\"The faulty gene … doesn't allow the body to produce dystrophin, which is the protein needed to keep our muscles healthy and strong over time,\" she said.\n\nMs Scott, who lives in Boyne Island in the Gladstone region, has since found out she is a genetic carrier.\n\n\"It was pretty shocking … it takes the future away that you thought was going to happen and completely turns it upside down,\" she said.\n\nSkye Scott has fundraised more than $20,000 for the Save Our Sons Duchenne Foundation. (ABC Capricornia: Jasmine Hines)\n\nMs Scott has been told to expect Nayte to stop walking around the age of 12 because of muscle weakness, while his heart and lungs are also expected to deteriorate later in life.\n\n\"It's hard to be told that your kid has this disease and there is no cure, only treatments,\" she said.\n\nSaving boys, improving outcomes\n\nThe determined mum has since made it her mission to fundraise for Save Our Sons to help expand clinical trials and research, which she hopes will better treat or even cure the condition.\n\n\"The future is never locked in,\" Ms Scott said.\n\n\"I'm not concerned if he ends up in a wheelchair, I just want to keep him alive and [ensure he has] the best quality of life, that's what I'm aiming for.\"\n\nSkye Scott with her husband, Christopher, daughter, Irah, and Nayte. (Supplied: Skye Scott)\n\nShe said there had been an outpouring of support from the central Queensland community and, within a week, more than $20,000 was raised in an online fundraiser.\n\n\"It's amazing to know that we have shoulders to cry on as well, and we do have plenty of them,\" Ms Scott said.\n\nSkye Scott has learnt she is a genetic carrier of the disorder. (ABC Capricornia: Jasmine Hines)\n\nMs Kervin said the charity believed a cure was possible in the future.\n\n\"Those that were diagnosed 10 to 15 years ago would have been told that their sons may not progress past the age of late teens, early 20s,\" she said.\n\n\" We're now seeing more and more diagnoses where the prognosis goes into late 20s, early 30s, but that's nowhere near long enough for a healthy, happy life for anyone, so we want to see that change. \"\n\nMs Kervin said there were a few clinical trials currently taking place in Australia, including for gene therapy, but they were still in the early stages.\n\nShe said it was possible a range of different treatments would become available in the future, and they would depend on the child's individual case.\n\n\"A lot of parents say what they want is a freeze, a stop from where they are today, so there's no more deterioration of their muscles,\" she said.\n\n\"If that could happen, that would be fantastic.\"\n\nNayte with his younger sister, Irah. (ABC Capricornia: Jasmine Hines)\n\nNayte is currently receiving steroid treatment, and Ms Scott says she is hopeful that as he grows, there will be more treatment options available to him.\n\n\"I'm really appreciative for all the scientists that are out there and dedicating their lives to this stuff, because I've never wanted to become a scientist more,\" she said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/bragg-says-ditching-net-zero-too-silly-for-words/105988972",
        "title": "Bragg says ditching net zero 'too silly for words' as Liberals play semantics",
        "publish_date": "Sun, 09 Nov 2025 00:05:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "Prominent Liberal moderate Andrew Bragg says the desire of conservatives to ditch support for net zero emissions is \"absolutely ridiculous\" and would make Australia an international outlier.\n\nAhead of meetings to settle a climate policy this week, Senator Bragg said the focus should be on doing \"net zero better than Labor\" and he did not expect colleagues would abandon that aspiration, but he would quit the shadow cabinet if they did.\n\n\"My view is we won't get to that because I don't believe my colleagues want Australia to be ranked with [the] baddies,\" he told the ABC's Insiders on Sunday.\n\n\"I don't think you can have a fatwa on two words, I think that's too silly for words, frankly. At the end of the day, this is the international standard on decarbonisation … Australia is part of the international community.\"\n\nIt now appears certain that the party will drop the target of reaching net zero by the year 2050, set by the Morrison government as part of international climate negotiations and legislated by the Albanese government.\n\nBut there is considerable jostling about whether Liberals will push the date out to 2100, keep it without a date, or abandon it entirely.\n\nLast week, the Nationals dropped net zero but pledged support for emissions reduction in line with the average achieved by other advanced economies.\n\nConservative Liberals want a similar move. Sarah Henderson said on Friday that net zero should be dropped \"in its entirety\", echoing the view of Andrew Hastie and Jacinta Nampijinpa Price, among others.\n\nThat path would renege on the Morrison commitments and put Australia in the minority of countries with no net zero pledge.\n\nBut Liberals may follow the lead of the Nationals in arguing that this is not inconsistent with the 2015 Paris agreement, which only alluded to net zero \"in the second half of this century\", although Australia also signed the more explicit 2021 Glasgow pact.\n\nTehan brushes aside Paris 'semantics'\n\nDan Tehan, who is the opposition's energy spokesperson and has been leading the Liberal policy process on net zero, told Sky News on Sunday these were \"semantics\" and it was more important to agree a plan to lower energy prices.\n\n\"The best thing you can do to get energy prices down is pursue energy abundance. You have to make sure that all sources of energy are coming to this system, because the more you've got coming into the system, the cheaper it's going to be,\" he said.\n\nMr Tehan said the federal government should do more to help state governments \"sweat\" coal plants, extending their useful lives for as long as possible. He did not rule out coal or gas subsidies, saying he did not want to \"pre-empt\" colleagues.\n\nLiberals recalled to parliament to thrash out net zero problem Liberal MPs will return to parliament on Wednesday to thrash out a position on the party's net zero commitment ahead of a joint party room meeting with the Nationals next Sunday.\n\nSenator Bragg said there was \"a debate we need to have about the exact date\" net zero could be achieved, accusing Labor of presiding over stalling the renewables rollout and shutting off coal \"too soon\".\n\n\"We need to try to find a way to do net zero that is better than Labor, that is better for jobs, better for industry and better for decarbonisation,\" he said, adding that nuclear energy should remain in the mix.\n\nBut he added that Australia should align itself with the views of voters.\n\n\"The Australian people are worried about climate change and so are we … I think if you have anything less than [a net zero plan], then you are giving up on the idea that you will try and reduce emissions for future generations,\" he said.\n\nFormer Liberal MP Keith Wolahan told the ABC's Insiders in a statement the \"tone\" was important given the party needed to win back urban voters.\n\nKeith Wolahan says the party needs to think about its \"tone\" given its struggles to attract urban voters. (ABC News: Nick Haggarty)\n\n\"Ditching two words as a 25-year aspiration sends a message that we don't care about what they care about … We must win 20 city seats and this is high risk,\" he said.\n\nSenator Bragg said leaving Paris altogether, which he did not think was \"within the realm of the possible\", would align Australia with \"Azerbaijan, Iran, Syria and a few other baddies. Australia has never been with those people before.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/callum-hotham-spray-paints-murals-bathurst/105911842",
        "title": "Tradie-turned-artist resurrects 'dead' city centre with murals",
        "publish_date": "Sat, 08 Nov 2025 23:51:05 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Until four years ago, stonemason Callum Hotham had never picked up a spray can.\n\nNow, he has become one of the most recognisable artists in his home town.\n\nThe 29-year-old is changing the face of the motor racing city of Bathurst with a series of murals.\n\nIn three years, the artworks have appeared on the walls of about 25 schools, businesses and sports clubs.\n\nThe mural artist — who signs his work as CALUM — says imprinting the city with the faces of its community is a humbling experience.\n\n\"I was a little kid here,\" Hotham says.\n\n\" Now I'm leaving something that's going to be here longer than me. \"\n\nMotor racing driver Peter Brock painted at a Bathurst gym. (Supplied: Callum Hotham)\n\n'Dead' city centre\n\nThe face lift began when retired country real estate agent Peter Rogers decided to revive the city centre.\n\n\"I'm trying to improve our CBD — I believe Bathurst is dead,\" Mr Rogers says.\n\nSo he turned to a self-taught artist to make that happen.\n\nInspired by a brick wall, 50 metres wide and 10m high, Hotham got to work.\n\nThe Eureka mural took about three months to complete. (Supplied: Callum Hotham)\n\nThree months later, Hotham transformed the side of the old department store, which once sold clothing to workers at the region's historic gold mines, into a reflection of the town's past.\n\nThe work to transform the regional city's CBD has paid off.\n\n\"Now we're getting people from all over Australia coming to look because it's actually on the Silo Art Trail,\" Mr Rogers says.\n\n\"I commissioned it to try and set it off to get other people interested in doing murals in town.\"\n\nPortrait of Aunty Mary Kennedy at the Kelso Public School in Bathurst. (Supplied: Callum Hotham)\n\nSelf-taught artist\n\nHotham's hyperrealistic portraiture is not the product of years of formal training.\n\nLocked down in Sydney during the COVID pandemic, he felt inspired by its street art.\n\n\"It was just perfect timing to pick something up because I wasn't really doing too much else,\" he says.\n\nHe progressed from experimenting with pens to paints to spray cans.\n\nA mural advertising a flooring store in Bathurst by Callum Hotham. (ABC News: Lani Oataway)\n\n\"I just fell in love with painting with spray cans because there's such a technical side to it,\" he says.\n\n\"It's not that you're just getting better at painting, you're also getting better at controlling the can, which I'm really fascinated by.\"\n\nHe developed his style while he lived in Sydney and painted for businesses in the city's west — including at NRL star Nathan Cleary's brewery — before moving back home to Bathurst.\n\nHuge demand\n\nHotham says it is now difficult to keep up with the demand for his work.\n\n\"[Peter Rogers] really sparked the momentum … it made people realise what was possible for the town,\" he says.\n\nA particularly personal piece was cementing the personality of the \"lovable\" founder of the Bathurst City Colts, Bob Clancy, on the wall of his childhood cricket club.\n\nCallum Hotham says painting the founder of his childhood cricket club, Bob Clancy, was a humbling experience. (ABC Central West: Lani Oataway)\n\n\"He's such a lovely fella and everyone knows him for that … I wanted him to have a slight grin because that just gives off his character.\"\n\nSouth Bathurst butcher Kyle Keen had watched the murals bring the city back to life, and wanted to transform his own space.\n\nHis business sits on the road that leads to the home of the Bathurst 1000, and he wanted to incorporate that identity into the artwork.\n\nCallum Hotham painted the mural on the South Bathurst butcher shop during the Bathurst 1000 race weekend, which attracted plenty of spectators. (ABC News: Lani Oataway)\n\nMr Keen hopes the murals will become a tourism drawcard.\n\n\"We're trying to have it like the silo art,\" he says.\n\n\"Hopefully this — and all of Callum's other murals — will be something like that as well, where [people] can go around and check them out.\"\n\nMr Keen says it also brightens the days of his regular customers.\n\n\"The amount of people who come through the shop every day and say how lovely it looks, it's just so good,\" he says.\n\nButcher Kyle Keen says he hopes the murals will become a point of interest for tourists. (ABC News: Lani Oataway)\n\nMaryanne Jaques from the organisation ArtsOutWest says Hotham is an \"exciting\" artist, not only because he is from Bathurst, but also because he is self-taught.\n\n\"If he was painting a couple of hundred years ago, he'd be the guy that you would hire to get your portrait painted if you were very rich,\" she says.\n\nMs Jaques believes businesses can reap the benefits of advertising while providing public art for the community.\n\nMaryanne Jaques says research shows public art improves people's sense of safety and confidence in a communal space. (ABC News: Lani Oataway)\n\n\"Bathurst does feel really proud of these works,\" she says.\n\n\"Every time he does a new work, I have seen so, so many comments on social media from locals who are celebrating that and championing someone from their community.\"\n\nHotham says he is deeply grateful for the town's response to his work.\n\n\"The amount of people the work impacts, it's so much bigger than me. I just hope people appreciate it and it makes their day better.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/australia-kangaroos-kevin-walters-calls-for-more-ashes/105988958",
        "title": "Walters calls for more Ashes, heaps praise on England after whitewash",
        "publish_date": "Sat, 08 Nov 2025 23:00:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "Australia coach Kevin Walters has dismissed suggestions the Kangaroos' whitewash series win over England was \"a walk in the park\", praising his counterparts following the third Test.\n\nAustralia completed the 3-0 series win with a 30-8 triumph in an intense final clash at Headingley, with England sticking with the Aussies for 60 minutes before three tries in the final quarter flattered the scoreline for the tourists.\n\nWalters was emphatic in his post-match press conference about the difficulty of the series, heaping praise on the English side for what they produced in the first Ashes series played in 22 years.\n\n\"Some of the Australian press have been saying 'it's like a walk in the park'. Well, come over and walk in the park against the English, and see how you go … These were tough matches,\" Walters said.\n\nAustralia punish wasteful England to claim 3-0 Ashes whitewash The Kangaroos have secured a 3-0 Ashes victory with Harry Grant leading the way in a big win over England at Headingley.\n\n\"If you talk to our players, they've got nothing but respect for them and the way they play their football.\n\n\"It's a different style of game here, and it's great that our boys can experience that now.\n\n\"Because for 20-odd years, the Ashes haven't been played, and now these series need to continue on a regular basis for both countries to get better and develop better as rugby league-playing nations.\"\n\nArguably, the greatest difference between the two sides during the series was defence, with Australia giving up just two tries in the three Test matches.\n\nReturning skipper Isaah Yeo said defence was a facet of the game the Kangaroos wanted to pride themselves on, and they did in the third Test as England threatened to score several times during the second half at Headingley, only to be turned away each time.\n\nStream End Game with Tony Armstrong on ABC iview Tony Armstrong tackles Australia's overdue reckoning with racism in sport with the help of some of its biggest sports stars.\n\n\"Defence has been a big part of our last couple of seasons. We got beaten 30-nil against New Zealand a couple of years ago in the [Pacific] champs, and since then, it's something we've really prided ourselves on,\" Yeo said.\n\n\"In a three-game series, they've thrown their absolute best at us. But you could see we're so ready for this.\n\n\"It wasn't perfect by us, but I'm just really proud of the group. I thought everyone defended really well, and we had to do that for long periods. The 30-8 doesn't reflect how hard it was and how well they played.\"\n\nThe other difference was the lack of imagination in the English attack, with the home crown venting their frustration on home coach Shaun Wane, who was told in an unsympathetic chorus, \"sacked in the morning, you're getting sacked in the morning\".\n\nBut Walters jumped to the defence of his beleaguered counterpart.\n\n\"I've certainly been surprised by the criticism Shaun has received … that was great Test football.\" he said.\n\nAAP/ABC",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/sa-adelaide-university-merger-challenges/105981104",
        "title": "Students, teaching staff face challenges amid Adelaide University merger",
        "publish_date": "Sat, 08 Nov 2025 22:58:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Gabbi finished her second year of International Development at the University of Adelaide, she made a careful and deliberate decision to go part-time for the final year.\n\nShe wanted to work, save and spend more time with family and friends, but an email in February this year turned her plans upside down.\n\n\"I got an email from the university saying essentially my degree ceases to exist, that my degree becomes a Bachelor of Arts majoring in International Development, not the straight Bachelor of International Development,\" Gabbi said.\n\nBut that wasn't all — her minor in gender studies was also being changed.\n\n\"They essentially told me that my minor will not be recognised. However, the credits will be transferred … I didn't want to be stripped of my minor. I put lots of effort into my minor,\" she said.\n\n\"I've learned so much … not having that on paper seemed that it was not as important, not as special.\"\n\nGabbi says this year has been \"one of the most chaotic years\" of her tertiary education. (ABC News: Emma Masters)\n\nShe \"bit the bullet\" and pushed through to study the full load in 2025.\n\n\"I felt strongly that this is what I've been doing and I should come out with what I've enrolled in,\" Gabbi said.\n\n\" It has been one of the most chaotic years of university. I've had to put my casual part-time job on hold a bit, quite a lot. \"\n\nGabbi is one of tens of thousands of students who have been studying at either the University of Adelaide or the University of South Australia this year.\n\nBut from December 19, those universities will begin to cease operations, merging to become Adelaide University by the beginning of next year.\n\nThe new super-sized university is projected to cater to an expected 70,000 students and 11,000 staff, making it one of the largest higher education institutions in the nation.\n\nWhen Adelaide University launched in July last year, it said modelling suggested its activities would bring $500 million annually to the state's economy.\n\nBut as the two-year process of merging two universities into one mega outfit comes to a head, UniSA Student Association president Oliver Shephard-Bayly said Gabbi was one of many students, especially in the arts and niche subjects, facing changes to their degrees.\n\nOliver Shephard-Bayly says students are facing uncertainty over their university courses. (ABC News: Che Chorley)\n\n\"We're really concerned to hear that some students … will have their course greatly disturbed and changed going into the new university,\" Mr Shephard-Bayly said.\n\n\"That can obviously be really, really stressful for students when they're trying to work out whether they can complete their degree, whether it will take them longer and where they'll be able to complete their majors and minors in how they intended when they started their course.\"\n\nHe said students were also facing uncertainty around where courses would be delivered across the campuses, how much face-to-face delivery would be provided in all courses and delays to students receiving their study plans.\n\nSupport during transition\n\nIn a statement, Adelaide University said \"there are some changes to most degrees from what is currently offered at the foundation universities\".\n\n\"This may be reflected across contents, delivery and details in program naming, which have all been designed to optimally meet the needs of industry and future employers,\" a spokesperson for the university said.\n\nIt said course content and delivery was yet to be finalised for all programs, however throughout Adelaide University it would combine face-to-face teaching supported by the latest learning technologies.\n\nIt added \"more than 37,000 personalised study plans have already been issued to students. All students will receive their study plan before enrolments open in December\".\n\nThe university said it had established a dedicated Student Transition Support team to work through individual enquiries.\n\nBut it is not just students being impacted.\n\nAndrew Miller says the union doesn't believe enough time has been allocated to deliver the merger. (ABC News: Carl Savillle)\n\nThe National Tertiary Education Union SA secretary Dr Andrew Miller said communication over course integration was \"clear as mud\".\n\n\"The timetabling that's come out for 2026 has left a lot of people very distressed,\" he said.\n\n\"There are people that have run courses in their foundational university for many years that have found, without consultation, have vanished from sight.\"\n\nHe said part of the problem had been a lack of time to deliver the merger and that has placed pressure on staff as they build \"a new university while maintaining business as usual\".\n\nIt was November 2023 when the university merger legislation passed SA parliament, giving it the green light to go ahead.\n\n\"The union doesn't believe there's been enough time. Our understanding is there's something in the order of 1,700 different systems that have to be integrated that'll affect people differently depending on which system they land on,\" Dr Miller said.\n\n\"But it also gives very short turnaround times to road test and problem solve and find out whether those systems are adequate to the new university and that has to happen really rapidly.\"\n\nAdelaide University launched in July 2024. (ABC News)\n\nAn Adelaide University spokesperson said it had been meeting all substantial scheduled milestones.\n\n\"Both foundation universities have acknowledged the additional workload this has placed on some staff and have established processes and supports,\" the spokesperson said.\n\n\"These include bringing in additional staff resources, encouraging teams to reconsider non-essential activities, and providing staff with wellbeing supports and benefits.\"\n\nIt said it released a draft timetable to academic staff who were asked to \"review and identify any actions required to inform the final timetable\".\n\n\"This was a preliminary timetable for a very large transitional activity, the purpose was staff engagement to identify and capture any issues,\" the spokesperson said.\n\nThe union is also negotiating with the university over an enterprise agreement, which it said needed to be finalised by December 19.\n\n\"People are getting paid different rates of pay to do the same job across the board and we need to harmonise that as quickly as possible,\" Dr Miller said.\n\n\" Staff deserve certainty, but they also deserve to be recognised and valued for the hard work they've done for the last two years to build a new university with little compensation. \"\n\nGabbi said she could see the many benefits to the merger, but was glad she put in the extra effort this year to graduate under the current system.\n\n\"I understand that there's a lot of effort on the teams within the university to bring this transition to be smooth,\" she said.\n\n\"However, I've unfortunately and many others have faced lots of bumps in the roads and we've been caught in the crossfire.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-11-09/die-my-love-movie-jennifer-lawrence-martin-scorsese-lynne-ramsay/105948060",
        "title": "The movie Jennifer Lawrence (and Martin Scorsese) had to get made",
        "publish_date": "Sat, 08 Nov 2025 22:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Some films will themselves into existence. Martin Scorsese read a translated copy of Argentinian author Ariana Harwicz's novel, Matate, Amor (Die My Love), in his book club.\n\nFlabbergasted by its forthright depiction of a strong-willed woman on the edge, he passed it to Jennifer Lawrence's production company, Excellent Cadaver.\n\nWhat: A powerful film about a bold woman on the edge, ready to blow Directed by: Lynne Ramsay Starring: Jennifer Lawrence, Robert Pattinson, Sissy Spacek, Nick Nolte, LaKeith Stanfield When: In cinemas November 6 Likely to make you feel: Pulling on your powder-blue dress and burning it all down\n\nEqually enthralled, Lawrence sent it to You Were Never Really Here filmmaker Lynne Ramsay, asking her to adapt it with her in the lead.\n\nRamsay wasn't automatically convinced, she reveals, speaking hoarsely from the London Film Festival through a cold.\n\n\"I didn't get back to Jennifer right away because I had to see how I could find my way into the book,\" Ramsay says. \"It's quite a challenging piece.\"\n\nRamsay relocated the action to a sweltering hot summer in the middle-of-nowhere Montana, with Harwicz's blessing.\n\n\"I was really moved by meeting Ariana,\" she says. \"It's a bit of a different animal, but the spirit of the book is still there, and she saw that.\"\n\nLawrence plays Grace, an aspiring writer hoping to pen the next Great American Novel, convinced to move from New York City by her partner, Jackson (Robert Pattinson), who has inherited a rundown house from his uncle.\n\nCareening around that crumbling edifice in the heated throes of passion, Grace falls pregnant. After the birth, Jackson is frequently absent.\n\nFilmmaker Lynne Ramsay shows the shades of grey surrounding postpartum depression and the way couples navigate a new baby. (Supplied: Kimberley French)\n\nRamsay has felt frustrated by reductive reviews pinning her increasingly extreme behaviour purely on postpartum depression.\n\n\"I want people to go into this film with no expectations because it's not black and white,\" she says.\n\nShades of grey\n\nThere's a sense Grace always felt throttled by the world and its suffocating views on a woman's place. Ramsay's films Morvern Callar and We Need to Talk About Kevin both painted incredibly complex portraits of women in shades of grey.\n\n\"Kevin is worried about the relationship between the mother and child, whereas Die My Love is more about the relationship between Jackson and Grace,\" Ramsay says.\n\nLawrence was willing to go anywhere with Ramsay.\n\nLynne Ramsay wanted to capture the broad spectrum of womanhood in Die My Love. (Supplied: Kimberley French)\n\n\"It's a love story with madness involved that's also about someone being isolated and their marriage starting to disintegrate,\" Ramsay says.\n\n\"But mainly it's about this completely unapologetic character that felt quite bold, very feral, very animalistic.\n\n\" You love her or hate her, but you know she's got some kind of honesty. \"\n\nSet fire to the rain\n\nLawrence's performance is astonishingly raw.\n\n\"Jennifer trusted me a lot because we did some pretty wild stuff,\" Ramsay says.\n\n\"She was pregnant while we were shooting it, which made it so much more powerful, and she embraced it in a way that could have been terrifying for some people.\"\n\nLawrence also shares remarkable moments with Carrie star Sissy Spacek, as her stepmother, Pam, and tender ones with Nick Nolte as Jackson's ailing dad, Harry.\n\nRamsay said Lawrence, pictured here with Nick Nolte, put a lot of trust in her to film while pregnant. (Supplied: Kimberley French)\n\nWorking with them was a dream come true for Ramsay.\n\n\"Sissy's an idol of mine, one of cinema's greats,\" Ramsay says.\n\n\"So is Nick Nolte, who has one of those faces. [Cinematographer] Seamus McGarvey and I were like, 'Oh my God, this guy is mesmeric'.\"\n\nFor Ramsay, Pam is the glue that holds the film together.\n\n\"Pam sees Grace a bit more clearly than everyone else,\" Ramsay notes. \"Grace is a punk rocker. She's setting the world on fire.\"\n\nKnives Out star LaKeith Stanfield also plays a small but fascinating role as biker jacket-wearing Karl. Erotically charged sequences in which he circles Grace under an eerily blue moon feel dream-like.\n\n\"He's part fantasy for her, even though he's a real guy, and that was in the novel,\" Ramsay says.\n\n\" She's got these sexual desires that aren't being fulfilled. \"\n\nNo love lost\n\nA discombobulating shift from reality to dream-scapes are also a feature of one of Ramsay's favourite filmmakers, Ingmar Bergman.\n\n\"I've always been so fascinated by characters and getting into their psyche,\" she says.\n\nLynne Ramsay says Sissy Spacek, who also starred in the 1970s horror film Carrie, is an idol of hers. (Supplied: Kimberley French)\n\n\"Bergman is really close to his characters.\"\n\nRamsay's mum, who died recently, raised her on the likes of Mildred Pierce, Imitation of Life and All About Eve. The latter's dark humour is present in Die My Love.\n\n\"Right from the beginning, through any discussions on the script [with co-writers Enda Walsh and Alice Birch], it had to have this absurdity,\" Ramsay says.\n\n\" A kind of gallows humour that Glaswegians tend to have, and Jennifer Lawrence has great comic timing. \"\n\nFrom the screenplay, sound and cinematography to working with costume designer Catherine George and production designer Tim Grimes, Ramsay was across every inch.\n\n\"We were looking at colour palettes for different moods,\" she says. \"I picked out the powder-blue dress Grace wears to her wedding, with its slightly 50s feel. At the beginning, she's bright and hopeful, then she starts dressing like everyone else.\"\n\nBut you won't forget her.\n\nLoading...\n\nAustralians bemused by opposition leader Sussan Ley's recent attack over Prime Minister Anthony Albanese wearing a Joy Division T-shirt will also recognise Die My Love's closing credits song, a Joy Division cover sung by Ramsay herself.\n\nShe also worked closely on the score composed by Raife Burchell and Nick Cave and the Bad Seeds guitarist George Vjestica.\n\n\"It summed up the movie but it was never my intention it was going to be in the film,\" Ramsay reveals.\n\n\"It was just a temp track we did for Cannes because we didn't have anything else. I love writing songs and jamming but I don't want to sing.\"\n\nInternational distributors insisted it stay in.\n\n\"I guess it works,\" she says.\n\nDie My Love releases in Australian cinemas on November 6.",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/piakuras-strike-causes-tensions-to-boil-over-20251109-p5n8v3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Piakura's strike causes tensions to boil over",
        "publish_date": "Sun, 09 Nov 2025 13:01:29 +1100",
        "category": "finance",
        "authors": [],
        "text": "Piakura's strike causes tensions to boil over\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/live-reviews/fancy-a-dose-of-hedonism-with-a-gatsby-like-vibe-step-this-way-20251029-p5n664.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hours of full on power: Metallica deliver fierce and fiery show",
        "publish_date": "Sun, 09 Nov 2025 12:57:51 +1100",
        "category": "entertainment",
        "authors": [
            "Jessica Nicholas",
            "Martin Boulton",
            "Gabriela Sumampow"
        ],
        "text": "Metallica’s thundering two-hour set featured songs from across their extraordinary career, including latest album, 72 Seasons, and stretched back to their earliest days in San Francisco’s Bay Area with their late, much-loved bass player, Cliff Burton. Master of Puppets and a pummelling version of groundbreaking, thrash metal anthem Seek and Destroy (the latter from debut album Kill ’Em All) were among the many standout moments. Hetfield, dressed head-to-toe in his trademark black, revelled in the sing-along moments, including a rousing version of The Memory Remains, but he’ll surely cherish the almighty, closing moments of Enter Sandman. Six years after he originally planned to bring Metallica back to Melbourne, the band’s imposing frontman looked happy, healthy, and thrilled to be back with his extended rock ‘n’ roll family. Reviewed by Martin Boulton\n\nMUSIC\n\nTWICE | THIS IS FOR Tour ★★★★\n\nRod Laver Arena, November 8 Nothing beats the thrill of seeing your idols up close, and TWICE tried to make that a reality, performing on an immersive, 360-degree stage. TWICE wowed their adoring fans at Rod Laver Arena. Credit: Evan Agostini/Invision/AP It’s the group’s third visit after two shows in 2023’s Ready To Be tour; the rain outside Rod Laver certainly did not reach their parade. “Was everyone’s way here okay?” asked Dahyun, which was met with a loud “NOOOOOOOOO!” Rather than going all in, they eased in gently raising the curtain with latest English tracks This Is For and Strategy. And then the stage that was an unassuming block flexes its versatility for I Can’t Stop Me and Options: a platform in the former, steps to sit on in the latter.\n\nPerforming to a 360-degree crowd is no easy feat, though. Face one side for one verse, then another, then dance in a circle, then disperse to the side stages. It’s a tricky set of instructions, but when you’re a 10-year-old K-pop girl group, it looks as easy as breathing. I saw both of TWICE’s shows in 2023, and their tenderness in addressing their fans continues to inspire. It’s as if they flicked a switch from being one of K-pop’s strongest performers, to girls next door saying “G’day mate” (literally) to a crowd they’ve missed. As with the Sydney shows, rapper Chaeyoung was sadly absent. Next, a tonal shift from dreamy earworms Moonlight Sunrise and I Got You, to the more powerful and alluring Cry For Me and Right Hand Girl. Just when you thought you’ve seen it all, a live band at the edge of the stage appears to accompany the latter tracks, wowing the audience with rock-like adrenaline. The solo stages (a tradition even in past TWICE shows) have always been an exciting guessing game. This time, we’re asking “Who’s next?” and looking around to see which side of the stage each member pops up from. Mina, the group’s ballerina, takes centre stage with traces of ballet in Stone Cold. And later, leader Jihyo – providing a masterclass in stage presence throughout the night – dominates a side stage with R&B dance number ATM. You would think it’s easier to sing English songs like This Is For, but “wild” is an understatement for the crowd’s enthusiasm for the group hits after the solos.\n\nFor long-time K-pop fans like me, our first taste of TWICE was in the 2010s with genre-defining hits like What Is Love, Fancy, or Yes Or Yes. To sing and dance along to hit after hit is not only an overdose of nostalgia, but also evidence of the mark left by this K-pop powerhouse. The eight idols also took their time to get closer to the fans, even anchoring the mic for them to scream “YES OR YES!” at the top of their lungs. Feel Special was the hit of the night, the most meaningful hit in the group’s discography. In the purest form of artist-fan interaction, the group of eight momentarily schemed how to get the crowd moving. Their answer? Body waves every time they sing the line, “You make me feel special”, and then standing up for closing song One Spark. A lot has been said about how TWICE has matured from cutesy chart-toppers with tracks like TT and Cheer Up, but this tour has been the best way to prove what a decade of experience does to a K-pop girl group. It’s no wonder these nine humble performers are among the genre’s best, and why fans behind me – voices almost gone, like mine right now – said it’s “never not a good time” when they’re here. Reviewed by Gabriela Sumampow MUSIC\n\nAffinity String Quartet ★★★★\n\nMelbourne Recital Centre, November 7\n\nMelbourne-based Affinity Quartet has rounded off its globe-trotting 10th anniversary celebrations with a compact program showcasing its luminous, dedicated artistry. Founders, cellist Mee Na Lojewski and violinist Nicholas Waters, together with violist Josef Hanna and violinist Shane Chen possess a passionate ardour that seems to light up their music-making from within. Receiving its first Australian performances on this tour, Incantation in Four Parts by French-born, London-based composer and soprano Heloise Werner provided a curious curtain-raiser. Moving from the mechanical to the lyrical, the work’s soundscape also required assorted vocalisations by the players, including a satisfied “ah” at the end of the first section. This intrepid piece of programming was perhaps more thoughtfully clever than truly mesmerising. Affinity String Quartet. Mozart’s Adagio and Fugue in C minor, K. 546 was invested with a high sense of drama throughout. Aided by the brilliant, resonant tone of the group’s instruments, forthrightly projected into the lively acoustics of the Salon at the Melbourne Recital Centre, the fugue’s contrapuntal texture in particular was clearly etched into the listeners’ consciousness. Debussy’s beguiling and superbly crafted String Quartet in G minor, Op. 10 thrummed with energy, the players ensuring from the outset that the work’s essential rhythmic element was always kept in view. After the driving opening with its moments of shimmering ecstasy, effective contrasts were made between the pizzicato and bowed passages in the nimbly executed second movement.\n\nWith its gently pulsing accompaniment, the poignant third movement elicited greater attention to details of light and shade that had been slightly overwhelmed by the group’s charismatic enthusiasm in the previous movements. Marked by industrious determination, the race to reach the all-too-sudden finish line was well controlled and resulted in an exhilarating finale – a worthy crowning of a decade of hard work and artistic growth by four gifted musicians. Reviewed by Tony Way\n\nVARIETY\n\nBlanc de Blanc Encore ★★★\n\nSpiegel Haus Melbourne, from October 29\n\nMelburnians craving variety entertainment should check out the new pop-up performance precinct at Spiegel Haus Melbourne, on Lonsdale Street in the CBD. It’s opened its doors in time for summer and features a rooftop bar with intimate venues, including an Edwardian-style Spiegeltent backing onto a laneway in Chinatown. The cast of Blanc de Blanc Encore. Credit: Cameron Grant\n\nTaking up residence in a carnival atmosphere is Strut & Fret’s Blanc de Blanc Encore – a risqué blend of cabaret, circus, comedy and burlesque which, as its name suggests, pays Dionysian homage to the pleasures of the grape, in a slick showcase of variety performance guaranteed to make you feel like you’re drinking champagne, even if you’re stone-cold sober. Compered by a comedy duo – Emile Mathieu and Felix Pouliot – in formal attire, the evening kicks off with a warm-up that’s also a bit of a balls-up. These two gents know how to milk a joke, and though the opener’s terrible puns might leave you testy (depending on your taste for below-the-belt humour), the suggestive physical clowning, rambunctious low comedy, and engaging party tricks should win you over as the show progresses. Circus acts include a dizzying aerial hoop routine from Danielle Summers, a cartoonish display from Ukrainian contortionist Mykhailo Makarovoak that must be seen to be believed, and Felix Pouliot’s muscular, gravity-defying pole dance, which transforms into a climax positively effervescing with airborne pop and fizz. Aerial hoop performer Danielle Summers. Credit: Steve Napiza Burlesque takes centre stage through titillating and tightly choreographed striptease, drag-adjacent gender play, and erotic dance with something for everyone.\n\nChanteuse Clara Fable sings brisk excerpts from the odd jazz standard as well as more obscure (and loucher) numbers. I thought her puerile masturbation gag, performed to Rhapsody in Blue, gratuitously insulting to Gershwin, but this is the kind of show where it’s probably best to leave your high-mindedness at the door. Classy only on the surface, this is a hedonistic show that denies no guilty pleasure, drenching audiences in a decadent, high-society, Gatsby-like vibe. True, the retro 1920s stylings can make some of the “naughtiness” look super mainstream a century on, but it remains an immersive entertainment from a company of international renown, and a fun way to open a new performance venue in the heart of a city known for tucking away its most vibrant treasures in alleyways and hidden corners. Reviewed by Cameron Woodhead Jazz musicians Joost Lijbaart and Wolfert Brederode.\n\nJAZZ\n\nJoost Lijbaart and Wolfert Brederode ★★★★\n\nThe JazzLab, November 5\n\nPatience. That’s the word – and the quality – that came to mind as I listened to Joost Lijbaart and Wolfert Brederode perform, and pondered what made their music so beguiling. The drummer and pianist (both from the Netherlands) have been playing together in various settings for over 20 years, and their musical connection is so finely honed that they can communicate with the barest of gestures. They last toured Australia in 2018 as part of a superb quartet led by saxophonist Yuri Honing, but it’s perhaps in duo mode that their creative antennae are most vividly displayed. Joost Lijbaart and Wolfert Brederode are both from the Netherlands. At JazzLab on Wednesday, each of their two sets unfolded as a continuous, quietly compelling exchange of ideas and energy. Brederode and Lijbaart are musical storytellers, but their stories are mostly improvised, with the narrative arc shaped moment by moment and the conclusion unknown until it arrives.\n\nHence the patience. Rather than fabricating drama or climactic sequences to keep the audience engaged, these musicians simply created space and waited for fresh themes, directions and detours to reveal themselves. At the piano, Brederode shaped wisps of shadowy abstraction into the contours of a melody before letting it dissolve, or coaxed harmonic motifs into a lush, flowing river before it, too, melted away. Beauty was everywhere, tinged with melancholy and longing, as though Brederode were grasping at something – a memory, an experience, a feeling – just out of reach. In this setting, Lijbaart’s drums and percussion were rarely used for time-keeping. Instead, they produced colours and textures that enhanced or subtly contrasted with Brederode’s atmospheric explorations. Yes, Lijbaart could summon a propulsive sway or polyrhythmic shuffle to nudge the music towards a groove. But more often he evoked a sense of mystery or ritual with the resonant chime of a temple bell, the rustle of a beaded shaker or the bird-like call of a wooden flute. The duo’s close listening and attention to detail invited us to lean in and listen closely too, conjuring a spell of enchantment from which we were reluctant to emerge.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/melbourne-demons-vs-brisbane-lions-aflw-live-dees-lions-chase-preliminary-final-spot-20251108-p5n8rr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne Demons vs Brisbane Lions AFLW LIVE: Dees, Lions chase preliminary final spot",
        "publish_date": "Sun, 09 Nov 2025 12:36:17 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly",
            "Jon Pierik"
        ],
        "text": "North Melbourne are two wins away from an undefeated season after defeating Hawthorn in an AFLW qualifying final on Friday night.\n\nThe Roos had a poor night in attack but were too polished around the ground as injuries hit the brave but overmatched Hawks in front of 4392 fans at Ikon Park in Carlton.\n\nAlice O’Loughlin of the Kangaroos celebrates a goal. Credit: AFL Photos via Getty Images\n\nThe Roos undefeated streak, dating back to last season, is now up to 25 games in succession as they won 5.12 (42) to Hawthorn’s 0.3 (3).\n\nNorth will rest up for the next week while the Hawks will hope the injuries which hit them on this night won’t carry over to next weekend’s elimination semi-final.\n\nRoos coach Darren Crocker praised his side’s patience but said they would look at their forward play after missing out on several scoring chances.\n\n“That’s probably be one area that we’ll look at,” Crocker said.\n\n“Their ability to not just defend inside the defensive 50m [arc], but also put pressure on the ball carrier - sometimes the ball carrier was under pressure and they couldn’t get the ball in the areas they wanted to.\n\n“We could have been a little bit better with where we put the ball at times.”\n\nLibby Birch, Jasmine Garner, Ash Riddell and Erika O’Shea were among North’s best players but they were typically strong across the ground in a fiery match while Eliza West, Laura Stone, Tilly Lucas-Rodd and Aileen Gilroy were among the Hawks best.\n\nKaitlyn Ashmore hurt her calf and didn’t return in the final term while Aine McDonagh played through what looked like a painful knee injury.\n\nThe Hawks will play the winner of the elimination final between Carlton and West Coast which will be played at Ikon Park on Saturday.\n\n“They made it a really tight, high-pressure contest,” Crocker said.\n\n“But we’ve got a lot of trust in the way we play, our system and our identity. Hopefully, teams can hold us for a period of time, but it will open up at some point.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/wallabies-player-ratings-how-the-men-in-gold-performed-against-italy-20251109-p5n8sh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wallabies player ratings: How the men in gold performed against Italy",
        "publish_date": "Sun, 09 Nov 2025 09:55:06 +1100",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Nick Frost at the end of the Wallabies-Italy clash. Credit: Getty Images Jeremy Williams - 5.5 Always works hard, and Williams again defended with energy. But breakdown work should be bread-and-butter for tight forwards and Australia were second-best. Tom Hooper - 6.5 Arguably the only Wallaby ball-runner who made consistently good yardage when he carried. And Hooper trucked it up hard, particularly in the first half. Strong showing highlighted the odd decision by Joe Schmidt to not use his Exeter teammate Len Ikitau.\n\nTom Hooper of Australia looks for support from Matt Faessler. Credit: Getty Images Fraser McReight - 7 The Wallabies’ best for a second consecutive week. Added more pilfers to his world-leading tally of turnovers in 2025, and added some welcome linespeed in the Wallabies’ defence, too. Harry Wilson - 5 Effort is never in doubt, as seen by a team high 15 carries. But he was chopped for many and struggled to make any headway. Wilson is the heart of the side and the fact he looks weary and was beaten to the punch probably sums things up. Leadership-wise, the Wallabies went away from things that looked promising, ie rolling mauls and the scrum.\n\nJake Gordon behind the Wallabies’ scrum. Credit: Getty Images Jake Gordon - 5 Clean as a whistle again on pass-kick skill (apart from a kick out on the full), and made a nice break in the first half. But it was far too rare. Wallabies attack is now far too predictable, and missing a probing threat near the ruck to keep defenders honest. Quick tap from a scrum after Tupou had won a penalty the scrum before was also a tad hasty. Carter Gordon - 6 After 18 months out of rugby, this was a mostly impressive return for Gordon, who looked assured on the ball - and under the high ball, too. Made a nice linebreak and finished off a well-taken (though lucky) try. Carrying a quad injury, the lack of a kicking game limited Gordon’s options though, and the team’s. Italy had no trouble defending the Wallabies all night.\n\nIt was an impressive return from Carter Gordon. Credit: Getty Images Corey Toole - 5.5 Some good contestable kick wins in the first half but rarely sighted in attack, and the fact there are no plays being deployed to use Australia’s fastest player - as seen with Max Jorgensen last week - points to a flawed attacking strategy. Hunter Paisami - 5 Defended stoutly and carried often, but mostly as a battering ram. Paisami has good touch and skill, and the Wallabies use him to play second wave shapes, but it felt under-pressure and rushed all night. Not to mention over-done.\n\nJoseph-Aukuso Suaalii - 4 Defended well until he got it horribly wrong in the second half and was yellow carded for a high shot. Has ridden his luck on high shots in rugby before this game. The card left the numbers stretched for Australia and led to Monty Ioane’s match-winning try. Had more attacking involvements but still runs too high into contact in rugby. Joseph-Aukuso Suaalii of Australia makes a break. Credit: Getty Images Harry Potter 4.5 It’s clearly part of Potter’s game to roam all over the field, and even get into rucks and mauls. But it has mixed results and can impact his core business as a winger. He was isolated on a few carries, and with heavy legs was also beaten on the outside by Ioane for his try.\n\nAndrew Kellaway 4.5 When the Wallabies are on, Kellaway is usually a key cog. So when Kellaway is off, you know the Wallabies are too. A handful of mistakes from the usually assured fullback, with some dropped ball and a missed tackle on Louis Lynagh that allowed a try. RESERVES Billy Pollard 5 Limited involvement but got his set-piece work right.\n\nAidan Ross 5 Played a solid 40 minutes and kept the Wallabies scrum in good shape. Head-down, bump-up kind of player. Loading Zane Nonggorr 5.5 Some strong carries from Nonggorr, who isn’t a noted ball carrier but showed what can be done with leg drive after contact. Several teammates need to take notes.\n\nRob Valetini 5.5 Showed his power in a very limited stint on the field, which again highlighted the unusual use of the bench by Joe Schmidt. Why you would not have Valetini playing at least 30-35 minutes in mystifying. If it was to keep him fresh for next week, the gamble backfired. Pete Samu 4.5 Looked a little lost in limited minutes, beyond one clean-up mission from an intercept. You hope Samu gets more opportunity, and working in the wide channels where he is effective. Ryan Lonergan na",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw11-west-ham-vs-burnley-20251109-p5n8t8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW11: West Ham vs Burnley",
        "publish_date": "Sun, 09 Nov 2025 09:10:43 +1100",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW11: West Ham vs Burnley\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw11-everton-vs-fulham-20251109-p5n8t9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW11: Everton vs Fulham",
        "publish_date": "Sun, 09 Nov 2025 09:09:10 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW11: Everton vs Fulham\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw11-spurs-vs-man-utd-20251109-p5n8t7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW11: Spurs vs Man Utd",
        "publish_date": "Sun, 09 Nov 2025 09:07:48 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW11: Spurs vs Man Utd\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/rapid-recap-mw11-sunderland-vs-arsenal-20251109-p5n8t6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW11: Sunderland vs Arsenal",
        "publish_date": "Sun, 09 Nov 2025 09:07:43 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW11: Sunderland vs Arsenal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/italy-well-worth-their-win-over-wallabies-with-a-little-help-from-the-man-upstairs-20251109-p5n8ss.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Italy well worth their win over Wallabies - with a little help from the man upstairs",
        "publish_date": "Sun, 09 Nov 2025 09:03:06 +1100",
        "category": "sports",
        "authors": [
            "Peter Fitzsimons"
        ],
        "text": "Back in the day, Italy could expect to win a Test match against front-line international rugby sides, only ad ogni morte di papa, every time the pope died.\n\nNot any more.\n\nThe Six Nations is no longer the Five Nations + One Also Ran. For in the last decade and a bitty, Italy has proved itself more than capable of regularly beating the likes of Wales and Scotland, and have beaten both France and Ireland – not to mention Australia, just three years ago.\n\nOn their day, and most particularly in recent times, they can play in a manner to make one think that the one Pope who played rugby, Pope John Paul II, must now be pulling a few strings as a heaven local, on the very game they play in heaven. In sum, this was never a “gimme” game, and an automatic lifting of the Wallaby stats for the year. It was always going to be a testing Test and Italy showed from the first they were here to play, more than holding their own in the forwards and often unleashing human Ferraris in the backs.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/david-littleproud-slams-disgraceful-neo-nazi-protest-20251109-p5n8t1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "David Littleproud slams 'disgraceful' neo-Nazi protest",
        "publish_date": "Sun, 09 Nov 2025 08:56:47 +1100",
        "category": "finance",
        "authors": [],
        "text": "David Littleproud slams 'disgraceful' neo-Nazi protest\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-alzheimers-imbalance-this-australian-has-under-the-microscope/janflm0p2",
        "title": "The Alzheimer's 'imbalance' this Australian has under the microscope",
        "publish_date": "Sat, 8 Nov 2025 19:37:35 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Alzheimer’s disease disproportionately affects women — and now a new international project, involving an Australian researcher, has received a $4 million boost to try and find out why.\n\n\n\n\n\nProfessor Kaarin Anstey, the director of the University of NSW's Ageing Futures Institue, and the University of California's Professor Kristine Yaffe have been jointly awarded the funding to investigate the phenomenon of the disease, which some health bodies place as among Australia's leading causes of death.\n\n\n\n\n\nAnstey said a lot of research into Alzheimer's — the most common form of dementia — hasn't considered \"sex-specific factors\".\n\n\n\n\n\n\"We hope that by studying hormonal variability and aspects of women's health that have previously been dismissed, we may uncover clues to explain women's greater risk of Alzheimer's disease,\" she said.\n\n\n\nWhy are women more prone to Alzheimer's?\n\nAnstey, whose work is being funded by United States-based charity Wellcome Leap, said there are differences in brain structures between the binary sexes, which could explain the differences in the prevalence of Alzheimer's.\n\n\n\n\n\nShe said there are not enough study participants who identify as non-binary or transgender to have reliable data for those groups.\n\n\n\n\n\nWhile there could be a link between an increased risk of Alzheimer's and hormonal changes in women, the reason behind the \"imbalance\" is unclear.\n\n\n\nREAD MORE More than a million Australians could be living with dementia in 40 years. These are possible risk factors\n\nShe said one reason is that Alzheimer's statistics tend not to take sex into account, and treat men and women the same, despite \"the large differences in biology and risk of Alzheimer's\".\n\n\n\n\n\nShe said there are two main goals for her future studies.\n\n\n\n\n\n\"Overall, the most urgent priority is to learn how to reduce the risk of dementia and slow cognitive decline so that we can develop interventions to prevent it,\" she said.\n\n\n\n\n\n\"Second, making sure these women's health issues are given the same weight in our research as other factors like cardiovascular disease, so that they are not ignored or dismissed as unimportant,\" Anstey said.\n\n\n\n\n\n\"We need all the clues and information available to progress the massive task of preventing cognitive decline and impairment in ageing.\"\n\n\n\nDo men and women experience Alzheimer's differently?\n\nAssociate Professor Fiona Kumfor from the University of Sydney's Brain and Mind Centre and co-founder of the Dementia Law Network said understanding the differences in how men and women experience Alzheimer's is an \"important area for future research\".\n\n\n\n\n\n\"There hasn't been a lot of research examining sex differences, but some evidence suggests that women may have more depressive symptoms and changes in beliefs, such as delusions, whereas men may experience more loss in motivation which can lead to apathy,\" she said.\n\n\n\n\n\nBecause women tend to live longer than men, there is a higher number of women living with Alzheimer's.\n\n\n\nKumfor said that women are also more likely to be diagnosed with Alzheimer's than men.\n\n\n\n\n\n\"Although men are at greater risk of other dementia types like some types of frontotemporal dementia and vascular dementia,\" Kumfor said.\n\n\n\nAre there risk factors for dementia?\n\nAnstey said it's important to look at modifiable risk factors that can improve health outcomes for people with Alzheimer's.\n\n\n\n\n\n\"While we know that many risk factors for dementia are modifiable, the effect of each may not be the same in men and women. The more we can understand, the more we can intervene to prevent it,\" she said.\n\n\n\n\n\nThe Lancet, a prominent medical journal, has tracked 14 modifiable risk factors in its research into dementia .\n\n\n\n\n\nThe paper's authors state nearly half of all dementia cases worldwide could be prevented or delayed by addressing these risk factors.\n\n\n\nThe common mid-life risk factors include hearing loss, high LDL cholesterol, social isolation and depression. Source: SBS News The mid-life risk factors include hearing loss, high LDL cholesterol (or 'bad' cholesterol), social isolation and depression.\n\n\n\n\n\nManaging these risk factors, particularly in the early and middle stages of life, could potentially prevent or delay dementia cases by 45 per cent, according to the research published in 2024.\n\n\n\n\n\nSome academics have commended The Lancet study, but say it's not possible to conclusively link these risk factors directly to dementia .\n\n\n\nDiagnosis and prevention\n\nProfessor Scott Ayton, from the Florey Institute of Neuroscience and Mental Health, told SBS News there is a \"considerable challenge\" around the world when it comes to diagnosing Alzheimer's.\n\n\n\n\n\nBut recent research shows there is an over 90 per cent success rate in diagnosing Alzheimer's by looking at blood-based biomarkers, according to Ayton.\n\n\n\n\n\nKumfor said that while most cases of Alzheimer's start with changes in memory, that's not the case for everyone.\n\n\n\n\n\n\"For some people, the earliest changes might be in language, navigation, planning or behaviour,\" she said.\n\n\n\n\n\n\"Where the presentation is 'atypical', or if people develop symptoms at a younger age — under 65 years old — this can make diagnosis particularly difficult.\"\n\n\n\n\n\nWhile diagnosis continues to be an obstacle in Alzheimer's care, preventing symptoms like memory loss from worsening is also a focus for researchers.\n\n\n\n\n\nAyton said two drugs are now available in Australia — donanemab and lecanemab — which could help people with cognitive decline.\n\n\n\nHowever, Ayton said more research is needed to assess the impact of these medications, while there are widely accepted benefits for people with Alzheimer's when they make lifestyle changes.\n\n\n\n\n\n\"What's good for the heart is good for the brain,\" he said.\n\n\n\n\n\n\"Exercise, heart health and diet are shown to make a difference with prevention.\"\n\n\n\n\n\nHe said when addressing health concerns, it's \"earlier the better\" for the best outcomes.\n\n\n\n\n\n\"Hypertension has been shown to increase the risk of developing Alzheimer's. Dealing with hypertension at midlife will have better results than addressing it later on in life,\" he said.\n\n\n\n\n\nKumfor said speaking with psychologists and lawyers early on can help people with Alzheimer's to prepare for long-term challenges.\n\n\n\n\n\n\"Alzheimer's disease is progressive, and people will develop more severe symptoms over time, so it is also important to speak to someone for support and think about future planning,\" she said.\n\n\n\n\n\nThe information in this article is for general information purposes only and should not be relied on as a substitute for professional medical advice. Readers are advised to consult a qualified health professional for guidance specific to their situation.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/ukrainian-australians-call-for-further-action-on-russian-blood-oil/5imqsjgdu",
        "title": "Ukrainian-Australians call for further action on Russian 'blood oil' entering the country",
        "publish_date": "Sat, 8 Nov 2025 06:29:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Key Points Experts say a \"shadow fleet\" continues to bring Russian oil to Australia via refineries in third countries.\n\nMembers of the Ukrainian-Australian community say more should be done to stop Russian oil entering Australia via such channels.\n\nA recently launched Senate inquiry will look at how to stop the importation of fuels derived from Russian crude oil.\n\nOryssia Pryslak was born and raised in the small Ukrainian community in Victoria's port city of Geelong, where oil tankers were a common sight. Until recently, she had no idea that some of those ships might be carrying sanctioned oil from Russia.\n\n\n\n\n\n\"I was in disbelief, to be honest,\" the 26-year-old told SBS News.\n\n\n\n\n\nIn October, SBS revealed that Australia is the biggest importer of oil products refined from Russian crude oil in third countries.\n\n\n\n\n\nAustralia sanctioned the direct import of crude oil from Russia after the invasion of Ukraine in 2022, but experts say a \"shadow fleet\" of at least 25 ships continues to bring oil ashore via refineries in countries such as India and China.\n\n\n\n\n\n\"It's blood oil,\" said Oryssia's mother, Luba Pryslak, who is president of the Association of Ukrainians in Victoria.\n\n\n\nThe Ukrainian community held a protest in Geelong on Saturday that was timed to meet the arrival of a tanker they suspect is carrying products refined from Russian crude oil. Source: Supplied Oryssia and Luba were among roughly 50 protesters who stood at the jetty in Geelong on Saturday morning to protest the arrival of a tanker believed to be transporting products refined from sanctioned Russian crude oil.\n\n\n\n\n\nSpeaking after the rally, Luba told SBS News the Ukrainian community in Australia is calling on the government to close a loophole allowing such oil products to enter Australia and properly investigate whether current sanctions are effective.\n\n\n\n'Blood Oil'\n\nTo date, the government has sanctioned more than 150 \"shadow fleet\" ships, often uninsured vessels that avoid detection by regularly changing their nation of registry (a practice known as flag-hopping) and disabling their tracking systems, according to the Department of Foreign Affairs and Trade (DFAT).\n\n\n\n\n\nHowever, data provided to SBS News in October by the Centre of Research on Energy and Clean Air showed that 25 ships remain in the supply chain of Australian companies.\n\n\n\n\n\nForeign Minister Penny Wong has said there is no mechanism that would allow the government to track the origin of Russian crude oil that enters Australia via third-country refineries.\n\n\n\n\n\nAt Senate estimates on 10 October, Wong said the government expects the private sector to manage its own supply chains.\n\n\n\n\n\n\"Australians also expect businesses to prevent their supply chains from inadvertently funding Russia’s illegal and immoral invasion of Ukraine — and we ask businesses to uphold that responsibility,\" a DFAT spokesperson told SBS News.\n\n\n\nIn September, Tasmanian senator Jacqui Lambie likened the situation to that of diamonds mined in areas of conflict.\n\n\n\n\n\n\"Over 10 years ago, Australia was calling for blood diamonds to be included in the international definition of conflict diamonds, and now we're accepting Russian blood oil,\" she said in the Senate.\n\n\n\n\n\nOryssia, who recently returned from a visit to Ukraine, said knowing Australian money is going back to Russia gives her \"a sense of guilt\".\n\n\n\n\n\n\"All these people in Ukraine are like 'thank you so much for your help'. And in our backhand, we're actually sliding more money over to Russia.\"\n\n\n\n\n\n\"You're putting money into the pockets of people who are bombing civilians,\" Oryssia said.\n\n\n\nSince Russia's invasion of Ukraine in February 2022, over 14,000 Ukrainian civilians have been killed and more than 37,000 injured, according to the United Nations Human Rights Monitoring Mission in Ukraine (HRMMU).\n\n\n\n\n\nHRMMU head Danielle Bell said in early October: \"High civilian casualties last month confirm this year's disturbing pattern of intense violence in Ukraine, as virtually no day passes without civilian deaths or injuries, especially in frontline communities.\"\n\n\n\nMore transparency needed\n\nOn Wednesday, the Foreign Affairs, Defence and Trade References Committee launched a Senate inquiry into Russian sanctions, which will specifically look at how to stop the importation of fuels derived from Russian crude oil in Australia.\n\n\n\n\n\nIt will report back in March 2026.\n\n\n\n\n\nLuba said the Association of Ukrainians in Victoria want the inquiry to be moved forward.\n\n\n\n\n\n\"We won't wait until March until we get a report while people are dying and suffering,\" she said.\n\n\n\nA building in Kyiv following a drone attack the previous night, captured by Oryssia on a recent trip to Ukraine. Source: Supplied Luba also told SBS News the association wants greater transparency and accountability for private fossil fuel companies when it comes to their supply chain.\n\n\n\n\n\n\"Companies need to be more aware of their supply chain and where things are coming from, whether that comes from more government regulations [or somewhere else],\" she said.\n\n\n\n\n\n\"Let's just be more transparent about what's really happening,\" Oryssia said.\n\n\n\n\n\nDFAT told SBS News that \"Australia remains steadfast in its support for Ukraine as it defends itself against Russia’s illegal and immoral invasion.\"\n\n\n\n\n\n\"As a result of measures we have already taken, direct Australian imports of Russian energy products have fallen from $80 million to zero since before Russia’s invasion,\" the spokesperson said, adding that the government was \"evaluating options to place further pressure on Russia’s oil revenues\".\n\n\n\nKeeping Ukraine in 'eyesight'\n\nLuba said the Ukrainian community in Australia was mostly proud of how the Australian government has supported Ukraine.\n\n\n\n\n\n\"The Ukrainian diaspora has been proud that Australia has been able to support Ukraine, sending Bushmasters and humanitarian and military support,\" Luba said.\n\n\n\n\n\nIn February, DFAT said it has committed more than $1.5 billion to help Ukraine defend itself, including more than $1.3 billion in military support through equipment and training.\n\n\n\nA photograph taken by Oryssia on a recent trip to Ukraine. Source: Supplied / Oryssia Pryslak However, with the conflict soon heading into its fourth year, Oryssia is concerned that \"war fatigue\" could be setting in — \"especially with so many horrible things happening all around the world\".\n\n\n\n\n\n\"Australians say, 'oh you're Ukrainian, how's it all going'? And you have to say, 'it's going sh-t, actually'.\"\n\n\n\n\n\n\"I think Australians should really try to understand that we do need to keep it in our eyesight. We need to keep it in our minds.\"\n\n\n\n\n\n\"It's happening right now still.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-8-november-2025/b2fprprhi",
        "title": "Midday News Bulletin 8 November 2025",
        "publish_date": "Sat, 8 Nov 2025 01:14:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT\n\n\n\nIndigenous activists from the Amazon, Mexico and Indonesia attend the UN climate summit in Brazil\n\nGrammy nominations for Australian artists\n\nAnd in cricket, the Melbourne Stars unveils the team's new First Nations jersey\n\nWorld leaders and officials have started to arrive in the Brazilian city of Belem ahead of the official proceedings of the UN climate summit, COP 30 on Monday.\n\n\n\n\n\nAt this stage, Anthony Albanese is not planning on attending, though Climate Change Minister Chris Bowen will arrive for the second week of talks from November 17.\n\n\n\n\n\nDr Simon Bradshaw - from Greenpeace Australia Pacific - has told SBS the Prime Minister's attendance would be valuable to help strengthen Australia's bid to co-host next year's event.\n\n\n\n\n\n\"Now Australia is aspiring to host the next COP next year. And that really is an opportunity to do it better. To make sure it is a COP where everyone is able to participate. And where we are really backing in the longstanding legacy of climate leadership - and limiting warming ot 1.5 degrees, moving beyond fossil fuels, making sure support is accessible to communities who need it most.\"\n\n\n\n\n\n---\n\n\n\n\n\nA flotilla of Indigenous activists from all over the world has been sailing 3,000 kilometres down the river to attend the U-N climate talks in the Brazilian city of Belem.\n\n\n\n\n\nThe Yakumama Amazonian Flotilla departed from the Cayambe glacier in the Ecuadorian Andes, descending different rivers until reaching the great Napo, whose waters merge with the Peruvian Amazon.\n\n\n\n\n\nOn board are more than 60 Indigenous activists, artists and communicators not only from the Amazon, but also Guatemala, Mexico, Panama and Indonesia.\n\n\n\n\n\nBrazilian Indigenous activist Vanesa Apurina, says those on board share a common purpose.\n\n\n\n\n\n\"We have in common the resistance, and the struggle for the permanence of our environment. We are facing threats from large corporate projects — mining companies, deforestation, illegal fishing. And policies and bills should be implemented to guarantee the protection of Indigenous territories.\n\n\n\n\n\n---\n\n\n\n\n\nGoogle plans to build a large artificial intelligence data centre on Christmas Island.\n\n\n\n\n\nDocuments reviewed by Reuters news agency show the deal was signed by Australia's Department of Defence earlier this year.\n\n\n\n\n\nChristmas Island Shire officials told Reuters that Google is in advanced talks to lease land near the island's airport to construct the data hub, aND And there is a deal with a local mining company to secure its energy needs.\n\n\n\n\n\nPlans for the data centre on the island have not previously been reported, and many details including its projected size, cost and potential uses, remain secret.\n\n\n\n\n\nHowever, military experts say such a facility would be a valuable asset on the island, which is increasingly seen by defence officials as a critical frontline in monitoring Chinese submarine and other naval activity in the Indian Ocean.\n\n\n\n\n\nComment was sought from Google and the Defence Department - none was provided.\n\n\n\n\n\n---\n\n\n\n\n\nAustralians are among those nominated for the 2026 Grammy Awards.\n\n\n\n\n\nThree Australian acts are among the nominees: Kevin Parker of Tame Impala, Melbourne-based punk bank Amyl and the Sniffers, and alternative dance group Rüfüs Du Sol.\n\n\n\n\n\nThe 28-year-old Australian raised K-Pop singer-songwriter Rosé - also known as Roseanne Park - has made Grammy history as the first K-pop solo act to earn a nomination.\n\n\n\n\n\nThe member of BLACKPINK scored three nominations with her track 'APT'.\n\n\n\n\n\nThe ceremony will be held next year in February in Los Angeles.\n\n\n\n\n\n---\n\n\n\n\n\nIn cricket, Melbourne Stars have revealed their new First Nations jersey.\n\n\n\n\n\nTest quick Scott Boland and Wurundjeri artist Alex Kerr worked together to develop the design, which is a tribute to the Stars’ supporter base, Melbourne’s natural environment, and the MCG.\n\n\n\n\n\nKerr says it also tells the story of sky Country and its meaning for Wurundjeri peoples.\n\n\n\n\n\n\"This represents the Melbourne Stars and the connection it has with our communities. Then on the sleeves we've got the connection we all have to Country (Indigenous phrase) - it flows through the heart of the city. Then of course on the back, we've got representing Scotty Boland and his number. You know this is a meeting place, but it also represents the MCG. And it holds a very special connection not only to us as Wurundjeri people, but the entire Kulin nation - of coming together and sharing that one place as one.\"\n\n\n\n\n\nThe jersey will be worn by the club in their game against the Adelaide Strikers at the MCG on January 13.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/whooping-cough-vaccine-rates/fdcd1iz7d",
        "title": "'Unacceptable': Hospitals are missing opportunity to vaccinate for whooping cough",
        "publish_date": "Sat, 8 Nov 2025 01:10:37 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "New analysis has found hospitals are sleeping on an opportunity to vaccinate more Australians against whooping cough, a disease that's infecting the population at record rates.\n\n\n\n\n\nA probe from the Immunisation Foundation of Australia finds few hospitals are stocking a whooping cough-containing booster to jab patients with tetanus-prone wounds.\n\n\n\n\n\nThat's despite health guidelines recommending emergency departments use the combined vaccine in routine wound management to help boost protection against whooping cough (pertussis), with studies suggesting immunisation levels are \"concerningly low\".\n\n\n\n\n\nAustralia is in the grips of an unprecedented outbreak of whooping cough , an infection that can be life-threatening for babies and young children.\n\n\n\n\n\nAuthorities have been notified of 80,000 cases in the past two years, an all-time high.\n\n\n\n\n\nOften referred to as the '100-day cough', the bacterial infection attacks the airways and causes uncontrollable coughing and trouble breathing. It is more contagious than the flu or COVID-19.\n\n\n\nImmunisation Foundation founder Catherine Hughes said an opportunity to boost immunisation rates against the dangerous disease was being missed.\n\n\n\n\n\n\"It's unacceptable that so many vaccines used for tetanus in Australian hospitals do not include added protection against whooping cough, despite established national recommendations,\" she said.\n\n\n\n\n\nHughes lost her 32-day-old son Riley to the disease a decade ago.\n\n\n\n\n\nThe probe by the vaccination advocacy group found 401 of 469 hospitals were stocking the older diphtheria and tetanus vaccine, not the one that also provides protection against whooping cough and costs a few dollars extra per dose.\n\n\n\nEarlier research has found one million adults older than 50 had been given the older vaccine rather than the recommended whooping cough combined jab when seeking tetanus protection.\n\n\n\n\n\nRaina MacIntyre, head of global biosecurity at the Kirby Institute at the University of New South Wales, said vaccinating adults was key to managing the outbreak.\n\n\n\n\n\n\"Adults are a large component of the massive pertussis epidemic we've seen unfold in Australia, so vaccination of adults is part of the solution,\" MacIntyre said.\n\n\n\n\n\n\"Whooping cough is deadly for infants but has also caused serious complications in adults.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/heartbreaking-experts-argue-egg-donation-rules-could-change-to-help-australias-fertility-issues/4cd5nz1zc",
        "title": "'Heartbreaking': Experts argue egg donation rules could change to help Australia's fertility issues",
        "publish_date": "Fri, 7 Nov 2025 20:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nLiz Buckley-Stokes says she always wanted to be a mother.\n\n\n\n\n\nBut it took a little longer than she expected to try to start a family.\n\n\n\n\n\n\"My husband and I were a little bit later in life getting married, so we really wanted to have children and this was the only way that we could was through egg donation. I was 47, so my age was really against me.\"\n\n\n\n\n\nLiz, who is now in her 50s and lives on the Sunshine Coast, says she joined online forums for egg donation but it took around seven months to match with a donor.\n\n\n\n\n\n\"It is quite a long, drawn-out process and it is really hard because you're putting yourself out there and you get nothing in return and it is actually really soul-destroying when you're thinking that you're never going to be a mum and you're never going to have that chance because no-one's responding to your advert.\"\n\n\n\n\n\n\n\nLiz has since had three children using eggs from the same donor: a six-year-old boy and two four-year-old twins.\n\n\n\n\n\nShe also says she's maintained a close relationship with the donor who made them possible.\n\n\n\n\n\n\"Her reasons for becoming a donor were she had actually had to go through I-V-F herself because she had had to have her fallopian tubes removed, so she understood the process and she understood the heartbreak.\"\n\n\n\n\n\nWhile the process took a while, Liz considers herself lucky to have found an egg donor at all.\n\n\n\n\n\nSince the first I-V-F babies were born in the early 1980s, the fertility industry has boomed and now around one in every 16 babies born in Australia is conceived via I-V-F, with the demand for donated eggs far outstripping their supply in Australia.\n\n\n\n\n\nMonash University's School of Public Health senior research fellow, Dr Karin Hammarberg, says increasing fertility struggles are driving demand for donated eggs.\n\n\n\n\n\n\"Generally as a population, women are having children later or start trying for a baby later than they used to. You know, the proportion of women trying in their late 30s or early 40s is much higher now than it was 20 years ago and that means the ones who approach their 40s or are in their 40s. A lot of them will struggle to conceive.\"\n\n\n\n\n\nDr Hammarberg says that often these women are directed to use donated eggs.\n\n\n\n\n\nThey can find them in one of two ways in Australia: through personal connections like Liz or through I-V-F clinics.\n\n\n\n\n\nHowever, the Doctor says altruistic donation is still relatively rare.\n\n\n\n\n\n\"Most egg donations in Australia is through a known connection, so someone comes to the clinic and they have a sister or a sister or a cousin or something who is willing to do it for this very person but is not willing to do it for just anyone. And that's where the gap is. We don't have enough people who are prepared to do all this just out of the goodness of their heart.\"\n\n\n\n\n\nWhile the exact number of people waiting for donated eggs is unknown, one survey from The University of Melbourne found that out of 59 women placed on an egg donation waiting list at an IVF clinic, only 13 received a donor egg.\n\n\n\n\n\nStephen Page is a fertility lawyer from family law firm Page Provan.\n\n\n\n\n\nHe says this demand has led people to use eggs imported from overseas.\n\n\n\n\n\n\"So, we're seeing eggs imported from the United States, Malaysia and Ukraine, among other countries.\"\n\n\n\n\n\nSome hopeful parents also travel internationally to buy eggs and undergo fertility treatment - though other countries can have different legal and ethical standards for the process.\n\n\n\n\n\nIn countries such as the U-S, for example, donors can be paid a significant sum for eggs.\n\n\n\n\n\nBut in Australia, any direct or indirect financial inducements are illegal - which Dr Hammarberg says can create what she argues is a fairly bizarre situation.\n\n\n\n\n\n\"In a setting where everyone gets paid, the doctor gets paid, the clinic gets paid the recipient pays a lot of money, the only person who doesn't get any compensation is the woman who does the actual work. And that doesn't sit well with our understanding of what's equitable.\"\n\n\n\n\n\nTo try and address the shortage of eggs, experts are now arguing Australia could change its approach to donation.\n\n\n\n\n\nIn the United Kingdom, women are not paid directly for altruistic egg donation either, but donors can receive standardised compensation of around $2,000 for each cycle to cover their costs.\n\n\n\n\n\nWomen can also claim extra compensation for expenses such as travel, accommodation, and childcare.\n\n\n\n\n\nDr Hammarberg has suggested that there could be set compensation here in Australia too.\n\n\n\n\n\n\"In a way I think there must be some sort of middle ground here where there's some kind of recognition of the effort and some kind of appreciation of the fact that the woman takes risks and she goes through all of this.\"\n\n\n\n\n\nStephen Page agrees that Australia could make some changes and suggests that women could be better informed about the possibility of eggs they have already frozen with I-V-F clinics for personal use.\n\n\n\n\n\nIt's estimated there are approximately 100,000 eggs currently sitting in storage in Australia.\n\n\n\n\n\nAnd one study that examined ten years of egg freezing in Victoria found less than 13 per cent of patients returned to use their eggs each year.\n\n\n\n\n\n\"We're having lots and lots of eggs being frozen but hardly any of those extra eggs being frozen are being donated or used. Part of the problem is we have all these eggs in storage, none of them or very few of them are being made available for donation and maybe they won't be but if some of those women are encouraged and counselled and are willing to donate, that will help solve this problem.\"\n\n\n\n\n\nMr Page says that ultimately, using eggs from local donors could make things more fair for children born from these pregnancies.\n\n\n\n\n\n\"If we think of it from the child's perspective, from the child's perspective, many donor-conceived individuals want to know where they've come from. If they know that the donor is somewhere in Australia, that makes it a lot easier. It's just really easy and simpler. They're down the road or they're in the next state, they're not on the other side of the world where I may never find them.\"\n\n\n\n\n\nHowever, it is unlikely these changes will come soon and while Australia's supply and demand issue continues, Liz says she will try to connect donors and hopeful parents on a Facebook group she now runs.\n\n\n\n\n\nShe says she sees the continued impacts of a lack of donor eggs every day.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/does-building-more-apartments-help-housing-affordability/0opkcmpj4",
        "title": "'Won't make a lick of difference': Why building apartments may not bring prices down",
        "publish_date": "Fri, 7 Nov 2025 19:33:28 +0000",
        "category": "finance",
        "authors": [],
        "text": "As property prices across Australia continue to rise, many aspiring homeowners have their hopes pinned on what has become the mantra of housing affordability — increasing supply.\n\n\n\n\n\nGovernments across the country have been working to deliver 1.2 million new well-located homes over five years as one way of unlocking quality, affordable housing.\n\n\n\n\n\nCouncil decisions to allow for larger developments in certain areas, such as Sydney's inner-west, have been welcomed by some young people who are showing up to meetings and standing against opposition to increased density, which has slowed approvals in some areas and been a barrier to delivering more homes.\n\n\n\n\n\nFigures released this week showed apartment approvals have hit a near three-year high. Australian Bureau of Statistics data shows 5,430 apartment dwellings were approved in September, the highest number since December 2022.\n\n\n\nApartment building approvals are on the rise, including for blocks of more than nine storeys. Source: SBS News But as local councils move forward with rezoning land for high-rise apartment blocks, questions have been raised around whether these projects will actually improve housing affordability.\n\n\n\n\n\nSpeaking with SBS News last month, an attendee of an Inner West Council meeting said: \"I do not believe handing over vast swathes of land to private property developers and investors is the way to solve the housing affordability crisis.\"\n\n\n\n\n\n\"Private property developers don't exist to create affordable housing — they exist to create profit for their shareholders.\"\n\n\n\n\n\nSo, will building more apartments bring down prices?\n\n\n\nRezoning impacts housing affordability\n\nWhen the City of Sydney council was deliberating over the Green Square redevelopment in the 1990s — which involved the construction of a new train station and rezoning of areas from industrial uses to mixed-use — concerns were raised about the plan's impact on housing affordability.\n\n\n\n\n\nAuthorities were concerned because rezoning generally increases the value of land. A 2012 report on the Green Square Affordable Housing Program noted this upward pressure on property values \"would raise purchase and private rental accommodation costs beyond the reach of low to moderate income households\".\n\n\n\n\n\nSince its rezoning in 1999, 179 apartment buildings have been constructed in the Green Square urban renewal area, ranging in size from three to 29 storeys.\n\n\n\nThe Green Square urban renewal area in Sydney, in which the suburbs of Alexandria, Beaconsfield, Waterloo, Zetland and Rosebery were rezoned from industrial to mixed-use and 179 apartment blocks built, is one of the biggest urban renewal projects in Australia. Source: SBS News One of the objectives of the renewal was to retain a socially diverse population, but the report observed that in the first five to 10 years, the proportion of people with well-paid jobs and higher incomes had increased in Green Square and surrounding suburbs, including Alexandria, Beaconsfield, Waterloo, Zetland and Rosebery.\n\n\n\n\n\nCensus data indicated the proportion of households with a gross yearly income of $50,000 rose from 15.1 per cent in 1991, to 21.6 per cent in 1996.\n\n\n\n\n\nMedian rents had also increased by $25 per week in just one year, from $195 (in June 1997) to $220 in June the next year. In comparison, rents in Greater Sydney had only increased by $10 (from $200 to $210) and the median rent was lower than in those five suburbs, despite originally being marginally higher.\n\n\n\n\n\nTo address this, the council developed a policy to ensure around 330 units would remain under the ownership of a community housing provider for low to moderate-income households. Developers are now required to set aside 3 per cent of residential development as affordable housing or to provide a monetary contribution towards this.\n\n\n\nA spokesperson for the City of Sydney told SBS News that 254 affordable housing units have been built in the area, with another 500 approved.\n\n\n\n\n\nThese units are rented out to eligible households for around 30 per cent of the household's income.\n\n\n\n\n\nCity West Housing, which manages the affordable housing program, generally restricts eligibility to households with a gross income of less than $138,000, although other factors, such as links to the area, can be taken into account.\n\n\n\n\n\nAffordable housing differs from social housing, which is government-subsidised long-term housing for people on very low incomes.\n\n\n\n\n\n\"Social housing is the sole responsibility of the state and federal governments and is not an area the City of Sydney has remit over,\" the spokesperson says.\n\n\n\nApartments are not always affordable\n\nDeborah Nixon, a former Redfern resident, says she was lucky to buy a one-bedroom apartment in Waterloo during the COVID-19 pandemic.\n\n\n\n\n\nHer apartment is across the road from Green Square town centre and this has allowed her to stay close to the city. But she says the unit is not particularly affordable.\n\n\n\nFor the people that really need housing, I don't think they'd find it here.\n\nWaterloo homeowner Deborah Nixon lives close to Zetland and finds it very convenient, although she would like to see more green space. Source: SBS News RMIT University urban planning lecturer Liam Davies says simply allowing more apartments to be built won't make properties affordable.\n\n\n\n\n\n\"If we take affordable housing as housing which is affordable to people on low or very low incomes, it won't make a lick of difference because all it does is stop it getting more unaffordable,\" Davies says.\n\n\n\nPeople that are priced out, won't be priced in.\n\nHe says no one would call areas such as Mascot and Green Square (in Sydney), or Docklands (in Melbourne) 'affordable' despite being areas where large amounts of new apartments have been built.\n\n\n\n\n\n\"They're just less expensive than areas like Potts Point [in Sydney].\"\n\n\n\nMany apartment blocks have been built in Docklands, Melbourne. Source: AAP / James Ross However, while extra supply doesn't automatically make housing affordable, it can keep a lid on price increases.\n\n\n\n\n\nSince 2006, the population of Zetland in Sydney has grown by almost 400 per cent, according to the latest Census in 2021, increasing from 2,614 to 12,622 people in 15 years.\n\n\n\n\n\nUnit prices in Zetland during the same time period have also grown by 92 per cent, rising from a median price of $499,000 in September 2006 to $960,000 in September 2021, according to Domain.\n\n\n\nMedian unit prices grew more slowly in areas with large amounts of apartments such as Zetland, when compared to the broader Sydney area. The same happened in Docklands compared to greater Melbourne. Source: SBS News This is lower than the 121 per cent increase across Greater Sydney, despite Zetland being located just a few kilometres from the central business district.\n\n\n\n\n\nBut the median unit price in Zetland is still higher than Sydney's overall ($805,947).\n\n\n\nSupply doesn't equal affordability, but it can help\n\nDavies says one of the reasons we can't rely on the construction of more apartments to deliver affordable housing is that developers are less inclined to build when prices are going down.\n\n\n\n\n\nBanks will also reduce lending in urban areas with price declines because they don't want to be left with bad mortgages.\n\n\n\nREAD MORE Why young people are leaving these once-booming suburbs\n\nBut KPMG urban economist Terry Rawnsley says the average dwelling price in a desirable suburb like Newtown in Sydney might come down because new apartments will be cheaper than the terrace houses already there.\n\n\n\n\n\n\"[Although] it's not necessarily cheap enough for your hospitality workers or lower-income workers to afford those properties,\" he says.\n\n\n\n\n\nRawnsley notes that apartments can also help provide a better mix of housing options, which may also help those on lower incomes.\n\n\n\n\n\nBuilding better housing for high-income earners, he says, means they'll shift to the higher quality option and leave the cheaper homes for lower-income earners.\n\n\n\n\n\nHe points out that in gentrifying areas, run-down terrace houses that may previously have been a sharehouse for three or four people have been renovated and turned into family homes.\n\n\n\nIn gentrifying areas, terrace houses that used to be home to many young renters have been renovated, making them unaffordable. Source: AAP / Bianca De Marchi \"That's part of the reason why cities have become less affordable, we sort of lost that cheap and cheerful sharehouse market,\" he says.\n\n\n\n\n\nIf the market had provided more apartments and townhouses, this would have prevented some people from being squeezed out at the bottom end of the market, Rawnsley notes.\n\n\n\nApartments don't necessarily help families\n\nThe picture can be more complicated for families.\n\n\n\n\n\nDavies says if large numbers of houses are demolished and redeveloped into townhouses or flats, prices for houses often rise significantly because they become rarer.\n\n\n\n\n\nThis has implications for families who want dwellings with at least three bedrooms, as developers often don't build large multi-bedroom apartments suitable for families.\n\n\n\nYou're increasing the supply of two-bedroom dwellings [through the construction of apartments] and maintaining those prices reasonably stably or at least halting the increases — but you're reducing the supply of three-bedroom dwellings.\n\nDomain revealed last year that prices for three-bedroom units had risen faster than for two-bedroom units.\n\n\n\n\n\nThe median price for a three-bedroom unit in Sydney is now higher than a three-bedroom house, partly because units are often more centrally located .\n\n\n\n\n\nDavies says knocking down houses to build two-bedroom units means you'll probably see fewer families living in a certain area, and more renters.\n\n\n\nWhat this means is you can have a more rotational population — people aren't going to be living there for the long haul.\n\nHe says more thought needs to be put into what Australians want their communities to look like.\n\n\n\n\n\n\"I think we need to have stricter or more rigid standards on how many of these apartments should be three-bedroom or more, to encourage more family housing,\" he says.\n\n\n\n\n\nDavies would also like to see better minimum design standards in most states.\n\n\n\n\n\n\"[Areas] always change, but we should be guided by how we want areas to change and be intentional about that.\"\n\n\n\n\n\nHe says building more mid-rise, almost Parisian-style apartments of around five storeys may be more desirable than high rises.\n\n\n\nBuildings on the Rue de Rivoli, which runs through the centre of Paris. Source: Getty / Delmarty J/Alpaca/Andia/Universal Images Group Grattan Institute modelling released on Thursday found one million homes could be unlocked in Sydney if developments of up to three storeys could be done without a planning permit (as long as they met clear standards).\n\n\n\n\n\nIt says allowing three-storey townhouses and apartments on all residential land in capital cities could lift housing construction across Australia by up to 67,000 homes a year. Over a decade this could cut rents by 12 per cent and reduce the cost of a median-priced home by $100,000.\n\n\n\nSupply needed at every level, experts say\n\nBut Davies says if the aim is to provide affordable housing for low-income earners, this is best achieved if it is built intentionally and that usually means government involvement.\n\n\n\n\n\nAs part of the N ational Housing Accord, federal, state and territory governments have agreed to build or incentivise the construction of up to 20,000 affordable homes.\n\n\n\n\n\nThis makes up just 1.7 per cent of the 1.2 million homes to be delivered over five years.\n\n\n\n\n\nBut Housing Minister Clare O’Neil says in total the government will deliver 55,000 new social and affordable homes by 2029.\n\n\n\n\n\n\"We’ve got more than 25,000 social and affordable homes in planning or construction with over 5,000 social and affordable homes completed,\" she tells SBS.\n\n\n\nFederal Minister for Housing Clare O’Neil says more than 5,000 social and affordable homes have been built in the past two years. Source: AAP / Joel Carrett However, there are concerns about the slow delivery of homes, with an audit underway into the operation of the Federal Government's Housing Australia Future Fund (HAFF), an investment vehicle established two years ago to support the construction of social and affordable housing.\n\n\n\n\n\nJust 567 homes have been built so far through the HAFF program.\n\n\n\n\n\nGreens senator Barbara Pocock has questioned why the government isn't directly funding public and community housing.\n\n\n\n\n\n\"It's faster, cheaper, and it worked the last time Australia faced a housing crisis in the post-war years. We know we can do it. We've done it before.\"\n\n\n\nREAD MORE Government housing affordability scheme under pressure\n\nFotheringham says if Australia is serious about improving affordability, it would also require every development over a certain size to include a certain number of units at an affordable rent level.\n\n\n\n\n\n\"That's common practice in several other countries or jurisdictions,\" he says.\n\n\n\n\n\n\"It's part of the fabric of London and has been for a long time.\"\n\n\n\n\n\nIn response to community concern, the Inner West Council has adopted the City of Sydney's inclusionary zoning policy, which requires a 3 per cent affordable housing contribution in upzoned areas. Fotheringham says other neighbouring areas need to do the same.\n\n\n\n\n\n\"It just falls apart because some councils are willing to say 'don't worry about it' and then nothing happens,\" he says.\n\n\n\nWe should have it consistent across the country.\n\nRawnsley points out that calculating what's affordable can also be complicated.\n\n\n\n\n\nAffordable rents in Green Square are calculated using household income but some schemes use discounted market rent — calculated around 80 per cent of market value — which means rents can still be high in popular inner city areas.\n\n\n\n\n\nIncome caps for certain schemes can also squeeze out families earning slightly more than the threshold.\n\n\n\nFor example, affordable housing may help someone earning under $60,000 to find accommodation, but someone earning $80,000 may then struggle to compete with those on high incomes for the remaining properties.\n\n\n\n\n\nIf someone on $100,000 can't find good options within their price range, they will apply for other cheaper properties that may have otherwise been affordable to those on $80,000.\n\n\n\n\n\n\"I think the current approach of trying to go more public housing, more social housing, more affordable housing and more private sector housing is best. You've got to put supply into all those markets,\" Rawnsley says.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/piakuras-strike-causes-tensions-to-boil-over-20251109-p5n8v3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Piakura's strike causes tensions to boil over",
        "publish_date": "Sun, 09 Nov 2025 13:01:29 +1100",
        "category": "finance",
        "authors": [],
        "text": "Piakura's strike causes tensions to boil over\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/live-reviews/fancy-a-dose-of-hedonism-with-a-gatsby-like-vibe-step-this-way-20251029-p5n664.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hours of full on power: Metallica deliver fierce and fiery show",
        "publish_date": "Sun, 09 Nov 2025 12:57:51 +1100",
        "category": "entertainment",
        "authors": [
            "Jessica Nicholas",
            "Martin Boulton",
            "Gabriela Sumampow"
        ],
        "text": "Metallica’s thundering two-hour set featured songs from across their extraordinary career, including latest album, 72 Seasons, and stretched back to their earliest days in San Francisco’s Bay Area with their late, much-loved bass player, Cliff Burton. Master of Puppets and a pummelling version of groundbreaking, thrash metal anthem Seek and Destroy (the latter from debut album Kill ’Em All) were among the many standout moments. Hetfield, dressed head-to-toe in his trademark black, revelled in the sing-along moments, including a rousing version of The Memory Remains, but he’ll surely cherish the almighty, closing moments of Enter Sandman. Six years after he originally planned to bring Metallica back to Melbourne, the band’s imposing frontman looked happy, healthy, and thrilled to be back with his extended rock ‘n’ roll family. Reviewed by Martin Boulton\n\nMUSIC\n\nTWICE | THIS IS FOR Tour ★★★★\n\nRod Laver Arena, November 8 Nothing beats the thrill of seeing your idols up close, and TWICE tried to make that a reality, performing on an immersive, 360-degree stage. TWICE wowed their adoring fans at Rod Laver Arena. Credit: Evan Agostini/Invision/AP It’s the group’s third visit after two shows in 2023’s Ready To Be tour; the rain outside Rod Laver certainly did not reach their parade. “Was everyone’s way here okay?” asked Dahyun, which was met with a loud “NOOOOOOOOO!” Rather than going all in, they eased in gently raising the curtain with latest English tracks This Is For and Strategy. And then the stage that was an unassuming block flexes its versatility for I Can’t Stop Me and Options: a platform in the former, steps to sit on in the latter.\n\nPerforming to a 360-degree crowd is no easy feat, though. Face one side for one verse, then another, then dance in a circle, then disperse to the side stages. It’s a tricky set of instructions, but when you’re a 10-year-old K-pop girl group, it looks as easy as breathing. I saw both of TWICE’s shows in 2023, and their tenderness in addressing their fans continues to inspire. It’s as if they flicked a switch from being one of K-pop’s strongest performers, to girls next door saying “G’day mate” (literally) to a crowd they’ve missed. As with the Sydney shows, rapper Chaeyoung was sadly absent. Next, a tonal shift from dreamy earworms Moonlight Sunrise and I Got You, to the more powerful and alluring Cry For Me and Right Hand Girl. Just when you thought you’ve seen it all, a live band at the edge of the stage appears to accompany the latter tracks, wowing the audience with rock-like adrenaline. The solo stages (a tradition even in past TWICE shows) have always been an exciting guessing game. This time, we’re asking “Who’s next?” and looking around to see which side of the stage each member pops up from. Mina, the group’s ballerina, takes centre stage with traces of ballet in Stone Cold. And later, leader Jihyo – providing a masterclass in stage presence throughout the night – dominates a side stage with R&B dance number ATM. You would think it’s easier to sing English songs like This Is For, but “wild” is an understatement for the crowd’s enthusiasm for the group hits after the solos.\n\nFor long-time K-pop fans like me, our first taste of TWICE was in the 2010s with genre-defining hits like What Is Love, Fancy, or Yes Or Yes. To sing and dance along to hit after hit is not only an overdose of nostalgia, but also evidence of the mark left by this K-pop powerhouse. The eight idols also took their time to get closer to the fans, even anchoring the mic for them to scream “YES OR YES!” at the top of their lungs. Feel Special was the hit of the night, the most meaningful hit in the group’s discography. In the purest form of artist-fan interaction, the group of eight momentarily schemed how to get the crowd moving. Their answer? Body waves every time they sing the line, “You make me feel special”, and then standing up for closing song One Spark. A lot has been said about how TWICE has matured from cutesy chart-toppers with tracks like TT and Cheer Up, but this tour has been the best way to prove what a decade of experience does to a K-pop girl group. It’s no wonder these nine humble performers are among the genre’s best, and why fans behind me – voices almost gone, like mine right now – said it’s “never not a good time” when they’re here. Reviewed by Gabriela Sumampow MUSIC\n\nAffinity String Quartet ★★★★\n\nMelbourne Recital Centre, November 7\n\nMelbourne-based Affinity Quartet has rounded off its globe-trotting 10th anniversary celebrations with a compact program showcasing its luminous, dedicated artistry. Founders, cellist Mee Na Lojewski and violinist Nicholas Waters, together with violist Josef Hanna and violinist Shane Chen possess a passionate ardour that seems to light up their music-making from within. Receiving its first Australian performances on this tour, Incantation in Four Parts by French-born, London-based composer and soprano Heloise Werner provided a curious curtain-raiser. Moving from the mechanical to the lyrical, the work’s soundscape also required assorted vocalisations by the players, including a satisfied “ah” at the end of the first section. This intrepid piece of programming was perhaps more thoughtfully clever than truly mesmerising. Affinity String Quartet. Mozart’s Adagio and Fugue in C minor, K. 546 was invested with a high sense of drama throughout. Aided by the brilliant, resonant tone of the group’s instruments, forthrightly projected into the lively acoustics of the Salon at the Melbourne Recital Centre, the fugue’s contrapuntal texture in particular was clearly etched into the listeners’ consciousness. Debussy’s beguiling and superbly crafted String Quartet in G minor, Op. 10 thrummed with energy, the players ensuring from the outset that the work’s essential rhythmic element was always kept in view. After the driving opening with its moments of shimmering ecstasy, effective contrasts were made between the pizzicato and bowed passages in the nimbly executed second movement.\n\nWith its gently pulsing accompaniment, the poignant third movement elicited greater attention to details of light and shade that had been slightly overwhelmed by the group’s charismatic enthusiasm in the previous movements. Marked by industrious determination, the race to reach the all-too-sudden finish line was well controlled and resulted in an exhilarating finale – a worthy crowning of a decade of hard work and artistic growth by four gifted musicians. Reviewed by Tony Way\n\nVARIETY\n\nBlanc de Blanc Encore ★★★\n\nSpiegel Haus Melbourne, from October 29\n\nMelburnians craving variety entertainment should check out the new pop-up performance precinct at Spiegel Haus Melbourne, on Lonsdale Street in the CBD. It’s opened its doors in time for summer and features a rooftop bar with intimate venues, including an Edwardian-style Spiegeltent backing onto a laneway in Chinatown. The cast of Blanc de Blanc Encore. Credit: Cameron Grant\n\nTaking up residence in a carnival atmosphere is Strut & Fret’s Blanc de Blanc Encore – a risqué blend of cabaret, circus, comedy and burlesque which, as its name suggests, pays Dionysian homage to the pleasures of the grape, in a slick showcase of variety performance guaranteed to make you feel like you’re drinking champagne, even if you’re stone-cold sober. Compered by a comedy duo – Emile Mathieu and Felix Pouliot – in formal attire, the evening kicks off with a warm-up that’s also a bit of a balls-up. These two gents know how to milk a joke, and though the opener’s terrible puns might leave you testy (depending on your taste for below-the-belt humour), the suggestive physical clowning, rambunctious low comedy, and engaging party tricks should win you over as the show progresses. Circus acts include a dizzying aerial hoop routine from Danielle Summers, a cartoonish display from Ukrainian contortionist Mykhailo Makarovoak that must be seen to be believed, and Felix Pouliot’s muscular, gravity-defying pole dance, which transforms into a climax positively effervescing with airborne pop and fizz. Aerial hoop performer Danielle Summers. Credit: Steve Napiza Burlesque takes centre stage through titillating and tightly choreographed striptease, drag-adjacent gender play, and erotic dance with something for everyone.\n\nChanteuse Clara Fable sings brisk excerpts from the odd jazz standard as well as more obscure (and loucher) numbers. I thought her puerile masturbation gag, performed to Rhapsody in Blue, gratuitously insulting to Gershwin, but this is the kind of show where it’s probably best to leave your high-mindedness at the door. Classy only on the surface, this is a hedonistic show that denies no guilty pleasure, drenching audiences in a decadent, high-society, Gatsby-like vibe. True, the retro 1920s stylings can make some of the “naughtiness” look super mainstream a century on, but it remains an immersive entertainment from a company of international renown, and a fun way to open a new performance venue in the heart of a city known for tucking away its most vibrant treasures in alleyways and hidden corners. Reviewed by Cameron Woodhead Jazz musicians Joost Lijbaart and Wolfert Brederode.\n\nJAZZ\n\nJoost Lijbaart and Wolfert Brederode ★★★★\n\nThe JazzLab, November 5\n\nPatience. That’s the word – and the quality – that came to mind as I listened to Joost Lijbaart and Wolfert Brederode perform, and pondered what made their music so beguiling. The drummer and pianist (both from the Netherlands) have been playing together in various settings for over 20 years, and their musical connection is so finely honed that they can communicate with the barest of gestures. They last toured Australia in 2018 as part of a superb quartet led by saxophonist Yuri Honing, but it’s perhaps in duo mode that their creative antennae are most vividly displayed. Joost Lijbaart and Wolfert Brederode are both from the Netherlands. At JazzLab on Wednesday, each of their two sets unfolded as a continuous, quietly compelling exchange of ideas and energy. Brederode and Lijbaart are musical storytellers, but their stories are mostly improvised, with the narrative arc shaped moment by moment and the conclusion unknown until it arrives.\n\nHence the patience. Rather than fabricating drama or climactic sequences to keep the audience engaged, these musicians simply created space and waited for fresh themes, directions and detours to reveal themselves. At the piano, Brederode shaped wisps of shadowy abstraction into the contours of a melody before letting it dissolve, or coaxed harmonic motifs into a lush, flowing river before it, too, melted away. Beauty was everywhere, tinged with melancholy and longing, as though Brederode were grasping at something – a memory, an experience, a feeling – just out of reach. In this setting, Lijbaart’s drums and percussion were rarely used for time-keeping. Instead, they produced colours and textures that enhanced or subtly contrasted with Brederode’s atmospheric explorations. Yes, Lijbaart could summon a propulsive sway or polyrhythmic shuffle to nudge the music towards a groove. But more often he evoked a sense of mystery or ritual with the resonant chime of a temple bell, the rustle of a beaded shaker or the bird-like call of a wooden flute. The duo’s close listening and attention to detail invited us to lean in and listen closely too, conjuring a spell of enchantment from which we were reluctant to emerge.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/melbourne-demons-vs-brisbane-lions-aflw-live-dees-lions-chase-preliminary-final-spot-20251108-p5n8rr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Melbourne Demons vs Brisbane Lions AFLW LIVE: Dees, Lions chase preliminary final spot",
        "publish_date": "Sun, 09 Nov 2025 12:36:17 +1100",
        "category": "sports",
        "authors": [
            "Hannah Kennelly",
            "Jon Pierik"
        ],
        "text": "North Melbourne are two wins away from an undefeated season after defeating Hawthorn in an AFLW qualifying final on Friday night.\n\nThe Roos had a poor night in attack but were too polished around the ground as injuries hit the brave but overmatched Hawks in front of 4392 fans at Ikon Park in Carlton.\n\nAlice O’Loughlin of the Kangaroos celebrates a goal. Credit: AFL Photos via Getty Images\n\nThe Roos undefeated streak, dating back to last season, is now up to 25 games in succession as they won 5.12 (42) to Hawthorn’s 0.3 (3).\n\nNorth will rest up for the next week while the Hawks will hope the injuries which hit them on this night won’t carry over to next weekend’s elimination semi-final.\n\nRoos coach Darren Crocker praised his side’s patience but said they would look at their forward play after missing out on several scoring chances.\n\n“That’s probably be one area that we’ll look at,” Crocker said.\n\n“Their ability to not just defend inside the defensive 50m [arc], but also put pressure on the ball carrier - sometimes the ball carrier was under pressure and they couldn’t get the ball in the areas they wanted to.\n\n“We could have been a little bit better with where we put the ball at times.”\n\nLibby Birch, Jasmine Garner, Ash Riddell and Erika O’Shea were among North’s best players but they were typically strong across the ground in a fiery match while Eliza West, Laura Stone, Tilly Lucas-Rodd and Aileen Gilroy were among the Hawks best.\n\nKaitlyn Ashmore hurt her calf and didn’t return in the final term while Aine McDonagh played through what looked like a painful knee injury.\n\nThe Hawks will play the winner of the elimination final between Carlton and West Coast which will be played at Ikon Park on Saturday.\n\n“They made it a really tight, high-pressure contest,” Crocker said.\n\n“But we’ve got a lot of trust in the way we play, our system and our identity. Hopefully, teams can hold us for a period of time, but it will open up at some point.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/wallabies-player-ratings-how-the-men-in-gold-performed-against-italy-20251109-p5n8sh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Wallabies player ratings: How the men in gold performed against Italy",
        "publish_date": "Sun, 09 Nov 2025 09:55:06 +1100",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Nick Frost at the end of the Wallabies-Italy clash. Credit: Getty Images Jeremy Williams - 5.5 Always works hard, and Williams again defended with energy. But breakdown work should be bread-and-butter for tight forwards and Australia were second-best. Tom Hooper - 6.5 Arguably the only Wallaby ball-runner who made consistently good yardage when he carried. And Hooper trucked it up hard, particularly in the first half. Strong showing highlighted the odd decision by Joe Schmidt to not use his Exeter teammate Len Ikitau.\n\nTom Hooper of Australia looks for support from Matt Faessler. Credit: Getty Images Fraser McReight - 7 The Wallabies’ best for a second consecutive week. Added more pilfers to his world-leading tally of turnovers in 2025, and added some welcome linespeed in the Wallabies’ defence, too. Harry Wilson - 5 Effort is never in doubt, as seen by a team high 15 carries. But he was chopped for many and struggled to make any headway. Wilson is the heart of the side and the fact he looks weary and was beaten to the punch probably sums things up. Leadership-wise, the Wallabies went away from things that looked promising, ie rolling mauls and the scrum.\n\nJake Gordon behind the Wallabies’ scrum. Credit: Getty Images Jake Gordon - 5 Clean as a whistle again on pass-kick skill (apart from a kick out on the full), and made a nice break in the first half. But it was far too rare. Wallabies attack is now far too predictable, and missing a probing threat near the ruck to keep defenders honest. Quick tap from a scrum after Tupou had won a penalty the scrum before was also a tad hasty. Carter Gordon - 6 After 18 months out of rugby, this was a mostly impressive return for Gordon, who looked assured on the ball - and under the high ball, too. Made a nice linebreak and finished off a well-taken (though lucky) try. Carrying a quad injury, the lack of a kicking game limited Gordon’s options though, and the team’s. Italy had no trouble defending the Wallabies all night.\n\nIt was an impressive return from Carter Gordon. Credit: Getty Images Corey Toole - 5.5 Some good contestable kick wins in the first half but rarely sighted in attack, and the fact there are no plays being deployed to use Australia’s fastest player - as seen with Max Jorgensen last week - points to a flawed attacking strategy. Hunter Paisami - 5 Defended stoutly and carried often, but mostly as a battering ram. Paisami has good touch and skill, and the Wallabies use him to play second wave shapes, but it felt under-pressure and rushed all night. Not to mention over-done.\n\nJoseph-Aukuso Suaalii - 4 Defended well until he got it horribly wrong in the second half and was yellow carded for a high shot. Has ridden his luck on high shots in rugby before this game. The card left the numbers stretched for Australia and led to Monty Ioane’s match-winning try. Had more attacking involvements but still runs too high into contact in rugby. Joseph-Aukuso Suaalii of Australia makes a break. Credit: Getty Images Harry Potter 4.5 It’s clearly part of Potter’s game to roam all over the field, and even get into rucks and mauls. But it has mixed results and can impact his core business as a winger. He was isolated on a few carries, and with heavy legs was also beaten on the outside by Ioane for his try.\n\nAndrew Kellaway 4.5 When the Wallabies are on, Kellaway is usually a key cog. So when Kellaway is off, you know the Wallabies are too. A handful of mistakes from the usually assured fullback, with some dropped ball and a missed tackle on Louis Lynagh that allowed a try. RESERVES Billy Pollard 5 Limited involvement but got his set-piece work right.\n\nAidan Ross 5 Played a solid 40 minutes and kept the Wallabies scrum in good shape. Head-down, bump-up kind of player. Loading Zane Nonggorr 5.5 Some strong carries from Nonggorr, who isn’t a noted ball carrier but showed what can be done with leg drive after contact. Several teammates need to take notes.\n\nRob Valetini 5.5 Showed his power in a very limited stint on the field, which again highlighted the unusual use of the bench by Joe Schmidt. Why you would not have Valetini playing at least 30-35 minutes in mystifying. If it was to keep him fresh for next week, the gamble backfired. Pete Samu 4.5 Looked a little lost in limited minutes, beyond one clean-up mission from an intercept. You hope Samu gets more opportunity, and working in the wide channels where he is effective. Ryan Lonergan na",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw11-west-ham-vs-burnley-20251109-p5n8t8.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW11: West Ham vs Burnley",
        "publish_date": "Sun, 09 Nov 2025 09:10:43 +1100",
        "category": "finance",
        "authors": [],
        "text": "Rapid Recap | MW11: West Ham vs Burnley\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw11-everton-vs-fulham-20251109-p5n8t9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW11: Everton vs Fulham",
        "publish_date": "Sun, 09 Nov 2025 09:09:10 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW11: Everton vs Fulham\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw11-spurs-vs-man-utd-20251109-p5n8t7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW11: Spurs vs Man Utd",
        "publish_date": "Sun, 09 Nov 2025 09:07:48 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW11: Spurs vs Man Utd\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/rapid-recap-mw11-sunderland-vs-arsenal-20251109-p5n8t6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rapid Recap | MW11: Sunderland vs Arsenal",
        "publish_date": "Sun, 09 Nov 2025 09:07:43 +1100",
        "category": "sports",
        "authors": [],
        "text": "Rapid Recap | MW11: Sunderland vs Arsenal\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/italy-well-worth-their-win-over-wallabies-with-a-little-help-from-the-man-upstairs-20251109-p5n8ss.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Italy well worth their win over Wallabies - with a little help from the man upstairs",
        "publish_date": "Sun, 09 Nov 2025 09:03:06 +1100",
        "category": "sports",
        "authors": [
            "Peter Fitzsimons"
        ],
        "text": "Back in the day, Italy could expect to win a Test match against front-line international rugby sides, only ad ogni morte di papa, every time the pope died.\n\nNot any more.\n\nThe Six Nations is no longer the Five Nations + One Also Ran. For in the last decade and a bitty, Italy has proved itself more than capable of regularly beating the likes of Wales and Scotland, and have beaten both France and Ireland – not to mention Australia, just three years ago.\n\nOn their day, and most particularly in recent times, they can play in a manner to make one think that the one Pope who played rugby, Pope John Paul II, must now be pulling a few strings as a heaven local, on the very game they play in heaven. In sum, this was never a “gimme” game, and an automatic lifting of the Wallaby stats for the year. It was always going to be a testing Test and Italy showed from the first they were here to play, more than holding their own in the forwards and often unleashing human Ferraris in the backs.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/david-littleproud-slams-disgraceful-neo-nazi-protest-20251109-p5n8t1.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "David Littleproud slams 'disgraceful' neo-Nazi protest",
        "publish_date": "Sun, 09 Nov 2025 08:56:47 +1100",
        "category": "finance",
        "authors": [],
        "text": "David Littleproud slams 'disgraceful' neo-Nazi protest\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/senator-big-call-amid-coalition-010212550.html",
        "title": "Senator’s big call amid Coalition chaos",
        "publish_date": "2025-11-09T01:02:12Z",
        "category": "finance",
        "authors": [],
        "text": "Liberal senator Andrew Bragg has said he would quit the front bench if the party scrapped Australia’s commitment to the Paris Agreement, as the embattled Coalition prepares to finalise its energy policy.\n\nInternal divisions are rife within the Liberal Party over the contentious emissions target, with moderates wanting to keep net zero by 2050 – partly in an effort to target inner-city seats clinched by Labor and the Teals in the last election – and the right faction wanting to abandon the target, claiming it is an unaffordable way to implement the energy transition.\n\nThe Nationals announced last week that they were formally abandoning net zero, with pressure mounting on Sussan Ley to present a policy that reconciles the division.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAsked on Sunday morning whether the “right thing” was staying on the front bench and changing his view or quitting, the opposition housing spokesman told the ABC: “You can’t change your fundamental views.\n\n“I mean, you can’t do that: ‘Here are my principles, but I have these ones if you don’t like those’.\n\n“It’s pretty much the case that Australia needs to be in (the Paris Agreement), in my opinion, and then we need to try and find a way to do net zero better than Labor.\n\n“That is better for jobs, better for industry, and better for decarbonisation. \"\n\nIt wasn’t net zero that is driving energy prices up, but Labor’s policies, Andrew Bragg says. Picture: NewsWire / Martin Ollman\n\nPressed on whether he would exit the front bench if the Liberals did not stay in the international climate treaty and commit to a form of net zero, Mr Bragg said: “Well, sure, but I don’t imagine that we would ever leave Paris.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“We’re a party of government, right? We’re not a fringe party - we’re not fringe-dwellers.\n\n“Most Australians want us to play our fair role in terms of emissions reduction, so I just don’t think that we’re going to be leaving the Paris Agreement.”\n\nAustralia signed the Paris Agreement in 2016, making it one of more than 170 countries to agree to the international treaty’s long-term goals, including a substantial emissions reduction to limit global warming to no more than 1.5 degrees celsius above pre-industrial levels.\n\nTo achieve this and prevent the worst impacts of climate changes, global emissions must reach net zero around 2050.\n\nDan Tehan has been tasked by Sussan Ley to lead a review into the Liberal Party’s position Picture: NewsWire / Martin Ollman\n\nOn the possibility of the Liberals adopting a policy that completely abandoned net zero, Mr Bragg said he could not see how the party room would take such a position.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“You can’t have a fatwa on two words. This is the international standard,” he said.\n\n“Trying to pretend that you’re not going to say two words is absolutely ridiculous.\n\n“Australia is part of the international community.\n\n“It is not actually the net zero accord which is driving higher power prices - it is Labor’s disastrous energy policies.”\n\nHe said abandoning net zero would make Australia international outliers, alongside “Azerbaijan, Iran, Syria and a few other baddies”.\n\n“Australia has never been with those people before,” he said.\n\nNet zero ‘challenge’\n\nOpposition energy spokesman Dan Tehan has rejected claims the Nationals are taking control of the opposition’s net zero platform, which has triggered months of chaotic infighting within the troubled Coalition.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe Liberals are expected to come to a unified position on the contentious emissions target and have outlined a timeline for the Coalition to announce an official energy policy platform next week.\n\nHowever, the Nationals agreed to scrap net zero earlier this month, pre-empting the results of the Liberal Party’s policy review and prompted questions about whether the junior Coalition partner was trying to take over the net zero debate.\n\nAsked whether the National Party had “held a gun to (their) head” on the policy, as reportedly claimed by a Liberal backbencher, Mr Tehan told Sky News it was part of the Coalition’s agreed-upon process.\n\nMs Ley’s leadership is under immense pressure. Picture: NewsWire / Martin Ollman\n\n“The decision was taken five months ago that the National Party would have their process, we would have our process, and then we would come together,” he said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“I’ve respected that from day one.”\n\nInternal divisions within the Liberals have also present a particular challenge for Mr Tehan, who is leading the review process into the party’s energy and emissions reduction policy.\n\nAsked whether he was able to reconcile those for and against the controversial policy, Mr Tehan said: “I do understand both points of view, and in the end, what we’ve got to be able to do is come together under the one policy.\n\n“Now, I always said this would be like threading a needle, but that’s the challenge, and what we have to do as a Liberal Party and as a Coalition is ultimately be able to come together and unite behind a policy.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nMr Tehan also confirmed a key priority for the Liberals was to work with state governments to continue coal-fired generation, which he said were “crucial to bringing [energy] prices down”, along with adding more “gas in our system”.\n\n“What I’m saying is we need to make sure that we’re sweating those coal assets, continue to sweat those coal assets, and also that we can get more gas into the system much more quickly.”",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-council-urged-to-step-in-over-frustrating-neighbour-issue-completely-overrun-010010314.html",
        "title": "Aussie council urged to step in over 'frustrating' neighbour issue: 'Completely overrun'",
        "publish_date": "2025-11-09T01:00:10Z",
        "category": "finance",
        "authors": [],
        "text": "Welcome to Yahoo's weekly column where lawyers Alison and Jillian Barrett from Maurice Blackburn tackle problems everyday Aussies face — whether it be consumer, property, money matters impacting relationships or work.\n\nQuestion\n\nI live in Liverpool NSW and I’m really struggling with the state of a few properties on my street. Some of my neighbours have front yards that are completely overrun with junk — things like old fridges, washing machines, rusted cars that clearly haven’t moved in years, and just piles of rubbish. It’s honestly an eyesore and makes the whole street look terrible. Apart from that, I’m worried it’s attracting rats and other pests. I get that it’s their property, but surely there’s got to be some kind of rule about how much stuff you can leave sitting around like that? It’s so frustrating to have to look at it every day. Can the council actually do anything about people hoarding junk in their front yards, or is it completely up to them?\n\nAnswer\n\nWhile people generally have the right to use their property as they see fit, there are limits, especially when their actions affect others or pose health and safety risks.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIn your case, the accumulation of junk in front yards may fall under local council regulations dealing with unsightly premises, public health, or even fire hazards.\n\nWhat can the council do?\n\nMost local councils, including Liverpool City Council where you live, have powers under the Local Government Act 1993 (NSW) to issue orders requiring property owners to clean up their land if it is considered:\n\nUnsightly or offensive to the public,\n\nLikely to attract vermin or pests, or\n\nA risk to health or safety.\n\nThese powers are typically exercised through what’s called a “Prevention Notice” or “Clean-Up Notice”.\n\nDo you have a matter you'd like us to weigh in on? Contact newsroomau@yahoonews.com and we might feature it next.\n\nIf a property is found to be in breach of these standards, the council can issue a formal notice requiring the owner to remove the rubbish or take other remedial action.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nIf the owner fails to comply, the council may carry out the work themselves and recover the costs from the owner.\n\nWhat counts as a breach?\n\nThere’s no strict definition of how much junk is “too much”, but councils will usually consider the following:\n\nThe type of materials (eg. hazardous waste, broken appliances, scrap metal).\n\nThe location (eg. front yard vs. backyard).\n\nWhether it’s visible from the street.\n\nWhether it’s attracting pests, and\n\nWhether it poses a fire or safety risk.\n\nFrom what you have described, it sounds like some of your neighbours may be breaching the laws.\n\nAlison and Jillian Barrett are Principal Lawyers at Australia's leading plaintiff law firm, Maurice Blackburn.\n\nWhat can you do?\n\nHere are some practical steps you can take:\n\nTalk to your neighbour (assuming it is safe to do so). Sometimes a polite conversation can go a long way. They may not realise the impact it’s having. They also may not realise that your local council provides residents two free household clean-up services per year, which include collection of bulky items. Document the issue. Take photos and keep a record of any health or safety concerns (eg. rats, smells, blocked footpath access). Contact the council: Lodge a complaint with the council’s environmental health or compliance team. You can usually do this online or by phone. Be specific about the address, what you’ve observed, and how long it’s been going on. Providing photographs will also be helpful.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nPlease be aware that if the issue goes beyond just junk and reflects signs of hoarding, the council may still intervene.\n\nIn these cases, the council might work with mental health services to support your neighbour while also ensuring the property is made safe.\n\nIf you’ve already contacted the council and nothing has happened, you might consider escalating the matter to the NSW Ombudsman or seeking legal advice about nuisance or environmental harm.\n\nThis information is general in nature and should not be regarded as specific legal advice. For legal advice on a specific situation, consult a qualified solicitor.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe contents of this column reflect or are inspired by real-life experiences. Some details may be adapted.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]