[
  {
    "url": "https://www.9news.com.au/national/qantas-cyber-attack-additional-information-impacted-customers-email/9dddb6d7-0df5-4c23-b79d-e4f60c44fc8a",
    "title": "Qantas cyberhack worse than 1.1 million customers were first told",
    "publish_date": "Fri, 11 Jul 2025 11:19:40 +0000",
    "category": "finance",
    "authors": [
      "Jul"
    ],
    "text": "Exclusive: More than a million Qantas customers had more of their data stolen in last week's massive cyberattack than they were first told.\n\nSince Wednesday, the airline has been emailing the roughly 5.7 million affected people to tell them exactly what ﻿information of theirs had been compromised in the hack on a call centre.\n\nHowever, today, 1.1 million of those ﻿customers received a second email from the airline, informing them more data had been stolen than first thought.\n\nQantas has told some custers they had more data stolen in last week's cyberattack than they were first told. (Wolter Peeters/SMH)\n\nIn the vast majority of these cases, customers' phone numbers have been stolen, on top of the other information they had been informed of earlier in the week.\n\n\"We will this evening have completed emailing all of the customers impacted in the cyber incident that had an email address in the system,\" a Qantas spokesperson told 9news.com.au.\n\n\"As part of our ongoing analysis of the data, we've identified some customers who we had already emailed in recent days who also had data in the 'business phone' field.\n\n\"We are emailing customers this afternoon to advise them.\"\n\nQantas had previously said about 900,000 people and businesses had their phone number stolen in the hack.\n\n\"We are writing to provide you with an update following our previous email about the cyber incident on Monday, 30 June 2025,\" the new emails seen by 9news.com.au read.\n\n\"Our ongoing investigation has identified that your phone number details were accessed in addition to the data types we previously advised.\n\nREAD MORE: The tricky rules elderly drivers have to comply with ﻿\n\nAn excerpt of the email sent to some Qantas customers. (Nine)\n\n\"We recommend you remain vigilant for any unexpected contact by phone, in addition to the email and text message precautions we outlined in our previous communication.\"\n\nQantas confirmed on Wednesday that email addresses, phone numbers, addresses, dates of birth, genders and even meal preferences in some cases had been stolen, as well as frequent flyer numbers, points balances, tiers﻿ and status credits.\n\nHowever, it has stressed no login details﻿, credit card numbers, payment details or passport numbers have been compromised.\n\nThe airline says it was contacted by a suspected cybercriminal over ﻿the incident on Monday .",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/temporary-skills-shortage-visa-changes-could-see-caitlin-deported/703e3977-d0d2-4b61-8a95-3f0653832c62",
    "title": "Caitlin is facing deportation over two weeks of missed work",
    "publish_date": "Sat, 12 Jul 2025 00:03:34 +0000",
    "category": "finance",
    "authors": [
      "Jul"
    ],
    "text": "Exclusive: Scottish expat Caitlin Fraser wanted to spend the rest of her life in Australia.\n\nNow she's facing deportation over two weeks of missed work that could make her ineligible for permanent residency.\n\n\"I'm not sleeping at the moment out of fear, I don't know what's going to happen,\" she told 9news.com.au.\n\nREAD MORE: The faces of the Texas flood tragedy\n\nCaitlin Fraser moved to Australia in 2019 and fell in love with this sunburnt country. (GoFundMe)\n\n\"I've been here for six years, all my family are here, and I have a house and a dog.﻿ I have nowhere to go.\"\n\n﻿The 31-year-old moved to Australia in 2019 on a Working Holiday Maker (WHM) visa, then applied for a ﻿﻿Temporary Skills Shortage (TSS) visa in 2023.\n\nIt ﻿would allow her to live and work in Australia for up to two years, after which time she'd apply for a Temporary Residence Transition (TRT) Visa to become a permanent resident.\n\nA migration agent told her it was ﻿a \"clear pathway\" to permanent residency\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nTSS visas are employer sponsored, so Fraser found a small business in Sydney that agreed to sponsor her as a restaurant manager.\n\nAt the time, it was an eligible occupation for that visa.\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\nWith the business sponsoring her and the help of a professional migration lawyer, Fraser applied for and was granted a TSS visa in September 2023.\n\nShe moved from Ballarat to Sydney and started work two weeks later.\n\n﻿To be eligible for a TRT visa and permanent residency, Fraser would have to work ﻿for the same employer for two full years.\n\nShe knew her existing TSS visa would expire two weeks shy of that milestone but there was no ﻿limit on how many times she could apply for a TSS visa while in Australia, so Fraser simply planned to apply for a second TSS visa to cover the extra time.\n\nThat plan went up in flames this year.\n\nCaitlin Fraser will miss out on meeting the full time employment requirements to apply for permanent residency by two weeks. (Supplied)\n\nIn May, Fraser received a devastating call from her migration agent.﻿\n\nThey explained that changes to Australia's visas ﻿meant Fraser was no longer allowed to renew her visa, nor would she be eligible to apply for a TRT visa by the time it expired.\n\nSuddenly, she was facing the very real possibility of deportation.﻿\n\nIn December 2024, the TSS visa was replaced by the Skills in Demand (SID) visa.\n\nPeople who had already been granted TSS visas would be allowed to stay in Australia until the visa's expiry date but they would not be allowed to renew.\n\nSome could apply for SID visas – but not Fraser, as restaurant manager is not on the list of eligible occupations.\n\n“Whilst the occupation of Café or Restaurant Manager was previously available for nomination for a Temporary Skills Shortage (TSS) visa, the occupation has not been included on the Core Skills Occupation List (CSOL) and is therefore ineligible for nomination for a SID visa,” a Department of Home Affairs spokesperson told 9news.\n\nIt means she will have to leave the country when her current visa expires, just two weeks shy of completing the two years of fulltime work required to apply for a TRT visa.\n\nOf the employment requirements for a TRT visa, the Department spokesperson said “applicants are required to demonstrate they have worked in eligible sponsored employment for at least two out of the last three years while holding a 457 [Temporary Work (Skilled) visa] or 482 [formerly TSS, now SID] visa”.\n\nFraser is frustrated that changes made to the TSS visa long after she was approved have now made her ineligible for permanent residency.\n\n\"The injustice is insane,\" she said.\n\n\"This should be for new people applying, not for someone who's at the end of the visa. This isn't what I paid for.\"\n\nScottish expat Caitlin Fraser has already spent tens of thousands of dollars on visas to live and work in Australia. (Supplied)\n\nFraser paid $14,000 to secure her existing visa﻿ with the help of an immigration lawyer.\n\nShe's now working with them in the hopes of finding a solution that will allow her to legally work ﻿in Australia for the extra two weeks she need to be eligible for a TRT visa.\n\nIf and when she is able to apply for that visa, she will be granted a bridging visa that will cover her ﻿while it is processed.\n\nBut Fraser fears she won't make it that far.\n\n﻿Even if she finds a way to legally work the extra two weeks, she may not be able to afford to apply for permanent residency.\n\nApplying for a TRT visa costs upwards of $4900 and Fraser has been quoted $9000 in additional fees from her immigration lawyer.\n\nShe's still paying off the $14,000 from her TSS visa and had hoped that renewing it would give her more time to save money for the TRT application.﻿\n\n\"I live week to week, I'm on the minimum that they can give me, and I live in Sydney which is the most expensive city in the world,\" she said.\n\nThe suburbs Australia's richest people call home View Gallery\n\nApplying without the assistance of an immigration lawyer to save money isn't an option either.\n\n\"It's impossible for me alone to do the application in eight weeks. It's a massive process, even the migration officers are going to find it hard to do it in that time,\" Fraser said.\n\nFraser's family have started an online crowdfunding campaign ﻿to help cover the costs.\n\nIf she's unable to secure or pay for a new visa before her TSS visa expires, she'll be forced to leave Australia on September 14.\n\nWith no savings and no family back in Scotland, Fraser doesn't know where she'll go if that comes to pass.\n\nShe fears she won't be the only one forced out of the country due to changes to the old TSS visa.﻿",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/brisbane-house-median-price-over-1-million-dollars-for-first-time-on-record/10d62907-2b48-4a78-8681-3f661f9b17a6",
    "title": "Second Australian city becomes million-dollar housing market",
    "publish_date": "Fri, 11 Jul 2025 02:08:43 +0000",
    "category": "finance",
    "authors": [
      "Jul"
    ],
    "text": "Brisbane has become Australia's latest million-dollar property market, as median house prices surged into seven figures for the first time.\n\nAccording to analysis from Cotality, median house prices in the Queensland capital reached $1,006,000 in May, up from $996,000 in April, and from $942,000 in May 2024.\n\nThe price increase continued in June, lifting to $1,011,000.\n\nREAD MORE: The faces of the Texas flood tragedy\n\nSkyline shot of Brisbane city during the sunset (Getty)\n\nIt's the first time on record median house prices in Brisbane have topped $1 million, putting it next to Sydney for average property values.\n\n﻿Brisbane has been the house market with the second highest-prices in Australia - behind only Sydney - for nine months as of June, overtaking Canberra in October last year and Melbourne in June last year.\n\nHowever, there remains considerable daylight between Brisbane prices and Sydney prices.\n\nCotality found the gap between Sydney's median home values and Brisbane's was aat $549,000, down a little from its peak of $567,000 last October.\n\nMeanwhile, Brisbane's median is $63,000 above Melbourne's and $30,000 higher than Canberra's.﻿\n\nCotality said Brisbane house values had risen steeply since the early stages of the COVID-19 pandemic, surging 76.1 per cent from June 2020 to June 2025.\n\nThe surprising housing markets tipped for growth this year View Gallery\n\nTheir research found that much of the price increase had been driven by interstate migration, which had its foundations in cost of living and lifestyle motivations.\n\n﻿Brisbane's population grew 9.2 per cent - or by 235,000 people - between June 2020 and June 2024, Cotality said, compared to six per cent growth nationally in the same period.\n\nHowever, the booming house prices that mark Brisbane's success in attracting new residents could also see that very trend reversed.\n\nCotality also found house price growth was slowing if still solid, rising 1.9 per cent in the latest quarter, compared to 3.5 per cent in the June 2024 quarter and a high of 10.2 per cent in the three months to November 2021.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/long-term-impact-of-north-queensland-floods/105501350",
    "title": "Sugarcane farmers still reeling from devastating Queensland flood",
    "publish_date": "Sat, 12 Jul 2025 01:50:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "In the early hours of February 3, it was hard to get back to sleep in Ingham.\n\nAs floodwaters surged, the wind drove rain hard against the windows, keeping residents awake and uneasy through the night.\n\nMonths later, the impact and devastation of that week are still felt across the community and wider farming regions.\n\nFrom counting crop losses and calculating the financial cost of restoring land, to managing their mental health, the difficult times for cane growers are only just beginning.\n\nIngham endured an unprecedented flooding event in early 2025. (ABC News: Sophie Johnson)\n\nThe once-in-a-century flood left the area completely inundated and cut off from the outside world.\n\nFacing down the flood\n\nCane grower Ian Kemp has lived and worked on his Ingham farm, about halfway between Cairns and Townsville, for more than 60 years.\n\nWhile Ingham is no stranger to floods and residents generally know what to expect, he said this year was anything but ordinary.\n\n\"We've had some bad floods through my lifetime, but this one in my area out here was by far the worst,\" he said.\n\n\"I personally have about, I'd say 2,000 tonne I've lost.\n\n\"It's going to take me about three to four years to recover ... to pick those paddocks up and get them back to full production again.\"\n\nJohn Board says the impact on his farm is \"massive\". (ABC Rural: Sophie Johnson)\n\nAt John Board's cane farm it was a similar story.\n\nLooking down the barrel of an expensive clean-up, his battle with debris, washout and damage to the cane is ongoing.\n\n\"The actual damage to the crop itself, and then infrastructure damage as well, has been massive,\" he said.\n\n\"There's no way I could cut cane on this headland here yet.\"\n\nThere is significant damage at John Board's farm. (ABC Rural: Sophie Johnson)\n\nCounting the cost\n\nThe Queensland government is providing disaster recovery assistance to affected primary producers.\n\nWhile grateful for the assistance, Mr Board said the system had some challenges.\n\n\"The way it works is, you've actually got to fork it out up front and then claim it back,\" he said.\n\n\"This one headland alone here is probably $34,000 worth of just material and I don't have $34,000 in my bank account.\n\n\"I've actually got to cut cane on a different part of the property to get some cash coming in to fix this headland.\"\n\nJohn Board inspects the damage to his cane paddocks and headland. (ABC Rural: Sophie Johnson)\n\nAcross the district, the crop yield will be down substantially, which means less income for farmers and harvesters like Brian Mombelli.\n\n\"We should be cutting about 120,000 tonnes and this year we might only cut 80,000,\" he said.\n\nFor him, that shortfall is worth $450,000.\n\n\"It's cost us about $350,000 just to put machinery back on the paddock,\" he said.\n\n\"We're already out of pocket and after such big floods, it's just another hit to the small business owners really.\"\n\nBrian Mombelli is a sugarcane harvester based in Ingham. (ABC Rural: Sophie Johnson)\n\nWhile the water is gone, he says danger still lurks in the paddocks, and harvesters will need to take extra care this year.\n\n\"We could come across trees, rims, tyres, gas bottles, one tonne pods to pretty much everything, even shipping containers,\" he said.\n\n\"The biggest cost that is going to affect us as business owners is trying to find the money to fix everything up.\"\n\nSugarcane yields in Ingham have dropped as a result of the floods. (ABC Rural: Brooke Tindall)\n\nMr Kemp said farmers were not the only people bearing a mental load.\n\n\"I know of a couple of people that as soon as they hear a heavy shower of rain now, they start to panic,\" he said.\n\n\"People in town are struggling.\"\n\nTully still recovering from last year\n\nAbout 100 kilometres north of Ingham is Tully, Australia's wettest town.\n\nParts of the town also experienced flooding early this year and, while not as severe as in Ingham, successive disasters have taken their toll.\n\nLast year, Tully was smashed with rain from Tropical Cyclone Jasper and the community is feeling the compounding effects of back-to-back extreme wet seasons.\n\nWalls of water wiped out cane crops on the farm Roy Butcher manages. (ABC Rural: Brooke Tindall)\n\nRoy Butcher is manager of a Tully farm that lost about 30 hectares of cane to the flood, after 50 hectares were wiped out the year before.\n\n\"Here, our major contributor factor … this year was from a levy bank collapsing up the river,\" he said.\n\n\"It brought a wall of water through the farm.\n\nRoy Butcher walks through devastated cane paddock washed away during the floods. (ABC Rural: Brooke Tindall)\n\n\" There's probably two-to-three hectares in our farm and we will never be able to recover and never be able to farm on it again. \"\n\nMr Butcher said he was still finding trash in the cane fields from last season, which had mixed with mud from this year.\n\nCrushing on\n\nAt the sugar mill in town, the crush is underway.\n\nGreg Shannon and Ian Speziali work at the Tully Sugar mill. (ABC Rural: Brooke Tindall)\n\nTully Sugar sane productivity and development manager Greg Shannon said this season was better than the previous, but not by much.\n\nHe expected farmers would produce three-to-four tonnes per hectare more than last year.\n\n\"We got flooded, but not quite as bad and we've had a bit more sunlight, so it's an improvement on last year,\" he said.\n\nThe sugar cane crush is underway across north and Far North Queensland. (ABC Rural: Brooke Tindall)\n\nIan Speziali, the electrical engineering manager at Tully Sugar, said water did come through the mill.\n\n\"Being Tully, flooding isn't unusual but, like any site, we are impacted mainly by water inundation of pumps and motors,\" he said.\n\n\"External to the factory itself, there's been damage to the rail infrastructure and those sorts of things, and obviously the farm properties in the district as well.\"\n\nOverall, he said spirits were high this year in Tully, as the 100th sugar crush for the mill is underway.",
    "source": "ABC",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/mitchell-starc-100th-test-west-indies-australia/105518134",
    "title": "On the eve of his 100th Test, Mitchell Starc has fought his way to immortality",
    "publish_date": "Sat, 12 Jul 2025 01:31:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "On Sunday morning Australian time, Mitchell Starc will become just the second fast bowler to feature in 100 Test matches for Australia.\n\nIt's a remarkable feat, especially considering his suitability to Test cricket was a topic of debate for long swathes of his early career.\n\nAlways a world beater with the white ball, he was often labelled too expensive, too wayward and too soft to be consistently effective with the red.\n\nBut as his career has progressed, those critiques have grown fewer and further between.\n\nAnd on the eve of his milestone match — fittingly under lights against the West Indies in Jamaica — he can look back on a career defined by longevity, fight and propelled into greatness by the instalment of day/night Test cricket.\n\nStarc made his Test debut in 2011 against New Zealand. (Getty Images: Robert Cianflone)\n\nStarc has always been an easy scapegoat.\n\nHis brand of adventurous, stump searching strike bowling is high stakes stuff — exhilarating when it comes off, but ugly and impossible to miss when it doesn't.\n\nOften, when things have gone wrong for Australia, Starc has taken the blame.\n\nIn England, particularly, his exploits have been put under the microscope.\n\nSpells of expensive bowling in Australia's 2013 and 2015 Ashes defeats led to selectors determining him unsuited to English conditions and choosing him for just one game in the 2019 series against the Old Enemy.\n\nBut in 2023, he was the leading wicket-taker and a key figure in Australia's retention of the urn on enemy soil.\n\nIn a series not short on talking points, Starc's English redemption flew under the radar, but it was a key marker in his quiet solidification as a Test match great.\n\nStarc was Australia's leading wicket taker in the 2023 Ashes. (Getty Images: Ryan Pierse)\n\nHis temperament, too, was often called into question during his early years.\n\nA young Starc was shy, understated and certainly not what the Australian public had come to expect of its strike bowlers.\n\nDespite sharing a first name and job description, he was a different person entirely to his notoriously fierce predecessor Mitchell Johnson, who himself didn't always know what to make of his more mild-mannered namesake.\n\n\"I just don't like his body language,\" Johnson said on commentary for the ABC during Australia's 2018 loss to India in Adelaide.\n\n\"He hasn't given a bit of a glare or puffed his chest out with a good follow-through, let the batsman know he's in the contest, that he's going to rip the pegs out.\"\n\nStarc and Johnson played Test cricket together for Australian from 2011-2015. (Getty Images: Cameron Spencer)\n\nShane Warne, too, was often critical of Starc. He was regularly exasperated by Starc's lack of on field verve and helped to cultivate his reputation as a lower-order destroyer.\n\nThat's a label that has clung tight to Starc, but it is at the top of an innings, rather than at its end, that he has shone particularly bright.\n\nHis series opening dismissal of Rory Burns, bowled after leaving his leg stump inexplicably unguarded, proved to be the enduring image of a 2021/22 Ashes which Australia dominated and is one of three times that Starc has taken a wicket with the opening ball of a Test.\n\nWhile his overall record mightn't be as impressive as the metronomic Josh Hazlewood or the generational Pat Cummins, Starc's ability to conjure those tone-setting moments is unmatched.\n\nOften forgotten is Starc's stellar record in Sri Lanka, a country notoriously difficult for fast bowlers.\n\nOn a spitting Gaulle graveyard that saw Australia succumb to a 229-run loss in 2016, Starc took 11 wickets.\n\nOnly a matter of days later, in Colombo — also a world away from a floodlit Australian wicket — Starc would take seven in another losing cause.\n\n35 Sri Lankan wickets at an average of 16 are hardly the numbers of a soft, flat track bully.\n\nHowever, for Starc, nothing has been as career defining as the introduction of day/night Test cricket.\n\nIn the almost 10 years since the very first Test match played under lights, Starc has become the undisputed king of the pink ball, taking 74 wickets at an average of 18. That's compared to his overall Test match record of 395 wickets at 27.39.\n\nNo other bowler has even come close to his level of magenta mastery, with colleagues Nathan Lyon, Josh Hazlewood and Pat Cummins his nearest rivals, taking 43, 37 and 35 wickets in the format respectively.\n\nAgain and again, Starc has delivered under lights.\n\nHe picked up match figures of 9/97 against New Zealand in 2019 and has taken a remarkable four five wicket hauls with the pink ball, but his best performance — and best Test match figures overall — came against India in December last year.\n\nWith his team well beaten in the first Test, Starc began the second after Indian batting prodigy Yashavi Jaiswal had accused him of bowling too slowly.\n\nIt was a brave move by the precociously talented opener, and one that backfired horribly. Starc caught him plumb in front with another game opening delivery on his way to a first innings return of 6/48.\n\nIt's hard to say what makes Starc such a different beast with the pink ball, and he's not quite sure himself.\n\n\"Nothing changes too much,\" Starc said in December 2024.\n\n\"I'm still running in trying to attack the stumps, trying to swing it.\n\n\"Some days it works. Sometimes it doesn't. I don't know (the reason why). I can't tell you.\"\n\nHe's far from a one dimensional, floodlight dependent player, but it's his mastery of the pink ball that has well and truly catapulted Starc into the pantheon of fast bowling greats.\n\nAnd there's something special about the scheduling gods conspiring to put it in his hand for this week's milestone Test.\n\nABC Sport will blog every ball of Australia's third Test against the West Indies in Jamaica, starting at 4:30am AEST on Sunday, July 13.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/rural/2025-07-12/nasaa-administration-australian-organic-certification-collapse/105520134",
    "title": "Aussie producers scrambling as major organic certifier collapses",
    "publish_date": "Sat, 12 Jul 2025 00:32:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Hundreds of farmers and food producers across Australia are scrambling to keep their organic standard certification after the collapse of a major organic certifier.\n\nSouth Australian-based NASAA Certified Organic Pty Ltd (NCO) was placed into voluntary administration last week.\n\nProducts certified by NCO met federal government standards for exporting legitimate organic products, but producers have been told that certification is no longer valid.\n\nThose affected have until September 26 to find a new certifier before their certification expires, or face not being able to export organic products.\n\nJackie Brian is the CEO of Australian Organic Limited. (ABC News: Billy Cooper)\n\nJackie Brian, chief executive of peak industry body Australian Organic Limited, said the organisation had been working closely with the government to try to make the transition as seamless as possible.\n\n\"There is no additional charge going to be imposed on operators in order to have those certificates reissued,\" she said.\n\n\"NASAA-certified operators will be able to continue to use their existing packaging for 12 months to allow them to have a transition plan.\"\n\nBusinesses caught off guard\n\nWhile industry leaders work to minimise disruption, individual businesses are grappling with the practical challenges of the sudden collapse.\n\nNCO provided certification services to hundreds of businesses across all Australian states, including meat, seafood, baby food and fruit producers as well as wineries, and major dairy companies.\n\nThat included well-known brands such as Bertocchi Smallgoods, Costa Farms, Fonterra Australia, the Tasmanian Oyster Company, Bellamy's Organic, and SunRice.\n\nSA-based organic compost producer Mulbarton is one of the hundreds of businesses now forced to find a new certifier.\n\nRebecca Weller from Mulbarton said the collapse of the businesses was a complete surprise.\n\n\"It was actually very sudden,\" she said.\n\nWhile payment will not be required to be recertified, Ms Weller said it would still cost the business in time.\n\nRebecca Weller says there is a lot of paperwork to get businesses recertified. (Supplied: Rebecca Weller)\n\n\"We will be going through a range of paperwork and time-consuming reports,\" Ms Weller said.\n\n\"Every business would understand when you get audited it's very costly financially with all the time making sure you make the standards.\"\n\nMs Weller said there would also be other expenses from the changeover.\n\nMulbarton Compost has recently added its organic certification to its transport trucks. (Supplied: Mulbarton Compost)\n\n\"Some [certified businesses] have major packaging for a couple of years ready,\" she said.\n\n\" We have trucks that we've just printed our organic certification on because we're also a transport business, so there's a major implication. \"\n\nThe Department of Agriculture, Fisheries and Forestry has notified organic operators and exporters that NASSA certifications are \"no longer valid\".\n\nIn advice to operators, the department said it was working with other certifying bodies to support operators and ensure a transition with minimal disruption.\n\nInfant formula is among the many organically certified products caught up by the sudden closure of NASAA. (ABC Rural: Selina Green)\n\nCalls for national regulation\n\nAustralian organic products must have national standard certification before they can be exported.\n\nCalls continue to change organic labelling rules in Australia Photo shows A caucasian man with olive skin and black hair walks through dense greenery with a subtle smile towards the camera Organic certification is not legally required for a product to be described as organic, but a business making organic claims must be able to prove them. Some producers say a national standard would give consumers full transparency.\n\nAccording to the ACCC, organic products intended for the Australian market do not need to meet a particular standard or be certified to be labelled organic.\n\nHowever, it says businesses that make an organic claim must be able to prove it.\n\nJackie Brian said Australia needed an internal national accreditation.\n\n\"We are the only OECD country that doesn't have regulation around the use of the term 'organic' domestically,\" she said.\n\n\"In every other OECD country, you can only claim a product is organic if it's certified organic. We're lobbying to have that be the case in Australia as well.\"",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/grace-kim-evian-championship-second-round/105524604",
    "title": "Aussie Kim avoids French course's 'sting' to sit second at golf major",
    "publish_date": "Sat, 12 Jul 2025 00:13:49 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian Grace Kim has fashioned another back-nine surge to remain right in the mix in second place halfway through the Evian Championship, while Minjee Lee's hopes of another major title have taken a hit.\n\nKim rolled in three birdies in her last eight holes in a 3-under-par 68 to briefly claim the clubhouse lead at women's golf's fourth major of the year in France.\n\nAnd after holding a share of the first-round lead, the 24-year-old Sydney star ended Friday just one shot behind South Korean pacesetter So-mi Lee, who posted a second-straight 66 to soar to 10-under.\n\n\"We were first off at seven so it was an early start, but I wanted to make sure I took advantage of that tee time. It's nice to be done before midday,\" Kim said of her morning charge.\n\n\"I just knew how much this course can really sting you, so I just played fairways and greens. Had a few putts more than yesterday but just kept it simple and it kind of worked out today.\"\n\nJust two weeks after snaring a third career major at the Women's PGA Championship in Texas, Perth's Lee had been expecting to kick on after her brilliant opening 66.\n\nBut a woeful start with bogeys at the first three holes and a double bogey at the sixth meant she had to play catch-up.\n\nShe did so pretty spectacularly, recording six birdies over her last dozen holes, but she could still only end with an even-par 71 that dropped her down among the chasing pack.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\nLee is now five shots behind her namesake in a tie for 12th, alongside world number one Nelly Korda (70) and four others, including top-ranked English amateur Lottie Woad (69).\n\nAustralian Gabi Ruffels, one of the five first-round joint leaders at 6-under, could not make any progress as she shot a 71 to remain at 6-under, now four off the pace.\n\nLeader Lee nabbed six birdies and an eagle in a superb second round to set a cracking pace at the postcard perfect golf club nestled between Lake Geneva and the Alps.\n\nShe is coming off her first LPGA Tour win at the Dow Championship team event last month with Jin-hee Im, and is in a confident mood.\n\n\"I think, first, this course is so beautiful but, you know, the green is so tricky, so I'm just practising distance,\" Lee said.\n\n\"I'm just focused on distance. Miss left, miss right, never mind. Just distance.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/why-fletcher-and-jojo-siwa-are-causing-controversy/105472184",
    "title": "Why Fletcher and JoJo Siwa are causing controversy in the queer community",
    "publish_date": "Sat, 12 Jul 2025 00:02:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "While Pride month is over for another year, queer music lovers are still talking about two of the community's most divisive stars.\n\nUS singers Cari Fletcher and JoJo Siwa are known for their queer pop anthems and have a passionate lesbian fanbase.\n\nLGBTQIA+ community support services Photo shows Hand with rainbow light reflecting on it for list of queer and LGBTIQ support numbers and websites in Australia We've compiled this list of national and state-based support services relevant to LGBTQIA+ people, their families and friends.\n\nBoth singers have identified as lesbian or queer, so their recent announcements that they are dating men have shocked and upset certain fans.\n\nIt has sparked a broader conversation about the erasure of bisexual and pansexual identities and the pressure placed on celebrities to live up to fan expectations.\n\nAnd if you're thinking \"who the heck are Fletcher and Siwa and why do people care?\", let us fill you in.\n\nWho are JoJo Siwa and Cari Fletcher?\n\nJoJo Siwa rose to fame on the hit TV show Dance Moms in 2014 for her extroverted personality.\n\nShe began releasing music in 2016 aimed at children, before branching out to pop music for an older audience.\n\nSiwa came out in 2021 by posting a photo of herself in a T-shirt that said \"Best Gay Cousin Ever.\"\n\nJoJo Siwa once claimed she \"invented gay pop\". (AP: Jordan Strauss)\n\nThe 22-year-old has more than 11 million Instagram followers and more than 500,000 monthly Spotify listeners.\n\nIn 2024, she proudly (and erroneously) declared that she \"invented gay pop\".\n\nShe later conceded that while she didn't invent the genre, she would love to be its \"chief marketing officer.\"\n\nJoJo Siwa admits she didn't invent gay pop Photo shows JoJo Siwa poses wearing a black and silver outfit and with black paint decorating parts of her face. JoJo Siwa's bid to rebrand herself from a child star has seen her compared to Miley Cyrus. This is why.\n\nCari Fletcher, better known by her stage name Fletcher, became a queer icon after the release of her song Becky's So Hot in 2022.\n\nFletcher also came out in 2021, after getting fans to ask her questions on her Instagram story.\n\nOne fan asked if she was lesbian or bisexual.\n\n\"I get this question so much. I just exist. If someone needed to put me in some sort of category, for themselves to better understand, I would say I identify as queer,\" Fletcher posted on her story in response to the question.\n\nThe 31-year-old has more than one million Instagram followers and more than two million monthly Spotify listeners.\n\nWhy are they causing controversy?\n\nThings started to blow up for Siwa earlier this year while she was a contestant on UK Celebrity Big Brother, a television show in which celebrities must live in a house together, completing tasks all while being cut off from the outside world.\n\nPeople started to ask questions as she became very close with her fellow co-star Chris Hughes, despite still being in a relationship with Australian content creator Kath Ebbs.\n\nOn the show she said she didn't feel she identified with being a lesbian anymore.\n\nLoading Instagram content\n\n\"I have always been afraid of feeling queer, like I have always said lesbian right, but I feel so queer,\" she said whilst on Celebrity Big Brother UK.\n\n\"I am switching letters: f*** the L, I am going to the Q.\"\n\nQueer is an umbrella term for people who are not heterosexual or cisgender. It encompasses a range of sexualities and gender identities and is often used by people who feel they don't fit neatly into a box.\n\nShortly after the show had ended, Siwa broke up with Ebbs (who very publicly called her out on it) and announced she was dating her male Big Brother co-star.\n\nShe doubled down on her comments inside the house, saying in an interview with YOU magazine that she felt \"pressured\" into labelling herself a lesbian.\n\n\"And I think I did that because of pressure,\" Siwa said, adding that a lot of it came from \"inside the [LGBTQIA+] community at times.\"\n\nDr Damien O'Meara is a lecturer at RMIT University in Melbourne. (Supplied: Dr Damien O'Meara)\n\n\"From people I know, from partners I've had,\" she added.\n\nRMIT University's senior public relations lecturer Dr Damien O'Meara said: \"We have plenty of bi and pan people who don't feel welcome in our community.\"\n\nHe believes Fletcher and Siwa are offering a good opportunity to start a conversation and \"challenge the erasure that's taking place\".\n\nFletcher accused of erasing her queer identity\n\nAround the same time, Fletcher released her single Boy, signalling to fans she was in a relationship with a man.\n\nBut her decision to archive all her previous social media posts about her music on same-sex relationships led to fans accusing her of erasing her queer identity.\n\n\"When you've made your entire brand of wlw (women loving women) music and art, only to turn around and talk about how 'magical and liberating' it is to be with a man, it just feels like it was all a phase for you,\" one social media user said.\n\nDr Natalie Krikowa, a senior lecturer at the School of Communications at the University of Technology in Sydney and a member of the LGBTQIA+ community, said both artists were entitled to talk about their relationships but there should be an additional level of \"care, empathy and respect\" given to fans who have come to expect something different.\n\nNatalie Krikow says it is important for people to be able to have conversations about their relationships without it escalating into biphobia. (Supplied: Dr Natalie Krikowa)\n\n\"I think it is important that these conversations are had without it escalating into biphobia and bi erasure, because there is a fine line that we should not be crossing.\"\n\nFletcher talked about the backlash she received in a TikTok video and has now unarchived all her posts.\n\nLoading TikTok content\n\n\"My queerness is not a phase, I have always identified as a queer woman,\" she said in the video.\n\nDr O'Meara pointed out that the 31-year-old's brand is through her music which is \"very personal\".\n\nCari Fletcher's latest song Boy has caused a commotion within the queer community.\n\n\"It explores her feelings and what she's going through, and a lot of her music has always said, 'well, this is what I'm dealing with right now.' And so, if we think of that as Fletcher's brand, what we have is her using her music to explore this,\" Dr O'Meara said.\n\nBiphobia and bi erasure\n\nBi erasure and biphobia are terms for the questioning or dismissal of bisexuality.\n\nBut Dr O'Meara said Siwa and Fletcher had actually opened up an important conversation about bisexuality.\n\n\" We commonly think of queer identities as this very lit pathway and for many, many people it's not. \"\n\nAuthor and editor of Nonsense Newsletter Patrick Lenton, who is bisexual, agrees.\n\nPatrick Lenton says online there is \"gatekeeping over who is valid in their queerness and who is allowed to be queer.\" (Supplied: Jesse Graham)\n\n\"Invalidating that relationship and being angry about it stems from believing that bisexuality or queerness as a sort of broader thing isn't as valid as something say like lesbianism,\" he said.\n\nHe added that Siwa, as a 22-year-old, is discovering what her sexuality is \"in a very public platform, in real time.\"\n\n\"In that particular case, I would've hated for anyone to be viewing and commenting on my sexuality journey when I was that young, because it was a mess.\"\n\nBisexual representation on screen Photo shows Mike Faist, Zendaya and Josh O'Connor in Challengers We take a look at how the \"disaster bi\" stereotype is still ubiquitous in TV and film. But some projects are working to change that.\n\nMr Lenton said there is a lot of online gatekeeping \" over who is valid in their queerness and who is allowed to be queer,\" pointing to bisexual actor Kit Connor (from Netflix's Heartstopper).\n\n\"He was basically bullied into coming out before he was ready, because people were saying 'oh he's not queer enough to play a queer role' and it's really weird and backwards idea of looking at things.\"\n\nParasocial relationships between celebrities and fans\n\nSarah Scales, a PhD candidate at Swinburne University who is researching parasocial relationships and celebrity scandal, said part of the problem here is the \"parasocial interaction\" many people have with celebrities, which is a one-sided relationship that is usually between a fan and a celebrity that has no mutual development.\n\nSarah Scales is a PhD candidate for Swinburne University of Technology in Melbourne. (Supplied: Sarah Scales)\n\nShe said people can feel upset, disappointed and betrayed if they feel their trust has been broken with someone they look up to, or someone they see within themselves.\n\n\" Celebrities are unaware of the individual expectations we place on them; therefore, it can be hard for them to know they're breaking trust. \"\n\nShe said JoJo Siwa's fans may have reacted more favourably if she addressed her relationship breakdown with Kath Ebbs earlier and was more open about her attraction to Hughes.\n\n\"If they heard it from her first in a more active way, it might have been different.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/gemfields-celebrate-queer-community/105520272",
    "title": "Gemfields queer community sparkles for bush Mardi Gras",
    "publish_date": "Fri, 11 Jul 2025 23:54:56 +0000",
    "category": "sports",
    "authors": [],
    "text": "En route to the Queensland outback, the Gemfields region is known for its sparkle.\n\nOne of the biggest sapphire-bearing areas in the world, it's a popular stop for tourists hoping to find their fortune.\n\nBut the long dirt roads also lead to something more unlikely in the bush: a thriving queer community, headed up by a particularly bright gem, Willow.\n\n\"We have visitors who rock up and they think they're coming out to fossick for gems in the middle of nowhere, and it's pretty rough and rugged country,\" Willow says.\n\nThe Gemfields is one of the largest sapphire bearing areas in the world. (ABC Capricornia: Erin Semmler)\n\n\" But then they see this Mardi Gras or drag blingo with these crazy colours … something like out of Priscilla, Queen of the Desert. \"\n\nWillow moved back to the community a decade ago to care for family, and decided to reveal a new part of himself to his parents and his home town a few years before that.\n\n\"I said, 'Mum, I need to tell you something,' and so I came out to her, and she was great,\" he says.\n\n\"My dad grew to understand and just support and love me for who I was.\"\n\nThe town of Rubyvale, with just a little over 1,000 residents, embraces all.\n\nHeaded by Willow, there is a thriving and supportive queer community, which hosts an annual Mardi Gras in September or October and regular drag blingo nights, where all are welcome.\n\nWillow moved back to the Gemfields just over a decade ago. (ABC Capricornia: Megan Hughes)\n\n\"It started as a party that I held for my 50th birthday. I couldn't go away, so that was the next best option,\" Willow says.\n\nIt's now an annual event that attracts visitors from all over central Queensland.\n\n\"I've been able to help facilitate a space where queer people can come and visit or come and live,\" he says.\n\nThe Mardi Gras parade moves through town. (Supplied: Willow)\n\nWillow says visitors have embraced the culture and more queer people have moved to the area in recent years.\n\n\"You can't be it if you can't see it, and I know by doing what I do, it's made a difference, and I just love that's been the outcome,\" he says.\n\nA visit that turned into five years\n\nCaleb Christensen is from the United States and first came to the Gemfields to visit friends.\n\n\"I came over and two days later, the Australian border was shut with the COVID pandemic, so six months turned into two years, which has turned into five years now,\" he says.\n\nCaleb says he has became more comfortable with his sexuality after moving to the Gemfields. (ABC Capricornia: Freya Jetson)\n\nGrowing up in a small town in Minnesota, Caleb says he had initially struggled with his sexuality and felt pressured to downplay his queerness.\n\n\"I didn't want to be too flamboyant or this or that. I wanted to be a palatable kind of queer person for them,\" he says.\n\nOver the years, he grew increasingly more comfortable with his identity and, after moving to the Gemfields, he says he can finally be his true self.\n\n\"I would say it was moving to the Gemfields that made me finally accept in my heart who I was,\" Caleb says.\n\nWhat makes this region special?\n\nWhen asked why he's stayed this long, Caleb says it's because of the community.\n\n\"The people — 100 per cent. The people are just warm and eclectic, it's a very niche lifestyle, but you have people from completely different walks of life,\" he says.\n\n\"When I was told they had drag queen blingo at this pub in rural Queensland, I was completely shocked.\"\n\nCaleb runs a drama club, not exclusively for the queer community, but a supportive space for everyone.\n\nThe theatre group is new, but has drawn in a big group of locals. (Supplied: Caleb Christensen)\n\nWillow acknowledges that while homophobia still exists in the region, those who support him and the community outweigh this.\n\n\"There are people who will try to bring us down and create division and fear, but we simply will not go away,\" he says.\n\n\" If we can build the queer community and make it bigger and stronger and bring more allies on board, then little by little we can just make the world a better place for everyone. \"\n\nCasey Morrison is one of those allies and is a manager at one of the local pubs where drag blingo is hosted.\n\nShe wants to replicate the vibrant environment where she had worked previously.\n\n\"Where I lived in New South Wales, they held similar events and everyone who works here are allies,\" Casey says.\n\nManagers say the Rubyvale Pub is a place where everyone is welcome. (ABC Capricornia: Freya Jetson)\n\n\"We just love people, we love individuals … they can be from anywhere.\n\n\"At the moment, we've got everyone here watching the sport, but it could be that everyone is here for blingo as well.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/afghan-refugees-find-work-opportunity-in-traditional-textiles/105457906",
    "title": "Despite limited opportunities, these women have honed their craft",
    "publish_date": "Fri, 11 Jul 2025 23:36:23 +0000",
    "category": "finance",
    "authors": [],
    "text": "Hakimeh Rahimi has always wanted to be a fashion designer.\n\n\"My mum was always encouraging me … [and] I learnt to make clothes and dresses and things like that,\" she said.\n\nMs Rahimi grew up in Afghanistan, but her family was forced to flee to Iran when the Taliban took over in the 1990s.\n\nStill a child when she fled as a refugee, she was unable to attend high school, limiting her opportunity to pursue the career she longed for in textiles.\n\nDespite this, she continued her craft and brought it with her when she and her husband came as refugees to Australia in 2014.\n\nLanguage a barrier to work\n\nMs Rahimi now lives in Wagga Wagga, in southern New South Wales, and has made curtains and blinds for a local business, but an injury means she can no longer use scissors.\n\nShe still aspires to open a sewing shop, and is hopeful treatment will mean she can work with her hands again.\n\nCreative stitchery was the focus of a recent workshop held as part of a project called Mending People. (ABC Riverina: Andrew Mangelsdorf)\n\nMs Rahimi said the language barrier impacted on the confidence of many Afghan women, while other people with a similar background dismissed their skills as common because sewing was a significant part of their culture.\n\n\"Some people think because in Afghanistan, everybody knows how to do embroidery, it's not that important. So when I ask, 'Can you do embroidery?' They ask, 'Who's going to buy it?'\"\n\nA shared love for stitchery\n\nA new initiative run by the Wagga Wagga City Council hopes to answer that question, while boosting language skills and fostering work opportunities.\n\nThe Mending People project seeks to unite refugees with others in the Wagga community based on a common love for stitchery.\n\nParticipants collaborate to make blanket banners and learn mending and stitching skills from cultures all around the world.\n\nMs Rahimi is hopeful the project will give other refugees the confidence to pursue careers in textiles, because it connects them with the broader community over a shared love.\n\nAfghan refugee Rogayeh Uzbak is teaching others stitchery through the project.\n\nRogayeh Uzbak has a passion for sharing her talents with refugees and members of the community. (ABC Riverina: Andrew Mangelsdorf)\n\nShe also grew up in Iran after her family members fled their homeland.\n\nSpeaking through an interpreter, she said she grew up in a \"misogynistic\" family that would not allow her to pursue her interest in stitching, weaving and knitting.\n\nShe said at the age of 13 she was forcibly married to a 50-year-old man who would not allow her to work, but she was able to hone her skills and sell some of her work.\n\nAfter emigrating to Australia in 2023, Ms Uzbak continued to use her craft and now teaches others through workshops, which makes her \"very excited\".\n\n\"I hope by teaching other members of the group, it makes them excited [too],\" she said.\n\nParticipants at the workshop enjoyed stitching some creative designs. (ABC Riverina: Andrew Mangelsdorf)\n\nSkills go untapped\n\nMigration researcher at the Universities of Melbourne and Wollongong Eliza Crosbie said language was a barrier for refugees looking for work when they arrived in Australia.\n\nEliza Crosbie says language barriers can affect the type of work refugees do. (Supplied)\n\n\"Often not being able to communicate is a barrier, which can see people entering into roles where the language isn't as important,\" she said.\n\n\"We conducted a survey with 600 former refugees and found that primarily a lot of them were working in meatworks and cleaning.\"\n\nDr Crosbie said while some refugees came to Australia with skills, they might not be recognised.\n\n\"They are not often either given the opportunity to demonstrate their skills or given the help to get the certification or transfer their skills,\" she said.\n\nRefugees' skills aren't always recognised, according to Eliza Crosbie. (ABC Riverina: Andrew Mangelsdorf)\n\nSewing success\n\nDr Crosbie said the Paw Po textiles social enterprise at Nhill, in regional Victoria, had been successful in helping refugees transfer their skills.\n\nFounded in 2015, Paw Po began teaching English to Karen refugee women from Myanmar, before moving to sewing.\n\nPaw Po workers Say Paw, Ma Pane and K'nyaw with some of the products made by the business. (Supplied)\n\n\"The women started to express that they wanted to learn skills that would give them further opportunities,\" Paw Po program manager Annette Creek said.\n\nThe business produces a range of practical products ranging from bags to oven mitts, cushions, backpacks and face masks.\n\nMs Creek said they kept connections with the Karen people by sourcing fabrics from Thai refugee camps.\n\n\"Often these women have come straight from refugee camps, and this is a really incredibly valuable way to incorporate them into the community,\" she said.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/dark-sky-trend-offers-boost-for-outback-nt-tourism-operators/105517644",
    "title": "Outback NT tourism operators see bright future in 'dark-sky' trend",
    "publish_date": "Fri, 11 Jul 2025 23:20:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "Curtin Springs Station is the last stop on the dusty road from Alice Springs to Uluru.\n\nThe station is a pioneer of outback tourism in the Northern Territory but visitor numbers during the region's peak tourism season are down.\n\n\"It's been pretty ordinary. We certainly can't say it's been a good season at all,\" said Lyndee Severin, who owns and operates Curtin Springs Station alongside her husband Ashley.\n\n\" We're certainly not matching even last year, and this is year six of really hard times in the tourism industry. \"\n\nAshley and Lyndee Severin hope the dark-sky tourism sector will bring more visitors to their station. (Supplied: Curtin Springs Station)\n\n'Lumpy' tourism season\n\nBeef producers across the Northern Territory offer accommodation and tourist experiences to bolster their businesses when cattle prices are sluggish.\n\nThe region's highways have been packed with campervans and cars during mid-year school holidays.\n\nLitchfield National Park expansion Photo shows A waterfall on a rocky landscape, with green trees growing on all sides of the water. Litchfield National Park is set to grow by 20 per cent, marking the tourist attraction's largest expansion in more than two decades.\n\nBut the NT tourism body says self-catered holidays and hotels are the popular options this season, while the stations and roadhouses stay quiet.\n\nEven with a few extra visitors swinging by the station, Ms Severin said it was not enough to make up for losses across the rest of the year.\n\n\"Two weeks doesn't make a season,\" she said.\n\n\" We are very quiet in comparison to what we could be. \"\n\nNew flights between Alice Springs and Cairns Photo shows An airplane parked inside a hangar. The tourism sector is hopeful for the 2025 season after NT-based carrier Airnorth announced it's launching direct flights between Alice Springs and Cairns.\n\nAs the wet season turned dry in May, the forecast was for a bumper tourism season for the Northern Territory.\n\nTourism Top End general manager Sam Bennett said while some areas of the sector had boomed, regional businesses had struggled.\n\n\"It's actually pretty lumpy,\" she said.\n\n\"Some of the sectors are doing amazingly well, hotels are doing really well.\n\n\"The leisure sector is very slow, and that's traditionally what spends time and money in regions.\"\n\nLate rains block off tourists\n\nSituated 4 kilometres off the Queensland–Northern Territory border, the roadhouse and caravan park at the remote Tobermorey Station has become a key aspect of the business, helping support the property during the dry season.\n\nCamping numbers have dropped off at Tobermorey Station in 2025, with late rains causing road closures. (Supplied: Tobermorey Station)\n\nHowever, manager Chloe Robertson said late rains that swept across the Barkly region and Central Australia in May caused road closures for the station, limiting access for visiting tourists.\n\n\"Usually the season starts here … around Easter, Easter weekend. However, this year, the roads were still closed from our wet season. So, it's been very quiet,\" she said.\n\n\"And we got an inch of rain, which put road closures in again, so it's been very quiet.\"\n\nDark skies bring bright future\n\nAgricultural tourism operators are now looking to the sky to help bring visitors back to the NT's most remote corners.\n\nThere are perfect conditions in outback Australia for capturing the finer detail of the Milky Way. (Supplied: Colin McGregor)\n\nDark-sky tourism is a growing trend in which destinations offer visitors a view of the night sky almost entirely untouched from artificial light, with the stars and Milky Way on full display.\n\nDark-sky tourism is a \"huge, huge market\", according to Ms Bennett.\n\nUtilising the wide, expansive night-time skies seen in the Northern Territory, she said Tourism Top End was working closely with the pastoral industry to create new experiences for tourists, and opportunities for businesses.\n\n\"There are people following stargazing … all over the world, and there's no better place to do that than a cattle [station],\" she said.\n\nCurtin Springs Station's massive outback skies are an asset Ms Severin hopes to tap in to.\n\n\"We're creating a space here at the homestead area for visitors who are staying with us to … find that quiet space to be able to explore that night sky,\" she said.\n\n\"So we're quite excited … about being able to offer that other opportunity for people to really experience the huge skies that we have both in the daylight and the night-time hours.\"\n\nMs Severin said they were looking ahead to the the 2028 total solar eclipse, which would draw thousands of astronomers to Australia.\n\n\"The sky – the night sky particularly – is something that you don't see everywhere,\" she said.\n\n\"And we get to experience it every day.\"",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/jofra-archer-returns-in-england-india-test-cricket-day-two-lords/105522828",
    "title": "Jofra Archer strikes three balls into long-awaited Test return",
    "publish_date": "Fri, 11 Jul 2025 23:19:06 +0000",
    "category": "sports",
    "authors": [],
    "text": "England pace bowler Jofra Archer has made an immediate impact in his first Test match in four and a half years, taking a wicket off his third ball to deliver on his \"X-factor\" billing against India at Lord's.\n\nHis first over was a wicket-maiden and he finished the day with figures of 1-22 off 10 overs, having been used by captain Ben Stokes for two five-over bursts in a sign of what could be to come if he can stay fit for his first Ashes tour in Australia this summer.\n\nIndia finished the day 3-145, trailing England by 242 runs after Joe Root's 104 and half-centuries to Jamie Smith and Brydon Carse led the hosts to 387.\n\nThere was a buzz around a packed crowd at the Home of Cricket when Archer took the ball for the second over of India's innings in the third Test.\n\nOpener Yashasvi Jaiswal had already clattered Chris Woakes for three boundaries in the opening over but he played and missed at Archer's second ball and edged the next one to Harry Brook at second slip.\n\nArcher whirled away to square leg and looked emotional as he was mobbed by his England teammates.\n\n\"The noise, the pure joy, that everyone has seeing him back in whites. Everyone is genuinely excited to see him play for England again in Test cricket,\" England batter Joe Root said.\n\nArcher was bowling as fast as 150 kilometres per hour, a reminder of his worth to England after so many years away because of injuries.\n\nHe exploded onto the international scene in 2019, playing a starring role in England's victory over New Zealand in the 50-over Cricket World Cup final.\n\nWeeks later, he had a famous spell on Test debut in the Ashes at Lord's against Steve Smith, who scored 92 on the day but was left with a concussion that forced him out of the next game after a vicious Archer bouncer.\n\nArcher has been blighted by injuries since, chiefly because of nagging issues with his right elbow for which he has undergone two operations.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nArcher's most recent Test appearance for England was against India in Ahmedabad in February 2021. This is his first home Test since August 2020 and just his 14th overall.\n\nRoot described Archer as an \"X-factor\" player who offered England \"something different\".\n\n\"We turn to him a bit like India turn to [Jasprit] Bumrah, really,\" Root said.\n\n\"They are obviously at very different stages of their career and are different players, but it's great to see him being so impactful and keeping his pace up throughout his spells as well.\"\n\nArcher has played nine of his 14 Tests on home soil but could be a strike weapon for England when the Ashes start in Australia on November 21.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP/ABC",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/lancelin-king-tide-flood-fear-wa-town-coastal-/105494586",
    "title": "Fears king tides could engulf tiny coastal town within months",
    "publish_date": "Fri, 11 Jul 2025 22:48:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "An expert says urgent action is needed to protect a small West Australian fishing town at risk of inundation from looming king tides.\n\nLancelin, 125 kilometres north of Perth, is home to fewer than 1,000 people, but its picturesque sand dunes and beaches attract thousands of tourists each year.\n\nBut while the town's inland dunes are famous for four-wheel driving and sand boarding, residents say the dunes closer to the coast have been steadily eroded by the ocean.\n\nWith the town itself sitting below sea level, locals are concerned the combination of winter weather and forecast high tide could put their homes and businesses at risk.\n\nGlen Trebilcock purchased the Lancelin Sands Hotel with hopes to be in Lancelin for the rest of his life. (ABC Midwest & Wheatbelt: Chloe Henville/Piper Duffy)\n\nGlenn Trebilcock moved to Lancelin just over two years ago, hoping to spend the rest of his life running the beachfront Sands Hotel.\n\nMr Trebilcock said he had lost 25 to 30 metres of beachfront to erosion since his arrival.\n\n\"Everyone knows that the ocean's very cyclic, but not at this ferocity and rapid erosion rate,\" Mr Trebilcock said.\n\nCoastal experts have told the Shire of Gingin that buildings like the Lancelin Sands Hotel are at risk of inundation. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nAnxious about his business, Mr Trebilcock started a petition calling on the government for assistance.\n\nWithin 24 hours, more than 200 people had signed in support.\n\n\"It's my livelihood, it's my business, home and community,\" he said.\n\n\" We've got big winter weather on the way … if [the erosion] continues at this rate, then I'm truly worried for everyone. \"\n\nGary Screaigh says he is happy to watch nature take its course. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nGary Screaigh has owned the Lancelin North End Caravan Park for 42 years and said he noticed the ocean getting more turbulent.\n\n\"You can nearly surf on the beach here at times, whereas before the ocean's always been very placid,\" he said.\n\nGary Screaigh says tides have been more \"vicious\" in recent years. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nBut Mr Screaigh said he was not worried about the impact erosion might have on him.\n\n\"I suppose it would be different if I was just beginning something, but I'm towards the end of my life,\" he said.\n\n\" Whatever Mother Nature does, I'll just go along with it. \"\n\nLinda Balcombe worries about what could happen if mitigation isn't put in place by August. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nTown's future under threat\n\nGingin shire president Linda Balcombe said damage to Lancelin's coastal barrier had become worse.\n\n\"We've lost some shire infrastructure, which is in front of the hotel and it's moved at quite an aggressive rate,\" she said.\n\nThe council has engaged coastal engineers and the Department of Transport for advice.\n\nA cement footpath at the front of the Lancelin Sands Hotel has crumbled into the ocean. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nMs Balcombe said the engineers warned her of a predicted king tide, expected in August, which could pose serious risk to the whole town.\n\nAdvice included the construction of a fresh dune at a 45-degree angle to the hotel and caravan park.\n\nThe Bureau of Meteorology said while it was not a scientific term, a king tide described a \"remarkably high tide\".\n\nA BOM spokesperson said its tide predictions forecast some larger tides at Lancelin during August, but not the largest of the year.\n\n\"If the king tide comes and we haven't got anything in place, we're not sure what damage could happen,\" Ms Balcombe said.\n\n\"That could create inundation into the town and especially the caravan park.\n\n\"It would also be devastating for the hotel … I'd hate to think it would be in danger of being closed down.\"\n\nWhat's left of the footpath in front of the Sands Hotel, taken from a drone view showing coastal erosion damage. (Supplied: Kaeto Hoffman/DroneSphereAU)\n\nFunding needed\n\nThe scope of works was expected to cost the shire $150,000, but Ms Balcombe said red tape around government funding had left them in the lurch.\n\n\"We don't have a big pot of money to protect our whole shire,\" Ms Balcombe said.\n\nLinda Balcombe is worried about what will happen to the town without preventative measures. (ABC Midwest & Wheatbelt: Piper Duffy)\n\nMs Balcombe said she had yet to receive a response from WA Treasurer Rita Saffioti.\n\nIn the state parliament last week, Midwest MP Shane Love, who represents Lancelin, asked Ms Saffioti to state her position on redirecting the funding.\n\nMs Saffioti confirmed Ms Balcombe's letter had been received and was \"working to provide an answer\" in relation to the switching of the funds.\n\nAsked if there was any provision for additional funding in cases like Lancelin, Ms Saffioti referenced disaster relief funding where shires could apply after they lost infrastructure to natural disasters.\n\n\"But Lancelin is not yet flooded,\" Mr Love said.\n\n\" If you wanted to prevent it from becoming a disaster, surely it would be wise to be able to respond quickly. \"\n\nCharitha Pattiaratchi says erosion problems are going to get worse in the coming decades. (ABC News: Claire Moodie)\n\n'Band-aid' solution\n\nCoastal oceanography professor Charitha Pattiaratchi said a sand dune would be a temporary fix, because Lancelin was built on an eroding coastline.\n\n\"It's a thorny problem because to save our coast is going to cost a lot of money,\" he said.\n\n\"In some places, we actually have to make the decision that this is not cost-effective to try to save this part of the beach and we have to let the natural process take over.\n\n\"So that's the question, what do we save and what do we let go?\"",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/tasmania-stateline-your-say-housing-election/105515840",
    "title": "These Tasmanians want to see housing as the number one priority this election",
    "publish_date": "Fri, 11 Jul 2025 22:30:50 +0000",
    "category": "finance",
    "authors": [],
    "text": "At 28, Amelia Bird would love to become a home-owner in Tasmania — but she isn't hopeful.\n\nHalf of her income is spent on rent, with little left over to save for a house deposit.\n\n\"It's hard … when you scroll through the (real estate) listings and you see the prices and they just keep going up and up and you're still not close to having a deposit you would need,\" she said.\n\nMs Bird says half her income is spent on rent, making saving for a deposit challenging. (ABC News: Jonny McNee)\n\nMs Bird has been a renter since she was 16 and at times found herself without a home and couch surfing.\n\nYour Say: Tell us what matters to you this Tasmanian election Photo shows Have your say for the Tasmanian election. We want to know what issues matter most to you and what you want us to find out as Tasmania goes to another election.\n\nReflecting on the impact of housing insecurity, she said \"you don't want to find yourself in a situation where you don't have a home\".\n\nShe said even short periods without housing can have lasting consequences, such as gaps in your rental history, which can make it harder to secure the next home.\n\nStable housing is her number one financial priority.\n\n\"If that means going without food for a few days or things like that, it's making those compromises,\" she said.\n\nMs Bird would like to see the next government look beyond simply building more public housing and consider supporting the establishment of housing co-operatives like the ones she grew up in.\n\n\"Having lived in two co-ops in Tasmania, the housing was so affordable …. because your rent is according to your income,\" she said.\n\nMs Bird said the Hobart cooperative she lived in had around 15 households all living on a single large property, with some shared infrastructure.\n\nTasmania's renters union says more homes need to be built to meet demand. (ABC News: Maren Preuss)\n\nShe said some of the benefits of the model are a strong sense of community and mutual support among cooperative members.\n\n\"Co-operative housing presents a lesser burden to government … primarily because it is self-managed,\" she said.\n\nState of housing in Tasmania\n\nTasmania's housing market has changed over the past 10 years.\n\nAccording to CoreLogic, the median house value has almost doubled from $315,688 (June 2015) to $609,265 (June 2025).\n\nEarly voting opens for Tasmanian election Photo shows a row of voting ballot boxes All your questions about voting early in the Tasmanian state election answered.\n\nData from the Tenants Union of Tasmania shows the median rent across the state has gone up from $266 per week (March 2015) to $469 per week (March 2025).\n\nThat's an increase of 76 per cent.\n\nThe rental vacancy rate in Hobart is 0.6 per cent, according to SQM research.\n\nBen Bartl says vacant blocks should not count towards a housing target. (ABC News: John Gunn)\n\n\"It's become increasingly difficult for people to keep a roof over their head but also juggle the other costs with housing including keeping the lights on and putting food on their table,\" said Ben Bartl, principal lawyer with the Tenants Union of Tasmania.\n\nAccording to Homes Tasmania's May data, there are 5,097 households waiting for social housing.\n\nPriority applicants are waiting on average 97 weeks.\n\nThree years ago, the Liberal government committed to building 10,000 social and affordable homes by 2032.\n\nSo far, 4,381 homes have been completed.\n\nBut counting towards that target are things like vacant residential land lots.\n\n\"We don't think that is an accurate indicator; the data should be just homes that have been completed,\" said Ben Bartl.\n\nHe said there are better ways to assess how many homes need to be built.\n\n\" The data shows social housing is not keeping up with population growth. \"\n\nThe Tasmanian Liberal party says it will build 10,000 social and affordable homes by 2032. (ABC News: Kate Nickels)\n\nHow would voters like to see the issue of housing addressed?\n\nThe ABC's Your Say platform has heard from voters wanting housing reforms.\n\nJane said \"build social housing now\".\n\n\"Stop suburban sprawl. Build more high-density housing and improve public transport,\" said David.\n\n\"Put a levy on unoccupied houses. Holiday homes and Airbnb should attract additional taxes,\" said Anne.\n\nJon said planning for housing \"should be streamlined\".\n\n\" People in Tasmania should not be homeless. \"\n\nVoters from across Tasmania have told the ABC they want housing to be prioritised this election. (ABC News: Morgan Timms)\n\nWho has promised what?\n\nWhat are Tasmanians being promised at their state election? Photo shows Thumbnail image for Tasmania state election 2025 promise tracker article. We keep track of each party's election promises so voters can make an informed decision.\n\nAmong the election promises from the Liberals is a plan to deliver an extra 200 modular homes.\n\nThe party has also vowed to lift the first home buyers' grant to $30 000.\n\nBoth Labor and the Liberals are promising to \"cut red tape\" so Tasmanians can build a home faster.\n\nLabor has also promised to extend existing stamp duty concessions to newly built houses and release a monthly planning dashboard that compares council performance on housing and development approvals.\n\nThe Greens have promised to put an \"immediate\" stop to new whole-home short-stay conversions.\n\nThe party has also promised to establish a real estate and rental standards task force to address issues like rental bidding and false advertising.\n\nNational rental reforms\n\nTwo years ago, the national cabinet agreed to strengthen renters' rights across Australia to improve the lives of the one-third of Australian households who rent.\n\nThe Better Deal for Renters included developing a nationally consistent reasonable grounds for eviction.\n\nThere was also an agreement to move towards limiting rent increases to once a year and phasing in minimum rental standards.\n\nBen Bartl said in Tasmania, there had been no progress on the reforms that were not already legislated.\n\nHe would like to see the next state government look at stabilising rents.\n\n\"Every time rents go up, more and more people have to apply for social housing,\" he said.\n\nHe suggests Tasmania should adopt the same model as Canberra, where rent can only be increased by CPI plus 10 per cent.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/gout-gout-monaco-diamond-league-under-23-200m/105524496",
    "title": "Fans erupt for Gout Gout's under-23 win at Diamond League in Monaco",
    "publish_date": "Fri, 11 Jul 2025 22:16:02 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australian sprint sensation Gout Gout has ticked off another milestone in his journey to the biggest stage, winning an under-23 race in his first appearance at a Diamond League event.\n\nThe 17-year-old, who is currently on school holidays, travelled to Monaco for the meet and outpaced a strong field to win in 20.10, although an \"unlucky\" -1.9 headwind stopped him from laying down another marker.\n\nRegardless, Gout was happy to get the win against a field that included 400-metre relay Olympic silver medallist Busang Collen Kebinatshipi, who finished second in 20.28.\n\nGout was one of just two teenagers in the six-man race and comfortably the youngest runner as he backed up after his European debut in Czechia a few weeks ago.\n\nLoading Instagram content\n\n\"The preparation is obviously the under-23 race, just getting my feet out there,\" he said after signing autographs for adoring fans at the finish line.\n\n\"I'm feeling very excited, just racing everyone out on the big league. Noah Lyles, [Letsile] Tebogo, just everyone out there. It's really fun to compete against for sure, so I just want to go out there and see what I can do.\"\n\nLyles and Tebogo, the reigning 100m and 200m Olympic gold medallists, went 1-2 in the open men's 200m.\n\nAmerican Lyles, who won bronze behind Tebogo in the 200m at last year's Paris Games, finished in a season-best 19.88, with Botswana's Tebogo 0.09 of a second behind.\n\nGout's time would have been good enough for fifth, although their headwind was half the strength faced by the U23 field.\n\nLater in Monaco, Olympic 1,500m silver medallist Jess Hull recorded a national record in the 1,000m.\n\nExactly a year after she reaffirmed herself as an Olympic threat with a world record in the 2,000m at the same event, Hull beat the national 1,000m record by more than two seconds as she finished third.\n\nHull was passed on the bend by Kenyan Nelly Chepchirchir, who is undefeated in 2025, before American Addison Wiley pipped the Australian on the final straight.\n\nDo you have a story idea about women in sport? Email us abcsport5050@your.abc.net.au\n\n\"That was a very good race tonight and they ran very fast to win. It's an aggressive race and there's not much time to make up time in the last 200m, so I think it's important to attack it and be quite aggressive in your approach to it,\" Hull said.\n\n\"I certainly was tonight but that last 80 metres was probably the longest 80 metres I've had in a very long time [but] I got everything I was hoping to out of it.\"\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nMeanwhile, Bol moved into the top 30 all-time with his 1:42.55 in the men's 800m final, finishing fourth and smashing his own national record as Kenya's Emmanuel Wanyonyi ran a meet record and the fastest time of the year (1:41.44) to win.\n\n\"I've overcome a lot over the last few years. They were pretty bad for me but I'm back and I'm better,\" he said.\n\n\"An Australian record, I can't be any happier.\"\n\nIn the field, Kurtis Marschall cleared 5.92m to finish on the last step of the podium behind Mondo Duplantis, who set a meet record of 6.05m.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/canberra-national-dragon-boating-team-the-auroras/105516196",
    "title": "The Aussies taking the world stage in this niche sport",
    "publish_date": "Fri, 11 Jul 2025 22:12:24 +0000",
    "category": "sports",
    "authors": [],
    "text": "It's a fast and furious sport with an ancient past and a growing legion of devoted fans.\n\nBut when 16-year-old Jun Lee tells people he races dragon boats, he's almost always met with confusion.\n\n\"Usually it's something like, what is a dragon boat?\" the Canberra schoolboy said.\n\n\"It's a pretty niche sport at the end of the day, so not many people know about it.\"\n\nJun Lee starting dragon boat racing through school and is now representing Australia. (ABC News: Lily Nothling)\n\nDragon boating originated in China more than 2,000 years ago.\n\nThe modern version of the sport sees teams of 20 paddlers — plus a drummer and a steerer — race distances up to two kilometres.\n\n\"I think it is one of the most high-stress environments I'm in,\" Lee said.\n\n\" You have a hundred people around you trying to compete, you have the drums going, you have the water umpires yelling at you — it's crazy. \"\n\nThe Canberra contingent of The Auroras, training on Lake Burley Griffin. (ABC News: Toby Hunt)\n\n300 Aussies headed to Germany\n\nThe sport's popularity is on the rise, with competitive and social clubs popping up around the country.\n\nMore than 300 of Australia's best paddlers have travelled to Germany to compete in next week's World Dragon Boat Racing Championships.\n\nThe national team, called the Auroras, is made up of teens to retirees competing in different divisions, who have been preparing intensely for the past 22 weeks.\n\nThe Auroras are Australia's National Dragon Boating Team, and 32 of its members are based in Canberra. (ABC News: Lily Nothling)\n\nThat includes 32 Canberra-based paddlers, who have been braving sub-zero temperatures to train on Lake Burley Griffin almost every day.\n\nOnce a rugby league and union player, Sam Thompson started dragon boating a decade ago and now captains Australia's Senior B team.\n\n\"It took me a few years to admit to people that I was a dragon boater, but I'm very proud now,\" Thompson said.\n\n\" The first time you're on the start line and look down on your shirt and see the national emblem, the coat of arms, it's very special. \"\n\nSam Thompson captains Australia's Senior B Dragon Boating team. (ABC News: Lily Nothling)\n\nMore than 4,000 paddlers from 34 countries will compete in the world championships.\n\n\"It's going to be an extremely tough competition — if we get to the podium, that'll be unreal,\" Thompson said.\n\n'20 people to make friends with'\n\nWhile dragon boating can struggle to attract younger participants, Ashleigh Wright first picked up a paddle when she was just 12.\n\n\"Mum found an ad on Facebook for it and you could do it with your parents so she thought it would be a cute thing for us to do together,\" she said.\n\n18-year-old Ashleigh Wright is part of the team heading to the World Dragon Boat Racing Championships in Germany. (ABC News: Lily Nothling)\n\nThe now-18-year-old has not looked back since, and is proud to be pulling on the green and gold for the first time.\n\n\"I love the community in dragon boating,\" Wright said.\n\n\" You have 20 people in a boat so that's 20 people to make friends with. \"\n\nThis month's championships will also mark the inaugural appearance of Australia's paradragon team.\n\nAmong the paddlers is former paralympic cyclist Lindy Hou, who is blind.\n\nRetired paralympic cyclist Lindy Hou is part of Australia's inaugural paradragon squad. (ABC News: Lily Nothling)\n\nThe gold medallist swapped the bike for the boat to stay fit in retirement.\n\n\"Once I learnt how to hold a paddle and the movement, I just have to keep time with everybody,\" Hou said.\n\n\" It's an inclusive sport in the way anyone can do it, regardless of ability. \"\n\nThe world championships begin in Germany on July 14.",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/gen-x-rave-generation-reclaims-dancefloor-with-day-clubbing/105476612",
    "title": "Gen X clubbers party like it's the 90s but are home by 9pm",
    "publish_date": "Fri, 11 Jul 2025 22:09:38 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's 3pm on a Saturday in the heart of Surfers Paradise and hundreds of middle-aged revellers are getting ready to party like it's 1999, but they have no intention of staying up until midnight.\n\nThese 90s kids are the original rave generation and while they might be hitting their 50s, they are still keen to hit the dance floor.\n\nDay clubbing events are aimed at the over-30 partygoer and tend to play music from the 70s to the 2000s.\n\nBut one of their biggest drawcards is that they usually finish by 8pm.\n\nDave Maguire says dancing allows him to relive his glory days. (ABC News: Emma Hannigan)\n\nDance lover Dave Maguire, 62, is a builder on weekdays but on weekends he hits the day clubs with a group of friends ranging from their 40s to their early 60s.\n\n\"After dancing for five hours I'm heading back to Brisbane and in bed by 10pm,\" he said.\n\n\"The magic of dancing is that it reminds me of being back in my glory days when I had less responsibilities.\n\n\" It's amazing for the more mature generation. \"\n\nNick Shaw, founder of Studio 38, so called because its events run from 3pm until 8pm, said he first started a day club in Brisbane in July 2024 to fill a gap in the market.\n\nNick Shaw's day-clubbing events have expanded from Brisbane and the Gold Coast to Sydney and Melbourne. (ABC News: Emma Hannigan)\n\nComing of age in London in the 90s, he was at the heart of the rave scene.\n\n\"I loved going out to clubs and partying with my friends but as I got older, the other people got younger and I didn't enjoy it anymore,\" Mr Shaw said.\n\nThe feedback he gets from daytime clubbers is clear.\n\n\"You can go out and have fun all afternoon and you're home by 9 o'clock at night,\" he said.\n\n\" You're waking up clear-headed, you're able still to do stuff with the kids and it doesn't impact your weekend. \"\n\nMr Shaw said there were now four or five other operators holding regular events across Australia.\n\nSome are women only, others are alcohol free, but what many have in common is their popularity with women in their 40s and 50s.\n\nGen X women drive surge in daytime clubbing\n\nJenny Parker, 51, is among the hundreds attending the Gold Coast day club event.\n\nJenny Parker (second from right) and friends are regular daytime clubbers. (ABC News: Emma Hannigan)\n\nShe said the only thing about her social life that had changed since the 90s was her bedtime.\n\n\"I don't feel any different than I did back then, but I'd rather be at home in bed by 9pm than out till 5 in the morning.\n\nMs Parker said her generation X friends were showing no signs of hanging up their dancing shoes.\n\n\"I'm here as part of a crowd of about 20 women and we're out every time there's an event like this,\" she said.\n\n\" I love it, I live for it, I wish it was on every single weekend. \"\n\nDay clubbing events are selling out across Queensland. (ABC News: Emma Hannigan)\n\nAging differently\n\nThe rise in day clubbing's popularity could be because generation X — now aged between 40 and 60 — is aging differently from previous generations, according to demographer Simon Kuestenmacher.\n\n\"[Generation X] grew up watching their parents work themselves to death and figured there must be a better way of balancing work and life,\" Mr Kuestenmacher said.\n\n\"When we talk about daytime clubbing, this is gen X realising there is more to life than just work and they might as well live it up.\n\n\"Why wouldn't they continue to do this?\"\n\nDancing has a range of benefits, both physical and cognitive. (ABC News: Emma Hannigan)\n\nThe refusal to grow old gracefully may be a good thing.\n\nBond University exercise scientist and behavioural researcher Justin Keogh has studied the health benefits of dancing for older adults.\n\n\"Dancing has lots of physical benefits but also has a host of social and cognitive benefits as well,\" Dr Keogh said.\n\n\"Most forms of dance are social in some capacity so you're meeting a whole range of people, those benefits are huge.\n\n\"Cognitively, dance is quite a complex motor skill that requires lots of connections between the brain, spinal cord, the muscles and the nerves.\"\n\nDave Maguire checks his stats on his watch. He can rack up 40,000 steps on a night out. (ABC News: Emma Hannigan)\n\nAlong with the music, Dave Maguire loves seeing his steps rack up on the dancefloor.\n\n\"I punch out 37,000 steps in five hours and I'm home in bed by 10pm,\" he said.\n\n\"[Then I can] get up for a bike ride at 4:30am.\"\n\nWhether it is the benefits of dancing, socialising or the nostalgia of reliving the glory days, the people here agree there are few downsides.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-12/new-port-adelaide-aboriginal-culture-centre/105511330",
    "title": "'Everyone comes here now': New culture centre a dream come true for Kaurna elder",
    "publish_date": "Fri, 11 Jul 2025 22:03:14 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "\"I'll play it, then I'll come back and show you how I did it.\"\n\nThe deep, hypnotic sound of one of the oldest instruments in the world fills the room as Otis Carter teaches a group of young boys and teenagers how to circular breathe when playing what's commonly known as the didgeridoo.\n\n\"See my cheek with that bubble there, it's pushing a bit of air through,\" Mr Carter explained.\n\nHundreds attended the Yitpi Yartapuultiku Aboriginal Cultural Centre open day. (Supplied: City of Port Adelaide Enfield)\n\nThe lesson is being held as part of a NAIDOC family day at the newly-opened Yitpi Yartapuultiku Aboriginal Cultural Centre on the banks of Adelaide's Port River.\n\nIt's a wet and wintry day outside, but inside the place is teeming with hundreds of excited children, dashing between drawing and painting, weaving, play areas and workshops.\n\nA place for Kaurna people to gather and share culture and stories in Adelaide is a dream come true for elders like 95-year-old Lewis O'Brien.\n\nA space outside the Yitpi Yartapuultiku Aboriginal Cultural Centre. (ABC News: Ashlin Blieschke)\n\n\"It started really probably 30 years ago when the old people got together and they said we should have a centre,\" Uncle Lewis explained.\n\n\"Yitpi Yartapuultiku means soul of Port Adelaide and it's turned out to be exactly that … everyone comes here now.\n\n\"It's a community centre that everyone feels happy about, a place of wellbeing and reflection, and you can walk the dog and the kids can play on the playgrounds … you've got the sea at the back, you got a dance ground outside, you got places inside.\"\n\nKaurna Elder Lewis O'Brien says the new cultural centre is 30 years in the making. (ABC News: Ashlin Blieschke)\n\n'People want to be a part of it'\n\nYitpi Yartapuultiku Aboriginal Cultural Centre opened on June 1 with a showcase of Kaurna dance, music and culture, alongside a self-guided trail, exhibitions and art and craft stalls.\n\nIt is estimated more than 11,000 people flocked to the event, something the centre's CEO Lee-Ann Buckskin said she won't forget.\n\n\"I was in-between the two buildings, the breezeway, and I turned around and I just saw this tsunami of people walking towards me, and I just, at that moment, went, 'goodness me the people have spoken',\" she explained.\n\n\" The people spoke — Aboriginal cultures here. People want to be a part of it. They want to learn about their heritage as Australians and connect to us and connect to country. \"\n\nThe Port Adelaide Enfield council built the $35.2 million state-of-the-art centre, with the federal government contributing $2.3 million toward a living shoreline at the river bank.\n\nThe work includes regenerating the entire area with native plants, including replanting mangroves and reeds endemic to the area. The are also plans for a bush food garden.\n\nThe council's Aboriginal Advisory group and Kaurna elders and community were the driving force behind the centre's design and development.\n\nThe centre is a place for Kaurna people to gather and share culture. (Supplied: City of Port Adelaide Enfield)\n\n\"This place was really chatting for a few years, like five years, I think,\" Uncle Lewis said.\n\n\"We met with the colleges, we met with architects, we met with the council members.\n\n\"You don't waste your time by yarning, you make a very productive design when you do a lot of people, discussing with a lot of different people, and bringing those thoughts together and you become unified and develop place like this.\"\n\nThe co-design approach also involved hands-on workshops.\n\n\"The architects got kinetic sand and the elders sat around a table and had a sense of this place as flat, but with the kinetic sand built the landscape to how they wanted it to be used,\" Ms Buckskin added.\n\n\"So, what we see are undulating spaces throughout and that is almost wrapped up with beautiful native plants.\"\n\nWork on the Yitpi Yartapuultiku Aboriginal Cultural Centre included regenerating the area with native plants. (ABC News: Ashlin Blieschke)\n\nLanguage classes, guided tours on the cards\n\nOngoing plans include training in hospitality and tourism, from running conferences at the centre to regular guided tours, along with attracting visitors from the cruise ships that dock in the Port.\n\n\"Our hope is that our kids get the opportunity to be able to get some employment through the kitchen, out into the conference space and café,\" Ms Buckskin said.\n\n\"We're really wanting to have a learning environment for people.\n\nLee-Ann Buckskin says she won't forget how many people attended the Yitpi Yartapuultiku Aboriginal Cultural Centre's opening. (ABC News: Ashlin Blieschke.)\n\n\"So we'll be looking at offering language classes … a range of different things in terms of artefact making and activities which people are looking for … people booking in classes to learn about native foods.\"\n\nMs Buckskin explains Yitpi, as it is affectionately known, is a place for everyone to enjoy while reflecting and supporting Kaurna people and community.\n\n\"It's really a place not only for the broader community to be curious and learn around Kaurna culture and broader Aboriginal culture, but it's a place for cultural maintenance,\" she said.\n\n\"And that's really important to our future generations, as in terms of their identity and their cultural practices into the future.\"\n\nFor organisers of the NAIDOC family day, events like these make that vision a reality.\n\nA poster marking NAIDOC week at the Yitpi Yartapuultiku Aboriginal Cultural Centre. (ABC News: Emma Masters)\n\n'It makes them feel proud'\n\nAs the winter winds and heavy rain beat against windows that offer a scape to the cultural dance ground, walking paths and the river bank, a young teenager brings the didgeridoo to life — sparking a smile from his teacher.\n\n\"I'm just looking around and seeing these kids connected to everything that's happening,\" organiser Kahlia Miller-Koncz said.\n\n\"It makes them stronger in their identity; it makes them feel proud.\"\n\nFor Uncle Lewis, it is a sign of the times.\n\n\"We've thought about that for a long time, that we should exchange knowledge,\" he explained.\n\nLewis O'Brien and Lee-Ann Buckskin looking over plans for the new cultural centre. (ABC News: Ashlin Blieschke)\n\n\"We think people are ready to for change, to think in a different way.\n\n\"How did we last 65,000 years? We didn't do it by aimless wandering.\n\n\"We did it by beautiful thinking and learning with each other and not be envious of anyone else, just love your own country.\n\n\"And I think that's the way we should live in the rest of the world.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/sport/johnson-becomes-undisputed-champ-20250712-p5mefa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Johnson becomes undisputed champ",
    "publish_date": "Sat, 12 Jul 2025 11:39:45 +1000",
    "category": "finance",
    "authors": [],
    "text": "Johnson becomes undisputed champ\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/national/lyon-could-be-dropped-cummins-reveals-20250712-p5mef6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lyon could be dropped, Cummins reveals",
    "publish_date": "Sat, 12 Jul 2025 10:04:34 +1000",
    "category": "finance",
    "authors": [],
    "text": "Lyon could be dropped, Cummins reveals\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/business/companies/kylie-jenner-helped-this-gadget-go-viral-now-the-firm-s-founder-is-a-billionaire-20250708-p5mddf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kylie Jenner helped this gadget go viral. Now the firm’s founder is a billionaire",
    "publish_date": "Sat, 12 Jul 2025 10:00:00 +1000",
    "category": "finance",
    "authors": [
      "Yoojung Lee"
    ],
    "text": "In a 15-second TikTok clip that has racked up millions of views, Kylie Jenner glides a sleek device across her face, swearing by its ability to help skin absorb serums more effectively. Dubbed the Booster Pro, the gadget’s video has gone viral – and with it, the fortunes of its maker, APR Corp, a once-obscure Seoul-based start-up now at the centre of the K-beauty boom.\n\nBehind the firm is 36-year-old Kim Byung Hoon, a tech entrepreneur-turned-beauty mogul whose company has made him South Korea’s newest billionaire. His 31 per cent stake in APR is now worth about $US1.3 billion ($2 billion), according to the Bloomberg Billionaires Index, after the firm’s shares soared 200 per cent this year.\n\nKim in a video on social media showing the effects of APR’s facial gadget. Credit: IInstagram, @byunghoon_victor_kim\n\nKim started out dabbling in mobile apps – including a dating app – after studying in California as an exchange student more than a decade ago. It was there that he first witnessed the smartphone revolution and got hooked on entrepreneurship.\n\nHis pivot to skincare came in 2014 when he launched APR, initially focused on cosmetics. In 2021, the business expanded into producing high-tech facial devices that promise spa-like treatments at home. It’s a product line that Kim personally espouses – he uses APR’s facial gadget for 30 minutes every day, APR’s chief financial officer, Shin Jae Ha, told Bloomberg News.",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/sport/unless-the-wallabies-were-playing-possum-lions-may-be-in-for-a-feast-20250711-p5me5f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Unless the Wallabies were playing possum, Lions may be in for a feast",
    "publish_date": "Sat, 12 Jul 2025 09:33:00 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "The loss of Wallabies No.10 Noah Lolesio, a shattering blow for him and a worrying time for his family, leaves a big hole.\n\nLolesio could never quite succeed in one of Australian rugby’s most pointless pursuits – finding a saviour at No.10 – and judging by Nathan Cleary’s latest State of Origin series, you can put a line through that name as well.\n\nLolesio’s degree of familiarity with Joe Schmidt’s structured style of play is going to be hard to recreate, especially for a player coming in from outside the group.\n\nJames O’Connor, the 35-year-old new man in the squad, will offer some hard-won experience, but he started one game for the Crusaders this year, and they got pumped 45-29 by Moana Pasifika in Christchurch. There are no easy answers.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/business/companies/air-india-crash-report-puts-focus-on-actions-of-pilots-20250711-p5me9w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Air India crash report puts focus on actions of pilots",
    "publish_date": "Sat, 12 Jul 2025 09:30:11 +1000",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "The findings could explain why the aircraft’s emergency-power generator, known as a ram air turbine, appeared to have been activated moments before it plummeted to the ground. “At this stage of investigation, there are no recommended actions to Boeing 787-8 and/or GE GEnx-1B engine operators and manufacturers,” India’s Aircraft Accident Investigation Bureau said. Family members and relatives of Akash Patni, a victim of the Air India plane crash, grieve during his funeral procession in Ahmedabad last month. Credit: AP Air India released a statement on the report, saying on X it was cooperating with Indian authorities as the investigation continues. The airline wrote on X that the airline “stands in solidarity with the families and those affected”. It did not address specific findings in the report.\n\nBoeing and GE Aerospace did not respond immediately to requests for comment. The agency, an office under India’s civil aviation ministry, is leading the probe into the world’s deadliest aviation accident in a decade. Air India flight 171 crashed on take-off from Ahmedabad, killing all but one of the 242 passengers and crew on June 12, along with 19 people on the ground. The cause has remained a mystery. A retired captain with experience flying wide-body aircraft said an accidental shift in the fuel switches would be impossible. “If you lift the fuel control switches, it’s a double action. So you have to lift them and pull them rearwards – that will cause the engine to shut down pretty well immediately,” the former captain said.\n\nThe switches have to be lifted up and then pulled over a detent, or a catch in the slot, which locks them into position, said the former captain, who noted that a plane cannot take off with switches in an off position. “The only time you would use those switches as part of a shutdown on restart checklist, you would attempt to recycle to start switches on the engine to cause the engine to ‘re-light’ (as we say in the business),” the retired captain said. The tail of the Air India plane became wedged in the dining hall of a medical students’ hostel. Credit: Getty “I can assume, possibly, that one or other pilots turn both fuel control switches off just before the crash in order to minimise the fire risk, but that’s only an assumption, and it’s an extreme assumption.\n\nLoading “In the absence of a direct suicide attempt by one or the other of the pilots – and there’s no indication of that – I can’t see why the switches would’ve been turned off. “They certainly wouldn’t have been turned off inadvertently. “You cannot bump those switches and inadvertently drag them aft. Nor can you do that to both. You have to individually grab the switch and rotate it to the after position to stop the engine.” There are only two reasons they would have turned off the engines, the retired captain said, one would be a “frantic attempt” to get the engines to restart.\n\nLoading “But the engine would take 30 to 45 seconds to spool back up,” the ex-captain said. The other possibility was “that they knew they were going to crash, so they just shut the switches to minimise their total fire risk”. “If they did that, they were very brave and confident men and thinking about what they were doing right to the end.” Catastrophic crash\n\nThe Boeing 787 Dreamliner, bound for Gatwick in Britain, lost altitude almost immediately after take-off, sinking and hitting buildings on the ground. The apparent dual failure of its engines has raised questions about the cause of the catastrophe. The Boeing Dreamliner has had a strong safety record, and the findings of the investigation are being closely watched for fallout for the Indian airline and the US aircraft manufacturer. Asked for a comment from Boeing, the company said: “Consistent with US law and the UN International Civil Aviation Organisation protocol known as Annex 13, we will refer you to India’s Aircraft Accident Investigation Bureau for any information.” India’s aircraft accident bureau recently contradicted reports in Indian media by saying the flight black boxes had survived the crash and were expected to yield “good data”, Reuters reported.\n\nLoading Black boxes routinely record 300 parameters of information that can be parsed and compared with cockpit conversation and other sounds from the last minutes of the crash to understand what the cause was. Boeing has been beset by a number of troubles linked to previous crashes of its planes, which have raised questions about the future of the aircraft maker behemoth. An issue linked to a flawed flight control system was determined to be the cause of the Indonesian Lion Air Boeing 737 Max crash in 2018 and the Ethiopian Airlines crash of the same model in 2019. The global fleet of 737 Max aircraft was grounded. Regulators in the US have forced Boeing to slow down the production of planes while it examines its work and safety practices. The delays have weakened Boeing’s competitive position against its lone peer plane maker, Airbus. Both manufacturers have had their production levels struggle amid supply chain disruptions driven by the COVID shutdowns.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/national/detective-reveals-fresh-details-about-missing-backpackers-rescue-20250712-p5meex.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Detective reveals fresh details about missing backpackers' rescue",
    "publish_date": "Sat, 12 Jul 2025 09:00:40 +1000",
    "category": "finance",
    "authors": [],
    "text": "Detective reveals fresh details about missing backpackers' rescue\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/sport/gout-gout-reflects-on-monaco-win-20250712-p5meew.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gout Gout reflects on Monaco win",
    "publish_date": "Sat, 12 Jul 2025 08:29:11 +1000",
    "category": "sports",
    "authors": [],
    "text": "Gout Gout reflects on Monaco win\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 14
  },
  {
    "url": "https://www.smh.com.au/national/five-injured-after-truck-crashes-into-cars-on-m1-20250712-p5meem.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Five injured after truck crashes into cars on M1",
    "publish_date": "Sat, 12 Jul 2025 07:20:05 +1000",
    "category": "finance",
    "authors": [],
    "text": "Five injured after truck crashes into cars on M1\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/world/fuel-to-both-engines-cut-off-before-fatal-air-india-flight-took-off-report-finds-20250712-p5meen.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fuel to both engines cut off before fatal Air India flight took off, report finds",
    "publish_date": "Sat, 12 Jul 2025 07:20:05 +1000",
    "category": "finance",
    "authors": [],
    "text": "Fuel to both engines cut off before fatal Air India flight took off, report finds\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/disappointing-fitzy-defends-origin-superstar-20250712-p5meei.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Disappointing': Fitzy defends Origin superstar",
    "publish_date": "Sat, 12 Jul 2025 06:34:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Disappointing': Fitzy defends Origin superstar\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/cricket/everything-s-an-option-australia-mulling-shock-lyon-call-for-pink-ball-test-against-west-indies-20250712-p5mee9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Everything’s an option’: Australia mulling shock Lyon call for pink ball Test against West Indies",
    "publish_date": "Sat, 12 Jul 2025 06:31:26 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Kingston: Australia haven’t settled on their XI for the final Test against the West Indies in Jamaica as skipper Pat Cummins revealed “all options” are being considered, including leaving spinner Nathan Lyon out of the side.\n\nIn the previous two Tests in Barbados and Grenada, Cummins has unveiled Australia’s XI at his mandatory pre-match press conference 24 hours out from the Test.\n\nBut ahead of a day-night pink ball fixture at Sabina Park, starting on Saturday (Sunday 4.30am AEST), Cummins said Australia would take more time to decide and make sure the team had the right balance.\n\n“[There are] a few more unknowns, so we just want to have another look at the wicket and give it a bit of time and work out a team later on today,” Cummins told reporters.",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/sport/tennis/i-would-be-sad-djokovic-gives-best-indication-yet-about-retirement-plans-20250712-p5meef.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I would be sad’: Djokovic gives best indication yet about retirement plans",
    "publish_date": "Sat, 12 Jul 2025 06:04:50 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "Former world No.1 Novak Djokovic has given the best indication yet that he will continue playing into next year, saying he plans to contest “at least” one more Wimbledon before retiring.\n\nThe 24-time grand slam champion’s bid to match Roger Federer’s record eight singles titles at the All England club will have to wait, after he lost 6-3, 6-3, 6-4 to world No.1 Jannik Sinner in their semi-final on Friday. He has reached that stage at all three majors this year.\n\nNovak Djokovic hopes this was not his final Wimbledon appearance. Credit: Getty Images\n\nThere is constant speculation about when Djokovic will call time on a career that statistically towers over every other men’s tennis player in history, but the 38-year-old is apparently not ready to do that.\n\n“I would be sad [if that was the end], but hopefully, it’s not my last match on the centre court,” Djokovic said.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/environment/sustainability/game-changer-your-electric-vehicle-can-now-power-your-home-and-the-grid-20250702-p5mby3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Game changer’: Your electric vehicle can now power your home and the grid",
    "publish_date": "Sat, 12 Jul 2025 05:30:00 +1000",
    "category": "finance",
    "authors": [
      "Caitlin Fitzsimmons"
    ],
    "text": "Federal Energy and Climate Change Minister Chris Bowen says the government sees plenty of potential in EVs and setting up the grid so that vehicles can be used like “household batteries on wheels”. “Our government wants to make sure that Australians can take back control of their energy bills,” Bowen says. “Whether that’s through installing a cheaper home battery, or purchasing a V2G EV, Aussie households are increasingly looking to renewable options that work for them to slash their power bills.” The Clarkes use power from their car in their home, and sell excess to the grid. Credit: Alex Ellinghausen A battery for a modern electric vehicle enabled for V2G charging is 50 to 100 kWh, while a plug-in hybrid battery starts from 20 kWh. A typical home battery is six to 10 kWh, meaning the battery in a typical EV is much more powerful than one on the side of a house. Clarke bought his Nissan Leaf in April 2023 after researching home batteries and realising that the cost per kilowatt hour of storage was significantly lower in a car. “I got a 60 kWh battery for $60,000, while a Tesla Powerwall costs $15,000 for 13 kWh,” he says.\n\nThe possibilities are enormous. When EVs become batteries on wheels, a city full of solar on rooftops and EVs in driveways becomes a distributed power plant, making it more possible to switch off the ageing coal-fired power fleet. By the early 2030s, the combined battery capacity of all EVs in Australia is likely to surpass all other forms of storage in the national energy market, including Snowy 2.0, says the Australian Renewable Energy Agency’s national road map for bidirectional EV charging. By 2050, the storage in the national EV fleet is likely to be three times higher than the total storage capacity in the national energy market. Yet, the road map notes, the capital cost of enabling vehicle-to-grid technology is a fraction of the cost to build large-scale storage. Loading Electric Vehicle Council analysis suggests EVs with V2G technology could bring down costs for everyone by reducing the need for the highest-price electricity generation and reducing the need for network augmentation to cope with the handful of days a year when the system operates at maximum capacity. The lobby group wants the government’s Cheaper Home Batteries Program, a subsidy that began on Tuesday, to extend to the V2G charging infrastructure for EVs.\n\nV2G charging requires three things. First, the vehicle needs to be capable and have it enabled. In some models, the capability is switched off or using it would void the warranty. Dr Alina Dini, head of energy and infrastructure at the Electric Vehicle Council, says three V2G-ready cars imported into Australia are the Nissan Leaf, the Mitsubishi Outlander and Cupra, while there is also the Ford F-150 Lightning made compatible with Australian V2G standards by after-market modifications by AUSEV. Second, the charger needs to be approved by the Clean Energy Council. Finally, the network must allow it and the retailer to offer pricing to support it. Things are moving rapidly. Ausgrid, the electricity distributor for much of Sydney, signalled on Tuesday that it had successfully plugged a vehicle-to-grid system into its network, enabling a two-way flow of energy that effectively turns EVs into batteries on wheels. Loading Ausgrid’s head of EVs, Nick Black, says some retailers have been early adopters, involved in testing how it would work, so there are already offers in the market.\n\nBlack says the technology will be a game changer for the grid, eventually. “We just need that EV adoption in place,” he says. “There’s still a low penetration of EVs, and we see that due to a lack of highly available public charging infrastructure.” The company is lobbying the NSW government to change the rules to allow it to directly own and maintain public EV chargers on its power poles, a proposal fiercely resisted by standalone EV-charging companies. Essential Energy, which covers 95 per cent of NSW, said V2G charging for AUSEV’s Ford F-150 Lightning was market-ready at the Smart Energy Conference in April, after a long period testing the Nissan Leaf. The power distributor and CSIRO are investigating V2G technology with other car manufacturers. Endeavour Energy, the third NSW network, has also been trialling V2G technology and said it would allow any charger approved by the Clean Energy Council.\n\nIn Victoria, the company that covers Melbourne and much of regional Victoria through ownership of Powercor, CitiPower and United Energy has been running a trial of V2G charging and is preparing to roll it out more widely. Daniel Bye, Powercor head of customer connections and requests, says the company would treat vehicle-to-grid chargers the same as any other battery connected to the network, and any charger approved by the Clean Energy Council would automatically be approved. “We’re really excited by the possibilities V2X technology offers our customers and the community,” Bye says. (The V2X term includes vehicle to grid, vehicle to home, and vehicle to load – the final one being when you can plug in appliances such as power tools or camping fridges directly into the battery.) Loading\n\nIn financial modelling by the Electric Vehicle Council, a customer in western Sydney who has an electricity plan with exposure to the wholesale price of electricity (such as Amber Electric) could earn $1000 a year by charging an EV when the cost of electricity is low and discharging to the grid between 6pm and 10pm each day. A customer with a power plan with time-of-use tariffs (such as OVO Energy) could save $500 a year by charging the EV battery when the electricity is free during the day and using it to power their appliances when the price goes up in the evening. “It’s an opportunity for something that sits statically in a driveway or a car park to be a way to help consumers not only save money but potentially even earn from it,” says Electric Vehicle Council chief executive Julie Delvecchio. “It transfoms what an electric vehicle is, from just a car to a method to support the grid, which I think is really significant.” The Clarkes already had a 10 kWh solar system, but the power bills were still about $3000 a year before they moved to Amber Electric, and the petrol for the car was $3000 a year. A year later, Francis Clarke has a credit of $400 on his electricity bill, after powering both his house and car, despite having driven 26,000 kilometres. As well as the financial rewards, Clarke is interested in the environmental benefits.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/business/companies/jamming-and-spoofing-the-threat-airlines-deal-with-everyday-20250706-p5mcw3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jamming and spoofing: The threat airlines deal with every day",
    "publish_date": "Sat, 12 Jul 2025 05:30:00 +1000",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "The manipulation occurs for planes as flights pass adjacent to areas where militaries disrupt or alter GPS signals to ward off attacks, confuse hostile drones and missiles, or harass pilots. Civilian airlines flying long-haul routes, such as those between Australia and Europe, can be affected. GPS jamming, conducted by military forces, is near constant around Ukraine and parts of Russia. At any given time, the incidence of spoofing that affects commercial airspace shifts. But to give an example, in July to August 2024, the top airspace regions affected by spoofing were Cyprus, Israel, Egypt, Turkey, Russia and Pakistan, according to GPS Spoofing Workgroup report. There has been a more than 200 per cent increase in Global Positioning System loss events between 2021 and 2024, according to the International Air Transport Association (IATA). “With continued geopolitical tensions, it is difficult to see this trend reversing in the near term,” said Nick Careen, IATA’s senior vice president for operations, safety and security.\n\nSpoofing can create some strange effects in the cockpit, like being at 30,000 feet when an alarm comes on telling the pilot to immediately pull up to avoid the ground, or the clocks used by the captain and first officer no longer read the same time. An instrument can falsely indicate a plane is far from its actual location. Another pilot, who flies through affected regions, said GPS jamming now happens daily. The aircraft loses the connection to the GPS, and it flies a bit further and regains the signal again. “It’s no big deal if it’s for a limited time while en route.” GPS spoofing, while less frequent, poses a bigger problem, the pilot said. “That is much more serious if it goes haywire.” It can change the timing of clocks in the aircraft and in the worst case, it can mess with the instruments reading the position of the plane, he said.\n\nPlanes with their GPS spoofed can unexpectedly turn without air traffic control clearance, deviating from their cleared route. This can put them at risk of entering dangerous or military areas, as almost occurred in 2023 on a flight from Europe to Dubai, according to OpsGroup, an organisation of international flight operations professionals. There’s some history here. Civilian planes didn’t use GPS until after Korean Air Lines flight 007 was shot down by Soviet aircraft in 1983 after it drifted into Russian airspace. The downing of the Boeing 747-230B, amid Cold War tensions, killed 269 people, and prompted the US government to permit the US-built GPS system to be used for civilian aviation. Experts fear that the abundance of false alarms around GPS can erode a pilot’s awareness, or increase distrust of the data. A recent OpsGroup report identified loss of safe distance between other planes on the air route due to false instruments warnings as one of the safety concern arising from spoofing. Korean Air Lines: the Boeing 747-230B was shot down by a missile in 1983 after drifting into Soviet airspace. GPS became a standard navigation aid afterwards. Credit: Hansueli Krapf\n\nThe GPS Spoofing WorkGroup report also cited instances of surprise altitude climbs by planes initiated by the ground avoidance system in the cockpit. Loading There is also a longer-term effect, too. “Due to now commonplace encounters of GPS spoofing impacts, there is a gradual, insidious acceptance of increasingly higher risk at [an] organisational level,” a 2024 report concluded. “Small changes and new behaviours that were slight deviations from the normal course of events gradually become the norm, providing a basis for accepting additional deviance and, typically, higher risk.” A phenomenon known as “spoofing fatigue” is also emerging: pilots accustomed to frequent spoofing incidents simply stop reporting them.\n\nThis can lead to a normalising of risk and reduced situational awareness. Different readings on instruments in the cockpit can also cause disagreements between pilots and other crew members regarding the best course of action, clouding the decision-making needed for a safe flight. The pilot interviewed by this masthead said that when they lose GPS en route: “We basically don’t do anything unless a secondary navigation system warns that the plane’s route is becoming less precise.” Planes can activate a back-up system called Distance Measuring Equipment, which had been the standard before GPS became commonplace. The pilot said he has never been lost because of jamming or spoofing; however he has been “slightly off track” and had to ask air traffic control for help. “That has been because of prolonged GPS loss.”\n\nIn the pilot’s region and with his company, the GPS interference phenomenon is well understood. “So we have a spoofing guide/checklist so we can prevent some follow-on effects” There can be complex situations but he said, “We always have back-up plans.” While pilots adapt, lack of GPS can have serious consequences. On Christmas Day last year, Azerbaijan Airlines Flight 8243 left Baku for Grozy in the Russian republic of Chechnya when it lost its GPS signal. Russian military forces in Grozny, on guard for Ukrainian drone attacks, had been GPS jamming the area.\n\nFlight 8243 tried to approach Grozny twice, said FrontierSI’s technical lead Eldar Rubinov. The plane lost GPS on approach to Grozny and asked air traffic controllers for guidance to the runway, he said. Loading “They tried the approach twice, but both times when they reached the decision-making height (or minimum), they were still above the clouds and couldn’t establish a visual contact with the runway.” “After the second attempt, they indicated to the air traffic control, that they cannot land and they are returning to Baku, and that’s when they got shot by an anti-aircraft missile.” The pilots mistook the sound of the missile hit for birdstrike. The plane crashed, killing 38 people while 29 survived with injuries.\n\n“If they had GPS, their minimum would be much lower, so they could’ve descended below the clouds without any issues,” said Rubinov, who audited the plane’s blackbox recording. The lack of GPS was a contributing factor to the crash, Rubinov said. In response to the growing problem of GPS interference, IATA along with the European Union Aviation Safety Agency last month proposed several solutions: standardising radio calls for GPS interference, establishing monitoring and warning practices, and facilitating information sharing. The groups also advocate for restrictions on jamming devices, though the effectiveness of such restrictions is questionable in regions like Russia’s Kaliningrad, a major jamming hotspot, or in Israel. Another potential solution for commercial flights is a controlled reception pattern antenna (CRPA). This technology can detect and completely block interfering signals from a specific direction, making it almost unjammable.",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/article/cultured-meat-explained/j7civ5efc",
    "title": "Cultured meat is now on the menu at Australian restaurants — but what exactly is it?",
    "publish_date": "Sat, 12 Jul 2025 01:17:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "It's the weekday lunch rush and diners at Kitchen by Mike, a popular restaurant in the Sydney CBD, are among the first in the country to try a curious new cuisine.\n\n\n\n\n\nAcclaimed chef Mike McEnearney's much-loved sourdough bread is now being served with what's known as \"cultured Japanese quail spread\".\n\n\n\n\n\n\"The cultured quail is folded through the butter. If you like strong chickeny quail flavours, it's in the texture of butter on bread. It's delicious, it's almost like pâté,\" McEnearney said.\n\n\n\n\n\nBut what makes it so unique?\n\n\n\n\n\nWell, the quail meat in the butter did not come from a farm; rather, it was produced in a factory in the inner Sydney suburb of Alexandria, about a 20-minute drive from the restaurant.\n\n\n\nChef Mike McEnearney's popular sourdough bread is now being served with cultured quail compound butter at a restaurant in Sydney. Source: SBS News Cultured meat is the process of taking a small number of cells from an animal, in this case, a quail, and growing them in a controlled environment to eventually produce a type of meat product.\n\n\n\n\n\n\"[It's] my first time in 35 years of cooking that I've seen a new category come to market. It's really exciting. It is brand new food,\" McEnearney said.\n\n\n\n\n\nAnd the verdict from diners?\n\n\n\n\n\nAngelo, a regular customer, described it as \"delicious\".\n\n\n\n\n\n\"I'd say it's pretty adventurous. It's quite new in the industry, so I'm glad to have tried it,\" he said.\n\n\n\n\n\n\"I really like the innovative nature of it, and I think I'd be really happy to see it more on menus,\" another patron, Benjamin Heenan, told SBS News.\n\n\n\nCultured meat: From cells to steak\n\nFrom hatted restaurants to pubs, around a dozen restaurants across Australia have started serving the cultured quail. About a dozen more will have it on their menu by the end of the month.\n\n\n\n\n\nThe product is the brainchild of Australian start-up Vow, which in June became the first company in the country to receive approval to sell cultured meat.\n\n\n\nIt follows a more than two-year approval process by the food safety regulator, Food Standards Australia New Zealand.\n\n\n\n\n\nEllen Dinsmoor, Vow's CEO, insists the company is not trying to replace meat.\n\n\n\n\n\n\"What we make is very unique in that it's not plant-based, we're not trying to recreate beef and other meats we eat today. We're taking different cells from other animals, growing those and then using them to make new food products,\" she told SBS News.\n\n\n\n\n\nDinsmoor said the quail cells are grown in a bioreactor, which is essentially a large stainless steel tank, similar to those found in a brewery.\n\n\n\n\n\n\"We take actual cells from animals and we grow them in what I think of as a nutrient broth. At the end of the day, you can harvest those cells out,\" she explained.\n\n\n\nVow's CEO, Ellen Dinsmoor, said the company is not trying to replace regular meat, but is using unique ways to create new products. Source: SBS News \"Maybe imagine that if you're making cheese and you are taking some of the whey off the top, that's kind of what it looks like,\" Dinsmoor said.\n\n\n\n\n\nWhile the product only made its debut in Australia this month, it has been available in Singapore for the past year — the first country globally to approve the sale of cultured meat.\n\n\n\nWhy grow food in a factory?\n\nPaul Wood, an adjunct professor in biotechnology at Monash University, said: \"Well, for some people, it's because they don't want to see animals harmed. For others, it's an environmental thing. They believe that this is going to be a more sustainable way of producing food.\"\n\n\n\n\n\n\"Some just say it's a new food experience. So there's a range of ways that it's being sort of marketed to people,\" he said.\n\n\n\n\n\nBut Wood said until the industry scales up significantly, it remains unclear whether it will be more sustainable than farming.\n\n\n\n\"It will use less land. It's a factory. It'll probably use less water. But we already know that on an energy basis, it's unlikely to be more sustainable because it's quite an energy-intensive process,\" Wood said.\n\n\n\n\n\n\"So you really need to be using totally renewable energy. And even then, if you compare it to growing an animal in a paddock, it's still a hell of a lot more intensive.\"\n\n\n\n\n\nHe said cost is another challenge, and when it comes to nutrition: \"It's unlikely, I think, to be better than a piece of meat.\"\n\n\n\n\n\nBut others believe the industry has a role to play in addressing future food challenges.\n\n\n\n\n\nAccording to the United Nations Food and Agriculture Organization, agricultural production will need to increase by approximately 60 per cent to meet global food demand by 2050.\n\n\n\nThe animal cells are grown inside a large stainless steel tank in what Vow describes as a \"nutrient-dense broth\". Credit: Supplied / Vow Sam Perkins is the CEO of Cellular Agriculture Australia, a not-for-profit that aims to advance cellular agriculture, a process that utilises cells and innovative biotechnologies to produce new ingredients, food and agricultural products.\n\n\n\n\n\n\"It's widely recognised that we're not going to be able to do that sustainably using existing methods alone,\" he said.\n\n\n\n\n\n\"We see cellular agriculture and the technologies that sit within it as a way of complementing existing food supply chains … where the technologies offer the potential to reduce greenhouse gas emissions, reduce land use and reduce water use, whilst also building resilience, particularly around things like climate shocks or supply chain disruptions.\"\n\n\n\n\n\nThe technology is being harnessed to make everything from coffee to palm oil, leather and chocolate.\n\n\n\n'Frankenstein meat'\n\nThere are calls for better investment in the industry as countries take steps to ban the sale and consumption of cultured food, including Italy, France, and some states in the United States. Concerns over quality and the threat to farmers are among the issues driving the pushback.\n\n\n\n\n\nThe Italian farm lobby has previously labelled cultured meat \"Frankenstein meat\".\n\n\n\nPerkins said misconceptions are feeding \"unhelpful narratives\" about the industry.\n\n\n\n\n\n\"One thing we hear a lot is references to things like lab-grown meat. Cell ag products aren't produced in labs, even if the original technology was developed by scientists. They're made in food manufacturing facilities that look far more like breweries than they do a science lab,\" he said.\n\n\n\n\n\nBut the industry has a long way to go.\n\n\n\n\n\nVow is one of only three companies globally approved to sell cultured meat. Getting governments, investors, and consumers on board remains a challenge.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/murujuga-ancient-rock-art-gets-un-nod-for-world-heritage-listing/3nt19s61b",
    "title": "'Momentous day': Australia's ancient rock art site gets UN approval for World Heritage listing",
    "publish_date": "Sat, 12 Jul 2025 00:50:16 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "An ancient Indigenous rock art collection in Western Australia has been recognised as a World Heritage-listed site.\n\n\n\n\n\nThe Murujuga rock art landscape contains the world's largest, densest and most diverse collection of rock art engravings — known as petroglyphs — and some are estimated to be more than 50,000 years old.\n\n\n\n\n\nThey depict animals, plants and human figures, and are visible due to the colour and contrast between the removed varnish layer and the underlying brighter weathered rind of the host rocks.\n\n\n\n\n\nThe site was previously put forward to the United Nations Educational, Scientific and Cultural Organisation in 2023 but Australia's application was referred back in May.\n\n\n\n\n\nUNESCO recommended state and federal governments address concerns that nearby acid emissions, including those from Woodside's Burrup gas hub, were degrading the art.\n\n\n\nThe North West Shelf gas project is seen with a petroglyph of a turtle at Murujuga Cultural Landscape in Burrup Peninsula, Western Australia. Source: Supplied / Save Our Songlines / Conservation Council of Western Australia The peninsula in northwest WA near Karratha is home to two gas plants, a fertiliser plant and iron ore and salt export facilities.\n\n\n\n\n\nEnvironment Minister Murray Watt recently gave provisional approval for a Woodside project on the peninsula to continue operating until 2070.\n\n\n\n\n\nMardathoonera woman and Murujuga traditional custodian Raelene Cooper, who was at the UNESCO meeting, said she welcomed the global recognition of Murujuga but cautioned that industry could still harm the rock art site .\n\n\n\n\n\n“This is a momentous day for our old people and our future generations, to have Murujuga’s outstanding universal heritage values recognised by the world,\" she said.\n\n\n\nREAD MORE Surface tension: Murujuga World Heritage listing at risk from industrial emissions\n\n\"Meanwhile, fertiliser plants are still being built around our sacred sites and polluting gas plants will emit toxic acid on our rock art for another 50 years.\n\n\n\n\n\n\"We will continue to fight for protection for this very special place, and the world is now aware of what we are up against.\"\n\n\n\nWatt said in the French capital overnight, \"For more than 50,000 years, the Ngarda-Ngarli people have protected and managed this significant land and seascape — and today, I am proud to announce that Murujuga will receive another level of protection via the World Heritage system.\"\n\n\n\n\n\n\"The Murujuga nomination had the free, prior and informed consent of the five language groups who all come together to care for Murujuga today,\" he added.\n\n\n\n\n\nAustralia has 21 properties on the World Heritage list, which includes the Budj Bim Cultural Landscape, Uluru-Kata Tjuta National Park and the Great Barrier Reef.\n\n\n\n\n\nUNESCO added several other sites to its list overnight including the Xixia Imperial Tombs in China and the Faya Palaeolandscape in the United Arab Emirates.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-seven-results/xui631inx",
    "title": "Tour de France: Pogacar pounces to retake lead after stage seven",
    "publish_date": "Fri, 11 Jul 2025 21:07:16 +0000",
    "category": "sports",
    "authors": [],
    "text": "Tadej Pogacar won stage seven of the Tour de France to regain the overall lead with a trademark burst up the short, steep slope of the Mur de Bretagne.\n\n\n\n\n\nVisma's Jonas Vingegaard was second, doggedly staying right on Pogacar's wheel to the line with Briton Oscar Onley third after a late nine-rider pile-up marred the finale.\n\n\n\n\n\nOn his 19th career Tour de France stage win the 26-year-old Pogacar gained four seconds on Vingegaard with 10 bonus seconds to the Dane's six.\n\n\n\n\n\n\"It was super hot today, and super fast but we had a plan and we stuck to it,\" said the Team UAE rider who was champion in 2020, 2021 and 2024.\n\n\n\n\n\nIn the overall standings, Remco Evenepoel is second overall at 54 seconds after coming in sixth on the day, two seconds adrift.\n\n\n\nREAD MORE Think you could race the Tour de France? Explore the 2025 map and key stats\n\n\"The Tour de France isn't over yet,\" said Evenepoel, who lost time in a crosswind on the opening day before winning the stage five individual time-trial.\n\n\n\n\n\nFrench starlet Kevin Vauquelin continues his bright run in third at 1min 11sec while two-time champion Vingegaard is fourth at 1min 17sec.\n\n\n\n\n\nFans cheered for Vauquelin along much of the route. On Thursday a hot-air balloon flew over the peloton with his face on it.\n\n\n\n\n\n\"All you could hear was 'Kevin, Kevin' all along the road, it's so good to have a new face competing with us,\" said Pogacar.\n\n\n\n\n\nThe overnight leader Mathieu van der Poel rounds out the top five at 1min 29sec after wilting on the final climb, the scene of his 2021 coming of age win and his first yellow jersey.\n\n\n\n\n\n\"I kind of knew I was going to lose the yellow jersey here, but it was a special occasion for me coming back here. It was a great day,\" said the Dutch rider who climbed top of the overall rankings Thursday.\n\n\n\n\n\nThe day's action revolved around two ascents of the Mur de Bretagne, a 2km climb at an average of six percent, that has been written into Tour de France folklore.\n\n\n\n\n\nWith the Tour returning to Brittany after a four-year gap, huge festive crowds packed the villages and pretty country lanes as the temperature hit 30 degrees Celsius (86 Fahrenheit).\n\n\n\n\n\nThe 179 remaining riders left Saint Malo on the north-west coast passing the magnificent Sillon beach with its granite sea wall and chic seafront buildings.\n\n\n\nInjured Almeida rides on\n\nKey Pogacar teammate Joao Almeida fell ahead of the second climb of the Mur de Bretagne, but despite sustaining a rib fracture he is due to make the start line for Saturday's flat run to Laval.\n\n\n\n\n\n\"I really hope he's okay, he's on his way for an x-ray. I'm proud of how he's been riding. He's done an amazing job. It would have been a perfect day,\" Pogacar said.\n\n\n\n\n\n\"I dedicate this victory to him,\" he added.\n\n\n\n\n\nLater UAE's team doctor Adrian Rotunno reported: \"It's confirmed he has an uncomplicated left-sided rib fracture, as well as some profound abrasions to his body. Fortunately no concussion.\"\n\n\n\n\n\nRotunno added: \"The next few days will be difficult for him, but at this point, he should be able to start tomorrow's stage.\"\n\n\n\n\n\nIn the best form of his career Almeida had been a candidate for a place on the podium in Paris, but has slipped to 12min 21sec off the pace in the overall standings.\n\n\n\n\n\nFor Bahrain Victorious their Tour de France appears massively compromised.\n\n\n\n\n\nNot only did the Australian rider Jack Haig leave the Tour after the fall 6km from the line, their leader Santiago Buitrago finished 13min down on the day and left the medical centre holding his right arm to his side.\n\n\n\n\n\nOne man who negotiated the crash well was Ireland's Ben Healy.\n\n\n\n\n\nThe sixth stage winner managed to fall sideways into the heap and roll over it, before remounting immediately to finish a respectable 26th.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-world-wants-australias-hermit-crabs-but-some-have-big-questions/7fx0yvnsq",
    "title": "The world wants Australia's hermit crabs — but some have big questions",
    "publish_date": "Fri, 11 Jul 2025 20:38:07 +0000",
    "category": "finance",
    "authors": [],
    "text": "A push to export hermit crabs from Western Australia has sparked criticism, with one political party calling to ban the trade over concerns about animal welfare and environmental impact.\n\n\n\n\n\nMerv Cooper runs Crazy Crabs in Western Australia — a business operating since 1979, specialising in the sale of Australian land hermit crabs. He sells these to Australian pet stories, and also exports them internationally to locations including Hong Kong and the United States.\n\n\n\n\n\nBut his export permit expired late last year and the federal Department of Climate Change, Energy, the Environment and Water (DCCEEW) is now assessing a three-year extension — a move the Animal Justice Party says would be \"reckless and short-sighted\".\n\n\n\n\n\nSBS News attempted to contact Cooper for comment but he was unavailable.\n\n\n\n\n\nExperts say it's difficult to know whether harvesting the crustaceans is sustainable, due to regulatory gaps in Australia's hermit crab trade.\n\n\n\nA little-known industry\n\nThe species — Coenobita variabilis — is endemic to Australia, found only along the north-western coast of Western Australia and in parts of the Northern Territory.\n\n\n\n\n\nIn its proposal to the DCCEEW, Crazy Crabs said the business collects on average 30,000 crabs each. In summer, he and a small crew head out for four to six days at a time, collecting crabs at night on foot using torches and buckets. \"Really small\" crabs are left on the beach.\n\n\n\n\n\nIt says collections happen \"only a couple of times a year\" and these don't \"appear to have any detriment on populations\".\n\n\n\n\n\nBut reliable data on hermit crab harvesting is scarce.\n\n\n\nDuring a typical year, Merv Cooper collects 30,000 crabs from Western Australian beaches — which he sends off to pet shops across Australia. Source: Getty / Jamie La Australian states and territories are responsible for domestic trade, including licensing requirements. This makes it difficult to determine the exact number of active hermit crab export operators in Australia, the quantity of crabs they collect, and the potential impact of this activity.\n\n\n\n\n\nAccording to an ABC report in 2022, WA Fisheries data indicated around 80,000 land hermit crabs were collected by two active operators that year. At the time, they estimated the commercial value of a hermit crab licence to be between $1 million and $5 million.\n\n\n\n\n\nA DCCEEW spokesperson said the federal government \"strictly regulates commercial trade in wildlife and wildlife products from Australian native species, such as hermit crabs.\n\n\n\n\n\nAnimal Justice Party MPs say the application highlights a lack of scientific rigour in how such trades are assessed — and could open the door to further exploitation.\n\n\n\n\n\n\"This proposal is a stark example of the federal government's failure to uphold rigorous scientific and environmental standards,\" said Victorian upper house MP Georgie Purcell,\n\n\n\n\n\n\"Allowing the commercial export of a native species without comprehensive ecological assessments is reckless and short-sighted.\"\n\n\n\n\n\nWA upper house MP Amanda Dorn said she is concerned that if the trade is allowed to continue with little regulation, \"fragile ecosystems\" could be \"irreversibly\" damaged.\n\n\n\n\n\nIn its proposal, Crazy Crabs said WA's Department of Primary Industries and Regional Development does not consider Coenobita variabilis to be in need of formal management plans for protection.\n\n\n\n\n\nIt said the number of crabs and the locations where they were collected are reported monthly, as required by state licensing laws.\n\n\n\n\n\n\"I have been collecting Hermit crabs for over 50 years and have never seen any need for restrictions,\" the proposal reads.\" I don’t go to all places every year, hence there is always plenty of hermit crabs.\"\n\n\n\n\n\nTim Nichols, a manager at WA Fisheries, told the ABC in 2022 the species was abundant and their population was unlikely to be affected by the current level of fishing.\n\n\n\n'Relying on self-reporting': Expert raises concerns\n\nKim Feddema, a wildlife trade expert and lecturer at Edith Cowan University, said the trade relies heavily on licence-holders to assess their own environmental impact, with no baseline population data or independent monitoring.\n\n\n\n\n\n\"We need to understand how many hermit crabs are actually in those locations and what role they play in the broader ecology,\" she told SBS News. \"Without baseline data, there's no way to judge the sustainability of this kind of trade.\"\n\n\n\n\n\nWhile the international export of native species is subject to federal regulation, hermit crabs are not formally listed as protected. Invertebrates often fall through regulatory gaps, Feddema said, because they're harder to monitor and traditionally not perceived as sentient.\n\n\n\nKim Feddema, a wildlife trade expert, said more regulation is necessary in the industry to ensure the welfare of hermit crabs and to understand the environmental implications of their removal. Credit: Stephen Heath / Edith Cowan University Globally, land hermit crabs are harvested for both the pet and shell trade. While shells are often sold as decorations, Feddema notes they once housed live animals.\n\n\n\n\n\n\"People often perceive [shells] to be empty, but there is a live animal within them before that stage,\" she said.\n\n\n\n\n\nAcross Asia, including Thailand and Japan, this dual trade has already been linked to population declines. While Australia requires permits to collect hermit crabs at a commercial level, enforcement is limited and operators are not independently monitored.\n\n\n\n\n\n\"We're relying on self-reporting here,\" Feddema said. \"There's no verification of what's being collected or the long-term impact on local populations.\"\n\n\n\nAre hermit crabs suitable pets?\n\nHermit crabs play a vital role in their native ecosystems, Feddema said, acting as \"ecosystem engineers\". They recycle shells that would otherwise be buried by sand, creating homes for algae, sponges, and other small organisms. They also help with nutrient recycling by scavenging on waste and decaying animals.\n\n\n\n\n\nBut despite this ecological importance, hermit crabs are often marketed as low-maintenance pets — sold in pet stores and online — a characterisation Feddema said is misleading.\n\n\n\n\n\nShe said in the wild, they can live for over thirty years. In captivity, however, their lifespans are often significantly shortened — sometimes surviving only a few months or years. She compared the industry to the \"cut flower trade\", where high mortality rates are treated as inevitable.\n\n\n\n\n\n\"People sometimes treat pets the same way they treat cut flowers — that they'll have them for a short period of time and then accept a certain level of mortality,\" she said.\n\n\n\n\n\nIn its proposal, Crazy Crabs said its experience in taking, holding and transporting hermit crabs \"has reduced the mortality rate during transit to practical zero for the last ten years\".\n\n\n\nDemand for rare and large individuals is also growing, raising concerns about overharvesting ecologically important crabs that produce a high number of offspring.\n\n\n\n\n\nStudies have shown hermit crabs exhibit signs of sentience, including problem solving, memory and a response to pain — which Feddema said challenges assumptions that invertebrates do not require additional welfare standards.\n\n\n\n\n\n\"There is a question about how appropriate they are to be held in captivity,\" she said. \"If the owner doesn't have the particular needs and they're not able to recognise the complexity of owning a hermit crab.\"\n\n\n\n\n\nShe said reforms are urgently needed to assess population health and establish long-term data.\n\n\n\n\n\n\"It is very possible that this is a trade that is sustainable, but we just can't make that decision without the data behind it.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/video/im-more-than-chocolate-indigenous-entrepreneurs-see-stronger-demand-and-increased-exports/z7m4wuimv",
    "title": "'I'm more than chocolate': Indigenous entrepreneurs see stronger demand and increased exports",
    "publish_date": "Fri, 11 Jul 2025 09:31:59 +0000",
    "category": "finance",
    "authors": [],
    "text": "'I'm more than chocolate': Indigenous entrepreneurs see stronger demand and increased exports\n\nPublished 11 July 2025, 8:08 am\n\nSome Indigenous businesses are seeing stronger demand for their products and an increase in exports to other countries. It comes as a landmark report says they create more than $40 billion in social value each year, helping to progress Closing the Gap targets and leading to better mental health outcomes, and better connection to culture and country.",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/what-are-the-withdrawal-effects-of-antidepressants-a-new-review-explores-the-issue/kfk1ujnuh",
    "title": "What are the withdrawal effects of antidepressants? A new review explores the issue",
    "publish_date": "Fri, 11 Jul 2025 08:45:14 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\n\"I was initially quite resistant to any kind of medication, but I got a point a couple of years ago, I got to a point where I was really struggling with suicidal thoughts and just being able to function and do things because of my mood, and all of these horrible feelings and thoughts I was having, and finally got convinced to try Sertraline. And it definitely fairly immediately actually I noticed that I felt quite numb.\"\n\n\n\n\n\nKizzy, who is an Allied Health professional is someone who engages with BEING Mental Health Consumers, an organisation advocating for people with lived experience of mental health issues.\n\n\n\n\n\nShe says she never wanted to be reliant on anti-depressant medications, and has come off it twice now in the past.\n\n\n\n\n\n\"My hope is that I can one day be not require antidepressants and still maintain this level of functioning and mental health I guess, and continue to improve, especially because there are still, for example, because it potentially affects my liver, like this current medication, I can't consume any alcohol, which is a healthy thing.\"\n\n\n\n\n\nA new review by academics published in JAMA Psychiatry examines antidepressant withdrawal symptoms.\n\n\n\n\n\nThe international team of researchers analysed a large amount of data from over 50 studies involving more than 17,000 patients.\n\n\n\n\n\nThe review found study participants who discontinued antidepressants experienced more symptoms - compared to those discontinuing placebo or continuing an antidepressant.\n\n\n\n\n\nDr Ramya Raman is the Vice President and Western Australia Chair at the Royal Australian College of GPs.\n\n\n\n\n\nShe says the decision to start and stop anti-depressants is a shared decision-making between patients and health professionals.\n\n\n\n\n\n\"We look at how long a patient has been well and how their mood is actually going, what are some of the other factors that might be contributing to their current circumstances? What are their support systems around? Are they seeing a psychologist? Do they have other therapy in place for example with cognitive behavioural therapy or interpersonal skills training with their psychologist? And if they're doing really well with all of those and the patient actually says, I've been on these medications, I'm seeing the psychologist, I'm feeling a lot better, there's improvement, my family's telling me that there is improvement, I feel much better. My work has improved, my physical wellbeing has improved.\"\n\n\n\n\n\nAntidepressants are some of the most commonly prescribed medications globally and in Australia.\n\n\n\n\n\nLong-term use of the medication - that is longer than 12 months - is rising, and with it the understanding of the greater risk of harm.\n\n\n\n\n\nNew resources have been developed to support safely stopping the use of antidepressants over time usually months, through what's called a tapering plan.\n\n\n\n\n\nThe review published in JAMA Psychiatry included 38 studies which had an observation period longer than two weeks, the critical time frame during which withdrawal symptoms are expected to occur.\n\n\n\n\n\nThe review found withdrawal symptoms - such as dizziness, nausea, vertigo - occur in a minority of cases, but they are on average typically not severe and manageable, especially with proper clinical support.\n\n\n\n\n\nDr Raman says while there is room for further research on symptoms over a longer time period, the insight is useful for GPs.\n\n\n\n\n\n\"In other words a weaning off of the medication and there is a trusted relationship with the GP in a regular follow up with that doctor, the risk of having the discontinuation symptoms are less the concern though when patients actually abruptly stop it. So the symptoms can include brain fogginess, dizziness, nausea, sometimes headache and sleep disturbances and of course mood changes and irritability can occur.\"\n\n\n\n\n\nSonya Morrissey is the National GP Advisor at Headspace, a platform supporting the mental health and wellbeing of younger people.\n\n\n\n\n\nShe says there is a growing understanding of how to support patients in their tapering plans - as they withdraw from using antidepressants\n\n\n\n\n\n\"In the past, we would've not really talked to young people that we were prescribing antidepressants about the possibility of discontinuation symptoms. But it is something that we are, I think, recognising more and there's lots more research being done now, which is great, although there's not a significant amount of research yet in the cohort that we see, which is the 12 to 25 year olds. So that is a bit of a gap.\"\n\n\n\n\n\nShe says antidepressants are not their first line of treatment at Headspace, but will be used occasionally, if needed.\n\n\n\n\n\n\"In the cohort that we see at Headspace, which is young people age 12 to 25, antidepressant medication is not considered first-line treatment, for example, for anxiety disorders or for depression because they would be the psychological therapies and other supports. But for some young people who experience symptoms that either don't respond to those therapies or that are severe enough to be really impacting function, we will sometimes use antidepressant medication.\"\n\n\n\n\n\nProfessor Paul Fitzgerald is the Director of the School of Medicine and Psychology at Australian National University, who is also a part of the Royal Australian and New Zealand College of Psychiatrists.\n\n\n\n\n\nHe was not involved in the review.\n\n\n\n\n\nHe says it is important to be aware of the more severe cases of side effects.\n\n\n\n\n\n\"There are some unusual symptoms that patients experience. The most dramatic one the patients find quite disturbing is the phenomena that patients often talk about as Brain Z. They get this very strange sensation of electrical Z in their head or down their spinal cord, and if they haven't been warned about it, it can be quite distressing. It just seems strange.\"\n\n\n\n\n\nHe says it's unclear from this latest review whether the symptoms are from their condition - or from discontinuation of antidepressant medication.\n\n\n\n\n\n\"What happens when somebody's stopping a medication and their underlying symptoms of their condition get worse? In other words, start to experience more depression or more anxiety, and it can be really difficult to know under those circumstances. Are those symptoms that they're experiencing some sort of discontinuation or is it really just the symptoms of the illness coming back because the treatment's been withdrawn?\"\n\n\n\n\n\nAs a young adult in her mid-thirties, Kizzy says it can be challenging navigating the use of antidepressants and the withdrawal process.\n\n\n\n\n\nBut she's found a way to use her voice and advocate to people who may be in a similar situation as her.\n\n\n\n\n\nShe says what can make a big difference is finding a GP with an interest in mental health.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/asx-down-after-trump-announces-canada-tariffs/seyytykug",
    "title": "ASX down after Trump announces Canada tariffs",
    "publish_date": "Fri, 11 Jul 2025 08:21:53 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/albanese-trip-to-china-could-be-good-for-both-nations-economies-evening-news-bulletin-11-july-2025/ahywnaqmk",
    "title": "Albanese trip to China could be good for both nations' economies | Evening News Bulletin 11 July 2025",
    "publish_date": "Fri, 11 Jul 2025 06:09:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nFinancial experts say Prime Minister Anthony Albanese's visit to China will provide an economic boost for both countries.\n\n\n\n\n\nMr Albanese leaves tomorrow on a trip that includes stops in Beijing, Shanghai and Chengdu and will meet senior Chinese leaders, including President Xi Jinping.\n\n\n\n\n\nMr Albanese will be accompanied by an Australian business delegation.\n\n\n\n\n\nChina is Australia's largest trading partner, and, after a period of frosty relations, has removed around 200 billion dollars worth of trade restrictions on Australia in recent years\n\n\n\n\n\nRaymond Chan, Head of the Asian Desk at Stockbroking Wealth Management firm Morgans Financial Limited, tells S-B-S Cantonese Mr Albanese's visit is another indication of the renewed sense of certainty in the Australia-China relationship.\n\n\n\n\n\n\"This visit is seen as a positive signal because one thing important in the world of investing is certainty. When the bilateral relationship is uncertain, investors will hesitate to invest. With a more stable relationship between Australia and China it certaintly boosts sentiment. It's especially important for China because China is Australia's largest trading partner.\"\n\n\n\n\n\n+++\n\n\n\n\n\nThe Australian Competition and Consumer Commission has set up a unit to target romance scams, as reports of the scam types grow.\n\n\n\n\n\nKnown as a 'fusion cell', the unit will bring together dating and social media industry representatives as well as law enforcement and financial institutions to better understands and disrupt the scams.\n\n\n\n\n\nAustralians lost over $23 million to romance scams last year, with people from a culturally or linguistically diverse background, those with a disability, and First Nations Australians disproportionately impacted by the scams.\n\n\n\n\n\nACCC Deputy Chair Catriona Lowe tells S-B-S people are at risk when looking for love.\n\n\n\n\n\n\"These criminals are experts at targeting really lovely parts of human nature. There is nothing wrong, obviously, with wanting a new relationship, and so people who are seeking that sort of relationship are vulnerable to these sorts of scams.\"\n\n\n\n\n\n+++\n\n\n\n\n\nPolice say a German backpacker who has been missing for two weeks in Western Australia's wheat belt, likely got lost in dense bushland after her car broke down.\n\n\n\n\n\nW-A police have escalated a national search for 26 year-old Carolina Wilga yesterday, after her van was discovered about 100 kilometres north of where she was last seen in the small Wheatbelt town of Beacon.\n\n\n\n\n\nCarolina was last seen on the 29th of June.\n\n\n\n\n\nPolice say the van appears to have suffered mechanical issues.\n\n\n\n\n\n+++\n\n\n\n\n\nPolice are urging a motorbike rider who allegedly ran over a nine-year-old girl in southwest Sydney to come forward.\n\n\n\n\n\nLast night, police say the girl was playing with her friends in the park in the suburb of Rosemeadow when a rider on an unregistered dirt bike came roaring over a hill, hitting the young girl.\n\n\n\n\n\nShe was treated for facial injuries by paramedics at the scene and was taken to Westmead Children's Hospital in a serious condition.\n\n\n\n\n\nNew South Wales Police Detective Superintendent Grant Healey says police don't believe the incident was intentional but the rider needs to do right by the girl and turn himself in.\n\n\n\n\n\n\"Police are actually seeking the rider of the bike to do the right thing and come into the police station and hand themselves in. The rider would know that he hit the little girl. He did stop briefly and had a really brief conversation and rode off without helping the young child. For him to do the right thing by the little girl is to come and hand himself in to police.\"\n\n\n\n\n\n+++\n\n\n\n\n\nUS Secretary of State Marco Rubio has met with his counterparts in Southeast Asia, seeking to reassure them about the region's importance to the Trump administration, amid the fallout from US tariffs.\n\n\n\n\n\nMr Rubio joined foreign ministers of the 10-member Association of Southeast Asian Nations in Kuala Lumpur at a meeting that includes Australia, China, the European Union, Japan, Russia, South Korea and others.\n\n\n\n\n\nThe delegates have spoken about the threats facing the region as a result of these tariffs, while Russia and China are pushing for deeper ties amid the tariff resentment.\n\n\n\n\n\nMr Rubio says the Trump administration considers the Indo-Pacific a focal point of its foreign policy.\n\n\n\n\n\n“We're not abandoning those relationships. On the contrary, we want to strengthen and build upon them. And there are a bunch of other issues, and certainly trade is part of it. But there are a lot of other issues that we work together on. And we will continue to highly prioritise that. The story of the 21st century will be written in the Indo-Pacific. And the countries represented here today along with others that have joined to be a part of this, represent some not just important markets, some of the most important partners we have in the world.\"\n\n\n\n\n\n+++\n\n\n\n\n\nIn cricket, Australian fast bowler Mitchell Starc says fellow fast bowlers Josh Hazlewood and Pat Cummins deserve much of the credit for his success.\n\n\n\n\n\n35-year-old Starc will become just the second Australian fast bowler, after Glenn McGrath, to play 100 Test matches when he plays for Australia in the third Test against the West Indies in Jamaica, which starts on Sunday morning [[13th July]].\n\n\n\n\n\nStarc, Hazlewood, and Australian captain Cummins all hail from New South Wales, and have played a lot of cricket together.\n\n\n\n\n\nStarc says the trio have lifted one another at the sport's highest level.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/netanyahu-backs-trump-for-nobel-un-pressures-taliban-and-mushroom-murder-verdict/2equexmsa",
    "title": "Netanyahu backs Trump for Nobel, UN pressures Taliban and Mushroom Murder verdict",
    "publish_date": "Fri, 11 Jul 2025 05:04:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/france-and-uk-agree-to-major-deal-to-crack-down-on-undocumented-migrants/hvhfyzod5",
    "title": "France and UK agree to major deal to crack down on undocumented migrants",
    "publish_date": "Fri, 11 Jul 2025 04:00:15 +0000",
    "category": "finance",
    "authors": [],
    "text": "\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nBritish Prime Minister Keir Starmer and French President Emmanuel Macron have unveiled what they’re calling a groundbreaking returns pilot.\n\n\n\n\n\nSir Keir explains.\n\n\n\n\n\n“For the very first time, migrants arriving via small boat will be detained and returned to France in short order. In exchange for every return, a different individual will be allowed to come here via a safe route, controlled and legal, subject to strict security checks, and only open to those who have not tried to enter the UK illegally.”\n\n\n\n\n\nIt’s a one in, one out model.\n\n\n\n\n\nBritain gets to remove undocumented arrivals from its shores.\n\n\n\n\n\nIn return, it accepts vetted asylum seekers with legitimate family ties to the UK.\n\n\n\n\n\nThe scheme is expected to begin in weeks, but the numbers, at least for now, are modest.\n\n\n\n\n\nSources suggest only about 50 returns a week, or 2,600 a year, compared to more than 35,000 arrivals in 2024 and over 21,000 already this year, a record pace.\n\n\n\n\n\nThe logic is deterrence.\n\n\n\n\n\nThat’s what Mr Macron says - suggesting smugglers are exploiting legal loopholes created by Brexit.\n\n\n\n\n\n\"Simply put, it is since Brexit that the United Kingdom no longer has a migration agreement with the European Union. And so yes, for those trying to cross, there exist neither an alternative legal path to admission nor a method of readmission after a crossing. And the current situation, in reality, creates an incitement to participate in a crossing. And so it's the exact opposite or what was offered, or rather promised, by Brexit.\"\n\n\n\n\n\nHe went further, saying that Brexit left a legal void.\n\n\n\n\n\n\"We especially have to adapt our response to Brexit, and it's that the British people were sold a lie, which is that the problem was Europe. Simply put, by leaving a legal void, Brexit became the problem.\"\n\n\n\n\n\nOn one side, supporters see this meeting as a reset in UK-French cooperation after years of post-Brexit acrimony.\n\n\n\n\n\nOn the other, critics question whether it’s more show than substance.\n\n\n\n\n\nOver the past decade, more than 63,000 migrants have died or gone missing while attempting to reach Europe.\n\n\n\n\n\nThis number, recorded by the International Organisation for Migration's Missing Migrants Project, is likely an undercount due to the clandestine nature of many crossings.\n\n\n\n\n\nThe Mediterranean Sea route is particularly dangerous, with over 28,000 deaths or disappearances recorded since 2014.\n\n\n\n\n\n2023 was the deadliest year on record, with more than 8,500 fatalities.\n\n\n\n\n\nMigration analyst Mihnea Cuibus is from Oxford’s Migration Observatory.\n\n\n\n\n\nHe points to the critical issue of scale.\n\n\n\n\n\n\"The real question here is how many people can be sent back. It's a question of scale. If a large proportion of the people who arrived by small boats are sent back to France rather quickly under such a scheme, then it's very possible that there will be a deterrent effect. Again, it's about pure incentives. You're not going to get on a boat and pay thousands to a smuggler if you know there's a very high chance you'll end up on the same beach within days. But if the scheme only covers a small number of people, then it seems very difficult that will it will actually affect anyone's decision. So it it does boil down to numbers at the end of the day.\"\n\n\n\n\n\nHe also notes that the small boat crossings, now frequent, are themselves a product of earlier enforcement at ports and lorry terminals.\n\n\n\n\n\n\"A lot of people are actually arguing that the emergence of the small boats routes starting in 2017, 2018 and then ramping up was in itself a response to increased enforcement around the border to prevent lorry crossings. Essentially, it became so hard for people to cross using other means that that pressure, that demand for crossing ended up pushing the development of a new rule.\"\n\n\n\n\n\nAnd those migrants keep coming.\n\n\n\n\n\nMany are Syrian, Afghan, Sudanese, and increasingly from West and North Africa.\n\n\n\n\n\nMost have travelled thousands of kilometres, often after unsuccessful attempts to settle elsewhere in Europe.\n\n\n\n\n\nFor them, Britain is not the first option, it’s the last.\n\n\n\n\n\n\"They have had quite negative experiences on the continent. They've tried to apply for asylum in other places, to settle in other places, and they found that that they either didn't get status or weren't getting the life they expected there. And in that situation, your only option is to keep going. And if you keep going through Europe, you'll eventually end up on the north coast of France, and the UK is essentially a sort of last chance.\"\n\n\n\n\n\nTo understand how we got here, we have to look back.\n\n\n\n\n\nThe Syrian war in 2011 sparked Europe’s worst refugee crisis since World War Two in terms of the number of people displaced, around 14 million people.\n\n\n\n\n\nUNHCR says over a million Syrians reached the EU after the start of that war.\n\n\n\n\n\nRussia’s 2022 invasion of Ukraine also triggered another wave.\n\n\n\n\n\nAccording to the UN more than six million Ukrainian refugees are registered in Europe - unlike many from the Middle East and Africa, a disparity criticised by rights groups.\n\n\n\n\n\nToday, Europe’s stance is hardening again.\n\n\n\n\n\nGreece is set to suspend asylum claims from arrivals via Libya and North Africa.\n\n\n\n\n\nMigration Minister Thanos Plevris had this to say:\n\n\n\n\n\n\"So, from now on, the road for illegal migrants is go to jail or go back to their country.... The message is clear: stay where you are, you are not welcome here.\"\n\n\n\n\n\nMr Plevris argues the move is necessary to deter what he calls an invasion.\n\n\n\n\n\nBut human rights groups warn the bill violates both EU and international law, stripping people of the right to seek protection.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/albanese-talks-up-the-importance-of-engagement-with-china-midday-news-bulletin-11-july-2025/vzrgx98sr",
    "title": "Albanese talks up the importance of engagement with China | Midday News Bulletin 11 July 2025",
    "publish_date": "Fri, 11 Jul 2025 02:09:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nPrime Minister Anthony Albanese is emphasising the importance of engaging with China.\n\n\n\n\n\nHe will embark on a six-day visit to the country, starting tomorrow [[Saturday]], and will meet with the country's leadership, including President Xi Jinping.\n\n\n\n\n\nMr Albanese says the face-to-face meetings are important on multiple fronts\n\n\n\n\n\n\"Engaging in our national interest is important for our security, to be able to raise issues one-on-one with the Chinese leadership. But of course it is important for our economic interests as well.\"\n\n\n\n\n\nMr Albanese will be accompanied by business leaders, as he tries to further enhance trade ties between Australia and China.\n\n\n\n\n\n25 per cent of Australian exports go to China, making it by far Australia's most significant trading partner.\n\n\n\n\n\n+++\n\n\n\n\n\nConcerns are being raised that the new national plan to combat antisemitism in Australia could stifle free speech.\n\n\n\n\n\nOne recommendation made to the federal government by antisemitism envoy Jillian Segal is to strip funding from organisations that fail to address hatred against Jews.\n\n\n\n\n\nSome, including the National Union of Students and the Australian Jewish Council, are worried that hurt those making legitimate criticism of Israel, particularly admidst the current conflict in the Middle East.\n\n\n\n\n\nSpeaking with SBS Arabic, a Board Director of Palestine Australia Relief and Action, Reem Borrows, is concerned advocacy for Palestinians will be deemed antisemitic.\n\n\n\n\n\n“Let’s be very clear; we unequivocally condemn any form of racism. For context, antisemitism is not a Palestinian construct. The Palestinian struggle has always been about freedom, dignity, and equal rights, not just for ourselves but for all people. So it is deeply troubling to see legitimate criticism of the Israeli government, especially regarding Gaza, being conflated with antisemitism.”\n\n\n\n\n\nMs Segal says these concerns are misplaced, and only those calling for the elimination of the state of Israel will be deemed to be antisemitic.\n\n\n\n\n\n+++\n\n\n\n\n\nThe Prime Minister says he will not be providing the reasoning behind a 62 year-old Palestinian woman being detained as a national security risk.\n\n\n\n\n\nA document seen by SBS News revealed national security agency ASIO [[ay-zee-oh; Australian Security Intelligence Organisation]] assessed Maha Almassri to be \"directly or indirectly a risk to security\".\n\n\n\n\n\nHer family has told SBS Arabic Ms Almassri lost family members, before fleeing Gaza.\n\n\n\n\n\nHer brother Solomon has condemned the government for detaining Ms Almassri, who he describes as a harmless old woman.\n\n\n\n\n\n\"They just came a bunch of police officers and some federal police and they just stormed the house and they had a search warrant. And they terrorised everyone inside the house.\"\n\n\n\n\n\nHe was not present when she was arrested at another family member's home yesterday [[10 July]].\n\n\n\n\n\nAustralia's Migration Act grants the Home Affairs Minister — or a chosen delegate — the right to cancel a person's visa on character grounds if it is deemed to be \"in the national interest\".\n\n\n\n\n\n+++\n\n\n\n\n\nMembers of the Bosnian community in Australia have gathered to mark the Srebrenica [[shreb-ra-nitz-uh]] Massacre, on the anniversary of the tragedy.\n\n\n\n\n\nIn 1995, more than 8000 Bosniak Muslim men and boys were killed near the town of Srebrenica in Bosnia and Herzegovina.\n\n\n\n\n\nThe international court of justice has since recognised the event as an act of genocide - the worst since the second world war.\n\n\n\n\n\nSelma Music [[mew-sitch]] is a clinical psychologist who lost a parent in the Bosnian War.\n\n\n\n\n\nDr Music has told SBS Bosnian coming together to remember the event helps survivors and loved ones of those who died cope.\n\n\n\n\n\n\"For various reasons, including that we share together the experiences of what has happened, but also that we alleviate a little bit of the pain and suffering that we carry with us every day.\"\n\n\n\n\n\nMany families still don't know what happened to their loved ones in Srebrenica, with around 1000 people missing since the atrocity.\n\n\n\n\n\n+++\n\n\n\n\n\nPolice are treating a fire at a Sydney childcare centre in the early hours of this morning [[11 July]] as suspicious.\n\n\n\n\n\nPlay to Learn in Turramurra on Sydney's upper-north shore was set alight, with the directors alerted around four thirty in the morning.\n\n\n\n\n\nThe centre's operations manager, Gemma Quinlan, has told Channel Nine she has no idea why the centre was targeted.\n\n\n\n\n\n\"We're here to serve the community, we're here for our families and our children. We've been operating for 19 years on the Central Coast and have an amazing reputation up there. We have generations of families who have been through Play to Learn and this has never happened to Play to Learn before. We are absolutely dumbfounded and it just hurts.\"\n\n\n\n\n\n+++\n\n\n\n\n\nOn World Population Day, which is today [[jul 11]], experts are urging state and federal governments to use the challenge of an ageing population as an opportunity to develop transport infrastructure.\n\n\n\n\n\nDr Sohani Liyanage is a Research Fellow in Sustainable Transport at Swinburne University of Technology who spoke with SBS Sinhala.\n\n\n\n\n\nShe says the nation needs to move beyond building more roads and concentrate on developing public transport networks, especially those living in less-connected areas.\n\n\n\n\n\n\"Many people in outer suburban areas face longer travel times, fewer options and higher transportation costs. So, the government needs to invest not just in services, but the things like lower fairs, paid passes and safe bike lanes. And more accessible stops and stations. \"\n\n\n\n\n\n+++\n\n\n\n\n\nU-S President Donald Trump says he'll impose a 35 per cent tariff on goods from neighbouring Canada- and is threatening to make the rate even higher if Canada retaliates.\n\n\n\n\n\nThe tariff will go into place on the 1st of August, much like Mr Trump's proposed tariffs against Brazil, and other countries.\n\n\n\n\n\nBut Brazilian President Lula da Silva has not been cowed by Mr Trump's threats against retaliation, saying he will impose reciprocal tariffs on U-S goods if a diplomatic solution cannot be found.\n\n\n\n\n\nMr Trump has threatened 50 per cent tariffs on Brazilian goods, and has linked his decision on tariffs against the country to the treatment of former Brazilian President Jair Bolsonaro, who is on trial on charges of plotting a coup against Mr da Silva in 2023.\n\n\n\n\n\n+++\n\n\n\n\n\nIrishman Ben Healy has won the sixth stage of the Tour de France, becoming the first Irishman in five years to win a stage at the world's most-famous cycling event.\n\n\n\n\n\nHealy says winning the 201.5 kilometre stage from Bayeux to Virie Mormandie is a dream come true.\n\n\n\n\n\n\"To grow up watching the Tour and one day wishing that I could maybe even be there so to even be here is an achievement, and now to win a stage, is just yeah, so, so, so amazing.\"\n\n\n\n\n\nMichael Storer finished third- the best finish by an Aussie in the race so far this year.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.theage.com.au/sport/johnson-becomes-undisputed-champ-20250712-p5mefa.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Johnson becomes undisputed champ",
    "publish_date": "Sat, 12 Jul 2025 11:39:45 +1000",
    "category": "finance",
    "authors": [],
    "text": "Johnson becomes undisputed champ\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/national/lyon-could-be-dropped-cummins-reveals-20250712-p5mef6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Lyon could be dropped, Cummins reveals",
    "publish_date": "Sat, 12 Jul 2025 10:04:34 +1000",
    "category": "finance",
    "authors": [],
    "text": "Lyon could be dropped, Cummins reveals\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/business/companies/kylie-jenner-helped-this-gadget-go-viral-now-the-firm-s-founder-is-a-billionaire-20250708-p5mddf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Kylie Jenner helped this gadget go viral. Now the firm’s founder is a billionaire",
    "publish_date": "Sat, 12 Jul 2025 10:00:00 +1000",
    "category": "finance",
    "authors": [
      "Yoojung Lee"
    ],
    "text": "In a 15-second TikTok clip that has racked up millions of views, Kylie Jenner glides a sleek device across her face, swearing by its ability to help skin absorb serums more effectively. Dubbed the Booster Pro, the gadget’s video has gone viral – and with it, the fortunes of its maker, APR Corp, a once-obscure Seoul-based start-up now at the centre of the K-beauty boom.\n\nBehind the firm is 36-year-old Kim Byung Hoon, a tech entrepreneur-turned-beauty mogul whose company has made him South Korea’s newest billionaire. His 31 per cent stake in APR is now worth about $US1.3 billion ($2 billion), according to the Bloomberg Billionaires Index, after the firm’s shares soared 200 per cent this year.\n\nKim in a video on social media showing the effects of APR’s facial gadget. Credit: IInstagram, @byunghoon_victor_kim\n\nKim started out dabbling in mobile apps – including a dating app – after studying in California as an exchange student more than a decade ago. It was there that he first witnessed the smartphone revolution and got hooked on entrepreneurship.\n\nHis pivot to skincare came in 2014 when he launched APR, initially focused on cosmetics. In 2021, the business expanded into producing high-tech facial devices that promise spa-like treatments at home. It’s a product line that Kim personally espouses – he uses APR’s facial gadget for 30 minutes every day, APR’s chief financial officer, Shin Jae Ha, told Bloomberg News.",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/sport/unless-the-wallabies-were-playing-possum-lions-may-be-in-for-a-feast-20250711-p5me5f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Unless the Wallabies were playing possum, Lions may be in for a feast",
    "publish_date": "Sat, 12 Jul 2025 09:33:00 +1000",
    "category": "sports",
    "authors": [
      "Paul Cully"
    ],
    "text": "The loss of Wallabies No.10 Noah Lolesio, a shattering blow for him and a worrying time for his family, leaves a big hole.\n\nLolesio could never quite succeed in one of Australian rugby’s most pointless pursuits – finding a saviour at No.10 – and judging by Nathan Cleary’s latest State of Origin series, you can put a line through that name as well.\n\nLolesio’s degree of familiarity with Joe Schmidt’s structured style of play is going to be hard to recreate, especially for a player coming in from outside the group.\n\nJames O’Connor, the 35-year-old new man in the squad, will offer some hard-won experience, but he started one game for the Crusaders this year, and they got pumped 45-29 by Moana Pasifika in Christchurch. There are no easy answers.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/business/companies/air-india-crash-report-puts-focus-on-actions-of-pilots-20250711-p5me9w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Air India crash report puts focus on actions of pilots",
    "publish_date": "Sat, 12 Jul 2025 09:30:11 +1000",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "The findings could explain why the aircraft’s emergency-power generator, known as a ram air turbine, appeared to have been activated moments before it plummeted to the ground. “At this stage of investigation, there are no recommended actions to Boeing 787-8 and/or GE GEnx-1B engine operators and manufacturers,” India’s Aircraft Accident Investigation Bureau said. Family members and relatives of Akash Patni, a victim of the Air India plane crash, grieve during his funeral procession in Ahmedabad last month. Credit: AP Air India released a statement on the report, saying on X it was cooperating with Indian authorities as the investigation continues. The airline wrote on X that the airline “stands in solidarity with the families and those affected”. It did not address specific findings in the report.\n\nBoeing and GE Aerospace did not respond immediately to requests for comment. The agency, an office under India’s civil aviation ministry, is leading the probe into the world’s deadliest aviation accident in a decade. Air India flight 171 crashed on take-off from Ahmedabad, killing all but one of the 242 passengers and crew on June 12, along with 19 people on the ground. The cause has remained a mystery. A retired captain with experience flying wide-body aircraft said an accidental shift in the fuel switches would be impossible. “If you lift the fuel control switches, it’s a double action. So you have to lift them and pull them rearwards – that will cause the engine to shut down pretty well immediately,” the former captain said.\n\nThe switches have to be lifted up and then pulled over a detent, or a catch in the slot, which locks them into position, said the former captain, who noted that a plane cannot take off with switches in an off position. “The only time you would use those switches as part of a shutdown on restart checklist, you would attempt to recycle to start switches on the engine to cause the engine to ‘re-light’ (as we say in the business),” the retired captain said. The tail of the Air India plane became wedged in the dining hall of a medical students’ hostel. Credit: Getty “I can assume, possibly, that one or other pilots turn both fuel control switches off just before the crash in order to minimise the fire risk, but that’s only an assumption, and it’s an extreme assumption.\n\nLoading “In the absence of a direct suicide attempt by one or the other of the pilots – and there’s no indication of that – I can’t see why the switches would’ve been turned off. “They certainly wouldn’t have been turned off inadvertently. “You cannot bump those switches and inadvertently drag them aft. Nor can you do that to both. You have to individually grab the switch and rotate it to the after position to stop the engine.” There are only two reasons they would have turned off the engines, the retired captain said, one would be a “frantic attempt” to get the engines to restart.\n\nLoading “But the engine would take 30 to 45 seconds to spool back up,” the ex-captain said. The other possibility was “that they knew they were going to crash, so they just shut the switches to minimise their total fire risk”. “If they did that, they were very brave and confident men and thinking about what they were doing right to the end.” Catastrophic crash\n\nThe Boeing 787 Dreamliner, bound for Gatwick in Britain, lost altitude almost immediately after take-off, sinking and hitting buildings on the ground. The apparent dual failure of its engines has raised questions about the cause of the catastrophe. The Boeing Dreamliner has had a strong safety record, and the findings of the investigation are being closely watched for fallout for the Indian airline and the US aircraft manufacturer. Asked for a comment from Boeing, the company said: “Consistent with US law and the UN International Civil Aviation Organisation protocol known as Annex 13, we will refer you to India’s Aircraft Accident Investigation Bureau for any information.” India’s aircraft accident bureau recently contradicted reports in Indian media by saying the flight black boxes had survived the crash and were expected to yield “good data”, Reuters reported.\n\nLoading Black boxes routinely record 300 parameters of information that can be parsed and compared with cockpit conversation and other sounds from the last minutes of the crash to understand what the cause was. Boeing has been beset by a number of troubles linked to previous crashes of its planes, which have raised questions about the future of the aircraft maker behemoth. An issue linked to a flawed flight control system was determined to be the cause of the Indonesian Lion Air Boeing 737 Max crash in 2018 and the Ethiopian Airlines crash of the same model in 2019. The global fleet of 737 Max aircraft was grounded. Regulators in the US have forced Boeing to slow down the production of planes while it examines its work and safety practices. The delays have weakened Boeing’s competitive position against its lone peer plane maker, Airbus. Both manufacturers have had their production levels struggle amid supply chain disruptions driven by the COVID shutdowns.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/national/detective-reveals-fresh-details-about-missing-backpackers-rescue-20250712-p5meex.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Detective reveals fresh details about missing backpackers' rescue",
    "publish_date": "Sat, 12 Jul 2025 09:00:40 +1000",
    "category": "finance",
    "authors": [],
    "text": "Detective reveals fresh details about missing backpackers' rescue\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/sport/gout-gout-reflects-on-monaco-win-20250712-p5meew.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Gout Gout reflects on Monaco win",
    "publish_date": "Sat, 12 Jul 2025 08:29:11 +1000",
    "category": "sports",
    "authors": [],
    "text": "Gout Gout reflects on Monaco win\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 14
  },
  {
    "url": "https://www.theage.com.au/national/five-injured-after-truck-crashes-into-cars-on-m1-20250712-p5meem.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Five injured after truck crashes into cars on M1",
    "publish_date": "Sat, 12 Jul 2025 07:20:05 +1000",
    "category": "finance",
    "authors": [],
    "text": "Five injured after truck crashes into cars on M1\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/world/fuel-to-both-engines-cut-off-before-fatal-air-india-flight-took-off-report-finds-20250712-p5meen.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Fuel to both engines cut off before fatal Air India flight took off, report finds",
    "publish_date": "Sat, 12 Jul 2025 07:20:05 +1000",
    "category": "finance",
    "authors": [],
    "text": "Fuel to both engines cut off before fatal Air India flight took off, report finds\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/disappointing-fitzy-defends-origin-superstar-20250712-p5meei.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "'Disappointing': Fitzy defends Origin superstar",
    "publish_date": "Sat, 12 Jul 2025 06:34:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "'Disappointing': Fitzy defends Origin superstar\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/cricket/everything-s-an-option-australia-mulling-shock-lyon-call-for-pink-ball-test-against-west-indies-20250712-p5mee9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Everything’s an option’: Australia mulling shock Lyon call for pink ball Test against West Indies",
    "publish_date": "Sat, 12 Jul 2025 06:31:26 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Kingston: Australia haven’t settled on their XI for the final Test against the West Indies in Jamaica as skipper Pat Cummins revealed “all options” are being considered, including leaving spinner Nathan Lyon out of the side.\n\nIn the previous two Tests in Barbados and Grenada, Cummins has unveiled Australia’s XI at his mandatory pre-match press conference 24 hours out from the Test.\n\nBut ahead of a day-night pink ball fixture at Sabina Park, starting on Saturday (Sunday 4.30am AEST), Cummins said Australia would take more time to decide and make sure the team had the right balance.\n\n“[There are] a few more unknowns, so we just want to have another look at the wicket and give it a bit of time and work out a team later on today,” Cummins told reporters.",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/sport/tennis/i-would-be-sad-djokovic-gives-best-indication-yet-about-retirement-plans-20250712-p5meef.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘I would be sad’: Djokovic gives best indication yet about retirement plans",
    "publish_date": "Sat, 12 Jul 2025 06:04:50 +1000",
    "category": "sports",
    "authors": [
      "Marc Mcgowan"
    ],
    "text": "Former world No.1 Novak Djokovic has given the best indication yet that he will continue playing into next year, saying he plans to contest “at least” one more Wimbledon before retiring.\n\nThe 24-time grand slam champion’s bid to match Roger Federer’s record eight singles titles at the All England club will have to wait, after he lost 6-3, 6-3, 6-4 to world No.1 Jannik Sinner in their semi-final on Friday. He has reached that stage at all three majors this year.\n\nNovak Djokovic hopes this was not his final Wimbledon appearance. Credit: Getty Images\n\nThere is constant speculation about when Djokovic will call time on a career that statistically towers over every other men’s tennis player in history, but the 38-year-old is apparently not ready to do that.\n\n“I would be sad [if that was the end], but hopefully, it’s not my last match on the centre court,” Djokovic said.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/environment/sustainability/game-changer-your-electric-vehicle-can-now-power-your-home-and-the-grid-20250702-p5mby3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘Game changer’: Your electric vehicle can now power your home and the grid",
    "publish_date": "Sat, 12 Jul 2025 05:30:00 +1000",
    "category": "finance",
    "authors": [
      "Caitlin Fitzsimmons"
    ],
    "text": "Federal Energy and Climate Change Minister Chris Bowen says the government sees plenty of potential in EVs and setting up the grid so that vehicles can be used like “household batteries on wheels”. “Our government wants to make sure that Australians can take back control of their energy bills,” Bowen says. “Whether that’s through installing a cheaper home battery, or purchasing a V2G EV, Aussie households are increasingly looking to renewable options that work for them to slash their power bills.” The Clarkes use power from their car in their home, and sell excess to the grid. Credit: Alex Ellinghausen A battery for a modern electric vehicle enabled for V2G charging is 50 to 100 kWh, while a plug-in hybrid battery starts from 20 kWh. A typical home battery is six to 10 kWh, meaning the battery in a typical EV is much more powerful than one on the side of a house. Clarke bought his Nissan Leaf in April 2023 after researching home batteries and realising that the cost per kilowatt hour of storage was significantly lower in a car. “I got a 60 kWh battery for $60,000, while a Tesla Powerwall costs $15,000 for 13 kWh,” he says.\n\nThe possibilities are enormous. When EVs become batteries on wheels, a city full of solar on rooftops and EVs in driveways becomes a distributed power plant, making it more possible to switch off the ageing coal-fired power fleet. By the early 2030s, the combined battery capacity of all EVs in Australia is likely to surpass all other forms of storage in the national energy market, including Snowy 2.0, says the Australian Renewable Energy Agency’s national road map for bidirectional EV charging. By 2050, the storage in the national EV fleet is likely to be three times higher than the total storage capacity in the national energy market. Yet, the road map notes, the capital cost of enabling vehicle-to-grid technology is a fraction of the cost to build large-scale storage. Loading Electric Vehicle Council analysis suggests EVs with V2G technology could bring down costs for everyone by reducing the need for the highest-price electricity generation and reducing the need for network augmentation to cope with the handful of days a year when the system operates at maximum capacity. The lobby group wants the government’s Cheaper Home Batteries Program, a subsidy that began on Tuesday, to extend to the V2G charging infrastructure for EVs.\n\nV2G charging requires three things. First, the vehicle needs to be capable and have it enabled. In some models, the capability is switched off or using it would void the warranty. Dr Alina Dini, head of energy and infrastructure at the Electric Vehicle Council, says three V2G-ready cars imported into Australia are the Nissan Leaf, the Mitsubishi Outlander and Cupra, while there is also the Ford F-150 Lightning made compatible with Australian V2G standards by after-market modifications by AUSEV. Second, the charger needs to be approved by the Clean Energy Council. Finally, the network must allow it and the retailer to offer pricing to support it. Things are moving rapidly. Ausgrid, the electricity distributor for much of Sydney, signalled on Tuesday that it had successfully plugged a vehicle-to-grid system into its network, enabling a two-way flow of energy that effectively turns EVs into batteries on wheels. Loading Ausgrid’s head of EVs, Nick Black, says some retailers have been early adopters, involved in testing how it would work, so there are already offers in the market.\n\nBlack says the technology will be a game changer for the grid, eventually. “We just need that EV adoption in place,” he says. “There’s still a low penetration of EVs, and we see that due to a lack of highly available public charging infrastructure.” The company is lobbying the NSW government to change the rules to allow it to directly own and maintain public EV chargers on its power poles, a proposal fiercely resisted by standalone EV-charging companies. Essential Energy, which covers 95 per cent of NSW, said V2G charging for AUSEV’s Ford F-150 Lightning was market-ready at the Smart Energy Conference in April, after a long period testing the Nissan Leaf. The power distributor and CSIRO are investigating V2G technology with other car manufacturers. Endeavour Energy, the third NSW network, has also been trialling V2G technology and said it would allow any charger approved by the Clean Energy Council.\n\nIn Victoria, the company that covers Melbourne and much of regional Victoria through ownership of Powercor, CitiPower and United Energy has been running a trial of V2G charging and is preparing to roll it out more widely. Daniel Bye, Powercor head of customer connections and requests, says the company would treat vehicle-to-grid chargers the same as any other battery connected to the network, and any charger approved by the Clean Energy Council would automatically be approved. “We’re really excited by the possibilities V2X technology offers our customers and the community,” Bye says. (The V2X term includes vehicle to grid, vehicle to home, and vehicle to load – the final one being when you can plug in appliances such as power tools or camping fridges directly into the battery.) Loading\n\nIn financial modelling by the Electric Vehicle Council, a customer in western Sydney who has an electricity plan with exposure to the wholesale price of electricity (such as Amber Electric) could earn $1000 a year by charging an EV when the cost of electricity is low and discharging to the grid between 6pm and 10pm each day. A customer with a power plan with time-of-use tariffs (such as OVO Energy) could save $500 a year by charging the EV battery when the electricity is free during the day and using it to power their appliances when the price goes up in the evening. “It’s an opportunity for something that sits statically in a driveway or a car park to be a way to help consumers not only save money but potentially even earn from it,” says Electric Vehicle Council chief executive Julie Delvecchio. “It transfoms what an electric vehicle is, from just a car to a method to support the grid, which I think is really significant.” The Clarkes already had a 10 kWh solar system, but the power bills were still about $3000 a year before they moved to Amber Electric, and the petrol for the car was $3000 a year. A year later, Francis Clarke has a credit of $400 on his electricity bill, after powering both his house and car, despite having driven 26,000 kilometres. As well as the financial rewards, Clarke is interested in the environmental benefits.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/business/companies/jamming-and-spoofing-the-threat-airlines-deal-with-everyday-20250706-p5mcw3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jamming and spoofing: The threat airlines deal with every day",
    "publish_date": "Sat, 12 Jul 2025 05:30:00 +1000",
    "category": "finance",
    "authors": [
      "Chris Zappone"
    ],
    "text": "The manipulation occurs for planes as flights pass adjacent to areas where militaries disrupt or alter GPS signals to ward off attacks, confuse hostile drones and missiles, or harass pilots. Civilian airlines flying long-haul routes, such as those between Australia and Europe, can be affected. GPS jamming, conducted by military forces, is near constant around Ukraine and parts of Russia. At any given time, the incidence of spoofing that affects commercial airspace shifts. But to give an example, in July to August 2024, the top airspace regions affected by spoofing were Cyprus, Israel, Egypt, Turkey, Russia and Pakistan, according to GPS Spoofing Workgroup report. There has been a more than 200 per cent increase in Global Positioning System loss events between 2021 and 2024, according to the International Air Transport Association (IATA). “With continued geopolitical tensions, it is difficult to see this trend reversing in the near term,” said Nick Careen, IATA’s senior vice president for operations, safety and security.\n\nSpoofing can create some strange effects in the cockpit, like being at 30,000 feet when an alarm comes on telling the pilot to immediately pull up to avoid the ground, or the clocks used by the captain and first officer no longer read the same time. An instrument can falsely indicate a plane is far from its actual location. Another pilot, who flies through affected regions, said GPS jamming now happens daily. The aircraft loses the connection to the GPS, and it flies a bit further and regains the signal again. “It’s no big deal if it’s for a limited time while en route.” GPS spoofing, while less frequent, poses a bigger problem, the pilot said. “That is much more serious if it goes haywire.” It can change the timing of clocks in the aircraft and in the worst case, it can mess with the instruments reading the position of the plane, he said.\n\nPlanes with their GPS spoofed can unexpectedly turn without air traffic control clearance, deviating from their cleared route. This can put them at risk of entering dangerous or military areas, as almost occurred in 2023 on a flight from Europe to Dubai, according to OpsGroup, an organisation of international flight operations professionals. There’s some history here. Civilian planes didn’t use GPS until after Korean Air Lines flight 007 was shot down by Soviet aircraft in 1983 after it drifted into Russian airspace. The downing of the Boeing 747-230B, amid Cold War tensions, killed 269 people, and prompted the US government to permit the US-built GPS system to be used for civilian aviation. Experts fear that the abundance of false alarms around GPS can erode a pilot’s awareness, or increase distrust of the data. A recent OpsGroup report identified loss of safe distance between other planes on the air route due to false instruments warnings as one of the safety concern arising from spoofing. Korean Air Lines: the Boeing 747-230B was shot down by a missile in 1983 after drifting into Soviet airspace. GPS became a standard navigation aid afterwards. Credit: Hansueli Krapf\n\nThe GPS Spoofing WorkGroup report also cited instances of surprise altitude climbs by planes initiated by the ground avoidance system in the cockpit. Loading There is also a longer-term effect, too. “Due to now commonplace encounters of GPS spoofing impacts, there is a gradual, insidious acceptance of increasingly higher risk at [an] organisational level,” a 2024 report concluded. “Small changes and new behaviours that were slight deviations from the normal course of events gradually become the norm, providing a basis for accepting additional deviance and, typically, higher risk.” A phenomenon known as “spoofing fatigue” is also emerging: pilots accustomed to frequent spoofing incidents simply stop reporting them.\n\nThis can lead to a normalising of risk and reduced situational awareness. Different readings on instruments in the cockpit can also cause disagreements between pilots and other crew members regarding the best course of action, clouding the decision-making needed for a safe flight. The pilot interviewed by this masthead said that when they lose GPS en route: “We basically don’t do anything unless a secondary navigation system warns that the plane’s route is becoming less precise.” Planes can activate a back-up system called Distance Measuring Equipment, which had been the standard before GPS became commonplace. The pilot said he has never been lost because of jamming or spoofing; however he has been “slightly off track” and had to ask air traffic control for help. “That has been because of prolonged GPS loss.”\n\nIn the pilot’s region and with his company, the GPS interference phenomenon is well understood. “So we have a spoofing guide/checklist so we can prevent some follow-on effects” There can be complex situations but he said, “We always have back-up plans.” While pilots adapt, lack of GPS can have serious consequences. On Christmas Day last year, Azerbaijan Airlines Flight 8243 left Baku for Grozy in the Russian republic of Chechnya when it lost its GPS signal. Russian military forces in Grozny, on guard for Ukrainian drone attacks, had been GPS jamming the area.\n\nFlight 8243 tried to approach Grozny twice, said FrontierSI’s technical lead Eldar Rubinov. The plane lost GPS on approach to Grozny and asked air traffic controllers for guidance to the runway, he said. Loading “They tried the approach twice, but both times when they reached the decision-making height (or minimum), they were still above the clouds and couldn’t establish a visual contact with the runway.” “After the second attempt, they indicated to the air traffic control, that they cannot land and they are returning to Baku, and that’s when they got shot by an anti-aircraft missile.” The pilots mistook the sound of the missile hit for birdstrike. The plane crashed, killing 38 people while 29 survived with injuries.\n\n“If they had GPS, their minimum would be much lower, so they could’ve descended below the clouds without any issues,” said Rubinov, who audited the plane’s blackbox recording. The lack of GPS was a contributing factor to the crash, Rubinov said. In response to the growing problem of GPS interference, IATA along with the European Union Aviation Safety Agency last month proposed several solutions: standardising radio calls for GPS interference, establishing monitoring and warning practices, and facilitating information sharing. The groups also advocate for restrictions on jamming devices, though the effectiveness of such restrictions is questionable in regions like Russia’s Kaliningrad, a major jamming hotspot, or in Israel. Another potential solution for commercial flights is a controlled reception pattern antenna (CRPA). This technology can detect and completely block interfering signals from a specific direction, making it almost unjammable.",
    "source": "TheAge",
    "cluster_id": 30
  }
]