[
    {
        "url": "https://www.9news.com.au/national/sydney-breaks-rain-record-for-august-as-most-of-east-coast-expects-showers-this-weekend/d070705f-a8c1-4301-ad8d-be34741fdb19",
        "title": "One city breaks rain record as East Coast expects showers this weekend",
        "publish_date": "Fri, 08 Aug 2025 22:34:10 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "S﻿ydney is experiencing the wettest August in nine years, and it's only going to get wetter today and tomorrow.\n\nThe August average for rain is usually 80mm for the entire month, but just eight days in, that record has already been broken with 98mm of rain falling across the city, as of 9am yesterday.\n\nIt marks the wettest ﻿August for the city since 2016.\n\nUnfortunately for Sydneysiders craving a little sun, this weekend will most likely bring showers and cloudy skies.﻿ (BoM)\n\nUnfortunately for Sydneysiders craving a little sun, this weekend will most likely bring showers and cloudy skies.﻿\n\nCoastal areas will see about 5mm to 15mm of rain today, with a bit less expected tomorrow.\n\nRainfall will be lighter on Sunday, as showers move inland towards the ranges.\n\nA similarly light rainfall will occur for most other areas in eastern NSW this weekend.\n\nShowers should ease into early next week as a high-pressure ridge weakens over eastern NSW.\n\nREAD MORE: ﻿ Everything you need to know about City2Surf\n\nThe August average for rain is usually 80mm for the entire month, but just eight days in, that record has already been broken with 98mm of rain falling across the city (Nine)\n\nQueensland is in for a shower or two today and tomorrow as well.\n\nThere will be cloudy skies with scattered showers and patchy rain in southeastern and Central Queensland today, which will move to the coastal fringe late in the day.\n\nIsolated to scattered showers are expected in the southern and central interior, as well as on the North and Far North Queensland Coast.\n\nCapricornia Coast and K'gari will see isolated thunderstorms.\n\nNorthwest and far west Queensland will experience mostly sunny weather today.\n\nSunday will be mostly sunny with ﻿isolated showers along the East Coast.\n\nREAD MORE: ﻿ Three charged after man shows up to ER with stab wounds to head\n\nRaindrops on a window looking out to gloomy weather in Melbourne, Australia. Shallow depth of field with focus on the raindrops. (Getty)\n\nVictoria will be cold today and tomorrow with some showers possible.\n\n﻿The far northwest and southeast have a small possibility of showers, with mostly sunny conditions expected everywhere else.\n\nMelbourne will be dry with some cloudy skies, but no rain.\n\nSunday will bring cool and foggy weather in the morning, before clearing to mostly sunny conditions.\n\n﻿Tasmania has the chance of showers in the northwest and east coast, with clear skies everywhere else today and tomorrow.\n\nSouth Australia will see ﻿isolated showers east of the ranges from the afternoon, with the rest of the state expecting a clear day today.\n\nTourists come across extraordinary sight at Uluru View Gallery\n\nRain in Adelaide this morning will continue into tomorrow with a chance of showers, before a clear afternoon.\n\nParts of Western Australia ﻿will also see some rain, especially southwest of Geraldton, stretching to Esperance.\n\nPerth has a very high chance of rain today, with thunderstorms expected from the morning and afternoon.\n\nRain is also expected on Sunday﻿ morning, with about 3 to 10mm of rain forecast.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/user-generated-content-what-is-ugc-how-brands-use-it-everything-to-know-explained/63c50d19-63d2-4699-b2ce-075ffba46e1c",
        "title": "Ashlee can make an extra $6000 a month with this simple side hustle",
        "publish_date": "Fri, 08 Aug 2025 21:11:34 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Three little letters helped Ashlee Sullens ﻿boost her monthly income by thousands of dollars.\n\nThe 29-year-old from NSW﻿ discovered user-generated content or UGC two years ago and has since worked with brands like Dove, Olay, MCoBeauty and AfterPay.\n\nNow she can earn up to $6000 a month through the social media side hustle without even leaving the house.\n\nREAD MORE: Netanyahu says Israel plans to take over Gaza\n\nAshlee Sullens is one of thousands of Aussies making bank from a growing social media side hustle. (Supplied/Ashlee Sullens)\n\nBut what exactly is ﻿UGC, how does it work, and can everyday Aussies really make money doing it?\n\nHere's everything you need to know.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nWhat is UGC and how does it work?\n\nUGC is digital ﻿content created by everyday people and/or influencers to promote products or services for brands.\n\nUGC can be used to promote everything from skincare, to restaurants, ﻿the latest tech products, and online services.\n\nBrands typically provide free products or services to UGC creators in exchange for them making content about it.\n\nSome brands also pay creators a fee to create content or to use ﻿it for advertising.\n\nCommon examples of UGC include:\n\n﻿unboxings\n\nproduct reviews\n\nskincare routines\n\nrecipe hacks\n\nREAD MORE: Grim data reveals how a global superpower is on the brink of disaster\n\nThe UGC Sullens creates is predominantly beauty, wellness and lifestyle content. (TikTok/@ugc.ashlee)\n\nWhat sets UGC apart from traditional branded content﻿ is that it's usually shot \"on a phone, in real homes, by real users\".\n\n\"UGC is relatable, cost-effective and often performs better than polished brand ads because it feels like a recommendation, not a sales pitch,\" said Felicity Grey, founder and managing director at Theory Crew﻿, a social media marketing and PR agency.\n\nIt can also help everyday Aussies make extra cash on the side.﻿\n\nSullens first noticed UGC on her social media feeds in 2023 and decided to give it a go.\n\nUsing her background in social media marketing, she started by filming videos about \"random products\" she had lying around the house on her iPhone.\n\n\"Before I knew it, I had brands reaching out to work together,\" she told 9news.com.au.\n\nThe ﻿brand deals started small but were a great boost to her part-time income.\n\nWant a pay rise? These jobs experienced the fastest salary growth this year View Gallery\n\nTwo years on, she's working for herself full-time and can earn anywhere between $2000 and $6000 per month making UGC.\n\nThere are challenges, like when one brand \"ghosted\" her without payment after she made content for it, but Sullens said the perks outweigh the pitfalls.﻿\n\n\"I love the flexibility and time freedom the most,\" she said.\n\nWhat role does UGC play in social media?\n\nMost of the estimated 20 million Aussies﻿ who use social media have seen a UGC ad, though they may not have realised it.\n\nUnlike traditional brand﻿ ads, UGC is designed to feel authentic and relatable.﻿\n\nThat's because it's created by everyday people rather than a marketing team.\n\n\"As audiences crave more real and relatable content and become better at spotting overly polished ads, the shift towards authenticity has become impossible to ignore,\" Grey said.\n\n\"And we know UGC ads consistently outperform branded ones.\"﻿\n\nREAD MORE: How to maximise public holidays and make the most of your annual leave in 2025\n\nFelicity Grey is the founder and managing director at Theory Crew, a social media marketing and PR agency. (Theory Crew)\n\nHow did UGC become popular?\n\nUGC may seem like a new trend but it has been slowly growing for over a decade.\n\nIt started with ﻿bloggers and early influencers promoting products to online audiences in the 2010s and has only grown with the rise of platforms like TikTok.\n\nNow brands are leaning into the trend and making UGC a key part of their marketing strategy, paying everyday people to promote their products and fuelling the UGC boom.\n\nThat's largely because traditional advertising isn't as effective as it used to be.\n\nUp to 70 per cent of consumers avoid advertising and prefer to ﻿hear from experts or everyday people rather than influencers or celebrities, as evidenced by the recent Sydney Sweeney American Eagle ad controversy.\n\nUGC – which is made almost exclusively by \"normal\" people – checks that box.\n\n\"UGC helps bring products to life in a way traditional advertising often can't,\" Grey said.\n\nTheory Crew built RISER, a mass influencer sampling platform﻿, specifically to meet the demand for UGC.\n\nAnd she predicts the UGC boom will only get bigger and more lucrative in the years ahead.﻿\n\nWhat is the difference between UGC creator and influencer?\n\nWhere ﻿influencers build a personal brand to attract engaged followers, UGC creators focus on making relatable content for brands.\n\nTheir photos and videos are designed to feel more natural and they don't need a ﻿large following to work with big-name brands.﻿\n\nFrom a brand perspective, working with UGC creators typically costs less than working with influencers.\n\nBut that doesn't mean they're not making money; Sullens says she earns thousands of dollars every month from UGC.\n\nSullens can make up to $6000 a month creating UGC about things like skincare and beauty products. (Supplied/Ashlee Sullens)\n\n\"Everyday people are turning their creativity into careers, getting paid to produce content from their own homes,\" Grey said.\n\n\"You don't need a huge following, just a camera, a spark of creativity, and a willingness to show up authentically on screen.\"﻿\n\nHow do you become a UGC creator?\n\nGetting started as a UGC creator is fairly simple, according to both Sullens and Grey.\n\n\"Shoot content in natural light, use your own voice, and focus on being helpful or entertaining,\" Grey advised.\n\n\"You don't need a massive audience, just a clear idea of what makes a good piece of content. And don't be afraid to put yourself out there.\"\n\nYou don't need to invest in any fancy tech either.﻿\n\nSullens began with an iPhone and didn't pay for a tripod, microphone or editing software until she was already making money from UGC.\n\nREAD MORE: Trump calls on Intel CEO to resign for alleged ties to China\n\nSullens said Aussies don't need to invest in fancy tech to start making UGC. (Supplied/Ashlee Sullens)\n\nShe advises beginners to research what makes good UGC, focus on video quality over quantity, and get comfortable with being on-camera.﻿\n\nAnd remember that, like most side hustles, UGC ﻿isn't a \"get rich quick\" scheme that guarantees overnight success.\n\n﻿\"As much as UGC is glamourised and seems like a super easy way to make money – which is partly true – it also takes a lot of work behind the scenes,\" she said.\n\n\"There's a lot around consumer psychology, branding, marketing and scripting that goes into each video.\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/new-zealand-travel-fee-australian-tourists-to-nz-will-have-to-pay-a-new-cost-when-entering-the-country/fdadd35b-7f66-42ce-9e35-482b05c15475",
        "title": "Australians set to face new fees when travelling to New Zealand",
        "publish_date": "Fri, 08 Aug 2025 12:53:12 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "Tourists visiting New Zealand are soon to be slugged with new travel fees.\n\nAll overseas travellers will be charged between $18 and $36 to visit some of New Zealand's most beautiful natural wonders.\n\nThat's places like Milford Sound, Mount Cook, as well as Cathedral Cove and Tongariro Crossing, one of the most popular hiking tracks in the country.\n\nREAD MORE: Shocking new details we can report about killer mushroom cook\n\nAll overseas travellers will now be hit with a fee between $18 and $36 to visit some of New Zealand's most beautiful natural wonders. (9News)\n\nThe New Zealand government says this will raise tens of millions of dollars to go towards conservation efforts and creating new jobs.\n\nThe fee doesn't kick in until 2027.\n\nPrime Minister Anthony Albanese is set to meet with his NZ counterpart this weekend, with trade top of the agenda.\n\nPrime Minister Anthony Albanese is set to meet with his NZ counterpart, Christopher Luxon, this weekend (9News)\n\nAlbanese will be arriving in Queenstown on Saturday and he's going to be given a traditional welcome before official meetings kick off with Prime Minister Christopher Luxon.\n\nThe pair are due to discuss increasing trade ties, as well as more co-operation on defence.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/turbulence-is-getting-worse-here-are-the-planets-bumpiest-flight-routes/0d074bbb-b1af-4fa0-9094-e68d0b063b7a",
        "title": "Turbulence is getting worse, here are the planet's bumpiest flight routes",
        "publish_date": "Fri, 08 Aug 2025 21:10:10 +0000",
        "category": "finance",
        "authors": [
            "Aug"
        ],
        "text": "When the plane started shaking violently on a Delta flight from Salt Lake City to Amsterdam last week, some passengers thought it was going to crash.\n\nThe jet had hit severe turbulence, flinging people into the ceiling, and service carts across the cabin.\n\nOne passenger said it felt like an earthquake. The plane was forced to make an emergency landing in Minneapolis, where 25 people were taken to the hospital.\n\nREAD MORE: Mushroom cook returns to court as sentencing looms\n\nFlight turbulence is caused by a variety of factors including mountains, storms and jet stream (CNN)\n\nIt was just the latest in a series of recent turbulence incidents resulting in injuries, hospitalisations and even a death. A 73-year-old man died of a heart attack during severe turbulence on a flight from London to Singapore last year.\n\nTurbulence, caused by disturbances in the atmosphere, is one of the most unpredictable weather phenomena for pilots.\n\nAir flows like water gushing down a river: undisturbed it runs smoothly, but if it encounters an obstacle, like a boulder, it becomes turbulent.\n\nMountains and storms act like boulders in a river, altering the way air moves. Moderate to extreme turbulence happens tens of thousands of times a year across the world.\n\nFor most passengers it will be felt as a few bumps, but in severe cases it can cause structural damage to the plane, temporary loss of control and injuries.\n\nREAD MORE: Top Trump officials discussed Epstein at White House meeting\n\nSouth America's bumpiest flights in 2024 traversed the Andes Mountains, home to some of the world's most turbulent skies. In Africa and Oceania, turbulent flights spanned the continents. (CNN)\n\nTurbulence caused more than 200 serious injuries in the US alone between 2009 and 2024, according to data from the US National Transportation Safety Board.\n\nThe good news is fatalities are very rare, and wearing a seatbelt almost always prevents serious injury.\n\nThe bad news: Turbulence appears to be increasing, especially on some of the most heavily trafficked routes, and it's set to get worse as the planet heats up.\n\nSo where can passengers expect the bumpiest trips?\n\nTurbulence forecasting website Turbli has analysed more than 10,000 flight paths, using data from sources including the National Oceanic and Atmospheric Administration and the UK Met Office, to rank the planet's most turbulent routes.\n\nThe goal is \"to show people that even if turbulence is chaotic, it does follow some patterns,\" said Ignacio Gallego Marcos, Turbli's founder and an expert in computational fluid dynamics.\n\nThe 120-mile route between Mendoza in Argentina and Santiago, Chile, offers breathtaking views over the towering, sometimes snow-capped peaks of the Andes mountains.\n\nIt's also the most turbulent route in the world, according to Turbli data.\n\nREAD MORE: Teenager arrested over stabbing spree at city park\n\nThe bumpiest routes in North America in 2024 span the western US, while the top routes in Europe are dominated by flights traveling between France, Switzerland and Italy. In Asia, the most turbulent routes are in Nepal, China and Japan. (CNN)\n\nMountain ranges are large, immovable obstacles that alter air flow.\n\nThey can create waves of air able to travel hundreds of miles. When these waves break, they cause a lot of turbulence, like ocean waves breaking into churning white foam, said Gallego Marcos.\n\nThe majority of the 10 most turbulent routes in the world involve mountains, including the Andes, the longest land-based mountain chain on Earth, and the Himalayas.\n\nIn the United States, the bumpiest routes are dominated by flights crisscrossing the Rocky Mountains to and from Denver and Salt Lake City.\n\nIt's the same story in Europe, where many of the most turbulent routes are over the Alps, as planes zip between France, Italy and Switzerland, according to Turbli.\n\nPilots are very aware of the need to take extra care over mountains, but the turbulence they cause is not always predictable. It \"can be due to very small-scale features of the mountain\" not always picked up in forecasts, Gallego Marcos said.\n\nMountains are always there, but another form of turbulence can seemingly appear from nowhere, with no obvious visual cues to warn pilots.\n\nREAD MORE: Netanyahu says Israel plans to take over Gaza as officials discuss widening its offensive\n\nPlane service carts, food and items thrown about after turbulence during a Delta flight on July 30 (CNN)\n\nIt's called clear-air turbulence and is most often used to describe turbulence near jet streams, wavy rivers of fast-moving air high in the atmosphere where planes cruise. It's caused by \"wind shear,\" a rapid change of wind speed or direction with altitude.\n\nThis type of turbulence is \"hazardous because it's hard to detect and forecast,\" said Piers Buchanan, aviation applications science manager at the UK Met Office.\n\nThe 320-mile route between the Japanese cities of Natori and Tokoname is one of the most turbulent in Asia because of this phenomenon, Gallego Marcos said.\n\nJapan has a \"particularly strong jet stream,\" he said, as the Americans discovered during World War II when bombs they dropped on Japan were swept off target by strong winds.\n\nJet stream strength is driven by temperature difference. In Japan, frigid air from Siberia meets warm air from Pacific Ocean currents, fueling a very strong and relatively stable jet stream throughout the year.\n\nA similar phenomenon happens on the US East Coast, where warm air from the Gulf Stream meets cold air from Canada. \"The North Atlantic Corridor, especially between North America and Europe, (is) where jet streams are strongest,\" Buchanan told CNN.\n\nREAD MORE: The costly hidden issue lurking under the toilets in homes around Australia\n\nMost of the bumpiest flights were in South America and Asia, but the list also included long-haul flights across the Indian Ocean. (CNN)\n\nAs the planet warms, clear-air turbulence is intensifying, according to recent research.\n\nIt works like this: Climate change increases temperature differences in the upper atmosphere which makes wind speeds more volatile and results in more clear-air turbulence where planes fly.\n\nSevere clear-air turbulence over the North Atlantic — one of the planet's busiest flight routes — was 55 per cent more frequent in 2020 than 1979, according to a 2023 study, which also found increases of 41 per cent over the continental US.\n\nAnd it's set to get worse. Turbulence strong enough to cause injury is projected to double or even triple in frequency globally by the end of the century, according to a 2017 study\n\nThunderstorms and towering cumulus clouds are another key source of turbulence, which is particularly pronounced near the equator. \"It's driven by strong vertical air movement and can be sudden and severe,\" Buchanan said.\n\nThis type of turbulence does not feature in Turbli's rankings because pilots tend to avoid it.\n\nA flight attendant was thrown into the ceiling during mid-air turbulence on board an ALK Airlines flight in Kosovo. (Storyful)\n\nPlanes are constantly scanning for storms using onboard radar and ground-based equipment. \"Your pilot will be kind of zigzagging around thunderstorm clouds,\" Gallego Marcos said.\n\nThere are still perils, however. Forecasts are not always precise enough catch thunderstorm turbulence and storms can also generate outbursts that can't really be predicted or seen by the radar, said Gallego Marcos.\n\nA particular danger is when several storms form at the same time and pilots risk getting caught between huge thunderstorm clouds.\n\nAviation experts believe this may have happened to the London-to-Singapore flight last year, when it encountered storms over Myanmar.\n\nScientists are exploring whether climate change may also be increasing this kind of turbulence as a warmer atmosphere holds more moisture, which fuels more intense thunderstorms.\n\nThe relationship between expected climate changes and turbulence \"is a very active area of investigation,\" said Robert Sharman, senior scientist emeritus at the National Centre for Atmospheric Research. It's hard to pin down firm data, he told CNN.\n\nThough there have been no commercial deaths from turbulence in over a decade, it can still create serious risks. (CNN)\n\nExperts stress flying is still the safest form of transport. Planes are specifically designed to withstand even severe turbulence and buckling your seatbelt is the surest way to avoid injury, Gallego Marcos said.\n\nOur understanding of the phenomenon is also getting better. We can now accurately forecast about 75 per cent of turbulence, said Joana Medeiros, a meteorology researcher at Reading University.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-09/hatched-graduate-art-show-launches-in-perth/105621722",
        "title": "In a makeshift gallery, the nation's top art graduates excite the senses",
        "publish_date": "Sat, 09 Aug 2025 01:34:27 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "The Perth Institute of Contemporary Art's (PICA) annual national graduate show, Hatched, is a chance for 23 artists from around the country to get their first taste of professional life.\n\nNow in its 34th year, Hatched takes the best of graduating artists' work from 20 institutions around Australia to create the only national graduate survey exhibition.\n\n\"[Hatched] is part of our work in supporting emerging artists,\" PICA director and CEO Hannah Mathews said.\n\n\"Hatched, over its exhibition history, has presented the work of over 1,400 artists to audiences here in Perth, and some of those artists have gone on to really big careers.\"\n\nHannah Mathews says the exhibition helps emerging artists from around Australia to find each other. (ABC News: Emma Wynne)\n\nOne of those artists is Archie Moore, whose work 'kith and kin' won the Golden Lion at the Venice Biennale in 2024. Khaled Sabsabi, whose work featured in Hatched in 2005, will represent Australia in Venice in 2026.\n\nTo be selected for Hatched, graduating artists are nominated by their lecturers and then hand-selected by a panel of artists and curators from each school.\n\n\"It's quite a rigorous process. So it means that the quality, the rigour of the work, the ambition and experimentation of the work is quite high, which is really good,\" Mathews said.\n\n\" This is a professional gig. It's a creative compulsion for artists, but it's also a professional pathway that PICA wants to support them on. \"\n\nPICA Hatched temporary exhibition space in Forrest Place. (ABC News: Emma Wynne)\n\nMaking a career in art\n\nOver the years, Hatched has expanded from being an exhibition to a professional development opportunity that teaches participants what's involved in being a working artist, and how to keep going financially while they do that.\n\n\"The artists all come to Perth. They meet, they spend time together, they watch someone else install their work, they learn about fundraising, they learn about media writing, they learn about how to think about accessibility and training and access for their work,\" Mathews said.\n\nMarcus Payne's work, Yorkshire Tea, involves real tea and many smashed tea cups. (ABC News: Emma Wynne)\n\nThis year, through the philanthropic support of the Mindaroo Foundation, PICA has paid each artist a loan fee for their work, which is industry best practice.\n\nNo-one quite seems to remember how the only national survey of art school graduates in the country came to be in Perth, but Mathews says one of the great things about the event, especially for artists not based in Sydney or Melbourne, is giving them a community.\n\n\"One of the big things that the artists in Hatched reflect on each year is that they love having made this community of peers, so that when they travel to Adelaide or they travel to Sydney, or they go up to Darwin, they know someone in town,\" she said.\n\n\" They've got someone to call when things get challenging. They've got someone to call if they have a question or a problem or an achievement. \"\n\nMadi Jones's hyper-realistic self-portraits, Internalised I & II, were created with ball-point pens. (ABC News: Emma Wynne)\n\nThe fragility and comfort of home\n\nRosemary Tamas-Cao, who graduated from the Queensland College of Art and Design in Brisbane, has a work in Hatched called 'ee with ellow owers' that the notes record is made of Vietnamese rice paper, onion skins, hair, cotton thread, rice, a fridge shelf, perspex wire and LED lights.\n\nRosemary Tamas-Cao says her work highlights the fragility of home. (ABC News: Emma Wynne)\n\n\"This work is an installation performance and it's set as an incomplete room, so the walls are made of Vietnamese rice paper and there are missing walls as well,\" Tamas-Cao said.\n\n\"The space itself recalls temporary housing that my family and I were accommodated in when I was younger.\n\n\"All the materials, including the rice paper, the onion skins and my hair, which is used to stitch poems, they are all really impermanent and scant.\n\n\"But for me, they evoke a comfort, the nourishment and presence of my home. And a key part of this work, too, was showcasing the fragility of home in a time of the upheaval of both the climate and housing scenes.\"\n\nRosemary Tamas-Cao's work, ee with ellow ours, on display at Hatched. (ABC News: Emma Wynne)\n\nRosemary Tamas-Cao's work uses rice paper which degrades over the course of the exhibition. (ABC News: Emma Wynne)\n\nTamas-Cao said being chosen for Hatched was \"super exciting\".\n\n\"I'm immensely grateful for this opportunity,\" she said, adding that her university gave her a lot of encouragement.\n\nTalking back to colonial imagery\n\nFor Tom Duffy, a Dharug man who studied creative arts at the University of Wollongong in New South Wales, art is a way of speaking back to colonial narratives and depictions of Aboriginal people.\n\nHis triptych, 'Djagats (The Newly Arrived/Native Dignity)' takes two paintings by 19th century artist Samuel Thomas Gill and challenges how Gill depicted First Nations people.\n\nTom Duffy has challenged depictions of Aboriginal people in colonial art. (ABC News: Emma Wynne)\n\nIn Gill's Native Dignity, a First Nations couple promenades down a street, wearing shredded versions of Victorian dress — the frockcoat, top hat and crinoline skirt.\n\nIn the background, a white couple, more conservatively dressed, regard the couple with disdain and horror, and the picture seems to mock the Aboriginal couple's confidence.\n\nIn Duffy's interpretation, the couple's true dignity is restored, and the paintwork references possum fur, a traditional garment that was stamped out by the colonists who insisted Aboriginal people must wear European-style clothing.\n\nOne of the three works from Tom Duffy's Djagats (The Newly Arrived/Native Dignity) triptych. (ABC News: Emma Wynne)\n\n\"I wanted to use [Gill's] material and flip it so that it became a symbol of pride for Aboriginal people,\" Duffy said.\n\n\"I've used the craft of possum fur as a symbolic thing in the work as well. It was a craft that got put to sleep by colonialism.\n\n\"When the settlers came, there was a process where Aboriginal people had to dress like the white men.\n\n\"The possum fur clothing disappeared, and in the last maybe 50 years, it's been reawakened.\n\n\"And so now that possum fur is a symbol of cultural resilience.\"\n\nTom Duffy's work Djagats (The Newly Arrived/Native Dignity) triptych. (ABC News: Emma Wynne)\n\nThe centre image references Gill's painting, 'The Newly Arrived', where a group of newly arrived colonists have encountered a First Nations father and son, who are dancing for them, as one of the men reaches into his pocket to give them a few coins.\n\n\"[The original image] positioned the Aboriginal man who was dancing in a position of desperation,\" Duffy said.\n\n\"I was hoping that this work could bring back what dancing is for our mob, that it's a huge part of culture.\n\n\"It's a way of sharing knowledge and celebration. And it's not something that we do to please people.\"\n\nMotivation to continue\n\nDuffy said that having his work selected for the Hatched exhibition was a huge boost.\n\n\"I honestly couldn't believe it,\" he said.\n\n\"I only started doing art when I signed up for university, and so to be here so soon — and in such a big opportunity for all of us artists who are so early in their careers — is very exciting.\n\n\" It's definitely a lot of motivation to keep doing what I'm doing. Yeah, and hopefully there are still bigger things to come. \"\n\nGallery in former office\n\nThis year, with PICA's entrance blocked by construction work in the Perth cultural centre and the interior of the gallery taken up with installation of long-awaited air-conditioning, Hatched has relocated.\n\nThe exhibition space is on level three of Forrest Chase, the shopping centre that includes Myer and other retailers, and was formerly a Flight Centre office.\n\nMim Kowner used still photos from Matildas matches to create her series of three paintings. (ABC News: Emma Wynne)\n\nA light, bright and vast space, it's an unusual move but one which Hannah Mathews said had proved ideal for showing art.\n\n\"It's very kind of New York, Berlin, warehouse, biennale art fair scale,\" she said.\n\n\"It's 3,000 square metres. The install team over the last three weeks have been clocking up 16,000 steps a day.\"\n\nThe space includes wide and little-seen views over the city and still contains some of the old fixtures from the office.\n\nInstallation hasn't been without drama — a work by Marcus Payne from Monash University that involves smashing more than 100 tea cups containing real tea, led to a window panel in the internal room also being broken.\n\nA glass panel was broken along with many tea cups as Marcus Payne's work, Yorkshire Tea, was installed. (ABC News: Emma Wynne)\n\nPayne's work, titled Yorkshire Tea, references British colonial power and is augmented by a sound installation.\n\n\"You've just got to laugh,\" Mathews said ahead of opening night.\n\n\"He was OK. The work is OK. The panel's getting replaced this morning.\"\n\nSignage pointing to the Hatched exhibition in Forrest Chase. (ABC News: Emma Wynne)\n\nLarge signs outside Myer on the walkway leading from the Perth train station give instructions on how to find the lift to the gallery, which is on the third floor of Forest Chase, right next to the station.\n\nIt's a three-minute walk from PICA.\n\n\"I think it's a really special experience to have Hatched in the city in a space like this,\" Mathews said.\n\n\"This location … has been gifted to us on a three-month lease through [building owner] ISPT.\n\n\"And it means that Hatched is being presented for the first time in its biggest format, on its biggest platform, right in the middle of the city.\"\n\nHatched: National Graduate Show is on show at Forrest Chase until October 5, entry is free.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-09/afl-geelong-cats-jeremy-cameron-100-goals/105632188",
        "title": "Cameron focused on Cats' 'bigger picture' instead of 100-goal milestone",
        "publish_date": "Sat, 09 Aug 2025 01:00:10 +0000",
        "category": "sports",
        "authors": [],
        "text": "Geelong spearhead Jeremy Cameron says winning a premiership is more important than the pursuit of 100 goals in a season.\n\nCameron remains unfussed whether he becomes the first player since Lance Franklin in 2008 to reach the milestone.\n\nHis path to triple figures stalled on Friday night, Cameron kicks four as Cats beat Dons\n\nCameron has 79 goals for the season.\n\nThere had been anticipation Cameron could kick a bag of goals against the undermanned Bombers' defence.\n\nScott admits Cats were 'a bit off' against Bombers Photo shows Chris Scott speaks to a Cats player during an AFL match. Geelong coach Chris Scott concedes he was a \"bit picky\" in his assessment of the Cats' 44-point victory over the Bombers at Kardinia Park.\n\nInstead, Cats teammate Shannon Neale claimed the first three goals of the match, and Bombers pair Jayden Laverde and Mason Redman worked hard to curb Cameron's influence.\n\n\"If it ever happened, I'm not going to pass off the 99th, pass off the 100th goal,\" Cameron told the Seven Network after the match.\n\n\"If it happened, it would be awesome. I was out there when Buddy kicked his 1,000th goal [in 2022].\n\n\"That was awesome to be around, even though they beat us on that day.\n\n\"It is not something I want to sort of talk about too much because we have got a bigger picture and something in mind.\n\n\"I have been lucky enough to win a Coleman Medal and I have won a flag, and I would much rather the flag any day.\"\n\nCats coach Chris Scott said he was unsure how driven Cameron was to reach the 100-goal mark.\n\n\"Has anyone spoken to him about the 100?\" Scott asked reporters after the match.\n\n\"I don't know how driven he is to get there.\"\n\nThe Cats are second on the ladder and play Sydney and Richmond before the finals.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-09/hang-glider-lisa-bradley-could-not-walk-learnt-to-fly/105527984",
        "title": "Hit by a car, Lisa could barely walk, now she teaches people to fly",
        "publish_date": "Sat, 09 Aug 2025 00:56:31 +0000",
        "category": "sports",
        "authors": [],
        "text": "Every weekend, Lisa Bradley soars thousands of metres above Queensland's stunning Scenic Rim, chasing pockets of air that pull her even higher.\n\nBut while she happily flies now, 27 years ago Lisa worried she wouldn't even be able to walk.\n\n\"I got run over by a four-wheel-drive and my left leg actually got fully dislocated off,\" she said.\n\n\"I couldn't feel it anymore.\"\n\nLisa, then 21, was training for a major multi-sports competition near her home in Queenstown, in New Zealand, when the accident happened.\n\nPrior to her leg injury, Lisa Bradley was a keen multi-sports competitor. (Supplied: Lisa Bradley)\n\nRushed to hospital, Lisa said emergency doctors considered amputating her leg.\n\nThankfully, surgeons were able to save her limb, but gave her a grim prognosis.\n\n\"[They said] your life is going to be different, you're not going to be able to do sport,\" Lisa said.\n\n\"It was really gutting.\n\n\"But I say, 'One door shut, another one opened.'\"\n\nShe couldn't run, so she flew\n\nRecovering in hospital, Lisa said she received an unexpected visitor — the driver who ran over her.\n\n\"I think he felt quite guilty, so he started seeing me all the time,\" she said.\n\n\"We ended up dating for two years.\"\n\nLisa Bradley has competed in international hang-gliding competitions. (ABC Gold Coast: Dominic Cansdale)\n\nBetter yet, he was a tandem paraglider and took Lisa for a flight as soon as she could walk.\n\n\"You're so far from the earth, you feel so free,\" she said.\n\n\"You're riding currents that you can't see, but you can feel.\n\n\"You do feel like you're a bird, you feel connected.\"\n\nA paraglider, like this one, takes less time to set up than a hang glider. (Supplied: Tex Beck)\n\nLisa was \"hooked\" and started paragliding every day, even during lunch breaks at her retail job.\n\n\"I was good at selling because I was so happy all the time,\" she said.\n\nLisa then learned how to hang glide, which involves pilots flying underneath a rigid, triangular frame rather than under a parachute-like wing.\n\nHang gliding is a niche but beloved sport. (Supplied: Tex Beck)\n\nBut she said that drew protests from her boyfriend, as hang gliding had a much bigger physical strain on her injured leg.\n\n\"So I'd sneak out and I was learning hang gliding on the sly,\" she said.\n\n\"I did my first solo and I was so happy, but I couldn't tell him, so I thought it [was] probably time to move on.\"\n\nOver the years, Lisa's passion for hang gliding and paragliding grew stronger.\n\nSo much so that she has built a three-decade career as a paragliding and hang-gliding instructor.\n\nShe has also competed in international competitions.\n\nFuture of sport up in the air\n\nNow based near Beaudesert in Queensland, Lisa has seen the number of young people learning to hang glide drop significantly.\n\nLisa Bradley takes a customer on a hang-gliding joy flight. (Supplied: Lisa Bradley)\n\nShe said rising insurance premiums, membership fees for clubs, and the cost of equipment had made \"a lot of instructors drop out of the sport\".\n\n\"The future for hang gliding, it's really unknown to be honest,\" she said.\n\n\"Most instructors only put through six people a year, so if you're paying thousands and thousands of dollars in insurance, you're not even going to be getting it back.\n\n\"The sport is not looking real good.\"\n\nThis hang glider designed by John Dickenson was flown in a water-skiing stunt at Grafton in 1963. (Supplied: Fuller family archive)\n\nHang gliding grew in popularity from the 1960s but enthusiasts began shifting towards paragliding in the 1990s, according to the Sports Aviation Federation of Australia [SAFA].\n\n\"A paraglider is a bit more convenient to set up. It only takes five or 10 minutes compared to half an hour or an hour for some of the more advanced hang gliders,\" SAFA president Alistair Dickie said.\n\n\" [Paraglider] technology, the wings, is better now [and] the materials they're made of are better. \"\n\nAlistair said about a quarter of SAFA's 3,000 members were hang gliders, while around 75 per cent were paragliders.\n\nHe estimates there are fewer than 10 hang-gliding schools left in Australia.\n\nParagliding has been rising in popularity since the 1990s. (Supplied: Tex Beck)\n\nBut is it risky?\n\nWhile there are some perceptions that hang gliding and paragliding are dangerous, Lisa said the sport was as \"safe as you want to make it\".\n\n\"I only fly with good equipment and I only fly in conditions I know I have the skills for,\" she said.\n\n\"If you fly in the wrong conditions or with equipment that's not good, well, you're asking for trouble.\"\n\nA 2021 study of injury-related fatalities in Australian sport by researchers at Edith Cowan University found that more people died in skydiving and parachuting accidents over a 19-year period.\n\nBetween July 2000 and December 2019, there were 20 deaths linked to unpowered hang gliding, and 19 deaths linked to unpowered paragliding — equating to one death per year in each sport.\n\nHowever, over the same period, there were 36 deaths linked to skydiving and parachuting, and 23 deaths of people participating in aerobatics.\n\nAlistair said the number of safety tests conducted on paragliding equipment had increased significantly in recent decades.\n\n\"All of this is making paragliding easier and more accessible for people,\" he said.\n\nWell worth it, despite costs\n\nBut, Alistair said, while hang gliding and paragliding were cheaper than other forms of aviation, anyone wanting to take up either sport would have to find about $10,000 to buy the gear and undergo training.\n\nHowever, the feeling of soaring across the sky was unmatched.\n\n\"We've got these magical aircraft that give us wings,\" he said.\n\n\"Stepping off the hill late in the day into air that's going up, and floating around — soaring — is just so relaxing and lovely.\"\n\nLisa described hang gliding as amazing, but it required participants to be strong.\n\n\"You need to be fit and fully committed,\" she said.\n\n\"It needs to be in the public eye more because if you don't see it, people don't even think about it.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-09/tennis-wta-tour-elena-rybakina-stefano-vukov-ban-lifted/105632144",
        "title": "Former Wimbledon champ Rybakina's coach cleared to return from suspension",
        "publish_date": "Sat, 09 Aug 2025 00:16:52 +0000",
        "category": "sports",
        "authors": [],
        "text": "The coach of 2022 Wimbledon champion Elena Rybakina has been cleared by the WTA Tour to return from his suspension for a potential breach of its code of conduct.\n\nStefano Vukov was provisionally suspended in January while the WTA conducted an investigation.\n\nThe WTA announced in February the investigation had been completed and the ban remained in place, without specifying how long it would last.\n\nMboko slays final giant in Montreal Photo shows Victoria Mboko lifts the Canadian Open trophy as Naomi Osaka bows her head next to her. Canadian teenager Victoria Mboko delights crowds in Montreal and Toronto with her Canadian Open final win over four-time grand slam winner Naomi Osaka.\n\nVukov is now permitted to receive credentials allowing him access to player areas and practice courts at its events.\n\n\"The WTA is fully committed to providing a safe and respectful environment for all athletes and other participants, as set out in our WTA code of conduct and safeguarding code,\" the tour said in a statement.\n\n\"Any sanctions issued following a breach of these safeguarding rules are carefully considered and are subject to appeal before an independent tribunal.\n\n\"While case details remain confidential, we can confirm that Mr Vukov is eligible to receive credentials at WTA events.\"\n\nRybakina announced before last year's US Open that Vukov would no longer be her coach.\n\nBut prior to this year's Australian Open, Rybakina said he would be rejoining her team.\n\nShe insisted he had never mistreated her during their time working together.\n\nRybakina, ranked number 10 on the WTA Tour, most recently reached the semifinals in Montreal before losing to Canadian teenager Victoria Mboko, the eventual champion.\n\nAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-09/mexican-authorities-seek-legal-avenues-with-adidas-collab/105632084",
        "title": "Mexico seeks legal action after Adidas launches sandals with traditional style",
        "publish_date": "Sat, 09 Aug 2025 00:01:10 +0000",
        "category": "finance",
        "authors": [],
        "text": "Mexico is looking for footwear giant Adidas to pony up after a Mexican-American designer working with the firm, Willy Chavarria, launched a shoe inspired by a traditional sandal.\n\nChavarria recently dropped the Oaxaca Slip On shoe, a sneaker sole topped with the weave of Mexico's huarache sandals.\n\nThe designer has been hailed in the US for his work bringing Latino issues to light — including his controversial collection touching on the alleged gang members locked up at El Salvador's notorious CECOT prison.\n\nBut Chavarria's critics have argued that the shoe uses the name of the southern Mexican state, a major manufacturer of the traditional leather sandals, while his design is manufactured in China and Indigenous artisans received no credit or benefit from the multinational firm.\n\nWilly Chavarria collaborated with the major sneaker brand. (Supplied: Adidas/Willy Chavarria)\n\n\"Big companies often take products, ideas and designs from Indigenous communities,\" Mexican President Claudia Sheinbaum said in her Friday press conference.\n\n\" We are looking at the legal part to be able to support them. \"\n\nDeputy Culture Minister Marina Núñez confirmed Adidas had contacted Oaxacan officials to discuss \"restitution to the people who were plagiarised\".\n\nThe dispute is the latest by Mexico to protect its traditional designs from global fashion firms, having previously lodged complaints against Zara owner Inditex and Louis Vuitton.\n\nPrada accused of ripping off Indian fashion Photo shows A close up of people wearing leather sandals on the runway At Milan Fashion Week, models strutted in Prada's new open-toe leather sandals. Thousands of kilometres away in India, the show was met with disbelief.\n\nNeither Adidas nor Chavarria, born in the US to an Irish American mother and a Mexican American father, immediately responded to requests for comment.\n\nChavarria had told Sneaker News that he had intended to celebrate his cultural heritage through his work with Adidas.\n\n\"I'm very proud to work with a company that really respects and elevates culture in the truest way,\" he said.\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-09/veteran-calls-for-more-recognition-of-ptsd-service-dog/105595440",
        "title": "Service dog helps others heal after giving veteran his life back",
        "publish_date": "Sat, 09 Aug 2025 00:00:08 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "They are loyal companions to many, but for a person living with post-traumatic stress disorder (PTSD) the presence of a service dog can be life-changing.\n\nFrom veterans to first responders and trauma survivors, these specially trained dogs can help to calm anxiety, reduce flashbacks and rebuild confidence.\n\nAfter years of silently battling his own PTSD, Royal Australian Navy veteran Gary Crombie said he found his lifeline in a golden retriever named Levi.\n\nGary Crombie with his service dog Levi at St John of God Hospital in Bunbury. (ABC South West WA: Kate Forrester)\n\n\"I served from 1977 to 1990. For most of those 13 years I was in submarines,\" he said.\n\n\"I retired when I was around 57 years old, but I developed PTSD well before then. I didn't talk to anybody about it, I kept it quiet.\n\n\"I didn't want people to know I had a mental illness.\"\n\nIt was only after Mr Crombie began to open up to close friends that he made the decision to see a psychologist.\n\n\"My therapist mentioned to me about having a service dog. To start with I thought, 'No, I don't want a dog,'\" Mr Crombie said.\n\n\" I can't look after myself, how could I possibly look after a dog? \"\n\nGary Crombie was given Levi to assist him with his PTSD. (ABC South West WA: Kate Forrester)\n\nBut after being paired with Levi through the program Dogs For Life the former submariner quickly noticed the change.\n\n\"I started to get out more, taking Levi for walks all the time, people were talking to me more. I didn't think I'd ever open up,\" he said.\n\n\"[Levi] can pick up the emotions and changes in my body before I have a nightmare. He can wake me up before anything else happens.\n\n\" He's changed my life. \"\n\nLoading...\n\nMaking a difference\n\nMr Crombie now shares Levi's positive presence with a hospital in the south-west of Western Australia.\n\nEvery Wednesday the pair visit St John of God in Bunbury to offer comfort and connection to patients and staff.\n\nPharmacist Fatma Alamir said having a positive distraction like Levi on the ward could be invaluable during challenging times.\n\n\"He makes you forget where you are, having that five-minute break to pat him. It really rejuvenates you for the rest of the day,\" Ms Alamir said.\n\nFatma Alamir says Levi's visit to her ward each Wednesday never fails to lift her spirits. (ABC South West WA: Kate Forrester)\n\nFollowing the success of the program, the hospital has expressed interest in expanding its therapy dog initiative.\n\nA spokesperson for St John of God Hospital noted pet visits had been shown to lower blood pressure and help alleviate pain among patients.\n\nSame rights as seeing eye dogs\n\nDriven by his personal experience Mr Crombie wants to highlight the life-changing impact service dogs can have for those living with PTSD.\n\nHe also wanted to help others understand the rights service dogs are entitled to in public settings.\n\n\"I still get challenged every now and then, in shopping centres or supermarkets. People will approach me and say, 'You can't have your dog in here,'\" Mr Crombie said.\n\n\" There needs to be more awareness that these dogs are treated the same as seeing eye dogs. \"\n\nService dog Levi wears a jacket in public so people can recognise he is working. (ABC South West WA: Kate Forrester)\n\nSylvia Schiavoni is a trauma counsellor for the Dogs For Life empowerment program and said when people with service dogs were questioned it could serve as a trigger.\n\nSylvia Schiavoni with her corgi Cindy, who helps participants learn how to have an assistance dog. (Supplied: Sylvia Schiavoni)\n\nMs Schiavoni wants greater public awareness and acceptance across Australia.\n\n\"When you are working with people with an invisible disability, like PTSD, they don't present as someone needing a dog. You can't tell what is going on in their internal world,\" she said.\n\n\"It's really important. Instead of saying, 'You're not allowed in here' the conversation should be, 'Could I please see your public access card?'\"\n\nBoth service and seeing eye dogs are covered by the same access laws under the Disability Discrimination Act.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-09/musicians-seek-fame-success-asia-west-us-uk/105621618",
        "title": "How Asia is changing the classic Aussie band origin story",
        "publish_date": "Fri, 08 Aug 2025 23:57:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "For generations of aspiring Australian musicians, there was a simple recipe for success: pack your bags and move to the UK or US.\n\nThis rite of passage helped forge the careers of many Australian superstars, from AC/DC and Nick Cave to Sia and Iggy Azalea.\n\nBut the dominance of Western markets is being challenged by the growing prestige and influence of the music business in Asia.\n\nThe shift can be seen on streaming service Spotify, where the most-followed artist is no longer US pop superstar Taylor Swift, but Indian singer Arijit Singh.\n\nAnd it's changing how artists and educators think about where the opportunities lie for international acclaim.\n\nMany western artists have collaborated with Asian pop stars in recent years. (ABC News: Jarrod Fankhauser)\n\nMusic through a multicultural lens\n\nAt the Australian Institute of Music in Sydney, the curriculum has been shaped with Asia in mind.\n\nThe college has spent years building ties with institutions in countries including South Korea, Malaysia, Singapore and India.\n\nThey bring in practitioners from across Asia to hold workshops; there's even talk of a trip to Seoul to learn about K-pop.\n\nPercussionist and Australian Institute of Music lecturer Chris Fields plays with third-year student Vritant Soni. (ABC News: Lachlan Bennett)\n\nSenior academic lecturer Chris Fields said music education in Australia was catching up with long-standing industry trends.\n\n\"Since probably the '90s, there's been a move towards multiple ways of getting in touch with music,\" he said.\n\nThe Aussies making a splash in K-pop Photo shows Hanni with long orange hair, and nose jewellery How is it Australia has managed to produce so many homegrown K-pop stars?\n\n\"So moving away from the Western classical system necessarily, especially amongst jazz curriculums.\"\n\nAt a practical level, students explore core musical concepts through multiple, multicultural lenses.\n\n\"Rhythm and melody, these things are kind of universal but the way that traditions deal with them can be vastly different,\" Mr Fields said.\n\nCould Asia become the new America?\n\nHuge populations, rising incomes and increased digital connectivity are all helping the music business across Asia grow.\n\nIn 2024, 45 per cent of all global revenue from the physical sale of recorded music, such as CDs and vinyl, came from Asia, according to the International Federation of Phonographic Industry's Global Music Report.\n\nNorth America and Europe still remain the biggest regional markets once digital products, such as streaming and downloads, are included.\n\nRose of Blackpink, third from the left, was born in New Zealand and raised in Australia. (Supplied: Universal Music)\n\nThe US is still the biggest single market but Asian countries have cracked the top 10, with Japan ranked second in the world, China fifth and South Korea seventh.\n\nMusic labels such as Warner and Universal are investing in the region, while Western artists collaborate with Asian idols.\n\nIn the past two years, Lady Gaga performed with Korean girl group Blackpink, Ed Sheeran with Singaporean singer JJ Lin and Usher with Malaysian artist Yuna.\n\nSeveral Australians or those with strong ties to Australia have also built careers in Asia, particularly in the K-pop scene.\n\nRose from Blackpink grew up in Melbourne; Bang Chan and Felix from Stray Kids, lived in Sydney; and Jake from Emhypen moved to Brisbane when he was nine.\n\nChasing the music dream in Asia\n\nSatsuki says Japan has an interesting and diverse music industry that blends genres together. (Supplied: Satsuki)\n\nPop singer-songwriter Satsuki moved from Sydney to Osaka, Japan, almost a decade ago.\n\nBig cities and good transportation make touring much more economical in Japan and artists can also rely on a revenue stream that has dramatically disappeared in the West: CD sales.\n\n\"I didn't have any CDs at the start because I didn't have any use for them,\" Satsuki said.\n\n\"The fact that we still sell them, that we still have CD stores is, I think, incredible.\n\n\"People love having physical media and physical cover art, lyric books and all that kind of stuff.\"\n\nLoading Instagram content\n\nSatsuki said Japan also had an \"incredibly interesting and very diverse\" music industry.\n\n\"Take BabyMetal, for example,\" Satsuki said.\n\n\"They're fronted by these three, very cutesy girls that sing in a cutesy way, but also have this very, authentic metal band supporting them.\n\n\"That kind of combination, I don't think you really see in the West and I think it allows people to explore different types of genres and looks and images.\"\n\nMaking music but out of the spotlight\n\nAsia also has opportunities for those who want to build a career behind the scenes in the music business.\n\nThe film and TV industry is blossoming in many Asian countries, and someone needs to compose the soundtrack of the latest K-drama or Bollywood hit.\n\nMr Fields said there were also opportunities to write for video games.\n\n\"And if you think about the diversity of environments, playing scenarios and all these types of things, having a global perspective on sounds and ideas and these other things is critical,\" he said.\n\nFirst-year student Ivana Yue enjoys blending her Australian and Asian cultural influences during music production. (ABC News: Lachlan Bennett)\n\n\"I've done some session work for movies in India. I know people that compose here for movies being released in India, in the US, in Brazil.\n\n\"Composition and performing is global now.\"\n\nFirst-year student Ivana Yue is looking to build a career in sound design, especially for musical theatre.\n\nHer cross-cultural work reflects her background; she grew up in Hong Kong but attended an Australian International School.\n\n\"My favourite thing to do is to take patterns and melodic repetitions and themes from Asian-inspired music and put it into Westernised orchestral pieces.\n\n\"I also love using different Chinese scales as well, and even Japanese scales.\"\n\nWhat does this mean for the future of Asian music?\n\nFinding success as a musician is rarely easy, regardless of whether you look East or West.\n\nCultural barriers, language constraints and protectionist attitudes can make it tough to crack into a foreign market.\n\nAnd while some countries may be reluctant to embrace outsiders, cultural exchange helped shape one of the biggest success stories in the region: K-pop.\n\nAssociate professor Jimmyn Parc says there was a reluctance to accept modern K-pop when it emerged in the 1990s. (Supplied: ANU)\n\nUniversity of Malaya associate professor Jimmyn Parc said when modern K-pop emerged in the 1990s, it incorporated many elements from Western music.\n\n\"There were a lot of things from United States, hip hop and reggae, and people actually complained a lot,\" he said.\n\n\"They said, 'This is not Korean. We should not accept these kinds of things.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-09/fishers-could-have-spanish-mackerel-catch-limits-increased/105629448",
        "title": "Queensland fishers could have Spanish mackerel catch limits increased",
        "publish_date": "Fri, 08 Aug 2025 22:54:56 +0000",
        "category": "finance",
        "authors": [],
        "text": "Commercial fishers will be allowed to increase their Spanish mackerel catch by more than 50 per cent by the end of the year under proposed new Queensland catch limits.\n\nThe proposal could reduce prices for consumers, but marine conservationists believe the move is too soon to safeguard fish stocks.\n\nThe Queensland Department of Primary Industries announced new figures this week showing the Spanish mackerel population had likely doubled since a dire review in 2021.\n\nIt is now planning to raise catch limits for recreational boats from two fish per boat to a maximum of four.\n\nFor commercial fishers it would increase annual allowable catches by 51.5 per cent, from 165 tonnes to 250 tonnes.\n\nCheaper prices\n\nQueensland Seafood Industry Association president Allan Bobbermen said consumers would see lower prices if the changes went through.\n\nHe said under current rules the fish was not \"readily available\" to buy.\n\nAllan Bobbermen says consumers could see cheaper Spanish mackerel. (ABC Rural: Lucy Cooper)\n\n\"The consumer will have a bit more guarantee of continuity of supply,\" Mr Bobbermen said.\n\nHe said the changes were good news for the commercial sector where the Spanish mackerel industry was almost \"dead in the water\".\n\n\"Spanish mackerel sell themselves,\" he said.\n\n\"It's an iconic fish, it's got a very good shelf life, you can cook it in many ways and it's very popular in the fish and chip trade.\"\n\nThe 2021 state government review found Spanish mackerel were being overfished and assessed fish stock at 17 per cent of original levels.\n\nThe following year the former Labor state government announced it would slash commercial catch quotas by more than 71 per cent.\n\nThe changes caused the value of fishing licences to plummet and forced many commercial fishers out of the industry.\n\nRestrictions were announced by the state government in 2022 and came into effect the following year. (ABC News: Lily Nothling)\n\nThe Crisafulli government has described the 2021 review as a flawed stock assessment and said a 2025 assessment found Spanish mackerel were fast growing and highly reproductive.\n\nEnvironmental experts cautious\n\nSimon Miller from the Australian Marine Conservation Society disputed assessments that Spanish mackerel populations had doubled.\n\nHe said since the 2021 review, feedback had been taken on board from stock assessment scientists and the state government had revised the way it conducted assessments.\n\n\"The new stock assessment puts the stock at 34 per cent,\" he said.\n\n\" That doesn't mean the stock has doubled, it just means it's a different assessment. \"\n\nThe Queensland government wants to increase catch limits of Spanish mackerel. (ABC North Qld: Lily Nothling)\n\nThe state government intends to consult the public before the proposed changes come into effect, potentially by the end of the year.\n\nMr Miller said while the new stock level was good news it still showed a long-term decline in the last decade that had only seen a \"slight uptick\" in the last couple of years.\n\nHe said the state government should wait until it saw stronger evidence of stock recovery for changes to be made to catch limits.\n\n\"We still need to be very precautionary in how we're managing Spanish mackerel,\" he said.\n\nMr Bobbermen hoped the move would bring commercial operators back to the water.\n\n\"It means they won't have to surrender so many units of quota to get one kilo of fish, which is going to give them more value,\" he said.\n\n\"Some of the guys that stepped away from the industry will return.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-09/hobart-cbd-block-for-sale-from-utas-housing-needed/105613564",
        "title": "YIMBYS want this massive CBD block turned into dense housing",
        "publish_date": "Fri, 08 Aug 2025 22:36:26 +0000",
        "category": "finance",
        "authors": [],
        "text": "It's been dubbed a \"once-in-a-generation opportunity\" to purchase a sprawling block in Hobart's CBD, and for some, a chance to increase housing density.\n\nThe 11,000-square-metre site at 103 Melville Street is owned by the University of Tasmania (UTAS), which bought it in 2019 for $30 million.\n\nLast year, UTAS announced it intended to sell the site to fund other projects, scrapping plans to transform the precinct into a mix of retail, commercial and university spaces.\n\nNow its back on the market zoned as commercial, with the option of building up to six storeys.\n\nMick Purves, from the Tasmanian branch of the Property Council of Australia, said there were a lot of options for development.\n\n\"It would be a really, really good spot for a mix-use proposal where you have retail and commercial at the ground and first level, and then dwellings above that,\" he said.\n\nUTAS is selling the old K&D site in Hobart CBD that it had planned to develop as part of its city move. (ABC News: Kate Nickels)\n\nPush for housing not 'another car yard'\n\nA community group which advocates for development in Hobart wants the site to become medium-density housing.\n\nCommunity advocate Susan Wallace wants to see housing built on the site. (ABC News: Scout Wallen)\n\nYes In My Backyard Hobart (YIMBY Hobart) spokeswoman Susan Wallace said it was a \"golden opportunity\" to increase inner-city housing opportunities.\n\n\"We're constantly pushing the outer urban boundary and people are finding themselves pushed right to the outskirts of the city and thus having to drive cars into the city when they work,\" Ms Wallace said.\n\n\" Our concern is that it will get developed into either a big box shopping centre, car parking or another car yard for Hobart. \"\n\nThe site is on a busy street in Hobart. (ABC News: Scout Wallen)\n\nThe group wants the state or federal governments to buy the block, or for UTAS to ensure it is sold with housing in the developer's plan.\n\nIn a statement, a spokesperson for the university said they recognised the significance of the site and the potential it held to enhance the city.\n\nThe ABC understands UTAS has not placed conditions on the sale to ensure the developer includes housing in the project.\n\nCity of Hobart councillor Ryan Posselt said building homes would help increase city density to reduce congestion and enhance the economy.\n\nCity of Hobart councillor Ryan Posselt says he will advocate for the site to become residental. (ABC News: Scout Wallen)\n\n\"[The site] represents a unique once-in-a-generation opportunity for the city to control what is built on an entire city block,\" he said.\n\n\"We cannot squander this opportunity and leave it to the private sector to build another big box store car yard or even single-storey development.\"\n\nLack of demonstrated market demand\n\nMr Purves said governments need to incentivise and de-risk the project for developers, and others like it, by reducing the planning assessment pathway, or by helping provide major infrastructure upgrades.\n\n\"Coordinating those types of add-ons to projects like that can be quite problematic, difficult and expensive,\" he said.\n\n\"What we've seen is that these types of sites tend to get a one to two-storey response, which is a pretty low level of development, and we lose that opportunity for more intense projects.\"\n\nThe site is right in the central business district of Hobart. (ABC News: Kate Nickels)\n\nThe Tasmanian Freight Equalisation Scheme, which provides financial assistance for costs incurred for shipping goods over Bass Strait, does not cover building and construction materials and equipment.\n\nMr Purves said while changing that would help reduce construction costs and provide subsidies for transport, there were still larger issues at play.\n\n\"The problem we have is that the development sector isn't really able to fund and kick those projects off the ground because there is a lack of demonstrated market demand,\" he said.\n\nMayor Anna Reynolds says the council would be willing to provide concessions to a developer with the right plan. (ABC News: Leon Compton)\n\nLord Mayor of Hobart Anna Reynolds said although purchasing the block of land outright was not feasible for the council, it would be willing to offer incentives.\n\n\"We can play a role in waiving rates, waiving fees … and waiving other sort of planning restrictions that add to the costs of the development,\" Cr Reynolds said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-09/football-australia-matildas-to-face-wales-ahead-of-asian-cup/105632042",
        "title": "Matildas relishing 'perfect test' ahead of Asian Cup campaign",
        "publish_date": "Fri, 08 Aug 2025 22:16:06 +0000",
        "category": "sports",
        "authors": [],
        "text": "Matildas coach Joe Montemurro says October's friendly against Wales will be a crucial step in his squad's preparations for next year's Asian Cup.\n\nThe match against Wales — the first between the two nations in women's football — has been scheduled for October 25 in Cardiff.\n\nThe Matildas will also face a yet-to-be-determined opponent later in FIFA's international window.\n\nBut it remains to be seen whether Sam Kerr, who has not played since tearing her ACL in January last year, will be made available for the two matches.\n\nCatley nominated for Ballon d'Or Photo shows Steph Catley adjusts her captain's armband while playing for the Matildas. Matildas captain Steph Catley is one of 30 nominees for the Ballon d'Or Feminin, the top individual international award in football.\n\n\"We are looking to make the most of the next few FIFA women's international windows and Wales is the perfect test for the team as we have never played them before and they are a competitive side that will test our style of play,\" Montemurro said.\n\n\"It is important that we make the most of every opportunity together, to continually build on the relationships we are forming and setting high standards to enhance our high-performance environment.\"\n\nWales is ranked 32nd in the world.\n\nThe Welsh are yet to appear in a women's World Cup, but they did qualify for Euro 2025.\n\nThe Matildas only have two more international windows before they kick off their Asian Cup campaign against the Philippines in Perth on March 1.\n\nMontemurro was missing a host of the squad's biggest stars during his first set of matches in charge of the Matildas earlier this year.\n\nThe Matildas were fortunate to escape with an error-riddled 3–0 win over world number 38 Slovenia in Montemurro's first match at the helm.\n\nThe result was followed up by a 1–1 draw against the same opponents.\n\nAlarm bells were ringing when the Matildas slumped to a shock 1–0 loss to world number 56 Panama.\n\nBut a Michelle Heyman brace and Charli Grant's 91st-minute goal rescued a 3–2 win in the second match of the friendly series in West Australia.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-09/creatives-artificial-intelligence-productivity-commission/105620038",
        "title": "We can't throw Australian creatives and their work into the maws of Big Tech",
        "publish_date": "Fri, 08 Aug 2025 22:00:00 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "Ever since she was barely a teen, the only quarrels I have ever had with my adored niece, Winnie, have been over the royalties payable on intellectual property.\n\nI'm aware that sentence makes weekends at Auntie Virginia's sound like a real barrel of laughs. To be honest, such weekends could often include impromptu lectures on the only acceptable cheese for making cheese on toast, and the importance of making sure one's undies are actually on before going out (\"doesn't matter\", was usually her airy reply) but as she got older and brought her own worldview on movies, music and TV shows into my world — that's when we'd clash.\n\nShe was a fine representation of her generation and stood up with great gusto for the things that matter to them — to whit, ripping as much content as possible online and from streaming platforms without paying for it.\n\nWhat's yours is mine\n\nI was aghast. \"But you love those musicians! If you don't actually pay for their music, and pay them a living, how do you imagine they're going to be around to keep making the music you love?\"\n\nThe answers usually involved something about Sony/Apple/Netflix/Universal \"being able to afford it.\" Why should her friends care when they were broke teenagers staring into the content-rich maw of the mega-corporations?\n\nArtist fights back against AI fakes Photo shows Four members of Grammy nominated band Hiatus Kaiyote pose against pink backdrop Australian musician Paul Bender says a lack of security is making AI-generated Spotify scams easier than ever.\n\nMaybe it was their version of sticking it to the man, the man being the billionaire nerd who now controlled their every means of communication.\n\nAnd she wasn't copping from me what she regarded as some gen X hypocrisy: \"You taped songs from the radio and copied songs onto 'mixed tapes' — what's the difference?\" (You and I know that radio stations pay royalties for playing those songs, and you had to have the hard copy of the music in your hands in the first place to make the mix … but let's leave it there.)\n\nShe and her generation had been trained by experts to take and share content, and to unhesitatingly share their data and privacy back: what's yours is mine, what's mine is yours.\n\nMy philosophical battle with Winnie is on my mind because we stand at the brink of a generational fight over the importance of IP and its value to the creator, and I have a terrible feeling that if you are 50 or older, then we are going to be fighting this on our own.\n\nWe stand at the brink of a generational fight over the importance of IP and its value to the creator. (Unsplash: Glenn Carstens-Peter)\n\nAI could be trained on copyrighted Australian work\n\nIn an interim report released this week, the Productivity Commission has put forward a bold proposal: a text and data mining exception to the Australian Copyright Act. Put simply, this would legalise using Australian copyrighted material to train AI large language models — ChatGPT and the like. The proposal aims to slot AI training into the existing \"fair dealing\" exceptions already built into copyright law.\n\nWhy is this on the table now? Because the commission sees a potential windfall for the Australian economy — an estimated $116 billion over the next decade — fuelled by developments in AI and digital tech. Harnessing data this way isn't just about innovation, the commission says, it's about a very real shot at economic growth.\n\nJim Chalmers is pitching himself as a Goldilocks on AI Photo shows Jim Chalmers Treasurer Jim Chalmers is optimistic the benefits of AI will ultimately outweigh the risks.\n\nAh, growth! The sole defining feature of a successful modern economy. Even at a time with the failures of late-stage capitalism collapsing around us like the special effects of a Marvel movie, we cling to this as the only ideal, the only aim. And, in service to this ideal, the commission would like us to be comfortable with trading away the few financial benefits that come from original creativity.\n\nOnce again, I'm aghast. Artists have already had to make the worst deal of their lives with streaming services, trading away what would have been worth a fortune, even during the \"bad\" old days of big, bad record labels. Please watch this interview with songwriter Julianna Zachariou, who adds up live on air what she makes from a Spotify stream, and you'll never feel the same about your music streaming services: she's talking about numbers that, as sold records as part of a decent contract, would have made her an actual millionaire in the 1970s.\n\nThis new proposal means taking away, for free, the one and only thing that creatives make and from which they can make money. We should all be astonished at the suggestion.\n\nLoading...\n\nFree food for Big Tech\n\nI know I'm not surprising you with this point of view: you would expect someone like me, who spends their time celebrating original creativity, to be appalled at the notion that the copyrighted work of creatives can be used as literal free food into the aforementioned maws of Big Tech to enable them to get even richer.\n\nStatement against AI training passes 50,000 signatures Photo shows Composite image of Charles Dance, Thom Yorke, and Julianne Moore on various red carpets More than 50,000 people have called for an end to the unlicensed use of creative work to train generative AI models.\n\nAs someone who struggles mightily with the existing \"fair dealing\" provisions in producing the ABCTV show Creative Types — we have to tie ourselves in knots justifying the use of 45 seconds of a film even when it's part of a relevant, thoughtful, highly analytical discussion about the detail of said copyrighted work, and mostly we can't get there because of the law's restrictions. It infuriates me that content-making like mine will remain hard, while self-enriching will get easier for the behemoths.\n\nThe move seems so foolish that opposing it seems self-evident. That's when you know it'll probably get through. On countless subjects, including even the safety of children, Big Tech has escaped unsanctioned and unregulated. Of course, they've managed to persuade institutions like the Productivity Commission that getting more for nothing is in everyone's interests.\n\nLoading...\n\nAn educated world?\n\nSince those childhood days, younger Australians like my Winnie have stepped back from total absorption by the online world: she is protective of her privacy. And she is also as angry as me at how little this digital world has benefited the hard work of the musicians she loves.\n\nSign up for Weekend Reads in your inbox Photo shows Virginia Trioli in a stylish suit on a set with lighting behind her Start your weekend with the best of the ABC's journalism, presented by Virginia Trioli. Discover compelling features, big ideas and revealing analysis to understand the stories that matter to Australians.\n\nBut the machines and those who run them have the whip hand now. Decades after Isaac Asimov predicted his happy world where \"machines will do the work that makes life possible and that human beings will do all the other things that make life pleasant and worthwhile\", we have finally made the trades that allow it. But it looks like we may have forgotten his most important qualifier. Asimov had a condition for this reality: \"A properly automated and educated world.\"\n\nIn our rush to hand off the work that we imagine to be a waste of our time, we've failed to educate ourselves on the real consequences. Asimov never wanted the consequences of his predicted world to be one without art.\n\nThis weekend, we have some wonderful writing for you on maps, gold, libraries and there's new music to share too — just make sure you pay for it at some stage.\n\nHave a safe and happy weekend, and here's some new music, a dream-pop song from that true original, Chappell Roan, who isn't the kind of person to hand off any of her work for free — maybe the generation worm will turn. Go well.\n\nVirginia Trioli is presenter of Creative Types and a former co-host of ABC News Breakfast and Mornings on ABC Radio Melbourne.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-08-09/ashes-england-australia-chris-waokes-shoulder-injury/105631996",
        "title": "Woakes may opt for rehab over surgery in race to be fit for Ashes",
        "publish_date": "Fri, 08 Aug 2025 21:18:17 +0000",
        "category": "sports",
        "authors": [],
        "text": "England all-rounder Chris Woakes says rehabilitation is a risk he is willing to take to be fit for the men's Ashes, rather than undergoing surgery on the shoulder injury he sustained during last week's fifth Test against India.\n\nWoakes, 36, is awaiting scan results after suffering a suspected dislocated shoulder on the opening day of the series finale at The Oval when he landed awkwardly trying to save a boundary.\n\nHis options would be either surgery or rehabilitation to strengthen the shoulder, judging by the extent of the damage.\n\nThe first Ashes Test begins in Perth on November 21.\n\n\"I suppose … there will be a chance of a recurrence, but that could be a risk that you're just willing to take,\" Woakes told the BBC.\n\nIndia claims fifth Test in nailbiting finish despite Woakes heroics Photo shows A man in a cricket uniform with one arm in a sling walks towards another man holding a cricket bat Chris Woakes comes out to bat with his dislocated shoulder in a sling, but England falls six runs short in a stunning finale to the five-Test series.\n\n\"From what I've heard from physios and specialists, the rehab of a surgery option would be closer to three to four months.\n\n\"That's obviously touching on the Ashes and Australia, so it makes it tricky.\n\n\"From a rehab point of view, you can probably get it strong again within eight weeks.\n\n\"So that could be an option, but again, obviously, still waiting to get the full report on it.\"\n\nWoakes returned to bat on the final morning of the fifth Test with his left arm strapped in a sling as England pushed for a series win.\n\nEntering at number 11 with 17 runs still needed, he did not face a ball but ran four before Gus Atkinson (17) was bowled, leaving India to seal a six-run victory that levelled the series at 2–2.\n\nWoakes received praise for his bravery, although he downplayed his effort by saying his teammates would have done the same.\n\n\"In my eyes it was just business as usual … in that moment it was to go out there and try and find a way with Gus at the other end to try and get us over the line,\" he said.\n\n\"Unfortunately, it didn't happen but I'm grateful and thankful that I put up the fight and tried to do it for the team.\"\n\nReuters",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/pies-recall-mitchell-howe-frampton-to-take-on-hawks-afl-round-22-teams-and-expert-tips-20250806-p5mkom.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "No changes for Bulldogs: AFL round 22 teams and expert tips",
        "publish_date": "Sat, 09 Aug 2025 11:44:18 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Carlton Backs A.Saad, J.Weitering, M.Carroll Half-backs: L.Cowan, L.Young, N.Haynes Centres: B.Acres, P.Cripps, A.Moir Half-forwards: O.Hollands, H.McKay, W.White Forwards: L.Fogarty, H.O’Keeffe, Z.Williams Followers: T.De Koning, C.Lord, G.Hewett Interchange: B.Wilson, C.Durdin, F.Young, J.Motlop, F.Evans Emergencies: J.Binns, M.Pittonet, A.Cincotta In: H.O’Keeffe, B.Wilson Out: H.O’Farrell (injured), M.Pittonet (omitted)\n\nSydney Backs: L.Melican, D.Rampe, T.McCartin Half-backs: C.Mills, N.Blakey, S.Wicks Centres: O.Florent, Ch.Warner, J.Lloyd Half-forwards: J.Rowbottom, J.Buller, J.Jordon Forwards: J.McInerney, T.Papley, J.Dattoli Followers: B.Grundy, I.Heeney, E.Gulden Iinterchange: H.Cunningham, A.Sheldrick, B.Campbell, H.McLean, C.Cleary Emergencies: P.Ladhams, M.Roberts, Co.Warner In: H.McLean Out: P.Ladhams (omitted)\n\nBrisbane Lions Backs: D.Zorko, D.Gardiner, T.Doedee Half-backs: D.Wilmot, H.Andrews, B.Starcevich Centres: J.Fletcher, H.McCluggage, J.Berry Half-forwards: C.Cameron, E.Hipwood, Z.Bailey Forwards: C.Rayner, L.Morris, C.Ah Chee Followers: D.Fort, J.Dunkley, W.Ashcroft Interchange: L.Ashcroft, S.Marshall, H.Smith, W.McLachlan, B.Reville Emergencies: D.Robertson, L.Beecken, D.Joyce In: T.Doedee, W.McLachlan Out: R.Lester (injured), L.Neale (injured)\n\nFremantle Backs: L.Ryan, B.Cox, A.Pearce Half-backs: H.Chapman, K.Worner, J.Clark Centres: J.O’Meara, S.Bolton, N.O’Driscoll Half-forwards: S.Switkowski, P.Voss, M.Reid Forwards: M.Frederick, J.Treacy, J.Amiss Followers: L.Jackson, C.Serong, A.Brayshaw Interchange: I.Dudley, S.Darcy, N.Fyfe, N.Erasmus, B.Banfield Emergencies: B.Walker, J.Sharp, O.McDonald In: A.Pearce, N.Fyfe Out: O.McDonald (omitted), H.Young (injured)\n\nPort Adelaide Backs: K.Farrell, B.Zerk-Thatcher J.Sinn Half-backs: C.Rozee, A.Aliir, La.Jones Centres: J.Berry, W.Drew, M.Liddy Half-forwards: D.Byrne-Jones, J.Lukosius, T.Boak Forwards: J.McEntee, M.Georgiades, J.Richards Followers: J.Sweet, O.Wines, Z.Butters Interchange: W.Rioli, C.Moraes, W.Lorenz, O.Lord, J.Mead Emergencies: J.Whitlock, E.Mackinlay, J.Finlayson In: C.Rozee, J.Lukosius, W.Rioli, C.Moraes Out: J.Burgoyne (Injured), J.Whitlock (Omitted), H.Jackson (Omitted), D.Williams (Omitted)\n\nGold Coast Backs: B.Uwland, M.Andrew, S.Collins Half-backs: J.Noble, W.Powell, J.Jeffrey Centres: L.Weller, M.Rowell, B.Fiorini Half-forwards: T.Miller, B.Ainsworth, B.Humphrey Forwards: B.Long, J.Farrar, B.King Followers: J.Witts, A.Davies, N.Anderson Interchange: N.Holman, E.Read, C.Budarick, M.Rosas, O.Adams Emergencies: A.Sexton N.Moyle J.Rogers In: M.Rosas Out: S.Flanders (Injured)\n\nWestern Bulldogs Backs: L.Bramble 29 J.Busslinger 5 J.O’Donnell 18 Half Backs: L.Cleary 36 R.Lobb 7 J.Johannisen 39 Centres: O.Baker 13 E.Richards 20 B.Dale 31 Half Forwards: R.Sanders 9 A.Naughton 33 M.Kennedy 8 Forwards: C.Poulter 25 S.Darcy 10 R.West 14 Followers: T.English 44 M.Bontempelli - C 4 T.Liberatore 21 I/C: J.Freijah 27 R.Garcia 38 L.McNeil 30 L.Vandermeer 23 B.Williams 34 Emergency: S.Davidson 42 J.Dolan 26 B.Khamis 24 No changes\n\nMelbourne Backs: J.Bowey 17 T.McDonald 25 T.Rivers 24 Half Backs: C.Salem 3 D.Turner 10 B.Howes 22 Centres: J.Culley 46 C.Petracca 5 T.Sparrow 32 Half Forwards: H.Langford 19 B.Fritsch 31 K.Chandler 37 Forwards: J.Melksham 18 J.van Rooyen 2 K.Pickett 36 Followers: M.Gawn - C 11 J.Viney 7 E.Langdon 15 Interchange: J.McVee 4 C.Windsor 6 C.Oliver 13 J.Adams 26 H.Petty 35 Emergency: M.Jefferson 21 T.Campbell 29 H.Sharp 30 In: J.Adams Out: H.Sharp (omitted)\n\nNorth Melbourne Backs: C.Comben 30 T.Pink 32 G.Logue 19 Half Backs: R.Hardeman 17 C.Daniel 5 F.O’Sullivan 2 Centres: D.Stephens 15 L.Davies-Uniacke 9 C.McKercher 10 Half Forwards: J.Konstanty 41 Z.Duursma 7 T.Powell 24 Forwards: L.Parker 26 J.Darling 28 C.Zurhaar 44 Followers: T.Xerri 38 H.Sheezel - C 3 G.Wardlaw 6 Interchange: B.Scott 8 G.Payne 23 C.Harvey 37 B.Teakle 43 C.Trembath 47 Emergency: W.Phillips 29 F.Maley 39 R.Hansen Jr 46 In: T.Xerri, B.Scott, G.Payne, C.Trembath Out: P.Curtis (suspension), N.Larkey (injured), Z.Banch (injured), R.Hansen Jr (omitted)\n\nGWS Giants Backs: C.Idun 39 S.Taylor 15 H.Himmelberg 27 Half Backs: L.Whitfield 6 L.Aleer 21 L.Ash 7 Centres: S.Coniglio 3 X.O’Halloran 33 R.Angwin 9 Half Forwards: T.Bedford 14 A.Cadman 5 D.Jones 2 Forwards: T.Greene - C 4 J.Riccardi 26 J.Stringer 20 Followers: K.Briggs 32 F.Callaghan 17 T.Green 12 Interchange: J.Fonti 37 C.Brown 46 H.Rowston 24 M.Gruzewski 35 H.Thomas 1 Emergency: L.Keeffe 25 J.Leake 30 J.Wehr 10 In: T.Greene, M.Gruzewski Out: T.McMullin (injured), J.Hogan (managed)\n\nWest Coast\n\nBacks: R.Bazzo 33 S.Brock 41 T.Cole 28\n\nHalf Backs: T.McCarthy 45 R.Ginbey 7 L.Duggan - C 14\n\nCentres: C.Chesser 18 T.Kelly 11 J.Graham 17\n\nHalf Forwards: L.Baker 3 J.Shanahan 35 M.Owies 16\n\nForwards: L.Ryan 1 A.Reid 22 J.Cripps 15\n\nFollowers: M.Flynn 25 B.Hough 19 E.Hewett 8\n\nInterchange: T.Brockman 10 R.Maric 23 T.Gross 27 C.Hall 29 H.Davis 38\n\nEmergency: J.Petruccelle 21 B.Williams 32 J.Williams 34\n\nIn: S.Brock, J.Graham, M.Flynn\n\nOut: H.Edwards (injured), T.Dewar (omitted), B.Williams (omitted)\n\nAdelaide\n\nBacks: J.Worrell 24 N.Murray 9 H.Bond 40\n\nHalf Backs: W.Milera 30 M.Keane 48 R.Laird 29\n\nCentres: I.Cumming 44 J.Dawson - C 12 D.Curtin 6\n\nHalf Forwards: B.Keays 2 R.Thilthorpe 7 A.Neal-Bullen 28\n\nForwards: I.Rankine 23 D.Fogarty 32 C.Burgess 21\n\nFollowers: R.O’Brien 43 J.Peatling 25 J.Soligo 14\n\nInterchange: C.Jones 1 M.Hinge 20 S.Berry 3 L.Pedlar 10 Z.Taylor 19\n\nEmergency: J.Borlase 35 L.Murphy 4 H.Schoenberg 26\n\nIn: R.Laird, C.Burgess, L.Pedlar\n\nOut: T.Walker (Managed), B.Cook (Omitted), B.Smith (Omitted)\n\nKeep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/lifestyle/sarah-fergusons-birthday-post-for-daughter-beatrice-20250809-p5mlmw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sarah Ferguson's birthday post for daughter Beatrice",
        "publish_date": "Sat, 09 Aug 2025 10:48:06 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Sarah Ferguson's birthday post for daughter Beatrice\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/apollo-13-commander-jim-lovell-dies-at-97-20250809-p5mlmu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Apollo 13 commander Jim Lovell dies at 97",
        "publish_date": "Sat, 09 Aug 2025 10:43:56 +1000",
        "category": "finance",
        "authors": [],
        "text": "Apollo 13 commander Jim Lovell dies at 97\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/bidding-blind-sydney-20250724-p5mhkj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bidding blind Sydney",
        "publish_date": "Sat, 09 Aug 2025 10:34:30 +1000",
        "category": "finance",
        "authors": [],
        "text": "Exclusive\n\nJosh Tesolin earned his nickname “Teflon” for his seeming ability to skirt close to breaching the rules of real estate without ever coming unstuck by them. That ended on Saturday.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/shiel-under-scrutiny-20250809-p5mlmq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Shiel under scrutiny",
        "publish_date": "Sat, 09 Aug 2025 10:18:04 +1000",
        "category": "finance",
        "authors": [],
        "text": "Shiel under scrutiny\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/three-big-names-in-mix-to-play-springboks-in-huge-boost-for-wallabies-20250809-p5mlmd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Three big names in mix to play Springboks in huge boost for Wallabies",
        "publish_date": "Sat, 09 Aug 2025 10:00:52 +1000",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "Rob Valetini, Will Skelton and Taniela Tupou are all in contention to play for the Wallabies next Sunday morning in Johannesburg.\n\nSouth Africa have won more than 70 per cent of the Tests they’ve played on the high veldt at Ellis Park and the addition of the form trio would be a huge boost for the Wallabies, given their last win at the stadium was 62 years ago.\n\nValetini missed the first and third Tests of the British and Irish Lions series due to a calf injury, while Skelton did not play in the first Test with the same issue. Tupou has been nursing a toe injury after an outstanding performance in the third Test against the Lions.\n\nSpeaking to this masthead at Sydney Airport on Saturday morning before departing for South Africa, Wallabies coach Joe Schmidt said all three forwards will push for selection against the world champions in Johannesburg.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/far-away-from-home-i-fell-in-love-with-australian-music-again-20250806-p5mkob.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Far away from home, I fell in love with Australian music again",
        "publish_date": "Sat, 09 Aug 2025 09:45:00 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "What in the World, a free weekly newsletter from our foreign correspondents, is sent every Thursday. Below is an excerpt. Sign up to get the whole newsletter delivered to your inbox.\n\nWashington: On a recent Wednesday night, I found myself in New York revisiting the new Australian bar that’s opened up in Lower Manhattan. I first wrote about Old Mates pub in April, finding it was a surprise hit with discerning New Yorkers as well as the expat crowd.\n\nI came back to see The Wiggles. Not in their usual coloured skivvies, but in casual pub attire for a free gig at the end of their month-long US tour.\n\nWiggles Simon Pryce (second from left) and Anthony Field (second from right) with friends outside Old Mates pub in New York City after a one-off free gig for adults. Credit: Michael Koziol\n\nThe crowd might have been adults-only, but the set list wasn’t, with plenty of Wiggles favourites mixed with karaoke renditions of You’re So Vain and a rocking version of The Cockroaches’ She’s the One. The boisterous New York audience wouldn’t let them leave without performing Hot Potato, while Dominic Field – sans Wiggles’ tree costume – brought the house down with the hoedown-style Rattlin’ Bog, an Irish folk song.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/underquoting-dummy-bidding-false-documents-why-teflon-sydney-agent-was-suspended-20250807-p5ml59.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Underquoting, dummy bidding, false documents: Why ‘Teflon’ Sydney agent was suspended",
        "publish_date": "Sat, 09 Aug 2025 09:39:11 +1000",
        "category": "finance",
        "authors": [
            "Lucy Macken"
        ],
        "text": "We lift the lid on an open secret in Australia’s property market that’s costing potential buyers millions.\n\nHigh-earning real estate agent Josh Tesolin has openly admitted that he has been the subject of an ongoing investigation by the NSW Office of Fair Trading in recent months, publicly decrying what he might have done to earn such scrutiny.\n\n“I’d like to hear what it is. And I’d like to respond back as fully as possible with the truth,” said Tesolin, known among his contemporaries as “Teflon Josh”.\n\nNow he knows: Dummy bidding, underquoting, high pressure sales tactics and producing false documents to Fair Trading are among the allegations being levelled against one of Australia’s highest-earning real estate agents.\n\nStar agent Josh Tesolin pictured leaving his Bella Vista home on Friday. Credit: Sam Mooy\n\nAn extensive investigation by the regulator has landed Tesolin and his private real estate company, Tesolin Consulting, a four-month licence suspension – pending possible disciplinary action – over allegations that he has committed serious and repeated breaches of the law.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/safe-hands-and-sliding-doors-the-incredible-legacy-of-mark-schwarzer-20250731-p5mj7w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Safe hands and sliding doors: The incredible legacy of Mark Schwarzer",
        "publish_date": "Sat, 09 Aug 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Mark Schwarzer can still recall the look of terror in Eddie Thomson’s eyes. It was 1993, and Australia was playing a World Cup qualifier against Canada in Edmonton. Fifteen minutes into the match, goalkeeper Robert Zabica made a rash challenge on striker Dale Mitchell, who had broken through the Socceroos’ defensive line and was bearing down on goal. Mark Schwarzer made two penalty shootout savess for the Socceroos in 1993 but it wasn’t until more than a decade later that he became a household name. Credit: SMH Zabica clattered into him just outside his box. Schwarzer, aged 20 and just a couple of months removed from winning the National Soccer League grand final with Marconi, was expecting him to be shown a yellow card. But after a period of deliberation, the referee produced a straight red – prompting a shocked Thomson, the then-Socceroos coach, to turn to his bench and look at the player he’d have to send on. “I remember Eddie Thomson just turning to me with his eyes wide open,” Schwarzer says. “Probably thinking: ‘Oh my god. Now I’ve got to play him’.” In a more just world, Schwarzer wouldn’t have even been there. He’d been called up only because Mark Bosnich, then Australia’s best goalkeeper, chose club over country, a common dilemma before FIFA introduced designated international windows in 2002. The Canada games clashed with the start of the Premier League season, and Bosnich, trying to cement his spot at Aston Villa, withdrew. Schwarzer got the last-minute call-up.\n\nAdvertisement\n\nIn his Aston Villa days, Mark Bosnich was considered one of the best goalkeepers in the English Premier League. Credit: Reuters “It was such an unfair scenario for ‘Bozza’ and other players to be in,” Schwarzer says. “It was completely out of order for them to be put in that position. The good thing is it’s been changed. But obviously, whenever those sort of scenarios develop, there’s more often than not someone else who benefits from it.” That was him. These were the inauspicious circumstances that launched his almost 20-year international career: one that spanned four World Cup cycles, a record 109 caps and some of the most important moments in Australian football history. It has now been recognised with a place in the Sport Australia Hall of Fame, making him just the ninth footballer to be inducted. It wasn’t the steadiest start. After coming on, Schwarzer conceded at his near post as Canada prevailed 2-1 over the 10-man Socceroos but in the second leg in Sydney, Australia won by the same scoreline, forcing the tie into extra time and then penalties: Schwarzer emerged as the hero by making two saves in the shootout. Bosnich was back in the team by the time the Socceroos faced Diego Maradona’s Argentina in another losing World Cup qualifying play-off. It wasn’t until another two saves in a shootout more than a decade later, against Uruguay, that Schwarzer would become a household name, and that the Socceroos would actually break their long World Cup drought. ‘There were football fans that were born that night’\n\nAdvertisement\n\nThe story of “that night”, as it has come to be known – Mark Bresciano’s goal, Tony Popovic’s substitution after just 31 minutes for Harry Kewell, the tension of extra time, Schwarzer’s famous stops to deny Darío Rodríguez and Marcelo Zalayeta’s penalties, Mark Viduka’s miss, the eternal image of a shirtless John Aloisi wheeling away after scoring his, and how it all turbocharged the growth of the sport in Australia – has been told and retold so many times that, in truth, there is nothing new to say about it. But the impact still echoes today. This year marks the 20th anniversary of that landmark achievement – one that, without a hint of hyperbole, Schwarzer believes changed not only the face of Australian sport, but the trajectory of thousands upon thousands of lives, far beyond the players and coaches who were directly involved. As he processed the heartbreak of their failure against Uruguay four years earlier, Schwarzer remembers sitting on the team bus in Montevideo, telling himself: “We just need to qualify. If we qualify, the game is going to change.” As a young fan, Schwarzer remembers watching the Socceroos continually fall short of qualification, contemplating the possibility that it would never actually happen. “We’re never going to get there. We’re just so far away from it,” he thought. “You just felt that there was something seriously missing.\n\nAdvertisement\n\n“And then obviously as a player, at that stage in my career, I was thinking: ‘Gosh. Am I going to miss out on this opportunity? Is it going to be after I finish playing that we’re going to qualify? Am I going to be one of these players that just misses out, like so many – like Ned Zelic, Paul Okon, just to name a couple’. They were instrumental in us coming through as players. They were kind of like the pioneers of the game … they missed out. I still sometimes think about it.” Mark Schwarzer played for the Socceroos on 109 occasions, more than any other player in history. Credit: Getty Images Strikers always get the glory, so Aloisi’s celebration became the enduring symbol but Schwarzer’s performance was a seminal moment of its own. It became the benchmark by which all future Australian penalty shootouts would be measured, and it inspired many young footballers to pick up the gloves. “It’s a ripple effect on not just football players, but the football community,” he says. “There were football fans that were born that night, that were sucked into supporting the national team. As players who were playing week in, week out at the highest levels, in front of massive crowds and massive stadiums. It was hard to take, going back to Australia not having that all the time. “For people not to fully understand, or to really get that feeling of what it’s like to go to a World Cup … we’ve seen it, we’ve watched it but we’ve never been part of it. We all talked about it. We knew that things would change. Part of it was always about, if you can create change as big as this, to qualify again for only our second World Cup, after 32 years, this rollercoaster of emotions and experiences that we’d all been part of … but none of us thought it would change to the effect that it did.” ‘The boys won the title, not me’\n\nAdvertisement\n\nSetting aside his contribution at international level, Schwarzer’s club career alone is possibly grounds for Hall of Fame induction. After enduring some tough early years in Germany, the country of his parents’ heritage, he made his name in England. Indeed, no Aussie has played more often in the Premier League than Schwarzer, who made 514 appearances across 21 seasons for Middlesbrough, Fulham, Chelsea and Leicester City. The next best, Lucas Neill, made 279 appearances, so it’s almost impossible to imagine anyone bettering Schwarzer’s record, a testament to his longevity, which was incredible even for goalkeepers, who tend to have longer careers than outfields and who can play on into their 40s, as he did. “The beauty of the position is if you’re able to maintain your levels of fitness and be a little bit lucky in terms of injuries, you’re able to play a lot longer than most outfield players,” he says. “That was obviously something that I was able to do.” Through all of that time, Schwarzer won just one trophy. Well, there are two others, for which he gives himself zero credit but those aside, it’s just the 2003-04 League Cup he helped Middlesbrough win as their starting goalkeeper, coming in his seventh season of regular football. His only regret? That was in 2010, when Arsene Wenger wanted to bring him to Arsenal. Schwarzer was 37 and eager to play for a club that was not only contending for the Premier League title, but also playing in the UEFA Champions League – a new experience for him. Harry Kewell and Mark Schwarzer in 2005. Credit: Getty Images At first, Fulham were open to selling him; manager Roy Hodgson told Schwarzer as such. But then Hodgson moved to Liverpool, and his replacement Mark Hughes was interested in letting him only go if the Cottagers could bring in another goalkeeper first. That didn’t happen, and the door was slammed shut. “That was the one and only time in my career that I really struggled with a decision,” Schwarzer says. “I was desperate, and I was doing everything I possibly could to facilitate the move, but the club were working completely against me.”\n\nAdvertisement",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/a-wallabies-upset-in-south-africa-no-longer-seems-so-fanciful-20250808-p5mlcx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A Wallabies upset in South Africa no longer seems so fanciful",
        "publish_date": "Sat, 09 Aug 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "The Wallabies squad announced on Thursday had some big inclusions: Will Skelton and James O’Connor.\n\nGranted, they were already part of the British and Irish Lions series but their employers are in Europe and that has not always made it easy for the Wallabies. Their selections felt like victories and the fact they are heading to South Africa speaks volumes about what is going on inside the Wallabies camp at present: it’s evidently a rewarding and stimulating environment.\n\nThere will be frustration that they didn’t get the job done against the Lions but a belief that they are building something. Players obviously want to be part of that, and the desire from numbers 1-23 to run through brick walls in Sydney in the third Lions Test is all you could ask for before two Tests against the Springboks in South Africa.\n\nThe world champions are heavy favourites, and their fans will be expecting nothing less than two comprehensive wins, but even the most pessimistic, here’s-another-false-dawn Wallabies supporter should acknowledge that there was something stirring in that Sydney victory.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/racing/randwick-races-postponed-after-heavy-overnight-rain-20250809-p5mlm9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Randwick races postponed after heavy overnight rain",
        "publish_date": "Sat, 09 Aug 2025 09:24:09 +1000",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "The first group race of the season in NSW, the Missile Stakes, could remain just that despite the postponement of the meeting at Randwick on Saturday.\n\nAustralian Turf Club and Racing NSW officials were in talks about rescheduling the group 2 over 1200m, the lone feature on the program, after the Randwick meeting was washed out following 45mm of rain overnight and into the early morning on Saturday. It meant the course had received 87mm in the past week and 174mm during the past 30 days.\n\nWar Eternal, which was set to contest the Missile Stakes, surges to victory on a rain-affected Randwick track last year. Credit: Getty Images\n\nStewards made the call just after 7.30am, given predictions of more rain throughout the day.\n\n“We’ve received over 45mms since nine o’clock last night,” Racing NSW chief steward Tom Moxon told Sky Racing.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/car-smashes-into-dental-surgery-in-melbourne-20250809-p5mlmf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Car smashes into dental surgery in Melbourne",
        "publish_date": "Sat, 09 Aug 2025 09:22:45 +1000",
        "category": "finance",
        "authors": [],
        "text": "Car smashes into dental surgery in Melbourne\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/victoria/erin-pattersons-relationship-with-her-in-laws-20250808-p5mlky.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Erin Patterson's relationship with her in-laws",
        "publish_date": "Sat, 09 Aug 2025 08:34:58 +1000",
        "category": "finance",
        "authors": [],
        "text": "Erin Patterson's relationship with her in-laws\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/the-department-of-health-investigation-20250808-p5mlkt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Department of Health investigation",
        "publish_date": "Sat, 09 Aug 2025 08:33:54 +1000",
        "category": "finance",
        "authors": [],
        "text": "The Department of Health investigation\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/the-dehydrator-lie-20250808-p5mlkr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The dehydrator lie",
        "publish_date": "Sat, 09 Aug 2025 08:32:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "The dehydrator lie\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/global-fertility-rates-are-dropping-it-could-spell-disaster-in-the-future/durg3suwi",
        "title": "Global fertility rates are dropping: it could spell disaster in the future",
        "publish_date": "Fri, 8 Aug 2025 21:30:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/the-biggest-rodeo-in-the-southern-hemisphere/at6m27csu",
        "title": "The biggest rodeo in the southern hemisphere",
        "publish_date": "Fri, 8 Aug 2025 09:51:28 +0000",
        "category": "sports",
        "authors": [],
        "text": "The biggest rodeo in the southern hemisphere\n\nPublished 8 August 2025, 8:34 am\n\nThe 2025 Mount Isa Mines Rodeo kicked off in Queensland today. The event, which runs over three days, is seen as a terrific way to highlight what the city has to offer. Queensland Correspondent Jesmine Cheong filed this report.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/australia-stands-strong-on-global-plastic-pollution-treaty/wnhn9oqub",
        "title": "Australia stands strong on global plastic pollution treaty",
        "publish_date": "Fri, 8 Aug 2025 09:45:49 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia stands strong on global plastic pollution treaty\n\nPublished 8 August 2025, 8:34 am\n\nAustralia says it will hold firm on its support for a global treaty to curb plastic pollution, in the face of pressure from the United States to reject the terms of the pact. A UN meeting this week has been aimed at breaking a deadlock in efforts to broker the agreement.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/is-the-rba-about-to-cut-rates-as-consumers-become-more-confident/urwgzkovr",
        "title": "Is the RBA about to cut rates as consumers become more confident?",
        "publish_date": "Fri, 8 Aug 2025 08:32:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/does-putin-really-want-peace-netanyahus-plan-to-conquer-gaza-all-quiet-on-the-korean-front/4miggqg81",
        "title": "Does Putin really want Peace? Netanyahu’s plan to ‘conquer’ Gaza & all quiet on the Korean front",
        "publish_date": "Fri, 8 Aug 2025 06:49:48 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/matilda-named-in-2025-balloon-dor-shortlist/ujyi1uiez",
        "title": "Matildas captain Steph Catley scores Ballon d'Or nomination",
        "publish_date": "Fri, 8 Aug 2025 01:41:57 +0000",
        "category": "sports",
        "authors": [],
        "text": "Matildas captain Steph Catley has been named among the world's top 30 players, earning a nomination for the 2025 women's Ballon d'Or.\n\n\n\n\n\nThe 31-year-old Arsenal defender, a key figure in the London club's Women's Champions League victory, is the only Australian to be shortlisted this year.\n\n\n\n\n\nHer nomination follows a standout season at both club and national levels, where she has led the Matildas in the absence of injured captain Sam Kerr.\n\n\n\n\n\nShe is one of seven Arsenal players recognised in this year's Ballon d'Or list, which also features Spain's Mariona Caldentey and England stars Leah Williamson, Chloe Kelly and Alessia Russo.\n\n\n\n\n\nCatley is just the third Australian woman to be nominated for the Ballon d'Or since the women’s category was introduced in 2018, following in the footsteps of Kerr and Hayley Raso.\n\n\n\nREAD MORE All eyes on the Matildas but it hasn't always been this way\n\nWhat is the Ballon d'Or?\n\nThe Ballon d'Or, or Golden Ball, is considered the most prestigious individual prize in world football.\n\n\n\n\n\nFirst awarded to male players in 1956, the women's award was introduced in 2018 in response to the growing impact of women’s football worldwide.\n\n\n\n\n\nPresented annually by France Football magazine, the prize is voted on by a global panel of journalists, national coaches and team captains.\n\n\n\n\n\nIt recognises overall excellence, leadership and contribution to the game over the course of the season.\n\n\n\nREAD MORE I was a Matilda when we played in front of 50 people and had to pay for our hotels and flights\n\nThis year's winners will be announced in Paris on 22 September.\n\n\n\n\n\nKerr has been nominated five times for the Ballon d’Or, finishing second in 2023 and third in both 2021 and 2022, and Hayley Raso received her first nomination in 2023.\n\n\n\n\n\nCatley, who's been capped 138 times for her country, continues to play a crucial role for both club and country.\n\n\n\n\n\nHer nomination places her alongside some of the most influential players in the world and marks another milestone for Australian football.\n\n\n\n\n\n— With additional reporting from the Australian Associated Press\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/jim-chalmers-says-government-has-more-work-to-do-on-regulatory-reform-morning-news-bulletin-8-august-2025/kq2hruy7f",
        "title": "Jim Chalmers says government has more work to do on regulatory reform | Morning News Bulletin 8 August 2025",
        "publish_date": "Thu, 7 Aug 2025 20:30:59 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nTRANSCRIPT:\n\n\n\nTreasurer Jim Chalmers says the government has more work to do on regulatory reform\n\nYoung Australians urge government to set bold 2035 climate target\n\nRookie Tane Edmed not surprised he's been picked for the Wallabies\n\nFederal Treasurer Jim Chalmers admits the government has more work to do on regulatory reform, as the Productivity Commission releases its interim report on potential reforms to National Competition Policy.\n\n\n\n\n\nIt's found aligning Australian standards with international and overseas standards could provide an economic boosts of between 1.9 and 3.8 billion dollars per year.\n\n\n\n\n\nAnd it's found greater labour mobility for high-risk licensed occupations could be worth up to 846 million dollars per year.\n\n\n\n\n\nDr Chalmers says reform in these areas would ease burdens on business.\n\n\n\n\n\nThe government will hold a conference on reforms later this month.\n\n\n\n\n\n**\n\n\n\n\n\nClimate change activists say the federal government has to take into account the concerns of young people when setting its 2035 emissions reduction target.\n\n\n\n\n\nA national poll by YouGov, commissioned by activist groups the Climate Council and the Climate Action Network, has found 61 per cent of people want the government to do more on climate change.\n\n\n\n\n\nClimate Council Chief Executive Amanda McKenzie says support for action is particularly strong amongst younger people.\n\n\n\n\n\n\"We know that Australia's largest voting bloc- millennial and Gen Z - are concerned about climate chance. And, again, this shows up in this polling, where almost three-quarters of Gen Z voters expect the government to set a strong 2035 target.\"\n\n\n\n\n\nMillenials are generally defined as those born between 1981 and 1996, whilst Gen Z are those born between 1997 and 2012.\n\n\n\n\n\nThe government is required to set a 2035 emissions reduction target by the UN in the coming months, with activists urging that target to be 60 per cent or more.\n\n\n\n\n\n**\n\n\n\n\n\nA new report has found up to a third of schools in Queensland are in poor condition.\n\n\n\n\n\nThe Department of Education's Comprehensive Review of Infrastructure Renewal report says there is a maintenance backlog which would cost an $441 million to address.\n\n\n\n\n\nIt has identified a number of concerns with unsafe infrastructure that includes rotting ceilings in some school buildings.\n\n\n\n\n\nEducation Minister John-Paul Langbroek has blamed the report's findings on the previous Labor government, saying it is evidence the party did not spend enough on schools during their term in office.\n\n\n\n\n\n\"This is a report that Labor commissioned because they knew there were issues. These were issues we had last time we were in government when we had a significant maintenance backlog. And it's clear they knew about the issue. And the report shows they under-invested in maintenance, and that's to the detriment of our teachers and students.\"\n\n\n\n\n\n**\n\n\n\n\n\nThe United Nations is warning any further escalation in Gaza would be catastrophic, as Israel’s Security Cabinet considers expanding military operations in areas not yet under its control.\n\n\n\n\n\nMore than 61,250 Palestinians have been killed since the war began nearly two years ago, according to Gaza’s Health Ministry.\n\n\n\n\n\nMost of the population is now displaced and facing extreme hunger.\n\n\n\n\n\nAt least 42 more Palestinians were reportedly killed on Thursday.\n\n\n\n\n\nPrime Minister Benjamin Netanyahu tells Fox News Israel intends to completely occupy Gaza to remove Hamas and install a new civilian government, a move still pending cabinet approval.\n\n\n\n\n\nUN spokesperson Farhan Haq says such an escalation would severely worsen the crisis.\n\n\n\n\n\n\"We have already made clear the fact that the occupation of the occupied territories cannot and must not continue. It is not accepted under international law. Regarding the comments, we'll have to see what actions the government takes, and we will respond accordingly. But we have already make clear our concerns that any expansion of the conflict will be catastrophic.\"\n\n\n\n\n\nThe UN also warned that delivering aid will become nearly impossible if the fighting expands further.\n\n\n\n\n\n**\n\n\n\n\n\nCambodia and Thailand have formally agreed to a ceasefire following border clashes that began on the 24th of July.\n\n\n\n\n\nThe deal was signed at an extraordinary General Border Committee (GBC) meeting in Kuala Lumpur, attended by officials from both nations and observers from China, Malaysia, and the US.\n\n\n\n\n\nThe agreement commits both sides to halt all forms of fire, maintain current troop positions, and avoid military build-ups.\n\n\n\n\n\nCaptured soldiers will be treated according to international humanitarian law.\n\n\n\n\n\nAn ASEAN observer team, led by Malaysia, will monitor the ceasefire, with temporary oversight by defence attaches from ASEAN states.\n\n\n\n\n\nThe two sides also pledged to keep communication lines open, hold a Regional Border Committee meeting within two weeks, and convene the next G-B-C session within a month.\n\n\n\n\n\n**\n\n\n\n\n\nIn rugby union, Tane Edmed says he's not surprised to have been picked in the Australian squad for the start of The Rugby Championship, despite recently being out of the team.\n\n\n\n\n\nWith first-choice fly-half Tom Lynagh out with a concussion, Edmed has been picked in the 35-man squad to travel to Johannesburg to play South Africa in their tournament-opening game on Sunday week.\n\n\n\n\n\nEdmed has never played a Test for the Wallabies, but says his contact with coach Joe Schmidt made him feel he was a chance to be chosen, despite a poor ending to his Super Rugby season for the ACT Brumbies, and his not being picked in the Australian squad that recently played the British and Irish Lions.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/pies-recall-mitchell-howe-frampton-to-take-on-hawks-afl-round-22-teams-and-expert-tips-20250806-p5mkom.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "No changes for Bulldogs: AFL round 22 teams and expert tips",
        "publish_date": "Sat, 09 Aug 2025 11:44:18 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Carlton Backs A.Saad, J.Weitering, M.Carroll Half-backs: L.Cowan, L.Young, N.Haynes Centres: B.Acres, P.Cripps, A.Moir Half-forwards: O.Hollands, H.McKay, W.White Forwards: L.Fogarty, H.O’Keeffe, Z.Williams Followers: T.De Koning, C.Lord, G.Hewett Interchange: B.Wilson, C.Durdin, F.Young, J.Motlop, F.Evans Emergencies: J.Binns, M.Pittonet, A.Cincotta In: H.O’Keeffe, B.Wilson Out: H.O’Farrell (injured), M.Pittonet (omitted)\n\nSydney Backs: L.Melican, D.Rampe, T.McCartin Half-backs: C.Mills, N.Blakey, S.Wicks Centres: O.Florent, Ch.Warner, J.Lloyd Half-forwards: J.Rowbottom, J.Buller, J.Jordon Forwards: J.McInerney, T.Papley, J.Dattoli Followers: B.Grundy, I.Heeney, E.Gulden Iinterchange: H.Cunningham, A.Sheldrick, B.Campbell, H.McLean, C.Cleary Emergencies: P.Ladhams, M.Roberts, Co.Warner In: H.McLean Out: P.Ladhams (omitted)\n\nBrisbane Lions Backs: D.Zorko, D.Gardiner, T.Doedee Half-backs: D.Wilmot, H.Andrews, B.Starcevich Centres: J.Fletcher, H.McCluggage, J.Berry Half-forwards: C.Cameron, E.Hipwood, Z.Bailey Forwards: C.Rayner, L.Morris, C.Ah Chee Followers: D.Fort, J.Dunkley, W.Ashcroft Interchange: L.Ashcroft, S.Marshall, H.Smith, W.McLachlan, B.Reville Emergencies: D.Robertson, L.Beecken, D.Joyce In: T.Doedee, W.McLachlan Out: R.Lester (injured), L.Neale (injured)\n\nFremantle Backs: L.Ryan, B.Cox, A.Pearce Half-backs: H.Chapman, K.Worner, J.Clark Centres: J.O’Meara, S.Bolton, N.O’Driscoll Half-forwards: S.Switkowski, P.Voss, M.Reid Forwards: M.Frederick, J.Treacy, J.Amiss Followers: L.Jackson, C.Serong, A.Brayshaw Interchange: I.Dudley, S.Darcy, N.Fyfe, N.Erasmus, B.Banfield Emergencies: B.Walker, J.Sharp, O.McDonald In: A.Pearce, N.Fyfe Out: O.McDonald (omitted), H.Young (injured)\n\nPort Adelaide Backs: K.Farrell, B.Zerk-Thatcher J.Sinn Half-backs: C.Rozee, A.Aliir, La.Jones Centres: J.Berry, W.Drew, M.Liddy Half-forwards: D.Byrne-Jones, J.Lukosius, T.Boak Forwards: J.McEntee, M.Georgiades, J.Richards Followers: J.Sweet, O.Wines, Z.Butters Interchange: W.Rioli, C.Moraes, W.Lorenz, O.Lord, J.Mead Emergencies: J.Whitlock, E.Mackinlay, J.Finlayson In: C.Rozee, J.Lukosius, W.Rioli, C.Moraes Out: J.Burgoyne (Injured), J.Whitlock (Omitted), H.Jackson (Omitted), D.Williams (Omitted)\n\nGold Coast Backs: B.Uwland, M.Andrew, S.Collins Half-backs: J.Noble, W.Powell, J.Jeffrey Centres: L.Weller, M.Rowell, B.Fiorini Half-forwards: T.Miller, B.Ainsworth, B.Humphrey Forwards: B.Long, J.Farrar, B.King Followers: J.Witts, A.Davies, N.Anderson Interchange: N.Holman, E.Read, C.Budarick, M.Rosas, O.Adams Emergencies: A.Sexton N.Moyle J.Rogers In: M.Rosas Out: S.Flanders (Injured)\n\nWestern Bulldogs Backs: L.Bramble 29 J.Busslinger 5 J.O’Donnell 18 Half Backs: L.Cleary 36 R.Lobb 7 J.Johannisen 39 Centres: O.Baker 13 E.Richards 20 B.Dale 31 Half Forwards: R.Sanders 9 A.Naughton 33 M.Kennedy 8 Forwards: C.Poulter 25 S.Darcy 10 R.West 14 Followers: T.English 44 M.Bontempelli - C 4 T.Liberatore 21 I/C: J.Freijah 27 R.Garcia 38 L.McNeil 30 L.Vandermeer 23 B.Williams 34 Emergency: S.Davidson 42 J.Dolan 26 B.Khamis 24 No changes\n\nMelbourne Backs: J.Bowey 17 T.McDonald 25 T.Rivers 24 Half Backs: C.Salem 3 D.Turner 10 B.Howes 22 Centres: J.Culley 46 C.Petracca 5 T.Sparrow 32 Half Forwards: H.Langford 19 B.Fritsch 31 K.Chandler 37 Forwards: J.Melksham 18 J.van Rooyen 2 K.Pickett 36 Followers: M.Gawn - C 11 J.Viney 7 E.Langdon 15 Interchange: J.McVee 4 C.Windsor 6 C.Oliver 13 J.Adams 26 H.Petty 35 Emergency: M.Jefferson 21 T.Campbell 29 H.Sharp 30 In: J.Adams Out: H.Sharp (omitted)\n\nNorth Melbourne Backs: C.Comben 30 T.Pink 32 G.Logue 19 Half Backs: R.Hardeman 17 C.Daniel 5 F.O’Sullivan 2 Centres: D.Stephens 15 L.Davies-Uniacke 9 C.McKercher 10 Half Forwards: J.Konstanty 41 Z.Duursma 7 T.Powell 24 Forwards: L.Parker 26 J.Darling 28 C.Zurhaar 44 Followers: T.Xerri 38 H.Sheezel - C 3 G.Wardlaw 6 Interchange: B.Scott 8 G.Payne 23 C.Harvey 37 B.Teakle 43 C.Trembath 47 Emergency: W.Phillips 29 F.Maley 39 R.Hansen Jr 46 In: T.Xerri, B.Scott, G.Payne, C.Trembath Out: P.Curtis (suspension), N.Larkey (injured), Z.Banch (injured), R.Hansen Jr (omitted)\n\nGWS Giants Backs: C.Idun 39 S.Taylor 15 H.Himmelberg 27 Half Backs: L.Whitfield 6 L.Aleer 21 L.Ash 7 Centres: S.Coniglio 3 X.O’Halloran 33 R.Angwin 9 Half Forwards: T.Bedford 14 A.Cadman 5 D.Jones 2 Forwards: T.Greene - C 4 J.Riccardi 26 J.Stringer 20 Followers: K.Briggs 32 F.Callaghan 17 T.Green 12 Interchange: J.Fonti 37 C.Brown 46 H.Rowston 24 M.Gruzewski 35 H.Thomas 1 Emergency: L.Keeffe 25 J.Leake 30 J.Wehr 10 In: T.Greene, M.Gruzewski Out: T.McMullin (injured), J.Hogan (managed)\n\nWest Coast\n\nBacks: R.Bazzo 33 S.Brock 41 T.Cole 28\n\nHalf Backs: T.McCarthy 45 R.Ginbey 7 L.Duggan - C 14\n\nCentres: C.Chesser 18 T.Kelly 11 J.Graham 17\n\nHalf Forwards: L.Baker 3 J.Shanahan 35 M.Owies 16\n\nForwards: L.Ryan 1 A.Reid 22 J.Cripps 15\n\nFollowers: M.Flynn 25 B.Hough 19 E.Hewett 8\n\nInterchange: T.Brockman 10 R.Maric 23 T.Gross 27 C.Hall 29 H.Davis 38\n\nEmergency: J.Petruccelle 21 B.Williams 32 J.Williams 34\n\nIn: S.Brock, J.Graham, M.Flynn\n\nOut: H.Edwards (injured), T.Dewar (omitted), B.Williams (omitted)\n\nAdelaide\n\nBacks: J.Worrell 24 N.Murray 9 H.Bond 40\n\nHalf Backs: W.Milera 30 M.Keane 48 R.Laird 29\n\nCentres: I.Cumming 44 J.Dawson - C 12 D.Curtin 6\n\nHalf Forwards: B.Keays 2 R.Thilthorpe 7 A.Neal-Bullen 28\n\nForwards: I.Rankine 23 D.Fogarty 32 C.Burgess 21\n\nFollowers: R.O’Brien 43 J.Peatling 25 J.Soligo 14\n\nInterchange: C.Jones 1 M.Hinge 20 S.Berry 3 L.Pedlar 10 Z.Taylor 19\n\nEmergency: J.Borlase 35 L.Murphy 4 H.Schoenberg 26\n\nIn: R.Laird, C.Burgess, L.Pedlar\n\nOut: T.Walker (Managed), B.Cook (Omitted), B.Smith (Omitted)\n\nKeep up to date with the best AFL coverage in the country. Sign up for the Real Footy newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/lifestyle/sarah-fergusons-birthday-post-for-daughter-beatrice-20250809-p5mlmw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sarah Ferguson's birthday post for daughter Beatrice",
        "publish_date": "Sat, 09 Aug 2025 10:48:06 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "Sarah Ferguson's birthday post for daughter Beatrice\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/apollo-13-commander-jim-lovell-dies-at-97-20250809-p5mlmu.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Apollo 13 commander Jim Lovell dies at 97",
        "publish_date": "Sat, 09 Aug 2025 10:43:56 +1000",
        "category": "finance",
        "authors": [],
        "text": "Apollo 13 commander Jim Lovell dies at 97\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/bidding-blind-sydney-20250724-p5mhkj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bidding blind Sydney",
        "publish_date": "Sat, 09 Aug 2025 10:34:30 +1000",
        "category": "finance",
        "authors": [],
        "text": "Exclusive\n\nJosh Tesolin earned his nickname “Teflon” for his seeming ability to skirt close to breaching the rules of real estate without ever coming unstuck by them. That ended on Saturday.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/shiel-under-scrutiny-20250809-p5mlmq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Shiel under scrutiny",
        "publish_date": "Sat, 09 Aug 2025 10:18:04 +1000",
        "category": "finance",
        "authors": [],
        "text": "Shiel under scrutiny\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/three-big-names-in-mix-to-play-springboks-in-huge-boost-for-wallabies-20250809-p5mlmd.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Three big names in mix to play Springboks in huge boost for Wallabies",
        "publish_date": "Sat, 09 Aug 2025 10:00:52 +1000",
        "category": "sports",
        "authors": [
            "Jonathan Drennan"
        ],
        "text": "Rob Valetini, Will Skelton and Taniela Tupou are all in contention to play for the Wallabies next Sunday morning in Johannesburg.\n\nSouth Africa have won more than 70 per cent of the Tests they’ve played on the high veldt at Ellis Park and the addition of the form trio would be a huge boost for the Wallabies, given their last win at the stadium was 62 years ago.\n\nValetini missed the first and third Tests of the British and Irish Lions series due to a calf injury, while Skelton did not play in the first Test with the same issue. Tupou has been nursing a toe injury after an outstanding performance in the third Test against the Lions.\n\nSpeaking to this masthead at Sydney Airport on Saturday morning before departing for South Africa, Wallabies coach Joe Schmidt said all three forwards will push for selection against the world champions in Johannesburg.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/far-away-from-home-i-fell-in-love-with-australian-music-again-20250806-p5mkob.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Far away from home, I fell in love with Australian music again",
        "publish_date": "Sat, 09 Aug 2025 09:45:00 +1000",
        "category": "finance",
        "authors": [
            "Michael Koziol"
        ],
        "text": "What in the World, a free weekly newsletter from our foreign correspondents, is sent every Thursday. Below is an excerpt. Sign up to get the whole newsletter delivered to your inbox.\n\nWashington: On a recent Wednesday night, I found myself in New York revisiting the new Australian bar that’s opened up in Lower Manhattan. I first wrote about Old Mates pub in April, finding it was a surprise hit with discerning New Yorkers as well as the expat crowd.\n\nI came back to see The Wiggles. Not in their usual coloured skivvies, but in casual pub attire for a free gig at the end of their month-long US tour.\n\nWiggles Simon Pryce (second from left) and Anthony Field (second from right) with friends outside Old Mates pub in New York City after a one-off free gig for adults. Credit: Michael Koziol\n\nThe crowd might have been adults-only, but the set list wasn’t, with plenty of Wiggles favourites mixed with karaoke renditions of You’re So Vain and a rocking version of The Cockroaches’ She’s the One. The boisterous New York audience wouldn’t let them leave without performing Hot Potato, while Dominic Field – sans Wiggles’ tree costume – brought the house down with the hoedown-style Rattlin’ Bog, an Irish folk song.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/underquoting-dummy-bidding-false-documents-why-teflon-sydney-agent-was-suspended-20250807-p5ml59.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Underquoting, dummy bidding, false documents: Why ‘Teflon’ Sydney agent was suspended",
        "publish_date": "Sat, 09 Aug 2025 09:39:11 +1000",
        "category": "finance",
        "authors": [
            "Lucy Macken"
        ],
        "text": "We lift the lid on an open secret in Australia’s property market that’s costing potential buyers millions.\n\nHigh-earning real estate agent Josh Tesolin has openly admitted that he has been the subject of an ongoing investigation by the NSW Office of Fair Trading in recent months, publicly decrying what he might have done to earn such scrutiny.\n\n“I’d like to hear what it is. And I’d like to respond back as fully as possible with the truth,” said Tesolin, known among his contemporaries as “Teflon Josh”.\n\nNow he knows: Dummy bidding, underquoting, high pressure sales tactics and producing false documents to Fair Trading are among the allegations being levelled against one of Australia’s highest-earning real estate agents.\n\nStar agent Josh Tesolin pictured leaving his Bella Vista home on Friday. Credit: Sam Mooy\n\nAn extensive investigation by the regulator has landed Tesolin and his private real estate company, Tesolin Consulting, a four-month licence suspension – pending possible disciplinary action – over allegations that he has committed serious and repeated breaches of the law.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/safe-hands-and-sliding-doors-the-incredible-legacy-of-mark-schwarzer-20250731-p5mj7w.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Safe hands and sliding doors: The incredible legacy of Mark Schwarzer",
        "publish_date": "Sat, 09 Aug 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Vince Rugari"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Mark Schwarzer can still recall the look of terror in Eddie Thomson’s eyes. It was 1993, and Australia was playing a World Cup qualifier against Canada in Edmonton. Fifteen minutes into the match, goalkeeper Robert Zabica made a rash challenge on striker Dale Mitchell, who had broken through the Socceroos’ defensive line and was bearing down on goal. Mark Schwarzer made two penalty shootout savess for the Socceroos in 1993 but it wasn’t until more than a decade later that he became a household name. Credit: SMH Zabica clattered into him just outside his box. Schwarzer, aged 20 and just a couple of months removed from winning the National Soccer League grand final with Marconi, was expecting him to be shown a yellow card. But after a period of deliberation, the referee produced a straight red – prompting a shocked Thomson, the then-Socceroos coach, to turn to his bench and look at the player he’d have to send on. “I remember Eddie Thomson just turning to me with his eyes wide open,” Schwarzer says. “Probably thinking: ‘Oh my god. Now I’ve got to play him’.” In a more just world, Schwarzer wouldn’t have even been there. He’d been called up only because Mark Bosnich, then Australia’s best goalkeeper, chose club over country, a common dilemma before FIFA introduced designated international windows in 2002. The Canada games clashed with the start of the Premier League season, and Bosnich, trying to cement his spot at Aston Villa, withdrew. Schwarzer got the last-minute call-up.\n\nAdvertisement\n\nIn his Aston Villa days, Mark Bosnich was considered one of the best goalkeepers in the English Premier League. Credit: Reuters “It was such an unfair scenario for ‘Bozza’ and other players to be in,” Schwarzer says. “It was completely out of order for them to be put in that position. The good thing is it’s been changed. But obviously, whenever those sort of scenarios develop, there’s more often than not someone else who benefits from it.” That was him. These were the inauspicious circumstances that launched his almost 20-year international career: one that spanned four World Cup cycles, a record 109 caps and some of the most important moments in Australian football history. It has now been recognised with a place in the Sport Australia Hall of Fame, making him just the ninth footballer to be inducted. It wasn’t the steadiest start. After coming on, Schwarzer conceded at his near post as Canada prevailed 2-1 over the 10-man Socceroos but in the second leg in Sydney, Australia won by the same scoreline, forcing the tie into extra time and then penalties: Schwarzer emerged as the hero by making two saves in the shootout. Bosnich was back in the team by the time the Socceroos faced Diego Maradona’s Argentina in another losing World Cup qualifying play-off. It wasn’t until another two saves in a shootout more than a decade later, against Uruguay, that Schwarzer would become a household name, and that the Socceroos would actually break their long World Cup drought. ‘There were football fans that were born that night’\n\nAdvertisement\n\nThe story of “that night”, as it has come to be known – Mark Bresciano’s goal, Tony Popovic’s substitution after just 31 minutes for Harry Kewell, the tension of extra time, Schwarzer’s famous stops to deny Darío Rodríguez and Marcelo Zalayeta’s penalties, Mark Viduka’s miss, the eternal image of a shirtless John Aloisi wheeling away after scoring his, and how it all turbocharged the growth of the sport in Australia – has been told and retold so many times that, in truth, there is nothing new to say about it. But the impact still echoes today. This year marks the 20th anniversary of that landmark achievement – one that, without a hint of hyperbole, Schwarzer believes changed not only the face of Australian sport, but the trajectory of thousands upon thousands of lives, far beyond the players and coaches who were directly involved. As he processed the heartbreak of their failure against Uruguay four years earlier, Schwarzer remembers sitting on the team bus in Montevideo, telling himself: “We just need to qualify. If we qualify, the game is going to change.” As a young fan, Schwarzer remembers watching the Socceroos continually fall short of qualification, contemplating the possibility that it would never actually happen. “We’re never going to get there. We’re just so far away from it,” he thought. “You just felt that there was something seriously missing.\n\nAdvertisement\n\n“And then obviously as a player, at that stage in my career, I was thinking: ‘Gosh. Am I going to miss out on this opportunity? Is it going to be after I finish playing that we’re going to qualify? Am I going to be one of these players that just misses out, like so many – like Ned Zelic, Paul Okon, just to name a couple’. They were instrumental in us coming through as players. They were kind of like the pioneers of the game … they missed out. I still sometimes think about it.” Mark Schwarzer played for the Socceroos on 109 occasions, more than any other player in history. Credit: Getty Images Strikers always get the glory, so Aloisi’s celebration became the enduring symbol but Schwarzer’s performance was a seminal moment of its own. It became the benchmark by which all future Australian penalty shootouts would be measured, and it inspired many young footballers to pick up the gloves. “It’s a ripple effect on not just football players, but the football community,” he says. “There were football fans that were born that night, that were sucked into supporting the national team. As players who were playing week in, week out at the highest levels, in front of massive crowds and massive stadiums. It was hard to take, going back to Australia not having that all the time. “For people not to fully understand, or to really get that feeling of what it’s like to go to a World Cup … we’ve seen it, we’ve watched it but we’ve never been part of it. We all talked about it. We knew that things would change. Part of it was always about, if you can create change as big as this, to qualify again for only our second World Cup, after 32 years, this rollercoaster of emotions and experiences that we’d all been part of … but none of us thought it would change to the effect that it did.” ‘The boys won the title, not me’\n\nAdvertisement\n\nSetting aside his contribution at international level, Schwarzer’s club career alone is possibly grounds for Hall of Fame induction. After enduring some tough early years in Germany, the country of his parents’ heritage, he made his name in England. Indeed, no Aussie has played more often in the Premier League than Schwarzer, who made 514 appearances across 21 seasons for Middlesbrough, Fulham, Chelsea and Leicester City. The next best, Lucas Neill, made 279 appearances, so it’s almost impossible to imagine anyone bettering Schwarzer’s record, a testament to his longevity, which was incredible even for goalkeepers, who tend to have longer careers than outfields and who can play on into their 40s, as he did. “The beauty of the position is if you’re able to maintain your levels of fitness and be a little bit lucky in terms of injuries, you’re able to play a lot longer than most outfield players,” he says. “That was obviously something that I was able to do.” Through all of that time, Schwarzer won just one trophy. Well, there are two others, for which he gives himself zero credit but those aside, it’s just the 2003-04 League Cup he helped Middlesbrough win as their starting goalkeeper, coming in his seventh season of regular football. His only regret? That was in 2010, when Arsene Wenger wanted to bring him to Arsenal. Schwarzer was 37 and eager to play for a club that was not only contending for the Premier League title, but also playing in the UEFA Champions League – a new experience for him. Harry Kewell and Mark Schwarzer in 2005. Credit: Getty Images At first, Fulham were open to selling him; manager Roy Hodgson told Schwarzer as such. But then Hodgson moved to Liverpool, and his replacement Mark Hughes was interested in letting him only go if the Cottagers could bring in another goalkeeper first. That didn’t happen, and the door was slammed shut. “That was the one and only time in my career that I really struggled with a decision,” Schwarzer says. “I was desperate, and I was doing everything I possibly could to facilitate the move, but the club were working completely against me.”\n\nAdvertisement",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/a-wallabies-upset-in-south-africa-no-longer-seems-so-fanciful-20250808-p5mlcx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A Wallabies upset in South Africa no longer seems so fanciful",
        "publish_date": "Sat, 09 Aug 2025 09:30:00 +1000",
        "category": "sports",
        "authors": [
            "Paul Cully"
        ],
        "text": "The Wallabies squad announced on Thursday had some big inclusions: Will Skelton and James O’Connor.\n\nGranted, they were already part of the British and Irish Lions series but their employers are in Europe and that has not always made it easy for the Wallabies. Their selections felt like victories and the fact they are heading to South Africa speaks volumes about what is going on inside the Wallabies camp at present: it’s evidently a rewarding and stimulating environment.\n\nThere will be frustration that they didn’t get the job done against the Lions but a belief that they are building something. Players obviously want to be part of that, and the desire from numbers 1-23 to run through brick walls in Sydney in the third Lions Test is all you could ask for before two Tests against the Springboks in South Africa.\n\nThe world champions are heavy favourites, and their fans will be expecting nothing less than two comprehensive wins, but even the most pessimistic, here’s-another-false-dawn Wallabies supporter should acknowledge that there was something stirring in that Sydney victory.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/racing/randwick-races-postponed-after-heavy-overnight-rain-20250809-p5mlm9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Randwick races postponed after heavy overnight rain",
        "publish_date": "Sat, 09 Aug 2025 09:24:09 +1000",
        "category": "sports",
        "authors": [
            "Craig Kerry"
        ],
        "text": "The first group race of the season in NSW, the Missile Stakes, could remain just that despite the postponement of the meeting at Randwick on Saturday.\n\nAustralian Turf Club and Racing NSW officials were in talks about rescheduling the group 2 over 1200m, the lone feature on the program, after the Randwick meeting was washed out following 45mm of rain overnight and into the early morning on Saturday. It meant the course had received 87mm in the past week and 174mm during the past 30 days.\n\nWar Eternal, which was set to contest the Missile Stakes, surges to victory on a rain-affected Randwick track last year. Credit: Getty Images\n\nStewards made the call just after 7.30am, given predictions of more rain throughout the day.\n\n“We’ve received over 45mms since nine o’clock last night,” Racing NSW chief steward Tom Moxon told Sky Racing.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/car-smashes-into-dental-surgery-in-melbourne-20250809-p5mlmf.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Car smashes into dental surgery in Melbourne",
        "publish_date": "Sat, 09 Aug 2025 09:22:45 +1000",
        "category": "finance",
        "authors": [],
        "text": "Car smashes into dental surgery in Melbourne\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/victoria/erin-pattersons-relationship-with-her-in-laws-20250808-p5mlky.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Erin Patterson's relationship with her in-laws",
        "publish_date": "Sat, 09 Aug 2025 08:34:58 +1000",
        "category": "finance",
        "authors": [],
        "text": "Erin Patterson's relationship with her in-laws\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/the-department-of-health-investigation-20250808-p5mlkt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Department of Health investigation",
        "publish_date": "Sat, 09 Aug 2025 08:33:54 +1000",
        "category": "finance",
        "authors": [],
        "text": "The Department of Health investigation\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/the-dehydrator-lie-20250808-p5mlkr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The dehydrator lie",
        "publish_date": "Sat, 09 Aug 2025 08:32:49 +1000",
        "category": "finance",
        "authors": [],
        "text": "The dehydrator lie\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/two-siblings-among-latest-child-deaths-as-devastating-outbreak-grips-pacific-011457011.html",
        "title": "Two siblings among latest child deaths as devastating outbreak grips Pacific",
        "publish_date": "2025-08-09T01:14:57Z",
        "category": "lifestyle",
        "authors": [],
        "text": "Five children in total have died from dengue fever in recent months, prompting a plea from the country's prime minister.\n\nA family is mourning the loss of two young brothers, who both died of dengue fever in Samoa. Source: Facebook/Eseta Leasi\n\nTwo siblings are among the latest deaths in the Pacific nation of Samoa, amid a devastating outbreak of dengue fever. A total of five children have succumbed to the mosquito-borne virus in recent months, with the last three deaths occurring in the space of just four days.\n\nA nine-year-old boy and his two-year-old brother from Mulifanua in Upolu became the fourth and fifth victims of the virus, passing away within days of each other.\n\nAccording to the boys’ grandmother, the older brother was given Panadol in the days before his death on July 30 after showing symptoms of dengue fever.\n\nAfter waiting hours to be seen at their closest medical centre, an ambulance was eventually called to transport him to the main hospital, but his \"heartbeat dropped\" just 10 minutes into the journey.\n\nADVERTISEMENT\n\nThey returned back to the clinic, but the child could not be saved.\n\nTragically, his younger brother passed away several days later.\n\nWorkers spray for mosquitoes to help fight the growing number of dengue cases in Samoa. Source: Ministry of Health Samoa\n\nThe three other deaths include a five-year-old girl who died on July 29, an eight-year-old girl who died on July 13 and a 12-year-old boy who died in April after being flown to New Zealand for medical treatment.\n\nPrime Minister Fiamē Naomi Mataʻafa this week urged parents \"not to wait until it is too late\" to seek medical attention for children affected by dengue fever.\n\n“It is important to heed advice from the Ministry of Health. For parents and guardians, please seek immediate medical assistance if your child develops dengue fever symptoms,” she said at a press conference on Monday.\n\n“Do not wait until it is too late. Early treatment can save lives.”\n\nSamoa’s Ministry of Health released their latest dengue report on Thursday, confirming four dengue-related deaths and one probable death awaiting confirmation. A further 1446 clinically diagnosed cases were reported from July 28 to August 3.\n\nADVERTISEMENT\n\nThe spike in dengue cases has caused all schools across Samoa to be closed for another week, heavily disrupting the start of term 3.\n\nSamoa, along with Fiji, Tonga, the Cook Islands and Kiribati are all in the grips of dengue fever outbreaks. Other nations have also reported cases, though haven’t officially announced an outbreak. These include Hawai’i, French Polynesia, American Samoa, Nauru and Tuvalu.\n\nThe mosquito-borne virus has similar symptoms to a bad flu or Covid virus, which can make it difficult to diagnose without a blood test. Symptoms typically include sudden fever, headache, muscle pain, vomiting and a faint red rash.\n\nA large-scale fumigation campaign has been launched in Upolu, targeting schools, businesses and hotspot villages. Source: Government of Samoa\n\nWhy are so many children falling sick?\n\nIn Samoa, a staggering 71 per cent of dengue cases are in children younger than 15 years old.\n\nDr Mark Jacobs, WHO Representative to the South Pacific and Director of Pacific Technical Support, recently told Yahoo News there's a reason why young people are more highly represented in the statistics.\n\nADVERTISEMENT\n\n\"Because being infected with a strain of dengue usually provides lifelong immunity against that strain, children can be at much higher risk of being infected when the strain is reintroduced into the country,\" he said.\n\n\"Many adults would have been infected previously, meaning they are protected from reinfection with that strain.\"\n\nThere are four strains of dengue, with two currently in the Pacific. Once someone recovers from the disease, they generally get life-long immunity — but only to that strain.\n\nThe WHO advises that even a bottle cap can contain enough water for a mosquito to breed, and urges locals to do their part to clean up any potential mosquito breeding sites. Drains, gutters, bottles, buckets, wheelbarrows and even spare tyres could all collect water and turn into a breeding ground.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/two-day-deadline-claim-fortune-000130938.html",
        "title": "Two day deadline to claim fortune",
        "publish_date": "2025-08-09T00:01:30Z",
        "category": "finance",
        "authors": [
            "Liam Beatty"
        ],
        "text": "The winning Saturday Gold Lotto ticket could be anywhere. Picture: Supplied/ The Lott.\n\nAn oblivious winner has just two days left to claim a “life-enhancing” lottery prize before the money is returned to players and the community.\n\nThe Saturday Gold Lotto player won just over $670,000 almost seven years ago with a ticket picked up at a newsagent in Helensvale, Queensland.\n\nIn Queensland, winners have a seven-year deadline to claim their prize before the money is returned to players through community donations, bonus draws or player promotions.\n\nAccording to The Lott, the winning ticket is the oldest unclaimed lottery prize in Australia.\n\nThe seemingly-unaware winner was one of six division 1 winners in the Saturday Gold Lotto draw 3867 on August 11, 2018.\n\nADVERTISEMENT\n\nThe winning numbers were 1, 23, 8, 15, 44, 20, while the supplementary numbers were 11 and 18.\n\nPunters have been urged to search every pocket, wallet and drawer for old tickets. Picture: Supplied/ The Lott\n\nThe Lott spokeswoman Anna Hobdell said the clock was ticking for the mystery punter.\n\n“We’re making one final call to all lottery players: now is the time to search every pocket, wallet and drawer,” she said.\n\n“Imagine discovering after seven years that you’re the mystery division one winner we’re searching for.\n\n“We urge everyone to double-check any old tickets as soon as possible.”\n\nThe entry was purchased at Golden Lucky News on Millaroo Dr in Helensvale, with owner Melanie Zhi noting the area attracts its fair share of tourists.\n\n“While most of our customers are locals, we do get plenty of visitors from various places, especially from New South Wales. Honestly, the winner could be anyone,” she said.\n\nThe prize must be claimed by Monday August 11.",
        "source": "Yahoo"
    }
]