[
    {
        "url": "https://www.9news.com.au/national/biological-parents-of-baby-born-to-wrong-couple-in-ivf-bungle-have-no-legal-right-to-child/d30e3d6c-9855-4230-8b5d-9c1bdfc78a35",
        "title": "Biological parents of baby born to wrong couple in IVF bungle have no legal right to child",
        "publish_date": "Fri, 11 Apr 2025 23:14:26 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "T﻿he biological parents of a child born into the wrong family after an IVF mix-up have no legal rights to the child, according to Queensland law.\n\nIt was revealed yesterday that a Queensland couple had given birth to a stranger's child after the wrong embryo was transferred in a bungle by Monash IVF.\n\n﻿The fertility company was alerted to the mistake in February when the birth parents requested to transfer their remaining frozen embryos to another provider.\n\nREAD MORE: Top Australian model Lucy Markovic dies after health battle\n\nIt was revealed yesterday that a Queensland couple had given birth to a stranger's child after the wrong embryo was transferred in a bugle by Monash IVF. (Nine)\n\nFamily law experts have said today that the law recognises the birth parents as the legal parents of the child.\n\nThe law is there to protect birth parents from any potential legal issues with egg or sperm donors during the IVF process, but it also applies in this situation.\n\nQueensland's fertility laws were looser until new legislation was introduced last year.\n\nThe laws also mean Monash IVF could potentially face no formal penalty for its mistake. ﻿\n\n\"I don't think anyone can believe that in this modern age that this bungle could happen,\" former Queensland Premier Annastacia Palaszczuk told Weekend Today .\n\n\"I can say from personal experience, I've been through IVF and I was unsuccessful...so I know how important it is to have a baby at the end of it.\"\n\nQueensland's fertility laws were looser until new legislation was introduced last year. (Nine)\n\n\"I think, you know, we need to not lose sight of the fact that there is a beautiful baby who's now a toddler involved here.\n\n\"So that is a blessing...but this mix up should never have happened.﻿\"",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/trump-has-90-days-to-do-150-trade-deals-financial-markets-arent-buying-it/c9a2c5c7-9068-42e0-b101-5feae76b7106",
        "title": "Trump has 90 days to do 150 trade deals. Financial markets aren't buying it",
        "publish_date": "Fri, 11 Apr 2025 22:17:32 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "President Donald Trump and his advisers said this was the plan all along: Scare the bejesus out of the world by announcing astronomically high tariffs, get countries to come to the negotiating table, and — with the exception of China — back away from the most punishing trade barriers as America works out new trade agreements around the globe.\n\nBut Trump's 90-day pause on his \"reciprocal\" tariffs that were never actually reciprocal gives his administration just three months to strike enormously complex trade deals with dozens of countries that it says are lining up to negotiate.\n\nFinancial markets aren't buying it. Stocks have whipsawed as volatility has spiked.\n\nPresident Donald Trump and his advisers said this was the plan all along: Scare the bejesus out of the world by announcing astronomically high tariffs. (CNN)\n\nAnd other markets, including oil, bonds and the dollar, are sending a clear message of deep skepticism that Trump will be able to pull this one off.\n\nStocks\n\nFollowing another steep sell-off Thursday, stocks appeared calmer — for now — and posted strong gains Friday.\n\nThe Dow ended the day higher by 619 points, or 1.56 per cent. The S&P 500 rose 1.81 per cent and the Nasdaq was 2.06 per cent higher.\n\nMarkets were buoyed by Boston Federal Reserve President Susan Collins telling the Financial Times Friday that the central bank would step in to support financial markets if there were signs of distress.\n\nBut stock market investors have been trading on a knife's edge, and any announcement coming from the Trump administration on tariffs has the ability to send stocks surging or tumbling.\n\nREAD MORE: Top Australian model Lucy Markovic dies after health battle\n\nFollowing another steep sell-off Thursday, stocks appeared calmer — for now — and posted strong gains Friday. (CNN)\n\nFor example, stocks plunged Thursday after the Trump administration clarified the math it had already used to set China's massive 145 per cent tariff.\n\nThe street had believed the tariff was 125 per cent. The Dow sank sharply, at one point falling more than 2000 points.\n\nIn the 129-year history of the Dow Jones Industrial Average, the index has closed higher or lower by at least 1000 points just 31 times. Four of those times happened in the past week.\n\nThe S&P 500 fell by just over 9 per cent across the first week of April, its biggest one-week drop since March 2020.\n\nThe S&P 500 fell by just over 9 per cent across the first week of April, its biggest one-week drop since March 2020. (CNN)\n\nThe benchmark index gained 5.7 per cent this week, its biggest one-week gain since 2023.\n\nDespite Wednesday's historic gain after Trump announced his detente, stocks remain well below where they were trading before the president presented his \"Liberation Day\" tariff plan on April 2.\n\nBonds\n\nThe bond market is acting weirdly.\n\nTypically, you'd expect bond prices to rise throughout periods of turmoil. US Treasuries are historically considered to be the safest of safe assets, backed up by the full faith and credit of the US government.\n\nBut bonds aren't rising — they're falling.\n\nThat's largely because investors have lost faith in US trade policy, and they fear America could get hurt even worse than the countries Trump's tariff policy is targeting.\n\nUS Treasury yields, which trade in opposite direction to prices, briefly surged on Friday above 4.5 per cent. (CNN)\n\nAs JPMorgan Chase CEO Jamie Dimon said in his annual letter to shareholders Monday, Trump's \"America First\" policy risks alienating its most important partners and the country's special standing in the world.\n\nUS Treasury yields, which trade in opposite direction to prices, briefly surged on Friday above 4.5 per cent. They were under 4 per cent earlier in the week.\n\nThat represents a massive move for the market. Higher yields could hurt America's economy, as a number of consumer loans are closely tied to those rates.\n\n\"The upward action in rates has been rapid in historical context and has provided no comfort to investors looking for havens in turbulent markets,\" analysts at Citi said in a Friday note.\n\nUS Treasuries were on track for their worst week since 2019, according to Bloomberg's US Treasury total return index. (AP)\n\nUS Treasuries were on track for their worst week since 2019, according to Bloomberg's US Treasury total return index, when the New York Federal Reserve had to step in and purchase Treasuries to bring down a spike in yields caused by a liquidity crunch.\n\n\"Current market conditions don't require Fed intervention at this point, but Fed officials are likely monitoring market function closely,\" said Chip Hughey, managing director for fixed income at Truist Advisory Services.\n\nDimon said Friday on an earnings call that he expects there will be a \"kerfuffle\" in the Treasury markets that would lead to the Federal Reserve intervening.\n\n\"They're not going to do it now … they'll do it when they start to panic a little bit,\" Dimon said.\n\nOil\n\nThe oil market has been trading like we're going into a recession.\n\nPrices have tumbled over the course of the past couple of weeks as investors feared Trump's trade policy could sap demand for travel, shipping and transportation — all of which require fuel.\n\nUS oil on Friday morning fell below $US60 ($96) a barrel, close to a four-year low, before recovering slightly.\n\nUS oil on Friday morning fell below $US60 ($96) a barrel, close to a four-year low, before recovering slightly. (AP)\n\nBrent, the global benchmark, was hovering around $US63 ($100) a barrel, the lowest since April 2021, before also gaining slightly.\n\nOil gained on Friday after US Energy Secretary Chris Wright told reporters that the US could stop Iran's oil exports as part of Trump's negotiations over the nation's nuclear program, according to Reuters.\n\nUS oil settled up 2.4 per cent at $US61.50 ($98) a barrel. Brent rose 2.26 per cent to $US64.76 ($103) a barrel.\n\nYet concerns remain about the impact of tariffs on economic growth and how a potential slowdown could disrupt demand for oil.\n\nREAD MORE: Remains of dozens of First Nations ancestors return home\n\nTraders work on the floor of the New York Stock Exchange, Friday, April 11, 2025. (AP)\n\nOil prices have served as a prime recession indicator in recent years. Prices tumbled after surging above $US100 ($160) a barrel for the first time as the Great Recession took hold in 2008.\n\nAnd prices went negative for the first time during the pandemic as a glut of oil became so severe that traders were literally paying storage facilities to take the unwanted oil off their hands.\n\nDollar\n\nThe dollar on Friday tumbled to its lowest level in three years. That's the opposite of what you'd expect when tariffs are put in place.\n\nTypically, tariffs raise the value of a local currency, because it encourages residents to purchase homemade goods instead of foreign options, stretching their money further in comparison to other currencies.\n\nBut currency traders have sold off the dollar, because they believe America will bear the brunt of Trump's trade war fallout and end up comparatively weaker than before tariffs were put in place.\n\nThe dollar on Friday hit its lowest level against the euro since 2022.\n\nREAD MORE: Remains of dozens of First Nations ancestors return home\n\nCurrency traders have sold off the dollar, because they believe America will bear the brunt of Trump's trade war fallout. (AP)\n\nThe dollar index — which measures the dollar against a basket of currencies — fell 0.9 per cent Friday after tanking 2 per cent Thursday, which was its worst single-day drop since 2022.\n\nThose are massive moves in currency trading world.\n\n\"Investors and central banks are selling Treasuries and dollars due to a loss of confidence and credibility in American assets,\" said Joe Brusuelas, chief economist RSM. \"Financial chaos has its cost.\"\n\nMeanwhile, gold prices surged above a record high $US3,200 ($5125) a troy ounce on Friday.\n\nGold is up more than 23 per cent this year and just posted its best quarter since 1986. The yellow metal is considered a safe haven amid economic and political uncertainty.\n\nTrade deals\n\nDespite financial markets casting enormous doubt that the Trump administration can salvage the opportunity it created for itself to strike bilateral trade agreements with all 150 countries around the world, the Trump administration remains optimistic.\n\nTreasury Secretary Scott Bessent said this week that more than 70 countries have asked to meet with US representatives to strike a deal that could get them out from under the thumb of Trump's punishing tariffs.\n\nAlthough the administration has provided few details of which countries it is negotiating with, it said it would favor allies like South Korea and Japan first.\n\nTreasury Secretary Scott Bessent said this week that more than 70 countries have asked to meet with US representatives to strike a deal. (AP)\n\nBut trade deals are incredibly complex arrangements usually negotiated over the course of years, not months.\n\nAnd even if Trump were to negotiate trade with all those countries over a short period — whether full deals or letters of agreement that put a framework of a deal together — China, the world's biggest exporter, remains the elephant in the room.\n\nUS tariffs on China are now at least 145 per cent and China on Friday retaliated with 125 per cent tariffs of its own.\n\nThat will do enormous damage to the world's two largest economies, and both sides have said they are not eager to back down.\n\nChina has consistently said it is open to negotiations, but wants to do it in a way in which it will be respected.\n\nChina has ignored America's warnings not to raise its tariffs, according to a source familiar with the discussions.\n\nEconomists have been unmoved by Trump's sudden change in tune. (AP)\n\nIn the meantime, economists have been unmoved by Trump's sudden change in tune. Although negotiated trade agreements would undoubtedly be good news for the economy, much of the damage has already been done, Wall Street economists have argued.\n\nAnd punishing 10 per cent universal tariffs remain in place, as do 25 per cent tariffs on autos, 25 per cent tariffs on some goods from Mexico and Canada, and 25 per cent tariffs on steel and aluminum.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/ai-art-damaging-australian-artists-livelihoods-experts-say/ad613fc2-fc6f-40b5-8bf6-126f9266a12f",
        "title": "How AI art is 'damaging' Australian artists",
        "publish_date": "Fri, 11 Apr 2025 22:25:57 +0000",
        "category": "entertainment",
        "authors": [
            "Apr"
        ],
        "text": "Exclusive : Comic artist Evie ﻿Hilliar says she has been left feeling \"tired\" and \"helpless\" over the Artificial Intelligence art trend.\n\nRecently, social media has been ablaze with AI artworks mimicking the Studio Ghibli art style, made famous by the legendary Japanese animators Hayao Miyazaki, Isao Takahata, Toshio Suzuki and Yasuyoshi Tokuma.\n\nHilliar has personally been affected by the AI art trend, with her digital comics taken and turned into animations using AI, without giving her credit or asking her permission.﻿\n\nOriginal artwork by comic artist Evie Hilliar - who says the style can now be easily reproduced by others using AI. (Evie ﻿Hilliar / @yeevz_)\n\n\"It's no secret most artists are very much against AI... in terms of ripping off other people's styles﻿, of course I'm against it, but I don't think there's any stopping it,\" Hilliar told 9News.\n\n\"﻿I feel a bit helpless, I've tried to AI generate my own work to see what comes up, and it does a pretty good job.\n\n\"﻿I see a lot on TikTok and Youtube, people have taken my comics and put AI voices over it... Honestly, it bothers me because I don't get that traction; if I don't get credit, then I don't get work.\n\n\"This is taking away from me making a living.\"\n\nArt law experts say the trend is \"damaging\" to the Australian art landscape, as a complex combination of gaps in copyright and ethical ambiguity creates issues for already struggling Aussie artists.\n\nStudio Ghibli's art style was made famous by the now-legendary Japanese animators Hayao Miyazaki, Isao Takahata, Toshio Suzuki and Yasuyoshi Tokuma. (Studio Ghibli/GKIDS via AP)\n\n\"We're really concerned about the implications for Australian artists and artists around the world,\" CEO of Arts Law Australia and copyright law expert Dr Louise Buckingham said.\n\n\"Their livelihoods are being undermined by this capacity for cheap and free inauthentic lookalike products, and all the ways the law falls short in this area... it ends up harming them.﻿\n\n\"Copyright doesn't protect or subsist in things like styles and techniques... that's why doing something in the style of (another artist) using a generative AI tool can be really damaging... (art)works can be vulnerable in that sense.\"\n\nIt's not just the law surrounding the AI art that's complex - the issue has ﻿also caused division of opinions in the art world.\n\nSydney-based artist Werner Bronkhorst says he isnt against the use of AI in art (idlewild creative)\n\nSydney-based artist Werner Bronkorst has no issues with the use of AI in art, but said he understands why some people would be upset if a beloved art style is copied.\n\n\"I'm sure it would be kind of a gut-wrenching feeling when something that you've worked for your whole entire life﻿ is now being kind of mass-produced and people are benefiting from that,\" he said.\n\n\"On the other hand, if it's not infringing on any copyright... if you can't copyright a style then to me personally I don't have a problem with AI.\n\n﻿\"On a broader spectrum as an artist, AI is a really good tool, and you can use it for good or bad.\n\n\"﻿I don't use it a lot, but I did last year for a collection of mine where I drew cars with charcoal...that's me drawing, still creating artwork, but I used AI to generate images that I draw - that way I don't infringe on other artists' photographs.\"\n\nSydney-based artist Werner Bronkhorst says he isnt against the use of AI in art (idlewild creative)\n\nWhile copyright doesn't apply to art styles or techniques, it does apply to artworks themselves.\n\nIf a \"substantial part\" of an existing artwork is mimicked, the person involved in making it could absolutely face legal repercussions, even if they were unaware that the model had used parts of an existing work.\n\nArtists also have the right to attribution, ﻿which is likely infringed upon in the generative AI process, Buckingham said.\n\n﻿\"[The AI model] might end up seeming to have used a substantial part of the underlying work... looking at the Studio Ghibili phenomenon, you might end up with a pretty clear-cut example where it looks like a substantial part of an existing Ghibli artwork has been reproduced,\" she said.\n\n\"﻿Any person who's been involved with the things that are exclusively within the rights of the copyright owner...anyone doing any part of that activity can be liable.\"\n\nREAD MORE: Remains of dozens of First Nations ancestors return home\n\nThe author's dog (left) in a generic cartoon art style (right) made by ChatGPT. (Nine)\n\nA substantial part of an artwork can include anything that makes the work distinctive, vital, important or essential.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/new-trials-hope-to-stop-parkinsons-disease-in-its-tracks/01f58e9e-42d6-4ec9-96b3-fb493b3de789",
        "title": "New trials hoped to stop Parkinson's disease in its tracks",
        "publish_date": "Fri, 11 Apr 2025 08:13:12 +0000",
        "category": "lifestyle",
        "authors": [
            "Apr"
        ],
        "text": "A series of smart trials to fast-track treatments to slow or stop Parkinson's disease is gathering pace across the country.\n\nResearchers are currently recruiting patients for the next phase of the trials as part of a national drive to urgently tackle the condition\n\nDr Derrick Beech, who was diagnosed with Parkinson's a few years ago, doesn't experience tremors.\n\nREAD MORE: ﻿ Chinese president rebukes Trump in first public comments about tariffs\n\nDr Derrick Beech, who was diagnosed with Parkinson's a few years ago, doesn't experience tremors. It's his walking ability that has worsened over time. (Nine)\n\nIt's his walking ability that has worsened over time.\n\n\"It's so varied from one person to another, my issues are more about mobility, speaking and writing,\" he said.\n\nHe takes three pills a day to relieve the symptoms.\n\n\"The simple treatment is you replace the dopamine that you've lost,\" he said.\n\nThe treatment helps patients with Parkinson's cope, but it doesn't directly treat or stop the course of the disease.\n\n\"Certainly that's improved quality of life but nothing that's slowing the disease or stopping it in its tracks,\" Macquarie University's Professor of Cognitive Neurology Simon Lewis said.\n\nDerrick volunteered to test existing medications, in the hope they could help change the course of disease.\n\nIt's part of a multi-million dollar project called the Australian Parkinson's Mission.\n\nREAD MORE: Judges double mammoth fine over forklift death\n\nA series of smart trials to fast-track treatments to slow or stop Parkinson's disease is gathering pace across the country. (Nine)\n\nFor researchers, it is about \"being able to tap into drugs we know are safe, available that we could use and maybe even translate into the clinic quickly,\" Lewis said.\n\nThe smart trials involve testing a variety of medicines used for other conditions, such as albuterol tablets for asthma and alogliptin to treat type 2 diabetes.\n\nThe next phase will test a simple cough medicine ambroxol, and an antibiotic doxycycline.\n\nThe medicines target different pathways such as inflammation and a gene called alpha-synuclein implicated in disease.\n\n\"So this is the world's first platform trial, what that means we get to try different drugs in the same trial, the same protocol\" Lewis said.\n\n\"We have blood biomarkers that can tell us, did that drug actually engage the target, did it reduce inflammation, did it modulate those other pathways we think are important.\"\n\nResults from the first stage are likely to be released later this year.\n\nA key feature of these trials is teasing out which patient would benefit most from each treatment\n\nInterested volunteers can find out more information at the link here .",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/use-ai-to-write-emails-work-risks-pitfalls/aad554ec-0d8b-49c1-9047-f497e75ce3a2",
        "title": "Michael used AI to write a work email. It ended up costing him $2000",
        "publish_date": "Fri, 11 Apr 2025 02:51:07 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "As businesses across Australia explore the ﻿benefits of generative AI in the workplace – from increased productivity, to better employee experiences – millions of workers may be embracing the tools without fully realising the potential risks.\n\nA survey Google conducted with IPSOS﻿ in January found that almost half of all Australians use generative AI and almost 75 per cent of those report using it for work.\n\nMeanwhile, a survey conducted by HR platform Workday revealed that about 65 per cent of Australian workers confirmed their employer had introduced AI in the workplace.﻿\n\nSome Australians are using﻿ generative AI to help send work emails without fully realising the risk. (Getty)\n\nBut even using generative AI for a task as simple as sending a business email can have unintended consequences.\n\nEnd Of Lease Cleaning Melbourne director Michael learned the hard way when a mistake in a seemingly harmless business email cost him $2000.\n\nIt used to take his team about five hours to respond to customer emails so they started using a generative AI tool to speed up the process.\n\n﻿\"We were trying to save some time by not typing individual lists of cleaning services,\" he told 9news.com.au.\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au\n\nInstead, they would input a prompt outlining the services a customer required and have the AI tool generate an email detailing the services, their costs, and a job quote.\n\nThe tool slashed their response time down to one hour, but Michael admitted it wasn't perfect.\n\n﻿On several occasions, the AI tool mistakenly listed a 'full wall clean' instead of a 'spot wall clean' but did not change the quote to reflect the more expensive service.\n\nIt meant Michael and his team had to provide the ﻿$500 to $700 full wall clean at the much lower price of the spot clean, losing the business hundreds.\n\nThe final straw came in March, when Michael had the AI tool generate a quote for a \"filthy\" property that required about $2000 worth of cleaning.\n\nREAD MORE: Stocks tumbles as China tariffs set even higher than thought\n\nUsing AI tools boosted Michael's productivity but there were pitfalls too. (Getty)\n\nHe gave the AI generated email a ﻿quick once-over then sent it to the customer.\n\nMichael didn't realise it was riddled with errors until a week later, by which time the customer had gone to a different company.﻿\n\n\"We lost quite a lot of money,\" Michael said.\n\nHe's not the only Australian worker paying for mistakes made by generative AI in business emails.\n\nOthers who spoke to 9News claimed that AI had addressed customers, clients and colleagues by the wrong name or title in emails, jeopardising business opportunities and working relationships.\n\nBut the risks go beyond awkward mishaps, ﻿Dentons Intellectual Property and Information Technology lawyers Robyn Chatwood and Michael Park told 9news.\n\nGenerative AI tools will \"hallucinate\", wherein they make up facts that aren't accurate, which can cause more problems for workers if they include these \"hallucinations\" in professional correspondence.\n\nIt's also not uncommon for AI tools to infringe on copyright or mistakenly breach confidentiality ﻿rules, which can have serious ramifications in a professional setting.\n\nIn such situations, workers \"still have the responsibility and the liability\" according to Chatwood.\n\n\"You can't just say the machine made a mistake, because you should have checked it,\" she said.\n\nTop 10 female-dominated jobs most threatened by AI View Gallery\n\nPark warned that the best way for Australian workers to protect themselves from these kinds of mistakes is to stick to their employer's AI use policy, no matter how tempting it may be to speed up a task by using AI.\n\n\"If your policy says don't do it, then just don't do it,\" he told 9news.\n\n\"You're protecting yourself from potentially getting into trouble.\"\n\nWorkers or small business owners who don't have an AI use policy should err on the side of caution, he added.﻿\n\nSince missing out on the $2000 job, Michael and his team no longer use generative AI for any business correspondence.\n\nThough it means their response time is back at the five-hour mark, that's better than making another costly mistake using generative AI.\n\n\"If you are using AI, you definitely need to read everything two to three times before you send that email,\" he said.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/food-safety-expert-reveals-how-long-you-can-save-your-easter-eggs/9f7bb900-6e87-475f-b4ad-1ab9ebc1c320",
        "title": "How long can you save your leftover Easter chocolate?",
        "publish_date": "Fri, 11 Apr 2025 02:33:07 +0000",
        "category": "finance",
        "authors": [
            "Apr"
        ],
        "text": "An estimated 15 million Australians will stock up on Eas﻿ter chocolate in the coming week.\n\nFor those planning to save some of their treats for after the holiday, ﻿a food health and safety expert has revealed how long ﻿you can hold onto your leftover chocolate eggs.\n\n﻿Swinburne University of Technology microbiologist Professor Enzo Palombo explained chocolate expired in a different way to fresh foods.\n\nAn estimated 15 million Australians will stock up on Eas﻿ter chocolate in the coming week. (iStock)\n\n\"Over time, the quality and taste might degrade,\" Palombo said.\n\n\"Milk and white chocolate, which contain dairy, have a shelf life of up to 12 months.\n\n\"Dark chocolate can last longer, often up to two years due to its higher cocoa content and lower dairy content.\n\n\"Proper storage in a cool, dry place extends its life.\"﻿\n\nIn addition to the expiration date, the microbiologist said people should be vigilant about the potential health risks.\n\nPalombo said ﻿some chocolates, particularly dark chocolate, could contain trace amounts of heavy metals like lead and cadmium.\n\nProper storage of Easter eggs can extend their shelf life. (Getty Images/iStockphoto)\n\n\"Long-term exposure can pose health risks, particularly for children and pregnant individuals,\" Palombo said.\n\nThe microbiologist said there have also been cases of contamination ﻿with pathogens like salmonella, although chocolate is considered low-risk due to its low water content.\n\n\"This usually occurs during manufacturing, especially if ingredients or equipment are not properly sanitised,\" he said.\n\nPalombo said people should also be aware chocolates may contain undeclared allergens like milk, nuts or soy, which can be dangerous for people with allergies.\n\nMore than 15 million Australians are planning to splurge on Easter food and chocolate this year with a total food spend of $2.2 billion predicted, according to new data from the Australian Retailers Association and Roy Morgan.\n\nAccording to the research, NSW and Victoria residents are expected to spend the most, at a predicted $710 million.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/customer-satisfaction-award-winners-announced-for-2024/08aa2a72-2bf0-42b4-8eee-7ec49a311828",
        "title": "Customer satisfaction award winners announced for 2024",
        "publish_date": "Fri, 11 Apr 2025 01:27:12 +0000",
        "category": "finance",
        "authors": [
            "April"
        ],
        "text": "4 of 15 Attribution: A Current Affair\n\nMedibank won the award for Risk & Life insurer of the year, despite a rocky year for the company, which was impacted by a massive cyberattack.\n\nIt's a new entry for the winners list. ﻿",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/lucy-markovic-australias-next-top-model-star-dies-after-health-battle/c96551fe-06f2-4154-acee-894d592bd787",
        "title": "Top Australian model dies after years-long health battle",
        "publish_date": "Thu, 10 Apr 2025 23:54:23 +0000",
        "category": "lifestyle",
        "authors": [
            "Apr"
        ],
        "text": "Top Australian model and Australia's Next Top Model star ﻿Lucy Markovic has died after a years-long health battle.\n\nThe 27-year-old passed away overnight after a battle with brain arteriovenous malformation (AVM), a tangle of abnormal blood vessels that can cause brain damage.\n\nHer death was announced on her Instagram Story.\n\nAn Australian's Next Top Model star ﻿has passed away after a years-long health battle. (Instagram)\n\n\"Dear friends and family, I regret to inform you that Lucy has passed,\" the post read.\n\n\"She was at peace. Me, her mother and my mother were present with her.\n\n\"We ask you to please give us space in these hard times.\n\n\"May Lucy rest in peace.\"﻿\n\nModelling agency Elite NYC also confirmed the death, calling Markovic a \"bright shining light.\"\n\n\"We are heartbroken to share that Lucy Markovic has passed away after a brave battle with a brain AVM.\n\n\"Lucy was a bright shining light, and had an incredible dry sense of humor. Her smile and laughter could light up a room, and draw you closer to her.\n\n\"She loved to dance, she really shined.\n\nModelling agency Elite NYC also confirmed the death, calling Markovic a \"bright shining light.\" (Getty)\n\n\"Modeling was one of Lucy's dreams, and we are deeply honoured to have been part of that journey with her.\n\n\"She brought elegance, strength, and beauty to her work. But more than that, she brought herself—her warmth, her laughter, her light.﻿\"\n\nItalian fashion designer Donatella Versace paid tribute to the model on her Instagram story.\n\n\"I am so sorry to hear the news about Lucy Markovic, rest in peace, beautiful girl,\" she wrote.\n\nMarkovic modelled for Versace ﻿last year.\n\nLast month, Markovic posted a health update to her Instagram. (Getty)\n\nLast month, Markovic posted a health update to her Instagram where she revealed she was undergoing brain surgery.\n\n\"﻿Lucky + unlucky - Radiation, seizures, heavy medication and 4 years later,\" the post read.\n\n\"I will be undergoing brain surgery on the 26th of this month for the AVM in the back of my brain (arteriovenous malformation) that is the size of a golf ball. (Now has changed to the 2nd of April).\"",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-12/actor-eric-dane-diagnosed-with-als-mnd/105169390",
        "title": "What is ALS? The motor neurone disease actor Eric Dane has been diagnosed with",
        "publish_date": "Sat, 12 Apr 2025 01:48:25 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Actor Eric Dane has revealed he has been diagnosed with amyotrophic lateral sclerosis (ALS), a form of motor neurone disease.\n\nThe US actor, who is best known for his role as doctor Mark Sloan on Grey's Anatomy, confirmed his diagnosis to People magazine.\n\nThe 52-year-old said he was \"grateful to have my loving family by my side as we navigate this next chapter\".\n\nHe said he would continue to work and was \"looking forward to returning to the set of Euphoria\", while asking for privacy for himself and his family.\n\nYou may already be familiar with ALS, especially if you took part in the viral ice bucket challenge to raise awareness of the condition back in 2014.\n\nBut if not, here are the disorder's main symptoms and treatments.\n\nWhat is ALS?\n\nALS is the most common form of motor neurone disease (MND).\n\nIt is a terminal degenerative disorder that causes progressive paralysis of the muscles.\n\nAccording to Health Direct, because the disease affects the nerve cells in the brain and spine that control muscle movement, patients slowly lose the use of their limbs and ability to speak, swallow and breathe independently.\n\nMND Australia says:\n\n\"Weak muscles, stiff limbs and overactive reflexes are key features of ALS. \"It most commonly starts in a limb (arm or leg) and progresses over time to other parts of the body.\"\n\nTo clarify, MND is the widely used generic term in Australia, the UK and parts of Europe. ALS is used more generically in the US, Canada and South America.\n\nOther stars who have been diagnosed with ALS include R&B singer Roberta Flack, Star Trek actor Kenneth Mitchell and SpongeBob creator Stephen Hillenburg.\n\nOscar winner Sandra Bullock's longtime partner Bryan Randall died from ALS in 2023.\n\nDane is married to wife Rebecca Gayheart, with whom he shares two daughters. (Reuters: Lucy Nicholson)\n\nWhat causes it?\n\nThe exact cause of ALS is unknown.\n\nHealth Direct says about one in 10 cases are \"familial\", meaning the condition is inherited.\n\nWhat are the first warning signs of ALS?\n\nALS generally begins with muscle weakness that spreads and gets worse over time.\n\nInitial symptoms might include:\n\nStumbling\n\nDifficulty holding and gripping objects\n\nSlurred speech\n\nSwallowing difficulties\n\nCramps and muscle twitching\n\nAs the disease progresses, patients may develop:\n\nDifficulty breathing\n\nFatigue caused by muscle tiredness, reduced lung capacity, weight loss, reduced food intake and changes to metabolism\n\nInsomnia\n\nMild changes in cognitive skills\n\nSome pain and discomfort\n\nALS does not usually affect the senses including the ability to taste, smell, touch or hear.\n\nHow does ALS affect life expectancy?\n\nThe rate at which ALS progresses can vary from one person to another.\n\nBut the mean survival time with the disease is two to five years.\n\nHowever, some patients can live for decades, like Stephen Hawking, who lived with the disorder for 55 years before dying at 76.\n\nThere is currently no cure for ALS.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-12/afl-live-blog-roos-suns-blues-eagles-dogs-lions-dees-dons-r5/105169346",
        "title": "Live: Davies-Uniacke leads North against Suns after signing monster extension",
        "publish_date": "Sat, 12 Apr 2025 01:41:34 +0000",
        "category": "sports",
        "authors": [
            "Andrew Mcgarry"
        ],
        "text": "Fresh from signing a multi-million-dollar deal, Luke Davies-Uniacke is in action for the Kangaroos against the Suns as the AFL's Gather Round continues in South Australia.\n\nThe Kangaroos-Suns clash commences at 12:35pm at Barossa Park and is the first of four matches on the AFL's Saturday slate.\n\nCarlton will aim to record its first win of the season against the West Coast Eagles from 1:20pm at the Adelaide Oval.\n\nThe Western Bulldogs will then face the Brisbane Lions in Norwood from 4:15pm, before Melbourne takes on Essendon at the Adelaide Oval in the final match of the day at 7:35pm.\n\n(All times AEST)\n\nFollow the live blog below, keep up to date with all the latest stats in our ScoreCentres, and tune in to our live radio coverage.\n\nKey Events Welcome to Super Saturday in SA! 21 minutes ago Expectations on the Suns again A By Andrew McGarry Jed Walter (L) is just one of the attacking options at Gold Coast's disposal in the Barossa. (Getty Images) One of the frustrations for the Suns in recent seasons has been their tendency to let things slip in the games they are expected to win, particularly on the road. It’s been one of the reasons why they haven’t come close to ending their wait for finals. So far this season, things have looked different, but it’s very early days and we’ve seen a few false dawns on the Coast before now. Fresh off their heart-stopping and controversial win over the Crows last week, Damien Hardwick’s men will have no excuses for not making club history – a win today would take them to 4-0 for the first time since Gold Coast’s inception. Can they live up to expectations? Welcome to Super Saturday in SA! A By Andrew McGarry The Barossa is ready for Gather Round's Super Saturday in SA ... are you? (Getty Images) Hello and welcome to ABC's coverage of day three of AFL's Gather Round! Today is a big day of footy, with matches stretching from the Barossa to suburban Norwood and the Theatre by the Torrens, Adelaide Oval. What's on our menu for Super Saturday in SA? First-up we head to Lyndoch, where the new Barossa Park will be christened as North Melbourne take on Gold Coast. Then it's off to town again for Carlton's absolute must-win game against the Eagles at Adelaide Oval, before a twilight match at Norwood Oval as the Bulldogs try to knock off the defending premiers Brisbane. Finally we go back to Adelaide Oval for the Demons and the Bombers, with both sides desperate to kickstart their seasons with a win. I'm Andrew McGarry and I'll be kicking things off today before handing over to Kyle Pollard, and maybe the odd message from our man in SA for Gather Round, Dean Bilton. Can't wait for the action to get underway, so stay with us!",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-12/flood-damaged-roads-double-freight-bill-isolate-residents/105156204",
        "title": "After flood devastation, graziers face roads to ruin",
        "publish_date": "Sat, 12 Apr 2025 01:35:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "Outback station owner Andrea Speed is trying to get her young family's life back to normal after record-breaking flooding inundated western Queensland.\n\nBut she is not sure how that will happen when the roads surrounding her property have been destroyed by raging floodwaters.\n\n\"There's a lot of bitumen torn off the sides, there're sharp drops and culverts washed out,\" Ms Speed said.\n\nAndrea Speed worries about the state of flood-damaged roads isolating her family. (Supplied: Andrea Speed)\n\nThe Department of Transport and Main Roads (TMR) says the full extent of damage to public roads will not be known for weeks, but almost 5,000 kilometres of roads across its network have been closed or restricted since the flood emergency began last month.\n\nAdditionally, more than 8,300km of private roads have been affected, according to the Department of Primary Industries.\n\nIsolated for weeks to come\n\nThe damage is so bad at Ms Speed's Retreat station that she cannot make it down the kilometres-long driveway and out her front gate.\n\nAnd even if she could, it is another 300 kilometres to the nearest town, Longreach, making grocery shopping or taking her six-month-old child to the doctor even more challenging.\n\nStation hands are unable to drive across the washed out main road at Mt Marlow station. (Supplied: Chloe Thomson )\n\nIn this part of the world, roads are \"absolutely crucial\" for landholders' personal lives and business.\n\nRetreat station's cattle are trucked hundreds of kilometres to their central Queensland feed lot each week.\n\nMs Speed said to avoid damaged roads, trucks would have to take a 500km detour.\n\nFlooding has caused huge damage to both state and private roads. (Supplied: Andrea Speed)\n\nShe said it would be a huge cost to factor into the budget.\n\n\"We're going to be doubling our freight bill just to keep things rolling,\" Ms Speed said.\n\nImproved rebuild\n\nDown the road at Thylungra station, George Scott has spent the past week hosing mud out of buildings and dropping feed to isolated cattle by helicopter.\n\nMr Scott said he had seen floods before, but the destruction and power of this one left him speechless.\n\nHe said the floods had sounded the \"death knell\" for one of the region's most important corridors, the Diamantina Developmental Road.\n\n\"There're huge bits of it washed away. It's in a pretty rough state and it's going to take some serious infrastructure spending to get it back to being serviceable,\" Mr Scott said.\n\nThe 1,300km road connects Mount Isa in north-west Queensland to Charleville in the south-west.\n\nWestern Queensland residents rely on open roads to access essentials. (ABC Western Qld: Aaron Kelly )\n\nMr Scott said the road had been in poor condition for 20 years and was so rough in sections it threw livestock off their feet.\n\n\"It's not good for animal welfare when the roads are so rough,\" Mr Scott said.\n\nHe said there were not \"too many votes\" in the remote region to entice politicians to spend money on the corridor.\n\nTMR said emergency works were under way on sections to try to keep parts of the Diamantina Developmental Road open.\n\nGetting cattle to market\n\nDalene Wray, managing director of OBE organics, a company that regularly trucks cattle along now flood-damaged roads, agreed western Queensland's roads were not \"up to scratch\" even before the natural disaster.\n\nDalene Wray (right) wants more investment in western Queensland roads. (Supplied: Dalene Wray )\n\n\"There are tens of millions of dollars of export revenue generated from the livestock and tourism industry in western Queensland,\" Ms Wray said.\n\nShe said once floodwaters went down, repairing key access routes should be a priority.\n\n\"The grass is already growing so we're going to be getting fat cattle that need to be trucked to market,\" Ms Wray said.\n\nRoad recovery works are jointly funded by state and federal governments through the Disaster Recovery Funding Arrangements.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-12/us-tariffs-war-with-china-australian-beef-exports-up/105166632",
        "title": "Australian beef demand surges as US trade with China grinds to a halt",
        "publish_date": "Sat, 12 Apr 2025 00:09:29 +0000",
        "category": "finance",
        "authors": [],
        "text": "About 300 abattoirs in the United States still have not had their export licences renewed to export beef to China — and it seems Australia is filling the gap.\n\nBefore Donald Trump's \"Liberation Day\" tariff hikes, American beef exporters were already facing problems with their third-largest market.\n\nAccording to the US Meat Export Federation, American pork and poultry plants had their export registrations with China renewed on March 16, but China \"had still not renewed the eligibility of any US beef establishments\".\n\n\"The majority of US beef production is now ineligible for China,\" it said.\n\n\"This impasse definitely hit our March beef shipments harder and the severe impact will continue until China lives up to its commitments under the Phase One Economic and Trade Agreement.\"\n\nWhile some US beef has trickled into China in the past few weeks, ABC Landline has been told the trade has now ground to a halt — especially after China announced retaliation tariffs.\n\nIn 2024, the United States exported $US1.6 billion ($A2.57 billion) worth of beef to China, making it the third-largest export destination.\n\nGrain fed beef exports to China are on the rise. (ABC Landline)\n\nAustralian grain-fed beef in demand\n\nStatistics from Meat and Livestock Australia (MLA) show Australian grain-fed beef exports to China have ramped up significantly, with 21,885 tonnes shipped in February and March — up nearly 40 per cent on the same period last year.\n\nSpeaking at a meat processing industry conference on the Gold Coast this week, Bindaree Food Group's Andrew Simpson said the trade war was creating indirect opportunities.\n\n\"If there's a tit-for-tat around the globe and countries like Japan or China push up reciprocal tariffs, it may prevent American beef becoming commercially viable into those regions [and] Australian beef will fill the gap, which could present a short-term opportunity,\" he said.\n\nWhat is a tariff? A tariff is a tax on a product imported from another country\n\nfrom another country It is paid to the government by the company that imports the product\n\nthat imports the product A tariff is generally calculated as a percentage of the price paid by the importer to the foreign seller\n\npaid by the importer to the foreign seller Historically, tariffs have pushed up prices because higher product costs are often passed on to consumers\n\nGlobal meat analyst Brett Stuart said Australia would be a clear winner going forward.\n\n\"Australia is now the lone supplier of high-quality white fat marbled beef into China,\" he said.\n\n\"[US beef] sales to China have fallen to zero … and not only is the market now closed based on the March 16 production date, but the combined retaliation tariffs by China now take the tariff on US beef to 116 per cent, a level that will quickly halt trade.\"\n\nLoading...\n\nAre we missing the bigger picture?\n\nBut shadow trade minister Kevin Hogan said the trade war between the two biggest economies in the world could hurt demand for Australian exports.\n\n\"We're a large exporting nation and we need global growth to be good,\" he said.\n\n\" In the short term this trade war might present opportunities for Australian beef exports, but the bigger picture here is, if this tariff war slows growth in both the US and China, then demand for a lot of the things we sell overseas would slow. \"\n\nRabobank global strategist Michael Every said ongoing commentary about Trump's tariffs was missing the bigger picture.\n\nLoading...\n\nSpeaking at the Food Futures conference in Darwin this week, he said most nations, including Australia, had not grasped the seriousness of what was happening in the world.\n\n\"We're now in an era of economic statecraft where it's about national security and national interests, rather than inflation or a balanced budget. These are irrelevant points now,\" Mr Every said.\n\n\"Fundamentally, it will come down to the US trying to set terms to China, decouple where it can, and then saying to everyone else globally — and particularly in the West, like Australia — so, are you with us or not?\n\n\"And if you're not, well, good luck to you.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-12/wa-greens-mp-brad-pettitt/105164554",
        "title": "WA Greens want cheaper housing, renewables action but say they won't be blockers",
        "publish_date": "Sat, 12 Apr 2025 00:05:04 +0000",
        "category": "finance",
        "authors": [],
        "text": "The expanded Greens WA team is yet to take its seats in parliament, but they've already got clear ideas about how they'll use their crossbench power and what issues are in their sights.\n\nHousing is at the top of that list.\n\nPerth's median house price has risen 34.4 per cent over the last four years, according to Domain, while wages have only increased by about 14 per cent.\n\n\"It's perhaps politically unpalatable to say this but I think it's time we started to have a conversation that says 'how do we actually seek to ensure house prices no longer go up?'\" Greens leader Brad Pettitt told Parliament on Thursday.\n\n\"Maybe they stabilise or they even decrease over coming years so that wages can catch up and everyone can own a home.\"\n\nHouse prices in the crosshairs\n\nSpeaking to Stateline, the Greens leader didn't talk about house prices dropping, only \"stabilising\", but said it would be one of his party's key focuses, alongside cost of living and climate action.\n\n\"Our housing crisis around house prices is entirely a result of government policy,\" he said.\n\n\"A lot of these are federal government policies around negative gearing, capital gains discount and those kinds of things.\n\nWA Greens MP Brad Pettitt is hopeful his party's relationship with Roger Cook's government won't be antagonistic. (ABC News: Kenith Png)\n\n\"Some of those need to be wound back and we certainly need to be having a really clear conversation around then also how can we be building and creating the kind of houses that actually enable people to get into those houses.\"\n\nLooking at a state level, where he and his colleagues stand at least some chance of influencing policy, Dr Pettitt said the key was getting \"the right kinds of supply and the right kind of diverse housing stock\".\n\n\"WA builds the biggest houses in the world with some of the least people in them, and we wonder why we have a housing affordability crisis,\" he said.\n\n\"The state can actually start to incentivise smaller, more diverse housing, closer to public transport, that actually makes that housing more affordable for more people.\"\n\nEmissions targets\n\nThe Greens' ability to influence policies like that depends entirely on the government's willingness to negotiate with them.\n\n\"What's not negotiable is Western Australia's plan to keep the economy the strongest in the nation, to continue to grow the jobs, to continue to grow our manufacturing sector to create the jobs of the future,” Premier Roger Cook said on Thursday.\n\nAs Labor loses total control, WA's upper house is set to get interesting Photo shows A man stands with several other people at a function The WA Greens say strengthening the government’s climate change legislation will be a top priority after they seize the balance of power in the upper house.\n\nOn some policies, Labor is likely more closely aligned with the Liberals, including on the future of the state's gas industry and changes to environmental protection laws.\n\n\"They've also talked up that they want to be about decarbonisation, kind of making the most of WA's extraordinary opportunity to be a renewable energy superpower, but they haven't done those things,\" Dr Pettitt said.\n\n\"We're the only state with emissions going up, the only state without a 2030 target and our renewable energy transition is lagging.\"\n\nThe WA government promised in 2023 to legislate emissions reduction targets, but that law failed to pass before the election and would not have included a 2030 target.\n\nThe government has promised to re-introduce that legislation in the current parliament.\n\nA clean slate\n\nWhile Dr Pettitt wants that target legislated, he insisted blocking legislation would not be his first negotiating tactic.\n\n\"I'd never want to go into that idea that we're here to block,\" he said.\n\n\"We say to government 'you want that renewable energy, let us help you do that'.\n\n\"That will be some tough negotiations, undoubtedly there'll be some arm wrestles and blocking's always an option of last resort.\"\n\nWA Greens MP Brad Pettitt would like to see housing prices stabilise so more people can afford to buy. (ABC News: Kenith Png, KENITH PNG)\n\nThat approach would stand in contrast to his federal counterparts who have, during this term of government, come under pressure for demanding more in exchange for their support.\n\n\"[It's] looked from the outside at least to be a pretty antagonistic relationship and I think that's probably, hopefully, unnecessary,\" he said.\n\n\"We're starting with a clean slate here. I think there are lessons to be learned around how we can actually work together, that said, there's going to be differences,\" Dr Pettitt said.\n\n\"But I'm hoping it can be much more based around really good conversations, around trying to get things done together, rather than us trying to strong arm and kind of be perceived as blockers because I think that's in no-one's interest.\"\n\nWA election 'debacle'\n\nThe wait continues for the Greens to find out exactly how much power they have though.\n\n'Not a banana republic': Inquiry to examine 'major slip' in WA election handling Photo shows People voting at Dalkeith pollling station. Western Australia is in unchartered territory after the decision to hold a special inquiry into the management of the state election, writes Nicolas Perpitch.\n\nThe WA Electoral Commission had been planning to declare results on Friday but had to push that out to next week.\n\n\"A complex count has contributed to a longer count processing time than expected,\" a spokesperson said.\n\n\"However, the accuracy and integrity of the result is a priority.\"\n\nIt's another stage in what Dr Pettitt described as a \"rolling debacle\" of an election which he believes has undermined faith in democracy.\n\nLoading...\n\nHis party will be part of an independent inquiry supported by each of the major parties into what went wrong, following reports of issues like polling booths running out of ballot papers, long wait times and delays in the counting process.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-12/csiro-breeding-program-mildew-resistant-grape-vines/105167446",
        "title": "Tiny vines could hold the key to a future-proof wine industry",
        "publish_date": "Fri, 11 Apr 2025 23:41:31 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's wine industry is battling significant annual losses due to powdery and downy mildew and a collaborative effort to find sustainable solutions is underway.\n\nIndustry bodies and research organisations have joined forces to breed new grapevines with inherent mildew resistance.\n\nThe initiative involves crossbreeding resilient local heritage vines with mildew-resistant genetic material sourced from France.\n\nThis mildew-resistant vine helps reduce one of the wine industry’s biggest disease threats. (ABC News: Carl Saville)\n\nThe goal is to develop robust grape varieties that reduce the need for chemical treatments while maintaining the quality and characteristics of Australian wines.\n\nPowdery and downy mildew cost the sector nearly $170 million a year and the industry has been looking for more economical and sustainable alternatives to current chemical control methods.\n\nFor the last 15 years, the CSIRO has been working with Wine Australia and Treasury Wine Estate, the owners of Wynns Estate, to breed mildew-resistant vines.\n\nBen Harris and Sue Hodder say the blend of heritage vine traits and modern breeding could transform Australia's wine industry. (ABC News: Carl Saville)\n\n'From resilience to resistance'\n\nWynns Coonawarra Estate senior winemaker Sue Hodder believes sustainability is about long-term consistency.\n\n\"Sustainability means our opportunity to grow good quality grapes year after year, with a few variations in climate and management practices,\" she said.\n\n\" We want to make sure the vineyards are in as good shape as possible to enable us to make good quality wine. \"\n\nVines are being selected for their ability to withstand mildew and the quality of the wine they are used to make. (ABC News: Carl Saville)\n\nIn 1997, researchers acquired a mildew-resistant germplasm containing genetic material and DNA sequences of wine grapes from France.\n\nScientists have cross-bred the material with vines selected from Wynns Estate's heritage Johnson's Block collection.\n\n\"CSIRO are bringing all their rigour and science, Wynns is bringing our heritage and history and passion and knowledge of these grapevines in particular,\" Ms Hodder said.\n\nNine \"mother vines\" were selected for their resilience and adaptation to various climate conditions over decades, highlighting their inherent hardiness.\n\nThe objective is to move \"from resilience to resistance\".\n\nSharon Harvey from Wine Australia says mildew resistance is vital. (ABC News: Carl Saville)\n\nA growing problem\n\nThe vulnerability of the wine sector to environmental factors is exacerbating the issue.\n\n\"This is an agricultural system,\" Wine Australia program manager Sharon Harvey said.\n\n\"So like any of the other agricultural sectors, we're prone to the effects of climate and weather.\"\n\nShe pointed to recent weather patterns as a key contributor.\n\n\"If there's a particularly wet season like last two summers we've had in Australia, there are a lot of badly affected areas by mildew,\" Dr Harvey said.\n\nThis had added to concerns changing climate patterns are creating more favourable conditions for mildew outbreaks.\n\nPaul Boss heads the CSIRO team in Adelaide. (ABC News: Carl Saville)\n\nThe CSIRO's principal research scientist on the project Paul Boss explained that the focus was on the \"viticultural traits of the heritage vines\".\n\n\"So whether they're nice open bunches or whether they're too vigorous,\" he said.\n\n\"For early selection, the process ultimately involves rigorous assessment.\"\n\nThe work is about maintaining the quality of the wine as well as disease resistance.\n\n\"The next varieties … are for climate change and more sustainability, so we can have less inputs into the vineyard to make good quality, age-worthy wine,\" she said.\n\nAnjelica Jermakow is using fast-growing micro-vines to slash breeding times from years to months. (ABC News: Carl Saville)\n\nTiny vines a big step forward\n\nThe CSIRO created micro-vines in greenhouses to accelerate the development of mildew-resistant varieties.\n\nExperimental research scientist Anjelica Jermakow said one of the biggest advantages of the plants was how quickly they grew.\n\nUnlike the vines found in most vineyards, which take two to three years to flower and produce fruit, these are ready to go within six months.\n\nDowny (left) and powdery mildew cost the wine industry millions each year. (ABC News: Carl Saville)\n\nNinety-nine promising vines have since been planted at the Wynns Coonawarra vineyards, but it will be a couple of years before they are mature enough to yield sufficient fruit for small-scale winemaking.\n\nBen Harris, the technical viticulturalist who oversees the vineyard, meticulously monitors the health of the experimental vines.\n\n\"We need to assess how the vines perform and also the quality of the fruit and, more importantly, the quality of the wine,\" he said.\n\n\" This comprehensive evaluation is paramount in determining the success of the breeding program. \"\n\nBen Harris says the aim is to combine \"the best of the past\" with cutting-edge science to breed vines for a changing climate. (ABC News: Carl Saville)\n\nThe hope is to produce mildew-resistant grapes that maintain their distinctive traits.\n\n\"We basically do micro-ferments and make very small batches of wine from all these individual grapevines and basically determine the fruit quality and then select the best wines from there,\" Mr Harris said.\n\nWatch ABC TV's Landline at 12:30pm on Sunday or on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-12/golf-adam-scott-rory-mcilroy-jason-day-masters-wrap/105169180",
        "title": "Scott records unwanted 16-year first in horror Masters day for Australians",
        "publish_date": "Fri, 11 Apr 2025 23:23:48 +0000",
        "category": "sports",
        "authors": [],
        "text": "Rory McIlroy has roared back into Masters contention as runaway overnight leader Justin Rose saw his advantage evaporate at Augusta National.\n\nEngland's former world number one, Rose, carded a one-under-par 71 to reclaim the clubhouse lead at eight under, holing a clutch par putt on the last with his rivals circling.\n\nBryson DeChambeau shot a four-under 68 to finish a shot behind Rose, while Matt McCarty made history to finish at five under. World number one Scottie Scheffler was five under through 13 holes.\n\nJason Day quickly emerged as Australia's main hope, skipping onto the front page of the leaderboard with three front-nine birdies to reach five under and sit in a tie for fifth through 13 holes.\n\nHe narrowly missed two more birdie putts around Amen Corner but remained the only bogey-free player in an otherwise helter-skelter tournament.\n\nMin Woo Lee was even through 14 holes to be one under through 14 holes and safely inside the two-over cut line.\n\nBut the wheels fell off for Cameron Smith (five over, 71, 78), who started the day at one under but went backwards, a double bogey on the 11th a bitter pill to swallow as he missed the cut for the first time in nine visits.\n\nAdam Scott (five over, 77, 72) also missed the cut for the first time in 16 years while Cam Davis (nine under, 74, 79) finished close to last.\n\nCameron Smith was one of several Australians to endure a day to forget at the Masters. (Getty Images: Andrew Redington)\n\nBut all eyes are on world number two McIlroy, who wilted on Friday AEST with a duo of double bogeys after he had soared to four under to seemingly kiss his chances of a maiden green jacket — and career grand slam — goodbye.\n\nThe Northern Irishman put that behind him on Friday, making back-to-back birdies after the turn and an eagle on the par-five 13th that shot him back into the guts of the leaderboard.\n\nHe then launched an audacious approach from the pine needles, over the towering trees, on the next hole that led to a tap-in par.\n\nMcIlroy edged a shot closer to the leaders with a birdie on the 15th — the par-5 he took seven on a day earlier — to finish just two shots off the pace.\n\n\"I think overall, just proud of myself with how I responded today after the finish last night,\" McIlroy said.\n\n\"I just had to remind myself that I played really good golf yesterday, and you know, I wasn't going to let, you know, two bad holes sort of dictate the narrative for the rest of the week.\"\n\nPhoenix native McCarty (five-under) double-bogeyed the first hole and dropped another shot on the next, but still carded a four-under 68 to take a brief clubhouse lead.\n\nThe historic recovery included eight birdies in 12 holes, McCarty the first to shoot 68 or better in a round in which he was three-over or worse at any stage.\n\nFormer champion Scott, who declined requests for interviews post-round, has missed just two cuts in his 23-year Masters history.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-12/queen-garnet-plum-dementia-research/105155220",
        "title": "Could a plum grown in Queensland help prevent dementia? Scientists hope so",
        "publish_date": "Fri, 11 Apr 2025 22:43:13 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Scientists at three Australian universities believe a dark purple plum bred in Queensland could help delay, or even prevent, dementia.\n\nResearchers at the University of Wollongong, the University of Queensland and Victoria University are testing juice from the Queen Garnet plum to see if it can protect the brain.\n\nWhile each team's work is in its infancy, Victoria University's Michael Mathai says the results are very promising.\n\nPlant breeder Bruce Topp and his colleague named the plum \"Queen\" for Queensland and \"Garnet\" for its flesh. (ABC Landline: Cameron Lang)\n\n\"There is evidence that people with early-stage dementia or perhaps mild cognitive impairment … can be helped by this,\" Professor Mathai said.\n\n\" Certainly there are some markers of inflammation which go down when they're taking plum extract. \"\n\nEarly research shows promising brain benefits\n\nDr Mathai has been adding plum extract to lab-grown neuronal cells, which mimic brain cells.\n\n\"We see increases in genes or proteins made by the cells, which drive the formation of new connections and the lengthening of the axons, which are like the telephone wires that connect to the different cells … that's the basis for things like making new memories,\" he said.\n\nMichael Mathai is exploring the plum's potential to protect and possibly repair damaged brain tissue. (Supplied)\n\nWhile the research could have huge implications for the aged care sector, Professor Mathai is eager to know if the plum can also repair traumatic brain injuries.\n\n\"We've already shown the extract will protect against chemically induced damage from oxidative stress, for example, that's a neuro protection area, but … will it help to repair already damaged tissue? That's something which we need to investigate further,\" he said.\n\nIn Brisbane, Yasmina Sultanbawa says the Queen Garnet plum's high levels of anthocyanins, a compound found in purple, blue and some red fruit and vegetables, may explain its potential to improve brain health.\n\nAnthocyanins are known for their antioxidant and anti-inflammatory properties. Studies suggest they help reduce blood pressure, delay diabetes and support heart health.\n\nGut health and the 'poo machine'\n\nProfessor Sultanbawa believes eating extracts, juices and powders made from the high anthocyanin plums could one day be a cheaper way of treating lifestyle diseases than prescription drugs, and without the side effects.\n\nHer research team is investigating the connection between gut and brain health, and the impact of eating foods high in anthocyanins.\n\nYasmina Sultanbawa is investigating how gut bacteria turn plum compounds into health-boosting molecules. (ABC Landline: Cameron Lang)\n\n\"The brain and gut are two organs that are talking to each other all the time, but we don't have enough knowledge in that space,\" Professor Sultanbawa said.\n\n\"If you can really get the gut and the brain to work together, and if you understand it more, you will get a much healthier population.\"\n\nHer lab is home to Australia's only scientific \"poo machine\", a series of glass chambers that recreate what happens in the human digestive system.\n\nTests have shown less than 5 per cent of anthocyanins are absorbed in the small intestine, with most of the absorption happening in the large intestine.\n\nScientists are testing Queen Garnet extract to see if it protects lab-grown brain cells from inflammation. (ABC Landline: Cameron Lang)\n\n\"The magic happens in the colon where the poo is,\" Professor Sultanbawa said.\n\n\"You get like 10 trillion micro-organisms in your poo, and that microbiota will convert the anthocyanins to little molecules …which are really good for your body… [they're] anti-inflammatory, antioxidant and even cognitive functions will be improved.\"\n\nThis lab has a \"poo machine\" to study how the gut processes the plum's anthocyanins. (ABC Landline: Cameron Lang)\n\nWith dementia and brain injury placing increasing pressure on families and the economy, she argues it's only logical to invest more in gut-brain research — a move that may cost millions in the short term but could save billions in healthcare in the future.\n\nHollywood interest boosts Queen Garnet profile\n\nThe plum season ended last month, but interest is ramping up.\n\nActor Chris Hemsworth recently showed interest in the Queen Garnet plum.\n\nSeveral years ago, the movie star discovered he was predisposed to developing Alzheimer's and commissioned a television series looking at the latest breakthroughs in dementia prevention.\n\nChris Hemsworth has been on a mission to raise awareness about dementia prevention. (AAP: Mick Tsikas)\n\nHis research team contacted Sid and Bonney Ghosh, who own a controlling share in Nutrafruit, the company with the rights to market the plum.\n\nThe father and son team are excited the Australian-bred plum, with higher levels of anthocyanins than blueberries, might feature in Mr Hemsworth's series.\n\nBonney and Sid Ghosh are expanding the Queen Garnet plum's reach into global markets including China. (ABC Landline: Cameron Lang)\n\n\"It is early conversations; I think they weren't expecting to find something in their own backyard, so there's a lot of energy around that,\" CEO of Nutrafruit Sid Ghosh said.\n\nA spokesperson confirmed Chris Hemsworth plans to feature the Queen Garnet plum in his new YouTube series later this year.\n\nWatch ABC TV's Landline at 12:30pm on Sunday or on ABC iview.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-12/pm-announces-new-darwin-residential-aged-care-facility/105166186",
        "title": "Labor's aged care 'plan' for Darwin has been promised for years",
        "publish_date": "Fri, 11 Apr 2025 22:35:03 +0000",
        "category": "finance",
        "authors": [],
        "text": "On his first visit to Darwin during the election campaign, Prime Minister Anthony Albanese promised $60 million to build a 120-bed residential aged care facility in the Top End.\n\nWhile Labor billed it as a \"new\", locked-in announcement, Territorians have been waiting for the facility for four years.\n\nIt was first promised by the Northern Territory's previous Labor government in 2021 and backed by the Commonwealth — but since then, nothing has been delivered.\n\nFor elderly Territorians such as Jillian Emerson-Smith, the damage of waiting for a place in the NT's overloaded aged care system has already been done.\n\n\"You can't do that to people who are in desperate situations. This is a desperate situation,\" she said.\n\nHer husband Max was diagnosed with dementia five years ago and for some time, the pair was still able to live regionally in Mataranka, surrounded by the territory bush.\n\nBut eventually, Max needed more support.\n\nJill and Max lived in Mataranka, four hours south of Darwin, before they had to move to the city for his care. (ABC News: Michael Franchi)\n\nThey couldn't find it in Mataranka, so they moved to Darwin.\n\nAs Max's condition became more severe, Jill had to make the heart-wrenching transition from life partner to full-time carer.\n\nEventually, his care needs became so great, he couldn't be left alone.\n\nJill missed the funerals of both her brother and sister-in-law because she couldn't find respite care.\n\n\"You are at breaking point, and that in itself is incredibly difficult to acknowledge,\" she said.\n\nJill says she was at \"breaking point\" while looking after Max full-time. (ABC News: Michael Franchi)\n\n'There was nothing I could do'\n\nWhen the couple finally confronted the reality Max needed more support than at-home care, they were turned back from two residential aged care facilities.\n\nOne had a waitlist spanning more than a year, the other was three months. Both were unbearable.\n\nPlanned new aged care beds won't meet NT's growing demand Photo shows An older man and woman sit on a beach holding hands The Northern Territory is set to get 60 new aged-care beds, but advocates say it will not meet the growing demand.\n\n\"The wait times — it was just cruel,\" said Jill.\n\n\"I felt incredibly alone and isolated, and there was nothing I could do about it.\"\n\nAfter what felt like an endless three months, an aged care place opened up at a private facility in Darwin, offering Jill much-needed relief.\n\nDouble the number of beds\n\nCurrently 60 to 80 elderly Territorians are hospitalised on any given day according to NT Health, which contributes to severe overcrowding in Royal Darwin Hospital.\n\nInsiders have told the ABC the bed block means the hospital often operates under emergency conditions.\n\nThe waitlist for aged care beds is putting pressure on the NT's stretched health system. (ABC News: Maren Preuss)\n\nThe former NT government's promised aged care facility was to be funded by the Commonwealth and include 60 beds, with 12 of those for specialist dementia care.\n\nThe plan had been to partner with the private sector to deliver the facility next to the Palmerston Regional Hospital, outside Darwin.\n\nBut earlier this year, NT Health confirmed the former government had not found any providers that could both build and manage the facility.\n\nAnthony Albanese said Australia's aged care system was neglected before Labor took government in 2022. (ABC News: Pete Garnish)\n\nIn the meantime, a federal overhaul of aged care funding left its future in limbo.\n\nNow federal Labor has committed to building the same facility with double the number of beds.\n\nThe prime minister argues during its first term in government, Labor has turned around an aged care system in \"crisis\".\n\n\"Is there more work to do? Absolutely,\" Mr Albanese said.\n\nShadow Minister for Health and Aged Care Anne Ruston said an elected Coalition government would \"invest up to $60 million in aged care infrastructure to ensure Territorians get the care they need, when they need it\".\n\n\"The Coalition has been working constructively with the NT government and local providers on this issue and how best to remove existing barriers to investment in the Top End,\" she said.\n\nSteve Edgington says it will take double the amount of funding to deliver the 120-bed facility. (ABC News: Lillian Rangiah)\n\nMore funding needed\n\nNT Health Minister Steve Edgington believes the cost will be double what Labor has set aside.\n\n\"The reality is that the initial estimates [are] around $120 million to establish a 120-bed facility in Darwin,\" he said.\n\nCouncil on the Ageing NT's Sue Shearer has also pointed out more than half those beds will be immediately snapped up by people on the hospital waitlist.\n\n\"Now I'd say [we need] at least 200 beds,\" she said.\n\nSue Shearer says the government needs to do more to attract aged care staff to the territory. (ABC News: Pete Garnish)\n\n\"We have the fastest growing number of seniors in the country … they need to be able to age very safely and have the care they deserve.\"\n\nShe believes whichever party forms government needs to do more to attract aged care staff to the NT, and support First Nations Territorians living remotely to age on country.\n\nHaving spent years waiting for updates, Jill is sceptical about whether any government will deliver the facility.\n\n\"They'll tell us what they want us to hear and foolishly, we listen,\" Jill said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-12/flu-shots-and-flu-season/105155176",
        "title": "The best time to get a flu shot for expected 'severe' season",
        "publish_date": "Fri, 11 Apr 2025 22:25:32 +0000",
        "category": "lifestyle",
        "authors": [],
        "text": "Doctors say now is the best time to get a flu shot amid a surge in influenza cases across Australia.\n\nThe number of lab-confirmed flu cases recorded nationally between January and March this year was 59 per cent higher than the same time last year, according to the Royal Australian College of General Practitioners (RACGP).\n\nRACGP president Michael Wright said the increase indicated an early start to the flu season.\n\n\"We are definitely telling people that the flu is circulating in the community,\" Dr Wright said.\n\n\" Now is the time to get your vaccine, particularly if you're a vulnerable person. \"\n\nThe advice was echoed by the Australian Medical Association, which said the best time to get a flu shot was from April onwards.\n\nIt came after the northern hemisphere experienced a significant influenza season, with some UK hospitals overwhelmed by the winter peak and the US recording the largest influenza season since the 2009 swine flu pandemic.\n\nMichael Wright says it is the right time to get a flu shot. (Supplied: RACGP)\n\nTiming matters\n\nDr Wright said the early spike in Australian cases was an ominous sign, and it was important to book in for a flu shot sooner rather than later.\n\nRecord high Influenza cases confirmed as experts predict early flu season Photo shows Woman in bed with a cold blowing her nose. A record number of influenza cases has been recorded in Australia, jumping 50 per cent from the same period last year. Experts are predicting flu season to come earlier than usual.\n\nHe said a flu vaccine would remain effective for up to five months, taking recipients through to the end of the season.\n\n\"If you start getting it now, you'll have that immunity when we get to the peak flu season, which is around July/ August,\" Dr Wright said.\n\n\" That should protect people through that main spike that we're expecting. \"\n\nMore than 4,000 people were hospitalised in Australia with influenza last year.\n\nDr Wright said those in higher-risk groups should start talking to their GP about accessing free influenza vaccinations under the National Immunisation Program (NIP).\n\nDoctors say Australia is facing a severe flu season. (ABC News: Freya Michie)\n\nThat includes people over 65, those with chronic health conditions, pregnant women, and children over six months and under five Aboriginal and Torres Strait Islander people.\n\nHe said while a double shot of the flu vaccine was not routinely recommended, there were some groups that could benefit from a booster, including children over six months and those less than five years old.\n\n'Unprecedented numbers'\n\nThe northern hemisphere has experienced a significant influenza season.\n\nLouise Manning says there are concerns the 2025 influenza season could be severe. (Supplied: Rural Doctors Association of Australia)\n\nRural Doctors Association of Victoria president Louise Manning said it was worrying.\n\n\"I'm quite concerned as to what we might see as the weather gets cooler and [there are] more viruses spreading around,\" Dr Manning said.\n\nShe said strains that circulated during the northern hemisphere winter typically travelled south and impacted the Southern Hemisphere.\n\n\"They had unprecedented numbers of presentations of the flu,\" Dr Manning said.\n\nAnd the impacts are already being felt across Australia.\n\n\"From where I'm working in a small regional town in central Victoria, we've seen almost an entire primary school knocked out with flu B about six weeks ago,\" Dr Manning said.\n\n\"We're quite concerned that, given the severity of symptoms and the number of hospitalisations in the northern hemisphere in their winter, that we'll have a similar picture here.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-12/act-st-eddie-principal-calls-for-40kph-school-zone-after-hit-a/105166480",
        "title": "'Common sense': Principal calls for 40kph zone after boys hit by car",
        "publish_date": "Fri, 11 Apr 2025 22:15:08 +0000",
        "category": "finance",
        "authors": [],
        "text": "Two St Edmund's College students being hit by an allegedly stolen car outside their school in Canberra has seen a renewed push to include additional 40 kph zone and pedestrian crossing at school.\n\nCollege Principal Tim Cleary said it's \"extraordinary they're both alive\" after on the shocking accident that nearly claimed the lives of the 14 and 15-year-old boys.\n\n\"Aaron's out of hospital, one of the boys is out of hospital, making a great recovery,\" he said.\n\n\"Aiden's got a bit to go, but he'll get there as well.\"\n\nThe boys were on a grass verge just outside the school when they were struck by the car. (ABC News: Emily Anderson)\n\nThe students were walking to school when they were struck on Canberra Avenue, a major route through the ACT, by an allegedly stolen car and were critically injured.\n\nIt was a near-tragedy that ploughed St Edmund's College, and the wider Canberra community, into the issue of road safety around Canberra schools.\n\nAnd it's a danger that has been on Mr Cleary's mind for many years.\n\nTim Cleary says it's \"extraordinary\" both the boys who were hit by the allegedly stolen car are still alive. (ABC News: Emily Anderson)\n\n\"Boys have got less than eight seconds to cross two lanes of traffic and 130 metres,\" he said.\n\n\" I sort of hold my breath and watch them all cross the road. \"\n\nMr Cleary said \"common sense\" changes are needed, including a 40 kilometre per hour zone at certain times of the day.\n\n\"We understand that people need to get to work, and the traffic needs to flow, but we just want them to slow down a bit at critical times,\" he said.\n\n\"And we'll be making petitions to government at all levels early in the new [school] term.\"\n\nNeighbouring school shares concerns\n\nSt Clare's College Principal Ann Cleary says her school is currently running a survey of parents and carers about what safety improvements are necessary. (Supplied: Ann Cleary)\n\nSt Clare's College is next to St Edmund's and is also pushing for safety improvements in the area.\n\nThe school is currently seeking information from its parents, friends and carers about what safety improvements are necessary.\n\nSchool Principal Dr Ann Cleary said that survey has already received over 140 responses.\n\nOne year ago St Clare's and St Edmund's College representatives met with ACT bureaucrats to put forward the case for upgrades on Canberra Avenue.\n\nThose suggestions included installing a pedestrian crossing, but nothing was forthcoming.\n\n\"The reason that they said a crossing would not be suitable was because we were unlikely to meet the threshold of the number of students who crossed the road on any particular day, in order to justify the cost … to install and maintain,\" Dr Cleary said.\n\nACT government considering improvements\n\nMinister Tara Cheyne says no options are off the table, but a 40kph zone is unlikey. (ABC News)\n\nACT Minister for City Services Tara Cheyne, who is responsible for road safety in the ACT, said the government was reviewing pedestrian access and safety on Canberra Avenue.\n\nShe said \"nothing's off the table\", but that a 40kph zone on Canberra Avenue is unlikely at this stage.\n\n\"Some things are looking more likely than others,\" Ms Cheyne said.\n\n\"In the short-term, what I think is the most viable option would be a [signalised] pedestrian crossing.\n\n\"I think that would still achieve the aims without slowing down the traffic at other times, and still being able to move the volume of traffic that we hope to on an arterial road.\"\n\nMs Cheyne added that any changes to Canberra Avenue would require clearance from the National Capital Authority as well as ACT government approvals.\n\nSchool communities concerned about broader driver behaviour\n\nVeronica Elliott of the ACT Council of Parents & Citizens Association says it's every driver's responsibility to slow down for school zones. (ABC News: Darren Reichard)\n\nACT Council of Parents & Citizens Association Executive Officer, Veronica Elliott, said one of the association's most common feedback is issues around driving behaviour in school zones.\n\nShe said that multiple schools and regions of Canberra are witnessing a variety of dangerous driving behaviours — both within and outside of designated 40kph zones — that are putting students at risk.\n\n\"We hear all the time from our [parents and carers] that one of their top concerns is always around the driving behaviour of people through school zones,\" Ms Elliott said.\n\n\"Anything from speeding to double parking to blocking access or doing U-turns, you know, in the middle of a really busy street.\"\n\nMs Elliott added that it was every driver's responsibility to slow down for school zones.\n\nTim Cleary says over the holidays the school will regroup and renew. (ABC News: Darren Reichard )\n\n\"No matter who we are — whether we're a parent, or a grandparent, or maybe just a local citizen driving through — we need to just take a little bit more time to make sure that our students are safe, because this is why we do have school zones,\" Ms Elliott said.\n\nMr Cleary said students, staff and families are just hoping for some time to draw breath — and for action to be taken to lower the chance of such a terrible situation happening again.\n\n\"It's been two weeks since the incident [that] morning, so a lot has gone on in that time of course,\" he said.\n\n\"But [it's] holidays as of this afternoon, we'll regroup and renew ourselves.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-12/home-care-package-reform-raising-concern-for-older-australians/105143628",
        "title": "'Dismal, pathetic, horrific': Older Australians brace to pay more for home care",
        "publish_date": "Fri, 11 Apr 2025 22:14:32 +0000",
        "category": "finance",
        "authors": [],
        "text": "Federal government reforms to aged care are just months away and there's growing anxiety among some older Australians about what it will mean for them financially, as co-payments for home care are about to be introduced.\n\nChristina Tsobanis is an advocate and carer for her mum who has Alzheimer's disease.\n\n\"We all hope to grow old and we all hope that we have the right supports around us,\" she said.\n\nMs Tsobanis's mum is on a level 4 home care package, receiving help from carers for 16 hours a week.\n\nChristina Tsobanis is worried a cost increase could force users to reduce the services they receive. (ABC News: Barrie Pullen)\n\nWith federal government aged care reforms coming into effect on July 1, Ms Tsobanis is worried about what it will mean for those new to the system, particularly full pensioners such as her mum.\n\n\"They're already struggling. They're already at their financial limitations and they've worked their whole lives, they've paid their taxes,\" she said.\n\nThe new Support at Home Program, supported by both major parties, is designed to shorten wait times for home care packages and lift funding for the highest classification of need up from $60,000 to $78,000 a year.\n\nIt will also see older Australians pay a co-payment depending on the services they receive and their income.\n\nUnder the reforms, in-home care will have eight levels of support (instead of four currently), which are needs based and means tested. (ABC News: Hugh Sando)\n\nThere are three categories:\n\n• Clinical care, such as nursing and occupational therapy\n\n• Independence supports, such as help with showering, dressing and medications\n\n• Everyday living supports, such as help with cleaning, gardening and meals\n\nFor clinical care, the government-funded budget can pay for the whole cost.\n\nFor independence supports and everyday living supports, you will be expected to pay some of the cost out of your own pocket, depending on your means (see table below).\n\nYour situation What you will pay for Clinical care Independence support Everyday living Full pensioner 0 per cent 5 per cent 17.5 per cent Part pensioner or health card holder 0 per cent 5-50 per cent 17.5-80 per cent Self-funded retiree 0 per cent 50 per cent 80 per cent\n\nFor the first time, the maximum price of home care services will be set by a government regulator to prevent overcharging.\n\nFinancial help for those who need it\n\nThe federal government will save $12.6 billion over 11 years from the reforms — including reforms to residential aged care contributions — which will include a \"no worse off principle\", meaning no person already in aged care will have to make a greater contribution to their care.\n\nHow aged care fees are set to change Photo shows An aged signpost showing figures holding hands with words 'aged' underneath The government has released the details of a new fee structure for aged care, which has bipartisan support. Find out how they will affect you.\n\nIn a statement, the Australian Government Department of Health and Aged Care said people on existing home care packages, dating from September last year, will be no worse off and the government will help anyone who can't afford to pay the new fees.\n\nBut Ms Tsobanis said accessing financial support could be complicated.\n\n\"I don't even agree with the forcing them into a position where they have to apply for the hardship policy because it's degrading,\" she said.\n\n\" They have worked all their lives and now they're elderly they have to sit there and justify their existence? \"\n\nMs Tsobanis has invested time attending webinars and doing research to understand the changes that are coming for home care.\n\nIn September, Anthony Albanese, Anika Wells and Jim Chalmers announced reforms to the aged care sector they described as \"once in a generation\". (ABC News: Adam Kennedy)\n\nWhile her mum comes under the \"no worse off\" promise she has calculated if she were new to the scheme, they would be paying $200 per fortnight in co-payments.\n\n\"The cost would mean we would need to substantially reduce the services we currently receive,\" she said.\n\nMs Tsobanis worries that if providers lift their prices, even those under the \"no worse off\" policy will need to look at reducing their current supports to ensure they maintain their budget.\n\nSam* (not their real name) is on a level 4 package and is also covered by the \"no worse off\" policy.\n\nBut Sam describes the changes coming for those new to home care as \"dismal, pathetic, horrific, unrealistic, a poor joke, and a very sad reflection on how society treats the elderly\".\n\n\"The hardship rule cost constantly quoted is so restrictive that most will not qualify,\" they said.\n\n\" They may as well have just announced a pension cut but that would not be as palatable. But the outcome is the same for many. \"\n\nAnxiety about affordability\n\nJim Moraitis runs an aged care education and advisory service, and said many older Australians already found the aged care system difficult to navigate.\n\nHe said the upcoming support-at-home changes were only adding to their stress.\n\n\"The overwhelming sentiment in our [community hub] is one of deep concern, anxiety and frustration,\" he said.\n\nHe says many home care providers currently waive existing co-payment fees to remain competitive.\n\nJim Moraitis says many older Australians already struggle to navigate the aged care system. (ABC News: Monish Nand)\n\nHe said the new, more-structured approach would make co-contributions unavoidable in many cases.\n\nBased on current pricing of services, Mr Moraitis estimates a full pensioner receiving about five to six hours of support a week could pay anywhere between $10 and $30 a week more.\n\n\"For someone living on the full pension of about $1,100 per fortnight, even a modest co-payment could impact affordability, especially for those also managing rent, utilities and other living costs,\" he said.\n\nThe co-payments for part pensioners and self-funded retirees will be higher and means-tested.\n\nMr Moraitis said not all self-funded retirees had the capacity to pay more or had easy access to funds.\n\n\"We may see some retirees opt out of care services altogether, which could lead to delayed support needs and greater pressure on hospitals and aged care facilities down the track,\" he said.\n\nShowering not a luxury, advocates say\n\nThe Older Persons Advocacy Network (OPAN) said there were good aspects to the new Aged Care Act.\n\n\"The Support at Home Program has a lot of positives of bringing more timely services, more services in people's homes … and access to allied health,\" OPAN chief executive Craig Gear said.\n\nHe has also welcomed a palliative care payment of $25,000, which will be available to help recipients spend their final three months at home.\n\nThe Support at Home Program works to keep older Australians living at home independently for longer. (ABC News: Luke Bowden)\n\nMr Gear has raised concerns about the classifications of some services, saying that under the new rules help with showering falls under independent support and will therefore attract a co-contribution.\n\n\"We think showers should be considered as part of clinical care that is not a luxury,\" he said.\n\nThe organisation also has concerns about a lack of detail on the changes, which is just months away from being introduced.\n\n\" Some of the pricing information people are looking for, we know providers are looking for that as well. \"\n\nA government fact sheet containing information about the changes to Home Care Packages under Support at Home, is available here.\n\nCan older Australians avoid aged care costs?\n\nMr Moraitis said the government had been working to close loopholes that could help aged care service users avoid or reduce paying costs.\n\nElderly Australians to pay more under aged care deal struck by government Photo shows A young woman comforts an older man holding a stress ball Major changes in aged care are coming, after months of back-room negotiations over sensitive reforms including requiring many new aged care entrants to pay more for their own care.\n\nHe said trying to game the system could backfire if policies changed.\n\n\"While some people may try to shield assets by transferring money into family trusts or gifting it to children, there are strict rules in place to prevent this from affecting aged care fees and entitlements,\" he said.\n\n\"If someone gives away large amounts of money or transfers assets below market value, Centrelink still counts those assets for five years when assessing aged care fees and pension eligibility.\"\n\nMr Moraitis said family trusts were closely scrutinised.\n\n\"If a person is a beneficiary or has control over a trust, the value of the trust may still be considered as part of their assessable assets, depending on how it is structured,\" he said.\n\nHe said in some cases, people who had planned more than five years in advance before needing care may have structured their assets in ways that could reduce aged care fees.\n\n\"However, for most people, the government closes loopholes by ensuring that 'deliberate deprivation' of assets does not lead to reduced contributions,\" he said.\n\n\"Anyone considering these strategies should seek financial advice from an accredited aged care specialist to avoid unexpected consequences, including impacts on pension eligibility and estate planning.\"\n\nThis story is not intended to provide financial advice and readers should consult a qualified professional for financial advice.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-04-12/tennis-alex-de-minaur-alexei-popyrin-monte-carlo-wrap/105169082",
        "title": "'Pretty crazy': De Minaur records career-first to advance to Monte Carlo semis",
        "publish_date": "Fri, 11 Apr 2025 21:52:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "Alex de Minaur has showcased his ruthless side by humbling Bulgarian star Grigor Dimitrov 6-0, 6-0 to feast on the first \"double bagel\" of his professional career while powering into the Monte Carlo Masters semifinal.\n\nThe Australian was in a merciless mood against the out-of-sorts veteran, taking only 44 minutes to hand the world number 18 one of his most embarrassing defeats on the Monte Carlo Country Club's main arena, Court Rainier III.\n\nIt was a real statement performance from 26-year-old de Minaur as he reached the third clay-court semifinal of his career and demonstrated that this was no longer a surface that befuddled him.\n\nAsked if he realised he had achieved the first whitewash win of his pro career, de Minaur smiled: \"I did know that — and I also know the only time I ever lost 6-0, 6-0 myself was to Tommy Paul in the semifinals of the US Juniors. It's pretty crazy.\"\n\nA \"double bagel\" is certainly a rare feat at this level of tennis. Indeed, it was the first such scoreline in any ATP tournament at the quarterfinal stage and beyond for 12 years since the great Roger Federer blanked Mischa Zverev in the last eight in Halle.\n\nDe Minaur, ranked number 10 in the world, had expected a tough duel against the evergreen Dimitrov, but after dominating the early stages, he seemed to drain all the belief and confidence from the 33-year-old and then never took his foot off the pedal as the Bulgarian just coughed up more unforced errors, 23 in all.\n\nAfter winning the first set 6-0 in just 23 minutes — the first time Dimitrov has failed to win a game in any stanza for nine years — de Minaur earned another break at the start of the second with a dazzling backhand lob that just continued the strangulation.\n\nNothing went right for Bulgaria's Grigor Dimitrov, who was beaten in just 44 minutes. (Getty Images: Mateo Villalba)\n\nGetting only stronger and more aggressive as the one-sided fare progressed, de Minaur dropped only 15 out of the 63 points played to become the first Australian since John Alexander in 1979 to make the semifinals of the famous old tournament in the principality.\n\nHe is also the first Aussie since Lleyton Hewitt in Hamburg in 2007 to reach a Masters 1000 clay-court semifinal as he chalked up a tour-leading 20th win of the season.\n\nThere was even better news for de Minaur as he pondered the chance of reaching his first clay-court final as he will not be facing his nemesis Stefanos Tsitsipas in the last four, with Italian Lorenzo Musetti causing an upset by defeating the Greek 1-6, 6-3, 6-4.\n\nTsitsipas, who had a woeful day with his serving, holds an 11-1 career record against de Minaur, but the Australian has a 1-1 record against the Wimbledon semifinalist Musetti in what looks a difficult match to call as they meet for the first time on clay.\n\nEarlier, the rare treat of two Australians making the semis of the same Masters event was dashed when Alexei Popyrin was soundly beaten 6-3, 6-2 by Spain's Alejandro Davidovich Fokina in 69 minutes.\n\nSo frustrated was Popyrin by his off day after winning three matches in three days, he ended up getting a code violation for ball abuse, trying to smash one out of the stadium in anger.\n\nThe match of the day, though, featured Carlos Alcaraz's fabulous, hard-fought victory over young French gun Arthur Fils, the 20-year-old rising talent who will be ruing his missed opportunities after going down 4-6, 7-5, 6-3 in a thrilling contest on Rainier.\n\n\"I have missed clay,\" the French Open champ beamed.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/us-masters-swearing-inside-but-jason-day-has-fighting-chance-20250412-p5lr7u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Day nearly rewrites 46 years of Masters history before final-hole blemish",
        "publish_date": "Sat, 12 Apr 2025 11:43:19 +1000",
        "category": "sports",
        "authors": [
            "Murray Wenzel"
        ],
        "text": "Rory McIlroy roared back from the brink at Augusta National, Jason Day flirted with a 46-year Masters record while runaway overnight leader Justin Rose saw his advantage evaporate.\n\nEngland’s former world No.1 Rose carded a one-under-par 71 on Friday to cling to the 36-hole lead at eight under, holing a clutch par putt on the last with his rivals circling.\n\nAmerica’s Bryson DeChambeau chipped in from a bunker on the way to a four-under 68, stalking Rose a shot back in outright second.\n\nCanada’s Corey Conners was a stroke further back and will partner McIlroy (six-under) on Saturday after the Northern Irishman’s emphatic response to a Thursday meltdown that had seemingly blown his chances of a maiden green jacket and career grand slam 11 years in the waiting.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/victoria/the-age-photos-of-the-week-april-12-2025-20250405-p5lpg4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age photos of the week, April 12, 2025",
        "publish_date": "Sat, 12 Apr 2025 11:35:09 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "7/26\n\nStacey Edwards and Kent Morris in front of Stacey’s work. Kent Morris, curator of the new show Black In-Justice and head of the Torch program, and Stacey Edwards, former prisoner and now artist, who came thru the Torch program which helps Indigenous people who are in jail reconnect with their culture through art and has been very successful in helping get people on a path to not reoffending. Credit:Justin McManus",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/rory-surges-back-into-contention-20250412-p5lr82.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rory surges back into contention",
        "publish_date": "Sat, 12 Apr 2025 11:24:47 +1000",
        "category": "finance",
        "authors": [],
        "text": "Rory surges back into contention\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/golf/bryson-holes-out-from-bunker-20250412-p5lr7y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bryson holes out from bunker",
        "publish_date": "Sat, 12 Apr 2025 11:04:34 +1000",
        "category": "sports",
        "authors": [],
        "text": "Bryson holes out from bunker\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/leniu-in-explosive-post-match-tirade-at-thurston-at-suncorp-stadium-20250411-p5lr75.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Don’t be fake’: Leniu doubles down on post-match tirade towards Thurston",
        "publish_date": "Sat, 12 Apr 2025 10:45:34 +1000",
        "category": "sports",
        "authors": [
            "Michael Chammas",
            "Christian Nicolussi"
        ],
        "text": "Roosters prop Spencer Leniu has accused Queensland Maroons great and Nine commentator Johnathan Thurston of being “two-faced” and “fake” following their on-field run-in at Suncorp Stadium on Friday night.\n\nLeniu is alleged to have called Thurston a “f---wit”, then a “f---ing c--t”, with the bad blood stretching back to Thurston’s views on Leniu’s eight-game suspension at the start of last season for racially vilifying Brisbane five-eighth Ezra Mam during a match in Las Vegas.\n\nSpencer Leniu and Johnathan Thurston on Friday night. Credit: NRL Photos\n\nTaking to social media on Saturday morning, Leniu posted on his Instagram account: “I never wanted to talk to JT. He kept trying to come speak to me. I said, ‘Lad idc [I don’t care] if that you hate me for what I did [calling Ezra Mam a ‘monkey’ in Las Vegas]. But don’t come up to me asking me questions like we’re Algood (sic). Don’t be two face. Hate me lad I’m eetswa [sweet] with that. But don’t be fake. I hate fake people.”\n\nNRL chief executive Andrew Abdo on Saturday said there was nothing to investigate because there had been no complaint lodged by Thurston or Nine, the publishers of this masthead.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/federal/the-latest-illustrations-from-artist-alan-moir-20230608-p5df1x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Alan Moir",
        "publish_date": "Sat, 12 Apr 2025 10:44:28 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Alan Moir\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/world/north-america/on-a-night-like-this-the-week-australia-took-new-york-city-by-storm-20250411-p5lqxk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "On a night like this: The week Australia took New York City by storm",
        "publish_date": "Sat, 12 Apr 2025 10:30:26 +1000",
        "category": "entertainment",
        "authors": [
            "Michael Koziol"
        ],
        "text": "There is never a shortage of Australians in New York City, but for the past two weeks, you’d be forgiven for thinking you were in central Sydney or Melbourne.\n\nLast Friday, the iconic Empire State Building was lit up in green and gold for pop superstar Kylie Minogue, who played two shows at the city’s famed Madison Square Garden.\n\nThe Empire State Building, left, and Madison Square Garden lit up in Australian green and gold on April 4. Credit: Australian Consulate-General New York.\n\nA short walk away at the Music Box Theatre, Adelaide’s own Sarah Snook has started the Broadway run of The Picture of Dorian Gray, a one-woman take on the Oscar Wilde classic that premiered at the Sydney Theatre Company (STC) in 2020 with Eryn Jean Norvill playing the 26 roles.\n\nIn the years since, director Kip Williams has taken his manic, multi-camera production to London’s West End, also with Snook, and now to New York, where the Succession star performs for sellout crowds in the biggest theatre market in the world.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/biological-parents-have-no-legal-right-to-child-born-to-wrong-family-in-ivf-bungle-20250412-p5lr7t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Biological parents have no legal right to child born to wrong family in IVF bungle",
        "publish_date": "Sat, 12 Apr 2025 09:50:19 +1000",
        "category": "finance",
        "authors": [],
        "text": "Biological parents have no legal right to child born to wrong family in IVF bungle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Sydney Morning Herald",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/soccer/ange-reveals-tottenham-leak-20250412-p5lr7s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ange reveals Tottenham leak",
        "publish_date": "Sat, 12 Apr 2025 09:49:34 +1000",
        "category": "sports",
        "authors": [],
        "text": "Ange reveals Tottenham leak\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/pucovski-may-face-an-uneven-playing-pitch-when-it-comes-to-compensation-20250410-p5lqta.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pucovski may face an uneven playing pitch when it comes to compensation",
        "publish_date": "Sat, 12 Apr 2025 09:40:00 +1000",
        "category": "sports",
        "authors": [
            "Darren Kane"
        ],
        "text": "Will Pucovski always had that certain swagger about him, with a mountain of courage and fortitude. As an opening batsman must.\n\nAny instance of a professional athlete calling time on their career brings a spectrum of emotion. But when the athlete’s hand is forced due to an accumulation of incidents, the mood of the contemplation is much darker.\n\nWhen that athlete represents the epitome of a destiny unfulfilled, the conversation is devastating. To retire at 27 years of age and having played just one Test for Australia in 2021, that would chew at anyone’s inner thinking.\n\nIt must be enormously confronting as a 27-year-old to admit to yourself that you won’t play any cricket any more. But still not as terrifying as it would be to suffer serious concussion-related symptoms more than a year after the last in-match incident.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/from-disneyland-to-rugby-s-big-dance-how-tiny-desi-became-a-big-deal-in-footy-20250408-p5lq3l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From Disneyland to rugby’s big dance: How tiny Desi became a big deal in footy",
        "publish_date": "Sat, 12 Apr 2025 09:31:16 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Aunt Gail Miller won a famous gold medal at the Sydney Olympics in the Australian water polo team in 2000, and her uncle Paul Miller boxed at the Sydney Games, too, and won a Commonwealth Games gold medal in 2002. Miller’s dad Anthony was a nationally ranked swimmer and good rugby player, too, in the same Brisbane school team as John Eales and as a flanker at Norths. Gail Miller (back row, far left) was a member of the Australian women’s water polo team. Credit: Steve Baccon Anthony hardly a black sheep of the Miller clan, though: he was last year appointed chief executive officer of Westpac. “He is a very high achiever, too,” Miller said “My dad was a very competitive swimmer, he didn’t quite crack the Olympics, but he was a massive workhorse. So I definitely had a lot of people in my life that showed me the value of work ethic, especially in the sporting realm. And it made me believe, ‘oh, it’s possible, I can go do that too’.”\n\nMiller was one of those Energizer bunny kids who excelled at gymnastics and dancing from a young age. It wasn’t unusual to be out the door at 6am and back at 9pm. Desiree Miller performing as a young state squad gymnast In the gym, Miller was a state representative on the floor, beam, bars and vault, and in the dance studio, she performed in ballet, tap, jazz, hip-hop and contemporary disciplines. “We used to travel around the world every couple of years (for dance),” Miller said. “We competed in Spain and in America, we even performed at Disneyland. I’ve performed at Disneyland three times. It was amazing. I got to travel the world.”\n\nGoing to school in Sydney’s inner-west, and in Hong Kong during her teenage years, Miller also somehow found time to play other sports. Lots of them. “I was a diver, a tennis player, I played soccer, did a bit of basketball, I was too short for that. And netball and hockey, too - just a bunch of sports,” she said. “I felt (dance) helped me translate so much, especially whenever I tried a new sport, I was always balanced and coordinated. Same with gymnastics, I had that power and strength. So when I made the turn to rugby, it was kind of combining everything - and adding the contact part that I was missing out on for all those years.” Desi Miller scoring her third try in the 2024 Super W grand final. Credit: Getty Images In mid-2021, with COVID-19 still stalking the world, Miller was looking for a new team sport and to make some new mates. A friend suggested rugby and Miller rolled up at Easts where she was introduced to the game via sevens, and then 15s. It was love at first tackle bag.\n\n“I was like, ‘this is amazing’. I absolutely love it,” Miller said. Miller’s pace and strength immediately saw her stand out for Easts, and halfway through 2022, she was invited to train with the NSW women’s sevens squad. That turned into 15-a-side squad training with the Waratahs’ Super W squad, and in 2023, Miller made her debut for the Tahs against the Force. In the same year, Miller was chosen for the Wallaroos squad and made her debut against England. In the years since, Miller has become a mainstay for NSW and Australia. Her statistics make for eye-popping reading. In 17 games for NSW, Miller has scored 17 tries, made 35 linebreaks and 28 offloads, and beaten a whopping 73 defenders. In 12 Tests, Miller has scored 7 tries, 24 linebreaks and beaten 48 defenders.\n\nThis year, the Super Rugby women’s competition saw several Aussie sevens stars switch to 15s for a few games, in an attempt to make the 2025 Rugby World Cup squad. After electing to not return to the sevens series, Charlotte Caslick will play for Queensland in the decider at North Sydney Oval. Desiree Miller will play in the NRLW grand final on Saturday, Credit: Steven Siewert Many believe the selection of try-scoring machine Maddi Levi - who was world’s best sevens player last year -in the Wallaroos’ squad should be a formality. But the testament of how well the incumbent Wallaroos wingers, Miller and Maya Stewart (who was the Wallaroos’ MVP last year) are both playing, Levi currently wouldn’t unseat either. A bench role is the more likely scenario. Loading",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/technology/there-s-one-way-you-can-make-your-super-more-secure-20250408-p5lq38.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "There’s one way you can make your super more secure",
        "publish_date": "Sat, 12 Apr 2025 09:30:00 +1000",
        "category": "finance",
        "authors": [
            "Tim Biggs"
        ],
        "text": "But credential stuffing is also the perfect real-world illustration of why people are so often told not to reuse passwords.\n\nImagine you sign up to an online service using a particular combination of email and password, and then that service is compromised. Your credentials may end up in a huge collection on the dark web with billions of others, sold fairly cheaply. Now, that service may not have any important data about you. But, if you use that same password elsewhere, it could lead to significant trouble.\n\nLoading\n\nCrooks will load those billions of credentials into an automated system that throws them rapid-fire at services that do have important info, such as financial services. Those services should absolutely have protections against this. If they start getting thousands of different login requests from the same IP address, or several login attempts on the same account from different IP addresses, that should be flagged. Hunt and others have also created protocols that can check passwords to see if they’ve been caught up in a breach, and many companies use these so they can prompt users to change passwords before an attack occurs.\n\nBut an ironclad way to avoid being a victim of credential stuffing is to not reuse passwords, and particularly to have a unique password for any service that holds your money or sensitive data. There are many password managers that will keep all your unique passwords safe and encrypted, and some also integrate the technology that can tell you if one of your passwords has been found in data sold on the dark web, so you can change it.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/crows-make-key-call-for-cats-blockbuster-afl-experts-tips-and-teams-for-round-five-20250409-p5lqdz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL teams and tips: Hawks welcome back Worpel for grudge match",
        "publish_date": "Sat, 12 Apr 2025 09:24:59 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "WEST COAST B: B.Hough, H.Edwards, R.Ginbey HB: J.Hunt, S.Brock, R.Maric C: T.Dewar, L.Duggan, J.Graham HF: J.Cripps, J.Waterman, M.Owies F: A.Reid, O.Allen - C, L.Ryan FOLL: B.Williams, L.Baker, H.Reid I/C: T.Gross, C.Hall, J.Williams, H.Davis, J.Hutchinson EMG: H.Johnston, M.Flynn, T.Cole IN: H.Edwards, J.Waterman, L.Ryan, J.Hutchinson OUT: T.Brockman (Omitted), T.Kelly (Omitted), N.Long (Omitted), T.Cole (Omitted)\n\nCARLTON B: J.Silvagni, J.Weitering, N.Haynes HB: A.Saad, M.McGovern, Z.Williams C: B.Acres, P.Cripps - C, A.Cerra HF: L.Fogarty, H.McKay, S.Docherty F: M.Cottrell, C.Curnow, J.Motlop FOLL: T.De Koning, G.Hewett, S.Walsh I/C: M.Carroll, O.Hollands, B.Kemp, C.Durdin, W.White EMG: E.Hollands, L.Young, C.Lord IN: H.McKay, M.Cottrell, M.Carroll, C.Durdin OUT: L.Young (Omitted), L.Cowan (Injured), A.Moir (Omitted), C.Lord (Omitted)\n\nGOLD COAST B: W.Powell, S.Collins, B.Uwland HB: J.Noble, M.Andrew, D.Rioli C: L.Weller, M.Rowell, S.Clohesy HF: B.Ainsworth, T.Miller, S.Flanders F: B.King, B.Humphrey, E.Read FOLL: J.Witts, W.Graham, N.Anderson - C I/C: J.Walter, N.Holman, B.Long, J.Rogers, J.Jeffrey EMG: B.Fiorini, N.Moyle, C.Graham IN: N.Holman OUT: C.Budarick (Injured)\n\nWESTERN BULLDOGS\n\nB: B.Khamis, L.Jones, L.Bramble\n\nHB: J.Johannisen, R.Lobb, B.Dale\n\nC: B.Williams, T.Liberatore - C, S.Davidson\n\nHF: C.Hynes, A.Naughton, R.Sanders\n\nF: J.O’Donnell, S.Darcy, J.Harmes\n\nFOLL: T.English, M.Kennedy, E.Richards\n\nI/C: L.Cleary, J.Dolan, J.Freijah, L.McNeil, R.West\n\nEMG: J.Busslinger, H.Gallagher, C.Poulter\n\nIN: J.Johannisen, C.Hynes, L.Cleary\n\nOUT: O.Baker (Suspension), L.Vandermeer (Injured), H.Gallagher (Omitted)\n\nBRISBANE LIONS\n\nB: D.Zorko, J.Payne, R.Lester\n\nHB: N.Answerth, H.Andrews - C, D.Wilmot\n\nC: J.Fletcher, Z.Bailey, J.Berry\n\nHF: C.Cameron, E.Hipwood, H.McCluggage\n\nF: C.Rayner, S.Day, L.Morris\n\nFOLL: O.McInerney, J.Dunkley, L.Neale\n\nI/C: C.Ah Chee, W.Ashcroft, L.Ashcroft, W.McLachlan, B.Reville\n\nEMG: S.Marshall, D.Gardiner, D.Fort\n\nIN: -\n\nOUT: -\n\nMELBOURNE\n\nB: J.Bowey, S.May, H.Petty\n\nHB: T.Rivers, T.McDonald, C.Salem\n\nC: K.Chandler, J.Viney, E.Langdon\n\nHF: J.Henderson, B.Fritsch, K.Pickett\n\nF: J.Melksham, J.van Rooyen, C.Spargo\n\nFOLL: M.Gawn - C, C.Petracca, H.Langford\n\nI/C: C.Windsor, C.Oliver, X.Lindsay, H.Sharp, T.Sparrow\n\nEMG: D.Turner, J.Billings, T.Fullarton\n\nIN: X.Lindsay\n\nOUT: D.Turner (Omitted)\n\nESSENDON\n\nB: A.McGrath, B.McKay, J.Ridley\n\nHB: M.Redman, Z.Reid, J.Prior\n\nC: X.Duursma, A.Perkins, A.Roberts\n\nHF: J.Gresham, N.Caddy, N.Martin\n\nF: H.Jones, S.Draper, I.Kako\n\nFOLL: N.Bryan, Z.Merrett - C, S.Durham\n\nI/C: B.Hobbs, D.Shiel, W.Setterfield, J.Menzie, S.El-Hawli\n\nEMG: E.Tsatas, L.Hayes, A.Day-Wicks\n\nIN: A.Perkins, W.Setterfield\n\nOUT: J.Caldwell (Injured), T.Edwards (Injured)",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/afl/connected-collingwood-outmuscle-depleted-sydney-20250411-p5lr7a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hot streak: Connected Pies outmuscle Swans for 10th straight win at Adelaide Oval",
        "publish_date": "Sat, 12 Apr 2025 09:20:45 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan"
        ],
        "text": "Loading\n\nCollingwood coach Craig McRae told his players the number on their back was less relevant than their connection with teammates before they outmuscled Sydney to maintain their perfect record at Gather Round.\n\nAlthough missing Jordan DeGoey, Lachie Schultz and Dan Houston, the Magpies were too strong in the contest.\n\nThe Magpies’ Ned Long was strong in the contest. Credit: AFL Photos via Getty Images\n\nNed Long played the best game of his career to assist the tagged Nick Daicos as the Magpies dominated centre clearance scoring three goals from the source and winning the territory battle.\n\nOn the rare occasions after quarter-time that Sydney were able to move the ball from the back half, Darcy Moore continued his recent renaissance, playing much tighter defensively and trusting his teammates to rebound ground balls if he could not mark.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/the-shock-is-startling-grieving-the-death-of-my-gp-20250407-p5lpv4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘The shock is startling’: Grieving the death of my GP",
        "publish_date": "Sat, 12 Apr 2025 09:09:28 +1000",
        "category": "lifestyle",
        "authors": [
            "Jonathan Seidler"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nThis story is part of the April 12 edition of Good Weekend. See all 12 stories .\n\nTowards the end of summer each year, I wind up at the doctor’s office. It was a standing joke with my GP that each January he would tell me to wear earplugs when swimming, and I’d respond that I couldn’t hear him until after he’d applied a high-pressure surgical piston to blast out the accumulated gunk.\n\nI swim a lot, which is a diplomatic way of saying that I enjoy wading into the crisp ocean and ducking my head under a few waves that are mostly waist-height. When you are lucky enough to grow up near the sea, you partake of this liberally. Dips before work. During lunch. At knock-off. There is nothing like the bracing freshness of a long-awaited plunge.\n\nBut the bones in my ears are not like yours. Since my early 20s they have been growing over, fusing into twisted tree roots that are perilously close to my brain. This is called external auditory canal exostoses and the net result is water gets trapped deep in my ears, calcifies into salty wax and renders me practically deaf.\n\nMy GP was diagnosed with an aggressive form of cancer early last year and passed away a painfully short time later, just as the ocean started warming up. I was bereft at the news of his death; he had been a friend of the family and a wonderfully selfless man. My father had also been a GP, and both their memorials were thronged with the grief of an extended community that had lost something vital to its very functioning. Doctors do not typically get state funerals but in their outpouring of mourners, their farewells can feel a bit like one. A former patient realises very quickly that they are but one of hundreds, all of whom maintain a distinctly personal relationship with someone who checks their bloods, listens to their chests and, on occasion, peers into their ears.\n\nThose who serve our communities aren’t typically thought about in the same way as family members or friends. But they are crucial totems in our lives.\n\nOnce my doctor knew he was dying, his surgery arranged for my file to be transferred to another practice. A different GP would peruse my previous mental health plans and uncover my penicillin allergy. This should not have felt as strange as it did, like intimate details being passed on to a new lover. We tend to hold the view that certain members of society are with us for life; having them suddenly shut up shop, move towns or onto the next astral plane can be highly distressing.\n\nThose who serve our communities, whether they treat our maladies, tailor our dresses or tame our tresses, aren’t typically thought about in the same way as family members or friends. But they are crucial totems in our lives, keepers of knowledge and secrets and an ongoing, living history to which few others have access. The level of trust placed in my hairdresser three days before my wedding is more than I ever expect from anyone at my bank.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/victoria/sunshine-stoush-could-set-back-melton-trains-by-a-decade-labor-says-20250410-p5lqvh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sunshine stoush could set back Melton trains by a decade, Labor says",
        "publish_date": "Sat, 12 Apr 2025 09:00:00 +1000",
        "category": "finance",
        "authors": [
            "Kieran Rooney"
        ],
        "text": "To understand the Sunshine upgrade as proposed by Labor, it helps to think of the project as a level crossing removal or the transformation of a busy road into a freeway. Sunshine sits at the meeting point of multiple regional and suburban rail lines coming from Victoria’s west, including 70 per cent of the V/Line network. Prime Minister Anthony Albanese on Monday spruiking the proposed Sunshine station upgrade with Premier Jacinta Allan. Credit: Alex Ellinghausen The tracks around the station are like a busy traffic intersection where trains are sometimes forced to wait to get into the correct “lane” or reach the platform. The Sunshine project aims to solve these problems by redesigning the network along a six-kilometre stretch of rail so that regional trains, suburban services and freight are kept on their own separate paths. Doing so will make room for 40 trains an hour.\n\nThis includes building a series of rail bridges that will steer trains onto the correct track without having to cut across the path of others. The Level Crossing Removal Project, which has been performing a similar task across 110 different Victorian intersections, is the department delivering the upgrade. A new pair of tracks will also be built between Sunshine and West Footscray to make this untangling process more simple and add capacity for more trains. Sunshine station will be expanded, with two new platforms accommodating these tracks and receiving most V/Line routes. Labor wants to transform Sunshine train station into a transport “super hub”. Credit: Joe Armao By making these changes, V/Line trains will converge more simply onto regional rail tracks towards Southern Cross Station while suburban services from the airport, Sunbury and eventually Melton will funnel onto the same path directly into the Metro Tunnel. V/Line services that are currently forced to skip Sunshine because of capacity constraints will all be able to stop at the station.\n\nThis is why it is being touted as a regional “super hub” where a passenger from Bendigo headed to Geelong would always be able to transfer trains without having to travel into the CBD. Other improvements include the extension of high-capacity signalling, used for Metro Tunnel services, past West Footscray and out to Sunshine, allowing trains to run much closer together and more frequently. An electrified Melton line will also have high-capacity signalling in sections. The project adds a connection point in the network that means suburban Melton trains can plug into the new system without significant further work around Sunshine. Opposition transport spokeswoman Bridget McKenzie on the campaign trail this month with Peter Dutton, announcing the Coalition’s plans for airport rail. Credit: James Brickwood The federal opposition’s plan for the precinct does not specifically include the Melton electrification, new track pair or rail bridges, but would preserve improvements for regional passengers outlined in the Airport Rail business case. This document proposed adding an extra platform for V/Line services.\n\nVictorian Transport Minister Gabrielle Williams told The Age the disruptive nature of the project meant it needed to be done in one go, with Sunshine the most complex part of the network outside the CBD. “It’s incredibly short-sighted. It will set the west back significantly ... You would be putting back Melton electrification by over 10 years,” she said. “This is one of Australia’s fastest growing regions. You can’t plan for more services along that corridor, and the Wyndham Vale corridor as well, unless you do this work to make that happen. “I don’t think westies who live on this side of town, whether it be in the regions or in the suburbs, deserve a half-baked option.” The Victorian government first proposed the electrification of the Melton line in 2018, but since then, the region is yet to receive a firm commitment on when it would be delivered.\n\nLoading Infrastructure Victoria this year has recommended work on the project begin by 2030, warning the Western Freeway will be over capacity in the next five to six years, and crowding on peak-hour Melton trains will increase by 50 per cent between 2031 and 2041. A Liberal spokesperson said there were serious questions around the $4 billion proposal and if elected the Coalition would “assess the business case, projected works, and the cost of the proposed Sunshine Station redevelopment to ensure infrastructure funds are being spent prudently”. “The cost of upgrades at Sunshine station at present is being driven by the Allan government’s SRL gold-plated scoping requirements,” the spokesperson said. “The Coalition will not progress the Suburban Rail Loop.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/roosters-coach-defends-leniu-after-thurston-spat-20250412-p5lr7m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Roosters coach defends Leniu after Thurston spat",
        "publish_date": "Sat, 12 Apr 2025 08:29:20 +1000",
        "category": "sports",
        "authors": [],
        "text": "Roosters coach defends Leniu after Thurston spat\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/article/australian-judge-becomes-latest-to-resign-from-hong-kong-highest-court/nc71ymill",
        "title": "'Arguably cosmetic': Australian judge becomes latest to resign from Hong Kong's top court",
        "publish_date": "Sat, 12 Apr 2025 00:19:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "An Australian judge has become the latest foreigner to resign from Hong Kong's highest court before the end of his term as a security crackdown fans international criticism of a perceived erosion of the rule of law in the financial hub.\n\n\n\n\n\nRobert French, a former Chief Justice of Australia's High Court, said he respected Hong Kong and the \"integrity and independence\" of the remaining foreign judges but that the \"role of the non-permanent justices on the Court of Final Appeal has become increasingly anachronistic and arguably cosmetic\".\n\n\n\n\n\nThe United Kingdom and China agreed to have non-permanent foreign judges on the court when the UK handed its former colony over to Chinese rule in 1997 under a \"one country, two systems\" formula.\n\n\n\n\n\nTheir presence was widely seen by lawyers, businesses and politicians as burnishing the city's rule-of-law credentials after it lost access to the UK's Privy Council for appeals.\n\n\n\n\n\nNoting that the Hong Kong court was the only one in greater China to have foreign judges serving, French said there \"may be a substantive role for international judges in Hong Kong in the future as part of an international commercial court\".\n\n\n\nThe government confirmed the resignation in a statement, saying it was grateful to French for his valuable contributions and his \"support for the rule of law in Hong Kong\".\n\n\n\n\n\nLast year, another non-permanent judge, the UK's Jonathan Sumption, quit the court shortly after a landmark verdict in which 14 prominent democratic activists were convicted for subversion, part of a national security crackdown on dissent.\n\n\n\n\n\nSumption said Hong Kong's rule of law had been \"profoundly compromised\" and the city was \"slowly becoming a totalitarian state\".\n\n\n\nLISTEN TO Why are Australian judges serving in Hong Kong's highest court? SBS News 08/09/2024 05:21 Play\n\nThe number of foreign judges on Hong Kong's Court of Final Appeal (CFA) has fallen from about 13 to five in recent years, with some raising concerns at the imposition of a sweeping national security law.\n\n\n\n\n\nIn his statement to Reuters, French said he rejected any suggestion that foreign judges serving on the CFA were \"somehow complicit in the application ... of national security laws or somehow confer on them a spurious legitimacy\".\n\n\n\n\n\nHong Kong's chief justice is allowed to select one foreign judge — typically retired top jurists from the UK, Australia and Canada — to serve on the five-person Court of Final Appeal at any one time.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/who-is-the-liberal-party/m3gz5aah6",
        "title": "Who is the Liberal Party?",
        "publish_date": "Fri, 11 Apr 2025 23:00:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "WListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nThe Liberal Party.\n\n\n\n\n\nIt's the party with the most election wins under its belt in Australian history.\n\n\n\n\n\nAnd the party of Australia's two longest-serving Prime Ministers.\n\n\n\n\n\nBut where did the Liberal Party come from and who are they now?\n\n\n\n\n\nThe party was formed in 1944.\n\n\n\n\n\nSenior Lecturer at the Australian National University Dr Jill Sheppard says there was a simple idea behind it.\n\n\n\n\n\n\"The Liberal Party really just formed in response to the Labor Party, and that has shaped not only sort of their history, but it also shapes where they are at the moment.\"\n\n\n\n\n\nSir Robert Menzies, the founding member of the Liberal Party, was very strong on the idea of individual choice.\n\n\n\n\n\nHis assessment was that the Labor Party had been born out of the union movement and that no one spoke for people who were self-employed, and the middle class.\n\n\n\n\n\nAnd a bunch of other people thought the same thing, so they banded together to form the Liberal Party, as former Liberal Party Frontbencher George Brandis explains.\n\n\n\n\n\n\"The Liberal Party was conceived to represent the broad mainstream of Australia in those days, not organised labor, and it certainly wasn't designed to represent the big end of town either.\"\n\n\n\n\n\nIn 1949 the Liberal Party won its first election, partnering up with the Country Party of Australia, making Robert Menzies Prime Minister.\n\n\n\n\n\n\"He was hugely successful at creating and sort of driving this sense of purpose that represented an Australian society that made sense to a lot of people, and he called these his forgotten people.\"\n\n\n\n\n\n\"Menzies said the rich can look after themselves, the working man is often looked after by his trade union. But middle class people, small business people, professional people, farmers, artisans, those sorts of people have no one to look after them. So that was the original base of the Liberal Party.\"\n\n\n\n\n\nHe was a strong advocate of the 1901 Immigration Restriction Act - more commonly known as the 'White Australia Policy'.\n\n\n\n\n\nBut in 1966, the Liberal party changed laws, paving the way to abolish the policy.\n\n\n\n\n\nThe party is considered to be the more conservative of the two major parties.\n\n\n\n\n\nAnd since the party is more politically conservative than well, liberal, the name might seem a bit confusing.\n\n\n\n\n\nWhilst in other parts of the world the parties that oppose labour are often named conservative parties, George Brandis says that isn't what the original party was about.\n\n\n\n\n\n\"Of the various options that Menzies had in choosing the name of his new party, he avoided calling it the Conservative Party, because he wasn't a conservative, he was a classical liberal.\"\n\n\n\n\n\nBut Dr Sheppard says there is a conservative element.\n\n\n\n\n\n\"There's two core streams of the Liberal Party, and one is what we would call liberal, but we often call that small 'l' liberal. What we mean there is a genuine belief that government is not here to help you, that you are your best advocate, that you should you can best decide how to live your life, and the less the government does, the better. The conservative stream of the Liberal Party does think that government is okay. They're much less resistant to the idea that government can solve our problems. But what they are less happy about are things like same sex marriage, open borders, you know, international students. They want a smaller, quieter Australia that looks more like it did in the 1960s. It's an incredibly at times, different set of principles that the Liberal Party is trying to manage. Under Peter Dutton, the party feels quite conservative. It feels like a party that just wants us to live quietly, does not want to rock the boat too much.\"\n\n\n\n\n\nOther well-known Liberal party policies include:\n\n\n\n\n\nResettling Vietnamese refugees after the Vietnam war in 1976\n\n\n\n\n\nEstablishing, yours truly, the Special Broadcasting Service in 1977\n\n\n\n\n\nBringing in tougher gun laws after the Port Arthur massacre in 1996\n\n\n\n\n\nAnd creating Operation Sovereign Borders in 2014\n\n\n\n\n\n\"What the government has done is stop the boats.\"\n\n\n\n\n\nDr Sheppard says the party would be proud of its economic achievements.\n\n\n\n\n\n\"Liberalization of the economy, you know, the ability for anyone in the middle class or working class to move up in society, to own their own business, to go to university if they wish, to live the kind of life that they choose that isn't tied to their occupation or to what their parents did. They would say that is their core achievement over the last 30 years.\"\n\n\n\n\n\nSome of the parties best known leaders include Harold Holt, who famously went missing in the ocean.\n\n\n\n\n\n\"Here is a news flash from the Herald Sun newsroom. An intense land, air, and sea search is continuing near Portsea's back beach for Prime Minister, Mr Holt.\"\n\n\n\n\n\n...And John Howard, the second longest serving Prime Minister of Australia.\n\n\n\n\n\nThe party was last in government in 2022 - and Scott Morrison was the last Liberal Party Prime Minister of Australia.\n\n\n\n\n\nPeter Dutton is current leader, and will be the Prime Minister if the coalition wins the next election.\n\n\n\n\n\nHe's been a politician for 25 years, and before then was a police officer.\n\n\n\n\n\nThe Liberal Party teams up with the Nationals in a coalition to form government.\n\n\n\n\n\nMr Brandis describes it as...\n\n\n\n\n\n\"A functional relationship. It's a necessary relationship. The National Party, though, is a very different beast from the Liberal Party.\"\n\n\n\n\n\nThis election the Liberal Party's slogan is 'get Australia back on track', with policies including.\n\n\n\n\n\n- Building Australia's first nuclear reactor\n\n\n\n\n\n- Being tough on crime\n\n\n\n\n\n- Reducing wasteful spending, including cutting public service jobs.\n\n\n\n\n\n- And reducing migration.\n\n\n\n\n\nSo how does the party stack up to its original manifesto?\n\n\n\n\n\nPretty well, says Dr Sheppard.\n\n\n\n\n\n\"Weirdly, I think the Liberal Party is probably closer to its original party than the Labor Party is, even though they've never had a strong sense of purpose, necessarily, apart from opposing Labor, there's always been tension between conservatives and liberals inside the Liberal Party. That was the case in 1944 when the party was founded and its the case today.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/anandikaa-is-striving-for-a-stem-career-a-new-100-million-project-aims-to-help-others-like-her/nxty4izqc",
        "title": "Anandikaa is striving for a STEM career. A new $100 million project aims to help others like her",
        "publish_date": "Fri, 11 Apr 2025 21:00:00 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAnandikaa Ramesh is a migrant from Sri Lanka, who is studying twin degrees at the University of Sydney. As a woman, her choice of software engineering and commerce is unusual.\n\n\n\n\n\n“In my programming tutorials in class, usually women are the minority. So, in around 20 people, only four would be women like girls.”\n\n\n\n\n\nIt’s something Anandikaa is used to. For her final school exams, she was among a small group of girls studying higher level maths at Penrith Selective High School in Sydney’s west.\n\n\n\n\n\n“I was really passionate and good at maths essentially, and I really liked problem solving and I just found that I was a logical thinker. In terms of software engineering, I found that it was very logical and algorithm based, which I really enjoyed particularly. And I just had a passion for commerce, so I thought it was best to combine both of them”.\n\n\n\n\n\nAnd that places Anandikaa among just 37 per cent of women enrolled in university STEM courses nationwide. She hopes to inspire others.\n\n\n\n\n\n“I'd really love to be a role model for all those women and just people in minority backgrounds and immigrant backgrounds, which is predominantly where I'm from, Western Sydney.”\n\n\n\n\n\nIt’s a view shared by Sydney University’s Associate Vice President Shane Griffin, who’s spent almost two years developing a new school-to-university STEM pipeline, targeting young women.\n\n\n\n\n\n“There's no other program that's supporting students through their high school years, both in outreach and financially and then into university as well. So, it is a long-term project to make a substantial difference to a serious number of people. We're looking at putting out an additional sort of 300 plus graduates out into the workforce. We're just getting started, but it's a really exciting project for us .”\n\n\n\n\n\nIt’s all thanks to a $100-million dollar donation from tech founder Robin Khuda, who recently sold his data centre business, as Shane Griffin explains:\n\n\n\n\n\n“Robin is an international student himself from Bangladesh. Robin has seen a lack of diversity in his company and found it difficult to find female engineers and scientists.Employers everywhere have said for a long time there aren't enough women completing STEM degrees. So, to be able to support that and to widen that pool is really fantastic”\n\n\n\n\n\nShane Griffin says the donation is one of the most significant targeting women in STEM worldwide.\n\n\n\n\n\n“This is the largest donation the university's ever received and as far as we are aware, the largest donation supporting women in STEM and focused on students and local students and their outcomes. So, the university's incredibly grateful.”\n\n\n\n\n\nThe multi-decade project is due to begin outreach from July this year, eventually reaching 40,000 high school students.\n\n\n\n\n\nThe first pilot scholars are expected to enrol at Sydney University in 2027.\n\n\n\n\n\nIt’s a move welcomed by Sally-Ann Williams, CEO of Cicada innovations and chair of the federal government’s recent Pathway to Diversity in STEM review.\n\n\n\n\n\n“I absolutely commend Robin Khuda and the University of Sydney for taking a very intentional approach to thinking about how they are going to work on changing the ratio of the number of women in engineering and computing and in STEM degrees. And it's very pleasing because that was one of the key recommendations in our review.”\n\n\n\n\n\nHowever, Sally-Ann Williams says more work is needed to boost diversity across government and private sectors.\n\n\n\n\n\n“There's still a really large gap in some of the STEM fields in Australia for participation of women and other underrepresented people, and that is primarily in the areas of engineering and largely in computing as well. It's actually critical that we're more diverse in the STEM sector - diversity of thought and lived experience, which includes backgrounds such as gender and socioeconomics, regional versus rural versus city. Research shows that diverse teams do create better outcomes and higher success metrics for companies and for government by the way, in policy. And it's because all points of view are considered.”\n\n\n\n\n\nFor Anandikaa Ramesh, who expects to finish her engineering and commerce degrees in 2028, the goal is a career in financial technology. She hopes more women will soon join her.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/creative/belonging-nowhere-interactive-what-its-like-to-be-stateless/hz4wi63de",
        "title": "'Marginalised, neglected, ignored': What it's like when your country doesn't want you",
        "publish_date": "Fri, 11 Apr 2025 20:41:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/what-passover-looks-like-across-jewish-communities/42i32tq39",
        "title": "'Not one way to be Jewish': What Passover looks like across Jewish communities",
        "publish_date": "Fri, 11 Apr 2025 20:37:20 +0000",
        "category": "finance",
        "authors": [],
        "text": "Each year, Jewish families around the world gather to mark Passover — an eight-day festival that commemorates the liberation of the Jewish people from slavery in ancient Egypt.\n\n\n\n\n\nBut while the themes of Pesach (the Hebrew word for Passover) are shared, the way the festival is celebrated can vary widely, depending on where a Jewish family comes from.\n\n\n\n\n\nElana Benjamin is a Jewish Australian writer of Indian-Iraqi heritage. She's also a co-founder of Sephardi Mizrahi Voices Australia, an organisation seeking to raise awareness of the traditions, culture and history of Jews from Southeast Asia, the Middle East, North Africa and Iran.\n\n\n\n\n\nShe says that growing up, she rarely saw her Sephardi Mizrahi Jewish culture reflected back at her — but Passover gives her an opportunity to reconnect with her identity and family.\n\n\n\nWhat is Passover?\n\nPassover is a major Jewish holiday that celebrates the biblical story of the Israelites' escape from slavery in Egypt.\n\n\n\n\n\nThis year, it starts on the evening of Saturday 12 April and ends on Sunday 20 April.\n\n\n\n\n\nThe festival commemorates the birth of the Jewish nation.\n\n\n\n\n\nThe holiday involves a series of rituals, with each one representing a different part of the exodus story.\n\n\n\nWhat is the Seder?\n\nCentral to Passover is the Seder, a ceremonial meal held on the first night (or the first two nights in the diaspora), where families gather to retell the exodus story through symbolic food, prayers and songs.\n\n\n\n\n\nAlthough the composition of the meal varies in each region, the Seder is comprised of three core elements: unleavened bread, bitter herbs like horseradish, celery, and cos lettuce, and a bone.\n\n\n\nThe Seder plate is steep in symbolic foods representing the story of Jewish exodus from Egypt. Source: Getty / Portland Press Herald The bread recalls the haste with which the Israelites had to flee, meaning they could not leaven their bread (make it rise); the herbs symbolise the harshness of slavery; and the bone represents sacrifice.\n\n\n\n\n\nA hard-boiled egg tends to feature, representing sacrifice and embodying hope and consolation.\n\n\n\n\n\nSalty water pays homage to the slaves' tears, and a fruit paste symbolises the mortar with which the Jewish people made bricks.\n\n\n\nWhat else happens during Passover?\n\nFor the duration of Passover, some Jewish people avoid eating or owning chametz — any food made from fermented grains like wheat, barley, rye, oats or spelt. This includes everyday staples such as bread, pasta, beer and most cakes.\n\n\n\n\n\nIn preparation, these households undergo intensive cleaning to remove any trace of chametz, a tradition rooted in the biblical story where the Israelites left Egypt in such haste they didn’t have time to let their bread rise.\n\n\n\n\n\nTo keep kosher for Passover, some families use a separate set of kitchen utensils, or they may kasher their regular ones using boiling water or fire to make them suitable for the holiday.\n\n\n\n\n\nKosher describes any food that adheres to a strict set of dietary rules in Judaism, while kasher means to make something kosher for use.\n\n\n\n\n\nMany people attend synagogue services throughout the week, and families often take the opportunity to spend time together, sharing meals or taking children on outings. Community organisations also step in, distributing food packages to support those in need.\n\n\n\nElana Benjamin is a Jewish-Australian writer of Indian-Iraqi heritage. Passover gives her the opportunity to celebrate her Sepahrdi-Mizrahi Jewish identity. Source: Supplied\n\n'Not one way to be Jewish'\n\nBenjamin grew up in an Australia, where Jewish identity was often \"Ashkenormative\".\n\n\n\n\n\n\"Back then, diversity wasn’t a word that was used,\" she says. \"The whole community was very focused on the Ashkenazi story.\"\n\n\n\n\n\nAshkenazi Jews are those with roots in Central and Eastern Europe, with many being the descendants of Holocaust survivors. The Jewish community in Australia is mostly comprised of Ashkenazi Jews.\n\n\n\n\n\nBut Benjamin's Indian and Iraqi background means that she is part of two distinct Jewish diasporas — Sephardi (with roots in Spain and Portugal) and Mizrahi (with roots in the Middle East and North Africa) — and her Seder table reflects that.\n\n\n\n\n\n\"For so many years, I didn’t see the Sephardi Mizrahi foods of my community reflected back to me,\" she explained.\n\n\n\nThere are so many different ways to be Jewish and there's so much beauty in the different traditions. Elana Benjamin\n\nWhile Ashkenazi Jews make the sweet side dish charoset from grated apple, nuts and wine, Benjamin's family uses halek, a thick syrup made of dates.\n\n\n\n\n\n\"My dad used to soak the dates, squeeze them through muslin cloth, then boil it up so it would thicken. It was really labour intensive,\" she says.\n\n\n\n\n\nSome of her recipes blend Indian and Jewish influences, like a Passover bread pudding made of matzo meal, a substitute for flour or breadcrumbs made with unleavened bread.\n\n\n\n\n\nWhile Ashkenazi Jews might use horseradish on the Seder plate, Benjamin’s family uses cos lettuce, like many Iraqi Jews. Instead of dipping parsley into salt water, they dip celery leaves into lemon juice.\n\n\n\n\n\nAnd unlike Ashkenazi Jews, Sephardi Jews can eat rice during Passover.\n\n\n\n\n\n\"Every Jewish person I have ever met is like, 'Oh, you’re Sephardi? You can eat rice on Pesach? You’re so lucky!',\" she said.\n\n\n\n\n\nBenjamin says food is just one part of the rich cultural variation that exists within global Jewish communities. \"There’s not one way to be Jewish,\" she said.\n\n\n\n\n\n\"There are so many different ways to be Jewish and there's so much beauty in the different traditions.\"\n\n\n\n\n\nShe also encourages people to adopt different Jewish traditions.\n\n\n\n\n\n\"Persian Jews, for example, during Deyenu [a traditional song sung during Passover], they hit each other with shallots or leeks to replicate the whipping of the Jews of the slaves by the Egyptians.\"\n\n\n\n\n\n\"There's no reason that if you're not a Persian Jew that you couldn't do that in your Seder. They're really fun, beautiful traditions.\"\n\n\n\nNot just tradition\n\nWhile Passover holds deep religious meaning, for Benjamin, it’s the sense of family and continuity that keeps her coming back to the table.\n\n\n\n\n\n\"It’s probably my least favourite of the chagim [holiday],\" she admits. \"I loved it as a child, but as an adult, it is just so much work — so much cleaning and cooking.\"\n\n\n\n\n\nBut the joy of gathering with family and honouring the past outweighs the stress.\n\n\n\n\n\n\"But at the same time, I think it's important to keep that alive and to feel that sense of connection to Jewish history and tradition and past generations — that's why I do it,\" she said.\n\n\n\n\n\n\"I think that sense of connection and belonging and family is really what I love about it, rather than the technical religious aspects of it.\n\n\n\n\n\n\"There's something really special about coming together with family and telling the story and signing the Iraqi tunes.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/china-hits-back-at-us-with-125-per-cent-tariffs-says-it-will-ignore-further-hikes/r7j83i4jz",
        "title": "China hits back at US with 125 per cent tariffs, says it will 'ignore' further hikes",
        "publish_date": "Fri, 11 Apr 2025 10:39:21 +0000",
        "category": "finance",
        "authors": [],
        "text": "Beijing on Friday increased its tariffs on US imports to 125 per cent, hitting back against US President Donald Trump's decision to hike duties on Chinese goods to 145 per cent and raising the stakes in a trade war that threatens to upend global supply chains.\n\n\n\n\n\nMeanwhile, the turmoil unleashed by Trump's tariffs showed few signs of easing, with markets tumbling and foreign leaders puzzling how to respond to the biggest disruption to the world trade order in decades.\n\n\n\n\n\nA brief reprieve for battered stocks seen after Trump decided to pause duties for dozens of countries for 90 days quickly dissipated, as attention returned to his escalating trade war with China that has fuelled global recession fears.\n\n\n\n\n\nGlobal stocks fell, the dollar slid and a sell-off in US government bonds picked up pace on Friday, reigniting fears of fragility in the world's biggest bond market. Gold, a safe haven for investors in times of crisis, scaled a record high.\n\n\n\n\n\n\"Recession risk is much, much higher now than it was a couple weeks ago,\" said Adam Hetts, global head of multi-asset at investment company Janus Henderson.\n\n\n\nREAD MORE How Australia could benefit from a US-China trade war\n\nUS treasury secretary Scott Bessent tried to assuage sceptics by telling a cabinet meeting that more than 75 countries wanted to start trade negotiations. Trump himself expressed hope of a deal with China, the world's No.2 economy by nominal GDP, but the world's No.1 in terms of purchasing power parity.\n\n\n\n\n\nBut the uncertainty in the meantime extended some of the most volatile trading since the early days of the COVID-19 pandemic .\n\n\n\n\n\nAsian indices mostly followed Wall Street lower on Friday. In Europe, China's latest tariff hike sent stocks lower, leaving the STOXX 600 index down more than 1 per cent on the day and set for another drop this week, one of its most volatile on record.\n\n\n\n\n\nBessent shrugged off the renewed market turmoil on Thursday and said striking deals with other countries would bring certainty.\n\n\n\nThe US and Vietnam have agreed to begin formal trade talks, the White House said. The Southeast Asian manufacturing hub is prepared to crack down on Chinese goods being shipped to the United States via its territory in the hope of avoiding tariffs, Reuters news agency reported.\n\n\n\n\n\nJapanese Prime Minister Shigeru Ishiba, meanwhile, has set up a trade task force that hopes to visit Washington next week.\n\n\n\nCould there be a 'China deal'?\n\nAs Trump suddenly paused his \"reciprocal\" tariffs on other countries hours after they came into effect earlier this week, he ratcheted up duties on Chinese imports as punishment for Beijing's initial move to retaliate.\n\n\n\n\n\nHe has now imposed new tariffs on Chinese goods of 145 per cent since taking office, a White House official said.\n\n\n\n\n\nChina hit back with new tariffs on Friday.\n\n\n\n\n\n\"The US imposition of abnormally high tariffs on China seriously violates international and economic trade rules, basic economic laws and common sense and is completely unilateral bullying and coercion,\" China's finance ministry said in a statement.\n\n\n\n\n\nBeijing also dismissed Trump's mounting brinkmanship as a \"joke\" and a \"numbers game\".\n\n\n\n\n\n\"The United States' imposition of round upon round of abnormally high tariffs on China has become a numbers game with no practical significance in economics,\" the ministry said.\n\n\n\n\n\n\"If the US continues to play the tariff numbers game, China will ignore it,\" a spokesperson said.\n\n\n\nREAD MORE How can trillions just disappear? What you may not know about the stock market\n\nTrump told reporters at the White House on Thursday that he thought the United States could make a deal with China and said he respected Chinese President Xi Jinping.\n\n\n\n\n\n\"In a true sense he's been a friend of mine for a long period of time, and I think that we'll end up working out something that's very good for both countries,\" he said.\n\n\n\n\n\nXi, in his first public remarks on Trump's tariffs, told Spanish Prime Minister Pedro Sanchez during a meeting in Beijing on Friday that China and the European Union should \"jointly oppose unilateral acts of bullying,\" China's state news agency Xinhua reported.\n\n\n\n\n\n\"There are no winners in a trade war,\" the Chinese leader told his guest, adding that by acting together, the world's second-largest economy and the 27-strong European trade bloc could help uphold \"the global rules-based order\".\n\n\n\nEuropean authorities estimate the impact of the US tariffs on the region's economy would total 0.5 per cent to 1.0 per cent of GDP. Given the EU economy as a whole is forecast to grow 0.9 per cent this year, according to the European Central Bank, the US tariffs could tip the EU into recession.\n\n\n\n\n\nTrump's decision for a 90-day suspension on tariffs gave room for only a \"fragile pause\", French President Emmanuel Macron said, partly because tariffs on steel, aluminium and cars remained, as well as across-the-board 10 per cent duties.\n\n\n\n\n\nFragile, also, \"because this 90-day pause means 90 days of uncertainty for all our businesses, on both sides of the Atlantic and beyond,\" Macron said on X.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/decoding-the-tariff-war-trump-xi-and-the-global-fallout/ygvrb2gwb",
        "title": "Decoding the tariff war: Trump, Xi and the global fallout",
        "publish_date": "Fri, 11 Apr 2025 09:55:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/jewish-people-in-australia-and-across-the-globe-prepare-for-passover-celebrations/bylfwjiq8",
        "title": "Jewish people in Australia and across the globe prepare for Passover celebrations",
        "publish_date": "Fri, 11 Apr 2025 09:40:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/london-museum-repatriates-remains-of-36-indigenous-ancestors-to-their-communities/mxmyf23e0",
        "title": "London museum repatriates remains of 36 Indigenous ancestors to their communities",
        "publish_date": "Fri, 11 Apr 2025 09:32:26 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "London museum repatriates remains of 36 Indigenous ancestors to their communities\n\nPublished 11 April 2025, 7:08 am\n\nThe remains of 36 Indigenous ancestors, held at London’s Natural History Museum, have been handed back to their communities. While repatriations are happening frequently, there are calls from Aboriginal leaders for the British government to provide more assistance so more remains can be brought back to country.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/woman-gives-birth-to-another-couples-baby-in-ivf-mix-up/fxnf7fxtp",
        "title": "Woman gives birth to another couple's baby in IVF mix-up",
        "publish_date": "Fri, 11 Apr 2025 09:14:34 +0000",
        "category": "finance",
        "authors": [],
        "text": "Woman gives birth to another couple's baby in IVF mix-up\n\nPublished 11 April 2025, 7:08 am\n\nAustralian fertility company Monash IVF is at the centre of a shocking incident, issuing an apology after confirming a woman gave birth to a baby that isn't hers. The wrong embryo was transferred at a Monash IVF clinic in Queensland; the company saying it was due to \"human error\". SBS reporter Tanya Dendrinos is following the story.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/aukus-future-in-doubt-as-elon-musk-takes-over-us-shipbuilding/krws3387i",
        "title": "AUKUS future in doubt as Elon Musk takes over US shipbuilding",
        "publish_date": "Fri, 11 Apr 2025 09:04:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "AUKUS future in doubt as Elon Musk takes over US shipbuilding\n\nPublished 11 April 2025, 6:59 am\n\nElon Musk has now been tasked with running the ruler over United States shipbuilding in a move that's raised concerns about the future of the AUKUS submarine deal. Peter Dutton has revealed former US President Joe Biden was initially unconvinced about the agreement to share the classified technology, as he jostles with Anthony Albanese over which leader has the credentials to work with Donald Trump.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/gold-returns-to-a-record-as-investors-digest-tariff-outlook/prsq255u4",
        "title": "Gold returns to a record as investors digest tariff outlook",
        "publish_date": "Fri, 11 Apr 2025 08:38:36 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/very-rare-ivf-mixup-expected-to-lead-to-renewed-policies-regulation/2bsylbe5e",
        "title": "\"Very rare\" IVF mix up expected to lead to renewed policies, regulation",
        "publish_date": "Fri, 11 Apr 2025 08:37:01 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIt is a scenario that seems taken from a nightmare; a woman, giving birth to a child that isn't her own.\n\n\n\n\n\nFertility clinic Monash IVF confirms a patient at their clinic received an embryo that didn't belong to her, resulting in the birth of a child.\n\n\n\n\n\nIt says it became aware of the incident in February this year, when the child's birth parents requested to transfer their remaining embryos to another IVF provider.\n\n\n\n\n\nAs the clinic counted the number of embryos, it found an additional one that belonged to the birth parents.\n\n\n\n\n\nAn investigation then found a human error was made when transferring the embryo, despite what the clinic claimed were \"strict laboratory safety protocols\".\n\n\n\n\n\nIn a statement, Monash IVF Chief Executive Michael Knaap apologises for the incident.\n\n\n\n\n\n“On behalf of Monash I-V-F, I want to say how truly sorry I am for what has happened. All of us at Monash I-V-F are devastated and we apologise to everyone involved. We will continue to support the patients through this extremely distressing time. Since becoming aware of this incident, we have undertaken additional audits and we're confident that this is an isolated incident. We are reinforcing all our safeguards across our clinics – we also commissioned an independent investigation and are committed to implementing its recommendations in full.”\n\n\n\n\n\nMonash IVF says it has commissioned an independent investigation by Fiona McLeod, a senior counsel at the Independent Bar in Australia.\n\n\n\n\n\nAccording to its annual report, Monash IVF's total revenue for the 2024 Financial Year was $255 million.\n\n\n\n\n\nThe Fertility Society of Australia and New Zealand, which is responsible for the national standards in assisted reproductive technology, says it is aware of the incident.\n\n\n\n\n\nIn a statement, its spokesperson says while incidents of this nature are rare, it expects a thorough response from Monash IVF.\n\n\n\n\n\n\"Incidents like this require the highest standards of transparency – while protecting patient privacy – along with rigorous investigation, and a sector-wide commitment to learning and improvement. The trust patients place in our profession is sacred, and we must continually earn it through clear governance, shared responsibility, and action. We ask that the privacy of the families involved is respected during this time, as they work through what is undoubtedly a complex and personal situation.\"\n\n\n\n\n\nAccording to the Fertility Society of Australia and New Zealand, in 2021, over 18,500 Australian babies were born in the Assisted Reproductive Technology Units.\n\n\n\n\n\nDr Ying Li is a Sydney-based fertility specialist at Genea Sydney.\n\n\n\n\n\nHe says an incident of this kind is very rare, and he has not seen any similar cases in the past decade.\n\n\n\n\n\n\"The reality is, when embryos are created and used there are multiple checks in place. So when the embryos were initially created, there are checks, when the embryos are labelled and stored, there are checks, and then there are further checks when the embryos come to use. The organisations are mandated to audit their own identification process each year, and then each organisation and clinic is subject to an external audit every year for accreditation to practice IVF in Australia.”\n\n\n\n\n\nDr Li says besides the economic and psychological harm to both families, the incident may also lead to a complicated legal battle when it comes to parenting and custody arrangements.\n\n\n\n\n\n\"Under Australian law, genetics really doesn't determine parentage, it's the birth mother and the birth parents to determine parentage, so whoever give birth to the child is the legal mother or father of that child. And that creates a whole lot of ethical, social disturbance that end up evils for families involved and for children involved.\"\n\n\n\n\n\nCurrently, IVF services are regulated by individual states and territories, but the sector is still subjected to federal laws and national ethical guidelines.\n\n\n\n\n\nIn Queensland, the sector adopted self-regulation for a long time.\n\n\n\n\n\nLast year, the Queensland government launched an investigation into the state's licenced assisted reproductive technology providers.\n\n\n\n\n\nIt identified what it called \"significant systemic issues\" relating to the services.\n\n\n\n\n\nFollowing the report, Queensland parliament proposed and passed the state's first law on assisted reproductive technology.\n\n\n\n\n\nIt also established the donor conception information register, which will hold details about the donor conception procedures in the state in which a live birth occurs.\n\n\n\n\n\nProfessor Ian Freckelton is the co-director of Studies, Health and Medical Law at the University of Melbourne.\n\n\n\n\n\nHe says there is no legal precedent in Australia for this kind of case.\n\n\n\n\n\n\"There has been litigation to do with the destruction of gametes, and there was by facilities that has some. But nothing comparable to this. What's taken place is clearly a breach of duty of care, or put it another way, negligence, and so should an action be brought by either set of parents, that will forge new ground.\"\n\n\n\n\n\nProfessor Freckelton says it could be useful to have a federal law to oversee the sector, rather than leaving it to the states and territories.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/the-coalition-says-some-australians-dont-want-evs-it-will-make-utes-cheaper/dbksjb5pv",
        "title": "The Coalition says some Australians don't want EVs. It will make utes cheaper",
        "publish_date": "Fri, 11 Apr 2025 07:14:22 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Coalition will back Australian families who \"don't want or cannot afford\" an electric vehicle (EV), vowing to scrap penalties for vehicle manufacturers in their latest cost of living pitch to voters.\n\n\n\n\n\nIt says the New Vehicle Efficiency Standard (NVES) for manufacturers, set to come into effect on 1 July, will drive up the price of a Toyota RAV4 by $9,700, and the cost of a Ford Ranger ute by $14,400.\n\n\n\n\n\nOpposition leader Peter Dutton said if elected, the Coalition would repeal penalties due to apply to vehicle manufacturers that don't meet the standards, and will pursue vehicle emissions in a \"responsible\" way.\n\n\n\n\n\n\"We want vehicle emissions standards to be responsible. Of course, we want cleaner fuel. But I want Australians to be able to afford to live,\" Dutton said in Perth on Friday afternoon.\n\n\n\n\n\n\"That's why we're not going to allow Labor's ute-and-car tax. We're going to repeal it.\"\n\n\n\nOpposition leader Peter Dutton has spruiked both his fuel excise cut and a change to fuel efficiency standards at a car dealership in Kalamunda, Perth. Source: AAP / Mick Tsikas It builds on the Coalition's promise to save families hundreds by temporarily cutting the fuel excise from about 50 cents to 25 cents per litre.\n\n\n\n\n\nPrime Minister Anthony Albanese labelled the Coalition's policy \"nonsensical\", arguing it removes incentives for fuel-efficient cars.\n\n\n\n\n\n\"I find it extraordinary that Peter Dutton, who says he cares about the price of fuel, doesn't want people to have more fuel-efficient cars, which reduce the costs of filling up their car,\" Albanese told reporters in Darwin.\n\n\n\n\n\nSo, what is NVES, and how will it affect the price of vehicles?\n\n\n\nWhat is the New Vehicle Efficiency Standard?\n\nNVES was legislated by the government in 2024 and comes into effect on 1 July.\n\n\n\n\n\nNVES sets a carbon emission target for a manufacturer's fleet and penalises vehicles polluting over that threshold, which encourages them to ship lower polluting vehicles, including hybrid and electric cars, to Australia.\n\n\n\nREAD MORE Coalition vows to abolish penalties on cars that don't meet fuel efficiency standards\n\nThe emissions targets become more stringent over the coming years while the industry adjusts, with eventual fines of $100 for every gram over the target to be paid from 2028.\n\n\n\n\n\nTony Wood, Energy and Climate Change program director at the Grattan Institute, told SBS News the scheme is designed to \"encourage more efficient new vehicles\" that use less petrol and produce fewer emissions.\n\n\n\n\n\nHe said the scheme is expected to drive better efficiency standards across petrol and diesel vehicles, as well as encourage more EVs into the market.\n\n\n\n\n\n\"What we're actually seeing is cleaner, more efficient and increasingly affordable cars,\" he said.\n\n\n\n\n\n\"Now, of course, that means that if you want to buy a vehicle that is neither of those — not clean or as efficient — then you will progressively be paying more.\"\n\n\n\n\n\nTransport makes up 21 per cent of Australia's emissions, according to the Department of Climate Change, Energy, the Environment and Water. Two-thirds of these are due to passenger and light vehicles.\n\n\n\n\n\nWood questioned how the Coalition intended to achieve its net-zero emissions by 2050 target without imposing some penalties on the vehicle industry.\n\n\n\nHow does Australia compare to the rest of the world?\n\nWhen the Albanese government unveiled its policy last year, it argued that Australia had become a dumping ground for less efficient petrol vehicles, ultimately costing voters more at the bowser.\n\n\n\n\n\nGovernment analysis suggested manufacturers would import more efficient vehicles, which are already available in markets like the European Union, saving Australians an average of $1,000 a year.\n\n\n\nThe Electric Vehicle Council says the industry is changing, with more EVs and even a hybrid-ute now available to consumers at a cheaper price. Source: Getty / Ralf Hahn The availability of lower polluting vehicles was also highlighted by the former Coalition government.\n\n\n\n\n\n\"The US, UK and EU, they all have fuel efficiency standards for their vehicles,\" the Coalition's former environment minister Josh Frydenberg, who pursued vehicle efficiency standards, said in 2017.\n\n\n\n\n\n\"In fact, 80 per cent of the world's light passenger vehicle fleet has these standards.\"\n\n\n\nWill this drive up the price of your ute or EV?\n\nTony Weber, chief executive of the Federal Chamber of Automotive Industries, said it supported a more \"achievable\" fuel efficiency standard.\n\n\n\n\n\nThe peak body argues the targets are \"too stringent\" and require \"a very high proportion of EV sales\", which does not reflect current consumer sentiments and preferences for vehicles such as utes.\n\n\n\n\n\nHe said the government needed to pursue \"a sensible approach that delivers vehicles that consumers want, and in the timeframe that makes a meaningful difference to the CO2 outcome\".\n\n\n\nAman Gaur, head of legal policy and advocacy at EVC, said many people thought utes could never be electric, but \"we're seeing a really viable and cost-competitive option\". Source: Supplied / BYD Some makers have already flagged they would either pass the financial cost of fines down to consumers, or remove popular models from sale to minimise penalties.\n\n\n\n\n\nHowever, the Electric Vehicle Council (EVC) said the policy is already working, pointing to an increase in the number of EVs available to consumers, with over 30 types now offered.\n\n\n\n\n\nAman Gaur, head of legal policy and advocacy at EVC, said this had driven down the cost of EVs, with models now available at a cost below $40,000.\n\n\n\n\n\nIt has also led to the introduction of Australia's first plug-in hybrid ute: The BYD Shark 6.\n\n\n\n\n\nGaur said many people thought utes could never be electric, but \"we're seeing a really viable and cost-competitive option\".\n\n\n\n\n\n\"The average Australian benefits because they get access to more competition,\" he told SBS News. \"Prices go down, but then they [also] save money on their day-to-day running costs.\"\n\n\n\nREAD MORE How new fuel rules could save Australian drivers thousands of dollars\n\nGaur compared the benefits to an energy-efficient washing machine, which uses less electricity and drives down power bills. He said similarly, vehicle emission standards would reduce the amount of petrol used and offer cost of living relief for households.\n\n\n\n\n\n\"If manufacturers don't need to bring in more fuel-efficient petrol hybrid and electric cars, they can continue to bring in their most inefficient cars.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/opposition-leader-peter-dutton-commends-the-afp-for-keeping-his-family-safe/8mz1a1igo",
        "title": "Opposition leader Peter Dutton commends the AFP for keeping his family safe | Evening Bulletin 11 April 2025",
        "publish_date": "Fri, 11 Apr 2025 06:59:07 +0000",
        "category": "finance",
        "authors": [],
        "text": "\n\n\n\n\n\n\n\nListen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nAustralian shares continue to slide after the White House confirms raising tariffs on China...\n\n\n\n\n\nOpposition leader Peter Dutton commends the AFP for keeping his family safe...\n\n\n\n\n\nAustralian sprint star Gout Gout says achieving ten seconds twice in one night is a boost to his confidence.\n\n\n\n\n\nAustralian shares have resumed their downward slide after the White House confirmed raising tariffs on China to 145 per cent, fuelling global recession fears.\n\n\n\n\n\nIn early trading the S & P or ASX 200 was down 172-point-two points, to 7,537-point-four.\n\n\n\n\n\nThe slip comes after a broad-based sell-off on Wall Street overnight.\n\n\n\n\n\nMarket analyst Michael McCarthy says its trade barrier against China which now sits at 145 per cent was the catalyst for the latest slump.\n\n\n\n\n\nThis - despite many of the U-S administration's newly imposed tariffs have been paused.\n\n\n\n\n\nMeanwhile, Australia has been warned U-S tariffs could place the AUKUS nuclear submarine deal under threat.\n\n\n\n\n\nIt comes as concerns regarding the viability of Australia's submarine deal with the United States and the UK have been raised following US President Donald Trump's global tariff announcements.\n\n\n\n\n\nJohn Blaxland is from the Australian National University Strategic and Defence Studies Centre.\n\n\n\n\n\nSpeaking to SBS World News he says its fraught with danger to make projections on the basis of two and a half months of US Presidency.\n\n\n\n\n\n\"To talk about making a dramatic shift in our foreign and defence policy on the basis of the early weeks of a tumultuous period in any presidency. This one happens to be particularly tumultuous is, in my view, to call, you know, called Chicken Little. The sky isn't falling. Yes, it's stormy. Yes, there's a lot of moving parts. The dust has not settled. It will settle, and there are enduring American interests in making AUKUS work.\"\n\n\n\n\n\nMr Blaxland says if it is true, this would suggest that the negotiations predated the previous U-S government's administration under Joe Biden.\n\n\n\n\n\nOpposition leader Peter Dutton has spoken about reports in The Australian newspaper of an alleged terror plot in 2024.\n\n\n\n\n\nLast year, a 16-year old Brisbane student was arrested and charged in August, after a joint counter-terrorism investigation by the Federal and Queensland police.\n\n\n\n\n\nMr Dutton - who was allegedly a target of the teenager addressed the matter today - commending the Australian Federal Police for keeping his family safe.\n\n\n\n\n\n\"I'm incredibly grateful to the AFP that my family are kept safe. I've never felt unsafe one day in this job particularly with the protection from the AFP and it hasn't stopped me from doing anything..this campaign, I take the advise of the federal police but ultimately, I think this job is about a test of character - until you have the strength of character regardless of what's thrown at you to deal with the issues and to act in our country's best interest.\"\n\n\n\n\n\nEarlier today Prime Minister Anthony Albanese also confirmed he reached out to the Opposition leader over the terror plot incident.\n\n\n\n\n\nMr Albanese says there is no place whatsoever in politics for such threats.\n\n\n\n\n\n\"It is a fact that the number of threats that the number of threats that have been made to parliamentarians has increased in recent times and that has been recorded on by the appropriate authorities.\"\n\n\n\n\n\nAustralian sprint star Gout Gout says achieving ten seconds twice in one night is definitely a boost to his confidence level.\n\n\n\n\n\nGout lit up the Australian Athletics Championships in Perth with a wind-assisted run of 9.99 seconds in the 100 metre sprint - twice in one night.\n\n\n\n\n\n\"This is what I feel like Australia needs you know, this is what we wake up in the morning for, this is what we train for - and I couldn't ask for anything better. And just the great crowds and everyone getting around is definitely great so hopefully we can get a lot more people.\"\n\n\n\n\n\nUnfortunately for Gout, who is competing in the Under-20's men's category, the tailwind was two-point-six metres per second [[2.6m/s]], which means his run didn't count as an official time.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/can-australias-aukus-subs-deal-withstand-rising-costs-and-trump/20orrci06",
        "title": "Australia’s AUKUS subs deal could get pricier. But will it even survive the Trump era?",
        "publish_date": "Fri, 11 Apr 2025 05:20:52 +0000",
        "category": "finance",
        "authors": [],
        "text": "Australia's AUKUS deal — estimated to cost between $268 billion and $368 billion — is facing pressure as a United States senator says the country is \"having trouble getting these ships and subs on time, on budget\".\n\n\n\n\n\nThe US and the United Kingdom have both launched reviews into the multi-billion-dollar submarine dea l amid production concerns and steel tariffs.\n\n\n\n\n\nUnder AUKUS, Australia is set to acquire three nuclear-powered Virginia-class submarines from the US in the early 2030s, before a new fleet of boats is built for delivery from the 2040s.\n\n\n\n\n\nThe deal lasts until 2075, and countries can cancel the contract with one year's notice.\n\n\n\nSteel tariffs could create problems\n\nUS senator Tim Kaine, the most senior Democrat on a Senate subcommittee on seapower, reportedly told an AUKUS dinner on Wednesday night (local time) submarine construction is facing time and budget setbacks.\n\n\n\n\n\nHe said about a third of the steel and aluminium that went into ships and submarines came from the Canada and the United Kingdom, which like Australia, now face tariffs on their exports to the US .\n\n\n\n\n\n\"Increase those prices and there’s going to be a problem. So the first concern that I have about the tariff regime is it’s a national sales tax that is really going to blitz us,\" Kaine said at the dinner in Washington, which was hosted by former Australian defence minister–turned–lobbyist Christopher Pyne, according to Nine Newspapers.\n\n\n\nREAD MORE What to know about tariffs and how they work\n\nDavid Andrews, senior manager for policy and engagement at the Australian National University's National Security College, said AUKUS would likely become costlier, but it would be hard for the federal government to do much about it.\n\n\n\n\n\n\"There is no Plan B for AUKUS there, isn’t a ready-made replacement or off-the-shelf option,\" he told SBS News.\n\n\n\n\n\n\"A lot of these external factors, like tariffs, are not within the control of the Australian government to shape.\"\n\n\n\nWill it increase costs?\n\nAndrews said the minimum budgeted cost of $268 billion for the deal would likely rise, but that defence projects have built-in contingencies.\n\n\n\n\n\n\"An increase of steel tariffs would be a huge concern for any project. But there are measures and contingencies in place to allow for that,\" he said.\n\n\n\n\n\n\"In this case there is 50 per cent contingency built into the estimated costs, to cover changes in material costs or delays.\"\n\n\n\n\n\nWhile the minimum spend could increase, Andrews said the maximum quote of $368 billion could remain the same.\n\n\n\nHe said defence projects typically have a contingency of at least 10 per cent included in budgeting.\n\n\n\n\n\nAndrews said steel tariffs shouldn’t impact the cost of the three Virginia-class submarines the US will send to Australia next decade, as they are already built.\n\n\n\n\n\nHowever, if the production costs of new submarines were to increase, the US could ask for more funding from Australia.\n\n\n\n\n\nThe US is currently reviewing the deal to scrutinise its cost-effectiveness.\n\n\n\n\n\nAndrews said the review, being conducted by Elon Musk, head of the Trump administration's so-called Department of Government Efficienc y, is part of the procedural process and \"makes sense\" for expensive government projects.\n\n\n\n\n\nWhile it is common place to review funding, the current US administration has made a number of large cuts to government spending.\n\n\n\nCould Donald Trump scrap AUKUS?\n\nIf Trump chooses to withdraw from the deal, then AUKUS would be scrapped, which an international relations expert said could happen if the US president decides it compromises US \"national security or deterrence needs\".\n\n\n\n\n\n\"The US is already facing challenges in meeting its own production targets for nuclear submarines, raising concerns about its ability to deliver on AUKUS commitments,\" Dr Minran Liu, from the University of Queensland's school of political science and international studies, told SBS News.\n\n\n\n\n\n\"AUKUS is inherently a bet on the future of the US. One that carries serious risks for Australia, including uncertainty over submarine construction, doubts about America's long-term commitment to the Indo-Pacific, and unpredictability in US domestic politics.\"\n\n\n\nREAD MORE The billion-dollar problem that neither Albanese nor Dutton wants to become a big issue\n\nLiu said Australia has little say or control over US domestic policies, meaning the future of AUKUS is in Trump's hands.\n\n\n\n\n\nAndrews acknowledged that Trump has been \"unpredictable\" in his dealings with other nations but said his cabinet strongly supports AUKUS.\n\n\n\n\n\n\"The key figures in his government, his secretary of state, the secretary of defence, and the national security advisor have all expressed their support for AUKUS,\" he said.\n\n\n\n\n\n\"They see value in it, they see a strategic logic that makes sense.\"\n\n\n\nAlbanese 'confident' AUKUS will go ahead\n\nPrime Minister Anthony Albanese spoke to reporters on Friday about AUKUS, and said that despite the steel tariffs, he was confident the deal would continue under Trump.\n\n\n\n\n\n\"I’m confident about AUKUS because I’ve had those first-hand discussions with the president of the United States, and also with more than 100 members of congress, in the senate during my state visit to the United States,\" he said.\n\n\n\n\n\nOpposition leader Peter Dutton was defence minister when the AUKUS deal was signed between Australia's Coalition government and the Democratic administration in Washington DC.\n\n\n\n\n\nHe told reporters on Friday that \"President Biden didn't want the deal\" at the time.\n\n\n\n\n\n\"The Americans hadn't shared their nuclear secrets since the 1950s, and it was a significant outcome, and we had worked on that.\"\n\n\n\n\n\nDutton said it demonstrated his party's ability to deal with \"whatever comes our way after the election.\"\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/us-masters-swearing-inside-but-jason-day-has-fighting-chance-20250412-p5lr7u.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Day nearly rewrites 46 years of Masters history before final-hole blemish",
        "publish_date": "Sat, 12 Apr 2025 11:43:19 +1000",
        "category": "sports",
        "authors": [
            "Murray Wenzel"
        ],
        "text": "Rory McIlroy roared back from the brink at Augusta National, Jason Day flirted with a 46-year Masters record while runaway overnight leader Justin Rose saw his advantage evaporate.\n\nEngland’s former world No.1 Rose carded a one-under-par 71 on Friday to cling to the 36-hole lead at eight under, holing a clutch par putt on the last with his rivals circling.\n\nAmerica’s Bryson DeChambeau chipped in from a bunker on the way to a four-under 68, stalking Rose a shot back in outright second.\n\nCanada’s Corey Conners was a stroke further back and will partner McIlroy (six-under) on Saturday after the Northern Irishman’s emphatic response to a Thursday meltdown that had seemingly blown his chances of a maiden green jacket and career grand slam 11 years in the waiting.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/victoria/the-age-photos-of-the-week-april-12-2025-20250405-p5lpg4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The Age photos of the week, April 12, 2025",
        "publish_date": "Sat, 12 Apr 2025 11:35:09 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "7/26\n\nStacey Edwards and Kent Morris in front of Stacey’s work. Kent Morris, curator of the new show Black In-Justice and head of the Torch program, and Stacey Edwards, former prisoner and now artist, who came thru the Torch program which helps Indigenous people who are in jail reconnect with their culture through art and has been very successful in helping get people on a path to not reoffending. Credit:Justin McManus",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/rory-surges-back-into-contention-20250412-p5lr82.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Rory surges back into contention",
        "publish_date": "Sat, 12 Apr 2025 11:24:47 +1000",
        "category": "finance",
        "authors": [],
        "text": "Rory surges back into contention\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/golf/bryson-holes-out-from-bunker-20250412-p5lr7y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Bryson holes out from bunker",
        "publish_date": "Sat, 12 Apr 2025 11:04:34 +1000",
        "category": "sports",
        "authors": [],
        "text": "Bryson holes out from bunker\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/leniu-in-explosive-post-match-tirade-at-thurston-at-suncorp-stadium-20250411-p5lr75.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘Don’t be fake’: Leniu doubles down on post-match tirade towards Thurston",
        "publish_date": "Sat, 12 Apr 2025 10:45:34 +1000",
        "category": "sports",
        "authors": [
            "Michael Chammas",
            "Christian Nicolussi"
        ],
        "text": "Roosters prop Spencer Leniu has accused Queensland Maroons great and Nine commentator Johnathan Thurston of being “two-faced” and “fake” following their on-field run-in at Suncorp Stadium on Friday night.\n\nLeniu is alleged to have called Thurston a “f---wit”, then a “f---ing c--t”, with the bad blood stretching back to Thurston’s views on Leniu’s eight-game suspension at the start of last season for racially vilifying Brisbane five-eighth Ezra Mam during a match in Las Vegas.\n\nSpencer Leniu and Johnathan Thurston on Friday night. Credit: NRL Photos\n\nTaking to social media on Saturday morning, Leniu posted on his Instagram account: “I never wanted to talk to JT. He kept trying to come speak to me. I said, ‘Lad idc [I don’t care] if that you hate me for what I did [calling Ezra Mam a ‘monkey’ in Las Vegas]. But don’t come up to me asking me questions like we’re Algood (sic). Don’t be two face. Hate me lad I’m eetswa [sweet] with that. But don’t be fake. I hate fake people.”\n\nNRL chief executive Andrew Abdo on Saturday said there was nothing to investigate because there had been no complaint lodged by Thurston or Nine, the publishers of this masthead.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/federal/the-latest-illustrations-from-artist-alan-moir-20230608-p5df1x.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "The latest illustrations from artist Alan Moir",
        "publish_date": "Sat, 12 Apr 2025 10:44:28 +1000",
        "category": "entertainment",
        "authors": [],
        "text": "The latest illustrations from artist Alan Moir\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/world/north-america/on-a-night-like-this-the-week-australia-took-new-york-city-by-storm-20250411-p5lqxk.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "On a night like this: The week Australia took New York City by storm",
        "publish_date": "Sat, 12 Apr 2025 10:30:26 +1000",
        "category": "entertainment",
        "authors": [
            "Michael Koziol"
        ],
        "text": "There is never a shortage of Australians in New York City, but for the past two weeks, you’d be forgiven for thinking you were in central Sydney or Melbourne.\n\nLast Friday, the iconic Empire State Building was lit up in green and gold for pop superstar Kylie Minogue, who played two shows at the city’s famed Madison Square Garden.\n\nThe Empire State Building, left, and Madison Square Garden lit up in Australian green and gold on April 4. Credit: Australian Consulate-General New York.\n\nA short walk away at the Music Box Theatre, Adelaide’s own Sarah Snook has started the Broadway run of The Picture of Dorian Gray, a one-woman take on the Oscar Wilde classic that premiered at the Sydney Theatre Company (STC) in 2020 with Eryn Jean Norvill playing the 26 roles.\n\nIn the years since, director Kip Williams has taken his manic, multi-camera production to London’s West End, also with Snook, and now to New York, where the Succession star performs for sellout crowds in the biggest theatre market in the world.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/biological-parents-have-no-legal-right-to-child-born-to-wrong-family-in-ivf-bungle-20250412-p5lr7t.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Biological parents have no legal right to child born to wrong family in IVF bungle",
        "publish_date": "Sat, 12 Apr 2025 09:50:19 +1000",
        "category": "finance",
        "authors": [],
        "text": "Biological parents have no legal right to child born to wrong family in IVF bungle\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later. Dismiss\n\nOur network\n\nOpen Navigation Menu The Age",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/soccer/ange-reveals-tottenham-leak-20250412-p5lr7s.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Ange reveals Tottenham leak",
        "publish_date": "Sat, 12 Apr 2025 09:49:34 +1000",
        "category": "sports",
        "authors": [],
        "text": "Ange reveals Tottenham leak\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/pucovski-may-face-an-uneven-playing-pitch-when-it-comes-to-compensation-20250410-p5lqta.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Pucovski may face an uneven playing pitch when it comes to compensation",
        "publish_date": "Sat, 12 Apr 2025 09:40:00 +1000",
        "category": "sports",
        "authors": [
            "Darren Kane"
        ],
        "text": "Will Pucovski always had that certain swagger about him, with a mountain of courage and fortitude. As an opening batsman must.\n\nAny instance of a professional athlete calling time on their career brings a spectrum of emotion. But when the athlete’s hand is forced due to an accumulation of incidents, the mood of the contemplation is much darker.\n\nWhen that athlete represents the epitome of a destiny unfulfilled, the conversation is devastating. To retire at 27 years of age and having played just one Test for Australia in 2021, that would chew at anyone’s inner thinking.\n\nIt must be enormously confronting as a 27-year-old to admit to yourself that you won’t play any cricket any more. But still not as terrifying as it would be to suffer serious concussion-related symptoms more than a year after the last in-match incident.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/from-disneyland-to-rugby-s-big-dance-how-tiny-desi-became-a-big-deal-in-footy-20250408-p5lq3l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "From Disneyland to rugby’s big dance: How tiny Desi became a big deal in footy",
        "publish_date": "Sat, 12 Apr 2025 09:31:16 +1000",
        "category": "sports",
        "authors": [
            "Iain Payten"
        ],
        "text": "Aunt Gail Miller won a famous gold medal at the Sydney Olympics in the Australian water polo team in 2000, and her uncle Paul Miller boxed at the Sydney Games, too, and won a Commonwealth Games gold medal in 2002. Miller’s dad Anthony was a nationally ranked swimmer and good rugby player, too, in the same Brisbane school team as John Eales and as a flanker at Norths. Gail Miller (back row, far left) was a member of the Australian women’s water polo team. Credit: Steve Baccon Anthony hardly a black sheep of the Miller clan, though: he was last year appointed chief executive officer of Westpac. “He is a very high achiever, too,” Miller said “My dad was a very competitive swimmer, he didn’t quite crack the Olympics, but he was a massive workhorse. So I definitely had a lot of people in my life that showed me the value of work ethic, especially in the sporting realm. And it made me believe, ‘oh, it’s possible, I can go do that too’.”\n\nMiller was one of those Energizer bunny kids who excelled at gymnastics and dancing from a young age. It wasn’t unusual to be out the door at 6am and back at 9pm. Desiree Miller performing as a young state squad gymnast In the gym, Miller was a state representative on the floor, beam, bars and vault, and in the dance studio, she performed in ballet, tap, jazz, hip-hop and contemporary disciplines. “We used to travel around the world every couple of years (for dance),” Miller said. “We competed in Spain and in America, we even performed at Disneyland. I’ve performed at Disneyland three times. It was amazing. I got to travel the world.”\n\nGoing to school in Sydney’s inner-west, and in Hong Kong during her teenage years, Miller also somehow found time to play other sports. Lots of them. “I was a diver, a tennis player, I played soccer, did a bit of basketball, I was too short for that. And netball and hockey, too - just a bunch of sports,” she said. “I felt (dance) helped me translate so much, especially whenever I tried a new sport, I was always balanced and coordinated. Same with gymnastics, I had that power and strength. So when I made the turn to rugby, it was kind of combining everything - and adding the contact part that I was missing out on for all those years.” Desi Miller scoring her third try in the 2024 Super W grand final. Credit: Getty Images In mid-2021, with COVID-19 still stalking the world, Miller was looking for a new team sport and to make some new mates. A friend suggested rugby and Miller rolled up at Easts where she was introduced to the game via sevens, and then 15s. It was love at first tackle bag.\n\n“I was like, ‘this is amazing’. I absolutely love it,” Miller said. Miller’s pace and strength immediately saw her stand out for Easts, and halfway through 2022, she was invited to train with the NSW women’s sevens squad. That turned into 15-a-side squad training with the Waratahs’ Super W squad, and in 2023, Miller made her debut for the Tahs against the Force. In the same year, Miller was chosen for the Wallaroos squad and made her debut against England. In the years since, Miller has become a mainstay for NSW and Australia. Her statistics make for eye-popping reading. In 17 games for NSW, Miller has scored 17 tries, made 35 linebreaks and 28 offloads, and beaten a whopping 73 defenders. In 12 Tests, Miller has scored 7 tries, 24 linebreaks and beaten 48 defenders.\n\nThis year, the Super Rugby women’s competition saw several Aussie sevens stars switch to 15s for a few games, in an attempt to make the 2025 Rugby World Cup squad. After electing to not return to the sevens series, Charlotte Caslick will play for Queensland in the decider at North Sydney Oval. Desiree Miller will play in the NRLW grand final on Saturday, Credit: Steven Siewert Many believe the selection of try-scoring machine Maddi Levi - who was world’s best sevens player last year -in the Wallaroos’ squad should be a formality. But the testament of how well the incumbent Wallaroos wingers, Miller and Maya Stewart (who was the Wallaroos’ MVP last year) are both playing, Levi currently wouldn’t unseat either. A bench role is the more likely scenario. Loading",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/technology/there-s-one-way-you-can-make-your-super-more-secure-20250408-p5lq38.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "There’s one way you can make your super more secure",
        "publish_date": "Sat, 12 Apr 2025 09:30:00 +1000",
        "category": "finance",
        "authors": [
            "Tim Biggs"
        ],
        "text": "But credential stuffing is also the perfect real-world illustration of why people are so often told not to reuse passwords.\n\nImagine you sign up to an online service using a particular combination of email and password, and then that service is compromised. Your credentials may end up in a huge collection on the dark web with billions of others, sold fairly cheaply. Now, that service may not have any important data about you. But, if you use that same password elsewhere, it could lead to significant trouble.\n\nLoading\n\nCrooks will load those billions of credentials into an automated system that throws them rapid-fire at services that do have important info, such as financial services. Those services should absolutely have protections against this. If they start getting thousands of different login requests from the same IP address, or several login attempts on the same account from different IP addresses, that should be flagged. Hunt and others have also created protocols that can check passwords to see if they’ve been caught up in a breach, and many companies use these so they can prompt users to change passwords before an attack occurs.\n\nBut an ironclad way to avoid being a victim of credential stuffing is to not reuse passwords, and particularly to have a unique password for any service that holds your money or sensitive data. There are many password managers that will keep all your unique passwords safe and encrypted, and some also integrate the technology that can tell you if one of your passwords has been found in data sold on the dark web, so you can change it.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/crows-make-key-call-for-cats-blockbuster-afl-experts-tips-and-teams-for-round-five-20250409-p5lqdz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "AFL teams and tips: Hawks welcome back Worpel for grudge match",
        "publish_date": "Sat, 12 Apr 2025 09:24:59 +1000",
        "category": "lifestyle",
        "authors": [],
        "text": "WEST COAST B: B.Hough, H.Edwards, R.Ginbey HB: J.Hunt, S.Brock, R.Maric C: T.Dewar, L.Duggan, J.Graham HF: J.Cripps, J.Waterman, M.Owies F: A.Reid, O.Allen - C, L.Ryan FOLL: B.Williams, L.Baker, H.Reid I/C: T.Gross, C.Hall, J.Williams, H.Davis, J.Hutchinson EMG: H.Johnston, M.Flynn, T.Cole IN: H.Edwards, J.Waterman, L.Ryan, J.Hutchinson OUT: T.Brockman (Omitted), T.Kelly (Omitted), N.Long (Omitted), T.Cole (Omitted)\n\nCARLTON B: J.Silvagni, J.Weitering, N.Haynes HB: A.Saad, M.McGovern, Z.Williams C: B.Acres, P.Cripps - C, A.Cerra HF: L.Fogarty, H.McKay, S.Docherty F: M.Cottrell, C.Curnow, J.Motlop FOLL: T.De Koning, G.Hewett, S.Walsh I/C: M.Carroll, O.Hollands, B.Kemp, C.Durdin, W.White EMG: E.Hollands, L.Young, C.Lord IN: H.McKay, M.Cottrell, M.Carroll, C.Durdin OUT: L.Young (Omitted), L.Cowan (Injured), A.Moir (Omitted), C.Lord (Omitted)\n\nGOLD COAST B: W.Powell, S.Collins, B.Uwland HB: J.Noble, M.Andrew, D.Rioli C: L.Weller, M.Rowell, S.Clohesy HF: B.Ainsworth, T.Miller, S.Flanders F: B.King, B.Humphrey, E.Read FOLL: J.Witts, W.Graham, N.Anderson - C I/C: J.Walter, N.Holman, B.Long, J.Rogers, J.Jeffrey EMG: B.Fiorini, N.Moyle, C.Graham IN: N.Holman OUT: C.Budarick (Injured)\n\nWESTERN BULLDOGS\n\nB: B.Khamis, L.Jones, L.Bramble\n\nHB: J.Johannisen, R.Lobb, B.Dale\n\nC: B.Williams, T.Liberatore - C, S.Davidson\n\nHF: C.Hynes, A.Naughton, R.Sanders\n\nF: J.O’Donnell, S.Darcy, J.Harmes\n\nFOLL: T.English, M.Kennedy, E.Richards\n\nI/C: L.Cleary, J.Dolan, J.Freijah, L.McNeil, R.West\n\nEMG: J.Busslinger, H.Gallagher, C.Poulter\n\nIN: J.Johannisen, C.Hynes, L.Cleary\n\nOUT: O.Baker (Suspension), L.Vandermeer (Injured), H.Gallagher (Omitted)\n\nBRISBANE LIONS\n\nB: D.Zorko, J.Payne, R.Lester\n\nHB: N.Answerth, H.Andrews - C, D.Wilmot\n\nC: J.Fletcher, Z.Bailey, J.Berry\n\nHF: C.Cameron, E.Hipwood, H.McCluggage\n\nF: C.Rayner, S.Day, L.Morris\n\nFOLL: O.McInerney, J.Dunkley, L.Neale\n\nI/C: C.Ah Chee, W.Ashcroft, L.Ashcroft, W.McLachlan, B.Reville\n\nEMG: S.Marshall, D.Gardiner, D.Fort\n\nIN: -\n\nOUT: -\n\nMELBOURNE\n\nB: J.Bowey, S.May, H.Petty\n\nHB: T.Rivers, T.McDonald, C.Salem\n\nC: K.Chandler, J.Viney, E.Langdon\n\nHF: J.Henderson, B.Fritsch, K.Pickett\n\nF: J.Melksham, J.van Rooyen, C.Spargo\n\nFOLL: M.Gawn - C, C.Petracca, H.Langford\n\nI/C: C.Windsor, C.Oliver, X.Lindsay, H.Sharp, T.Sparrow\n\nEMG: D.Turner, J.Billings, T.Fullarton\n\nIN: X.Lindsay\n\nOUT: D.Turner (Omitted)\n\nESSENDON\n\nB: A.McGrath, B.McKay, J.Ridley\n\nHB: M.Redman, Z.Reid, J.Prior\n\nC: X.Duursma, A.Perkins, A.Roberts\n\nHF: J.Gresham, N.Caddy, N.Martin\n\nF: H.Jones, S.Draper, I.Kako\n\nFOLL: N.Bryan, Z.Merrett - C, S.Durham\n\nI/C: B.Hobbs, D.Shiel, W.Setterfield, J.Menzie, S.El-Hawli\n\nEMG: E.Tsatas, L.Hayes, A.Day-Wicks\n\nIN: A.Perkins, W.Setterfield\n\nOUT: J.Caldwell (Injured), T.Edwards (Injured)",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/afl/connected-collingwood-outmuscle-depleted-sydney-20250411-p5lr7a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hot streak: Connected Pies outmuscle Swans for 10th straight win at Adelaide Oval",
        "publish_date": "Sat, 12 Apr 2025 09:20:45 +1000",
        "category": "sports",
        "authors": [
            "Peter Ryan"
        ],
        "text": "Loading\n\nCollingwood coach Craig McRae told his players the number on their back was less relevant than their connection with teammates before they outmuscled Sydney to maintain their perfect record at Gather Round.\n\nAlthough missing Jordan DeGoey, Lachie Schultz and Dan Houston, the Magpies were too strong in the contest.\n\nThe Magpies’ Ned Long was strong in the contest. Credit: AFL Photos via Getty Images\n\nNed Long played the best game of his career to assist the tagged Nick Daicos as the Magpies dominated centre clearance scoring three goals from the source and winning the territory battle.\n\nOn the rare occasions after quarter-time that Sydney were able to move the ball from the back half, Darcy Moore continued his recent renaissance, playing much tighter defensively and trusting his teammates to rebound ground balls if he could not mark.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/the-shock-is-startling-grieving-the-death-of-my-gp-20250407-p5lpv4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "‘The shock is startling’: Grieving the death of my GP",
        "publish_date": "Sat, 12 Apr 2025 09:09:28 +1000",
        "category": "lifestyle",
        "authors": [
            "Jonathan Seidler"
        ],
        "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size\n\nThis story is part of the April 12 edition of Good Weekend. See all 12 stories .\n\nTowards the end of summer each year, I wind up at the doctor’s office. It was a standing joke with my GP that each January he would tell me to wear earplugs when swimming, and I’d respond that I couldn’t hear him until after he’d applied a high-pressure surgical piston to blast out the accumulated gunk.\n\nI swim a lot, which is a diplomatic way of saying that I enjoy wading into the crisp ocean and ducking my head under a few waves that are mostly waist-height. When you are lucky enough to grow up near the sea, you partake of this liberally. Dips before work. During lunch. At knock-off. There is nothing like the bracing freshness of a long-awaited plunge.\n\nBut the bones in my ears are not like yours. Since my early 20s they have been growing over, fusing into twisted tree roots that are perilously close to my brain. This is called external auditory canal exostoses and the net result is water gets trapped deep in my ears, calcifies into salty wax and renders me practically deaf.\n\nMy GP was diagnosed with an aggressive form of cancer early last year and passed away a painfully short time later, just as the ocean started warming up. I was bereft at the news of his death; he had been a friend of the family and a wonderfully selfless man. My father had also been a GP, and both their memorials were thronged with the grief of an extended community that had lost something vital to its very functioning. Doctors do not typically get state funerals but in their outpouring of mourners, their farewells can feel a bit like one. A former patient realises very quickly that they are but one of hundreds, all of whom maintain a distinctly personal relationship with someone who checks their bloods, listens to their chests and, on occasion, peers into their ears.\n\nThose who serve our communities aren’t typically thought about in the same way as family members or friends. But they are crucial totems in our lives.\n\nOnce my doctor knew he was dying, his surgery arranged for my file to be transferred to another practice. A different GP would peruse my previous mental health plans and uncover my penicillin allergy. This should not have felt as strange as it did, like intimate details being passed on to a new lover. We tend to hold the view that certain members of society are with us for life; having them suddenly shut up shop, move towns or onto the next astral plane can be highly distressing.\n\nThose who serve our communities, whether they treat our maladies, tailor our dresses or tame our tresses, aren’t typically thought about in the same way as family members or friends. But they are crucial totems in our lives, keepers of knowledge and secrets and an ongoing, living history to which few others have access. The level of trust placed in my hairdresser three days before my wedding is more than I ever expect from anyone at my bank.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/victoria/sunshine-stoush-could-set-back-melton-trains-by-a-decade-labor-says-20250410-p5lqvh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Sunshine stoush could set back Melton trains by a decade, Labor says",
        "publish_date": "Sat, 12 Apr 2025 09:00:00 +1000",
        "category": "finance",
        "authors": [
            "Kieran Rooney"
        ],
        "text": "To understand the Sunshine upgrade as proposed by Labor, it helps to think of the project as a level crossing removal or the transformation of a busy road into a freeway. Sunshine sits at the meeting point of multiple regional and suburban rail lines coming from Victoria’s west, including 70 per cent of the V/Line network. Prime Minister Anthony Albanese on Monday spruiking the proposed Sunshine station upgrade with Premier Jacinta Allan. Credit: Alex Ellinghausen The tracks around the station are like a busy traffic intersection where trains are sometimes forced to wait to get into the correct “lane” or reach the platform. The Sunshine project aims to solve these problems by redesigning the network along a six-kilometre stretch of rail so that regional trains, suburban services and freight are kept on their own separate paths. Doing so will make room for 40 trains an hour.\n\nThis includes building a series of rail bridges that will steer trains onto the correct track without having to cut across the path of others. The Level Crossing Removal Project, which has been performing a similar task across 110 different Victorian intersections, is the department delivering the upgrade. A new pair of tracks will also be built between Sunshine and West Footscray to make this untangling process more simple and add capacity for more trains. Sunshine station will be expanded, with two new platforms accommodating these tracks and receiving most V/Line routes. Labor wants to transform Sunshine train station into a transport “super hub”. Credit: Joe Armao By making these changes, V/Line trains will converge more simply onto regional rail tracks towards Southern Cross Station while suburban services from the airport, Sunbury and eventually Melton will funnel onto the same path directly into the Metro Tunnel. V/Line services that are currently forced to skip Sunshine because of capacity constraints will all be able to stop at the station.\n\nThis is why it is being touted as a regional “super hub” where a passenger from Bendigo headed to Geelong would always be able to transfer trains without having to travel into the CBD. Other improvements include the extension of high-capacity signalling, used for Metro Tunnel services, past West Footscray and out to Sunshine, allowing trains to run much closer together and more frequently. An electrified Melton line will also have high-capacity signalling in sections. The project adds a connection point in the network that means suburban Melton trains can plug into the new system without significant further work around Sunshine. Opposition transport spokeswoman Bridget McKenzie on the campaign trail this month with Peter Dutton, announcing the Coalition’s plans for airport rail. Credit: James Brickwood The federal opposition’s plan for the precinct does not specifically include the Melton electrification, new track pair or rail bridges, but would preserve improvements for regional passengers outlined in the Airport Rail business case. This document proposed adding an extra platform for V/Line services.\n\nVictorian Transport Minister Gabrielle Williams told The Age the disruptive nature of the project meant it needed to be done in one go, with Sunshine the most complex part of the network outside the CBD. “It’s incredibly short-sighted. It will set the west back significantly ... You would be putting back Melton electrification by over 10 years,” she said. “This is one of Australia’s fastest growing regions. You can’t plan for more services along that corridor, and the Wyndham Vale corridor as well, unless you do this work to make that happen. “I don’t think westies who live on this side of town, whether it be in the regions or in the suburbs, deserve a half-baked option.” The Victorian government first proposed the electrification of the Melton line in 2018, but since then, the region is yet to receive a firm commitment on when it would be delivered.\n\nLoading Infrastructure Victoria this year has recommended work on the project begin by 2030, warning the Western Freeway will be over capacity in the next five to six years, and crowding on peak-hour Melton trains will increase by 50 per cent between 2031 and 2041. A Liberal spokesperson said there were serious questions around the $4 billion proposal and if elected the Coalition would “assess the business case, projected works, and the cost of the proposed Sunshine Station redevelopment to ensure infrastructure funds are being spent prudently”. “The cost of upgrades at Sunshine station at present is being driven by the Allan government’s SRL gold-plated scoping requirements,” the spokesperson said. “The Coalition will not progress the Suburban Rail Loop.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/roosters-coach-defends-leniu-after-thurston-spat-20250412-p5lr7m.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Roosters coach defends Leniu after Thurston spat",
        "publish_date": "Sat, 12 Apr 2025 08:29:20 +1000",
        "category": "sports",
        "authors": [],
        "text": "Roosters coach defends Leniu after Thurston spat\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-homeowners-warned-over-disturbing-find-coming-out-of-the-insulation-212605696.html",
        "title": "Aussie homeowners warned over disturbing find 'coming out of the insulation'",
        "publish_date": "2025-04-11T21:26:05Z",
        "category": "finance",
        "authors": [],
        "text": "Unwanted bugs and invasive infestations can become seriously costly for Australian homeowners.\n\nThe Sydney-based pest controller said multiple jobs have led him back to the roof insulation. Source: TikTok/RoachSniper\n\nA pest controller is highlighting the surprising way unwanted bug infestations can make it into your home after receiving multiple call outs to eventually discover outbreaks hiding in a very common material in the roof cavity of Aussie homes.\n\nOn a number of occasions recently, he's discovered suspected drugstore beetles that have seemingly come from contaminated roofing insulation.\n\n\"It's a bit of a common problem with new builds, for people who are getting fresh insulation installed. Sometimes it's tainted from the warehouse, but there's a range of reasons,\" pest controller Christopher James told Yahoo News Australia.\n\nIf you don't find the source, \"they'll run rampant through the house,\" the self-described 'Roach Sniper' said.\n\nADVERTISEMENT\n\n\"I've seen jobs where it's been going on for years, that's a long time to have beetles falling through your down lights ... and constantly finding dead beetles in the house.\"\n\nRelated: Harvey Norman bed discovered riddled with invasive bug from China\n\nOn Thursday, he shared a video to his TikTok page, showing an infestation of suspected drugstore beetles inside the roof of a Sydney home.\n\n\"They're coming out of the insulation ... Sometimes these insulation packages are coming from places we're they're tainted,\" he said in the video.\n\nSpeaking to Yahoo, he said the agricultural pest is \"pretty widespread\" and is often found in pantry items like grains and oats and \"wherever there is going to be stored food products\" and produce larvae.\n\n\"But it's the second or third job where it's led me back to the insulation\".\n\nADVERTISEMENT\n\nAccording to the NSW Department of Primary Industries, the drugstore beetle and the closely related tobacco or cigarette beetle \"typically lay 100 eggs over their lifespan of, on average, 25 days\".\n\nThe bugs like to live among stored food products where they \"feed internally\". Source: TikTok/RoachSniper\n\n\"Signs of these pesky insects include irregular holes in foodstuff and packaging. Infested material becomes contaminated with pupal cocoons and dead bodies of the short-lived adults,\" the DPI says.\n\n\"Drugstore beetles are commonly found infesting a range of stored products including dried herbs and spices. In addition, as the name suggests, the Cigarette beetle is a pest of cured tobacco.\"\n\nWhether it's ants, booklice, bed bugs, soldier beetles, cockroaches or the dreaded termite, Australians are no stranger to pests becoming unwanted house guests.\n\nWhile it's hard to pin down the exact cost, exterminators and pest experts say bugs and invasive infestations cost Australian homeowners more than $600 million in damage and repairs each year with that number much higher when termite destruction is fully accounted for.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/aussie-councillor-erupts-over-reverse-graffiti-act-on-footpath-incredibly-cheeky-201337855.html",
        "title": "Aussie councillor erupts over 'reverse graffiti' act on footpath: 'Incredibly cheeky'",
        "publish_date": "2025-04-11T20:13:37Z",
        "category": "finance",
        "authors": [],
        "text": "With the federal election around the corner, candidates are finding innovative ways to get the attention of voters.\n\nThe deputy mayor of Woollahra was not impressed by the tactic. Source: Facebook/Sean Carmichael\n\nEarly voting in the upcoming federal election opens in less than two weeks as petty games of party politics play out in suburbs around the country with some candidates being accused of dirty tricks. Or in this case, kind of the opposite.\n\nThe deputy mayor of Woollahra, in Sydney's affluent eastern suburbs, has slammed his local federal member for advertising her candidacy by washing advertisements into dirty footpaths in the local area, with a stencil and high-grade pressure hose.\n\nCouncillor Sean Carmichael took to social media to condemn the move by 'teal' independent Allegra Spender who currently holds the seat formerly held by Malcolm Turnbull.\n\nThe deputy mayor said council enlisted workers to remove what he described as \"nine acts of reverse graffiti\" on Thursday night.\n\nADVERTISEMENT\n\n\"This is council property that has been defaced with what is clearly, in substance, graffiti,\" he told Yahoo News.\n\nThe councillor said the advertisements could technically breach rules from the Australian Electoral Commission. \"Well it's not got an authorisation on it ... all election material must have who has authorised it.\"\n\nRelated: Labor, Albanese extend leads in latest election poll\n\nCalling the tactic \"unacceptable\" in a local Facebook group, the deputy mayor complained it was \"quite difficult to remove without industrial grade machinery\".\n\n\"These defaced concrete footpaths are otherwise in satisfactory condition. The implied argument they are dirty and needing cleaning is - in my own view - incredibly cheeky, and does not pass,\" he wrote.\n\nAllegra Spender won the formerly safe Liberal seat at the last election. Source: AAP/Facebook\n\nWhen contacted by Yahoo, Allegra Spender's team questioned the use of local ratepayers' money to remove the messages with further pressure washing.\n\nADVERTISEMENT\n\n\"The messages are created with water pressure, that actually cleans dirt off the footpath. It's disappointing that the Liberal Party controlled council is misusing ratepayers' money to remove a political opponent’s messages. The messages are temporary and fade away naturally,\" a campaign spokesperson said.\n\nSpeaking to Yahoo, Cr Carmichael said it was not a technique he has ever seen before and hopes it does not become the norm.\n\n\"Do we really need to go down this path, pardon the pun... We just don't need to be doing this,\" he said.\n\nMs Spender entered parliament at the previous federal election in 2022, and was among a wave of so-called teal candidates to dislodge incumbent Liberal members. In the upcoming federal poll, on May 3, some observers suggest independent candidates could even replicate such success in the state of Queensland, including in Peter Dutton's seat of Dickson where he is being challenged by both a strong Labor candidate and independent Ellie Smith. If the latter were to prevail it would be the first time an independent candidate has ever toppled a federal opposition leader.\n\nADVERTISEMENT\n\nREAD MORE: Down to the wire, Dutton faces fight to hold his own seat\n\nYouth enrolment rate up as record number of Aussies set to vote\n\nA record number of people are expected to have their say in the upcoming election, as candidates get ready to find out where their names will appear on the ballots.\n\nThe number of people enrolled to vote has reached a new high at almost 18,098,797, the Australian Electoral Commission (AEC) revealed on Friday.\n\nCompared to the 2022 election, about 870,000 more people have been enrolled, representing a five per cent rise.\n\nAccording to the AEC, In the 11 days following the announcement of the election, it added approximately 85,000 new voters to the roll, and helped more than 419,000 other voters to update their enrolment details. It also brought Australia’s youth enrolment rate to 92 per cent.\n\nADVERTISEMENT\n\n\"We’re particularly focused on Australia’s youth enrolment rates, and I’m pleased to report that it’s now extremely healthy,\" Australian Electoral Commissioner Jeff Pope said. \"Well done, Australia.\"\n\nwith AAP\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/tourists-amazing-find-buried-on-beach-after-1300-mistake-in-remote-aussie-town-075407566.html",
        "title": "Tourist's amazing find buried on beach after $1,300 mistake in remote Aussie town",
        "publish_date": "2025-04-11T07:54:07Z",
        "category": "finance",
        "authors": [],
        "text": "A tourist travelling around Australia in a van has captured the heart-stopping moment a split-second mistake left him stranded in a remote town — and the “unreal” beach discovery that finally set him free. Coleman Geiger, an American who has been living in Sydney for the past two years, began his epic trek from Cairns to Perth last month before heading over to Bali.\n\nWhile the first 10 days were plagued by heavy rain, the 28-year-old model and graphic designer was relieved to see sunshine when he reached Broome.\n\nAfter spending a couple of days sightseeing, Coleman told Yahoo News Australia he decided to go for a quick swim on his last morning before heading on to Exmouth — completely unaware the last-minute decision would almost cost him $1,300 and potentially ruin the rest of his holiday.\n\nThe traveller parked his Juicy Coaster campervan in the car park at Cable Beach and walked down to the water. Before dunking his body into the ocean, he placed his bag on top of a nearby rock and propped his phone on a tripod.\n\nADVERTISEMENT\n\n“I was only going there just to get the one stupid clip of me running into the water. It came back to bite me,” he said. “I had a tote bag, I think I probably had a towel in there and stuff, but I wasn't thinking anything of it, and set my keys on top [of it].\n\nTourist stunned to discover keys have disappeared into the ocean\n\nAfter just 15 minutes, Coleman noticed the tide was rising rapidly. “The tide was really low and I don’t know why but I just assumed the tide would stay at that level. But then it started to get really big when I was in the ocean, and that’s when the keys fell into the water,” the 28-year-old told Yahoo.\n\nHowever, it wasn’t until he had almost returned to the van with his soaking wet bag on his shoulder, that he realised his remote start key, and the AirPods attached to the ring, were missing.\n\nADVERTISEMENT\n\n“I went back to where I was, and they weren’t there. The tide was too high at that point so I gave up looking after about 30 minutes,” he said. At this point, he believed the error could quickly be remedied by ordering a replacement key, but reality set in when a local locksmith and Juicy support worker informed him that could take “at least a week”.\n\nThe traveller said he was quoted about $500 to tow the car from the beach back into town, another $500 for a new key, $150 to “break into the van” and at least another $100 on scooters so he could pick up some food — leaving him with a potentially hefty $1,300 bill.\n\n“Then it was all starting to compile. I have no way to even get into this vehicle. My whole life is in the vehicle,” Geiger said, adding he had parked near signs warning against illegal camping. “All the anxiety kind of set in.”\n\nLeft with just the shorts, hat and shoes he was wearing at the time, the tourist began to panic, concerned he’d have to not only give up on his road trip, but also miss his flight to Indonesia. A local hostel was able to place him in their emergency room for the day, where he spent the next six hours on the phone to numerous people — including his mum — trying to find a quicker resolution.\n\nColeman's heartwarming reaction to finding his keys buried in the sand has amused thousands of people across the world. Source: Coleman Geiger\n\nMan's heartwarming response to shocking find buried in sand\n\nDetermined not to give up, Coleman decided to head back to Cable Beach as the tide retreated later that afternoon, but knew the odds of him finding his keys were “so, so slim”. He had been trying to use his phone to locate his attached AirPods, but they were not registering.\n\nADVERTISEMENT\n\nLuckily he was able to remember which rock he had set his belongings on and walked in that direction. “I looked around for like five minutes and I thought ‘okay, there’s no way I’m going to find this but I’ll just look’,” he told Yahoo. “I went back to the rock, and maybe 15 to 20 metres away I see this little thing sticking out.”\n\nMiraculously, the Juicy tag attached to his keys was ever so slightly poking out of the sand. The 28-year-old could barely contain his excitement as he bolted over to the spot and pulled the piece of square plastic out of the sand, revealing his lost belongings. Footage shows an incredible gleeful and relieved Coleman jumping in joy after making the one-in-a-million discovery.\n\nAfter opening up the remote start key and cleaning off all the sand, much to his surprise, the van’s engine started. Not only that, but his AirPods appeared to also still be working well. Exhausted from the entire ordeal, the American took himself off for a beer before continuing his journey south the next morning.\n\nA video detailing the tourist’s rollercoaster of emotions has since gone viral, with thousands of viewers from around the world sharing in his luck and relief.\n\n“Buy a lotto ticket,” one person urged. “I’ve never been happier for a stranger on the internet,” another laughed.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]