[
    {
        "url": "https://www.9news.com.au/world/matthew-perry-doctor-charged-with-supplying-friends-star-with-ketamine-will-plead-guilty/98a0cda8-a2e8-423a-b42c-3f73f85c5199",
        "title": "Doctor charged with supplying Matthew Perry ketamine will plead guilty",
        "publish_date": "Tue, 17 Jun 2025 00:31:16 +0000",
        "category": "entertainment",
        "authors": [
            "Jun"
        ],
        "text": "A doctor charged with giving Matthew Perry ketamine in the month leading up to the Friends star's overdose death has agreed to plead guilty, US authorities say.\n\nDr Salvador Plasencia has agreed to plead guilty to four counts of distribution of ketamine, federal prosecutors said in a statement.\n\nThey said the plea carries a maximum sentence of 40 years in prison, and Plasencia is expected to enter the plea in the coming weeks.\n\nREAD MORE: Hundreds of Australians trying to leave Iran and Israel as conflict intensifies\n\nFriends star Matthew Perry was found dead by his assistant on October 28, 2023. (Willy Sanjuan/Invision/AP)\n\nPlasencia and a woman accused of being a ketamine dealer had been the primary targets of the prosecution, after three other defendants, including another doctor, agreed to plead guilty in exchange for their cooperation.\n\nPlasencia had been scheduled to start trial in August.\n\nAn email to his attorney seeking comment was not immediately answered.\n\nPerry was found dead by his assistant on October 28, 2023.\n\nThe medical examiner ruled that ketamine was the primary cause of death.\n\nThe actor had been using the drug through his regular doctor in a legal but off-label treatment for depression that has become increasingly common.\n\nREAD MORE: WhatsApp to start showing ads to users in parts of the messaging app\n\nPerry starred alongside Jennifer Aniston, Courteney Cox, Lisa Kudrow, Matt LeBlanc and David Schwimmer for 10 seasons from 1994 to 2004 on NBC’s megahit. (Warner Bros. Television / Stan)\n\nPerry, 54, began seeking more ketamine than his doctor would give him.\n\nAbout a month before the actor’s death, he found Plasencia, a doctor who in turn allegedly asked the other doctor, Mark Chavez, to obtain the drug for him, according to court filings in the Chavez case.\n\n“I wonder how much this moron will pay,” Plasencia texted Chavez, according to court filings from prosecutors.\n\nThe two met up the same day in Costa Mesa, halfway between Santa Monica, California, where Plasencia practised and San Diego, where Chavez practised, and exchanged at least four vials of ketamine, the filings said.\n\nMatthew Perry's memoir, released in November 2022. He wrote of his long-time struggle with addiction. (AP)\n\nAfter selling the drugs to Perry for $US4500 ($7000), Plasencia allegedly asked Chavez if he could keep supplying them so they could become Perry’s “go-to,” prosecutors said.\n\nWhile Plasencia is accused of supplying the bulk of Perry’s ketamine in his final weeks, another defendant, Jasmine Sangha, who prosecutors allege was a major ketamine dealer, is alleged to have provided the dose that killed the actor.\n\nShe is also scheduled to go to trial in August.\n\nShe has pleaded not guilty — making her the only one of the five people charged in Perry’s death who has not entered a plea agreement.\n\nPerry struggled with addiction for years, dating back to his time on Friends , when he became one of the biggest stars of his generation as Chandler Bing.",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/national/sydney-news-werrington-body-discovery-prompts-police-investigation/a21e720b-b3ff-4030-848c-9313a2072653",
        "title": "Man charged after woman's body found in Sydney bushland",
        "publish_date": "Mon, 16 Jun 2025 19:37:09 +0000",
        "category": "sports",
        "authors": [
            "Jun"
        ],
        "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
        "source": "9News"
    },
    {
        "url": "https://www.9news.com.au/world/trump-mobile-announced-by-eric-and-donald-junior-to-take-on-apple-and-samsung/b0ee5702-6ca1-4a01-a6bd-810529ff3e2c",
        "title": "Trump taking on Apple with his own phone company",
        "publish_date": "Mon, 16 Jun 2025 21:48:16 +0000",
        "category": "finance",
        "authors": [
            "Jun"
        ],
        "text": "The Trump Organisation is licensing the Trump name for a new wireless mobile phone service that is being marketed to the president's supporters and puts the brand in competition with major US carriers such as AT&T and Verizon and smartphone makers such as Apple and Samsung.\n\n\"A big part of what we've done … has been focused on technology for people who have been underserved, whether that's been in crypto or anything else, but one of the places where we felt there was lackluster performance was in the mobile industry,\" Donald Trump Jnr said at an event at Trump Tower in New York.\n\nA website for the project advertises a $US47.45 a month plan, an apparent reference to President Donald Trump's terms as the 47th and 45th president of the United States.\n\nDonald Trump Jnr and Eric Trump at the Bitcoin 2025 conference in Las Vegas in May. (CNN)\n\nThe Trumps emphasised the new mobile company's focus on American-made devices — a gold-hued \"T1\" smartphone was available for pre-order Monday for $499 — and US-based services.\n\n\"You're not calling up call centres in Bangladesh,\" Eric Trump told Fox Business . \"You're doing it right out of St Louis, Missouri.\"\n\n\"With Trump Mobile, we're going to be introducing an entire package of products,\" Trump Junior said, including telemedicine, roadside assistance and unlimited texting.\n\nThe White House has denied any suggestions that the president is using his name to profit. (AP)\n\nThe announcement, timed to coincide with the 10-year anniversary of the day Donald Trump took the golden escalator down to announce his 2016 presidential run, marks the latest expansion of the Trump family business into tech, cryptocurrencies and media.\n\nThe vast and growing scale of the Trump family businesses — which include long-held real estate and casino holdings along with more recent forays into digital finance and branded items — has deepened concerns about the president's willingness to flout ethical conventions while in office.\n\nREAD MORE: WhatsApp to start showing ads to users in parts of the messaging app\n\nThe White House has repeatedly denied any suggestion of impropriety.\n\nPress secretary Karoline Leavitt has previously said it was \"ridiculous\" that anyone would suggest Trump is \"doing anything for his own benefit\" and that the White House holds itself to the \"highest of ethical standards\".\n\nThe Trump Organisation is the main holding company for President Trump's private businesses, and it is run by his eldest sons, Eric and Donald Jr.",
        "source": "9News"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/survivors-review-interview-netflix-jane-harper/105374198",
        "title": "The Survivors turns Jane Harper's novel into a crime show with grit",
        "publish_date": "Tue, 17 Jun 2025 01:27:43 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "By all outward appearances, The Survivors is just another cliché of its genre.\n\nFast facts about The Survivors What: An Australian murder-mystery adapted from Jane Harper's bestselling novel. Directed by: Tony Ayres Starring: Charlie Vickers, Yerin Ha, Robyn Malcolm, Damien Garvey, Thom Green, Shannon Berry, Catherine McClements, Miriama Smith, Don Hany. When: On Netflix now Likely to make you feel: Gripped (and craving a holiday in Tassie).\n\nIn a small town full of buried secrets, everyone becomes a suspect when a young woman’s body washes up on the beach.\n\nAs its director Tony Ayres explains, the show’s very premise puts it at risk of “the worst version” of murder mystery: \"Dead girl entertainment.\"\n\n“Often, women being murdered feels more consequential as a story,” he told The Screen Show’s Jason di Rosso.\n\nFor him, the only way to approach this trope was to delve further.\n\n\"It’s not as though women being murdered is not something that happens every week in Australia. It’s not as though it’s not a reality,\" he said.\n\n\"The best version of this [story] asks: why does this happen?\"\n\nIn his six-part series — adapted from the bestselling novel by Jane Harper and now released on Netflix — this question is explored in a uniquely Australian setting, as a town of \"good blokes\" and their women, \"true locals\" and outsiders are thrust under the spotlight.\n\nMemorial football games and forgotten women\n\nThe Survivors is set in the fictional Tasmanian tourist town of Evelyn Bay, where tight-knit locals are still mourning the two young men who died in a freak storm 15 years earlier.\n\nFinn and Toby were top blokes in a stereotypically Australian understanding of the term: they looked out for their mates; they loved a banter over a beer; and they were good at footy.\n\nBut Evelyn Bay has all but forgotten Gabby, the young girl who also went missing that day, and they dismiss her grieving mother as a hysterical nutcase.\n\nThe caves aren't the only thing holding secrets in Evelyn Bay. (Supplied: Netflix)\n\nWhen Kieran Elliott (Charlie Vickers) returns to his hometown with his young baby in tow, he’s constantly reminded by the town – and particularly by his mother – that those men, one of whom was his brother, drowned trying to save him.\n\nHis wife Mia (Yerin Ha) grew up as one of the only Asian-Australians in Evelyn Bay, and became even more of an outsider when her best friend Gabby went missing that day.\n\nAs Kieran and Mia endure their frosty homecoming, another woman is found washed up on the beach, and this time the town can’t look away.\n\nMateship under pressure\n\nIt’s easy for local crime to feel a little cliched, but The Survivors flows so naturally it almost feels like a true crime piece.\n\nFor Ayres, it was important to twist the \"dead girls\" narrative into a story that felt \"useful and reflective, that generates conversation, rather than [present it] in a way which is just kind of packaged\".\n\nBefore The Survivors, Tony Ayres was behind Glitch, Stateless, Clickbait and Nowhere Boys. (Supplied: Netflix)\n\nAnd the women of The Survivors are far from victims. Both of the mystery girls feel like fully fledged characters, while the women who call Evelyn Bay home display determination and nuance throughout.\n\nParticularly impressive is Robyn Malcolm as Kieran’s mum Verity, who’s lost one son and blames another for his death. At once a terrifying force and earnestly vulnerable, she is deeply protective of her town, its conventions and the men who inhabit it.\n\nVerity’s tense relationship with her daughter-in-law contrasts with her infatuation with her new granddaughter, and their classic dynamic is deepened by their cultural differences.\n\nRobyn Malcolm is a stand-out in The Survivors, driving the plot forward as mother, wife and protector. (Supplied: Netflix)\n\n\"As a child from an Asian background, you are never supposed to speak up against your elders,\" Ayres explains.\n\n\"So when Mia first enters the story, she is very polite … but you can see a steeliness underneath that.\"\n\nHer patience with her mother-in-law eventually dissolves into a \"rip roaring fight\" by episode four, which Ayres says was one of his personal highlights of the series.\n\nEvelyn Bay is a town that fiercely protects its own, but brutally excludes and intimidates those who don’t quite fit in.\n\nLocals are quick to blame a backpacker from South America (no-one seems to quite know which country) for the recent murder, and a tree-changer from the mainland who isn’t quite blokey enough (he wears a cardigan) is also viewed with distrust, his property vandalised.\n\nAyres says \"there's a version of Mia's role where she's a bit of a pushover\", but Yerin Ha's take on the character \"never is\". (Supplied: Netflix)\n\nWhile Ayres was cautious about \"banging the audience on the head\" with it, running through the show’s core is an undercurrent of Australian mateship and masculinity gone wrong.\n\n\"I don’t think you can make a TV series in 2025 where two young women die without in some way reflecting on the preconditions of why that happens,\" he says.\n\n\"And certainly it’s a theme that’s very resonant in Australian society: why do men commit so many acts of violence against women?\"\n\nThe impact of all this on men is explored too, as they bottle up their grief and emotion and replace it with anger, blame and violence.\n\nParticularly moving is the portrait of Kieran’s father Brian (Damien Garvey). After a full life as \"a legend\" with the \"biggest pair of balls in the bay\", Brian’s now beset with early onset dementia, and relies on his wife to be his carer.\n\nLoading YouTube content\n\nThe Survivors is full of staggeringly beautiful shots of the Tasmanian coastline, tough-talking detectives and plenty of twists and turns.\n\nBut it's also a small-scale story of grief, growth, family and relationships, as the parents of Evelyn Bay begin to ask themselves: \"Were we wrong about our sons?\"\n\n\"Why did we make them squash all those lovely kind pieces of themselves, into something that we thought they should be,\" Verity wonders in the show's finale.\n\n\"What did we turn them into?\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/nt-government-anti-discrimination-law-protections-changes/105422848",
        "title": "NT government accused of 'watering down' anti-discrimination laws",
        "publish_date": "Tue, 17 Jun 2025 01:25:50 +0000",
        "category": "finance",
        "authors": [],
        "text": "The Northern Territory government has back-pedalled on plans to scrap hate speech protections in the NT's Anti-Discrimination Act.\n\nBut the territory's anti-discrimination commissioner — whose office handles discrimination complaints — says the government's new proposal will still \"water down\" those protections.\n\nEarlier this year, the Country Liberal Party (CLP) government announced it would scrap a clause added to the act by the previous Labor government, known as the \"vilification\" clause.\n\nThat clause made it unlawful to publicly \"offend, insult, humiliate or intimidate\" another person or group because of a personal characteristic such as race, gender or sexuality.\n\nThe plan to revoke the vilification clause was supported by faith groups but has attracted outcry from LGBTQIA+ groups and anti-discrimination bodies.\n\nAt a Pride March in Darwin city on Saturday, advocates gathered outside NT parliament calling for the current anti-discrimination laws to be protected.\n\nThe NT government is planning to introduce changes to anti-discrimination laws in parliament next month. (ABC News: Lillian Rangiah)\n\nA day later, the government announced the vilification clause would be replaced, rather than removed, in response to community feedback.\n\nIn a statement, a spokesperson for Attorney-General Marie-Clare Boothby said the revised wording would prohibit conduct that \"incites hatred, serious contempt or severe ridicule\" based on a person's identity.\n\n\"The key reforms will remove unclear, vague terms introduced by Labor, such as 'offend' and 'insult' and replace them with clearer standard that focuses on real harm — consistent with frameworks already in place elsewhere in Australia,\" they said.\n\nMarie-Clare Boothby said the new bill was still being drafted. (ABC News: Chris Fitzpatrick)\n\nDuring senate estimates on Monday, NT Anti-Discrimination Commissioner Jeswynn Yogaratnam said while he had not seen a draft bill yet, he argued the vilification provisions should not be changed at all.\n\nHe said the current protections were the \"strongest we have here in Australia\".\n\n\"It's highly visionary in terms of where we're going with that reform,\" he said.\n\n\" Any other version of the vilification provision would be watering it down. \"\n\nProtesters marched through Darwin on Saturday with pride flags and signs advocating against the government's plans to walk back anti-discrimination laws. (ABC News: Lillian Rangiah)\n\nDuring estimates, Ms Boothby said the government was \"reigniting the flames of free speech\".\n\nShe argued the current wording allowed people to \"take legal action just because they found something offensive and drag you through a complaints process\".\n\nBut Mr Yogaratnam said that was not the case, because an objective legal test is applied to determine whether conduct can be considered offensive.\n\nJeswynn Yogaratnam says the CLP government's proposed changes to the Anti-Discrimination Act would be \"watering it down\". (ABC News: Pete Garnish)\n\nHe said the commission had received 46 complaints under the new vilification provision since it came into effect in mid-2023, but only three had been accepted.\n\nTop End Pride committee member and emergency doctor, Bhushan Joshi, worries the new bill will make it easier to \"willingly or knowingly in public put someone down\" on the basis of their gender, sexuality or other attributes.\n\n\"I feel … they want to clarify to make it easier to offend, insult or humiliate other people,\" he said.\n\nThe government said it had consulted a range of community groups including LGBTQIA+ groups before changing its plans for the law, but Dr Joshi questioned the scope of that consultation.\n\nBhushan Joshi says the Anti-Discrimination Act is about creating a \"fairer and just society\". (ABC News: Lillian Rangiah)\n\nHe said Top End Pride had not directly been approached for consultation, but some members had provided feedback.\n\nDr Joshi said the Anti-Discrimination Act was a better way to deal with hate speech and vilification than the criminal system.\n\n\"This is more like a mediation process — the Anti-Discrimination Commission isn't out to 'get' you, it's out to make society a fairer and just society for everybody,\" he said.\n\n\" What they often do is actually bring both parties together, work out what happened and then get a result. \"\n\nCLP to 'restore' protections for religious schools\n\n'It's about rights': Religious leader welcomes discrimination law rollback Photo shows Charles Gauci 1 A controversial anti-hate speech measure introduced by the NT's previous Labor government is set to be scrapped by the Country Liberal Party.\n\nThe previous Labor government also banned religious schools from being able to only hire staff who shared the same faith, as part of its reforms to the act in late 2022.\n\nHowever the current government has remained committed to restoring that right for religious schools, despite opposition from LGBTQIA+ groups and the NT Anti-Discrimination Commission.\n\nMs Boothby told senate estimates the new laws would allow religious schools to prioritise hiring staff of the same faith, rather than exempting schools from discriminating against other job candidates altogether.\n\n\"We promised the community we would make these changes and we are now putting in place those protections because we absolutely believe in religious freedoms,\" she said.\n\nMr Yogaratnam said the changes were \"redundant\" as religious freedoms in the workplace were already protected under other parts of the legislation.\n\nWhen contacted by the ABC, the Australian Christian Lobby's (ACL) NT representative Nicholas Lay said he could not comment as he had not seen the draft bill.\n\nThe ACL supported the CLP's previous plan to scrap the vilification clause and reintroduce religious schools' rights to only hire staff of the same faith.\n\nChanges to the Anti-Discrimination Act are set to be introduced to parliament next month and debated by the year's end.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/dr-charged-with-supplying-matthew-perry-ketamine-pleads-guilty/105425510",
        "title": "Doctor admits injecting Matthew Perry with ketamine in exchange for cash",
        "publish_date": "Tue, 17 Jun 2025 01:22:06 +0000",
        "category": "finance",
        "authors": [],
        "text": "A doctor charged with giving Matthew Perry ketamine in the month leading up to the Friends star's overdose death has agreed to plead guilty.\n\nDr Salvador Plasencia agreed to change his plea to guilty to four counts of distribution of ketamine, federal prosecutors said in a statement.\n\nThey said the plea carried a maximum sentence of 40 years in prison, and Dr Plasencia was expected to enter the plea in the coming weeks.\n\nDr Plasencia is part of a group of five people, including another doctor and an alleged drug dealer, who were charged last year over supplying the actor with the drug.\n\nPerry was found dead in his home in October 2023 and a medical examiner ruled that ketamine was the primary cause of death.\n\nHe had become addicted to intravenous ketamine while being treated for anxiety and depression at a local clinic.\n\nEach defendant, who are all currently awaiting trial or sentencing, had played a \"key role\" in his death, prosecutors allege.\n\nHere's what you need to know about the case and Dr Plascencia's alleged role in the star's death.\n\nWho is Dr Salvador Plasencia?\n\nDr Salvador Plascenica is a 42-year-old doctor in the Santa Monica area of California.\n\nHe was initially charged with one count of conspiracy to distribute ketamine, seven counts of distribution of ketamine and two counts of altering and falsifying documents or records related to the federal investigation.\n\nDr Plasencia and a woman accused of being a ketamine dealer had been the primary targets of the prosecution, after three other defendants, including another doctor, agreed to plead guilty in exchange for their cooperation.\n\nDr Plasencia is accused of providing the bulk of the ketamine to Perry in his final weeks.\n\nDr Salvador Plasencia allegedly distributed ketamine to Mr Perry and his assistant illegitimately on at least seven occasions. (LinkedIn)\n\nHe pleaded not guilty during his first court appearance and was released after posting a $US100,000 ($154,000) bond.\n\nDr Plasencia had been scheduled to go to trial in August.\n\nIn the new plea agreement, Dr Plasencia admits to injecting Perry with ketamine at the actor's home and in a Santa Monica car park in the weeks before his death, in exchange for thousands of dollars, and that it was \"not for legitimate medical purposes\".\n\nCourt documents reveal the actor began seeking more ketamine than his doctor would give him.\n\nAbout a month before the actor's death, he found Dr Plasencia, who in turn allegedly asked the other doctor, Mark Chavez, to obtain the drug for him, according to court filings in the Chavez case.\n\n\"I wonder how much this moron will pay,\" Dr Plasencia texted Chavez, according to court filings from prosecutors.\n\nThe two met up the same day in Costa Mesa, halfway between Santa Monica, California, where Dr Plasencia practised and San Diego, where Chavez practised, and exchanged at least four vials of ketamine, the filings said.\n\nAfter selling the drugs to Perry for $US4,500, Dr Plasencia allegedly asked Chavez if he could keep supplying them so they could become Perry's \"go-to,\" prosecutors said.\n\nReferred to as \"Dr P\", Dr Plascencia used encrypted messaging applications and coded language to discuss drug deals, referring to bottles of ketamine as \"Dr Pepper\", \"cans\" and \"bots\".\n\nPrior to his guilty plea, his attorney told the court Dr Plascencia \"was operating with what he thought were the best of medical intentions\".\n\nPlasencia faces up to 40 years in prison.\n\nWho else is involved?\n\nThose arrested were:\n\nKenneth Iwamasa, 59, Perry's live-in personal assistant. He is accused of sourcing ketamine for Perry and injecting him with it multiple times.\n\nMark Chavez, 54, a San Diego doctor who had operated a ketamine clinic in the past.\n\nSalvador Plasencia, 42, a physician known as \"Dr P\", who allegedly worked with Chavez to sell ketamine to Perry through his live-in assistant.\n\nJasveen Sangha, 41, dubbed the \"Ketamine Queen\" in court documents. She is accused of dealing drugs from a North Hollywood property known as the \"Sangha Stash House\".\n\nEric Fleming, 54, who authorities describe as a \"broker\" and \"street dealer\" for Sangha. He admitted in court documents to providing the batch of ketamine that killed Perry.\n\nFleming, Chavez and Iwamasa have all entered guilty pleas.\n\nNone have yet been sentenced.\n\nThe 'Sangha stash house'\n\nJavseen Sangha is scheduled to go to trial in August and is accused of being the person who supplied the fatal dose to Perry.\n\nMatthew Perry's personal assistant among five charged after actor's death Photo shows aa middle aged man with greying hair and glasses Five people, including Matthew Perry's personal assistant and an alleged Hollywood drug dealer dubbed the \"Ketamine Queen\", are arrested and charged in relation to the death of the Friends star.\n\nShe has pleaded not guilty — making her the only one of the five people charged in Perry's death who has not entered a plea agreement.\n\nProsecutors say she became known as the \"Ketamine Queen\" for allegedly selling drugs out of a North Hollywood property known as the \"Sangha Stash House\" since at least 2019.\n\nUS Attorney Martin Estrada said a police search of the home uncovered a \"drug-selling emporium\".\n\nAt the property, federal agents and detectives found about 79 vials of ketamine, approximately 1.4 kilograms of pills containing methamphetamine, cocaine and prescription drugs that appeared to be fraudulently obtained.\n\nMs Sangha is in prison awaiting trial and could face life imprisonment.\n\nABC/AP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/state-of-origin-queensland-maroons-game-two-regional-players/105420644",
        "title": "Rural players key to Queensland's State of Origin II dreams",
        "publish_date": "Tue, 17 Jun 2025 01:06:53 +0000",
        "category": "sports",
        "authors": [],
        "text": "Maroons coach Billy Slater will rely on bush battlers to keep Queensland alive in the 2025 State of Origin series.\n\nMost of the Queensland players named in the team for game two were developed in regional pathway programs and rural communities.\n\nTom Dearden is one of 14 players from regional Queensland named in the 20-man team.\n\nDearden will take on more responsibility than ever this week by replacing Daly Cherry-Evans as the Maroons starting number 7.\n\nBut his mum Andrea Dearden isn't worried.\n\nHere's what to know ahead of State of Origin II kick-off Photo shows Tom Dearden holds the ball in both hands during State of Origin I. The squads have been named, and the players are in camp as this year's second State of Origin instalment nears.\n\nShe said the Cowboys co-captain would fulfil a dream held since his Mackay junior footy days when he takes to the field on Wednesday night.\n\n\"He was always a natural little leader,\" Ms Dearden said.\n\n\"He just loved playing the game, he gave everything 100 per cent.\n\n\"It is extra pressure but Tom will do his best.\"\n\nMaroons coach Billy Slater says Queensland is yet to reach its best in 2025. (AAP: Dave Hunt)\n\nMaroons coach Billy Slater, from Innisfail himself, said every player earned their place through hard work.\n\n\"We're up against a good footy team, but I think we haven't shown our best yet,\" Slater said last week.\n\nBoosting small towns on the big stage\n\nThe central Queensland town of Charleville is dubbed Kurt's-ville when local Kurt Capewell makes the Queensland team.\n\nBut this time a large contingent of his hometown supporters will be in the stands to cheer on the Warriors second-rower.\n\nThe 31-year-old was not named for game one and had to work his way back into the side by improving his form in club games.\n\nKurt Capewell was keen on rugby league from a young age. (Supplied: Darryl Capewell)\n\nHis father Darryl said the impact was significant.\n\n\"Even though Kurt would never show it, he was bitterly disappointed not to play for Queensland in Brisbane,\" Mr Capewell said.\n\nThe family, who still live in Charleville, said the small town always got a boost when being represented on the national stage.\n\n\"It gives them another reason to watch the game, they get more involved,\" Mr Capewell said.\n\n\" The country towns, they're just so passionate. \"\n\nLong days pay off\n\nQueensland debutant Kurt Mann is achieving a State of Origin dream the 32-year-old thought might never come true.\n\nJoel Mann this week reminisced on his brother's journey from the Winton juniors to playing off the Maroons' bench.\n\n\"Mum and Dad dragged him all around central Queensland with 800, 900-kilometre round trips every Saturday,\" he said.\n\nThe Bulldogs lock is preparing to make his Queensland debut as the second oldest State of Origin player to do so.\n\nAt 32, Kurt Mann thought he may never make his Queensland debut. (Getty Images: Bradley Kanaris)\n\nHis brother said all those lengthy trips for a game of footy have finally been rewarded.\n\n\"All of the hard work that he has put in to finally make it, it's a big achievement,\" Mr Mann said.\n\n\"I wouldn't miss it for the world.\"\n\nMaroons hoping to summon spirit of Smith to square Origin Photo shows Cameron Smith hugs Cameron Munster Cameron Munster hopes to mirror his legendary former club and Maroons captain Cameron Smith as he leads Queensland out for the first time this week.\n\nQueensland Rugby League's pathways manager Glenn Ottaway said the Sunshine State always represented the regions well.\n\nBut he said in game two of the 2025 State of Origin series, kids from Winton, Charleville, and Mackay could really see themselves on the field.\n\n\"When you see these players and hear they are proud of where they came from, it becomes real,\" Mr Ottaway said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/state-of-origin-cameron-munster-smith-queensland-captaincy/105425632",
        "title": "Munster, Maroons hoping to summon the spirit of 'generational' Smith to square Origin ledger",
        "publish_date": "Tue, 17 Jun 2025 00:47:33 +0000",
        "category": "sports",
        "authors": [],
        "text": "Queensland's 16th and newest captain, Cameron Munster, wants to apply the champion attributes of the great Cameron Smith to resurrect his side's State of Origin hopes.\n\nThe Maroons play NSW in Perth on Wednesday night in Game II of the Origin series as they aim for their first win in the Western Australian capital.\n\nThey played dumb football in the 18-6 loss to the Blues at Suncorp Stadium in Game I. The Maroons were ill-disciplined, defensively fragile and lacking in a clear attacking plan.\n\nSmith, who captained the Maroons to six series wins out of seven in a stellar career, was always a step ahead of NSW in planning and performance.\n\n'Won't beat them for another 100 years': Maroons legend's dire warning after Origin I flop Photo shows Kalyn Ponga stands alongside Cameron Munster Chris Close is predicting a bloodbath if Queensland replicates its performance from the series opener when State of Origin continues this week.\n\nMunster made his Origin debut under Smith and won two NRL titles (2017 and 2020) at Melbourne when the maestro was skipper.\n\nIt is why he deferred to the retired champion when asked what kind of captain he wanted to be after becoming the new skipper in the wake of the Maroons' third consecutive Origin loss.\n\n\"I couldn't go past Cameron Smith. He led in all the right directions,\" Munster said.\n\n\"There's a reason why he's played 42 games for Queensland and I don't think anyone's ever going to beat that record.\n\n\"It's pretty special and he's a lifetime kind of generational player.\n\n\"Everyone talks about X-factor. He didn't have the X-factor but he had the capacity to be able to break teams down with his mind and his smarts.\n\n\" You don't really get those blokes in rugby league anymore. \"\n\nThe \"smarts\" Munster referred to, so typical of a Smith display, were missing in game one as the Maroons gave away penalties early, missed key tackles and did not have an attacking plan or structure to break down their opponents.\n\nCoach Billy Slater has made changes and elevated Melbourne forward Trent Loiero to the starting side after he came off the bench in Game I.\n\nLoiero has been guilty at the Storm of ill-discipline, as he was in the Magic Round loss to Canberra when giving away late penalties.\n\nTouted as an \"enforcer\", he said the Maroons must play with Smith-like smarts.\n\n\"It's a physical game. You need to be physical, but by the same token, it's not all argy-bargy,\" Loiero said.\n\nTrent Loiero will be a starter for the Maroons in Origin II after coming off the bench in the series opener. (Getty Images: Bradley Kanaris)\n\n\"You've got to be able to play with a bit of brains, and we didn't do that last game. We played a bit silly, made a few dumb mistakes and gave away a few stupid penalties. That ended up hurting us, and we've done our review and we'll be righting our wrongs.\"\n\nThat sentiment would be music to Smith's ears, so long as the Maroons follow through.\n\n\"We did our review and [Slater] was pretty stern, as he should be. We were stern with each other,\" Loiero said.\n\n\"There were a few hard conversations, as there should be after a hard loss. We've learned our lessons and we'll be looking to move forward in Game II.\n\n\"To play this game, everyone's got to have that aggression. You have to be tough to play rugby league so it's in all of us.\n\n\"But I think you've got to use it in the right way. As a team, we've got to use it in the right way together. We'll get the best out of each other if we do it together.\"\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/photographer-rob-baxter-book-of-perth-punk-new-wave-bands/105424022",
        "title": "Photographer reveals book of Perth's early 'sweaty pub rock' scene",
        "publish_date": "Tue, 17 Jun 2025 00:45:47 +0000",
        "category": "entertainment",
        "authors": [],
        "text": "It was 1976 and Rob Baxter was a photography student at Central TAFE when he began combining his love of music with his camera.\n\n\"My photos really are me walking around as a teenager and then in my early 20s … just documenting what I was into,\" Baxter told Mark Gibson on ABC Radio Perth.\n\n\"I was transfixed by New Wave and punk, which happened — really started — about '76,\" he said.\n\nThe Jim Fisher band in 1979 at the Victoria Hotel. (Supplied: Rob Baxter)\n\n\"Living in Perth and growing up in Perth, I didn't want to be here. I wanted to be in England. I wanted to be in America.\n\n\"It was, and it always is, isolated. So, I think that a lot of the inspiration came from those bands.\"\n\nRob Baxter with his self-published book of photographs. (Supplied: Rob Baxter)\n\nHe has now delved into his archives and self-published a book full of his photographs and memories of that time.\n\nSome of the band members became famous, others are now distant memories.\n\n\"In the book, it's a cross-section, a snapshot in time. It really is a snapshot of that period,\" Baxter said.\n\n\"It's biased. It is very much my favourites.\n\n\" It really does take you back to a time of sweaty pub rock. \"\n\nIn one set of images, a very young Dave Faulkner, later of Hoodoo Gurus fame, performs with his band The Victims at their final gig in 1979 at a venue called Hernando's Hideaway.\n\nThe Matt Taylor band featuring Dave Hole. (Supplied: Rob Baxter)\n\n\"The Victims were certainly one of my favourite punk bands. Probably the most famous punk band really ever to come out of Perth,\" he said.\n\n\"The very mention of Hernando's Hideaway will conjure up memories for people.\n\n\"That was a fantastic punk venue.\n\nDave Faulkner with The Victims in 1979 before he formed the Hoodoo Gurus. (Supplied: Rob Baxter)\n\n\"[The Dave Faulkner image] is one of my favourite photos.\n\n\" It's Dave Faulkner in true punk fashion with ripped up masking tape on his pants. \"\n\nPutting the book together, Baxter said he tried to focus on Perth and the story of the city's music history in the '70s and '80s, warts and all.\n\n\"It's not necessarily the most famous bands. It's the bands that wrote their own songs,\" he said.\n\n\"Independent bands who were inspired by the Sex Pistols in the UK and the American bands like Talking Heads and Blondie.\n\n\"This is very exciting for me because I finally got these photos in a book.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/state-of-origin-game-ii-kick-off-team-lists/105404122",
        "title": "Ready for State of Origin Game II? Here's what to know ahead of kick-off",
        "publish_date": "Tue, 17 Jun 2025 00:09:47 +0000",
        "category": "sports",
        "authors": [],
        "text": "The squads have been named and the players are in camp as this year's second State of Origin instalment nears.\n\nIt's a must-win game for Queensland, after a hammering on home turf saw them go down to the Blues 18-6 in Game I.\n\nHere's everything you need to know ahead of the match.\n\nWhen is State of Origin Game II?\n\nGame II of this year's State of Origin will be played on this Wednesday, June 18.\n\nHere's the exact time the game will start in each time zone:\n\n8:05pm AEST\n\n7:35pm ACST\n\n6:05pm AWST\n\nWhere is Game II being played?\n\nGame II will be played at Perth Stadium in Western Australia, making this the neutral ground match of this series.\n\nJust two State of Origin games have been played at the west coast venue, both of which have been triumphs for the Blues.\n\nIn 2019, NSW walked away with a comfortable win of 38-6.\n\nThree years later in 2022, they won 44-12.\n\nThe Blues have enjoyed strong margins at Perth Stadium. (Getty Images: Chris Hyde)\n\nWhere can I watch the match?\n\nIt's being broadcast on Channel Nine.\n\nYou'll also be able to watch it on Nine's streaming platform 9Now.\n\nBecause Nine has the exclusive rights to the matches, you won't be able to watch tonight's game on other streaming platforms like Kayo or Fox.\n\nYou can listen to coverage of the match on ABC Radio via the ABC listen app.\n\nABC Sport will live blog the match on the ABC News website.\n\nWho is playing?\n\nThe headline change ahead of Game II came from the Maroons side, with coach Billy Slater opting to drop Daly Cherry-Evans from the squad.\n\nSkipper dropped as Maroons coach makes shock Origin II calls Photo shows Daly Cherry-Evans passes the ball for Queensland during State of Origin I. Daly Cherry-Evans becomes the first Maroons captain in almost 30 years to be dropped mid-series from the Origin team.\n\nIt was the first time a Maroons captain was dropped mid-series in almost 30 years.\n\nIt means Cameron Munster will celebrate his 20th State of Origin match as Queensland's new skipper.\n\nWith Tom Dearden now at halfback, Kurt Mann will take the #14 jersey.\n\nSecond-rower Beau Fermor was also dropped, with Kurt Capewell returning to the Maroons side.\n\nFor the Blues, coach Laurie Daley elevated Max King to the starting prop position to replace an injured Mitchell Barnett, making room for Stefano Utoikamanu to come into the 17.\n\nMatt Burton, Keaon Koloamatangi and Lindsay Smith were also named on the extended bench.\n\nHere are the full squads for both sides:\n\nQueensland New South Wales Kalyn Ponga 1 Dylan Edwards Xavier Coates 2 Brian To'o Robert Toia 3 Stephen Crichton Valentine Holmes 4 Latrell Mitchell Hamiso Tabuai-Fidow 5 Zac Lomax Cameron Munster (c) 6 Mitchell Moses Tom Dearden 7 Nathan Cleary Moeaki Fotuaika 8 Max King Harry Grant 9 Reece Robson Tino Fa'asuamaleaui 10 Payne Haas Reuben Cotter 11 Liam Martin Kurt Capewell 12 Angus Crichton Trent Loiero 13 Isaah Yeo (c) Kurt Mann 14 Connor Watson Lindsay Collins 15 Spencer Leniu Jeremiah Nanai 16 Hudson Young Patrick Carrigan 17 Stefano Utoikamanu Ezra Mam 18 Matt Burton Jack Howarth 19 Keaon Koloamatangi Corey Horsburgh 20 Lindsay Smith\n\nWhen and where is Origin Game III?\n\nThe series finale will be held on Wednesday, July 9 at Stadium Australia in Sydney.\n\nWhat about the Women's State of Origin?\n\nThe series has already wrapped up.\n\nThe NSW Blues won two of the three women's matches this year. (AAP: Dan Himbrechts)\n\nNew South Wales claimed victory, having won two of the three games.\n\nHere are the scores from each match:",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/investigations-into-greyhound-racing-dehydrated-dogs-warrnambool/105421120",
        "title": "Vet finds seven greyhounds from same kennel dehydrated before race",
        "publish_date": "Mon, 16 Jun 2025 23:22:41 +0000",
        "category": "sports",
        "authors": [],
        "text": "Greyhound Racing Victoria (GRV) is investigating after seven greyhounds were removed from races in one day last week due to dehydration.\n\nAccording to steward's reports, 15 dogs were scratched from 13 races at the Warrnambool race track on Monday, June 9.\n\nGRV prevented seven of those greyhounds from racing after an on-track vet discovered symptoms of dehydration.\n\n\"GRV's Greyhound Racing Integrity and Welfare Unit has opened an investigation into the matter, which remains ongoing,\" a GRV spokesperson said.\n\nIn addition, a three-year-old greyhound suffered a foreleg fracture and was euthanased after race 13 on the same day.\n\nIt is not an offence for greyhounds to be dehydrated before racing, but an animal welfare group has raised concerns about the incident.\n\nThe scratched dogs had been due to race at Warrnambool. (ABC South West Victoria: Jean Bell)\n\n'Systemic failures'\n\nGRV confirmed all seven dogs came from the same kennel.\n\nSteve Cook from the Coalition for the Protection of Greyhounds called the situation a \"systemic failure\".\n\n\"We are questioning why a trainer would present greyhounds in that state to race,\" Mr Cook said.\n\n\"I don't expect to see this, particularly at this time of the year — I've definitely never heard of that before.\n\n\"It's very concerning for us that the industry is failing to prioritise animal welfare but yet prioritising putting those dogs forward for a race for this outdated gambling entertainment.\"\n\nMr Cook said the coalition was calling for a parliamentary inquiry into the greyhound racing industry.\n\nThe ABC has contacted Victoria's Racing Minister, Anthony Carbines, for comment.\n\n'If a dog is thirsty it's going to drink'\n\nRegional veterinarian Mark Sycamnias said seven dogs presenting with dehydration was unusual.\n\n\"If they presented at my practice you'd be asking questions,\" Mr Sycamnias said.\n\n\"Are their water bowls frozen? Do they have access to water? That's a welfare issue. It would be unusual for seven dogs to have, say, water diabetes.\"\n\nMr Sycamnias said the consequences could have been dire if the dogs had raced.\n\n\"[They could have suffered] muscle damage, severe cramps, some might even have died,\" he said.\n\n\"If a dog is thirsty it's going to drink. If it has access to water it'll drink.\n\n\" If you had an issue with a dog that isn't drinking water it might happen. Seven at once? That's pretty obscene. \"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/state-of-origin-game-two-payne-haas-on-maroons-kicking-tactic/105425452",
        "title": "'Weak' Maroons tactic leaves Blues enforcer unconcerned ahead of Origin II",
        "publish_date": "Mon, 16 Jun 2025 22:40:54 +0000",
        "category": "sports",
        "authors": [],
        "text": "Payne Haas doesn't care if Queensland avoid kicking off to him, but claims he would want to send the ball Spencer Leniu's way if the shoe was on the other foot.\n\nThe kick-off debate remains an unlikely talking point one day out from State of Origin II, after the Maroons refused to kick in Leniu's direction in game one.\n\nHaas was inadvertently brought into the debate last week, when Angus Crichton claimed he knew of predetermined Maroons plans to stop Haas and Leniu taking the first hit ups.\n\nABC Sport will have live blog coverage of the State of Origin series.\n\nOf the four long kick-offs from Queensland in the series opener, the first two went left towards Mitch Barnett before the next two went right for Max King to return the ball.\n\nThe situation left Leniu fuming, with the Sydney Roosters firebrand appearing to swear in frustration as the Maroons changed the direction of their kick to avoid him.\n\nHaas remains unfazed by the matter, while admitting having the chance to take the first carry remained one of the highlights of Origin.\n\n\"It's cool. It's an adrenaline rush,\" Haas said at Blues training in Perth.\n\nMaroons legend's dire warning after Origin I flop Photo shows Kalyn Ponga stands alongside Cameron Munster Chris Close is predicting a bloodbath if Queensland replicates its performance from the series opener when State of Origin continues this week.\n\n\"It's what you live for. You watch those first carries in Origin, your Mark O'Meleys and all those guys.\n\n\"It's something you dream about as a kid, especially playing prop. It's always cool.\n\n\"But I'm not really worried about what their tactics are. I'm just worried about our performance and what we are going to do.\"\n\nFormer NSW front-rower Willie Mason accused the Maroons of being \"s**t scared\" of Leniu after not kicking to him in Origin I, while Braith Anasta labelled Queensland \"weak\".\n\nThe kick-off situation has become something of a running joke when mentioned to NSW players, given the way it has blown up and how much it infuriated Leniu.\n\nBut Haas said if there was a similar player to Leniu on the Maroons' team, he would want the ball kicked off to him in order to have the chance to take the rival firebrand down in their first hit-up.\n\n\"Personally I would,\" Haas said.\n\n\"But I'm not sure what Queensland's tactics are. I'm not really fussed about it, I don't think it's such a big deal.\"\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/mackay-farewells-steam-locomotive-restored-by-volunteers/105421558",
        "title": "After 50 years this Queensland-designed steam train is back on the rails",
        "publish_date": "Mon, 16 Jun 2025 22:36:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "One of Queensland's last locally designed steam trains is on the rails in the Darling Downs, after more than 50 years.\n\nBut after decades of work by volunteers in Mackay, the locomotive loss has been \"bittersweet\" for those who gave up their weekends and holidays to restore it.\n\nSonia Ford, whose husband Peter founded Mackay Heritage Railway (MHR) in 1995, said the decision to send the train south was difficult.\n\n\"I did not want it just sitting in out in a paddock somewhere, just rusting away after all the work that had been done over the years,\" Ms Ford said.\n\n\"It was just something I couldn't see, [the train] deteriorating.\"\n\nThe BB18 1/4 1037 locomotive ran services across the Queensland Rail network before being retired in Mackay. (Supplied: Sonia Ford)\n\nThe Queensland-designed BB18 1/4 (one quarter) class locomotive, numbered 1037, was one of the last steam trains to ever run on the state's network, retiring in March 1970 in Mackay.\n\nAfter sitting in a suburban park for 30 years, the train was donated to MHR, with early newsletters detailing plans to have it running by 2000.\n\nHaving incorporated in 1995, Mackay Heritage Railway originally aimed to be on the rails within a decade. (ABC Tropical North: Liam O'Connell)\n\nA frustrated dream\n\nThe 1037 was moved to a siding at Mackay Harbour, with a shed built around it.\n\nA scrapbook compiled by the Fords show the project received grant funding support from the federal government.\n\nThe 1037 locomotive had sat in a park in Mackay for 30 years, and required significant work. (Supplied: Sonia Ford)\n\nMs Ford said the project became like a second full-time job for Peter and many group members.\n\n\"If he wasn't here, it was doing trips away, looking for parts or getting information,\" she said.\n\nBut as the years went on, Ms Ford said there was \"a lot of frustration\" about the length of the job.\n\n\"A lot of guys got very angry, but it's just something we couldn't control,\" she said.\n\nMackay Heritage Railway operations manager Brett Williams said while some volunteers turned up and offered to do basic tasks, few could contribute financially.\n\n\"The reality with the group, with all heritage groups, is money and people,\" he said.\n\nAnd few had the expertise to re-engineer a steam engine.\n\n\"There was a certain section of the boiler that wasted away, but for the most part, all the major fundamental components are still original purely because of cost involved,\" Mr Williams said.\n\nVolunteers in Mackay, including Mr Ford (top right), worked on the 1037 locomotive for more than 20 years. (Supplied: Sonia Ford)\n\nAfter nearly two decades, the Port of Mackay asked the group to relocate, and in 2019, the move began to a site near the city's main railway station in Paget, about 10 kilometres away.\n\nAround that time many of the group's original members, including Peter Ford, died.\n\nWith higher overheads at the new yard, and with dwindling expertise, Mr Williams was concerned the group would end up with debts it could not pay.\n\n\"We'd end up having to more or less scrap the equipment to cover those costs,\" he said.\n\n\"We didn't want to do that.\"\n\nOn the rails\n\nThe loco 1037 being lifted into workshops at DownsSteam, as a man pretends to hold it up. (Supplied: Andrew Caldwell)\n\nNearly 1,000km south in Toowoomba, a railway heritage group received a call from Mr Williams.\n\nVolunteer-run DownsSteam had been restoring its own locomotive since 2001 and had progressed to running tours and day trips around Toowoomba.\n\nDownsSteam's operations manager Andrew Caldwell said they jumped at the opportunity to finish the work Mackay started, buying the locomotive for a dollar.\n\nA lot of \"tedious pipe work\" was required to finally restore the 1037 locomotive. (Supplied: Andrew Caldwell)\n\n\"There was still a fair bit of boiler work that had to be done. A lot of tedious pipe work and fittings and alignments,\" Mr Caldwell said.\n\nWithin 18 months, it was ready to run on the main line.\n\nMs Ford and her family were invited for the first running of the locomotive, newly christened \"Peter Ford\", in July last year.\n\n\"It was a very emotional time,\" she said.\n\n\"It was just a dream that I saw, a dream that Peter had. It was running. It was being used.\"\n\nSonia Ford says her husband Peter's dream was to have steam train trips running from Mackay. (ABC Tropical North: Liam O'Connell)\n\nFor Mr Caldwell, paying tribute to Mr Ford's legacy on Queensland railways was an important part of the final restoration.\n\n\"He was instrumental in heritage rail operations and he had a huge depth of knowledge,\" he said.\n\nMr Williams said he too had an opportunity to ride the train and has encouraged other former MHR volunteers to do the same.\n\n\"There's a little bit of bitterness obviously, because so much work and effort was done by the Mackay team to get it where it's at,\" he said.\n\n\" There's no resentment because what those guys did with it is phenomenal. \"\n\nThe 1037 locomotive and DownsSteam's C16-106 are running tourist trips across the Darling Downs. (Supplied: DownsSteam)\n\nMHR is now in the process of gifting its remaining locomotive, the BB18 1/4 1086 from Emerald, to DownsSteam as well, something they never intended to do.\n\n\"I've said to them [DownsSteam] a few times I think they're crazy, because it's a hell of a lot of work,\" Mr Williams said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/woodside-north-west-shelf-extension-new-legal-challenge/105422166",
        "title": "Fresh legal challenge launched against Woodside's North West Shelf extension",
        "publish_date": "Mon, 16 Jun 2025 22:22:30 +0000",
        "category": "finance",
        "authors": [],
        "text": "Yet another legal challenge has been lodged against a contentious gas plant extension in WA's north, arguing the state's previous environment minister failed to properly consider the emissions produced by customers burning gas produced at the facility.\n\nThe North West Shelf project has been processing LNG since the 1980s but needed fresh approvals from the state and federal governments to continue beyond 2030.\n\nThen-WA environment minister Reece Whitby completed a six-year-long state approvals process in December last year when he approved the project with a range of conditions.\n\nWoodside processes gas at its Karratha Gas Plant as part of the North West Shelf project. (ABC News: Charlie McLean)\n\nWhile federal environment minister Murray Watt is now considering the conditions the Commonwealth will impose, the Friends of Australian Rock Art group last week lodged an application in the WA Supreme Court, seeking judicial review of the state approval.\n\nA statement by the group said it would argue Mr Whitby did not follow the state's Environmental Protection Act because the assessment his decision was based on \"failed to consider the impact of climate change that would result from the project\", including scope three emissions.\n\nReece Whitby, then WA's environment minister, approved the project with conditions last December. (ABC News: Blake Kagi)\n\nScope three emissions occur as a consequence of a project, but from sources not owned or controlled by the owner of the project — for example, from a customer burning LNG processed at a particular plant.\n\nWhat Murray Watt's decision means for Woodside's WA operations Photo shows Close up of a collection of jagged red rocks. In the background, two towers spitting flames. The federal government has green lighted the extension of Woodside's Karratha Gas Plant — this is what you need to know.\n\nAnalysis by climate science policy institute Climate Analytics released this month estimated about 87 per cent of emissions linked to the North West Shelf between 2024 and 2050 were scope three.\n\nWoodside has promised its operations will be net zero by 2050, and argues its gas is necessary for WA and other countries to transition away from coal — a claim doubted by some experts.\n\nFinal decision pending\n\nThe application could represent yet another legal hurdle for the project.\n\nMr Watt is yet to make a final decision, having given Woodside more time to respond to the conditions he is considering imposing.\n\nFederal Environment Minister Murray Watt is awaiting Woodside's response. (ABC News: Keane Bourke)\n\nTraditional owner Raelene Cooper said Mr Watt had promised to give her three business days' notice before making a decision, which could allow her to seek an injunction, further delaying his decision.\n\nIf ultimately granted, those approvals would allow Woodside to go through the separate process of getting approvals to extract gas from the Browse Basin, one of the country's largest untapped resources.\n\nWhile Woodside and both levels of government see those plans as a boost to the WA economy and jobs, climate activists have long argued against the project and what its emissions will mean for a world trying to reach net zero by 2050.\n\n'Fundamental omission'\n\nFriends of Australian Rock Art co-convenor Judith Hugo said the application was brought because of concerns about the impact of emissions linked to the project on the world's climate, and on rock art at Murujuga.\n\nThose petroglyphs are approximately 40,000 years old and are being closely studied to assess whether or not nearby industry, including the North West Shelf, is impacting on their condition.\n\nTraditional owners to keep fighting North West Shelf extension Photo shows A rock carving of an lizard on red rocks Traditional owners have pledged to continue fighting the decision to extend the North West Shelf gas plant, as environmentalists shift their focus to Woodside's next major project.\n\n\"The North West Shelf Extension will cause pollution equal to 12 coal-fired power stations every year until 2070, however the vast majority of these emissions were ignored by the WA Minister in approving the proposal,\" Ms Hugo said in a statement, referring to scope three emissions.\n\n\"Our case aims to require the government to rectify this fundamental omission, so that the impacts of Woodside's carbon pollution can be understood.\n\n\"We have consistently raised concerns regarding sea level rise, increased wildfires, extreme heat and flooding and coastal erosion on the heritage landscape.\n\n\"We have also raised concerns about the ongoing use and enjoyment of this landscape by custodians practising cultural traditions, and by researchers and visitors in a heating climate.\n\n\" None of these impacts were assessed or considered by the [environment minister]. \"\n\nThe extension granted to Woodside's North West Shelf project has been controversial. (ABC News: Lauren Smith)\n\nA spokesperson for current WA Environment Minister Matthew Swinbourn said as the matter was before the courts, it was inappropriate for him to comment.\n\nA Woodside spokesperson said the company was aware of the case.\n\n\"We have confidence in the robustness of the state government's comprehensive approval process,\" the spokesperson said in a statement.\n\nLast week Woodside said it recognised the importance of the Commonwealth's proposed environmental approval conditions, \"including cultural heritage management and air quality\".\n\nScope three emissions 'impossible' to account for\n\nTom Hatton, who chaired WA's Environmental Protection Authority between 2014 and 2020, said he never saw it as the agency's role to regulate scope three emissions.\n\n\"For exported gas, those scope three emissions happen in jurisdictions outside of Australia, so it was never considered something that the state government, on advice from the EPA, would ever feel that they should condition, or put any conditions, on,\" he said.\n\nDr Tom Hatton does not believe it is feasible to account for scope three emissions in the analysis of a project. (ABC News: Jake Carmody)\n\nWhile Dr Hatton said it \"remains to be seen\" whether scope one or two emissions, produced directly by projects, were best regulated by state or federal governments, he remained firm on his view on scope three even after leaving the regulator.\n\nWoodside approval paves the way for the mother of all climate battles Photo shows Woodside future - North Rankin When all the hype and the fury are stripped away, the decision to extend the life of the gigantic North West Shelf LNG plant boils down to one thing — enabling the Browse gas project off the Kimberley coast.\n\n\"It would be so impossible, I think, for Australia to account for the scope three emissions for any of its exports, whether it's gas or anything else,\" he said.\n\n\"It would be a confusing international analysis, international arrangement, for Australia to do that.\"\n\nCurtin University sustainability professor and Intergovernmental Panel on Climate Change report author Peter Newman said addressing global warming needed to be seen as a partnership.\n\n\"This process of being serious about climate change is not just a matter of who's really responsible for this and who's not, it is a matter of fixing it,\" he said.\n\nCurtin University Professor Peter Newman says action needs to be taken now on tackling climate change. (ABC News: Briana Shepherd)\n\n\"And we have to get serious about fixing it otherwise we're not going to solve this problem and the temperatures are going to get so bad that all of our economies are going to struggle and so many millions of people will be dying from it.\n\n\"Some part of government needs to take hold of that and run with it and the EPA is as good a place as any.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/outback-burketown-indigenous-tourism-welcomes-open-roads/105412690",
        "title": "Morning glory in the outback shining on for Indigenous tourism boom",
        "publish_date": "Mon, 16 Jun 2025 21:53:51 +0000",
        "category": "finance",
        "authors": [],
        "text": "There is a part of the world where sprawling red plains neighbour waterfalls surrounded by lush, green bushland and morning glory clouds sweep across a seemingly infinite sky.\n\nTucked away in the Gulf of Carpentaria there are many drawcards for tourists across the globe.\n\nBut the region, which takes in the community of Burketown, has been rocked in recent years by back-to-back flooding events and COVID-19 isolation wreaking havoc on its tourism industry.\n\nNow, an Indigenous-owned business operated by the Gangalidda and Garawa people is working to break through the adversity and make their home a must visit destination again.\n\nYagurli Tours' hot air balloon flights include rangers sharing their cultural knowledge of salt pans and river systems. (Supplied: Ain Raadik)\n\nLurick Sowden manages Yagurli Tours, one of the first entirely Indigenous-run tourism businesses in the Gulf.\n\nWhile top tourist rankings are subjective, Mr Sowden said visiting global pilots equate Burketown to one of the most scenic hot air balloon destinations in the world after Switzerland and Japan.\n\n\"We take them out onto Australia's largest aggregate of salt pan, which everyone drives past. They might not even know it's here,\" he said.\n\n\"It's very, very special.\"\n\nWeathering the storm\n\nIt has not been all clear blue skies for the tourism operation.\n\nMr Sowden said there had been \"two standard years\" since the business opened in 2016.\n\nThe rest were littered with struggle.\n\nSunrises, like this one captured during a trial balloon flight, would be a major tourist drawcard. (Supplied: Murrandoo Yanner)\n\nIn early 2023 the Gulf endured its largest flood in a decade, isolating the region for more than three months before ex-tropical cyclone Kirrily barrelled through less than 12 months later with further flooding.\n\n\"At the moment the roads are all open, Burketown is accessible,\" Mr Sowden said.\n\n\" Prior to that, the last few years, have not been so great. \"\n\nThe rare morning glory cloud is a specific type of roll cloud that appears in the Burketown area. (Supplied: Mike Zupanc)\n\nOutback Queensland is a road-heavy tourist area — rail lines are virtually non-existent, and expensive flights are few and far between.\n\nAs the regions rely on visiting grey nomads and caravan travellers alike, having accessible and open roads is key for tourism to flourish.\n\n\"We're kind of back on track for just a normal year. Everything's kind of settled down and we're ready to go,\" Mr Sowden said.\n\nYagurli Tours co-founder and community leader Murrandoo Yanner looks out from a hot air balloon over Burketown. (Supplied: Murrandoo Yanner)\n\nWith almost 100 more visitors than last year, Mr Sowden hopes 2025 is the year things are turned around.\n\n\"We should be in for a big year and a lot more people travelling around,\" he said.\n\nWide open roads\n\nIt is not just this pocket of Queensland feeling the pinch.\n\nOutback Queensland Tourism Association (OQTA) chief executive Denise Brown said the domestic tourist season had been slow off the mark across the state in 2025, with regional and rural regions bearing the brunt.\n\nIn the OQTA's most recent annual report, operators reported the slowest start to the tourism season in four years with numbers down by 20 to 30 per cent compared to 2023.\n\nYagurli Tours is an Indigenous-owned business operated by the Gangalidda and Garawa Peoples in Burketown. (Facebook: Yagurli Tours)\n\nBut it is not all doom and gloom.\n\nWhile recent devastating western Queensland floods stopped travellers heading north in their tracks, roads have begun to reopen.\n\nIn tandem, visitor numbers across May and June have picked up.\n\n\"Certainly, our challenges are always to have access, and our number one access is roads,\" Ms Brown said.\n\n\" A number of people [across Australia] are really keen to get to the tip, and when those roads start to open up and it's safe to travel they come up the inland highway or through the back country. \"\n\nDenise Brown says roads in outback Queensland are essential for tourism. (Supplied: Denise Brown)\n\nMs Brown said OQTA was working alongside tourism advocates and governments to show the country why they should trek to the outback.\n\n\"The areas that we're focusing on is the colours of the beautiful landscapes, the green rolling carpet and the bird life,\" she said.\n\nWhile weather events might have washed away some of the country, Ms Brown said outback residents were as resilient as the landscapes and wanted to showcase their part of the world.\n\n\"Indigenous tourism is really important to the whole of Queensland and that's certainly a pillar,\" she said.\n\n\"Out of disaster comes amazing opportunities, the rebirthing of nature.\n\n\"That is the opportunity to see the outback as you'll never see in the next 10 years.\"",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/asx-markets-business-live-news-jun-17-2025/105425356",
        "title": "Live: Oil prices up on fresh tensions in Israel–Iran conflict",
        "publish_date": "Mon, 16 Jun 2025 21:53:25 +0000",
        "category": "finance",
        "authors": [
            "Daniel Ziffer",
            "Gareth Hutchens",
            "Emily Stewart"
        ],
        "text": "Big kerfuffle today in a larger fight about WFH.\n\nWork from home has always been a part of the economy, but for desk-bound workers it was always a tiny element of the overall picture.\n\nPre-COVID it was considered a rare perk — something enjoyed by a small number of senior, important or remote experts, occasionally extended to someone waiting for a couch to be delivered.\n\nBut the overnight realignment of work — for the 35-40% of workers who have some ability to work remotely — has radically altered how millions of Australians get things done.\n\nA big case has been brewing around the \"Clerks Award\", a document that covers a lot of workers and is set to make determinations about what is and isn't acceptable — potentially affecting huge swathes of the workforce.\n\nThat's just the primer — here's what's happened today.\n\nEwin Hannan in The Australian has revealed confidential proposals from employer lobby group Ai Group that would \"trade off\" the working from home clause.\n\nThe article suggests the offer to the Fair Work Commission is that in return for employees working remotely, people in the clerks award could lose key entitlements like overtime, penalty rates and meal breaks.\n\nThe Ai Group makes the point the discussions are run by the commission and are \"confidential and without prejudice\" to see whether a consensus can be reached\n\n\"It would be highly inappropriate for any party to comment on or otherwise disclose the content of discussions or developments that have occurred in the context of those proceedings. To do so would be a clear and deliberate breach of faith.\"\n\nBut journos be journo-ing, so based on the documents plastered in the newspaper they do go on to explain their position.\n\n\"We will advance a proposal in response to the Commission initiated proceedings that would make it easier for employers and employees to adopt working from home arrangements that suit their circumstances. The potential development of such a term is the purpose of the proceedings. \"We have previously identified a range of ways in which the award is operating as a barrier to employers agreeing to reasonable working from home arrangements. The reality is that in many respects the award is completely out of step with the realities of both current working practices and the desired level of flexibility that many employees want in order to help them balance their work and personal commitments. It was written at a time that assumed that employees were, by and large, still working from their employer’s office or premises and has failed to evolve to reflect the seismic shift in employee working practices and preferences that have evolved since the pandemic. \"It must also be recalled that the reason these issues came to the Commission’s attention was the conduct of a review of modern awards recently undertaken by the Commission at the request of the former Workplace Relations Minister, Tony Bourke. The union’s ridiculous attempt to demonise industry efforts to assist the Commission to develop a term that it has indicated should potentially be inserted into awards, and to characterise them as a ‘dummy spit’, is frankly bizarre and predictably unproductive. \"The last election demonstrated the importance people place on working from home. We know that accommodating this, when they can, is also important to many employers. Sadly, some in the union movement seem determined to cling to the notoriously complex web of outdated workplace laws that work against the interests of workers, instead of constructively and cooperatively exploring how regulation of working arrangements can be genuinely modernised in way that is both fair and flexible for all parties.\"\n\nMore to come.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/tasmania-disability-equipment-second-hand-expensive/105359218",
        "title": "Tip shop makes change after parents upset at 'unfair' prices for specialist items",
        "publish_date": "Mon, 16 Jun 2025 21:50:55 +0000",
        "category": "finance",
        "authors": [],
        "text": "When Bridget Lockley and her partner saw their local tip shop selling an adaptive children's bike, what could have been an opportunity instead left them outraged.\n\nThe bike was priced at $500.\n\nThe same store was also selling a children's high-low chair without cushions for $1,500.\n\nThe high-low chair which helps disabled children to participate in different activities, was missing cushions and priced at $1,500. (Supplied: Bridget Lockley)\n\nMs Lockley said bikes for those without adaptive needs were typically about $25 at the store.\n\n\"I went through lots of different emotions. I was angry, but then also a bit sad,\" she said.\n\nOne of Ms Lockley's daughters has a rare gene change causing multiple diagnoses.\n\nShe said her daughter requires a lot of different equipment, listing a walking frame, adapted bike, specialised seating, self-care equipment, standing frame, change table, shower equipment and a high-low bed as some of the items needed.\n\nWhile she said navigating the National Disability Insurance Scheme (NDIS) could be \"stressful\", it had helped her family overcome barriers by covering expenses and providing essential supports.\n\nThe Lockley family don't want their daughter Rosie to feel her needs are 'less valued' than other children. (ABC News: Luke Bowden)\n\nPrior to the NDIS, equipment could be accessed locally through TasEquip's loan system, but this changed when the NDIS began and took over government disability funding.\n\nMs Lockley felt things were easier with TasEquip, saying they often deal with lengthy processes involving a range of trials, assessments and reports.\n\nHer friend, Lauren Miller, agreed, saying it took nearly two years to receive a powered wheelchair for her daughter, and while she began the application process in advance — it still became \"urgent\" as her daughter grew out of her existing wheelchair.\n\nMs Lockley said stores like the tip shop could help fill a role — especially for those families currently going without the support of the NDIS.\n\nBut she is worried the pricing of specialist items as if they were \"luxury goods\" is sending the wrong message to the community.\n\nIf her own daughter saw the $500 price tag of the bike, Ms Lockley said \"it could make her feel like her needs are less valued than her sisters'\".\n\nLauren Miller says her family waited nearly two years for a powered wheelchair, during which her daughter grew out of her current one. (ABC News: Madeleine Rojahn)\n\nMs Miller and Ms Lockley are among parents who also disagree with supports usually covered by the NDIS being onsold without proper understanding of the items.\n\n\"Pricing them so highly puts them completely out of reach for the very families who rely on community resources like [the tip] shop to bridge critical gaps in access and funding.\"\n\n\"These are not luxury goods. They are vital supports funded by the NDIS that help disabled children participate in daily life with comfort, dignity and inclusion,\" she said.\n\nThe family is among those wanting an attitude-shift to non-disability-specific stores selling equipment for adaptive needs. (ABC News: Luke Bowden)\n\nTip-shop makes change\n\nMs Lockley wrote to the tip shop to voice her concerns and said a positive outcome followed.\n\nBelinda Hazel, from Hobart's Mornington Park Waste Transfer Station, which was selling the bike and high-low chair, said \"it certainly wasn't intentional\" and her team had gone through normal pricing processes but were unaware of the extra considerations for disability equipment.\n\n\"When we get different types of items in, we do research to see what those items may be priced on the second-hand market,\" Ms Hazel said.\n\n\" So I can understand somebody who might be in the disability sector or understands how much those items are new and through an NDIS pathway — that they may feel aggrieved about that. \"\n\nParents say the bike was not fairly priced and sent a disheartening message to families and children. (Supplied: Bridget Lockley)\n\nMs Hazel said she contacted a local disability service provider and ended up donating the equipment, saying this would be the process from now.\n\nThe provider would also assess the item for safety and quality.\n\n\"If we ever get an item like that coming in, we'll reach out to that service provider and have them come up [to the store], and if it's something that a client could use, then they will take that item.\n\n\"And if it's something that they're not able to use, then they will work with us to price that accordingly to what they think would be meeting a client's expectations.\"\n\nFor Ms Lockley, it's a welcome outcome.\n\n\"It shows a growing understanding and compassion around the value of these items and the importance of treating them with dignity,\" she said.\n\nSpecialised items allow children to participate in general life. (ABC News: Luke Bowden)\n\nConcerns over lack of safety checks\n\nAssistive Technologies Suppliers Australia, which represents suppliers and advocates for better access, said the Therapeutic Goods Administration regulated some disability equipment.\n\n\"Having the TGA ensure that equipment that's coming in is tested is ensured that it's OK safety-wise, that it's actually running at the right speeds, means that everyone is safe when they're using that equipment,\" Serena Ovens, the industry body's chief executive said.\n\nBut she said while there were \"reasonable marketplaces out there\", buying equipment from \"de-regulated\" markets wasn't without risk.\n\n\"People could be being sold something that is not appropriate for use, that possibly hasn't been tested for them to ensure that they even fit the device, that it's safe for them, that it's not actually going to cause more damage.\"\n\nExpert Tammy Milne wants better standards for disability equipment, along with checks and safety guarantees. (ABC News: Luke Bowden)\n\nTammy Milne, director of Physical Disability Australia and Disability Voices, said safety and quality was not guaranteed on disability equipment sold outside the NDIS or other disability-tailored outlets.\n\n\"In my opinion, tip shops and charity shops should not be selling the stuff at all,\" she said.\n\n\"Who tests them for workability and safety?\" she questioned.\n\nToy library matches the right play equipment for kids of all abilities Photo shows Three boys and a woman riding bikes, scooters and walking along a path From bikes to racing frames, trucks and dolls, this toy library caters to all children.\n\nAlong with Ms Milne, they called for the return of a hire system like TasEquip, which they could use for urgent equipment needs and also selling or donating their own items once they were no longer needed.\n\nThe National Disability Insurance Agency said there has been \"considerable progress over the past years in reducing wait times for participants, even as the NDIS continues to grow\".\n\n\"The Agency has implemented several new processes to improve the participant experience for those with Assistive Technology (AT) needs, including improving quick access to low and mid-cost AT,\" a spokesperson said.",
        "source": "ABC"
    },
    {
        "url": "https://www.abc.net.au/news/2025-06-17/tennis-chris-o-connell-alex-bolt-lose-at-queens/105425226",
        "title": "Aussie loses at Queens after having just hours to prepare for clash with Danish star",
        "publish_date": "Mon, 16 Jun 2025 21:45:19 +0000",
        "category": "sports",
        "authors": [],
        "text": "The first wave of Australia's Queen's Club contingent has made little impact on the prestigious Wimbledon warm-up, with Alex Bolt and Chris O'Connell both dispatched in the first round without winning a set.\n\nGiven their opposition, that was little surprise, though in the nascent grass court season, they did have the advantage of having spent time on the turf after playing in qualifying.\n\nBolt, up against the up-and-coming Scot Jacob Fearnley, went down 6-2, 6-4 .\n\nThe South Australian, wearing a lot of strapping on his right knee but moving well enough, was broken early and late in the first set, but moved comfortably to 4-4 in the second.\n\nBut Bolt, watched by his partner, British player Katie Swan, then dropped the first point on serve. Suddenly, the pressure rose and Fearnley broke. Bolt battled hard to lead 15-0 and 30-15 but could not force a break-back point and the British number two served out.\n\nEarlier on Monday, O'Connell, who had been beaten by Bolt in the second round of qualifying on Sunday, found himself facing fourth seed Holger Rune as a lucky loser.\n\nGiven less than 3 hours' notice after Matteo Arnaldi withdrew with an ankle injury, O'Connell began well, forcing a break opportunity in the third game.\n\nHe failed to take it, however, and the Dane, playing his first game of the year on grass, then settled.\n\nO'Connell was still very much in the game when serving at 3-4, but within the blink of an eye the first set was gone 6-3.\n\nRune, currently ranked ninth in the world, broke again midway through the second set and took it 6-4.\n\nBritish wildcard veteran Dan Evans, now 35 and ranked a lowly 199, delighted a crowd basking in unusually hot London sunshine with a boilover 7-5, 6-2 victory against seventh seed Frances Tiafoe.\n\nBut British number three Cameron Norrie, a former finalist, lost to Czech teenager Jakub Mensik 7-6 (8-6), 1-6, 6-1.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\nRoberto Bautista Agut saved a match point before beating Portugal's Nuno Borges 6-7 (8-6), 7-5, 6-4, the Spaniard winning five straight games after trailing 4-1 in the second set.\n\nOn Wednesday morning (AEST), Alex de Minaur opens play at midday local time on Andy Murray Arena in his first match since crashing out of Roland-Garros feeling burned-out mentally and drained physically. Seeded five, he faces Jiri Lehecka.\n\nThe Czech, ranked 30, is a potentially tricky opponent. De Minaur, who slipped to 12 in the rankings updated yesterday, having not defended his title at Rosmalen last week, won their previous meeting, indoors in the 2023 Davis Cup, but Lehecka KO'd two top-20 players on grass on his last Wimbledon visit, in 2023.\n\nAt the same time on court 5, Alexei Popyrin, now ranked at a career-high 21, plays Aleksandar Vukic in an all-Aussie affair while Jordan Thompson goes later against Jaume Munar.\n\nIn Nottingham, James McCabe, having come through qualifying, faced British wildcard George Loffhagen in a repeat of their final at the same venue on the lowest-tier world tennis tour last year.\n\nMcCabe won that one 6-0, 6-1 and it was the same result at Challenger level, albeit much closer, as the Australian won 6-3, 7-6 (7-4).\n\nAAP",
        "source": "ABC"
    },
    {
        "url": "https://www.smh.com.au/goodfood/recipes/adam-liaw-s-salt-and-pepper-chicken-noodles-20250617-p5m81c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s salt and pepper chicken noodles",
        "publish_date": "Tue, 17 Jun 2025 12:03:20 +1000",
        "category": "lifestyle",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Step 1 Combine the chicken with the bicarbonate of soda and sesame oil and season well with salt. Set aside while you prepare the rest of the ingredients.\n\nStep 2 Heat your wok over high heat. Add the oil and fry the chicken for a few minutes until browned, then add the garlic and the white part of the spring onions. Fry for another minute until fragrant. Add the cabbage and toss for 2-3 minutes until the cabbage is wilted.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/based-on-a-twisty-ya-bestseller-this-thriller-feels-like-a-teenage-succession-20250616-p5m7tt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Based on a twisty YA bestseller, this thriller feels like a teenage Succession",
        "publish_date": "Tue, 17 Jun 2025 12:01:00 +1000",
        "category": "finance",
        "authors": [
            "Kylie Northover"
        ],
        "text": "It centres on the obscenely wealthy Sinclair family, the head of which, Harris, is a Murdoch-style media mogul with very “traditional” (read: sexist, racist) American values. The Sinclairs spend their summers on their private island near Martha’s Vineyard, where Harris (David Morse) and his wife Tipper (Wendy Crewson) live in the main mansion, and have built slightly less ostentatious mansions for their three daughters, Carrie (Meryl Streep’s daughter Mamie Gummer), Penny (Caitlin FitzGerald) and Bess (Candice King).\n\nSo Amazon Prime Video’s eight-part adaptation is hotly anticipated, even by the millions who know the secret at the story’s heart.\n\nWhen E. Lockhart’s YA novel We Were Liars was published in 2014, it was huge, spending 40 weeks on the New York Times Young Adult bestseller list. Then, in 2021, the twisty novel had an unexpected surge in sales (now about 3 million copies) when it trended on BookTok , with readers sharing themselves becoming emotional over the book’s ending.\n\nThe “liars” of the title are the children of the daughters – cousins Cadence (Emily Alyn Lind), troublemaker Johnny (Australian Joseph Zada, who has just been cast in the new Hunger Games movie) and the misunderstood Mirren (Esther McGregor, daughter of actor Ewan) – and Gat (Shubham Maheshwari), whose uncle Ed (Rahul Kohli), is partnered with Johnny’s mum, and who is the only person, staff aside, who isn’t blond-haired and blue-eyed. The quartet spends blissful summers on the island (along with Mirren’s twin sisters and Johnny’s younger brother, collectively known as “the littles”), before everything changes.\n\nThe outrageously wealthy Sinclair family on their private island, dressed for the annual “lemon hunt” in co-ordinated attire.\n\nBut even during the summer before that, the liars, by that time all about 17, have come to realise that private islands, a staff of dozens, including a tennis coach and someone whose sole job is delivering lobsters, is not representative of most people’s lives. They’re also growing increasingly aware of the Sinclair family dysfunction; a Sinclair, Cadence is often told, does not show grief or sadness. There are certain expectations for such American “royalty”. Then there are the bizarre family traditions, in which Harris is referred to as The King, with special menus and co-ordinated clothing that are designed to foster competitiveness.\n\nThe series opens with Cadence telling us in voiceover that “something terrible happened last summer, and I have no memory of what, or who hurt me”. While we are shown much of the summer before this incident as flashback, we also see Cadence in the present-day living with a brain injury and a trauma-induced amnesia (best not to fact-check the frequent medical explanations), desperate to remember.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/deadly-rat-lungworm-on-the-rise-in-sydney-experts-warn-20250617-p5m802.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Deadly ‘rat lungworm’ on the rise in Sydney, experts warn",
        "publish_date": "Tue, 17 Jun 2025 11:58:37 +1000",
        "category": "lifestyle",
        "authors": [
            "Angus Dalton"
        ],
        "text": "Infections by a parasitic worm carried by rats, snails and slugs that can cause lethal brain infections in humans are increasing in dogs on Australia’s east coast, a Sydney study has found.\n\nRat lungworm is an extremely rare but potentially fatal disease caused by larvae of the parasite Angiostrongylus cantonensis, which is found naturally in feral rats after it spread to Australia from South-East Asia. Infection causes dangerous inflammation in the brain.\n\nAdult rat lungworms. Credit: University of Sydney\n\n“In dogs and humans the parasite enters the brain, but rather than progressing to the lungs like it does in rats, it is killed in the brain by our own immune response,” said Phoebe Rivory, who has submitted her PhD thesis on the disease to the Sydney School of Veterinary Science.\n\n“It is that overt immune response that causes severe headaches and sensations.”",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/politics/victoria/council-overcharged-up-to-14m-in-parking-fines-for-a-decade-here-s-how-to-get-your-money-back-20250617-p5m811.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Council overcharged up to $12.4m in parking fines for a decade. Here’s how to get your money back",
        "publish_date": "Tue, 17 Jun 2025 11:51:06 +1000",
        "category": "finance",
        "authors": [
            "Kieran Rooney"
        ],
        "text": "An inner-city council will partially refund thousands of parking fines after discovering a 12-year-long administrative error that meant it was charging at least $40 more than permitted.\n\nMerri-bek City Council will launch the refund scheme for 11 different types of parking fines issued between July 2013 and June 11, 2025.\n\nMerri-bek Council will issue a partial refund scheme for parking fines. Credit: iStock\n\nIt was discovered that for these fines, the council had not adopted a proper resolution that allowed them to charge the full 0.5 penalty units. Without this approval, the council was only allowed to charge 0.2 penalty units.\n\nMerri-bek expects the refunds will range between $43 and $59 for each fine depending on when it was issued. The fees are not higher than other council areas.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/traveller/travel-news/london-s-most-exciting-new-museum-has-landed-with-big-plans-20250428-p5lupw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "London’s most exciting new museum has landed, with big plans",
        "publish_date": "Tue, 17 Jun 2025 11:48:37 +1000",
        "category": "entertainment",
        "authors": [
            "Julietta Jameson"
        ],
        "text": "The world’s largest museum of applied and decorative arts, the Victoria and Albert Museum (V&A) in London, is the custodian of nearly 3 million pieces spanning 5000 years of history. Only about 2 per cent of that is on display at any one time in the five-hectare, 145-gallery institution, but that’s still 60,000 articles.\n\nA design render of the V&A East Museum, designed by O’Donnell + Tuomey. Credit: O’Donnell + Tuomey, Ninety\n\nAs of May 31, however, V&A East Storehouse opened in London’s Stratford. The cavernous four-storey space in the new cultural quarter at Queen Elizabeth Olympic Park (the complex originally built for the 2012 London Olympics) is large enough for the display of large-scale pieces and pop-up surprise curations and will offer visitors changing displays and extraordinary experiences. It will also give museum-goers a kind of backstage view, as staff perform conservation work, process new acquisitions and package pieces that are to go out on loan.\n\nItems from the David Bowie Archive are prepared ahead of the David Bowie Centre opening at V&A East Storehouse on September 13, 2025. Credit: Victoria and Albert Museum, London\n\nA highlight of the Storehouse’s innovative approach is the Order an Object service, whereby anyone can book in advance to see any object they like from the collection, seven days a week.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/a-beautiful-defensive-mind-how-stephen-crichton-can-mark-two-players-at-once-20250611-p5m6j7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A beautiful defensive mind: How Stephen Crichton can mark two players at once",
        "publish_date": "Tue, 17 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "“And I see it every day at training. I’m the one he makes look bad when we run left [edge] against right [edge] drills. It gets very old, very quickly trying to pick Critta’s defence apart, he’s just so good.” As Crichton slowly, patiently explains the nuances of his craft, you get some sense of just how he pulls off grand final winning intercepts, leads a defensive revolution at Canterbury and marks two elite Origin opponents at once. All while giving away very little, which must be how opposition playmakers feel, even when they seemingly hold all the cards with one-man advantage. The enemy: A different cue for every player The best NRL ball players will bluff defenders with eye contact – locking eyes with an opponent or darting their own one way and passing another. They’ll do it with body language, dummying and squaring hips and shoulders to hold a defensive line at bay, or drawing them into an ill-timed rush.\n\nCrichton, in response, keeps his powder dry. Not least with a recorder under his nose. “Oh no, no I can’t tell you that, man,” the Bulldogs skipper laughs. “But to be honest, it’s a little bit of everything, and mostly, a lot of extra work in terms of knowing the players you’re up against. There’s no set piece or single bit of body language or cue that I look for, because every player’s different, right? “Kalyn Ponga is such a different threat to Daly Cherry-Evans. You can’t defend them the same way.\n\n“If you try to defend things the same way every time, you’re pre-empting it and offering the attack the chance to pick you apart. I guess being predictable goes both ways.” The genetics and grounding: 360 degrees and dinner plate hands Crichton’s rare athleticism – he stands at 193cm and weighs 99kg – plays a significant, imposing role in defence. Physically, he can go toe-to-toe with anyone in the game. The 24-year-old’s first coach at Penrith, Ben Harden, encouraged Crichton’s juggling of AFL (he trialled with GWS Giants), basketball (again, he trialled for the Australian schoolboys side) and rugby league as a teen.\n\nThe grounding in 360-degree games undoubtedly helped build the spatial awareness Crichton prizes highly. “Knowing what’s happening around each player, how much room they have to move, that spatial awareness is really important and something you can learn,” he says. “That’s a big focus for me at training – knowing what’s going on around me. It’s something Ciro [Canterbury coach Cameron Ciraldo] drills home as well.” Burton adds: “Don’t forget those big lanky arms and dinner plate hands. “He’s got an extra foot on other defenders that you have to think about when you’re passing.”\n\nThe decisions: Hold ’em, fold ’em Zeroing in on the 10 minutes of Origin I when Crichton held the Blues right wing on his own, his ability to make the right call stood plain as day. Just as it has countless times already for first Penrith, NSW and now Canterbury. Ciraldo’s defensive systems at both clubs have been founded on having options A, B and C to respond to attacking shapes and curveballs – be it a line break, dropped ball or missed tackle. Crichton defends like he has these responses written down his arm. And invariably, makes the right call on which defence to deploy.\n\n“I try and see the play coming from as far out as possible,” he says. “And if you can rush in and stop an attacking play before it gets too dangerous, then you do. “But it takes a lot of trust and understanding of what the defenders either side of you are going to do as well. And that doesn’t mean you always react as soon as you see a play. “You might wait until the right time to make your move, too – it could be right up until the play rolls out, and then you’re sliding and using the sideline as an extra defender or holding up until your teammates get there to help”.\n\nQueensland’s two best attacking opportunities against the 12-man Blues went in such fashion. With Zac Lomax noting “Nathan Cleary, Liam Martin and Stephen Crichton have defended alongside each other forever”, Crichton’s faith in Cleary had him back-pedalling when Ponga and Hamiso Tabuai-Fidow came calling in the 54th minute. Rather than rushing in to shut down play, Cleary is trusted to handle Tabuai-Fidow as time and space dwindle while Crichton covers winger Valentine Holmes as well. When a similar shape unfolds a moment later from a Maroons scrum, Crichton is this time up and forcing a mistimed pass from Cameron Munster. Holmes is then held up as he tries to find the turf, and six NSW teammates end up playing stacks on as the veteran flyer is shoved into touch.\n\nQueensland – with a one-man advantage but their attack severely out-of-sorts – don’t come calling again. The intercepts: A false economy\n\n\n\nCrichton has previously pinpointed a one-on-one trouncing he copped from one-time teammate Waqa Blake in 2020 as the turning point for his defensive focus. With video rolling of Blake swatting Crichton away, he and Ciraldo identified there and then what it would take to make him the game’s best defensive centre.\n\nThe same process was behind the 2021 grand final intercept that will keep Cody Walker awake at night for as long as it is remembered. “People remember the intercepts and think of me as ‘the intercept guy’,” Crichton says. “But to me, you can’t really defend thinking ‘intercept’. That brings you undone. Intercepts happen in a rush and are really a bit of [an] all or nothing gamble. And if you defend that way looking for it, you’re going to get nothing most of the time. “You go looking for the intercept, you’re telegraphing and showing what you’re doing. And that’s when they skin ya. You’ve shown your cards too early.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/nsw/hellscapes-eyesores-and-housing-hopes-these-are-sydney-s-boulevards-of-broken-dreams-20250606-p5m5fx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hellscapes, eyesores and housing hopes: These are Sydney’s boulevards of broken dreams",
        "publish_date": "Tue, 17 Jun 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney",
            "Ellie Busby"
        ],
        "text": "Shops have been shuttered and fallen into disrepair. The local post office closed in 2024. There are no bustling bars or buzzy restaurants, save a few nearby cafes.\n\nOnce a bustling auto-alley, the Princes Highway at Rockdale has fallen victim to the “urban decay” befalling many of Sydney’s ageing arterial roads.\n\nBut there is hope for Sydney’s boulevards of broken dreams, with an influx of new housing developments putting pressure on our city’s planning thinkers to come up with fresh projects to pedestrianise and beautify our sprawling roads.\n\nSome of Sydney’s biggest eyesores and traffic choke points were once grand boulevards, enjoyed by Sydneysiders as retail destinations. Now many of these main roads drive people away – to smaller suburban cafe clusters or pedestrianised promenades.\n\nWould you enjoy an al fresco dinner by Parramatta Road? How about sitting and reading while enjoying a coffee beside the Princes Highway?\n\nAdd articles to your saved list and come back to them any time.\n\nShe’d like to see more events and nighttime activations in Rockdale, similar to Lakemba’s night markets, to get the community excited to stay in town.\n\nLily Wu says foot traffic has gotten so quiet she could go a full day without a single person stepping inside her furniture store.\n\n“It affected us a lot,” she says. “There have been less customers since the post office closed.”\n\nButcher Cindy Phan has noticed a decrease in foot traffic on the Princes Highway in Rockdale. Credit: Janie Barrett\n\nCindy Phan has run the local butchers with her husband Anthony for 15 years. They work next to a row of empty shops.\n\n“There’s just nothing to hold people here,” Jennifer Dean, a resident of 20 years, says.\n\nIt’s a road you drive through to get somewhere else, but for Rockdale locals, this is supposed to be their high street.\n\nCommittee for Sydney’s Eamon Waterford says his solution is simple. Reduce the lanes of traffic, build a bike lane, tear down the metal fence that divides the town down the middle of the highway, and plant more street trees.\n\nWhile construction of the M6 tunnel project has been plagued by major challenges and delays after two sinkholes opened up during tunnelling , its eventual opening could be the perfect moment to revamp the Princes Highway.\n\nRows of empty shops are divided by a metal fence on the Princes Highway. Credit: Janie Barrett\n\n“We need a vibrant town centre that locals can enjoy – at the moment it’s basically a commuter suburb; if you want to enjoy an outdoor area you are probably travelling somewhere else in our LGA or further afield.”\n\n“The Princes Highway at Rockdale has been the victim of urban decay like so many main roads. It’s sad to see the number of businesses that have closed down replaced by empty shopfronts,” he says.\n\nBayside Council Mayor Ed McDougall wants to see the road transformed. The council is working on a masterplan to rejuvenate the town centre.\n\nThis stretch of Parramatta Road near Leichhardt is littered with crumbling empty buildings. Credit: Janie Barrett\n\nParramatta Road has been given every negative label under the sun. Anyone who has had the displeasure of driving, not to mention walking, down Sydney’s original boulevard knows its biggest problem. It’s ugly.\n\nThe scar through Sydney. Beirut on a bad day. The boulevard of broken dreams.\n\n“It means there’s an opportunity for us to reclaim the Princes Highway along this corridor as a place for people, as a high street.”\n\n“We need to learn from our mistakes; we have 2½ years until the M6 opens in late 2028 to get ready. We missed an opportunity with Parramatta Road when WestConnex opened in 2019 to re-balance the place and movement considerations of Parramatta Road,” he says.\n\nCustomer-facing businesses struggle to survive with grim foot traffic. Streetside dining here is unthinkable.\n\nYou only need to walk down the road for 10 minutes to find shop after shop left empty and decaying. Once grand buildings look mouldy and crumbling. Weed-infested parcels of land have become havens for rubbish dumping.\n\nNaomi Cooper says cycling and walking down Parramatta Road is too dangerous. Credit: Janie Barrett\n\nCars and noisy buses fly past, exhaust fills the nostrils and heat blasts from the concrete with little to no landscaping for reprieve.\n\nNow a walk down Parramatta Road on a warm summer day feels like a challenge to overcome.\n\nIn the late 1800s horses and carts dotted from village to village, and retail trade boomed on the link between Parramatta and the city.\n\n“You mean this hellscape,” Leichhardt local Naomi Cooper says. “Nobody is doing their errands here.”\n\nVarious councils and state governments have come up with plans to fix the roads with little success.\n\nThe Parramatta Road Corridor Urban Transformation Strategy (PRCUTS) was developed in 2016 and identified precincts on and around the road for increased housing density, improved active transport and urban beautification.\n\nThe recent Transport Oriented Development rezoning in Homebush will help this vision get off the ground, as will the Inner West Council’s recent proposal for increased density across the council area, but key parts of the PRCUTS have yet to materialise.\n\nDespite a 2016-2023 implementation plan that outlines several areas for short-term transformation, Leichhardt’s Taverners Hill precinct remains virtually unchanged with no bike lane and no new housing development.\n\nWhile big picture plans, including suggestions to decrease lanes of traffic and build a light rail down the road, haven’t gained any real traction, the impending arrival of several housing developments along Parramatta Road means new residents are coming fast, and no doubt they’ll be wanting a nicer neighbourhood.\n\nMore than 500 homes will be built at the old WestConnex dive site in Camperdown, 1100 apartments would be built under the Kings Bay Village proposal in Five Dock, and Burwood Council’s Burwood North Masterplan would have more than 7000 additional homes built adjacent to Parramatta Road.\n\nRicky Choi runs a barber shop on the Petersham stretch, nearby Crystal Street where a proposed co-living development would bring seven storeys of new potential customers. She’s confident an influx of residents will put pressure on the council to make the area more viable for businesses.\n\n“People want to do more things in their local area. I think the more apartments come in, the more businesses will too,” she says.\n\nRicky Choi of Miss Chop Barber says there is virtually no foot traffic outside her Parramatta Road shop. Credit: Janie Barrett\n\nEamon Waterford believes lane reduction and a major public transport overhaul is the only way to reclaim Parramatta Road for the people.\n\n“What’s needed is something big and grand that declares to Sydneysiders … that this road is now a Boulevard, is now a high street for people, for place, not movement,” he says.\n\nSydney Olympic Park\n\nOn game day, Olympic Boulevard is booming. It’s almost impossible to see past the crowd of sports jerseys, as people stream out of the train station to walk down the 60-metre-wide street towards Accor Stadium and Qudos Bank Arena in Sydney Olympic Park.\n\nBut the next day, the road is a ghost town.\n\n“It’s pretty quiet outside of game day because there isn’t a lot of things that can be activated down there at the moment,” says Allison Taylor, chief executive of the business association in the area.\n\nOlympic Boulevard is a ghost town on non-event days. Credit: Wolter Peeters\n\n“The southern end of the boulevard is basically sporting venues and they’re just big buildings with no activation opportunity onto the actual Olympic Boulevard.”\n\nSynonymous with sports and events, Olympic Boulevard, along with the rest of Sydney Olympic Park, has been routinely subjected to bold visions from the state government and the Sydney Olympic Park Authority over the past 25 years. Despite that, the key road remains virtually the same.\n\nThere’s been the Master Plan 2002, Vision 2025 and Master Plan 2030. Last year, the authority announced Master Plan 2030 would be replaced with Master Plan 2050.\n\nThe new plan reveals the precinct’s hopes to transition away from being known as just a place for sports and events to a “thriving urban community”.\n\nAn artist impression of Sydney Olympic Park in the Master Plan 2050.\n\nIn 25 years, Olympic Boulevard, between Dawn Fraser Avenue and Figtree Drive, is proposed to become a “green, active transport corridor” featuring public open space, plazas, an extensive tree canopy and a new cultural centre. Towers of up to 55 storeys would be built along the boulevard and pave the way for more opportunities for eateries and bars, with the stretch of the road alongside Accor Stadium and Cathy Freeman Park to become car-free.\n\nBusiness Western Sydney executive director David Borger, who also sits on the Sydney Olympic Park Authority board, has high hopes the 2050 plan will finally be the one that breathes new life into Olympic Boulevard.\n\n“The Olympic Boulevard was designed to be big enough that you could march an army through it, but unfortunately the army only turns up on game days in the stadiums and the rest of the time it can feel empty,” he says.\n\nOxford Street\n\nOxford Street is in the midst of its transformation. Local business owners say it can’t come soon enough.\n\nThe delayed Oxford and Foley development is set to open later this year, and with it the hoarding that has blighted the city-side of the strip for years.\n\nArtist impression of the Oxford and Foley development. Credit: TOGA\n\nLocal favourite bar and restaurant Big Poppas, known as the best place on the strip for late-night food and hip-hop music, has closed temporarily during the construction work.\n\nJust a stone’s throw away, popular western-inspired bar Shady Pines Saloon, run by the embattled Swillhouse hospitality group, has closed as part of another redevelopment bringing Sydney’s first Soho House – an exclusive members-only club where membership is likely to cost north of $4000 a year.\n\nThe new developments are set to bring new retail offerings and office spaces, but the local LGBTQ community has concerns that a shiny new building won’t bring back the soul of the strip.\n\n“I worry it will be of a level that ordinary people won’t be able to access or enjoy, and more than that, feel a part of,” Noel Lee, of the Bookshop Darlinghurst says.\n\nNoel Lee of the Bookshop Darlinghurst fears Oxford Street could lose its LGBT community with new developments. Credit: Janie Barrett\n\nLee has worked at the shop for more than 20 years, and has seen the area become run down, even as Darlinghurst and Paddington became gentrified. A row of shops near Taylor Square sits empty and run down.\n\nThe former bank building, which once housed the T2 nightclub at Taylor Square, is awaiting redevelopment, but for years sat empty after a council plan to use it as a bike hub were abandoned.\n\nLoading\n\n“You feel sorry – we get customers coming in all the time as an LGBT speciality store international tourists will pop in and say they were here 25 years ago, and talk about how great it was especially in the ’90s,” he says.\n\n“And then they’ll just say: what’s happened to the street?”\n\nDespite the decline, Lee says he sees green shoots popping up.\n\nSimon Fowler opened his cafe, Simon Says, six years ago on the corner of Oxford Street and South Dowling Street. Nearby, a luxury hotel development at the old Odeon Theatre is set to open later this year with new restaurants.\n\n“After living overseas for a number of years, you see how advanced, cosmopolitan, culturally rich cities treat their spaces. This in particular, this space, it’s got so much potential,” he says.\n\n“As long as it’s not another convenience store selling vapes, I’m all for it.”\n\nStart the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/nrl/cheika-switch-to-nrl-looms-20250617-p5m81r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cheika switch to NRL looms",
        "publish_date": "Tue, 17 Jun 2025 11:29:31 +1000",
        "category": "finance",
        "authors": [],
        "text": "Cheika switch to NRL looms\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/business/markets/asx-set-for-flat-start-wall-street-rebounds-a-jumps-20250617-p5m7xj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX inches higher after Trump’s Tehran warning; Gold stocks advance",
        "publish_date": "Tue, 17 Jun 2025 11:25:23 +1000",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket was treading cautiously on Tuesday morning after US President Donald Trump called for the evacuation of Tehran, in comments that contrasted with earlier optimism that Israel’s war against Iran wouldn’t escalate into a wider conflict.\n\nThe S&P/ASX 200 edged up 10.3 points, or 0.1 per cent, to 8558.70 as of 11.01am AEST after swinging between minor gains and losses in the first hour of trading. It added just 1 point on Monday. The Australian dollar gave up some of its 0.7 per cent jump overnight and was down 0.2 per cent at 65.13 US cents at the same time.\n\nWall Street has started the week with strong gains, but uncertainty over the war in the Middle East is making local investors wary. Credit: AP\n\nUS futures were down and oil climbed almost 2 per cent following Trump’s comments in a social media post from the Group of Seven leaders’ summit in Alberta, Canada. It wasn’t clear what he was referring to but hours earlier, Trump had said Iran wanted to make a deal, sparking hopes the fighting could remain contained and pushing Wall Street higher in its session overnight.\n\nTrump earlier said Iran wants to talk about de-escalating the conflict with Israel even as the two sides exchanged fire for the fourth consecutive day. Asked if the US would get more involved militarily, the US leader said he didn’t want to discuss it. However, he is cutting short his visit to the G7, according to the White House, and returning to Washington.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/western-australia/wa-news-live-pregnant-woman-three-men-rushed-to-hospital-in-separate-perth-crashes-20250616-p5m7w9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Fresh legal challenge levelled at Woodside; Four rushed to hospital after crashes",
        "publish_date": "Tue, 17 Jun 2025 11:24:29 +1000",
        "category": "finance",
        "authors": [],
        "text": "Yesterday, we revealed that a 20-year-old man from Mosman Park was charged after he allegedly performed a Nazi salute and used antisemitic language during a livestream.\n\nSamuel William Croll faced court on Monday over the incident.\n\nWA Premier Roger Cook said the alleged behaviour had “no place in WA”. You can hear what he had to say below.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/sport/rugby-union/leicester-prop-binned-in-final-20250615-p5m7it.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Leicester prop binned in final",
        "publish_date": "Tue, 17 Jun 2025 11:17:34 +1000",
        "category": "sports",
        "authors": [],
        "text": "Leicester prop binned in final\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/culture/tv-and-radio/abc-radio-claws-back-melbourne-listeners-as-kyle-and-jackie-o-sink-20250617-p5m7zn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ABC Radio claws back Melbourne listeners as Kyle and Jackie O sink",
        "publish_date": "Tue, 17 Jun 2025 11:05:01 +1000",
        "category": "finance",
        "authors": [
            "Nell Geraets"
        ],
        "text": "The ABC’s Melbourne radio station has managed to claw back its audience share following the federal election and a record-low result in the previous survey.\n\nABC Radio Melbourne posted a 6.2 per cent share of listeners in the city, up 1.9 percentage points from the previous survey’s low of a 4.3 per cent share of listeners in the city, the largest increase of any Melbourne station between March 9 and May 31 by far.\n\nIts new breakfast line-up featuring former AFL footballer Bob Murphy and former Channel Seven reporter Sharnelle Vella performed particularly well, lifting its audience share by two percentage points to 7.6 per cent.\n\nBob Murphy’s breakfast show, which he hosts with Sharnelle Vella, has delivered a much-needed ratings boost. Credit: Wayne Taylor\n\nMeanwhile, the audience share of KIIS FM’s breakfast duo Kyle Sandilands and Jackie O Henderson dropped by 0.7 percentage points to 5.1 per cent. Notably, survey timeslots do not always correlate precisely with program timeslots.",
        "source": "SMH"
    },
    {
        "url": "https://www.smh.com.au/national/car-drives-through-fatal-crash-scene-in-brassall-20250617-p5m80y.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Car drives through fatal crash scene in Brassall",
        "publish_date": "Tue, 17 Jun 2025 10:48:42 +1000",
        "category": "finance",
        "authors": [],
        "text": "Car drives through fatal crash scene in Brassall\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "SMH"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/interview-sussan-ley-on-gaza-misogyny-and-escaping-the-novelty-of-being-a-woman-leader/qsaffzmnz",
        "title": "INTERVIEW: Sussan Ley on Gaza, misogyny and escaping the 'novelty' of being a woman leader",
        "publish_date": "Tue, 17 Jun 2025 01:01:44 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/new-safety-measures-for-early-childcare-sector/clfszzg3j",
        "title": "New safety measures for early childcare sector",
        "publish_date": "Mon, 16 Jun 2025 09:47:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "New safety measures for early childcare sector\n\nPublished 16 June 2025, 8:21 am\n\nChildcare operators must report abuse within 24 hours and tighten their privacy regulations under a new safety crackdown. Federal and state education ministers have agreed to a series of measures targeting early childhood education and care. Despite the changes some experts say it falls short of what is needed.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/video/israel-iran-crisis-set-to-dominate-the-g7-summit/555e9r2g0",
        "title": "Israel-Iran crisis set to dominate the G7 Summit",
        "publish_date": "Mon, 16 Jun 2025 09:25:25 +0000",
        "category": "finance",
        "authors": [],
        "text": "Israel-Iran crisis set to dominate the G7 Summit\n\nPublished 16 June 2025, 8:21 am\n\nWorld leaders from major economies are under pressure to use the Group of Seven meeting in Canada to provide a force for peace in the Middle East. US President Donald Trump could hold the key to either consensus or a deep divide between summit nations.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/sport-pathway-to-social-connection-for-people-with-disability/i6122vcf7",
        "title": "Sport pathway to social connection for people with disability",
        "publish_date": "Mon, 16 Jun 2025 08:55:42 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts .\n\n\n\n\n\nWhen Mark Stephenson was diagnosed with Young Onset Lewy Body Dementia a year after also being diagnosed with Parkinson disease, his 32-year career as a professional firefighter came to an abrupt end.\n\n\n\n\n\n\"That's what the doctor told me was, unfortunately, you won't be able to do your job anymore and you can't drive home. My full professional career on the fire trucks, plus training and all that stopped in an instant. Plus my love was riding motorbikes as well, so that stopped in the instance as well. So that was a bit difficult to deal with as far as your world, which was big, became very small.\"\n\n\n\n\n\nLewy Body Dementia is a brain disorder that can lead to problems with thinking, movement, behaviour and mood.\n\n\n\n\n\nIt's a progressive illness, meaning it worsens over time, and common symptoms can include visual hallucinations, memory problems, sleep disorders and declining muscle strength and mobility.\n\n\n\n\n\nMr Stephenson, who was in his mid-50s when he was diagnosed, says the loss of his career left him feeling directionless.\n\n\n\n\n\n\"I made endless phone calls to charities or to people who feed the homeless or to do some form of sport and was knocked back at every occasion. And that was more hard to cope with than the initial loss, I think, because then it was like, okay, I can't volunteer anywhere because I'm too big a risk. And when you keep getting doors closed in your face after the first big loss, and it was like, oh, what do I do? And then I just basically gave up on trying.\"\n\n\n\n\n\nWhen Mr Stephenson stumbled across a Facebook post from an organisation called Sporting Wheelies encouraging people with disability to get involved in sport, he initially feared he'd once again be rejected.\n\n\n\n\n\nWith a gentle push from his wife, he decided to give wheelchair cricket a try.\n\n\n\n\n\n\" So, I went down and tried with cricket and yeah, it was very, after having so much rejection, it was very weird to walk into a place. It was very accepting. And then to look around and realise that there was people with all different abilities and disabilities. They were all there playing sport. And once you hopped in the chair, no one really saw the chair. You were just people playing sport.\"\n\n\n\n\n\nMore than 1 in 5 Australians have disability - which accounts for around 5.5 million people.\n\n\n\n\n\nSporting Wheelies Chief Operating Officer, Dane Cross says only a relatively small number of people with disability currently play sport, despite most having an interest in becoming involved.\n\n\n\n\n\n\"25 per cent of people with disability currently participate in sports, so one in four. But what we also know is three in four or 75 per cent want to participate, but so there's a gap there in I guess the sporting environment is that people want to play but currently face barriers and are unable to play.\"\n\n\n\n\n\nHe says the cost of adaptive equipment like wheelchairs and other supports can be prohibitive, and many clubs and community sports organisations aren't well equipped to make sports accessible.\n\n\n\n\n\n\"What we do know is that there aren't currently enough opportunities for people with disability to be participating in sport. Currently, the sporting environment is not entirely inclusive and so mainstream sports are not that suitable for all people.\"\n\n\n\n\n\nAccording the Mr Cross it's not just physical barriers that dissuade people with disability from becoming involved in sports.\n\n\n\n\n\n\"There's actually a gap in the attitudes and the stereotypes that exist in the space where people with disability aren't necessarily seen as athletes. And so attitudes, community attitudes, community sports club attitudes are required to change, to adapt, to enable more people to participate.\"\n\n\n\n\n\nSport4All is another organisation working to shift public perception around disability and sport, and facilitate more inclusive environments.\n\n\n\n\n\nThe organisation works with community sport clubs and schools to provide support, training and practical tools to make sport more welcoming.\n\n\n\n\n\nSport4All National Manager Carl Partridge says a significant part of his organisation's work is tackling a lack of understanding around the many forms disability can take.\n\n\n\n\n\n\"You've got to remember that only a relatively small proportion of people have a disability that you can see. But it comes into things like financial limitations, community attitudes, many programs are designed, aren't really designed with inclusion in minds so people are unintentionally excluded.\"\n\n\n\n\n\nMr Partridge says more programs are needed to bridge the gap that currently exists between people with disability who want to participate in sport, and those who are currently involved in sports.\n\n\n\n\n\nHe says through making sports more welcoming, programs like Sport4All and Sporting Wheelies are showing just how diverse the benefits of sport can be.\n\n\n\n\n\n\"Well, I think the benefits are so much more than just the physical health benefits. I think people think about sports physically, but for people with disability, there's other layers to as well. It's a gateway to social connection. It builds confidence, independence, but it also builds that massive sense of belonging.\"\n\n\n\n\n\nA 2019 study by Paralympics Australia found one in four people with disability identify social interaction as one of the top two benefits of getting involved in sport.\n\n\n\n\n\nThis is true for Mr Stephenson, who is now involved in cricket, AFL and basketball through Sporting Wheelies.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/historic-energy-bid-and-an-asx-crackdown/3amgpy1zs",
        "title": "Historic energy bid and an ASX crackdown",
        "publish_date": "Mon, 16 Jun 2025 08:37:16 +0000",
        "category": "finance",
        "authors": [],
        "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/podcast-episode/cough-up-or-queue-up-the-tough-choice-facing-patients-in-need-of-specialist-care/cef281too",
        "title": "Cough up or queue up: the tough choice facing patients in need of specialist care",
        "publish_date": "Mon, 16 Jun 2025 06:34:45 +0000",
        "category": "finance",
        "authors": [],
        "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT\n\n\n\n\n\nIn the 2025 federal election campaign, opposition health spokeswoman Anne Ruston had this to say during a debate with Health Minister Mark Butler at the National Press Club in Canberra.\n\n\n\n\n\n\"Australia's health system has long been the envy of the world. It's a system grounded in the firm belief that no matter who you are or where you live, you will get access to affordability, quality health care and at the heart of that system is Medicare.\"\n\n\n\n\n\nBut while that might be the dream, multiple reports have found that's not always the reality - which is perhaps why health care was one of the defining features of the campaign for Prime Minister Anthony Albanese.\n\n\n\n\n\nAnd why the focus of the public debate has been on GPs.\n\n\n\n\n\n\"We regard – in the Labor Party – Medicare as being the heart and indeed the soul of our health system. We believe that people should be able to see a doctor for free.\"\n\n\n\n\n\nBut a new report from the Grattan Institute has put the spotlight on specialist doctors.\n\n\n\n\n\nElizabeth Baldwin is one of the co-authors of the report.\n\n\n\n\n\n\" These are referred medical care, the kind of thing you need a referral from your GP for. And after patients get that referral and need that specialised health care they're faced with a really tough choice in our system at the moment. Either they go and make an appointment with a private specialist and then they might be hit with some pretty high fees. Only a third of appointments are bulk billed... So either they cough up in the private sector or they queue up in the public sector. And those wait times for a free public appointment can be months, sometimes even years long.\"\n\n\n\n\n\nIt's no niche issue.\n\n\n\n\n\nDemand for primary care and specialist services has grown, as Health Minister Mark Butler has acknowledged.\n\n\n\n\n\n\" We've got a growing population that's getting older with more complex chronic disease.\"\n\n\n\n\n\nAbout four in 10 Australians visited a specialist in the 2023-24 financial year.\n\n\n\n\n\nAverage out-of-pocket costs for extreme-fee-charging specialists in 2023 for example reached $671 for psychiatry services and more than $350 for endocrinology, cardiology, paediatrics, immunology and neurology services.\n\n\n\n\n\nElizabeth Baldwin says about two-thirds of appointments across all specialties are private ones, with patients receiving a Medicare rebate and paying a gap fee that can be substantial.\n\n\n\n\n\n\"About one in five Australians who see a specialist are hit with what we're calling an extreme fee at least once a year. They're only charged by about four percent of specialists - so they're real outliers - and they're fees that are more than triple the Medicare schedule fee. So that's the amount that the government tips in for every single visit. And those extreme fees can be hundreds of dollars for a single consultation.\"\n\n\n\n\n\nThese figures are born out by GPs like Dr Nindhi Ahilan.\n\n\n\n\n\n\"When patients attend they don't really often talk about the cost of seeing the GP as much as they talk about the cost of going on to see a specialist... Sometimes that means a delay in care... But some women are just avoiding care altogether.\"\n\n\n\n\n\nAustralian Medical Association president Dr Danielle McMullen was not available for an interview to respond to the report.\n\n\n\n\n\nBut the AMA said in a statement that the report validates what they have been saying all along about the need for greater public hospital funding - and how the current Medicare rebates are still not enough.\n\n\n\n\n\n\"The report highlights the urgent need for reforms to ensure Medicare rebates keep pace with the rising costs of delivering timely, high-quality healthcare to all Australians... Private outpatient services alleviate pressure on the broader health system, and ongoing support for this sector... is vital to maintaining choice, affordability, and sustainability.\"\n\n\n\n\n\nThe Grattan Institute's findings follow similar reports from Private Health Australia and the Commonwealth Bank's patient insights survey on costs for specialist care.\n\n\n\n\n\nBoth documents found that patients in the Australian Capital Territory, New South Wales and Queensland are being hit with the highest out-of-pocket fees for private medical care in Australia.\n\n\n\n\n\nElizabeth Baldwin says these high costs have a negative impact on patients, potentially leading to missed diagnoses, avoidable pain and added pressure on hospitals.\n\n\n\n\n\nShe says strong action is needed - including the funding of a million extra specialist appointment services every year in areas that receive the least care, more money for specialist training in rural areas, and a kind of naming and shaming.\n\n\n\n\n\n\"The government should do the maths on how much the specialist has charged on average across all of their consultations, and those that are reaching that threshold of triple or more for their Medicare scheduled fee should have that Medicare funding withdrawn. We don't think that the federal government should be implicitly subsidising these really extreme fees for patients.\"\n\n\n\n\n\nThe AMA says that's an extreme and unnecessary response.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.sbs.com.au/news/article/ash-barty-welcomes-second-child/d88hn2c2z",
        "title": "Ash Barty 'grateful' as she welcomes second child",
        "publish_date": "Mon, 16 Jun 2025 03:17:06 +0000",
        "category": "sports",
        "authors": [],
        "text": "Tennis champion Ash Barty has announced the arrival of her and husband Garry Kissick's second child.\n\n\n\n\n\nBarty posted a photo of her newborn daughter Jordan on Instagram on Monday afternoon.\n\n\n\n\"Welcome to the world, Jordan,\" the 29-year-old wrote next to a photo of a yawning infant in a sleep suit and beanie.\n\n\n\n\n\n\"You are loved unconditionally and we are so grateful to have you in our arms, gorgeous girl.\"\n\n\n\n\n\nJordan is the couple's second child; their son Hayden is almost two years old.\n\n\n\nAsh Barty with son Hayden. Source: AAP / Darren England The three-time grand-slam champion has retired from tennis but has kept busy publishing a series of children's books , releasing her own autobiography My Dream Time, starting a foundation and mentoring emerging young tennis star Olivia Gadecki.\n\n\n\n",
        "source": "SBS"
    },
    {
        "url": "https://www.theage.com.au/goodfood/recipes/adam-liaw-s-salt-and-pepper-chicken-noodles-20250617-p5m81c.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Adam Liaw’s salt and pepper chicken noodles",
        "publish_date": "Tue, 17 Jun 2025 12:03:20 +1000",
        "category": "lifestyle",
        "authors": [
            "Adam Liaw"
        ],
        "text": "Step 1 Combine the chicken with the bicarbonate of soda and sesame oil and season well with salt. Set aside while you prepare the rest of the ingredients.\n\nStep 2 Heat your wok over high heat. Add the oil and fry the chicken for a few minutes until browned, then add the garlic and the white part of the spring onions. Fry for another minute until fragrant. Add the cabbage and toss for 2-3 minutes until the cabbage is wilted.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/based-on-a-twisty-ya-bestseller-this-thriller-feels-like-a-teenage-succession-20250616-p5m7tt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Based on a twisty YA bestseller, this thriller feels like a teenage Succession",
        "publish_date": "Tue, 17 Jun 2025 12:01:00 +1000",
        "category": "finance",
        "authors": [
            "Kylie Northover"
        ],
        "text": "It centres on the obscenely wealthy Sinclair family, the head of which, Harris, is a Murdoch-style media mogul with very “traditional” (read: sexist, racist) American values. The Sinclairs spend their summers on their private island near Martha’s Vineyard, where Harris (David Morse) and his wife Tipper (Wendy Crewson) live in the main mansion, and have built slightly less ostentatious mansions for their three daughters, Carrie (Meryl Streep’s daughter Mamie Gummer), Penny (Caitlin FitzGerald) and Bess (Candice King).\n\nSo Amazon Prime Video’s eight-part adaptation is hotly anticipated, even by the millions who know the secret at the story’s heart.\n\nWhen E. Lockhart’s YA novel We Were Liars was published in 2014, it was huge, spending 40 weeks on the New York Times Young Adult bestseller list. Then, in 2021, the twisty novel had an unexpected surge in sales (now about 3 million copies) when it trended on BookTok , with readers sharing themselves becoming emotional over the book’s ending.\n\nThe “liars” of the title are the children of the daughters – cousins Cadence (Emily Alyn Lind), troublemaker Johnny (Australian Joseph Zada, who has just been cast in the new Hunger Games movie) and the misunderstood Mirren (Esther McGregor, daughter of actor Ewan) – and Gat (Shubham Maheshwari), whose uncle Ed (Rahul Kohli), is partnered with Johnny’s mum, and who is the only person, staff aside, who isn’t blond-haired and blue-eyed. The quartet spends blissful summers on the island (along with Mirren’s twin sisters and Johnny’s younger brother, collectively known as “the littles”), before everything changes.\n\nThe outrageously wealthy Sinclair family on their private island, dressed for the annual “lemon hunt” in co-ordinated attire.\n\nBut even during the summer before that, the liars, by that time all about 17, have come to realise that private islands, a staff of dozens, including a tennis coach and someone whose sole job is delivering lobsters, is not representative of most people’s lives. They’re also growing increasingly aware of the Sinclair family dysfunction; a Sinclair, Cadence is often told, does not show grief or sadness. There are certain expectations for such American “royalty”. Then there are the bizarre family traditions, in which Harris is referred to as The King, with special menus and co-ordinated clothing that are designed to foster competitiveness.\n\nThe series opens with Cadence telling us in voiceover that “something terrible happened last summer, and I have no memory of what, or who hurt me”. While we are shown much of the summer before this incident as flashback, we also see Cadence in the present-day living with a brain injury and a trauma-induced amnesia (best not to fact-check the frequent medical explanations), desperate to remember.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/deadly-rat-lungworm-on-the-rise-in-sydney-experts-warn-20250617-p5m802.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Deadly ‘rat lungworm’ on the rise in Sydney, experts warn",
        "publish_date": "Tue, 17 Jun 2025 11:58:37 +1000",
        "category": "lifestyle",
        "authors": [
            "Angus Dalton"
        ],
        "text": "Infections by a parasitic worm carried by rats, snails and slugs that can cause lethal brain infections in humans are increasing in dogs on Australia’s east coast, a Sydney study has found.\n\nRat lungworm is an extremely rare but potentially fatal disease caused by larvae of the parasite Angiostrongylus cantonensis, which is found naturally in feral rats after it spread to Australia from South-East Asia. Infection causes dangerous inflammation in the brain.\n\nAdult rat lungworms. Credit: University of Sydney\n\n“In dogs and humans the parasite enters the brain, but rather than progressing to the lungs like it does in rats, it is killed in the brain by our own immune response,” said Phoebe Rivory, who has submitted her PhD thesis on the disease to the Sydney School of Veterinary Science.\n\n“It is that overt immune response that causes severe headaches and sensations.”",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/politics/victoria/council-overcharged-up-to-14m-in-parking-fines-for-a-decade-here-s-how-to-get-your-money-back-20250617-p5m811.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Council overcharged up to $12.4m in parking fines for a decade. Here’s how to get your money back",
        "publish_date": "Tue, 17 Jun 2025 11:51:06 +1000",
        "category": "finance",
        "authors": [
            "Kieran Rooney"
        ],
        "text": "An inner-city council will partially refund thousands of parking fines after discovering a 12-year-long administrative error that meant it was charging at least $40 more than permitted.\n\nMerri-bek City Council will launch the refund scheme for 11 different types of parking fines issued between July 2013 and June 11, 2025.\n\nMerri-bek Council will issue a partial refund scheme for parking fines. Credit: iStock\n\nIt was discovered that for these fines, the council had not adopted a proper resolution that allowed them to charge the full 0.5 penalty units. Without this approval, the council was only allowed to charge 0.2 penalty units.\n\nMerri-bek expects the refunds will range between $43 and $59 for each fine depending on when it was issued. The fees are not higher than other council areas.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/traveller/travel-news/london-s-most-exciting-new-museum-has-landed-with-big-plans-20250428-p5lupw.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "London’s most exciting new museum has landed, with big plans",
        "publish_date": "Tue, 17 Jun 2025 11:48:37 +1000",
        "category": "entertainment",
        "authors": [
            "Julietta Jameson"
        ],
        "text": "The world’s largest museum of applied and decorative arts, the Victoria and Albert Museum (V&A) in London, is the custodian of nearly 3 million pieces spanning 5000 years of history. Only about 2 per cent of that is on display at any one time in the five-hectare, 145-gallery institution, but that’s still 60,000 articles.\n\nA design render of the V&A East Museum, designed by O’Donnell + Tuomey. Credit: O’Donnell + Tuomey, Ninety\n\nAs of May 31, however, V&A East Storehouse opened in London’s Stratford. The cavernous four-storey space in the new cultural quarter at Queen Elizabeth Olympic Park (the complex originally built for the 2012 London Olympics) is large enough for the display of large-scale pieces and pop-up surprise curations and will offer visitors changing displays and extraordinary experiences. It will also give museum-goers a kind of backstage view, as staff perform conservation work, process new acquisitions and package pieces that are to go out on loan.\n\nItems from the David Bowie Archive are prepared ahead of the David Bowie Centre opening at V&A East Storehouse on September 13, 2025. Credit: Victoria and Albert Museum, London\n\nA highlight of the Storehouse’s innovative approach is the Order an Object service, whereby anyone can book in advance to see any object they like from the collection, seven days a week.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/a-beautiful-defensive-mind-how-stephen-crichton-can-mark-two-players-at-once-20250611-p5m6j7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "A beautiful defensive mind: How Stephen Crichton can mark two players at once",
        "publish_date": "Tue, 17 Jun 2025 11:40:00 +1000",
        "category": "sports",
        "authors": [
            "Dan Walsh"
        ],
        "text": "“And I see it every day at training. I’m the one he makes look bad when we run left [edge] against right [edge] drills. It gets very old, very quickly trying to pick Critta’s defence apart, he’s just so good.” As Crichton slowly, patiently explains the nuances of his craft, you get some sense of just how he pulls off grand final winning intercepts, leads a defensive revolution at Canterbury and marks two elite Origin opponents at once. All while giving away very little, which must be how opposition playmakers feel, even when they seemingly hold all the cards with one-man advantage. The enemy: A different cue for every player The best NRL ball players will bluff defenders with eye contact – locking eyes with an opponent or darting their own one way and passing another. They’ll do it with body language, dummying and squaring hips and shoulders to hold a defensive line at bay, or drawing them into an ill-timed rush.\n\nCrichton, in response, keeps his powder dry. Not least with a recorder under his nose. “Oh no, no I can’t tell you that, man,” the Bulldogs skipper laughs. “But to be honest, it’s a little bit of everything, and mostly, a lot of extra work in terms of knowing the players you’re up against. There’s no set piece or single bit of body language or cue that I look for, because every player’s different, right? “Kalyn Ponga is such a different threat to Daly Cherry-Evans. You can’t defend them the same way.\n\n“If you try to defend things the same way every time, you’re pre-empting it and offering the attack the chance to pick you apart. I guess being predictable goes both ways.” The genetics and grounding: 360 degrees and dinner plate hands Crichton’s rare athleticism – he stands at 193cm and weighs 99kg – plays a significant, imposing role in defence. Physically, he can go toe-to-toe with anyone in the game. The 24-year-old’s first coach at Penrith, Ben Harden, encouraged Crichton’s juggling of AFL (he trialled with GWS Giants), basketball (again, he trialled for the Australian schoolboys side) and rugby league as a teen.\n\nThe grounding in 360-degree games undoubtedly helped build the spatial awareness Crichton prizes highly. “Knowing what’s happening around each player, how much room they have to move, that spatial awareness is really important and something you can learn,” he says. “That’s a big focus for me at training – knowing what’s going on around me. It’s something Ciro [Canterbury coach Cameron Ciraldo] drills home as well.” Burton adds: “Don’t forget those big lanky arms and dinner plate hands. “He’s got an extra foot on other defenders that you have to think about when you’re passing.”\n\nThe decisions: Hold ’em, fold ’em Zeroing in on the 10 minutes of Origin I when Crichton held the Blues right wing on his own, his ability to make the right call stood plain as day. Just as it has countless times already for first Penrith, NSW and now Canterbury. Ciraldo’s defensive systems at both clubs have been founded on having options A, B and C to respond to attacking shapes and curveballs – be it a line break, dropped ball or missed tackle. Crichton defends like he has these responses written down his arm. And invariably, makes the right call on which defence to deploy.\n\n“I try and see the play coming from as far out as possible,” he says. “And if you can rush in and stop an attacking play before it gets too dangerous, then you do. “But it takes a lot of trust and understanding of what the defenders either side of you are going to do as well. And that doesn’t mean you always react as soon as you see a play. “You might wait until the right time to make your move, too – it could be right up until the play rolls out, and then you’re sliding and using the sideline as an extra defender or holding up until your teammates get there to help”.\n\nQueensland’s two best attacking opportunities against the 12-man Blues went in such fashion. With Zac Lomax noting “Nathan Cleary, Liam Martin and Stephen Crichton have defended alongside each other forever”, Crichton’s faith in Cleary had him back-pedalling when Ponga and Hamiso Tabuai-Fidow came calling in the 54th minute. Rather than rushing in to shut down play, Cleary is trusted to handle Tabuai-Fidow as time and space dwindle while Crichton covers winger Valentine Holmes as well. When a similar shape unfolds a moment later from a Maroons scrum, Crichton is this time up and forcing a mistimed pass from Cameron Munster. Holmes is then held up as he tries to find the turf, and six NSW teammates end up playing stacks on as the veteran flyer is shoved into touch.\n\nQueensland – with a one-man advantage but their attack severely out-of-sorts – don’t come calling again. The intercepts: A false economy\n\n\n\nCrichton has previously pinpointed a one-on-one trouncing he copped from one-time teammate Waqa Blake in 2020 as the turning point for his defensive focus. With video rolling of Blake swatting Crichton away, he and Ciraldo identified there and then what it would take to make him the game’s best defensive centre.\n\nThe same process was behind the 2021 grand final intercept that will keep Cody Walker awake at night for as long as it is remembered. “People remember the intercepts and think of me as ‘the intercept guy’,” Crichton says. “But to me, you can’t really defend thinking ‘intercept’. That brings you undone. Intercepts happen in a rush and are really a bit of [an] all or nothing gamble. And if you defend that way looking for it, you’re going to get nothing most of the time. “You go looking for the intercept, you’re telegraphing and showing what you’re doing. And that’s when they skin ya. You’ve shown your cards too early.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/nsw/hellscapes-eyesores-and-housing-hopes-these-are-sydney-s-boulevards-of-broken-dreams-20250606-p5m5fx.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Hellscapes, eyesores and housing hopes: These are Sydney’s boulevards of broken dreams",
        "publish_date": "Tue, 17 Jun 2025 11:30:00 +1000",
        "category": "finance",
        "authors": [
            "Jessica Mcsweeney",
            "Ellie Busby"
        ],
        "text": "Shops have been shuttered and fallen into disrepair. The local post office closed in 2024. There are no bustling bars or buzzy restaurants, save a few nearby cafes.\n\nOnce a bustling auto-alley, the Princes Highway at Rockdale has fallen victim to the “urban decay” befalling many of Sydney’s ageing arterial roads.\n\nBut there is hope for Sydney’s boulevards of broken dreams, with an influx of new housing developments putting pressure on our city’s planning thinkers to come up with fresh projects to pedestrianise and beautify our sprawling roads.\n\nSome of Sydney’s biggest eyesores and traffic choke points were once grand boulevards, enjoyed by Sydneysiders as retail destinations. Now many of these main roads drive people away – to smaller suburban cafe clusters or pedestrianised promenades.\n\nWould you enjoy an al fresco dinner by Parramatta Road? How about sitting and reading while enjoying a coffee beside the Princes Highway?\n\nAdd articles to your saved list and come back to them any time.\n\nShe’d like to see more events and nighttime activations in Rockdale, similar to Lakemba’s night markets, to get the community excited to stay in town.\n\nLily Wu says foot traffic has gotten so quiet she could go a full day without a single person stepping inside her furniture store.\n\n“It affected us a lot,” she says. “There have been less customers since the post office closed.”\n\nButcher Cindy Phan has noticed a decrease in foot traffic on the Princes Highway in Rockdale. Credit: Janie Barrett\n\nCindy Phan has run the local butchers with her husband Anthony for 15 years. They work next to a row of empty shops.\n\n“There’s just nothing to hold people here,” Jennifer Dean, a resident of 20 years, says.\n\nIt’s a road you drive through to get somewhere else, but for Rockdale locals, this is supposed to be their high street.\n\nCommittee for Sydney’s Eamon Waterford says his solution is simple. Reduce the lanes of traffic, build a bike lane, tear down the metal fence that divides the town down the middle of the highway, and plant more street trees.\n\nWhile construction of the M6 tunnel project has been plagued by major challenges and delays after two sinkholes opened up during tunnelling , its eventual opening could be the perfect moment to revamp the Princes Highway.\n\nRows of empty shops are divided by a metal fence on the Princes Highway. Credit: Janie Barrett\n\n“We need a vibrant town centre that locals can enjoy – at the moment it’s basically a commuter suburb; if you want to enjoy an outdoor area you are probably travelling somewhere else in our LGA or further afield.”\n\n“The Princes Highway at Rockdale has been the victim of urban decay like so many main roads. It’s sad to see the number of businesses that have closed down replaced by empty shopfronts,” he says.\n\nBayside Council Mayor Ed McDougall wants to see the road transformed. The council is working on a masterplan to rejuvenate the town centre.\n\nThis stretch of Parramatta Road near Leichhardt is littered with crumbling empty buildings. Credit: Janie Barrett\n\nParramatta Road has been given every negative label under the sun. Anyone who has had the displeasure of driving, not to mention walking, down Sydney’s original boulevard knows its biggest problem. It’s ugly.\n\nThe scar through Sydney. Beirut on a bad day. The boulevard of broken dreams.\n\n“It means there’s an opportunity for us to reclaim the Princes Highway along this corridor as a place for people, as a high street.”\n\n“We need to learn from our mistakes; we have 2½ years until the M6 opens in late 2028 to get ready. We missed an opportunity with Parramatta Road when WestConnex opened in 2019 to re-balance the place and movement considerations of Parramatta Road,” he says.\n\nCustomer-facing businesses struggle to survive with grim foot traffic. Streetside dining here is unthinkable.\n\nYou only need to walk down the road for 10 minutes to find shop after shop left empty and decaying. Once grand buildings look mouldy and crumbling. Weed-infested parcels of land have become havens for rubbish dumping.\n\nNaomi Cooper says cycling and walking down Parramatta Road is too dangerous. Credit: Janie Barrett\n\nCars and noisy buses fly past, exhaust fills the nostrils and heat blasts from the concrete with little to no landscaping for reprieve.\n\nNow a walk down Parramatta Road on a warm summer day feels like a challenge to overcome.\n\nIn the late 1800s horses and carts dotted from village to village, and retail trade boomed on the link between Parramatta and the city.\n\n“You mean this hellscape,” Leichhardt local Naomi Cooper says. “Nobody is doing their errands here.”\n\nVarious councils and state governments have come up with plans to fix the roads with little success.\n\nThe Parramatta Road Corridor Urban Transformation Strategy (PRCUTS) was developed in 2016 and identified precincts on and around the road for increased housing density, improved active transport and urban beautification.\n\nThe recent Transport Oriented Development rezoning in Homebush will help this vision get off the ground, as will the Inner West Council’s recent proposal for increased density across the council area, but key parts of the PRCUTS have yet to materialise.\n\nDespite a 2016-2023 implementation plan that outlines several areas for short-term transformation, Leichhardt’s Taverners Hill precinct remains virtually unchanged with no bike lane and no new housing development.\n\nWhile big picture plans, including suggestions to decrease lanes of traffic and build a light rail down the road, haven’t gained any real traction, the impending arrival of several housing developments along Parramatta Road means new residents are coming fast, and no doubt they’ll be wanting a nicer neighbourhood.\n\nMore than 500 homes will be built at the old WestConnex dive site in Camperdown, 1100 apartments would be built under the Kings Bay Village proposal in Five Dock, and Burwood Council’s Burwood North Masterplan would have more than 7000 additional homes built adjacent to Parramatta Road.\n\nRicky Choi runs a barber shop on the Petersham stretch, nearby Crystal Street where a proposed co-living development would bring seven storeys of new potential customers. She’s confident an influx of residents will put pressure on the council to make the area more viable for businesses.\n\n“People want to do more things in their local area. I think the more apartments come in, the more businesses will too,” she says.\n\nRicky Choi of Miss Chop Barber says there is virtually no foot traffic outside her Parramatta Road shop. Credit: Janie Barrett\n\nEamon Waterford believes lane reduction and a major public transport overhaul is the only way to reclaim Parramatta Road for the people.\n\n“What’s needed is something big and grand that declares to Sydneysiders … that this road is now a Boulevard, is now a high street for people, for place, not movement,” he says.\n\nSydney Olympic Park\n\nOn game day, Olympic Boulevard is booming. It’s almost impossible to see past the crowd of sports jerseys, as people stream out of the train station to walk down the 60-metre-wide street towards Accor Stadium and Qudos Bank Arena in Sydney Olympic Park.\n\nBut the next day, the road is a ghost town.\n\n“It’s pretty quiet outside of game day because there isn’t a lot of things that can be activated down there at the moment,” says Allison Taylor, chief executive of the business association in the area.\n\nOlympic Boulevard is a ghost town on non-event days. Credit: Wolter Peeters\n\n“The southern end of the boulevard is basically sporting venues and they’re just big buildings with no activation opportunity onto the actual Olympic Boulevard.”\n\nSynonymous with sports and events, Olympic Boulevard, along with the rest of Sydney Olympic Park, has been routinely subjected to bold visions from the state government and the Sydney Olympic Park Authority over the past 25 years. Despite that, the key road remains virtually the same.\n\nThere’s been the Master Plan 2002, Vision 2025 and Master Plan 2030. Last year, the authority announced Master Plan 2030 would be replaced with Master Plan 2050.\n\nThe new plan reveals the precinct’s hopes to transition away from being known as just a place for sports and events to a “thriving urban community”.\n\nAn artist impression of Sydney Olympic Park in the Master Plan 2050.\n\nIn 25 years, Olympic Boulevard, between Dawn Fraser Avenue and Figtree Drive, is proposed to become a “green, active transport corridor” featuring public open space, plazas, an extensive tree canopy and a new cultural centre. Towers of up to 55 storeys would be built along the boulevard and pave the way for more opportunities for eateries and bars, with the stretch of the road alongside Accor Stadium and Cathy Freeman Park to become car-free.\n\nBusiness Western Sydney executive director David Borger, who also sits on the Sydney Olympic Park Authority board, has high hopes the 2050 plan will finally be the one that breathes new life into Olympic Boulevard.\n\n“The Olympic Boulevard was designed to be big enough that you could march an army through it, but unfortunately the army only turns up on game days in the stadiums and the rest of the time it can feel empty,” he says.\n\nOxford Street\n\nOxford Street is in the midst of its transformation. Local business owners say it can’t come soon enough.\n\nThe delayed Oxford and Foley development is set to open later this year, and with it the hoarding that has blighted the city-side of the strip for years.\n\nArtist impression of the Oxford and Foley development. Credit: TOGA\n\nLocal favourite bar and restaurant Big Poppas, known as the best place on the strip for late-night food and hip-hop music, has closed temporarily during the construction work.\n\nJust a stone’s throw away, popular western-inspired bar Shady Pines Saloon, run by the embattled Swillhouse hospitality group, has closed as part of another redevelopment bringing Sydney’s first Soho House – an exclusive members-only club where membership is likely to cost north of $4000 a year.\n\nThe new developments are set to bring new retail offerings and office spaces, but the local LGBTQ community has concerns that a shiny new building won’t bring back the soul of the strip.\n\n“I worry it will be of a level that ordinary people won’t be able to access or enjoy, and more than that, feel a part of,” Noel Lee, of the Bookshop Darlinghurst says.\n\nNoel Lee of the Bookshop Darlinghurst fears Oxford Street could lose its LGBT community with new developments. Credit: Janie Barrett\n\nLee has worked at the shop for more than 20 years, and has seen the area become run down, even as Darlinghurst and Paddington became gentrified. A row of shops near Taylor Square sits empty and run down.\n\nThe former bank building, which once housed the T2 nightclub at Taylor Square, is awaiting redevelopment, but for years sat empty after a council plan to use it as a bike hub were abandoned.\n\nLoading\n\n“You feel sorry – we get customers coming in all the time as an LGBT speciality store international tourists will pop in and say they were here 25 years ago, and talk about how great it was especially in the ’90s,” he says.\n\n“And then they’ll just say: what’s happened to the street?”\n\nDespite the decline, Lee says he sees green shoots popping up.\n\nSimon Fowler opened his cafe, Simon Says, six years ago on the corner of Oxford Street and South Dowling Street. Nearby, a luxury hotel development at the old Odeon Theatre is set to open later this year with new restaurants.\n\n“After living overseas for a number of years, you see how advanced, cosmopolitan, culturally rich cities treat their spaces. This in particular, this space, it’s got so much potential,” he says.\n\n“As long as it’s not another convenience store selling vapes, I’m all for it.”\n\nStart the day with a summary of the day’s most important and interesting stories, analysis and insights. Sign up for our Morning Edition newsletter.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/nrl/cheika-switch-to-nrl-looms-20250617-p5m81r.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Cheika switch to NRL looms",
        "publish_date": "Tue, 17 Jun 2025 11:29:31 +1000",
        "category": "finance",
        "authors": [],
        "text": "Cheika switch to NRL looms\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/business/markets/asx-set-for-flat-start-wall-street-rebounds-a-jumps-20250617-p5m7xj.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ASX inches higher after Trump’s Tehran warning; Gold stocks advance",
        "publish_date": "Tue, 17 Jun 2025 11:25:23 +1000",
        "category": "finance",
        "authors": [
            "Staff Writers"
        ],
        "text": "The Australian sharemarket was treading cautiously on Tuesday morning after US President Donald Trump called for the evacuation of Tehran, in comments that contrasted with earlier optimism that Israel’s war against Iran wouldn’t escalate into a wider conflict.\n\nThe S&P/ASX 200 edged up 10.3 points, or 0.1 per cent, to 8558.70 as of 11.01am AEST after swinging between minor gains and losses in the first hour of trading. It added just 1 point on Monday. The Australian dollar gave up some of its 0.7 per cent jump overnight and was down 0.2 per cent at 65.13 US cents at the same time.\n\nWall Street has started the week with strong gains, but uncertainty over the war in the Middle East is making local investors wary. Credit: AP\n\nUS futures were down and oil climbed almost 2 per cent following Trump’s comments in a social media post from the Group of Seven leaders’ summit in Alberta, Canada. It wasn’t clear what he was referring to but hours earlier, Trump had said Iran wanted to make a deal, sparking hopes the fighting could remain contained and pushing Wall Street higher in its session overnight.\n\nTrump earlier said Iran wants to talk about de-escalating the conflict with Israel even as the two sides exchanged fire for the fourth consecutive day. Asked if the US would get more involved militarily, the US leader said he didn’t want to discuss it. However, he is cutting short his visit to the G7, according to the White House, and returning to Washington.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/national/western-australia/wa-news-live-pregnant-woman-three-men-rushed-to-hospital-in-separate-perth-crashes-20250616-p5m7w9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "WA news LIVE: Fresh legal challenge levelled at Woodside; Four rushed to hospital after crashes",
        "publish_date": "Tue, 17 Jun 2025 11:24:29 +1000",
        "category": "finance",
        "authors": [],
        "text": "Yesterday, we revealed that a 20-year-old man from Mosman Park was charged after he allegedly performed a Nazi salute and used antisemitic language during a livestream.\n\nSamuel William Croll faced court on Monday over the incident.\n\nWA Premier Roger Cook said the alleged behaviour had “no place in WA”. You can hear what he had to say below.",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/sport/rugby-union/leicester-prop-binned-in-final-20250615-p5m7it.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "Leicester prop binned in final",
        "publish_date": "Tue, 17 Jun 2025 11:17:34 +1000",
        "category": "sports",
        "authors": [],
        "text": "Leicester prop binned in final\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
        "source": "TheAge"
    },
    {
        "url": "https://www.theage.com.au/culture/tv-and-radio/abc-radio-claws-back-melbourne-listeners-as-kyle-and-jackie-o-sink-20250617-p5m7zn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
        "title": "ABC Radio claws back Melbourne listeners as Kyle and Jackie O sink",
        "publish_date": "Tue, 17 Jun 2025 11:05:01 +1000",
        "category": "finance",
        "authors": [
            "Nell Geraets"
        ],
        "text": "The ABC’s Melbourne radio station has managed to claw back its audience share following the federal election and a record-low result in the previous survey.\n\nABC Radio Melbourne posted a 6.2 per cent share of listeners in the city, up 1.9 percentage points from the previous survey’s low of a 4.3 per cent share of listeners in the city, the largest increase of any Melbourne station between March 9 and May 31 by far.\n\nIts new breakfast line-up featuring former AFL footballer Bob Murphy and former Channel Seven reporter Sharnelle Vella performed particularly well, lifting its audience share by two percentage points to 7.6 per cent.\n\nBob Murphy’s breakfast show, which he hosts with Sharnelle Vella, has delivered a much-needed ratings boost. Credit: Wayne Taylor\n\nMeanwhile, the audience share of KIIS FM’s breakfast duo Kyle Sandilands and Jackie O Henderson dropped by 0.7 percentage points to 5.1 per cent. Notably, survey timeslots do not always correlate precisely with program timeslots.",
        "source": "TheAge"
    },
    {
        "url": "https://au.news.yahoo.com/australia-post-makes-big-move-to-keep-up-with-booming-trend-013826813.html",
        "title": "Australia Post makes big move to keep up with booming trend",
        "publish_date": "2025-06-17T01:38:26Z",
        "category": "finance",
        "authors": [],
        "text": "As Australians change the way they shop and send parcels, the national postal service is responding with a bold new approach.\n\nAustralia Post has unveiled a new wave of 'next generation' retail sites designed to meet growing demand from online shopping. Source: Australia Post/Supplied\n\nAustralia Post has unveiled a new wave of \"next generation\" retail sites designed to meet growing demand from online shopping. These revamped outlets aim to improve both customer service and operational efficiency, featuring digital self-service options, streamlined layouts and upgraded parcel collection areas.\n\nThe new stores launched today in Fitzroy in Melbourne and in Waterloo in Sydney. Speaking to Yahoo News on Tuesday morning, an Australia Post spokeswoman confirmed new sites will also be opened in St Leonards in Sydney and Chadstone in Melbourne in the \"coming weeks and months\".\n\nThe initiative reflects a broader transformation strategy as Australia Post responds to changing consumer habits, particularly the rise in online shopping. The redesigned stores will support faster service, reduce congestion and cater to the increasing volume of packages being processed daily.\n\nThese revamped outlets aim to improve both customer service and operational efficiency, featuring digital self-service options, streamlined layouts, and upgraded parcel collection areas. Source: Australia Post/Supplied\n\nNew Australia Post announcement addresses big national shift\n\nAustralia Post Executive General Manager Retail, Brand and Marketing, Josh Bannister, said the move was aimed at giving customers greater flexibility when it comes to receiving and shipping packages.\n\nADVERTISEMENT\n\n\"The number one reason a customer visits the Post Office is to collect a parcel, so we're making it easier and quicker to collect and send parcels at a time that suits them,\" he said in a statement. \"With Aussies shopping more online than ever before, we're evolving our network to keep pace with how our customers are using postal services.\"\n\nIt's understood there will be six to eight employees on-site to help customers with their needs, with trading hours extended to support evolving consumer habits. \"Customers can collect or return online purchases around the clock, and trial sites also feature 24/7 accessible vending machines stocked with packaging, stamps and other mailing essentials,\" Australia Post said.\n\nThe new stores have launched today in Fitzroy in Melbourne and in Waterloo in Sydney, with an additional two new locations to be opened soon. Source: Australia Post/Supplied\n\n\"This next-generation format is designed to be flexible and scalable, with some featuring a smaller physical footprint but a highly efficient back-of-house set-up to manage increased parcel volume.\"\n\nOn Monday, it was announced Australia Post had installed the country’s first-ever talking post boxes in a bid to bring people closer together. The three interactive mailboxes, located in Canberra, Sydney and Traralgon, in Victoria’s Gippsland region, use smart sensors to grab the attention of those walking past, and encourage them to write to a loved one the old-fashioned way — by sending a postcard.\n\nADVERTISEMENT\n\nThe installations, which were set up as part of a nationwide campaign with Beyond Blue to deliver five million prepaid Connection Postcards this month, utter phrases like: \"You can make a difference with a connection\", \"A little hello goes a long way\", and \"Send a note to someone special\".\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    },
    {
        "url": "https://au.news.yahoo.com/outrage-after-aussie-farmer-cops-398-fine-for-helping-drought-stricken-neighbour-213018365.html",
        "title": "Outrage after Aussie farmer cops $398 fine for helping drought-stricken neighbour",
        "publish_date": "2025-06-16T21:30:18Z",
        "category": "finance",
        "authors": [],
        "text": "Graham Thomson said in his 50 years of farming, he has never heard of this rule.\n\nGraham Thomson has vowed to fight the fine in court and says in his 50 years of farming, he has never heard of the rule. Source: GoFundMe\n\nAussies are fuming after a farmer recently copped a $398 fine for moving two bales of hay across a road to a help out his drought-stricken neighbour. Graham Thomson, a hay contractor based in Condah, in Victoria’s extremely dry southwest, was lugging the sheep feed on his tractor forks when a National Heavy Vehicle Regulator (NHVR) officer’s flashing lights brought him to a halt.\n\nThe long-time local said he had checked there were no other vehicles in sight before he travelled the 600 metres down the road, and across the Henty Highway. However, Mr Thomson said the officer informed him he wasn’t allowed to haul anything on the front-end loader on a public road, and issued him the hefty fine for “not restraining” the hay.\n\n“I’m meant to have a load binder over them. I’ve been farming for about 50 years and I didn’t know that,” he told Sheep Central, adding the officer said he would need to place the hay on a truck to transport it on the road.\n\n“I didn’t say anything, but one minute he says I can’t carry anything on the road and then he books me for carrying something on it that’s not restrained. So that didn’t make sense to me.”\n\nADVERTISEMENT\n\nThe incident — which reportedly occurred the same day a mental health event for farmers was held at the Condah Hotel — has infuriated others, with another local farmer Andy Satchell slamming the decision online.\n\nA video uploaded to his Facebook shows a large bale of hay balancing on the front of Mr Thomson’s tractor. Yahoo News understands the clip not does depict the tractor at the time of the interception.\n\nThommo said the NHVR officer told him he would need to load the hay onto a truck to transport it on the road. Source: Facebook/Andy Satchell\n\n“To say Thommo was upset would be an understatement,” Mr Satchell wrote. “Surely farmers have a right to keep their livestock fed.”\n\nThe clip has since gone viral, with thousands of Aussie sharing their frustration over the “ridiculous” fine.\n\n“Every farmer is breaking the law as soon as they put a round roll or a square bale on those forks to go across a road,” Mr Thomson told Sheep Central. “The fine was worth more than the value of the hay.”\n\nFarmer vows to fight $398 fine\n\nA GoFundMe page set up on Mr Thomson's behalf is raising money to help him fight the fine in court.\n\nADVERTISEMENT\n\n“Thommo is choosing to contest the fine in court because he believes that, after 60+ years in the industry, helping a neighbour feed their livestock shouldn’t be penalised,” the fundraiser reads.\n\nAnother aim of the fight is to make sure the voices of famers are heard, the page says. Mr Thomson has requested all excess funds be donated to the National Centre for Farmer Health.\n\n“Due to farmers experiencing environmental factors, such as drought and floods, I’d like any excess funds to go to farmer mental health, as we need to keep the food chain going,” Mr Thomson said.\n\nHeavy Vehicle Regulator says fine won't be retracted\n\nA NHVR spokesperson told Yahoo News safety on Australian roads is a \"top priority\" and it's their job to prevent road accidents.\n\nADVERTISEMENT\n\n“On 8 June, SCOs intercepted a tractor carrying two double stacked large hay bales on the Henty Highway in Condah, with one of the bales not restrained. The SCOs applied both an engagement and enforcement method, by providing education to the driver on his registration conditions in regard to carrying a load on the highway, and the driver was also issued a minor load restraint infringement for the unrestrained bale,” the spokesperson said.\n\n“Though the NHVR is committed to its ‘inform and educate’ approach, road safety is always the highest priority and enforcement action may be taken when necessary to help ensure all road users, including both the heavy vehicle driver and other motorists, make it to their destination safely.”\n\nAccording to the state's Heavy Vehicle National Law schedule of penalties, Mr Thomson was hit with the minimum fine for breaching mass, dimension or loading requirements. The maximum penalty is an eye-watering $13,310.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
        "source": "Yahoo"
    }
]