[
  {
    "url": "https://www.9news.com.au/finance/unemployment-rate-australia-september-4-5-per-cent/6ec2b0e9-04f5-4cf5-b7cd-b31fa6db583c",
    "title": "Surprise job losses push unemployment rate to near-four-year high",
    "publish_date": "Thu, 16 Oct 2025 01:44:30 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "T﻿he unemployment rate has reached its highest level in almost four years following a surprise jump in the number of people looking for work last month, increasing the chance of a pre-Christmas interest rate cut.\n\nAccording to data released by the Australian Bureau of Statistics this morning, the jobless rate hit 4.5 per cent in September, up from a revised 4.3 per cent the month prior (the ABS had originally said the August figure was 4.2 per cent).\n\nThe result is worse than economists had forecast, with the market expecting a rise to 4.3 per cent today.\n\nThe unemployment rate is at its highest level since late 2021. (Steven Siewert)\n\n\"This is the highest seasonally adjusted unemployment rate recorded since November 2021,\" ABS head of labour statistics Sean Crick said.\n\n\"There were 34,000 more unemployed people in September. The number of employed people also grew, up 15,000 in the same period.﻿\"\n\nThe ﻿fresh data comes three weeks out from the Reserve Bank's next interest rates decision, to be handed down on Melbourne Cup day, November 4.\n\nHarry Murphy from Oxford Economics Australia said the surprise rise in unemployment has put the central bank in a difficult position, but that a rate cut next month is now justified.\n\n﻿\"The RBA is increasingly caught between a rock and a hard place,\" he said.\n\n\"Its dual mandate – price stability and full employment – is now pulling in opposite directions.\n\n\"Inflation looks set to come in hotter than the bank's latest forecasts, while the labour market is weaker than expected. Each development warrants different policy responses.\n\n\"We maintain that the recent inflation uptick is temporary and expect underlying pressures to keep easing...\n\n\"With unemployment moving in the other direction, we maintain our view that a rate cut is warranted in November, with a final cut this cycle in quarter one next year.\"\n\nRBA Governor Michele Bullock has hinted that there may be more room for interest rates to be reduced. (Louise Kennerley)\n\nWhile expectations for a pre-Christmas cut have dwindled on the back of higher-than-expected inflation data in recent months, RBA Governor Michele Bullock hinted that there was still room for the cash rate to drop in comments made in the United States overnight.\n\n\"We don't think (monetary) policy is restrictive, but we don't think it's accommodative,\" she said.\n\n\"We think it is marginally tight.\n\n\"It's probably a little on the tight side but not much.\"\n\nThe ABS will publish crucial quarterly inflation data in two weeks, which is set to have a crucial influence on the RBA's November and December decisions.﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/new-memoir-by-virginia-giuffre-claims-prince-andrew-thought-sex-was-his-birth-right/5e14c722-4b27-4301-b515-335f329ae3aa",
    "title": "Virginia Giuffre's memoir to claim Prince Andrew thought sex was his 'birth right'",
    "publish_date": "Thu, 16 Oct 2025 00:54:05 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "A new memoir by Virginia Giuffre alleges Prince Andrew felt entitled to have sex with her, according to an extract published in The Guardian .\n\nGiuffre signed off on a 400-page memoir before her death in April about her alleged association with the Duke of York and Jeffrey Epstein.\n\nIn the upcoming book Nobody's Girl, ﻿Giuffre has claimed when she met P﻿rince Andrew at a London townhouse, the prince felt entitled and that sleeping with her was his birthright as a royal.\n\nREAD MORE: More than a million households at critical stress point\n\nGiuffre signed off on a 400-page memoir before her death in April about her alleged association with the Duke of York and Jeffrey Epstein. (Nine)\n\n\"Back at the house, Maxwell and Epstein said goodnight and headed upstairs, signalling it was time that I take care of the prince,\" Giuffre said in the excerpt.\n\n\"In the years since, I've thought a lot about how he behaved.\n\n\"He was friendly enough, but still entitled, as if he believed having sex with me was his birthright.﻿\"\n\nShe said one of the games played ﻿was Epstein and Prince Andrew had to guess her age.\n\n\"When Prince Andrew arrived at the house that evening, (Ghislaine) Maxwell was more coquettish than usual. 'Guess Jenna's age,' she urged the prince, after she introduced me,\" she said in the excerpt.\n\n\"The Duke of York, who was then 41, guessed correctly: 17. \"My daughters are just a little younger than you,\" he told me, explaining his accuracy.\n\n\"As usual, Maxwell was quick with a joke: \"I guess we will have to trade her in soon.\"\"\n\nPrince ﻿Andrew has always denied the allegations against him.\n\nThe book will be published in two weeks, which Giuffre's family has signed off on.\n\nIt is the first time ﻿the world has heard from Giuffre since she made a financial settlement several years ago.\n\nThe Duke of York's office has been contacted for comment.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/australia-rental-affordability-cost-of-living-crisis/69ad6381-5dcd-4190-be08-6a5a049dabea",
    "title": "New report claims most essential workers can barely afford to rent",
    "publish_date": "Thu, 16 Oct 2025 00:55:13 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "Millions of essential workers are at risk of being squeezed out of Australia's rental market without vital housing reforms, a new report argues.\n\nHospitality workers earning the average wage for the job would only be able to afford 0.8 per cent of rentals on the market, according to data from the Rental Affordability Snapshot .\n\nOnly 80 rentals in Victoria were affordable under the average salary of a hospitality worker, and none in the ACT.\n\nThe average hospitality worker could only afford rent in 0.8 per cent of rentals in Australia. (Getty)\n\nThe report, which analysed the price of over 51,000 rentals compared to the average wages of several occupations in Australia, also found that firefighters could only afford 3.2 per cent of rentals around Australia, and paramedics, on average, are only able to afford 2.3 per cent, or 1117 properties.\n\n\"It is a national disgrace that the people we all rely on – nurses, teachers, care workers, cleaners – cannot afford a secure place to live,\" Kasy Chambers from Anglicare, the publishers of the report, said.\n\n\"This report shows that even full-time workers in critical jobs are locked out of most rentals.\n\n\"In many parts of the country, affordability has gone backwards.\"\n\nA common assumption is the problem is largely caused by a lack of supply; essentially, there are too many people renting but not enough houses on the rental market.\n\nHowever, the report argues this year's figures highlight this isn't necessarily the case.\n\nMore houses may be available for rent, but it isn't making them more affordable. (Peter Rae)\n\n\"This year saw an increase in the number of rental listings surveyed for the first time in three years, and yet there was no notable or significant increase in affordability for any essential worker category,\" it said.\n\n\"The theory of trickle-down housing would assume that a thirteen per cent increase in total listings across the country would yield some notable increases in affordability.\"\n\nChambers argues urgent reform is required across the country.\n\n\"We need tax reform to stop pushing up the cost of housing,\" she said.\n\n\"We need to build at least 25,000 new public and community homes each year, rentals that essential workers can actually afford.\"\n\nShe believes the responsibility falls at the feet of state and federal governments: \"The housing crisis is not an accident. It is the result of choices.\n\n\"These results are shocking, but they are also an opportunity for governments to change course and ensure that everyone has a safe, affordable home.\"",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/peter-alexander-ai-campaign-dogs-expert-commentary/307cbe23-bea5-4bcd-8c2e-de9c62838a46",
    "title": "Whatever you think about Peter Alexander's 'creepy' AI dogs, you're about to see a lot more ads like it",
    "publish_date": "Wed, 15 Oct 2025 18:33:06 +0000",
    "category": "finance",
    "authors": [
      "Oct"
    ],
    "text": "Peter Alexander's ﻿new generative AI marketing campaign may have been met with some consumer backlash, but experts say it's the future of brand advertising.\n\nThe retailer, which reported record sales of $548 million last financial year, called it a \"﻿peek into the Peter Alexander universe\" using \"a bit of AI magic to leave limits at the doggy door\" in campaign materials.\n\nAnd consumer psychologists are telling Australians to get used to it, because this will \"absolutely\" be the norm in the future. ﻿\n\nPosts showing the AI-generated dogs featured in Peter Alexander's campaign copped plenty of backlash on Instagram. (Instagram/@peteralexanderofficial)\n\n\"The key question now isn't if AI will be used, but how well brands manage to make AI content feel emotionally authentic and human-centred,\" University of Sydney Business School lecturer and consumer psychologist Dr Christina Anthony told 9news.com.au.\n\n﻿But some Australian shoppers aren't buying it.﻿\n\nMany social media users responded to Peter Alexander's campaign with criticism, questioning the brand's decision to employ AI over human graphic designers.\n\nSome even swore to boycott the retailer over the campaign.\n\nConsumer psychologist, creative strategist, and Thinkerbell founder Adam Ferrier believes the campaign was a \"misfire\" but called the backlash \"ridiculous\".\n\n\"No one cares that much that [Peter Alexander] is creating slightly creepy-looking dogs,\" he told 9news.com.au.\n\nHe likened the uproar to that over the use of Photoshop in marketing back in the 2000s and said he seriously doubts anyone will actually boycott the brand.﻿\n\n\"Advertising has to be incredibly bad, like almost inconceivably bad, to put people off going somewhere and that never happens,\" Ferrier said.\n\n\"At its worst, it normally evokes a few complaints from a few keyboard warriors, but even that's not going to really damage the brand.\"\n\n9news.com.au has made multiple attempts to contact Peter Alexander - which, like stationery brand Smiggle, is owned by Premier Investments - for comment.﻿\n\nThe retailer's latest campaign leans heavily into generative-AI. (Peter Alexander)\n\nPeter Alexander certainly isn't the first brand to embrace generative AI in marketing.\n\nIn August, J Crew and Vans launched an AI campaign promoting their collaboration, followed by the likes of Guess, Valentino, and Moncler.\n\nReactions were mixed, with some critics slamming the campaigns as \"AI slop\" while others called it the future of brand advertising.\n\nHow positive the reactions were seemed to depend on how good the AI was.\n\n﻿\"At the moment, there are a lot of brands trying to use AI and using it in a really clumsy way that's getting a lot of ridicule,\" Ferrier explained.\n\n\"Peter Alexander, they've always had a dog in their advertising ... but as soon as it comes to life as AI, it looks creepy and weird.\"\n\nBut when used well, AI can be a powerful marketing tool.﻿\n\nFerrier has embraced it at Thinkerbell, which recently worked on campaigns for Victoria's Transport Accident Commission (TAC) and Menulog using generative AI.\n\nThere was some blowback but Ferrier predicts Aussies will quickly come to accept AI marketing as it becomes more mainstream.\n\n\"It is likely that over time consumers will not react with the same shock or scepticism,\" Anthony agreed.\n\nShe said brands will also become better at creating ﻿\"human-centred\" AI content that evokes more positive reactions.\n\nLike, for example, a pyjama campaign with dogs that look a little less \"uncanny valley\".\n\n\"Consumers expect warmth, playfulness, and a human touch from a brand like Peter Alexander ... they don't want to see a slick AI dog in their ads,\" she added.\n\nExperts predict that as generative AI becomes more powerful and realistic, brands will increasingly utilise it to cut costs, increase output, and personalise content at scale.\n\nIn some cases, that may be at the cost of human jobs﻿.\n\nAnd even though some Aussies will continue to protest its use in brand advertising, the blowback is unlikely to hurt most companies' bottom line.﻿\n\n\"People might express frustration or disapproval initially, but unless a strong alternative brand activates their values better, many will continue shopping out of habit or convenience,\" Anthony said.\n\n\"And ﻿most brands won't abandon generative AI as the efficiencies are too valuable.\"\n\nHave you got a story? Contact reporter Maddison Leach at mleach@nine.com.au",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/national/antibiotic-resistance-rising-in-children-around-the-world-australian-experts-say-whats-next/07458f7b-59b9-4138-a582-5e4b37cd924f",
    "title": "Warning as bacterial resistance to antibiotics soars on Australia's doorstep",
    "publish_date": "Tue, 14 Oct 2025 19:18:53 +0000",
    "category": "lifestyle",
    "authors": [
      "Oct"
    ],
    "text": "Disease resistance to antibiotics is rising faster than ﻿medical advances can keep up with, potentially putting billions around the world in danger.\n\nThe World Health Organisation﻿'s Global Antibiotic Resistance Surveillance Report found that one in six laboratory-confirmed bacterial infections that caused common conditions in people worldwide in 2023, were resistant to antibiotic treatments.\n\nBetween 2018 and 2023, the report found antibiotic resistance in people rose 40 per cent, or 5 to 15 per cent each year.﻿\n\nAntibiotic resistance is riding around the world. (Getty)\n\nAnita Williams, from the Centre for Child Health Research at the University of Western Australia, said the findings were \"alarming but not surprising\".\n\n\"Thankfully, the proportion of resistance in Australian children is lower than global averages,\" she said.\n\n\"Whilst globally 45 per cent of E coli were resistant to 3rd generation cephalosporins, in Australian children it was only 21.5 per cent. For methicillin-resistant staph aureus (MRSA), globally it was 27.1 per cent, whilst in Australian children it was 13.6 per cent.\"\n\nWithout effective antibiotics, even routine surgeries could become extremely risky. (Getty)\n\nHowever, she said, antibiotic resistance from bacteria in children was nonetheless on the rise in the country.﻿\n\nProfessor Mark Blaskovich from the Institute for Molecular Bioscience said that the nearby South East Asia region had one of the highest levels of resistance at 31 per cent, which posed a potential danger of transmission to travellers.\n\n\"Particularly worrying is the finding that some of our more powerful antibiotics are being used more widely than they should be, meaning that resistance to these important antibiotics will continue to develop more quickly than it should, leading to their obsolescence,\" he said.\n\nResistance from bacteria that cause diseases like E coli is increasing. (Getty)\n\n\"This leads to the need for new antibiotics, but as outlined in another recent WHO report, the development pipeline for new antibacterial agents is sparsely populated.\n\n\"While Australia is doing relatively well compared to the rest of the world, it must not be complacent and should commit to funding research that combats antibiotic resistance.\"\n\nMultiple experts noted that in countries with weaker health systems - usually poorer countries - the problem was, but that the current hyper-connectivity of the world meant transmission of resistant bacteria could happen very easily.\n\n\"Because about five million deaths were associated with antimicrobial resistance (not just antibiotics, but also antivirals and antifungals),\" Associate Professor Sanjaya Senanayake from The Australian National University said.\n\n\"By 2050, this could reach 10 million deaths a year and have a negative impact on global GDP with global losses of US$100 trillion ($153.4 trillion).\"\n\nHe and others rejected the idea that tightening prescription requirements for antibiotics was a catch-all solution﻿.\n\n\"It is not just an issue of doctors prescribing antibiotics inappropriately. Instead, it also includes the vast spectrum of antimicrobial use not just in humans, but also in animals and plants, the use of the unprescribed over-the-counter antibiotics, the contamination of waterways with antibiotics, and the development of new antibiotics,\" he said.\n\n\"Developing new antibiotics, however, is not cost-effective for businesses, so they require healthy government subsidies to make it attractive for pharmaceutical companies.﻿\"\n\nPeople can help prevent bacterial spread through simple acts like washing their hands. (Getty Images/iStockphoto)\n\nReece Pharmaceuticals chief executive James Graham said most antibiotic classes had been discovered between the 1940s and 1980s.\n\n\"This innovation gap is colliding with escalating global resistance, leaving doctors with fewer options and patients at greater risk,\" he said.\n\n\"Infections that were once easily treated now mean longer hospital stays, higher treatment costs, and, in some cases, preventable amputations such as those seen in diabetic foot infections.﻿\"\n\nAssociate Professor Andreea Molnar from Swinburne University of Technology laid out the problem starkly, saying without effective antibiotics, even \"routine\" surgeries were \"dangerously risky\".\n\nWhile multiple experts are calling for better surveillance and increased incentives from government, Dr Trent Yarwood of the ﻿Australasian Society for Infectious Diseases, said everybody had a part to play.\n\n\"Prevent infections by washing your hands, getting vaccinated and practising good food safety,\" he said.\n\n\"Only take antibiotics when they are necessary and only for as long as is recommended by your doctor.\"",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/world/dangelo-death-grammy-winning-r-and-b-singer-michael-eugene-archer-untitled-how-does-it-feel-dies-at-51/82b694fb-bf70-4503-aab0-ef86f37c28b0",
    "title": "Grammy-winning R&B singer who became an icon dead at 51",
    "publish_date": "Tue, 14 Oct 2025 17:02:40 +0000",
    "category": "entertainment",
    "authors": [
      "Oct"
    ],
    "text": "D'Angelo, the Grammy-winning R&B singer recognised by his raspy yet smooth voice and for garnering mainstream attention with the shirtless\n\nUntitled (How Does It Feel)\n\nmusic video, has died. He was 51.",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/public-wi-fi-a-major-cause-of-hacking-warning/105896946",
    "title": "Public wi-fi a major cause of hacking, consumer affairs authorities warn",
    "publish_date": "Thu, 16 Oct 2025 01:32:14 +0000",
    "category": "finance",
    "authors": [],
    "text": "The first time Perth man Casey Grogan, who runs a media and videography business from home, knew that he had a major issue with internet security was when a client contacted him about a strange email he'd received.\n\n\"I had a client who was in America at the time just hit me up on WhatsApp to say, 'Have your bank account details changed?'\" Mr Grogan told Nadia Mitsopoulos on ABC Radio Perth.\n\nHis client told Mr Grogan he had received an email from his address, advising of a change of account details for payment of an invoice. But the tone had sounded off, prompting the client to contact Mr Grogan directly.\n\n\"He got the ball rolling, thank goodness,\" he said.\n\nMr Grogan quickly created a new email address and contacted his other clients to let them know, then discovered the hackers had been able to infiltrate that new address as well.\n\nHe has since engaged the services of an expert in combating hacking and discovered the cyber criminals had been right through his devices.\n\n\"They've accessed my Google account. They've known where I've been going. They've done Facebook, Instagram. They've deleted photos of passports, emails,\" he said.\n\n\" I'm unsure of what the future holds because I had a tech guy come over yesterday and he was telling me some stories of what they can do with all of this stuff. \"\n\nShared wi-fi suspected\n\nHe did not know exactly how he got hacked but suspected it happened on a recent work trip to Victoria, when he noticed his laptop slowing down after he used the wi-fi in his hotel room.\n\n\"There's a massive problem, I found out, with any kind of public or hotel or airport wi-fi,\" he said.\n\nWA Consumer Protection Commissioner Trish Blake said any kind of shared public wi-fi was known to be a huge vulnerability.\n\n\"If you are using free wi-fi at the airport, at your local fast-food takeout, in the mall or in a shopping centre, do nothing more than look at maps or search something on Google. That is it,\" Ms Blake said.\n\n\"Don't do emails and absolutely do not do your banking on those free wi-fi systems.\"\n\nWA Consumer Protection Commissioner Trish Blake in the ABC Perth office. (ABC News: Cason Ho)\n\nMs Blake said the agency recorded a large spike in payment redirection scams after the pandemic led to many people working from home.\n\nShe said many professionals were working from cafes on the venues' free wi-fi.\n\n\"Those free wi-fis are deliberately open with very little protection around them because they're intended to be accessible by everybody in a big space,\" she said.\n\n\"We had a consumer who lost thousands of dollars after using a free wi-fi on a cruise. It is so simple for scammers to access it.\"\n\nExtra layers of protection\n\nShe also recommended people use a virus protection service on their phone, just as they would with a home computer or laptop.\n\n\"Our computers are these little handheld devices that are in our pockets that we carry around with us everywhere,\" she said.\n\n\"Any virus protection that you can have for your computer or your laptop will also have a version that's available for your mobile phone.\n\n\"Get it from a reputable source. Do not use free virus protection.\"\n\nFree public Wi-Fi should not be used for email or banking, consumer protection warns. (ABC News: Liam Phillips)\n\nShe said people also needed to get used to using multi-factor authentication on all their important apps, either through codes sent to the mobile phone or facial recognition.\n\n\"One thing that scammers cannot do is steal your face,\" she said.\n\n\"Take the time. Yes, it's annoying, but do it because being annoyed is far, far better than losing money.\"\n\nShe said Western Australia also offered an additional layer of identity protection through driver's license locking.\n\nThis can be done online and means that driver's license details, if stolen, cannot be used towards taking out credit or accessing bank accounts.\n\nIf a person is applying for credit or needs to use their ID for another reason, the license can be temporarily unlocked online then locked again to prevent hackers using it.\n\n'It feels like a break-in'\n\nWhile Mr Grogan was able to catch the hackers before much money was lost, the idea that they may have listened to his phone calls and looked at family photos on his phone left him feeling very disturbed.\n\n\"It's horrible. People spend a lot of money on home security, cameras and everything, because they don't want their TV stolen,\" he said.\n\n\"You can literally walk out onto the street with some basic viral virus stuff on your phone and your whole life can be turned upside down.\n\n\" It's so intrusive. It's like someone has walked into my bedroom at night, shirtless with a knife, just laughing at me. \"\n\nOne of the first signs for Casey Brogan was his laptop computer suddenly slowing down. (Unsplash: Jay Wennington)\n\nTrish Blake said it was important to remember that victims of cybercrime, while never in physical contact with their assailant, suffered an invasive event.\n\n\"It is absolutely a crime. You have been a victim of a crime,\" she said.\n\n\"Often my team spend a lot of time linking victims of scams into their GP and to counsellors because it takes a personal toll and it's a very normal reaction to this very invasive event.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/treatment-options-at-act-pharmacies-set-to-be-expanded/105898212",
    "title": "ACT pharmacists set to be able to offer more treatment options",
    "publish_date": "Thu, 16 Oct 2025 01:07:34 +0000",
    "category": "finance",
    "authors": [],
    "text": "The ACT government has announced it will expand the range of services Canberra pharmacists are allowed to provide.\n\nThe expanded services will include the administering of flu vaccines to children as young as two.\n\nPharmacists will also be able to treat for mild, acute musculoskeletal pain, gastro-oesophageal reflux disease, allergic and non-allergic rhinitis, acne, and acute nausea and vomiting.\n\nThe widening of these services follows a pilot program announced in 2024, which allowed pharmacists to treat uncomplicated urinary tract infections and resupply the oral contraceptive pill.\n\nThe changes will take effect from early 2026.\n\nGPs 'aren't always supportive': minister\n\nACT Health Minister Rachel Stephen-Smith said the decision brings the territory into line with jurisdictions such as New South Wales.\n\n\"Pharmacists play a vital role in ensuring Canberrans are protected from influenza during the winter season, and these amendments will make it more convenient for families to get vaccinated next year,\" she said.\n\n\"We are, as health ministers ... interested in expanding scope of practice for all health professions because we know that we need our workforce to be working at the highest scope to take pressure off the specialists and the general practitioners.\"\n\nMs Stephen-Smith said pharmacists were \"highly skilled professionals\".\n\nACT Health Minister Rachel Stephen-Smith says they want to take pressure off the health system. (ABC News: Michael Barnett)\n\nShe said they would try to align as closely as possible with New South Wales, where similar changes had already taken place.\n\n\"And that means we can really build on the materials that they have, the training that they are establishing, but we're also working with the University of Canberra ... on training here,\" she said.\n\nBut not everyone is in support of the expansion, with the health minister describing the conversation with GPs about the changes as \"challenging\".\n\n\"They aren't always supportive — they certainly have not been supportive in relation to the urinary tract infection trial,\" she said.\n\n\"I think as more evidence comes in, those conversations might become a little easier.\n\n\"But one of the things I really want to reassure people [about] is this really an appropriate role for pharmacists is there is, for this expanded scope, a really significant training program involved.\"\n\nTwo-thirds of pharmacies expected to come on board\n\nPharmacy Guild ACT branch president Simon Blacker welcomed the move.\n\n\"[We're] certainly very pleased that the ACT government decided to go down that path, where ACT patients will be able to get the time and access to services as they need them,\" Mr Blacker said.\n\nPharmacy Guild ACT Branch president Simon Blacker says participants in the program will need to undertake \"strong\" training. (ABC News: Adam Kennedy)\n\nHe said pharmacists would now be able to more effectively treat certain conditions that they saw regularly.\n\n\"Something that we get asked a lot about is acute nausea and vomiting, and being able to give something that's prescription strength to treat that,\" he said.\n\n\"Ultimately, this is about patients in the ACT being able to hopefully stay out of emergency waiting rooms and free up GP appointments by chatting to their local pharmacist.\"\n\nHe said there was a \"strong training program\" that participants would need to undertake before being permitted to consult under the expanded rules.\n\nSome in the ACT have already commenced that program, which runs for more than 12 months.\n\n\"And that gives safety and confidence to the community,\" he said.\n\n\" We envisage that, in time, probably two-thirds of pharmacies in the coming years in offering these services that the minister's announced. \"\n\nMr Blacker says the community should feel confident as the system expands. (ABC News: Adam Kennedy)\n\nMr Blacker said a decade ago, vaccinations at pharmacies were a \"rarity\" but were now common.\n\n\"With these changes, making sure they're safe, making sure we have quality outcomes and making sure that patients appreciate and enjoy what the choice is for them ... in a timely manner, I think over the course of the next 10 years we'll see this help take pressure off the health system and patients, ultimately,\" he said.\n\n\" But it is a slow burn, but that allows it to be a safe transition. \"\n\nAsked if he expected any resistance from GPs about the change, he said they did hear some criticisms sometimes, but worked closely with doctors.\n\n\"But patients get the choice — you can choose,\" he said.\n\n\"It would be great if everyone had a regular GP, that's not the case unfortunately, but if we can help our GP colleagues and help the ACT health system, I think that's ultimately really good.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/australia-unemployment-rate-rises-september-2025/105898244",
    "title": "Breaking: Australia's unemployment rate jumps to 4.5pc",
    "publish_date": "Thu, 16 Oct 2025 01:01:36 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's unemployment rate jumped to 4.5 per cent in September, up from 4.3 per cent in August, in seasonally adjusted terms.\n\nIt is the highest seasonally adjusted unemployment rate recorded since November 2021.\n\nAn increase in both men and women seeking work contributed to the rise in the number of unemployed people in September.\n\nThe number of officially unemployed people rose by 33,900, and the number of those employed rose by 14,900, as the participation rate lifted by 0.1 percentage points to 67 per cent.\n\nIn trend terms, which attempts to smooth out seasonal noise from the data, the unemployment rate remained steady at 4.3 per cent.",
    "source": "ABC",
    "cluster_id": 0
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/broken-hill-man-ran-to-newcastle-with-broken-femur/105866122",
    "title": "'Marathon Mitch' manages to finish 1,100km charity run with broken hip",
    "publish_date": "Thu, 16 Oct 2025 00:30:52 +0000",
    "category": "sports",
    "authors": [],
    "text": "A man who ran more than 1,000 kilometres through the outback to raise money and awareness for a rare disorder managed to complete the final leg with a fractured hip.\n\nMitch McKenny spent four weeks pounding the bitumen highway between Broken Hill and Newcastle on his mission for Angelman syndrome, which his friend's child, Huxley Maguire, was diagnosed with at four months old.\n\nThe rare genetic condition affects the functioning of nerves in the brain and can cause physical and intellectual problems.\n\nNear Narromine, some 715km into the 34-year-old's massive run, after averaging eight hours a day of running for about two weeks straight, he began to experience pain in his hip.\n\nMitch McKenny ran past canola fields near Dubbo. (Supplied: Huxley's Heroes)\n\nMr McKenny put it down to a pulled muscle and took the foot off the ignition for the 40km stretch between Narromine and Dubbo.\n\n\"[I was] under the impression at that stage that it was some kind of muscular injury or ligament injury,\" he said.\n\n\"[I] had a bit of a down-low kilometre day that day and the next day.\n\nTed Johnson rode his bike alongside Mitch McKenny into Dubbo. (ABC News: Nick Lowther)\n\n\"By the time I got to Dubbo, I was moving pretty slowly,\"\n\nAs Mr McKenny ran into Dubbo, he was met by a cheering crowd and seven-year-old Ted Johnson, who, like Huxley, lives with Angelman syndrome.\n\nWith his pushbike, Ted accompanied \"Marathon Mitch\" as he made his way through town.\n\nBut Huxley's family, who had been following along behind Mr McKenny, knew something was wrong when they caught up with him again in Dubbo.\n\n\"He was in pain. That was evident,\" Jess Maguire said.\n\n\" But we nowhere near thought that the extent would be a break in the hip. \"\n\nMitch McKenny is unsure when during his run he sustained his injury. (Supplied: Huxley's Heroes)\n\nAfter pushing him to go to Dubbo Hospital, he was given a full physical exam, and doctors implored Mr McKenny to quit the run before he did serious damage, but he would not hear of it.\n\nInstead, he hit the road again and miraculously finished the final 380km despite his pain growing rapidly worse.\n\nAs he arrived in Newcastle on September 19, it was to much fanfare and a neck femur fracture in his right hip.\n\nSupporters celebrated with Mitch McKenny at Nobbys Beach in Newcastle. (ABC Newcastle: Keely Johnson)\n\nIn the process, he also raised more than $160,000 for the Foundation for Angelman Syndrome Therapeutics Australia (FAST).\n\nFeat of strength and endurance\n\nNearly a month on, Mr McKenny is still confined to crutches and will be for the next six weeks, but has no regrets.\n\nAfter undergoing X-rays and MRIs, it became apparent he had suffered a stress fracture somewhere on his massive run, although he is still not \"100 per cent sure\" where.\n\nMitch McKenny ran along major highways during the journey. (Supplied: Huxley's Heroes)\n\nHis Broken Hill GP quickly booked him in for surgery in Adelaide, which left him with a plate and a few pins in his right hip.\n\nThinking back on the run, he said he remembered being in pain, but mostly recalled pushing to finish.\n\n\"I think your mind has a way of blocking out those kinds of memories on the pain and that kind of stuff,\" Mr McKenny said.\n\n\"I'm aware that it took place, [and I'm] happy and proud that we achieved that feat for Huxley, but no plans to do it again.\"\n\nMr McKenny said he believed the curve of the roads he was running on was the likely cause of the stress fracture.\n\n\"[I was] running on the right-hand side of the road so that I could see the cars … for safety reasons,\" he said.\n\n\"There's camber on the road, which unevenly distributed, I suppose, the force between both legs, so after a few days or a week, that started to build up.\"\n\nMitch McKenny received a warm welcome when he ran into Dubbo. (ABC News: Nick Lowther)\n\nIt means his running days are behind him for now, but it was not something Mr McKenny said he felt too upset about.\n\nHuxley's mothers, Bree and Jess Maguire, could not be prouder of Mr McKenny's efforts for their baby son and others who live with Angelman syndrome.\n\n\"It just goes to show again the drive and determination that he had to complete the run,\" Jess Maguire said.\n\n\"It's just incredible what he's done. You can't put it into words.\"\n\nFor now, Mr McKenny is taking a rest and looking forward to walking without crutches in six weeks' time.",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/afl-trade-period-2025-which-team-came-out-the-most-ahead/105897898",
    "title": "Which team 'won' the AFL trade period — and does free agency need a fix?",
    "publish_date": "Thu, 16 Oct 2025 00:19:40 +0000",
    "category": "sports",
    "authors": [],
    "text": "After a season's worth of speculation and a frantic last afternoon filled with star-filled moves (and almost-moves), the dust has finally started to settle on the 2025 AFL trade period.\n\nThis year's trade cycle was particularly action packed, with the most deals being made since 2018. As a result the league is set to take a somewhat different form in 2026.\n\nThis year's player movement period was headlined by some of the most prominent names in the game, with players such as Christian Petracca, Charlie Curnow, Clayton Oliver, Jack Steele, Tom De Koning, Oscar Allen, Brandon Starcevich, James Worpel, Will Hayward and Sam Flanders finding new homes for next year.\n\nThe draft order has also been up-ended, with four clubs holding the first eight picks in consecutive order at the present time.\n\nWhile the whistle may have only been just blown on all the \"action\", some clear trends (and potential future winners) have already emerged from the off-season.\n\nSt Kilda going for broke\n\nJust like the real game of football, the off-field game can be played in a variety of ways.\n\nSome like to close shop to the media and pursue the small targets. Others focus on the draft and building \"the right way\".\n\nA rarer group makes the decision to swing for the fences, in a hope to turn their fortunes around.\n\nSt Kilda is the standard bearer in 2025 for those looking to surge up the ladder in a hurry.\n\nIt's not the first time the Saints have made a big splash at the trade table. In 2019 the Saints traded in Dan Butler, Bradley Hill, Paddy Ryder, Dougal Howard and Zak Jones in a push to rise back up the ladder.\n\nThe injection of talent worked and the Saints played finals footy for the first time in nine years. But it was also relatively short-lived, with the Saints yo-yoing up and down the ladder since. With just one finals win since 2010 the time seemed to be now to strike.\n\nWith a relatively clean set of books the Saints were ready to add depth and talent to their list. The Saints have welcomed four high profile players into the club this offseason, with all set to contribute from day one.\n\nAll four of Tom De Koning, Liam Ryan, Sam Flanders and Jack Silvangi are set to be best 23 players next year, filling different roles across the ground.\n\nDe Koning is the player who is expected to have the biggest long term impact of any to find new clubs in 2026, with the new Saints ruck set to impact from day one at Moorabbin.\n\nHe is capable in the air and at ground level, and can catch opposition rucks napping when he floats forward.\n\nMany expected Rowan Marshall to part ways with St Kilda to make room for the former Blue, but the Saints brain trust appears keen to pair the two mobile rucks together.\n\nThe twin towers should also help to bolster a forward line lacking in size and aerial contest ability inside 50 in recent years.\n\nThe only departures via trade were former captain Jack Steele and Max Heath — both going to Melbourne.\n\nThese acquisitions place immediate pressure on coach Ross Lyon and the Saints to repeat their 2020 rise up the ladder.\n\nThe Saints weren't the only club to look to solidify their side for next season, with the Cats and Giants looking to fill holes in their midfield with James Worpel and Clayton Oliver respectively.\n\nOther sides looked at the longer term, with clubs like Melbourne and Carlton looking to accumulate draft picks for this and future years.\n\nSome clubs worked hard to ensure they had enough picks to satisfy their father-son and academy talents both this year and next, with the Lions, Suns, Blues and Swans set to welcome prominent players in those cycles.\n\nGreylands and the aging game\n\nChristian Petracca earned more Brownlow Medal votes than any other player between 2021 and 2023.\n\nCharlie Curnow kicked more goals than anyone in the league between 2022 and 2024.\n\nBoth are multiple time All Australians, amongst award-stuffed resumes.\n\nAnd both are set to play for new clubs in 2026.\n\nPetracca and Curnow aren't the only highly credentialed players to find new clubs via trade this off-season, but they have formed a class of their own as a result of their moves.\n\nNo club has spent more draft capital bringing in players their age or older over the last decade, with the trade packages for both stars outstripping prior deals such as the 2017 Bryce Gibbs trade and last year's move involving Tom Barrass.\n\nIt's a sign that clubs are becoming more willing to spend on older players than any before.\n\nThe average age of AFL players is older than any point in the last 100 years.There has been a re-evaluation of how long AFL players can contribute at the top level, alongside increased financial rewards for players keeping them in the game.\n\nThe large hauls are also a sign of clubs increasingly digging their heels in on moving contracted players to new clubs.\n\nDeals for Marshall and Essendon captain Zach Merrett fell over at the last hurdle as their existing clubs asked for more for their valued (and long-tethered) players.\n\nEven the Curnow deal came down to the last five minutes, with the inclusion of a Swans 2027 first rounder turning a Carlton refusal into a done deal. These trends may rebalance the entire trade landscape in future years.\n\nBoth Sydney and the Suns see themselves in the midst of premiership contention, and players of the calibre of Curnow and Petracca aren't available every year.\n\nNeither player comes without questions. Both players are coming off a down year, and have extensive injury histories that they've battled through.\n\nThe on-field fit seems a little odd at face value as well, with Petracca joining one of the deepest midfield (and mid-forward) groups in the league, while Sydney has a large number of talented key position forwards (fitness pending).\n\nBoth clubs appear to be backing their coaching staff to make it work.\n\nIt's likely that they've given up more than they'll get back long term for both players, but it might just catapult them to the top of the premiership podium in the meantime.\n\nFuture future focus\n\nFor the first time clubs could trade picks two years in advance of the current draft class. This extra flexibility was set to open up the trade period, with extra currency floating about to get players to new homes.\n\nInstead, clubs were hesitant to dip that far into the future just yet.\n\nInside the AFL's battle of generations The AFL approaches expansion at a time where there is more talent in the league than ever before courtesy of veterans extending their primes and young players entering the league ready to cause a splash right away.\n\nOf the 62 picks traded so far, 42 were for this year's draft, 14 were for the 2026 draft and six are set for the 2027 draft. Just one of those 2027 picks traded was a first round selection — used in the Curnow deal.\n\nThis year's draft isn't considered to be a strong class due to the large number of top end talents tied to clubs via the father-son or academy pathways.\n\nThe depth has also been questioned, with this draft shaping to have fewer than the usual number of entry age level draftees chosen. As such, the higher than usual cost for players like Curnow may be explained by club views on the talent available for selection.\n\nThere are also likely a few reasons why clubs have been hesitant to trade two years in advance — or at least so far.\n\nFirstly, there is flexibility from holding onto your picks going into each coming trade period. As evidenced by the chaos this year, few can predict who will become available year-on-year, or who might ask to leave.\n\nAFL trade deadline day five quick hits The AFL trade period's deadline day delivered more drama than ever before as clubs and agents clashed in the pursuit of last-minute deals — some of which got over the line, and many of which fell through.\n\nSecondly, the mooted entry of Tasmania is set to throw the draft and trade periods off-balance in several ways. Most directly, pending the confirmation of their entry into the league in 2028, the Devils will receive seven picks in the first round and the first pick in every round after that.\n\nWhile Tassie has to trade many of those selections, it will push every other club down the draft order.\n\nThe Devils will also sign uncontracted players and free agents across the league, generating compensation selections that both slide other picks further down the order, and give clubs extra picks to play with.\n\nTasmania will also have access to underage players a year out from the draft, likely diluting the pool by removing top players in advance of the actual draft.\n\nAll in all, a mid-first round pick in 2027 — such as the pick Carlton just picked up from Sydney — might end up beyond 20th in the actual draft order and be vying for only 30th best 18 year old in the country.\n\nDoes free agency need fixing?\n\nThis player movement period also laid out the warts of the current AFL free agency system, with clubs working to maximise the compensation picks generated and circumvent some of the equalisation mechanisms set out by the league.\n\nThe most prominent example of this is the trade of Brandon Starcevich from Brisbane to West Coast in order to preserve the compensation pick awarded for Oscar Allen's move the other way.\n\nStarcevich was a free agent coming into the offseason, but if he had moved as a free agent this would have offset some of the value of the Allen move and moved West Coast's freshly minted pick two back a round or two.\n\nBoth clubs involved ended up ahead in picks, at the expense of the other sixteen clubs in the league. The Eagles and Lions weren't the only clubs involved in such moves either, with Melbourne trading Brody Mihocek in, rather than signing in free agency to preserve their compensation for losing Charlie Spargo.\n\nThere also remains questions about the high level of compensation awarded for lost players. It is understood that the league benchmarks player salaries in upcoming years against past salaries, potentially inflating the picks awarded to clubs.\n\nWith clubs across the league knowing the broad inputs to the compensation formula, it is unsurprising that clubs are working to maximise the return for their players by any means necessary.\n\nIt's also why the free agency system is overdue for review in the coming years.",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/essential-workers-priced-out-of-rental-housing-queensland/105893520",
    "title": "Rental affordability report shows essential workers being priced out of housing",
    "publish_date": "Wed, 15 Oct 2025 23:49:25 +0000",
    "category": "finance",
    "authors": [],
    "text": "Cody Nesbit dreams of owning a home but the Gold Coast barista is struggling to save and says it's hard to see light at the end of the tunnel.\n\nHe's not alone, a new report from Anglicare has revealed less than 1 per cent of rentals in Queensland were affordable for the average hospitality worker.\n\nAccording to the annual Rental Affordability Snapshot, a bartender who wanted to live alone could not afford a single property in the ACT, only five in the Northern Territory and just 80 across the whole of Victoria.\n\nThe situation is not much better for paramedics, aged care professionals, nurses, delivery drivers and early childhood educators who are being priced out of the rental market across the country.\n\nMr Nesbit manages a popular cafe in Mermaid Beach and pays $400 per week for a room in a Miami share house he rents with three other people.\n\n\"Rent has gone up dramatically every year,\" Mr Nesbit said.\n\n\"Everything has gone up. The only thing that hasn't gone up is our wage.\"\n\nBarista Cody Nesbit says it is difficult for Gold Coast hospitality workers to save money. (ABC News: Nicole Dyer)\n\nThe 35-year-old is studying teaching and hopes to land a job at an outback school when he graduates, where he hopes the cost of living will be lower than the coast.\n\nIt's a sacrifice he said will allow him and his partner to save for a deposit.\n\n\"My partner and I chat a lot about what the future holds for us and what we need to do, and the outcome seems grim,\" he said.\n\n\"We want to be able to afford to have a house, we want to be able to afford to have kids.\n\n\"You used to be able to go out and enjoy a night on the town, buy your groceries, pay your bills and still be able to put some money aside — that's gone now.\"\n\nMany full-time workers are being forced to move away from capital cities for cost of living relief. (ABC News: Keana Naughton)\n\nAffordability 'going backwards'\n\nAnglicare's annual Rental Affordability Snapshot has laid bare the impact of Australia's housing crisis and rising cost of living on essential workers.\n\nThe study surveyed 51,000 rental listings nationwide and tested them against the full-time wages of 16 frontline occupations communities cannot function without.\n\nIt found early childhood staff could afford just 0.8 per cent of rental properties, 1.1 per cent were affordable for a cleaner, 1.5 per cent for nurses, 2.3 per cent for ambulance officers and 3.3 per cent for school teachers.\n\nOn the Gold Coast, one of the country's most expensive rental markets, the report revealed someone on minimum wage would only be able to afford two of the 1,563 available rentals.\n\nAnglicare Australia executive director Kasy Chambers said it was a \"national disgrace\" that hard-working people struggled to keep a roof over their head.\n\n\"This report shows that even full-time workers in critical jobs are locked out of most rentals,\" Ms Chambers said.\n\n\"If they cannot afford to live where they work then schools, hospitals, and aged care homes will struggle to keep running.\"\n\nAnglicare Australia executive director Kasy Chambers says the housing crisis is a result of decades of poor policy. (AAP Image: Lukas Coch)\n\nDespite the number of listings growing by 13 per cent, there was no significant increase in affordability for essential workers.\n\nThe study found there was little relief outside of the capital cities, which according to Anglicare dispelled the \"myth\" that people struggling to afford rent should simply move to a regional area.\n\nMr Nesbit said he was frustrated that many older people assumed his generation did not have sensible spending habits.\n\nHe said he knew many people in the hospitality industry who worked second jobs or had moved back in with their parents.\n\n\"We all work really hard,\" he said\n\n\"It has been tough. Everyone is in the same boat.\"\n\nMs Chambers said Australia's housing crisis was a manufactured problem and governments needed to urgently change course to solve it.\n\n\"It is a system that works for investors, but shuts out everyone else,\" she said.\n\n\"The solution is clear: we need tax reform to stop pushing up the cost of housing, we need to build at least 25,000 new public and community homes each year and we need stronger protections for renters, so people are not left at the mercy of an unfair system.\"",
    "source": "ABC",
    "cluster_id": 2
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/historic-madura-plains-for-sale-wa-sheep-station/105894986",
    "title": "Remote sheep station 'turbocharged' by water supply hits the market",
    "publish_date": "Wed, 15 Oct 2025 23:06:26 +0000",
    "category": "finance",
    "authors": [],
    "text": "Weeks after the West Australian government approved the transfer of Rawlinna Station on the Nullarbor Plain to a UK-based pastoral company, another of Australia's largest sheep stations has been listed for sale without price.\n\nMadura Plains Station is located 700 kilometres east of Kalgoorlie, near the West Australian and South Australian borders and is intersected by the Eyre Highway.\n\nConsidered one of the most productive sheep stations in WA, last shearing saw 76,000 head of merinos pass through its gates.\n\nIn such a remote location, available water on the property through artesian and groundwater bores has a long history of attracting graziers and highway travellers, and today an extensive 1,400 kilometre pipeline network for stock watering is considered a jewel in its crown.\n\nMadura Plains has 206 water points supplied by bores. (Supplied: Elders Real Estate)\n\nElders Real Estate divisional CEO Tom Russo said water from three bore-fields now reached 206 water points across the station through solar-powered pumps, which were remotely accessible through a telemetry system.\n\n\"You can sit in your home in a capital city and look at every single water point in that property in real time and understand what is going on,\" he said.\n\n\"It's extraordinary, [the water development] has turbocharged the property and really opened up those saltbush plains … its production capacity is enormous.\n\n\" In a good or an average season, I think you can assume it can run 60,000 sheep very easily, but when things are really good, things can ramp up, as we saw last year. \"\n\nWind and solar monitoring\n\nAlmost 150 years have passed since European settlers first established a homestead and horse breeding enterprise for the British Army at the property.\n\nIn 1935, South Australian newspaper the Kimba Dispatch described \"a mighty artesian bore\" on Madura, producing hot water which was a popular bathing spot for people in the region, \"even swaggies\".\n\nSheep at Madura graze on saltbush and bluebush plains. (Supplied: Elders Real Estate)\n\nOver the years, the station has seen rabbit plagues, bushfires, people absconding from the law and the discovery of mysterious bones, all while sheep and cattle grazed its saltbush and bluebush plains.\n\nIts future may also include renewable energy.\n\n\"This property sits right in the middle of the Western Green Energy Hub. If it came through, it would be one of the biggest, if not the biggest, hydrogen projects in the world,\" Mr Russo said.\n\n\"There's a lot of data being collected off the property around wind and solar output … whoever buys this property will be very confident that in some point in time there is going to be additional revenue coming from a project of that nature.\n\n\"I don't think it would materially interfere with the pastoral operation, the two can coexist nicely.\"\n\nAn extensive off-grid solar system has been built on the property. (Supplied: MyEnergy Engineering)\n\nThe 711,638 hectare property is currently owned by the South Australian-based Cooper family, which purchased Madura from agribusiness Jumbuck in 2016.\n\nIts listing comes after Consolidated Pastoral Company purchased nearby Rawlinna Station for an undisclosed sum.\n\nCPC has made clear its focus is to revitalise Rawlinna and return it to significant sheep and wool production.\n\nMadura is fenced into 118 paddocks. (Supplied: Elders Real Estate)\n\nMr Russo said it was a \"fortunate coincidence\" the listing of Madura followed the Rawlinna sale.\n\n\"It's being offered in a really good market … I think we'll see a big field of really good candidates, both existing incumbent pastoralists and bigger institutional investors having a good hard look at it,\" he said.\n\n\"The outlook for sheep is really good, the wool market is coming back strongly, which is well overdue.\"\n\nMadura will be sold with approximately 40,000 head of sheep.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/auditor-general-lays-out-slow-reponse-to-2022-floods/105895512",
    "title": "Auditor-general says Victoria risks losing flood recovery money",
    "publish_date": "Wed, 15 Oct 2025 22:55:08 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Victorian Auditor-General says state government agencies need to speed up flood-related claims and not miss out on Commonwealth funding.\n\nThe points are among four recommendations laid out in a 40-page report evaluating the Victorian government's response to the October 2022 floods.\n\nThe auditor-general questioned whether relief and recovery efforts were sent quickly enough to people in Rochester, Shepparton, Echuca and Maribyrnong and if the money spent was justified.\n\nTracie Kyne says red tape has held up insurance claims. (ABC News: Tyrone Dalton)\n\n\"It was clearly obvious that 988 homes [in Rochester] were inundated with water during that 2022 flood,\" Rochester Flood Mitigation Group member Tracie Kyne said.\n\n\" It took so long for funding to come through to those who needed it most and were desperate for assistance. The red tape was just beyond ridiculous. \"\n\nThe Victorian Auditor-General's Office (VAGO) found that then Treasurer Tim Pallas approved $981.2 million in recovery funding within a fortnight of the floods, but it took up to six weeks for food relief, waste and debris disposal and free kindergarten for families to be made available to affected residents.\n\nVAGO found the Victorian government had spent $1.66 billion on flood recovery to June 2023, but requests made by departments to the Commonwealth lacked documentation, evidence and rationale to justify the spending.\n\nThe auditor-general's office said that because of this, the Victorian government could miss out on some funding through the Disaster Recovery Funding Arrangements.\n\nRochester residents say assistance from the Victorian government for food relief and clean-up took too long. (ABC News: Michael Lorigan)\n\nIn February this year, a letter from the federal Minister for Emergency Services, Senator Jenny McAllister, revealed the Victorian government did not apply for a co-funding arrangement with the Commonwealth to establish a build-back-better housing scheme.\n\nMs Kyne and fellow group member, Leigh Wilson, have led calls for the Victorian government to futureproof flood-prone towns by building homes higher and improving water management at basins and reservoirs.\n\nA parliamentary inquiry into the 2022 floods made 73 recommendations to the government, of which the government accepted 16 in full in January.\n\nAssessors held up funding claims\n\nThe Victorian Auditor-General found that assessors working for the Department of Transport and Planning held up the release of funding by requesting more information from local government organisations in 65 per cent of the cases.\n\nIt said in most cases, regional councils had met submission deadlines, but that by sending the requests all at once towards the end of a financial year, it created a high workload for the department.\n\nMember for Northern Victoria and Liberal Party MP, Wendy Lovell, said the delay in funding from the Victorian government for 77 outstanding projects meant communities could not complete important projects.\n\n\"We also see in this report that it's taken them 214 days on average to assess the claims, and that's a very long time,\" she said.\n\n\"That's over seven months, so we're now three years out from the floods, and we've still got projects that haven't been progressed.\n\n\"This just shows how slow the flood recovery has been.\"\n\nRural Councils Victoria secretary Bradley Thomas said VAGO's report was a good opportunity to review the claims process councils had to go through to repair public assets.\n\nBradley Thomas says the floods claims process was \"burdensome.\" (Supplied: Rural Councils Victoria)\n\nMr Thomas said rural councils experienced a lot of natural disasters, and the claims process had become very \"burdensome\" and \"very bureaucratic,\".\n\n\"It's a really complicated process, and we think the report calls that out in part,\" he said.\n\nVAGO said it was clear that the Department of Transport and Planning, the body responsible for assessing flood-related funding claims, was not meeting its target of assessing claims within four weeks of being lodged.\n\nIt acknowledged that the times had improved from their peak in May 2023 of 429 days.\n\nVAGO wants the department to double the number of assessors it employs and simplify assessments for low-value claims.\n\nThe VAGO report found that all claims made by local councils in the 2022-23 financial year met Commonwealth funding requirements, but since then $15.6 million (or 5.8 per cent) of claims made by Victorian government departments for Commonwealth funding were ineligible because not enough evidence was provided.\n\nThat resulted in pressure on the Department of Transport and Planning and Emergency Recovery Victoria.\n\nThe report says regional councils are still submitting their certified estimates and will have waited more than three years for public assets to be restored.\n\nThe Victorian government has been contacted for comment.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/victorian-primary-schools-screen-time-limit/105897548",
    "title": "Victorian schools to limit screen time, provide free laptops",
    "publish_date": "Wed, 15 Oct 2025 22:53:33 +0000",
    "category": "finance",
    "authors": [],
    "text": "Students in Victorian primary schools will have screen time limited in class and parents will not have to pay for laptops under major changes to the state's education guidelines.\n\nThe reforms aim to curtail the amount of time students spend on laptops, which the government said had accelerated since the pandemic.\n\nChildren in prep to year 2 will have minimal access to screens, while year 3 to 6 students will spend no more than 90 minutes a day on screens.\n\nSchools will also be required to ensure all students have access to a laptop, which the government said would mean parents would not have to buy the devices.\n\nScreen time will be limited to 90 minutes a day for students in years 3 to 6. (ABC News: Brooke Chandler)\n\nEducation Minister Ben Carroll said it was a major change to the way schools use screens in the classroom.\n\n\"This is a massive shake-up for the education system in Victoria. This will save parents money and it will also improve outcomes for kids,\" he said.\n\n\"We want an education system that fosters critical thinking, creativity and collaboration.\n\n\" We've already got phone-free schools, now we're going to have screen-free schools. \"\n\nVictoria's Education Minister Ben Carroll said schools will ensure all students have access to a laptop. (ABC News: Nico White)\n\nMr Carroll said the reforms go hand in hand with the social media ban and Victoria's ban on mobile phones at schools.\n\n\"A reliance on screens is having a big impact on behavioural issues, having a big impact on our students' concentration in the classroom,\" he said.\n\n\"These are really important reforms in the digital age. We know children born today are digital natives, but we want them to have a childhood as well, be out in the playground, be fostering those social relationships.\"\n\nThe screen time limits will be mandatory at all Victorian state primary schools from 2027.\n\nThe Australian Education Union (AEU) said the laptop commitment was \"laughable\" and that schools would not have the money to pay for it.\n\n\"Not requiring parents to pay for tablets or laptops is a good thing — they should never have had to in the first place,\" AEU Victorian Branch president Justin Mullaly said.\n\n\"But the Allan government is living in a dreamland if they think public schools have the budgets available to provide devices to all students, when Victorian public schools are the lowest funded in the nation.\n\n\"There is no way that Victoria's public primary schools will be able to ensure students have access to up-to-date technology and secure devices unless the premier stops the con-job and fixes her public school funding mess.\"\n\nPrincipals and parents cautiously welcome changes\n\nPresident of the Victorian Principals Association, Andrew Dalgleish, said the changes would probably receive \"mixed responses\" from schools.\n\nHe said parents might find it easier to allocate screen time at home if they know how much time their child has spent on a device at school.\n\n\"I don't think it's as much of an issue in schools as it is at home,\" he told ABC Radio Melbourne.\n\nToddlers' screen time impacts the words they learn Toddlers who get more screen time could be learning fewer new words, an Australian study finds, warning parents of the opportunity cost of distracting children with devices.\n\nHowever, he said it was important that schools had certainty over access to proper equipment for online learning.\n\n\"I think that will be the biggest challenge. We know that the cost of technology has a large impact on families and a large impact on schools,\" he said.\n\n\"We certainly found during the pandemic when we pivoted to online learning that there were supports that were needed from the department in some cases, and they stepped up to that.\"\n\nMr Dalgleish said the move to conduct NAPLAN test exclusively online also present a challenge for schools.\n\n\"Those schools that have modern devices that are right to go, that will be fine,\" he said.\n\n\"For those that need to prepare for it there will need to be some work to ensure that every child has a device at the time they need to sit that test.\"\n\nThe reforms aim to reduce the amount of time children spend on devices in the school environment. (ABC News: Tim Swanston)\n\nParents Victoria chief executive Gail McHardy said the government needed to find the right balance with its reforms.\n\n\"We need to use technology to enhance learning, not to inhibit, and I think this is the problem with all the distractions and things,\" she told ABC Radio Melbourne.\n\n\"For parents, all they ask for at any given time is to have clarity about what is going on so they can balance it up at home.\n\n\" Children come home and they jump on their devices because mum and dad might still be working or they might be saying they didn't have device time at school. \"\n\nMs McHardy said she appreciated the government's commitment to providing laptops at schools, but wanted assurances that the equipment was up to scratch.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/swimming-ariarne-titmus-announces-retirement/105898036",
    "title": "Olympic swimming champion Titmus explains shock retirement",
    "publish_date": "Wed, 15 Oct 2025 22:23:09 +0000",
    "category": "sports",
    "authors": [],
    "text": "Australia's four-time Olympic gold medallist Ariarne Titmus has retired from all levels of swimming.\n\nSwimming Australia confirmed the 25-year-old's retirement on Thursday morning.\n\nTitmus finished her career as one of the greatest distance swimmers of all time, having won eight Olympic medals across the Paris and Tokyo Games.\n\nCoached by Dean Boxall, Titmus also claimed nine world championship (long course) medals, including four gold.\n\nShe took an extended break from swimming following the Paris Olympics, before deciding to retire.\n\n\"It's a tough one but one that I'm really happy with,\" Titmus said in an Instagram post.\n\n\"I've always loved swimming, it's been my passion since I was a little girl.\n\n\"But I guess I've taken this time away from the sport and realised some things in my life that have always been important to me are just a little bit more important to me now than swimming.\n\n\"That's OK, but here we are.\"\n\nAriarne Titmus represented Australia at two Olympics. (Getty Images: John Walton/PA Images)\n\nTitmus successfully defended her Olympic title in the women's 400 metres freestyle at the Paris Olympics.\n\nShe became the first Australian female athlete since Dawn Fraser in 1964 to win back-to-back gold medals in the same event.\n\nIn the Tokyo 400m freestyle final, Titmus defeated legendary American Katie Ledecky, who was defending champion and the world-record holder at the time.\n\nFour years later, she beat home rising Canadian star Summer McIntosh and Ledecky in the final, a showdown dubbed the \"race of the century\".\n\nAriarne Titmus successfully defended her Olympic title in the women's 400m freestyle at the Paris Games. (Reuters: Grace Hollars)\n\nTitmus said retirement was not on her mind when she competed in Paris last year.\n\n\"I always intended to return. I never thought Paris would be my last Olympic Games,\" she said.\n\n\"Knowing what I know now, maybe I wish I had enjoyed that last race a little bit more.\n\n\"I guess in these 12 months I've been able to explore what life is like outside of swimming.\"\n\nLoading Instagram content\n\nTitmus's haul of Olympic gold includes the women's 200m freestyle at the Tokyo Games and the 4x200m freestyle in Paris.\n\nShe came close to completing the 200m-400m freestyle double in Paris, finishing second to fellow Australian and training partner, Mollie O'Callaghan, in the shorter distance.\n\nTitmus was twice Olympic silver medallist in the 800m freestyle, with Ledecky winning on both occasions.\n\nTitmus remains world-record holder\n\nTitmus also set world records in the 200m and 400m freestyle, with her time in the former — one minute and 52.23 seconds — still standing.\n\nSwimming the time at the 2024 Australian Olympic trials in Brisbane, she became the first Australian woman since Shane Gould in 1972 to concurrently hold the 200m and 400m freestyle world records.\n\nShe twice broke the 400m freestyle world record during her career, with her personal best of 3:55.38 bettered by McIntosh (3:54.18) in June this year.\n\nAriarne Titmus (left) enjoyed a fierce but friendly rivalry with Katie Ledecky. (Getty Images: Quinn Rooney)\n\nThe Brisbane-based swimmer — who grew up in Tasmania — was a nominee for the 2025 Laureus World Comeback of the Year award for her performances at the Paris Olympics after she recovered from surgery to remove an ovarian tumour.\n\nShe described the health scare as a \"turning point\", forcing her to re-assess her life outside the pool.\n\n\"It probably was the first time where I considered some things outside of swimming,\" Titmus said.\n\n\"Delving more into those health challenges, I've really had to look within and think about what's most important to me and beyond swimming.\n\n\"I've always had goals in my personal life, but swimming has always been most important up until this point and I've just realised that those goals and what I want in my future is now more important to me.\n\n\"But more than anything, I'm excited for what's next.\"\n\nTitmus's success extended to the Commonwealth Games, where she claimed seven gold medals and a silver at the Birmingham (2022) and Gold Coast (2018) editions.",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/arlc-nrl-r360-hits-back-at-ban-threats-for-players/105897732",
    "title": "R360 hits back at ARLC's threat of 10-year bans for rebel players",
    "publish_date": "Wed, 15 Oct 2025 21:59:00 +0000",
    "category": "sports",
    "authors": [],
    "text": "R360 organisers have swiftly hit back at the Australian Rugby League Commission (ARLC), labelling threats of 10-year bans for players joining the breakaway competition as \"sadly\" predictable.\n\nARLC chairman Peter V'landys on Wednesday accused R360 officials of counterfeiting the code and vowed to also suspend any player managers involved.\n\nNRL players face 10-year ban for joining rebel leagues The Australian Rugby League Commission has announced a 10-year ban for any NRL player who agrees to join a football competition it does not recognise.\n\nThe proposed ban would include exclusion from the NRL and any ARLC-sanctioned competition.\n\nR360 co-chief executive Mark Spoors said the new concept was about offering players \"fresh opportunities\".\n\n\"Recent announcements, sadly, have been anticipated,\" Spoors said.\n\n\"History shows that when athletes are offered free choice and given fresh opportunities for them and their families, then threats to those sportsmen and women follow.\n\n\"R360 is about empowering players, giving them, rugby lovers and the next generation of fans opportunities and new platforms to enjoy the sport we love.\n\n\"We know there is much interest in understanding more about the global series we're building. We remain on plan and look forward to sharing and discussing the detail in the coming months.\n\n\"That will include details of the exciting male and female playing talent who will participate in R360 when we kick off in October 2026.\"\n\nNRL stars Ryan Papenhuyzen, Cameron Munster, Payne Haas and Roger Tuivasa-Sheck are among those who have been linked to potential moves to R360.\n\nBroncos prop Payne Haas is rumoured to be a target of R360 organisers. (AAP: Dave Hunt)\n\nThe competition is slated to start in late 2026 in a global, F1-style format with rounds in Cape Town, Tokyo and Dubai.\n\n\"The Commission has a clear duty to act in the best interests of rugby league and its fans,\" V'landys said in a strongly worded statement on Wednesday.\n\n\"We will take all necessary steps to protect the future of the game.\"\n\nThe ARLC's hardline stance comes after the league met last week with the 17 NRL clubs, who asked for action against any defecting players and their managers.\n\nThe official response came after the ARLC sought legal advice.\n\nThe development also follows Rugby Australia's warning that any player who joins R360 will be banned from representing the Wallabies, Wallaroos or Australia at the Olympics.\n\nThe Rugby League Players' Association (RLPA) is warning banned players would likely challenge the NRL in court.\n\n\"No-one wants to see players leaving the NRL or NRLW,\" RLPA chief executive Clint Newton said.\n\n\"But the RLPA is uncertain about the legal basis or enforceability of the proposed bans.\n\n\"We are concerned this is destined to be tested and decided in an Australian courtroom.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/premium-wine-penfolds-reports-china-sales-slump/105887474",
    "title": "Australian wine labels feeling the pinch as Chinese buy and drink less",
    "publish_date": "Wed, 15 Oct 2025 21:51:06 +0000",
    "category": "finance",
    "authors": [],
    "text": "China appears to no longer be the golden goose it once was for Australian wine exports, as demand slackens for even prestigious labels.\n\nPenfolds owner Treasury Wine Estates (TWE) this week announced it would sell less of the luxury label in China than had previously been forecast.\n\nIt comes off the back of changing drinking habits and a reported crackdown on lavish banquets for civil servants.\n\nPremium wines have in recent years been the best performers for Australian exports into the once-booming Chinese market, but changing economic conditions have taken their toll on the industry.\n\nWine Economics Research Centre executive director Kym Anderson said belt-tightening, health concerns and tariff wars had all hit the global wine trade.\n\nKym Anderson says it is hard to predict if and when the Chinese market will turn around. (Supplied: Kym Anderson)\n\n\"It's true in lots of countries, not just China, that the uncertainty that Trump has introduced into global markets generally has reduced people's confidence in both spending and investing, and in China that's certainly the case,\" Professor Anderson said.\n\nHe said the impact was now being felt \"across the board\".\n\n\"Rich people also get hit when these times are less certain, so they're probably reducing as well,\" he said.\n\n\"In addition, during that period of COVID there was still a flood of imports [and] people were expecting consumption to keep growing rapidly, and it didn't.\n\n\"So there were big stocks of wines, including premium wines, that were just sitting there needing to be cleared once the market opened up again, so that's dampened growth in imports in recent times as well.\"\n\nWhile Australian producers of cheaper, bulk-produced wines have been battling other challenges, those making more premium label wines have still been largely enjoying good demand in key markets like China after the lifting of hefty tariffs on Australia wine post-COVID.\n\nSome Australian premium wines will need to find new markets. (ABC South East SA: Elsie Adamo)\n\nAbout 96 million litres of Australian wine worth more than $1billion was exported to China last financial year — a volume almost half of what it was at its peak in 2018.\n\nIndustry-wide impacts\n\nProfessor Anderson said it was another concern for the troubled wine industry that the top and bottom end of wines were being impacted.\n\n\"It's affecting all different classes of wine,\" he said.\n\n\" Iconic wines are the least worried I suppose, but the standard super-premiums and so on, as well as the low-end stuff, it seems is being affected now. \"\n\nIn an announcement this week to the ASX, TWE said Penfolds sales in China softened in June and July, which it put down to changing consumer habits and less \"large-scale banqueting occasions\".\n\nEarlier this year global media outlets reported on new austerity regulations by Chinese officials targeting excessive drinking at banquets, which had affected alcohol sales within the country.\n\nWhile it noted some uplift in the past two months, TWE said it no longer expected to reach its forecast Penfolds sales this year in China.\n\nPenfolds is one of the premium brands affected by a downturn in demand from Chinese consumers. (ABC South East SA: Elsie Adamo)\n\nDue to that and challenges with its distribution network in California, TWE paused an on-market share buy-back \"until there is greater clarity around trading conditions and expectations\".\n\nIndustry ups and downs\n\nPenfolds chief winemaker Peter Gago said cost-of-living challenges meant it was a tough time for wine, but it was part of the cycle of the industry.\n\n\"Everything's about ebb and flow — it's agriculture, so it's all about cycles and you just have to broaden your base,\" Mr Gago said.\n\n\"A nation of 1.4 billion people will also go through cycles.\n\n\" So yes, times are tough — a bit more difficult perhaps at the moment in a relative sense, but good times will come again and so it's just a matter of hanging in there. \"\n\nIt is not just the big players that are noticing dwindling demand for premium wines into China.\n\nPatrick of Coonawarra received approval to send its wines into China once restrictions were lifted in 2024.\n\nLuke Tocaciu says the business has been able to maintain a steady demand for its wine in China. (ABC South East SA: Elsie Adamo)\n\nWhile demand started off strong, owner Luke Tocaciu said it had since become tougher to sell wine into China and his focus had turned to nations such as Indonesia and Canada.\n\n\"It's not as in demand as it has been previously,\" he said.\n\n\"We won't be putting all of our export eggs in that basket — some of the emerging markets are certainly something I'm trying to get a foot in the door.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/nt-cost-of-living-report-rising-rents-fuel-prices-housing-stress/105895916",
    "title": "$5 milk and $90 rent rises: NT cost of living pushing families into housing stress",
    "publish_date": "Wed, 15 Oct 2025 21:15:22 +0000",
    "category": "finance",
    "authors": [],
    "text": "A rising number of families are being pushed into housing stress in the Northern Territory, according to a new report, as costs of living continue to climb.\n\nThe report found the cost of NT rentals has soared to near Sydney prices, and residents are facing some of the highest fuel prices and household bills in the country.\n\nSharply climbing costs have forced Kerrie Matthews and her husband to put their home, on the outskirts of Darwin, on the market, just two years after relocating to the NT from Victoria to live out their retirement.\n\nThe pensioners thought the territory would be a more affordable place to live, but their bills have since climbed to levels they can no longer afford.\n\nAfter a recent water bill that reached $800 for a quarter, Ms Matthews stopped watering the garden, and her electricity bill has also risen steeply.\n\nShe said the thought of going to a restaurant or cafe was now a distant memory.\n\nKerrie Matthews says she has had to sell items to afford the insulin pump she relies on for her diabetes. (ABC News: Pete Garnish)\n\n\"I'm a type 1 diabetic, so a lot of things that I use to stay alive [are] subsidised by the government,\" she said.\n\n\"I've been recently put on an insulin pump, but I have to pay for that.\n\n\"In order to not eat into the budget, I've actually been selling things.\n\n\"The pump is saving my life every day.\n\n\"I thought our lifestyle would be so much better up here, so it's very disappointing.\"\n\nThe NT has long had affordability issues, but according to a cost of living report released by the NT Council of Social Service (NTCOSS) on Thursday, they have become \"extreme\", and are hitting low-income households the hardest.\n\nInterstate investors swarm NT homes Interstate investors are targeting homes across the Northern Territory, buying them up hours before they hit the market.\n\nDarwin is now the second-most expensive place to rent a home in the country, only behind New South Wales.\n\nSpurred by a very low vacancy rate and an influx of interstate investors targeting the NT, the average weekly rent for a three-bedroom house in the city has risen to $668.\n\nThe NTCOSS report found that in Darwin, someone on JobSeeker would spend almost 100 per cent of their payment on a one-bedroom unit, leaving just $20 to survive on.\n\nNT Shelter chief executive Annie Taylor said residents were being priced out of the private rental market and forced to join \"a social housing waitlist that's already impossibly long\".\n\nThe report also said the average household power bill for a four-person home had risen $30 over the past year, and that Darwin had become the third-most expensive capital city for transport, behind Hobart and Melbourne.\n\nWhile in most of Australia petrol prices fell from record highs this year, the NT did not experience the same drop — especially outside of the capital city, where fuel is close to the national average.\n\nIn Alice Springs, households are spending almost $1,500 more each year on petrol than in Darwin, according to the report.\n\nAnd at $3.37 a litre, the Tiwi Islands — 80 kilometres north of Darwin and home to about 3,000 people — is one of the most expensive places to fill up a tank in the country.\n\nAs more people face financial hardship in the NT, Foodbank Darwin manager Jack Barrett said demand for their services had risen sharply, driving even people with jobs to seek assistance.\n\nThe Darwin Foodbank is seeing a rise in people needing help every month. (ABC News: Roxanne Fitzgerald )\n\n\"Our numbers are going up month on month on month,\" he said.\n\nHe said the affordability crisis was hitting people so hard that 60 per cent of families accessing Foodbank had at least one person in employment, and one third of families had a mortgage.\n\n\"That's families who have worked really hard, saved a deposit and still find themselves in need of help,\" he said.\n\nIn Booraloola, lactose-free milk costs $4.60 — more than double the cost in major supermarkets — while Pauls milk costs $5.70. (Supplied)\n\nThe report said when shopping for groceries in NT remote communities, residents can pay more than triple the price for the same item sold in cities.\n\nAs of October, 1 litre of lactose-free milk on the shelf of a remote community store in Booroloola cost $4.60, compared to $2 at a major supermarket, while a 1L bottle of long-life milk cost $5.70.\n\nA150-gram jar of instant coffee cost $26 at the remote store — almost double what it would cost elsewhere.\n\nA 150g jar of Nescafe costs $26 at a store in Borroloola, almost double the price it would be at a major supermarket. (Supplied)\n\n\"People who are on fixed incomes and low incomes … those people are doing it incredibly tough,\" NTCOSS chief executive Sally Sievers said.\n\n\"We've seen things like in Palmerston, a one-bedroom unit, the rent increasing by $90 just in a 12-month period.\n\n\"People are having to make really difficult decisions about going to the doctor or affording medication.\"\n\nAbout 1.3 million low-income households across Australia experienced housing stress in 2024–25, defined as spending more than 30 per cent of their disposable income on housing, according to a separate report released by the Australian Institute of Health and Welfare on Thursday.\n\nAccording to the NTCOSS report, the NT's remote area allowance has not increased in decades and current concessions are too limited to keep pace.\n\nSally Sievers says the cost-of-living crisis is having a big impact on people on lower incomes. (ABC News: Roxanne Fitzgerald)\n\n\"The people on the lowest incomes are carrying the greatest burden,\" Ms Sievers said.\n\n\"Governments must act where relief will make the most difference. That means targeted cost-of-living measures for those doing it toughest.\"\n\nThe NT government has been contacted for comment.",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/world-triathlon-championship-in-wollongong/105877162",
    "title": "NSW city's time to shine in event that is 'a bit like the Olympics'",
    "publish_date": "Wed, 15 Oct 2025 21:09:13 +0000",
    "category": "sports",
    "authors": [],
    "text": "Wollongong turned on perfect conditions for the World Triathlon Championship Finals opening ceremony, with the New South Wales south coast city's picturesque harbour awash with colour, sound and patriotism.\n\nNearly 5,000 athletes from across the globe will compete over the next four days in what organisers say is the biggest annual multi-sport event in the world.\n\n\"It's a bit like the Olympics,\" World Triathlon Championship general manager Mark Emerton said.\n\n\" Each country picked a flag bearer, with a sign for the country. \"\n\nAthletes on their way to the opening night procession of the 2025 World Triathlon Championships. (ABC Illawarra: Sarah Moss)\n\nAustralia will field the largest team, comprising 1,500 competitors aged between 18 and 85, including 13 para triathletes.\n\nThe US, UK and New Zealand follow close behind, with a Fijian trio the event's smallest squad.\n\nAbout 800 local volunteers have also signed on.\n\n\"We've got one of the biggest races and richest prizes in the world here in Wollongong this week, which is goddamn exciting,\" Mr Emerton said.\n\nBack-to-back action\n\nThe first round of races begins on Thursday with the under-23 men's and women's events, followed by junior men and women's races on Friday and all para-triathlete events on Saturday.\n\nHundreds of Australian athletes gave their all in Wollongong during April's qualifying event. (ABC Illawarra: Brooke Chandler)\n\n\"We have a community-run event that night called the Rock and Run which is a 2-kilometre or 5km lap around the lighthouse,\" Mr Emerton said.\n\nThe professional competitors will take to the course on Sunday.\n\n\"They'll be competing for $500,000 in prize money,\" Mr Emerton said.\n\n\" They are the ones who will be knocking on the door to represent their country at the next Olympics. \"\n\nVying for the podium\n\nWollongong will be the fourth world championship final for para-triathlete Anu Francis, a year after she made her Paralympic debut in Paris.\n\nAnu Francis won a silver medal at the 2024 Paris Paralympics. (Supplied: Anu Francis)\n\nThe 30-year-old Adelaide local, who has a genetic connective tissue disorder known as Ehlers-Danlos Syndrome, will compete using a modified bike and crutches.\n\n\"The last couple of months have been the most consistent I've ever trained, like the most volume I've ever handled,\" she said.\n\n\"The body is feeling amazing.\"\n\nWomen's world number four Jeanne Lehair from Luxembourg said she was keen to take on Wollongong's difficult course.\n\nJeanne Lehair is in Australia for the first time. (ABC Illawarra: Brooke Chandler)\n\n\"Usually when it's flat we are bored,\" she said.\n\n\"So I think it's good for the race because it's a bit more challenging.\n\n\"The only thing is I prefer a lake swim than ocean and I don't really like beach starts.\"\n\nLuke Willian says he knows the Wollongong course well after winning the 2024 World Triathlon Cup in the city. (ABC Radio Brisbane: Dean Caton)\n\nAustralia's number two Luke Willian, 29, said he was excited to compete on home soil, surrounded by family.\n\n\"I remember watching Emma Moffatt win the World Championship in 2009 as a 13-year-old kid and that gave me heaps of motivation … to do that one day,\" he said.\n\n\" I am really fortunate I get to live out that dream. \"\n\nWhy Wollongong?\n\nAustralia has not hosted the World Triathlon Championship Finals since 2018, when the event was run on the Gold Coast.\n\nMr Emerton said Wollongong was the perfect location due to its rough terrain, proximity to Sydney International Airport, and experience hosting the UCI Road World Championships in 2022.\n\nThe UCI Road World Championships exposed Wollongong to a global audience. (ABC Illawarra: Justin Huntsdale)\n\n\"We've got a nice harbour to swim in, we've got a nice bike course to ride along the coastline,\" he said.\n\n\"I'm a bit biased but we went to Spain [for the World Triathlon Championship Finals] last year, their course is nowhere near as nice as Wollongong's.\"\n\nSome marina businesses have raised concerns about potential revenue loss from road closures and restricted pedestrian access during the event.\n\n\"Each competitor is given a voucher to spend locally so if a cafe gets 20 vouchers, we'll go back and pay for those vouchers,\" Mr Emerton said.\n\n\"We've really tried hard to ensure an international event is integrated well into the city.\"",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-10-16/juukan-gorge-rock-shelter-recreated-models-virtual-reality/105889276",
    "title": "Inside the plan to rebuild Juukan Gorge rock shelter destroyed by Rio Tinto",
    "publish_date": "Wed, 15 Oct 2025 21:08:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "A full-scale replica of the Juukan Gorge cave, destroyed in 2020 by mining company Rio Tinto to an avalanche of international condemnation, will be built around the remains of the original in Western Australia's north.\n\nUsed by Indigenous people for 47,000 years, it was blasted in 2020 in a legally sanctioned move to expand one the company's Pilbara iron ore mines.\n\nFive years on, an enormous feat of engineering and artistry is underway to build a realistic re-creation to then place on country as part of the site's rehabilitation.\n\nWhile the cost and timeline for completion is unclear, Rio Tinto itself is footing the bill as part of its redress agreement with Traditional Owners.\n\nThe Juukan Gorge caves in WA's Pilbara in 2013 (L), and after the land was cleared (R) in 2020 before the site was blasted. (Supplied: PKKP)\n\nFilling the void\n\nPuutu Kunti Kurrama Land Committee chair Burchell Hayes said the new shelter aimed to restore Indigenous Australians' sense of belonging to the area by remediating damage caused by Rio Tinto.\n\nBurchell Hayes says preserving the rock shelter's legacy is a priority. (ABC News: Mya Kordic)\n\nMr Hayes said while it was unclear what cultural significance the replica would bring once it was complete, he knew his people did not want to be left with a permanent void on the landscape.\n\nHe said they were inspired \"to ensure that something was placed back there to resemble what our memories of the gorge and the rock shelter looked like for us\".\n\n\"It is a significant cultural feature on our country, and we want to make sure that future generations continue to be able to come out on country and see what was possible and what was achieved.\"\n\nThe goal is to recreate the original shelter as closely as possible. (ABC News: Mitchell Edgar)\n\nImmersive experience\n\nThe project is in its early stages, but impressive results were already emerging.\n\nIn a studio in Perth's Osborne Park, technicians developed an immersive, virtual reality recreation of the rock shelter based off a collection of about 150 photos, and the memories of Indigenous people.\n\nThe designers will use that to construct physical pieces of the cave to eventually be transported to the Pilbara and assembled on site.\n\nYou can put on a virtual reality headset and find yourself in the Pilbara looking at that cracked western wall. The digital version of Juukan is then superimposed on top. (ABC News: Mya Kordic)\n\nDaniel Browne, the director of CDM Studios, said his team created the first digital version and took it to Traditional Owners who would say they remembered a particular feature, like a specific rock, a 'moon pool' or a hole in the roof, and that would be added in.\n\n\"Every recollection we can get will help piece this cave together,\" Mr Browne said.\n\nDaniel Browne is working with traditional owners to get the replica as close to the original as possible. (ABC News: Mya Kordic)\n\n\" This is a very, very unique challenge to build a super realistic hard scape that has to be there for hundreds of years into the future, that has to exist in that environment. \"\n\nFrench inspiration\n\nAs part of the project, a delegation from the Puutu Kunti Kurrama (PKKP) and Pinikura Aboriginal Corporation is in France visiting similar replicas of the famous Lascaux and Chauvet caves.\n\nLocated in south-western and south-eastern France, the caves are some of the most celebrated and visited prehistoric sites in the country.\n\nLascaux IV is an exact replica of the original cave in Dordogne. (Supplied: Lascaux.fr)\n\nHundreds of animal paintings on the walls of Chauvet have been dated to 36,000 years ago, and more than 17,000 years in Lascaux.\n\nIn the case of the Chauvet replica, huge steel structures were sprayed with a layer of mortar and natural pigments to create an identical copy of the original cave.\n\nArtists then recreated each detail of the cave surface and reproduced each animal painting in detail.\n\nConstruction on the Chauvet 2 replica cave began in 2012. (Supplied: grottechauvet2ardeche.com)\n\nThe Chauvet cave cost almost $100 million ($55m Euros) and took eight years to build.\n\n\"We want to understand what went into the design and the construction ... how they were able to use the original traditional methods of painting those stencils on the cave,\" Mr Hayes said.\n\nModels are being used to make sure the replica is as close to the original as possible. (ABC News: Mya Kordic)\n\nThe PKKP's director of land and heritage Denis Coutant said the French cave recreations were done to minimise damage by tourists and used 3D scans to exactly map out every feature.\n\nThe Juukan rock shelter replica has no such luxury, with the recreation relying largely on people's memory.\n\nDenis Coutant says the memories of traditional owners will give the project depth. (ABC News: Mitchell Edgar)\n\n\"So it does have a depth and a very sensitive meaning to it,\" Mr Coutant said.\n\n'Tangible surface'\n\nAdding to the challenge, traditional owners do not want steel used in the construction, because it can corrode.\n\nInstead, Mr Browne and his team have taken \"texture stamps\" directly off Pilbara rocks, including remnants of Juukan, that will be turned into concrete moulds to make sections of the on-site replica.\n\nImprints of Pilbara rockface are being turned into concrete molds to make an on-site copy of the destroyed Juukan rock shelter. (ABC News: Mitchell Edgar)\n\n\"We worked out a way to clone the surface over so the geometry was much, much sharper,\" he said.\n\n\"We want that tangible, tangible surface.\"\n\nAn acrylic casting of Pilbara rock face. (ABC News: Mya Kordic)\n\nThe goal is for the Juukan replica to ensure such destruction does not happen again.\n\n\"It has to be a legacy that we leave to the PKKP people and to other people in the country, and potentially even in other countries,\" Mr Coutant said.\n\n\"There are First Nations everywhere in the world who have to deal with mining or large-scale projects who are suffering as well from an impact on their country, and impact on their own heritage.\"\n\nA model of a plan to rebuild a replica of the Juukan rock shelter, destroyed by mining company Rio Tinto in 2020. (ABC News: Mya Kordic)",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/lifestyle/fashion/it-s-bras-and-panties-the-victoria-s-secret-show-is-back-20251016-p5n2w0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It’s bras and panties’: The Victoria’s Secret show is back",
    "publish_date": "Thu, 16 Oct 2025 12:48:03 +1100",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "With a cavalcade of bedazzled bras, panties and supermodels with bouncy blowouts, the Victoria’s Secret runway show in New York cemented its return to the fashion calendar. It’s almost as though its cultural cancellation in 2019 never happened. #MeWho?\n\nPerformers Missy Elliott, Karol G, TWICE and Madison Beer, top-tier models Gigi and Bella Hadid, Emily Ratajkowski and underwear that would not survive a single spin in a tumble dryer were reminiscent of the show’s cultural peak, when Taylor Swift performed on the runway in 2013 and 2014. That was before the Victoria’s Secret runway show was cancelled in 2019, finally returning last year with Kate Moss, her daughter Lila and Cher.\n\nThis was not the place to raise ties between sex offender Jeffrey Epstein and Leslie Wexner, the former head of Victoria’s Secret’s parent company, who stepped down in 2020. Accusations of harassment and misogyny against former chief marketing officer Ed Razek, who controversially told Vogue he did not think “transsexuals” should be included in the show, before stepping down in 2019, were also silenced by the sound of clacking pink heels on the runway.\n\nGigi Hadid at the 2025 Victoria’s Secret runway show in New York. Credit: Variety via Getty Images",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/sport/afl/afl-trade-news-live-zach-merrett-nightmare-goes-to-the-heart-of-your-club-20251016-p5n2w9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL trade news LIVE: Candid Curnow opens up on Voss, Blues exit; Dons won’t commit to Merrett as skipper",
    "publish_date": "Thu, 16 Oct 2025 12:46:51 +1100",
    "category": "sports",
    "authors": [
      "Hannah Kennelly",
      "Roy Ward"
    ],
    "text": "Sydney recruit Charlie Curnow says he had a great working relationship with Michael Voss, and will remember fondly the four years he played under the Carlton coach.\n\nA day after his move to the Swans was finalised in the closing minutes of trade period, Curnow opened up on his departure from the Blues.\n\nNew Swans forward Charlie Curnow in South Melbourne on Thursday. Credit: Eddie Jim\n\nCurnow said that after nine years at Ikon Park, he needed a fresh start but had not spoken to other clubs until the end of the season.\n\nHe spoke highly of Voss, and refuted speculation his relationship with the Blues coach had become strained this year.\n\n“Not at all,” Curnow said at his unveiling as Swan at Sydney’s Melbourne office in South Melbourne.\n\n“In the end, it’s a pretty high-pressure environment.\n\n“I think, obviously some things that maybe leaked out there that I would say aren’t true. It’s always a tough environment football and it’s going to be a lot of challenges that come with that. But for me and him, like I don’t see our relationship being affected at all by this.\n\nLoading\n\n“It’s just hard to have a few good conversations with him at the end of the season to if I want to get traded, it’s just you have to do that, you can’t just look and go behind his back and just start putting myself out there.\n\n“I think we’re in a pretty healthy spot and as I said before, like I played some awesome footy under him and I thank him a lot for that.\n\n“Like that was a tough part of my career coming over a knee injury and then trying to play. He dealt with that fantastically.”\n\nCurnow said he would contact Voss again to thank him.\n\n“I played some great footy under Vossy, we had a great relationship,” Curnow said.\n\n“I owe him a lot, I came out of an injury and was able to play three years and four in a row beneath him and play good footy.\n\n“That’s going to be some of my best memories when I look back and have finished footy, playing underneath him.”",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/national/queensland/brisbane-news-live-trio-pictured-after-serious-assault-in-valley-20251015-p5n2on.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Trio pictured after serious assault in Valley; Cheapest fuel is on the southside",
    "publish_date": "Thu, 16 Oct 2025 12:45:58 +1100",
    "category": "finance",
    "authors": [],
    "text": "The Crisafulli government has claimed the Cross River Rail project cost has blown out by another $2 billion in the past 10 months – an increase it blamed on the Labor Party.\n\nDuring ministerial statements in state parliament this morning, Transport Minister Brent Mickelberg – who last December put a $17 billion price tag on the project – said “extensive negotiations with contractors” had resulted in a revised total cost of $19.04 billion.\n\nIt was a far cry from the former Labor government’s $5.4 billion cost, but by the LNP government’s own admission the new figure included additional work throughout the train network that had not initially been included in Cross River Rail’s line-item costs.\n\nTransport Minister Brent Mickelberg. Credit: Jamila Filippone\n\n“Our government has also made it clear that contractors would be held to account for their performance,” Mickelberg told parliament.\n\n“That’s why there are now elements of funding conditional on exceptional performance, and contractors meeting major milestones on time. If they don’t deliver, they won’t get paid.”\n\nBrisbane Times has asked Mickelberg’s office for a full rundown of its $19.04 billion estimate. Comment was also sought from Labor.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/national/victoria/the-cat-that-changed-the-law-20251016-p5n310.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The cat that changed the law",
    "publish_date": "Thu, 16 Oct 2025 12:30:04 +1100",
    "category": "finance",
    "authors": [],
    "text": "The cat that changed the law\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/swimming/rise-of-the-terminator-arnie-s-10-greatest-feats-in-the-pool-20251016-p5n2zm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rise of the Terminator: Arnie’s 10 greatest feats in the pool",
    "publish_date": "Thu, 16 Oct 2025 12:29:12 +1100",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Ariarne Titmus hangs up her goggles as one of Australia’s greatest swimmers. Her retirement at the age of 25, a year older than Ian Thorpe when he bowed out in 2006, sees her depart the sport as an icon. She has been a formidable force on the world stage since 2018, producing some of the greatest moments in Australian sport this century. Here are 10 of her finest performances. 1. 400m freestyle gold – 2021 Tokyo Olympics As Titmus said on Thursday, nothing compares to your first Olympic gold medal. To do it against the best female swimmer in history makes it all the sweeter.\n\nAdvertisement\n\nTitmus was up against US superstar Katie Ledecky on the opening night of competition at the Tokyo Games. The Australian and her coach, Dean Boxall, had spent years devising a plan to beat Ledecky. It was the source of motivation at every training session. Ariarne Titmus after winning the 400m freestyle final in Tokyo. Credit: Maddie Meyer Ledecky, the world record holder, went out hard and led by 0.66 seconds at the 200-metre mark. With 100 metres to go, Titmus had closed the gap to 0.16 seconds – and then launched her assault. In a brutal final sprint to the wall, Titmus powered her way to victory to claim a stunning upset and her first Olympic gold medal. Boxall’s celebration in the stands remains the stuff of folklore. 2. 400m freestyle gold – 2024 Paris Olympics\n\nAdvertisement\n\nNo Australian woman had won back-to-back Olympic gold medals in the same event since Dawn Fraser won 100m freestyle titles in 1956, 1960 and 1964. This duel between Titmus, Ledecky and rising Canadian star Summer McIntosh was dubbed the Race of the Century. All three swimmers had a chance of victory, but Titmus was the narrow favourite. Gold medallist Ariarne Titmus, centre, stands with silver medallist Summer McIntosh and bronze medallist Katie Ledecky. Credit: Getty Images Titmus went out hard and motored through the water. In the stands, Boxall could be seen screaming, “break them, break them” in the final stages as Titmus surged to victory, ahead of McIntosh by almost a second. 3. 400m freestyle gold – 2023 world championships For the first time in years, some were writing Titmus off. Though she was the reigning Olympic champion, her world record had been broken by McIntosh at the Canadian trials earlier in the year.\n\nAdvertisement\n\nTitmus’ times at the Australian trials weren’t amazing, but she always believed she could deliver on the big stage. And in one of her most extraordinary performances, Titmus was perfect in Fukuoka. She annihilated McIntosh’s world record by seven tenths of a second, clocking a time of 3:55.38, which remains her best in the event. The Australian also won a $US20,000 ($30,000) world record bonus and inflicted a major psychological blow before the Paris Olympics. “I felt like I was swimming downhill,” Titmus told this masthead afterwards. 4. 400m freestyle gold – 2019 world championships This was the victory that announced Titmus to the world.\n\nAdvertisement\n\nStill only 18, she produced a breathtaking final 50 metres to chase down Ledecky, who had dominated the event. It was Titmus’ first victory over the legend of the pool. The American’s shock defeat was a passing-of-the-torch moment. It gave Titmus the belief she could end Ledecky’s dominance. 5. 200m freestyle gold – 2021 Tokyo Olympics Two days after her 400m freestyle triumph, Titmus delivered again. She held off Hong Kong’s Siobhan Haughey in a time of 1:53.50 to set a new Olympic record and claim her second gold of the Games. Titmus became just the second Australian woman, after Shane Gould in 1972, to win the event, underlining her versatility across distances.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 13
  },
  {
    "url": "https://www.smh.com.au/politics/federal/unemployment-rate-hits-four-year-high-putting-pressure-on-rba-to-cut-rates-20251016-p5n2zz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Unemployment rate hits four-year high, putting pressure on RBA to cut rates",
    "publish_date": "Thu, 16 Oct 2025 12:17:29 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright",
      "Millie Muroi"
    ],
    "text": "Unemployment has hit its highest level in four years, putting renewed pressure on the Reserve Bank to look at a rate cut at its meeting next month.\n\nThe unemployment rate hit 4.5 per cent – up from 4.3 per cent – as the number of people out of work climbed from 650,000 in August to 684,000 in September, data from the Australian Bureau of Statistics on Thursday showed.\n\nThat’s despite the number of people in jobs climbing by nearly 15,000. Total job growth over the past 12 months has slowed to 1.3 per cent with the country adding 190,500 positions. Total unemployment, however, has jumped by 12.6 per cent, or 76,800.\n\nThe latest statistics put pressure on the Reserve Bank to consider cutting interest rates at its meeting in the first week of November. The bank had forecast the unemployment rate to hit 4.3 per cent by the end of the year.",
    "source": "SMH",
    "cluster_id": 0
  },
  {
    "url": "https://www.smh.com.au/culture/live-reviews/melbourne-review-wrap-katya-kabanova-20251015-p5n2n6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inspired by unrequited love, this rarely performed show is ingenious and daring",
    "publish_date": "Thu, 16 Oct 2025 12:17:17 +1100",
    "category": "entertainment",
    "authors": [
      "Barney Zwartz"
    ],
    "text": "OPERA\n\nKatya Kabanova ★★★★★\n\nVictorian Opera, Palais Theatre, until October 16\n\nCzech composer Leos Janacek suffered a long obsession with a four-decades-younger married woman. His passion was entirely unrequited, but music lovers got incalculable benefits as Kamila Stosslova inspired a string of compositions, including Katya Kabanova – one of the great but rarely performed operas of the 20th century.\n\nDesiree Frahn and Andrew Goodwin in a scene from Katya Kabanova. Credit: Jeff Busby\n\nIt is the story of a young wife who endures a bullying mother-in-law and a weak husband under the thumb of his mother.\n\nVictorian Opera’s production scored at every turn, with a splendid Australian cast, ingenious and creative production, and daring and clever use of live black and white video throughout on a full-stage screen. Not least was the Australian National Academy of Music orchestra’s extraordinary playing, sensitively and effectively led by Alexander Briger (nephew of one of the finest Janacek conductors ever, Charles Mackerras).",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/culture/theatre/shiralee-adaptation-needs-grittier-fabric-to-weave-tale-true-to-mythology-20251011-p5n1qn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dark themes lost beneath the surface in expertly performed cabaret",
    "publish_date": "Thu, 16 Oct 2025 12:17:12 +1100",
    "category": "entertainment",
    "authors": [
      "John Shand"
    ],
    "text": "Finding galaxies of love under tattooed eyelids, and a kingly swagger in white socks riding free on stocky legs, the cuddly American gangster of self-acceptance and soul took Sydney right up to the heavenly high he’s on in his healing journey, with big-budget pyrotechnics to match those big-belted feels. Since the breakout success of I’ve Tried Everything But Therapy (Part 1) in 2023, with its heavyweight hits about toxic co-dependency, addiction and heartbreak, Teddy Swims has come a long way. He’s been to therapy, for one. He’s also found love again, the wholesome kind. Plus, with global tours and billions of streams, the former YouTube cover artist sure is making bank. Teddy Swims with band Freaky Feely at Qudos Bank Arena. Credit: Glenn Pokorny/Qudos Bank Arena “I’m so grateful towards my shitty ex-girlfriend,” he joked good-heartedly to a packed arena. Though Teddy still pays tribute to (Part 1), tucking a few of the best into the encore, this tour is a celebration in the spirit of 2025’s (Part 2), where he’s come out of all that pain to a place he couldn’t have imagined a few years back: enormous gratitude. Sydney is his first Australian tour stop, but his second October show, having won hearts in a kilt at the NRL Grand Finals. Still with Freaky Feely backing – the high school band he’s brought with him on the up and up – it’s a two-hour-long theatre of the full second album tracklist, and then some. A natural performer, we see Teddy crooning Bad Dreams into a mic stand shaped like a voluptuous woman, going back to the raw place with Some Things I’ll Never Know, getting tender with Small Hands devoted to his new baby boy, crowd-pleasing at the close with Lose Control.\n\nIt’s a powerful, oaky, aching voice: soaked in decades of smoke and liquor; trained on YouTube clips, high school musicals and Atlanta area bands; and set on its god-gifted course to slow-burning stardom by a sweetheart dad who introduced him to the likes of Al Green. The production gives him the panache he deserves, while showing his sense of humour. At one point, following rolling fog and shooting flames, we see Teddy reappear on the summit of a golden ramp on a dunny throne from a hidden trapdoor. Wardrobe whirls him through a white cowboy suit, a tarot-patterned silk robe, a black T and shorts, and a creamy trench coat. Shoes? When you’re that grounded, who needs ’em. It’s no wonder audiences adore him: an everyman shot to pop firmaments on true talent, ribbing and relishing the trappings of class. A role model for a generation leaning into the strength of vulnerability, it’s big love all round. THEATRE\n\nTHE SHIRALEE\n\nDrama Theatre, October 10\n\nUntil November 29\n\nReviewed by JOHN SHAND\n\n★★★ A deep sense of mythology surrounds the reader in D’Arcy Niland’s 1955 novel, The Shiralee. It’s as if the very landscape of mid-20th-century Australia is misanthropic, while those inhabiting it can be as deadly as brown snakes.\n\nIn adapting the novel, playwright Kate Mulvany and director Jessica Arthur (for Sydney Theatre Company) have been aware of this quality, but they’ve only partially succeeded in transmitting it through their production. Too often this feels like a musical minus the songs: as gooey as a box of chocolates in the sun when attempting warmth of heart, and a little lame and stagy when shooting for menace. Kate Mulvany, Ziggy Resnick and Josh McConville in The Shiralee for the Sydney Theatre Company. Credit: Prudence Upton Niland’s novel tells of Mac, an itinerant jack-of-all-trades, who arrives back in Sydney to find his wife in bed with another bloke. Mac sorts out the bloke with his fists, and his wife by taking their daughter, Buster, and hitting the road. It’s a tale of a little girl adoring her remote, belligerent father, and gradually wearing away his armoured outer layer, almost as slowly as water acts on stone. Given the limitations of child actors, Buster is now nine rather than four, which shifts the dynamic considerably, as a four-year-old is obviously more helpless and dependent. Mulvany uses this shift to craft a more knowing, perceptive and wily Buster, and then Arthur has cast the notable Ziggy Resnick in the role. Although over a dozen years older than Buster, Resnick locates the truth of the bashfulness, eagerness, playfulness, bewilderment, humour, earnestness and staunch morality. Ziggy Resnick and Josh McComville with Paul Capsis (centre) as Desmond the bush poet. Credit: Prudence Upton\n\nMulvany also makes Buster more influential and more evenly matched in size of role with Mac, played by Josh McConville. McConville is convincing as the bluff, taciturn man who solves money problems with his sweat, and people problems with his fists. Tempered like steel in a forge, he is loath to let this slip of a girl, this shiralee (or burden) change his pugnacious, self-absorbed life. Niland peoples his novel with vivid incidental characters, and a further six actors assume multiple roles, including Mulvany herself playing Marge, Buster’s mother, whom she makes more rounded and sympathetic now she’s not just being seen through Mac’s eyes. Aaron Pedersen and Josh McConville in The Shiralee. Credit: Prudence Upton Paul Capsis is ideal as the superbly eccentric Desmond, a cycling swaggie and published bush poet. He (as do most of the minor characters) offers flickers of illumination to the protagonists, especially Buster, who is photographic paper in this regard compared with Mac’s carbon paper. Stephen Anderson, Lucia Mastrantone, Aaron Pedersen and Catherine Van-Davies complete the cast. Unlike the book, the story is told chronologically, which perhaps partly undermines that mythic quality: time is now linear rather than looped. But Jeremy Allen’s set bolsters the mythology, expertly using the Drama Theatre’s widescreen stage, while Jessica Dunn’s music amplifies the sense of space, foreboding and starry-skied wonderment. Alas, they can’t help the fact that when the play swerves back towards naturalism, it should be woven from grittier fabric.\n\nMUSIC\n\nHARRY BENNETTS PERFORMS BEETHOVEN’S VIOLIN CONCERTO\n\nSydney Symphony Orchestra, City Recital Hall, October 9\n\nReviewed by PETER MCCALLUM\n\n★★★½ Harry Bennetts played Beethoven’s Violin Concerto with a sweet sound, fine line and nuanced care, allowing the work’s beauties to unfold lyrically without false drama or undue storminess. Conductor Umberto Clerici began the opening orchestral tutti with unhurried gentleness. There was no hint of spikiness when the string parts took up the quiet opening drum beats, and the phrases breathed in long lines, moving with the breadth and inevitability of a noble river. Harry Bennetts, conductor Umberto Clerici and the Sydney Symphony Orchestra. Credit: Sydney Symphony Orchestra When Bennetts took up the solo entry, it was not with the swagger of a virtuoso driven by posturing heroics, but rather with a focus on allowing the work’s intricacies to blossom with precision and clarity. In the codetta section, as the orchestra starts to surge, Bennett twice responded to the challenge with aptly projected vigour, but on the third, took on the Orphean task of taming them with quiet calm.\n\nIn the development section, when the soloist brings back the opening theme in B minor, high in the violin’s range, Bennetts created a memorable moment of transparent expressiveness without excess. The cadenza of the first movement (by Joachim) held attention with its even, unpressed resonance, contrapuntal clarity, glowing tone and true intonation without a hint of roughness or unwanted bow noise. All of this, of course, requires some freedom with the tempo which, for me, was slightly overdone in the Coda. The slow movement captured a sense of fresh stillness, Bennett ornamenting the underlying orchestral theme with balanced ornamentation of silvery brightness. I occasionally found the sense of pulse in the orchestral playing floated so freely it almost dissolved. The finale had beguiling buoyancy from both soloist and conductor. After another finely polished cadenza and exuberant Coda, Bennett started the last arpeggio with hushed insouciance as though beginning a new episode before the orchestra emphatically stopped any further discussion. In the second half Clerici and the Sydney Symphony again emphasised gentle lyricism in Schubert’s Symphony No. 4 in C minor, D. 417 Tragic. The first movement was fretful and agitated (‘Tragic’ as a subtitle has always seemed a little overblown) and the second gracious. In the third movement, Clerici and the SSO played Schubert’s cross-accents to create a sense of poised ambiguity. The finale was neat and discursive, as the young Schubert (he was only 19) was prone to be. DANCE\n\nTHE BOGONG’S SONG: A CALL TO COUNTRY\n\nBangarra Studio Theatre, October 9, until October 19\n\nReviewed by CHANTAL NGUYEN (with James and Teddy Gribble, and Charlie Price)\n\n★★★½\n\nMy co-reviewers Jamie (aged eight), his brother Teddy and their cousin Charlie (both aged six) didn’t even make it to their seats before being captivated by the moody blue uplighting at Bangarra Studio Theatre.\n\nIt was a foretaste of the atmospheric vibe of Bangarra Dance Theatre’s school holiday show The Bogong’s Song by Yolande Brown and Chenoa Deemal, for ages five plus. It tells the story of siblings Beau and Myee (played by Benjin Maza and Tjilala Brown-Roberts, both fabulous triple threats). They are dream-transported to ancestral Country in the Snowy Mountains, where they must find a missing Bogong moth, healing the land and their own hearts along the way. “They were in sync like all the time when they danced!” Jamie observed. Benjin Maza and Tjilala Brown-Roberts in The Bogong’s Song. Credit: Edwina Pickles The Bogong’s Song features pretty much everything you could think of for a children’s production. There’s acting, singing, rapping, animated backgrounds, talking trees, hand-held puppets, shadow puppets, sing-alongs, and dancing. While the pacing can be patchy and the narrative occasionally lags, enough happens to keep things rolling. And the animal characters are a hit. “I liked the possum and the baby possum!” enthused Teddy. “I liked the lizard,” responds Charlie. “He was funny because he said he would eat the moth but then he didn’t!” Jamie agreed. “He was hilarious! He used a chip packet as a solar panel!”\n\nThere are also heartfelt lessons. “It was about helping the endangered moths,” explained Jamie. “[The siblings] needed to connect with Country, which meant listening to Country and the land. It made me feel good, but a little bit sad for how the world was treated.” Teddy nodded thoughtfully: “They were trying to not let the worlds separate.” The Bogong’s Song also grapples with Australia’s shockingly young age of criminal responsibility, as Beau and Myee grieve the imprisonment of their deaf little brother Joey. That part, recounted Jamie, is “very, very sad”. “He stole lollies. He went to jail. And he was 10. He was confused and scared. Couldn’t he just get a fine?” The high point is the finale, featuring an all-too-short traditional dance featuring ochre paint and didgeridoo music. This part has no wisecracking animals or cartoons, but its power is immediately palpable. The children in the audience become transfixed, completely still and silent, as if responding to some deep, ancient summons that cuts through all the screens, lights, and noise.\n\nMUSIC\n\nTHE TALLIS SCHOLARS\n\nSydney Opera House, October 12\n\nReviewed by PETER MCCALLUM\n\n★★★★★ The Tallis Scholars began their eleventh Australian tour with a glowing, subtly invigorated sound of rich density and iridescent edge in the splendid eight-part motet Deus in adiutorium by the 17th century Spanish/Mexican composer Juan Gutierrez de Padilla. In an interview earlier in the day, director and founder of the Tallis Scholars, Peter Phillips, gave some insight into what gives this doyen of Renaissance vocal ensembles its distinctive tonal quality which is so elusive to describe yet instantly loved by audiences worldwide. He spoke of the micro-refinements of tuning that singers undertake when singing without instruments. Equally important, of course, is the talent, dedication and professionalism of the singers and, in Phillips’ case, 53 years of experience in refining and perfecting the Tallis Scholars to lay bare the glories of the Renaissance with transparent clarity. Listening closely to the vibrant chords of Padilla’s work, one can hear, beyond the purity of tone and pitch, small harmonics of the sort one hears in singing from Bulgaria to Tibet that add shafts of colour and engender delight. The program was built around the theme of chant which appeared in beguiling simplicity in the next work, in principio by 12th century abbess, Hildegard of Bingen, sung by a sub-group of female singers with disarming naturalness of line and rhythm.\n\nA more recent adaptation of chant-based melodic and polyphonic structures was then presented in Arvo Part’s Triodion, written for the 150th anniversary of Lancing College in Sussex, England. A different range of harmonics emerged in the halos of Part’s delicately soft blends of humming, solo and widely spaced voices, leading to a still central point that even a fretful baby in the audience could not disturb. After another chant by Hildegard the first half concluded with the substantial motet by Jacob Obrecht, Salve Regina, in which varying groupings of the 10 voices coalesced and mutated to create a sense of timeless calm. To start the second half, the singers split into widely separated groups for Allegri’s Miserere mei, Deus. Phillips directed the first chorus from the stage, a solo singer sang chant section from the eastern gallery, while, high in the south-western part of the hall the second chorus was heard magically from behind as soprano Emma Walsh embellished the choral sound by repeatedly ascending with apparently effortless grace to an ethereal high C. Part’s Magnificat and Da Pacem Domine again led listeners to utterances that were at once almost inaudibly quiet yet palpable and definite. After Hildegard’s O ecclesia, Josquin des Prez’ Praeter rerum began with darker low-pitched textures, ending with the richly rewarding choral sound that had been heard at the start and to which it is so easy to become addicted. MUSIC\n\nTRIO ISIMSIZ\n\nCity Recital Hall, October 13\n\nReviewed by PETER MCCALLUM\n\n★★★½ In the Renaissance, a missa sine nomine was literally “a Mass without a name”, which meant that, unlike most Masses of the time, it didn’t build on pre-existing material.\n\nViolinist Pablo Hernan Benedi, cellist Edvard Pogossian and pianist Erdem Misirlioglu have adopted the same paradoxical nomenclature by christening themselves Trio Isimsiz, which is Turkish for “trio without name”. Their program of music by Brahms, Coll and Schubert also consisted of works without names in that all of them were simply called “Piano Trio”, though the trio by Francisco Coll did make references to pre-existing music and styles, which flitted into the background like music half-remembered in a dream. Musica Viva’s Trio Isimsiz – violinist Pablo Hernan Benedi, cellist Edvard Pogossian and pianist Erdem Misirlioglu – at the City Recital Hall. Credit: Dylan Alcock One allusion was to Strauss’ comic opera Die Schweigsame Frau (The Silent Woman) about an old man whose intolerance of noise becomes a vehicle for his torment by the young. It was, in one sense, a metaphor for the way chaotic textures in Coll’s trio fragmented and subverted coherent musical ideas just as they began to emerge. The trio began with a short spiky restless movement in which pizzicato string notes and scattered staccato chords from the piano were thrown frenetically across the range of all three instruments, like someone tearing up a first draft. The second movement, the longest and weightiest, began with a bell-like chord on the piano and explored expressive melody and quiet, lonely spaces, sustaining ideas and building up tension in a more familiar way. The third movement returned to fragmented thinking, lurching in two-note figures from violin and cello accompanied by shattered sprays of notes from the piano. The final movement scurried away with impulsive energy, with bursts of scales and contrapuntal ideas that quickly petered out and went nowhere. Towards the end, the music became quiet, like dust settling after a furious row, and a waltz-like figure emerged and quickly vanished in the distance.",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/world/asia/the-world-is-watching-as-china-unveils-its-new-five-year-plan-20251016-p5n2ws.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The world is watching as China unveils its new five-year plan",
    "publish_date": "Thu, 16 Oct 2025 12:09:53 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Next week, China’s leadership will gather in Beijing for a meeting to set the direction of its economy for the next five years. The escalation in trade hostilities with the US means this meeting has special weight.\n\nMore than 300 members of China’s ruling Communist Party’s central committee will hold the closed-door meeting in a Beijing hotel – usually the Jingxi Hotel in Beijing’s west – to discuss (which in China means endorse) the economic plan developed by the senior leaders of the party, headed by President Xi Jinping.\n\nPresident Xi Jinping and China’s leaders will set the course for the nation’s economy. Credit: AP\n\nThe “Fourth Plenum”, one of seven gatherings scheduled in every five-year period, normally focuses on internal party matters and governance, with economic strategy reserved for the fifth plenum. After Xi delayed last year’s third plenum by almost a year, however, next week’s meeting’s primary focus will be on the economy.\n\nThat doesn’t mean that it will exclude internal party issues. More than a dozen senior officials have either died, been investigated for corruption or have simply disappeared from public sight this year. There has also been an unusually large-scale turnover of generals within China’s armed forces.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/culture/movies/diane-keaton-cause-of-death-family-issues-new-statement-20251016-p5n30a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Diane Keaton cause of death: Family issues new statement",
    "publish_date": "Thu, 16 Oct 2025 12:09:08 +1100",
    "category": "entertainment",
    "authors": [
      "Karl Quinn"
    ],
    "text": "The relatives of Diane Keaton, the beloved actor who died on Saturday at the age of 79, have revealed her cause of death.\n\nIn a statement released to celebrity magazine People, the Oscar winner’s family confirmed she died of pneumonia, and gave thanks for the global outpouring of affection in the days since.\n\nDiane Keaton in 2018. Credit: AP\n\n“The Keaton family are very grateful for the extraordinary messages of love and support they have received these past few days on behalf of their beloved Diane, who passed away from pneumonia on October 11,” the statement issued to the magazine said.\n\nThe statement added a request that anyone wanting to express their condolences in material form ought to direct their considerations towards the causes Keaton was most passionate about.",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/national/jobless-rate-reaches-highest-level-in-almost-four-years-20251016-p5n30o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jobless rate reaches highest level in almost four years",
    "publish_date": "Thu, 16 Oct 2025 12:05:52 +1100",
    "category": "finance",
    "authors": [],
    "text": "Jobless rate reaches highest level in almost four years\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/national/most-essential-workers-can-t-afford-rentals-report-claims-20251016-p5n30k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Most essential workers can t afford rentals report claims",
    "publish_date": "Thu, 16 Oct 2025 12:01:05 +1100",
    "category": "finance",
    "authors": [],
    "text": "Most essential workers can t afford rentals report claims\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 2
  },
  {
    "url": "https://www.smh.com.au/national/heat-hampers-search-for-missing-south-australia-boy-20251016-p5n30l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Heat hampers search for missing South Australia boy",
    "publish_date": "Thu, 16 Oct 2025 12:00:55 +1100",
    "category": "finance",
    "authors": [],
    "text": "Heat hampers search for missing South Australia boy\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/culture/tv-and-radio/official-trailer-for-one-more-shot-20251016-p5n30g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Official trailer for One More Shot",
    "publish_date": "Thu, 16 Oct 2025 11:56:53 +1100",
    "category": "finance",
    "authors": [],
    "text": "Official trailer for One More Shot\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/world/crowd-in-st-petersburg-sings-anti-putin-song-20251016-p5n30f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Crowd in St Petersburg sings anti-Putin song",
    "publish_date": "Thu, 16 Oct 2025 11:55:36 +1100",
    "category": "finance",
    "authors": [],
    "text": "Crowd in St Petersburg sings anti-Putin song\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/is-your-job-burning-you-out-experts-say-better-boundaries-and-workplace-connections-can-help/c00bsgb5r",
    "title": "Is your job burning you out? Experts say better boundaries and workplace connections can help",
    "publish_date": "Wed, 15 Oct 2025 20:00:00 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nIt's estimated that nearly three million Australians are likely to consider leaving their job in the next year.\n\n\n\n\n\nDespite growing awareness about mental health, the recently enshrined right to disconnect, and many taking up work-from-home arrangements, research is showing workplace burnout is getting worse.\n\n\n\n\n\nSo what's going wrong?\n\n\n\n\n\nAssociate Professor Ross Iles is the Chief Research Officer at Superfriend, a not-for-profit that provides organisations with mental health training and support.\n\n\n\n\n\nHe says over the past decade, burnout has remained stubbornly high.\n\n\n\n\n\n\"And when we focus in on particular industries like retail and health and education, that's actually becoming a much more important factor. In fact, it's getting worse. And what we've actually seen across that 10 years of data, we've seen that awareness of workplace mental health is growing in general, the circumstances around mental health, people's understanding the awareness, employer's awareness of mental health, even people rating their work as being a mentally healthy place to work. While those things have in general increased, we actually haven't seen a huge shift in some of the outcomes like burnout over that time. So those things quite aren't shifting fast enough to keep up with the levels of burnout.\"\n\n\n\n\n\nWhat does burnout look like?\n\n\n\n\n\nWell, burnout can present itself in different ways, but experts say there are a few common signs that shouldn't be ignored.\n\n\n\n\n\nThese include feelings of isolation, irritation and a lack of energy.\n\n\n\n\n\nBurnout can also mean feeling less satisfied with work, or disengaging from work you once valued.\n\n\n\n\n\nIt can be physical too, sometimes leading to more headaches and body pain, as well as disrupted sleep patterns.\n\n\n\n\n\nRoss Iles says psychological distress is one of the top factors for industries like healthcare, which has some of the highest reported burnout rates alongside education and retail.\n\n\n\n\n\n\"And in healthcare we're able to find, I guess a number of key risk factors that make it more likely that people are going to experience burnout symptoms. And sitting at the top of the list there is psychological distress. And so psychological distress is that generalised stress and anxiety that people experience in all aspects of their life. And so when people are experiencing high levels of psychological distress, particularly for a prolonged period that's going to increase their burnout or the likelihood they're going to report burnout.\"\n\n\n\n\n\nNew research, commissioned by Allianz Australia, shows that four in five surveyed employees say their workplace fails to enforce healthy workplace habits and boundaries.\n\n\n\n\n\nThose surveyed say excessive workloads, an overload of meetings, and unrealistic deadlines are the leading contributors to burnout.\n\n\n\n\n\nMark Pittman is the Executive General Manager of Personal Injury at Allianz Australia.\n\n\n\n\n\nHe says failing to take adequate breaks intensifies stress and increases the risk of burning out.\n\n\n\n\n\n\"The research shows that employees are really struggling to schedule that regular personal time for themselves, and they're unable to split household responsibilities equally, and don't have a reliable network to help with routine tasks like school drop offs. So we encourage Australians to take a proper break, set boundaries and prioritise recovery activities such as sleep and exercise, and making these small changes can really make a difference in helping to prevent burnout.\"\n\n\n\n\n\nWith nearly six in ten employees surveyed reporting workplace mental distress, it's unsurprising that psychological workers compensation claims have surged by almost 30 per cent.\n\n\n\n\n\nAccording to the research, mental stress and workplace pressure are the second-most common cause of active psychological compensation claims.\n\n\n\n\n\nMark Pittman says there are three key things workplaces can do to help employees avoid burnout.\n\n\n\n\n\n\"The top three solutions that are desired by employees that we've identified through the research includes better training for managers to support employee wellbeing, taking fewer unnecessary tasks through to the workforce, and recurring mental health days.\"\n\n\n\n\n\nWhile personally managing burnout and setting boundaries with your employer is important, Professor Ross Isles says leaders in the workplace have a responsibility to create healthy environments.\n\n\n\n\n\nHe says beyond things like regular breaks, achievable workloads and mental health days, fostering work relationships is a crucial factor in reducing burnout.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 31
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-generational-divide-over-belonging-in-australia/pjnhensyl",
    "title": "Revealed: The generational divide over belonging in Australia",
    "publish_date": "Wed, 15 Oct 2025 18:35:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "Our sense of national belonging has slumped to its lowest levels since 2007, driven by a widening generation gap and precipitous drops among younger Australians, according to new research.\n\n\n\n\n\nThe proportion of millennials who feel a sense of national belonging to \"a great extent\" has almost halved from 2010-2012 levels, dropping from 64 per cent to 34 per cent, the Scanlon Foundation Research Institute's Mapping Social Cohesion 2025 report found.\n\n\n\n\n\nGen X also reported a significant decline over the same period, plummeting from 77 per cent to 53 per cent.\n\n\n\n\n\nMeanwhile, the same metric for baby boomers only dropped from 77 per cent to 73 per cent, while among the silent generation, it decreased from 90 to 85 per cent.\n\n\n\n\n\nGen Z, for whom 2010-2012 data is unavailable, recorded the lowest \"great\" sense of national belonging in 2025, at 31 per cent.\n\n\n\nSource: SBS News / Data from Scanlon Foundation Research Institute\n\nBelonging and social isolation\n\nThe report's lead author James O'Donnell said there were several factors behind the decline in national belonging, some more concerning than others.\n\n\n\n\n\n\"There's that element where [national belonging] gets mixed in with a sense of nationalism and patriotism and those cultural tastes and preferences that can change over time in ways that are interesting, but not always necessarily a cause for concern,\" O'Donnell told SBS News.\n\n\n\n\n\n\"Where we pick up on a cause of concern in the report is where it's quite strongly related to a sense of loneliness, social isolation, unhappiness,\" said O'Donnell, a researcher based at the Australian National University's School of Demography.\n\n\n\nLISTEN TO Australian men face loneliness crisis: what’s driving it and how to fix it SBS News 06:27 English\n\nAround 60 per cent of millennial and gen Z respondents said they feel \"socially isolated from others at least some of the time\", O'Donnell said.\n\n\n\n\n\n\"Those kind of day-to-day daily connections in people's lives then shape their broader sense of belonging in Australia, and that explains a big part of the difference between the older and the younger generations,\" he said.\n\n\n\nEconomic disadvantage and a fair go\n\nO'Donnell said financial wellbeing was \"one of the strongest predictors of a sense of belonging and connection\".\n\n\n\n\n\n\"For example, among people who say that they're financially very comfortable or prosperous, about 58 per cent of people say that they have a great sense of belonging in Australia.\n\n\n\n\n\n\"For people who say they're struggling to pay bills or poor, that's 33 per cent — so it's almost half as likely.\"\n\n\n\n\n\nThe report found that financial pressures were particularly acute for renters, single-parent families and young-to-middle-aged adults.\n\n\n\nO'Donnell said economic factors were \"certainly tied in\" to the widening generation gap in national belonging.\n\n\n\n\n\n\"I think we can certainly see that they're related to one another and also their broader sense of economic justice in Australia.\n\n\n\n\n\n\"So, how much they think that everyone gets a fair go in this country — that's sort of been moving in the same direction for young people as the sense of belonging.\"\n\n\n\n\n\nMembers of younger generations who believe that income inequality is too large were 40 per cent less likely than baby boomers and older generations to have a great sense of belonging in Australia, the report found.\n\n\n\nWhat else did the report find?\n\nBelonging is only one domain the report uses to estimate a national index of social cohesion, which has dropped from 100 in 2007 to 78 in 2025.\n\n\n\n\n\nThe researchers have recorded the same social cohesion score since 2023, something they said may come as a surprise given widespread reports of increasing social fracture.\n\n\n\n\n\n\"The stability of social cohesion may seem surprising in the face of these tumultuous times but perhaps reflects the continuity of daily life and the resilience of social bonds and connections that shape our everyday lives,\" they wrote.\n\n\n\nSource: SBS News / Data from Scanlon Foundation Research Institute Another domain used to calculate social cohesion is 'acceptance and rejection', which includes experiences of discrimination and attitudes to immigration and diversity.\n\n\n\n\n\nThe report's findings suggest 84 per cent of Australians agree that multiculturalism has been good for the nation, something the authors said was a significant contributor to the \"stability of social cohesion\".\n\n\n\n\n\n\"In a world deeply polarised over attitudes to migration, recognition of the contribution of immigrants to Australian society and general support for diversity and multiculturalism has been a source of strength in recent years, though now strained by current events and the persistence of discrimination and racism,\" they wrote.\n\n\n\nAnother domain covers social participation, with the report finding that 54 per cent of Australians were involved in community, social and civic groups, a figure that was the same in 2021.\n\n\n\n\n\nMore than 80 per cent of respondents also agreed that locals in their area were \"willing to help neighbours\" and that neighbours \"from different national or ethnic backgrounds get on well together\".\n\n\n\n\n\nThese connections \"perhaps provide important foundations for Australia's overall social cohesion that are not easily disturbed by external social, economic and political upheaval\", the authors wrote.\n\n\n\n\n\n— The Scanlon Foundation Research Institute is a media partner of SBS.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 32
  },
  {
    "url": "https://www.sbs.com.au/news/video/new-research-reveals-class-bias-limiting-career-progression/sk2icq5a8",
    "title": "New research reveals class bias limiting career progression",
    "publish_date": "Wed, 15 Oct 2025 09:23:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "New research reveals class bias limiting career progression\n\nPublished 15 October 2025, 8:45 am\n\nDiversity Council Australia says class bias is shaping career opportunities with 58 per cent of employers saying they prefer candidates from so-called 'elite' universities and 30 per cent preferring candidates from private high schools over public schools. Some even using these to filter out job applications during recruitment.",
    "source": "SBS",
    "cluster_id": 33
  },
  {
    "url": "https://www.sbs.com.au/news/article/labor-criticised-over-worker-visa-rule-backflip-that-could-affect-thousands/i08mdb5c4",
    "title": "Labor criticised over worker visa rule backflip that could affect thousands",
    "publish_date": "Wed, 15 Oct 2025 07:12:21 +0000",
    "category": "finance",
    "authors": [],
    "text": "Unions have savaged the Albanese government after it quietly abandoned weekly hours guarantees for more than 14,000 Pacific workers.\n\n\n\n\n\nThe Pacific Australia Labour Mobility scheme (PALM) allows workers from across the region, including Vanuatu, Fiji and East Timor, to work in industries where there are not enough local workers available.\n\n\n\n\n\nThe vast majority work in the agriculture and meat processing industries.\n\n\n\n\n\nIn 2023, the government announced the scheme's 14,300 short-term workers would be guaranteed 30 hours of work each week, due to be introduced in April next year.\n\n\n\n\n\nBut on Tuesday, the scheme's website was quietly updated to confirm the pledge had been dropped — and an existing transitional requirement for 120 hours of work averaged over four weeks will be made permanent.\n\n\n\nA factsheet stated the requirement \"for employers to offer short-term workers 120 hours of work reconciled over 4 weeks has been established as ongoing and will no longer end on 31 March 2026\".\n\n\n\n\n\nThe document states that employers unable to offer at least 120 hours of work over the four weeks will have to pay workers an income equivalent to that time.\n\n\n\n\n\nThe move has drawn heated condemnation from the Australian Council of Trade Unions (ACTU), which remains concerned that many short-term workers are being left financially vulnerable under the PALM arrangements.\n\n\n\n\n\nAn SBS News investigation in April found more than 7,000 workers had abandoned the PALM scheme over the past five years , citing exploitation and abuse.\n\n\n\n\n\n\"The government's failure to uphold its commitment to protect vulnerable PALM workers from exploitation by delivering minimum hours is a backwards step for workers’ rights in Australia,\" ACTU president Michele O'Neil said.\n\n\n\n\n\n\"Unions urge the government to reconsider its position and implement its promised 30 hours per week requirement so PALM workers can be treated fairly and afford the basics they need to survive.\"\n\n\n\nThe PALM scheme has been heavily promoted by government ministers during visits across the Pacific, where Australia is seeking to strengthen its diplomatic ties.\n\n\n\n\n\n\"All PALM workers and employers deserve to have a safe, secure and rewarding experience under the scheme,\" Employment and Workplace Relations Minister Amanda Rishworth told SBS News in a statement on Wednesday.\n\n\n\n\n\n\"Keeping the current arrangements will continue to ensure income security for PALM workers, while allowing PALM scheme employers flexibility to deal with unexpected disruptions, such as natural disasters.\"\n\n\n\n\n\n\"There has been strong compliance by employers to their minimum hours obligations under current arrangements, providing PALM workers with the income security they need.\"\n\n\n\n\n\nFarmers and employer groups had labelled the proposed changes unworkable, arguing they failed to reflect the nature of seasonal work.\n\n\n\n\n\nRichard Shannon, the executive officer of the National Farmers' Federation Horticulture Council, said growers \"planning for the worst\" from April would welcome the clarity around the scheme's future, but warned the guarantees risked being a \"handbrake\" on the scheme's viability for employers.\n\n\n\n\n\n\"This particular setting, more than any other, is the one that is causing the pain,\" he told SBS News.\n\n\n\n\n\nHe said concerns raised by unions around worker exploitation as \"baseless\", citing government audits of employers showing \"no workers were receiving less than 30 hours of work anywhere\".\n\n\n\n\n\n\"This has crippled the scheme, and there's no evidence to suggest they've solved a problem here,\" Shannon said.\n\n\n\nHowever, the measure never had the support of the Opposition, which called the guarantee \"unworkable\" and pledged during the election to review the PALM scheme.\n\n\n\n\n\nOn Wednesday, Opposition Pacific affairs spokesperson Jason Wood said the \"rigid 30-hour weekly minimum\" was \"doomed from the start\".\n\n\n\n\n\n\"It completely ignored the seasonal and weather-dependent nature of farm work,\" he told the Australian Associated Press.\n\n\n\n\n\n\"The government needs to stop treating regional employers as an afterthought and start working with them to strengthen, not sabotage, the PALM scheme.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-confluence-of-crises-driving-australias-record-low-fertility-rate/9lh5pvz93",
    "title": "The 'confluence of crises' driving Australia's record-low fertility rate",
    "publish_date": "Wed, 15 Oct 2025 06:53:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Australia's birth rate is at a record low, according to figures released on Wednesday by the Australian Bureau of Statistics (ABS).\n\n\n\n\n\nThe total fertility rate in 2024 was 1.48 births per woman on average, a dip from 1.5 the previous year.\n\n\n\n\n\nBirth rates are falling around the world, but experts say Australia's is heading past the point of no return .\n\n\n\n\n\nIn Australia, the total birth rate has steadily declined over the past 30 years, from 1.85 in 1994.\n\n\n\nAustralia's fertility rates have been on a downward trajectory over time. Source: SBS News The recommended replacement rate — the amount of births per woman required for a population to replace itself across generations — is 2.1 births per woman.\n\n\n\n\n\nBut Australia hasn't seen a fertility rate that high since 1975.\n\n\n\nBirth rate at 'rock bottom'\n\nExperts have labelled the birth rate \"catastrophic\" and called on the government to act before it's too late.\n\n\n\n\n\nLiz Allen, a demographer and researcher at the Australian National University, said Australia's total fertility rates showed a \"further decline from last year's rock bottom\".\n\n\n\n\n\n\"So we're getting into this territory now where we're headed toward a point of no return,\" she told SBS News.\n\n\n\n\n\n\"We're going further and further into ultra-low fertility rate territory, and once we get to the 1.41, 1.3, 1.2 even, births on average per woman — we cannot come back from that.\"\n\n\n\n\n\nAllen said multiple examples show that once a population hits an ultra-low fertility rate, \"there is really nothing\" that could bring it back up to par.\n\n\n\n\n\n\"Some refer to this continued decline in total fertility rates as a human catastrophe,\" she said.\n\n\n\nWhat's driving the plummeting birth rate?\n\nPelin Akyol, research manager at the e61 Institute, a non-profit economic research centre, said Australia's declining fertility rate was driven by \"three factors\" — later parenthood, parents having fewer children, and a rising share of people without children.\n\n\n\n\n\n\"The most significant of those is parents having fewer children, leading to smaller average family size,\" she said in a statement.\n\n\n\nWhile the number of births per year is going up, demographer Liz Allen says that the fertility rate gives a more accurate picture of social change over time. Source: SBS News Akyol noted that concerns around the cost of raising children and job security had \"consistently ranked\" as the most important factors in the decision to have a child, for both men and women.\n\n\n\n\n\n“In recent years, three factors have increased in importance, particularly for young women: The cost of raising children; time and energy for one's career; and availability and affordability of quality child care.\"\n\n\n\n\n\nA recent report from the e61 Institute on Australia's declining birth rates found government-funded incentives like the baby bonus, a John Howard-era initiative which provided lump-sum financial payments to encourage an increase in birth rates, could raise fertility for some groups.\n\n\n\n\n\nBut they could not \"fully\" counter broader demographic trends.\n\n\n\n\n\n\"Looking ahead, policies that support fertility while maintaining or enhancing workforce participation will become increasingly critical,\" Akyol said.\n\n\n\n'Not about selfishness'\n\nThe data found that younger women were having fewer children, with fertility rates for women aged 15 to 29 years decreasing.\n\n\n\n\n\nAllen said that fewer people were able to achieve their desired family size across their lifetime, not because of biological capacity, or what might be perceived as \"selfishness\" — choosing not to have a child.\n\n\n\n\"Really, it's because the social obstacles or hurdles to achieving a much-wanted family are insurmountable,\" she said.\n\n\n\n\n\n\"Things like housing affordability, economic security, gender equality and climate change are all now at this kind of confluence of crises that make it so difficult to really achieve in the world, to thrive.\n\n\n\n\n\n\"Deep at the heart of this is a lack of hope. This fear about tomorrow is so entrenched, and tomorrow doesn't feel certain, so folks are saying, 'We can't possibly bring a child into this.'\"\n\n\n\n\n\nWomen aged 30 to 34 years had the highest fertility rate, at 106 babies per 1,000 women, an increase from 105.2 the previous year.\n\n\n\nAustralians are having children later in life, which Allen says could \"narrow the window of opportunity\" to have more children. Source: SBS News Allen said while it was good this cohort were on the rise, it marked a concerning factor was driving the infertility rate: the age at which women feel they are financially stable enough to have a child is increasing.\n\n\n\n\n\n\"The window of opportunity for having a family is narrow, and it becomes even more narrow with time. So, in other words, the older we are when we start having a family, the fewer children we will have over our life.\n\n\n\n\n\n\"If we think about the trajectory through life, we need to be financially and socially secure, so that means securing ourselves in a career in the labour market, building that ever-growing house deposit and then feeling safe and secure to then start a family,\" she said.\n\n\n\nWomen aged 45 to 49 years had the lowest fertility rate with 1.4 babies per 1,000 women, followed by women aged 15 to 19 years at six babies.\n\n\n\n\n\nAllen noted there were increasing rates of people choosing not to have children, which was good for society, but she wanted to stress there was \"a lot going on\" preventing people from having \"much-wanted children\".\n\n\n\n\n\n\"We are undermining the very future of this place because we've made it simply too difficult, or we've removed the necessary supports for people to achieve a much-wanted family.\"\n\n\n\nAllen said Australia's housing affordability crisis needed to be addressed if governments wanted to lift the birth rate.\n\n\n\n\n\nGender inequality was another issue that was \"holding us back\", she said, along with the environment.\n\n\n\n\n\n\"Climate change weighs so enormously, particularly on young people's minds and their fears about tomorrow. We need to address housing, the economy, gender and climate. If we don't tackle these big-ticket items, we are going to be having this conversation year in, year out,\" she said.\n\n\n\n\n\n\"We're going to get to the point where we say we can't do anything. It's a done deal. We can't reverse this. No baby bonus or lump-sum splash of cash is going to get us out of this mess.\"\n\n\n\n\n\nAllen said a \"coordinated approach\" was needed to make families \"doable\".\n\n\n\n\n\n\"Because the reality is, at the moment, having a much-wanted child is simply out of the question. It is not practical, it's not doable, and it's a sad indictment on Australia.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/what-record-low-fertility-rates-mean-for-our-economy-gold-hits-another-record/ab79wv67m",
    "title": "What record low fertility rates mean for our economy & gold hits another record",
    "publish_date": "Wed, 15 Oct 2025 06:34:09 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/kathryn-lost-her-banking-job-to-a-chatbot-she-just-confronted-her-cba-bosses/cgx8kmymj",
    "title": "Kathryn lost her banking job to a chatbot. She just confronted her CBA bosses",
    "publish_date": "Wed, 15 Oct 2025 04:37:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "A Commonwealth Bank employee who trained an artificial intelligence chatbot that later took her job has confronted the bank's top executives in front of shareholders.\n\n\n\n\n\nKathryn Sullivan was one of 45 customer service employees whose roles were made redundant in late July, before they were offered a chance to stay with the bank after the Finance Sector Union brought a case before the Fair Work Commission.\n\n\n\n\n\n\"Not all the jobs that were offered back were the same job that these people were made redundant from,\" Sullivan said on Wednesday at the bank's annual general meeting at the Gabba in Brisbane.\n\n\n\n\n\n\"I just wanted to know what specific measures, if any, you have in place now to safeguard current staff from having their roles displaced by AI, and also offshoring,\" she said.\n\n\n\nThe 63-year-old said she was made redundant after 25 years with the bank, which is Australia's most valuable public company, and had spent the past few years working on teaching its \"Bumblebee\" chatbot how to respond to customers.\n\n\n\n\n\nShe expected to be redeployed once her work developing scripts and testing responses was finished, but she was instead told her services were no longer required.\n\n\n\n\n\n\"We made a mistake,\" Commonwealth Bank chairman Paul O'Malley said, acknowledging how difficult the process had been for Sullivan.\n\n\n\n\n\n\"We didn't adequately consider all the relevant business considerations. And I think that's been communicated.\"\n\n\n\n\n\nChief executive Matt Comyn added the bank sometimes had to make difficult decisions that impacted employees.\n\n\n\n\n\n\"I think the way we engage with employees, how we try to develop and retain as many of those skills as we can, is really important, and that's certainly a priority for us going forward,\" Comyn said.\n\n\n\nCommonwealth Bank’s chief executive officer and managing director, Matt Comyn, said the bank sometimes had to make difficult decisions that impacted employees. Source: AAP / Darren England The bank posted a record profit of $10.1 billion in the year to 30 June, a figure Comyn previously said could have been higher if it had better leveraged the possibilities from AI.\n\n\n\n\n\nO'Malley also defended the bank's use of offshore workers in India in response to another question, saying the country was home to an incredible pool of talent and the company needed to adapt to the times.\n\n\n\n\n\n\"There's been a dramatic shift in how customers engage with us and how we have to engage with customers,\" he said.\n\n\n\n\n\n\"Fifteen years ago ... we didn't do everything on our phones.\"\n\n\n\nWhile customers once engaged with the bank in branches during traditional opening hours, they now expected staff to be available around the clock, O'Malley said.\n\n\n\n\n\n\"So it actually makes sense to have people operating in different time zones to support that 24/7 service for our customers,\" he said.\n\n\n\n\n\n\"Better customer engagement does require different ways of thinking.\"\n\n\n\n\n\nComyn said that CBA had just over 6,800 employees in India, including 3,000 staff working to combat financial crimes, and 37,000 employees in Australia.\n\n\n\n\n\n\"It's not that we aren't looking in Australia and we are continuing to hire and we are bringing capability,\" he said.\n\n\n\n\n\nThe bank has also opened a tech hub in Seattle, where it sends a rotating group of about 200 Australian staff each year to increase their skills.\n\n\n\n\n\nIt has also partnered with Griffith University and the University of South Australia to develop local skills.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/those-watching-from-afar-as-the-gaza-ceasefire-plays-out-in-real-time/w3ip60rfg",
    "title": "These Sydneysiders watched as the hostage-detainee swap played out. Then came a call",
    "publish_date": "Wed, 15 Oct 2025 04:30:43 +0000",
    "category": "finance",
    "authors": [],
    "text": "Mona Kaskeen and her husband Khalil stayed awake all night on Monday, searching for one face in the rolling coverage from Israel and Gaza.\n\n\n\n\n\nThe face was that of their 22-year-old nephew Ibrahim, who has been in Israeli custody since December 2023, and who they hoped would be released in the hostage-detainee exchange that forms the first part of the United States-brokered Gaza peace plan.\n\n\n\n\n\nMona and Khalil said Ibrahim, previously a university engineering student, has been held by Israel without charge — a fate shared by a growing number of Palestinians since October 7.\n\n\n\n\n\nFinally, at 2.30am, a familiar face appeared on the other end of a video call — although one far more gaunt than the last time they'd seen it.\n\n\n\n\n\n\"I didn't realise it was Ibrahim. He lost weight, too much. He lost his teeth,\" said Mona, a neurosurgeon who came to Australia from Gaza with her family in March 2024 and is living in Sydney.\n\n\n\nIbrahim's family says he lost a lot of weight during his two years in Israeli prison. Source: SBS News \"It was an overwhelming joy, praise be to God,\" Khalil said, adding that Ibrahim's first question to him was why he wasn't waiting for him in Gaza.\n\n\n\n\n\n\"He asked me, 'My God, why did you go to Australia?' I think he wanted me to be there,\" he said.\n\n\n\n\n\nWhile Ibrahim is now back with his loved ones in Gaza, their house has been destroyed and the family is now living in a tent for the foreseeable future.\n\n\n\n\n\nThe United Nations has reported 78 per cent of the Gaza Strip's buildings have been partially or fully destroyed by Israel's two-year onslaught.\n\n\n\nIbrahim was among 2,000 Palestinians released by Israel this week. Source: Supplied Ibrahim is one of nearly 2,000 Palestinians who have now been freed, including 1,700 seized from Gaza since October 2023 and held without charge.\n\n\n\n\n\nIsraeli human rights group B'Tselem reports that, as of December 2024, the Israel Prison Service was holding 9,619 Palestinians on what it defined as \"security\" grounds.\n\n\n\n\n\nThe release of the cohort that included Ibrahim was premised on the exchange of 20 living Israeli hostages and the remains of 28 others who died while in Hamas captivity.\n\n\n\n\n\nAhead of the release of the 20 living hostages on Monday, thousands of Sydney's Jewish community members gathered at an event on Sunday night.\n\n\n\nMembers of Sydney's Jewish community attended an official commemoration of the second anniversary of the October 7 attacks in Sydney on Sunday. This year, 7 October fell on the first day of the Jewish festival of Sukkot. Source: AAP / Sittixay Ditthavong The next day, hundreds gathered in Melbourne's east to watch their release broadcast live.\n\n\n\n\n\nJustine Pearl, a Jewish community member who attended the gathering, told SBS Hebrew on Tuesday: \"I feel like I've had a solid night's sleep for the first time in two years.\"\n\n\n\n\n\n\"I feel elated, exhausted, excited, nervous — all of the feelings, it's a lot,\" she said.\n\n\n\n\n\nNaomi Levin, CEO of the Jewish Community Council of Victoria, said the community was greatly relieved.\n\n\n\n\n\n\"We've had two years of waiting, two years of praying, two years of having our hearts really on hold, while we've been waiting for all the hostages to come home,\" she said.\n\n\n\n\n\n\"But maybe after today with the release of the hostages, it's time for a new era and time for a new era of peace,\" Levin said.\n\n\n\nJewish Community Council of Victoria CEO Naomi Levin joined hundreds at an event in Melbourne's east on Monday to follow live coverage of the events in Israel. Source: SBS News Khalil also hopes the ceasefire marks the beginning of a new chapter.\n\n\n\n\n\n\"God willing, it will be a real beginning for a comprehensive and lasting peace and the beginning of reconstruction and settling people, because we are tired,\" he said.\n\n\n\n\n\n\"The Palestinian people have had enough ... so I hope that it will be a comprehensive and honest deal, and that it will be carried out in the best possible way, with the support of the sponsoring countries.\"\n\n\n\nLISTEN TO Australia's Jewish and Palestinian communities celebrate the return of loved ones SBS News 04:40 English\n\nBut strains in the partly agreed peace plan are already starting to show.\n\n\n\n\n\nHamas has accused Israel of violating the terms of the ceasefire after the Israeli military killed five Palestinians as they went to check on houses in a suburb east of Gaza City.\n\n\n\n\n\nThe Israeli military said it had fired on people who crossed truce lines and approached its forces after ignoring calls to turn back.\n\n\n\n\n\nIsrael has also accused Hamas of failing to fulfil its promise to return the remains of deceased hostages, threatening to halve the number of humanitarian aid trucks allowed into the famine-stricken enclave in response.\n\n\n\nREAD MORE Israel says one of four bodies returned by Hamas does not match any of the hostages\n\nAs of Wednesday, Hamas had handed over eight coffins of dead hostages, leaving at least 19 presumed dead and one unaccounted for.\n\n\n\n\n\nMeanwhile, fears have been raised Hamas will not willingly disarm, a major sticking point of the plan .\n\n\n\n\n\nSince Israel partially withdrew from Gaza, Hamas has deployed hundreds of security forces in the streets and executed several people they accused of collaborating with Israel.\n\n\n\n\n\nUS President Donald Trump — who experts say \"holds the key\" to keeping the peace plan moving — has previously given his blessing to Hamas to reassert some control of Gaza, at least temporarily.\n\n\n\n\n\nIsraeli officials have so far refrained from commenting publicly on the re-emergence of the group's fighters.\n\n\n\n\n\n— With additional reporting by Reuters and the Australian Associated Press\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.theage.com.au/lifestyle/fashion/it-s-bras-and-panties-the-victoria-s-secret-show-is-back-20251016-p5n2w0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "‘It’s bras and panties’: The Victoria’s Secret show is back",
    "publish_date": "Thu, 16 Oct 2025 12:48:03 +1100",
    "category": "lifestyle",
    "authors": [
      "Damien Woolnough"
    ],
    "text": "With a cavalcade of bedazzled bras, panties and supermodels with bouncy blowouts, the Victoria’s Secret runway show in New York cemented its return to the fashion calendar. It’s almost as though its cultural cancellation in 2019 never happened. #MeWho?\n\nPerformers Missy Elliott, Karol G, TWICE and Madison Beer, top-tier models Gigi and Bella Hadid, Emily Ratajkowski and underwear that would not survive a single spin in a tumble dryer were reminiscent of the show’s cultural peak, when Taylor Swift performed on the runway in 2013 and 2014. That was before the Victoria’s Secret runway show was cancelled in 2019, finally returning last year with Kate Moss, her daughter Lila and Cher.\n\nThis was not the place to raise ties between sex offender Jeffrey Epstein and Leslie Wexner, the former head of Victoria’s Secret’s parent company, who stepped down in 2020. Accusations of harassment and misogyny against former chief marketing officer Ed Razek, who controversially told Vogue he did not think “transsexuals” should be included in the show, before stepping down in 2019, were also silenced by the sound of clacking pink heels on the runway.\n\nGigi Hadid at the 2025 Victoria’s Secret runway show in New York. Credit: Variety via Getty Images",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/sport/afl/afl-trade-news-live-zach-merrett-nightmare-goes-to-the-heart-of-your-club-20251016-p5n2w9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "AFL trade news LIVE: Candid Curnow opens up on Voss, Blues exit; Dons won’t commit to Merrett as skipper",
    "publish_date": "Thu, 16 Oct 2025 12:46:51 +1100",
    "category": "sports",
    "authors": [
      "Hannah Kennelly",
      "Roy Ward"
    ],
    "text": "Sydney recruit Charlie Curnow says he had a great working relationship with Michael Voss, and will remember fondly the four years he played under the Carlton coach.\n\nA day after his move to the Swans was finalised in the closing minutes of trade period, Curnow opened up on his departure from the Blues.\n\nNew Swans forward Charlie Curnow in South Melbourne on Thursday. Credit: Eddie Jim\n\nCurnow said that after nine years at Ikon Park, he needed a fresh start but had not spoken to other clubs until the end of the season.\n\nHe spoke highly of Voss, and refuted speculation his relationship with the Blues coach had become strained this year.\n\n“Not at all,” Curnow said at his unveiling as Swan at Sydney’s Melbourne office in South Melbourne.\n\n“In the end, it’s a pretty high-pressure environment.\n\n“I think, obviously some things that maybe leaked out there that I would say aren’t true. It’s always a tough environment football and it’s going to be a lot of challenges that come with that. But for me and him, like I don’t see our relationship being affected at all by this.\n\nLoading\n\n“It’s just hard to have a few good conversations with him at the end of the season to if I want to get traded, it’s just you have to do that, you can’t just look and go behind his back and just start putting myself out there.\n\n“I think we’re in a pretty healthy spot and as I said before, like I played some awesome footy under him and I thank him a lot for that.\n\n“Like that was a tough part of my career coming over a knee injury and then trying to play. He dealt with that fantastically.”\n\nCurnow said he would contact Voss again to thank him.\n\n“I played some great footy under Vossy, we had a great relationship,” Curnow said.\n\n“I owe him a lot, I came out of an injury and was able to play three years and four in a row beneath him and play good footy.\n\n“That’s going to be some of my best memories when I look back and have finished footy, playing underneath him.”",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/national/queensland/brisbane-news-live-trio-pictured-after-serious-assault-in-valley-20251015-p5n2on.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Brisbane news live: Trio pictured after serious assault in Valley; Cheapest fuel is on the southside",
    "publish_date": "Thu, 16 Oct 2025 12:45:58 +1100",
    "category": "finance",
    "authors": [],
    "text": "The Crisafulli government has claimed the Cross River Rail project cost has blown out by another $2 billion in the past 10 months – an increase it blamed on the Labor Party.\n\nDuring ministerial statements in state parliament this morning, Transport Minister Brent Mickelberg – who last December put a $17 billion price tag on the project – said “extensive negotiations with contractors” had resulted in a revised total cost of $19.04 billion.\n\nIt was a far cry from the former Labor government’s $5.4 billion cost, but by the LNP government’s own admission the new figure included additional work throughout the train network that had not initially been included in Cross River Rail’s line-item costs.\n\nTransport Minister Brent Mickelberg. Credit: Jamila Filippone\n\n“Our government has also made it clear that contractors would be held to account for their performance,” Mickelberg told parliament.\n\n“That’s why there are now elements of funding conditional on exceptional performance, and contractors meeting major milestones on time. If they don’t deliver, they won’t get paid.”\n\nBrisbane Times has asked Mickelberg’s office for a full rundown of its $19.04 billion estimate. Comment was also sought from Labor.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/national/victoria/the-cat-that-changed-the-law-20251016-p5n310.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The cat that changed the law",
    "publish_date": "Thu, 16 Oct 2025 12:30:04 +1100",
    "category": "finance",
    "authors": [],
    "text": "The cat that changed the law\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/sport/swimming/rise-of-the-terminator-arnie-s-10-greatest-feats-in-the-pool-20251016-p5n2zm.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Rise of the Terminator: Arnie’s 10 greatest feats in the pool",
    "publish_date": "Thu, 16 Oct 2025 12:29:12 +1100",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Ariarne Titmus hangs up her goggles as one of Australia’s greatest swimmers. Her retirement at the age of 25, a year older than Ian Thorpe when he bowed out in 2006, sees her depart the sport as an icon. She has been a formidable force on the world stage since 2018, producing some of the greatest moments in Australian sport this century. Here are 10 of her finest performances. 1. 400m freestyle gold – 2021 Tokyo Olympics As Titmus said on Thursday, nothing compares to your first Olympic gold medal. To do it against the best female swimmer in history makes it all the sweeter.\n\nAdvertisement\n\nTitmus was up against US superstar Katie Ledecky on the opening night of competition at the Tokyo Games. The Australian and her coach, Dean Boxall, had spent years devising a plan to beat Ledecky. It was the source of motivation at every training session. Ariarne Titmus after winning the 400m freestyle final in Tokyo. Credit: Maddie Meyer Ledecky, the world record holder, went out hard and led by 0.66 seconds at the 200-metre mark. With 100 metres to go, Titmus had closed the gap to 0.16 seconds – and then launched her assault. In a brutal final sprint to the wall, Titmus powered her way to victory to claim a stunning upset and her first Olympic gold medal. Boxall’s celebration in the stands remains the stuff of folklore. 2. 400m freestyle gold – 2024 Paris Olympics\n\nAdvertisement\n\nNo Australian woman had won back-to-back Olympic gold medals in the same event since Dawn Fraser won 100m freestyle titles in 1956, 1960 and 1964. This duel between Titmus, Ledecky and rising Canadian star Summer McIntosh was dubbed the Race of the Century. All three swimmers had a chance of victory, but Titmus was the narrow favourite. Gold medallist Ariarne Titmus, centre, stands with silver medallist Summer McIntosh and bronze medallist Katie Ledecky. Credit: Getty Images Titmus went out hard and motored through the water. In the stands, Boxall could be seen screaming, “break them, break them” in the final stages as Titmus surged to victory, ahead of McIntosh by almost a second. 3. 400m freestyle gold – 2023 world championships For the first time in years, some were writing Titmus off. Though she was the reigning Olympic champion, her world record had been broken by McIntosh at the Canadian trials earlier in the year.\n\nAdvertisement\n\nTitmus’ times at the Australian trials weren’t amazing, but she always believed she could deliver on the big stage. And in one of her most extraordinary performances, Titmus was perfect in Fukuoka. She annihilated McIntosh’s world record by seven tenths of a second, clocking a time of 3:55.38, which remains her best in the event. The Australian also won a $US20,000 ($30,000) world record bonus and inflicted a major psychological blow before the Paris Olympics. “I felt like I was swimming downhill,” Titmus told this masthead afterwards. 4. 400m freestyle gold – 2019 world championships This was the victory that announced Titmus to the world.\n\nAdvertisement\n\nStill only 18, she produced a breathtaking final 50 metres to chase down Ledecky, who had dominated the event. It was Titmus’ first victory over the legend of the pool. The American’s shock defeat was a passing-of-the-torch moment. It gave Titmus the belief she could end Ledecky’s dominance. 5. 200m freestyle gold – 2021 Tokyo Olympics Two days after her 400m freestyle triumph, Titmus delivered again. She held off Hong Kong’s Siobhan Haughey in a time of 1:53.50 to set a new Olympic record and claim her second gold of the Games. Titmus became just the third Australian woman, after Shane Gould in 1972 and Susie O’Neill in 2000, to win the event, underlining her versatility across distances.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 13
  },
  {
    "url": "https://www.theage.com.au/politics/federal/unemployment-rate-hits-four-year-high-putting-pressure-on-rba-to-cut-rates-20251016-p5n2zz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Unemployment rate hits four-year high, putting pressure on RBA to cut rates",
    "publish_date": "Thu, 16 Oct 2025 12:17:29 +1100",
    "category": "finance",
    "authors": [
      "Shane Wright",
      "Millie Muroi"
    ],
    "text": "Unemployment has hit its highest level in four years, putting renewed pressure on the Reserve Bank to look at a rate cut at its meeting next month.\n\nThe unemployment rate hit 4.5 per cent – up from 4.3 per cent – as the number of people out of work climbed from 650,000 in August to 684,000 in September, data from the Australian Bureau of Statistics on Thursday showed.\n\nThat’s despite the number of people in jobs climbing by nearly 15,000. Total job growth over the past 12 months has slowed to 1.3 per cent with the country adding 190,500 positions. Total unemployment, however, has jumped by 12.6 per cent, or 76,800.\n\nThe latest statistics put pressure on the Reserve Bank to consider cutting interest rates at its meeting in the first week of November. The bank had forecast the unemployment rate to hit 4.3 per cent by the end of the year.",
    "source": "TheAge",
    "cluster_id": 0
  },
  {
    "url": "https://www.theage.com.au/culture/live-reviews/melbourne-review-wrap-katya-kabanova-20251015-p5n2n6.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Inspired by unrequited love, this rarely performed show is ingenious and daring",
    "publish_date": "Thu, 16 Oct 2025 12:17:17 +1100",
    "category": "entertainment",
    "authors": [
      "Barney Zwartz"
    ],
    "text": "OPERA\n\nKatya Kabanova ★★★★★\n\nVictorian Opera, Palais Theatre, until October 16\n\nCzech composer Leos Janacek suffered a long obsession with a four-decades-younger married woman. His passion was entirely unrequited, but music lovers got incalculable benefits as Kamila Stosslova inspired a string of compositions, including Katya Kabanova – one of the great but rarely performed operas of the 20th century.\n\nDesiree Frahn and Andrew Goodwin in a scene from Katya Kabanova. Credit: Jeff Busby\n\nIt is the story of a young wife who endures a bullying mother-in-law and a weak husband under the thumb of his mother.\n\nVictorian Opera’s production scored at every turn, with a splendid Australian cast, ingenious and creative production, and daring and clever use of live black and white video throughout on a full-stage screen. Not least was the Australian National Academy of Music orchestra’s extraordinary playing, sensitively and effectively led by Alexander Briger (nephew of one of the finest Janacek conductors ever, Charles Mackerras).",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/culture/theatre/shiralee-adaptation-needs-grittier-fabric-to-weave-tale-true-to-mythology-20251011-p5n1qn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Dark themes lost beneath the surface in expertly performed cabaret",
    "publish_date": "Thu, 16 Oct 2025 12:17:12 +1100",
    "category": "entertainment",
    "authors": [
      "John Shand"
    ],
    "text": "Finding galaxies of love under tattooed eyelids, and a kingly swagger in white socks riding free on stocky legs, the cuddly American gangster of self-acceptance and soul took Sydney right up to the heavenly high he’s on in his healing journey, with big-budget pyrotechnics to match those big-belted feels. Since the breakout success of I’ve Tried Everything But Therapy (Part 1) in 2023, with its heavyweight hits about toxic co-dependency, addiction and heartbreak, Teddy Swims has come a long way. He’s been to therapy, for one. He’s also found love again, the wholesome kind. Plus, with global tours and billions of streams, the former YouTube cover artist sure is making bank. Teddy Swims with band Freaky Feely at Qudos Bank Arena. Credit: Glenn Pokorny/Qudos Bank Arena “I’m so grateful towards my shitty ex-girlfriend,” he joked good-heartedly to a packed arena. Though Teddy still pays tribute to (Part 1), tucking a few of the best into the encore, this tour is a celebration in the spirit of 2025’s (Part 2), where he’s come out of all that pain to a place he couldn’t have imagined a few years back: enormous gratitude. Sydney is his first Australian tour stop, but his second October show, having won hearts in a kilt at the NRL Grand Finals. Still with Freaky Feely backing – the high school band he’s brought with him on the up and up – it’s a two-hour-long theatre of the full second album tracklist, and then some. A natural performer, we see Teddy crooning Bad Dreams into a mic stand shaped like a voluptuous woman, going back to the raw place with Some Things I’ll Never Know, getting tender with Small Hands devoted to his new baby boy, crowd-pleasing at the close with Lose Control.\n\nIt’s a powerful, oaky, aching voice: soaked in decades of smoke and liquor; trained on YouTube clips, high school musicals and Atlanta area bands; and set on its god-gifted course to slow-burning stardom by a sweetheart dad who introduced him to the likes of Al Green. The production gives him the panache he deserves, while showing his sense of humour. At one point, following rolling fog and shooting flames, we see Teddy reappear on the summit of a golden ramp on a dunny throne from a hidden trapdoor. Wardrobe whirls him through a white cowboy suit, a tarot-patterned silk robe, a black T and shorts, and a creamy trench coat. Shoes? When you’re that grounded, who needs ’em. It’s no wonder audiences adore him: an everyman shot to pop firmaments on true talent, ribbing and relishing the trappings of class. A role model for a generation leaning into the strength of vulnerability, it’s big love all round. THEATRE\n\nTHE SHIRALEE\n\nDrama Theatre, October 10\n\nUntil November 29\n\nReviewed by JOHN SHAND\n\n★★★ A deep sense of mythology surrounds the reader in D’Arcy Niland’s 1955 novel, The Shiralee. It’s as if the very landscape of mid-20th-century Australia is misanthropic, while those inhabiting it can be as deadly as brown snakes.\n\nIn adapting the novel, playwright Kate Mulvany and director Jessica Arthur (for Sydney Theatre Company) have been aware of this quality, but they’ve only partially succeeded in transmitting it through their production. Too often this feels like a musical minus the songs: as gooey as a box of chocolates in the sun when attempting warmth of heart, and a little lame and stagy when shooting for menace. Kate Mulvany, Ziggy Resnick and Josh McConville in The Shiralee for the Sydney Theatre Company. Credit: Prudence Upton Niland’s novel tells of Mac, an itinerant jack-of-all-trades, who arrives back in Sydney to find his wife in bed with another bloke. Mac sorts out the bloke with his fists, and his wife by taking their daughter, Buster, and hitting the road. It’s a tale of a little girl adoring her remote, belligerent father, and gradually wearing away his armoured outer layer, almost as slowly as water acts on stone. Given the limitations of child actors, Buster is now nine rather than four, which shifts the dynamic considerably, as a four-year-old is obviously more helpless and dependent. Mulvany uses this shift to craft a more knowing, perceptive and wily Buster, and then Arthur has cast the notable Ziggy Resnick in the role. Although over a dozen years older than Buster, Resnick locates the truth of the bashfulness, eagerness, playfulness, bewilderment, humour, earnestness and staunch morality. Ziggy Resnick and Josh McComville with Paul Capsis (centre) as Desmond the bush poet. Credit: Prudence Upton\n\nMulvany also makes Buster more influential and more evenly matched in size of role with Mac, played by Josh McConville. McConville is convincing as the bluff, taciturn man who solves money problems with his sweat, and people problems with his fists. Tempered like steel in a forge, he is loath to let this slip of a girl, this shiralee (or burden) change his pugnacious, self-absorbed life. Niland peoples his novel with vivid incidental characters, and a further six actors assume multiple roles, including Mulvany herself playing Marge, Buster’s mother, whom she makes more rounded and sympathetic now she’s not just being seen through Mac’s eyes. Aaron Pedersen and Josh McConville in The Shiralee. Credit: Prudence Upton Paul Capsis is ideal as the superbly eccentric Desmond, a cycling swaggie and published bush poet. He (as do most of the minor characters) offers flickers of illumination to the protagonists, especially Buster, who is photographic paper in this regard compared with Mac’s carbon paper. Stephen Anderson, Lucia Mastrantone, Aaron Pedersen and Catherine Van-Davies complete the cast. Unlike the book, the story is told chronologically, which perhaps partly undermines that mythic quality: time is now linear rather than looped. But Jeremy Allen’s set bolsters the mythology, expertly using the Drama Theatre’s widescreen stage, while Jessica Dunn’s music amplifies the sense of space, foreboding and starry-skied wonderment. Alas, they can’t help the fact that when the play swerves back towards naturalism, it should be woven from grittier fabric.\n\nMUSIC\n\nHARRY BENNETTS PERFORMS BEETHOVEN’S VIOLIN CONCERTO\n\nSydney Symphony Orchestra, City Recital Hall, October 9\n\nReviewed by PETER MCCALLUM\n\n★★★½ Harry Bennetts played Beethoven’s Violin Concerto with a sweet sound, fine line and nuanced care, allowing the work’s beauties to unfold lyrically without false drama or undue storminess. Conductor Umberto Clerici began the opening orchestral tutti with unhurried gentleness. There was no hint of spikiness when the string parts took up the quiet opening drum beats, and the phrases breathed in long lines, moving with the breadth and inevitability of a noble river. Harry Bennetts, conductor Umberto Clerici and the Sydney Symphony Orchestra. Credit: Sydney Symphony Orchestra When Bennetts took up the solo entry, it was not with the swagger of a virtuoso driven by posturing heroics, but rather with a focus on allowing the work’s intricacies to blossom with precision and clarity. In the codetta section, as the orchestra starts to surge, Bennett twice responded to the challenge with aptly projected vigour, but on the third, took on the Orphean task of taming them with quiet calm.\n\nIn the development section, when the soloist brings back the opening theme in B minor, high in the violin’s range, Bennetts created a memorable moment of transparent expressiveness without excess. The cadenza of the first movement (by Joachim) held attention with its even, unpressed resonance, contrapuntal clarity, glowing tone and true intonation without a hint of roughness or unwanted bow noise. All of this, of course, requires some freedom with the tempo which, for me, was slightly overdone in the Coda. The slow movement captured a sense of fresh stillness, Bennett ornamenting the underlying orchestral theme with balanced ornamentation of silvery brightness. I occasionally found the sense of pulse in the orchestral playing floated so freely it almost dissolved. The finale had beguiling buoyancy from both soloist and conductor. After another finely polished cadenza and exuberant Coda, Bennett started the last arpeggio with hushed insouciance as though beginning a new episode before the orchestra emphatically stopped any further discussion. In the second half Clerici and the Sydney Symphony again emphasised gentle lyricism in Schubert’s Symphony No. 4 in C minor, D. 417 Tragic. The first movement was fretful and agitated (‘Tragic’ as a subtitle has always seemed a little overblown) and the second gracious. In the third movement, Clerici and the SSO played Schubert’s cross-accents to create a sense of poised ambiguity. The finale was neat and discursive, as the young Schubert (he was only 19) was prone to be. DANCE\n\nTHE BOGONG’S SONG: A CALL TO COUNTRY\n\nBangarra Studio Theatre, October 9, until October 19\n\nReviewed by CHANTAL NGUYEN (with James and Teddy Gribble, and Charlie Price)\n\n★★★½\n\nMy co-reviewers Jamie (aged eight), his brother Teddy and their cousin Charlie (both aged six) didn’t even make it to their seats before being captivated by the moody blue uplighting at Bangarra Studio Theatre.\n\nIt was a foretaste of the atmospheric vibe of Bangarra Dance Theatre’s school holiday show The Bogong’s Song by Yolande Brown and Chenoa Deemal, for ages five plus. It tells the story of siblings Beau and Myee (played by Benjin Maza and Tjilala Brown-Roberts, both fabulous triple threats). They are dream-transported to ancestral Country in the Snowy Mountains, where they must find a missing Bogong moth, healing the land and their own hearts along the way. “They were in sync like all the time when they danced!” Jamie observed. Benjin Maza and Tjilala Brown-Roberts in The Bogong’s Song. Credit: Edwina Pickles The Bogong’s Song features pretty much everything you could think of for a children’s production. There’s acting, singing, rapping, animated backgrounds, talking trees, hand-held puppets, shadow puppets, sing-alongs, and dancing. While the pacing can be patchy and the narrative occasionally lags, enough happens to keep things rolling. And the animal characters are a hit. “I liked the possum and the baby possum!” enthused Teddy. “I liked the lizard,” responds Charlie. “He was funny because he said he would eat the moth but then he didn’t!” Jamie agreed. “He was hilarious! He used a chip packet as a solar panel!”\n\nThere are also heartfelt lessons. “It was about helping the endangered moths,” explained Jamie. “[The siblings] needed to connect with Country, which meant listening to Country and the land. It made me feel good, but a little bit sad for how the world was treated.” Teddy nodded thoughtfully: “They were trying to not let the worlds separate.” The Bogong’s Song also grapples with Australia’s shockingly young age of criminal responsibility, as Beau and Myee grieve the imprisonment of their deaf little brother Joey. That part, recounted Jamie, is “very, very sad”. “He stole lollies. He went to jail. And he was 10. He was confused and scared. Couldn’t he just get a fine?” The high point is the finale, featuring an all-too-short traditional dance featuring ochre paint and didgeridoo music. This part has no wisecracking animals or cartoons, but its power is immediately palpable. The children in the audience become transfixed, completely still and silent, as if responding to some deep, ancient summons that cuts through all the screens, lights, and noise.\n\nMUSIC\n\nTHE TALLIS SCHOLARS\n\nSydney Opera House, October 12\n\nReviewed by PETER MCCALLUM\n\n★★★★★ The Tallis Scholars began their eleventh Australian tour with a glowing, subtly invigorated sound of rich density and iridescent edge in the splendid eight-part motet Deus in adiutorium by the 17th century Spanish/Mexican composer Juan Gutierrez de Padilla. In an interview earlier in the day, director and founder of the Tallis Scholars, Peter Phillips, gave some insight into what gives this doyen of Renaissance vocal ensembles its distinctive tonal quality which is so elusive to describe yet instantly loved by audiences worldwide. He spoke of the micro-refinements of tuning that singers undertake when singing without instruments. Equally important, of course, is the talent, dedication and professionalism of the singers and, in Phillips’ case, 53 years of experience in refining and perfecting the Tallis Scholars to lay bare the glories of the Renaissance with transparent clarity. Listening closely to the vibrant chords of Padilla’s work, one can hear, beyond the purity of tone and pitch, small harmonics of the sort one hears in singing from Bulgaria to Tibet that add shafts of colour and engender delight. The program was built around the theme of chant which appeared in beguiling simplicity in the next work, in principio by 12th century abbess, Hildegard of Bingen, sung by a sub-group of female singers with disarming naturalness of line and rhythm.\n\nA more recent adaptation of chant-based melodic and polyphonic structures was then presented in Arvo Part’s Triodion, written for the 150th anniversary of Lancing College in Sussex, England. A different range of harmonics emerged in the halos of Part’s delicately soft blends of humming, solo and widely spaced voices, leading to a still central point that even a fretful baby in the audience could not disturb. After another chant by Hildegard the first half concluded with the substantial motet by Jacob Obrecht, Salve Regina, in which varying groupings of the 10 voices coalesced and mutated to create a sense of timeless calm. To start the second half, the singers split into widely separated groups for Allegri’s Miserere mei, Deus. Phillips directed the first chorus from the stage, a solo singer sang chant section from the eastern gallery, while, high in the south-western part of the hall the second chorus was heard magically from behind as soprano Emma Walsh embellished the choral sound by repeatedly ascending with apparently effortless grace to an ethereal high C. Part’s Magnificat and Da Pacem Domine again led listeners to utterances that were at once almost inaudibly quiet yet palpable and definite. After Hildegard’s O ecclesia, Josquin des Prez’ Praeter rerum began with darker low-pitched textures, ending with the richly rewarding choral sound that had been heard at the start and to which it is so easy to become addicted. MUSIC\n\nTRIO ISIMSIZ\n\nCity Recital Hall, October 13\n\nReviewed by PETER MCCALLUM\n\n★★★½ In the Renaissance, a missa sine nomine was literally “a Mass without a name”, which meant that, unlike most Masses of the time, it didn’t build on pre-existing material.\n\nViolinist Pablo Hernan Benedi, cellist Edvard Pogossian and pianist Erdem Misirlioglu have adopted the same paradoxical nomenclature by christening themselves Trio Isimsiz, which is Turkish for “trio without name”. Their program of music by Brahms, Coll and Schubert also consisted of works without names in that all of them were simply called “Piano Trio”, though the trio by Francisco Coll did make references to pre-existing music and styles, which flitted into the background like music half-remembered in a dream. Musica Viva’s Trio Isimsiz – violinist Pablo Hernan Benedi, cellist Edvard Pogossian and pianist Erdem Misirlioglu – at the City Recital Hall. Credit: Dylan Alcock One allusion was to Strauss’ comic opera Die Schweigsame Frau (The Silent Woman) about an old man whose intolerance of noise becomes a vehicle for his torment by the young. It was, in one sense, a metaphor for the way chaotic textures in Coll’s trio fragmented and subverted coherent musical ideas just as they began to emerge. The trio began with a short spiky restless movement in which pizzicato string notes and scattered staccato chords from the piano were thrown frenetically across the range of all three instruments, like someone tearing up a first draft. The second movement, the longest and weightiest, began with a bell-like chord on the piano and explored expressive melody and quiet, lonely spaces, sustaining ideas and building up tension in a more familiar way. The third movement returned to fragmented thinking, lurching in two-note figures from violin and cello accompanied by shattered sprays of notes from the piano. The final movement scurried away with impulsive energy, with bursts of scales and contrapuntal ideas that quickly petered out and went nowhere. Towards the end, the music became quiet, like dust settling after a furious row, and a waltz-like figure emerged and quickly vanished in the distance.",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/world/asia/the-world-is-watching-as-china-unveils-its-new-five-year-plan-20251016-p5n2ws.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The world is watching as China unveils its new five-year plan",
    "publish_date": "Thu, 16 Oct 2025 12:09:53 +1100",
    "category": "finance",
    "authors": [
      "Stephen Bartholomeusz"
    ],
    "text": "Next week, China’s leadership will gather in Beijing for a meeting to set the direction of its economy for the next five years. The escalation in trade hostilities with the US means this meeting has special weight.\n\nMore than 300 members of China’s ruling Communist Party’s central committee will hold the closed-door meeting in a Beijing hotel – usually the Jingxi Hotel in Beijing’s west – to discuss (which in China means endorse) the economic plan developed by the senior leaders of the party, headed by President Xi Jinping.\n\nPresident Xi Jinping and China’s leaders will set the course for the nation’s economy. Credit: AP\n\nThe “Fourth Plenum”, one of seven gatherings scheduled in every five-year period, normally focuses on internal party matters and governance, with economic strategy reserved for the fifth plenum. After Xi delayed last year’s third plenum by almost a year, however, next week’s meeting’s primary focus will be on the economy.\n\nThat doesn’t mean that it will exclude internal party issues. More than a dozen senior officials have either died, been investigated for corruption or have simply disappeared from public sight this year. There has also been an unusually large-scale turnover of generals within China’s armed forces.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/culture/movies/diane-keaton-cause-of-death-family-issues-new-statement-20251016-p5n30a.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Diane Keaton cause of death: Family issues new statement",
    "publish_date": "Thu, 16 Oct 2025 12:09:08 +1100",
    "category": "entertainment",
    "authors": [
      "Karl Quinn"
    ],
    "text": "The relatives of Diane Keaton, the beloved actor who died on Saturday at the age of 79, have revealed her cause of death.\n\nIn a statement released to celebrity magazine People, the Oscar winner’s family confirmed she died of pneumonia, and gave thanks for the global outpouring of affection in the days since.\n\nDiane Keaton in 2018. Credit: AP\n\n“The Keaton family are very grateful for the extraordinary messages of love and support they have received these past few days on behalf of their beloved Diane, who passed away from pneumonia on October 11,” the statement issued to the magazine said.\n\nThe statement added a request that anyone wanting to express their condolences in material form ought to direct their considerations towards the causes Keaton was most passionate about.",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/national/jobless-rate-reaches-highest-level-in-almost-four-years-20251016-p5n30o.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jobless rate reaches highest level in almost four years",
    "publish_date": "Thu, 16 Oct 2025 12:05:52 +1100",
    "category": "finance",
    "authors": [],
    "text": "Jobless rate reaches highest level in almost four years\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/national/most-essential-workers-can-t-afford-rentals-report-claims-20251016-p5n30k.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Most essential workers can t afford rentals report claims",
    "publish_date": "Thu, 16 Oct 2025 12:01:05 +1100",
    "category": "finance",
    "authors": [],
    "text": "Most essential workers can t afford rentals report claims\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 2
  },
  {
    "url": "https://www.theage.com.au/national/heat-hampers-search-for-missing-south-australia-boy-20251016-p5n30l.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Heat hampers search for missing South Australia boy",
    "publish_date": "Thu, 16 Oct 2025 12:00:55 +1100",
    "category": "finance",
    "authors": [],
    "text": "Heat hampers search for missing South Australia boy\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/culture/tv-and-radio/official-trailer-for-one-more-shot-20251016-p5n30g.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Official trailer for One More Shot",
    "publish_date": "Thu, 16 Oct 2025 11:56:53 +1100",
    "category": "finance",
    "authors": [],
    "text": "Official trailer for One More Shot\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/world/crowd-in-st-petersburg-sings-anti-putin-song-20251016-p5n30f.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Crowd in St Petersburg sings anti-Putin song",
    "publish_date": "Thu, 16 Oct 2025 11:55:36 +1100",
    "category": "finance",
    "authors": [],
    "text": "Crowd in St Petersburg sings anti-Putin song\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  }
]