[
  {
    "url": "https://www.9news.com.au/national/how-to-find-unclaimed-money-australia/0ed2ef4c-7123-4798-88e6-1b9203a8894a",
    "title": "How Australians can claim their slice of $2.6 billion in a few minutes",
    "publish_date": "Tue, 06 Jan 2026 00:00:00 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "More than $2.6 billion in forgotten money is ﻿being held by state governments across the country waiting to be claimed.\n\nAustralians are being urged to spend a few minutes ﻿checking if they are eligible for a portion of the cash.\n\nThe sum includes share dividends, trust accounts, refunds, commissions, deceased estates and money from a range of other sources.\n\nREAD MORE: Your guide to all the changes in effect from January 2026\n\nMore than $2.6 billion in forgotten money is ﻿being held by state governments across Australia. (Getty)\n\nThe money is often lost because of name or address changes.\n\nHere is how you can check ﻿whether you are owed a slice of $2.6 billion.\n\nN﻿ew South Wales\n\nRevenue NSW maintains an unclaimed money register for the state and offers a free online service for individuals to find and claim lost cash they may be entitled to.\n\nSearch for unclaimed money in NSW here .﻿\n\nQueensland\n\nUnclaimed cash is administered by the Queensland ﻿Public Trustee , which provides tips on how to search for and claim unclaimed money on its website.\n\nSearch for unclaimed money in Queensland here .﻿\n\nVictoria\n\nVictoria's State Revenue Office runs the state's Unclaimed Money Register and has an online search tool to help individuals find lost cash.\n\nSearch for unclaimed money in Victoria here .﻿\n\nAustralian Capital Territory\n\nThe Public Trustee and Guardian for the Australian Capital Territory administers unclaimed money in the ACT and has a smart form used to search for unclaimed money on its website.\n\nSearch for unclaimed money in the ACT here .﻿\n\nSouth Australia\n\nSouth Australia's Department of Treasury and Finance handles lost money claims in SA and maintains a searchable online database of unclaimed funds in the state.\n\nSearch for unclaimed money in SA here .﻿\n\nWestern Australia\n\nThe Department of Treasury﻿ manages unclaimed money in WA and has a simple online tool to help individuals find lost funds they may be entitled to.\n\nSearch for unclaimed money in WA here .﻿\n\nNorthern Territory\n\nUnclaimed money is handled by the Territory Revenue Office (TRO) , the Department of Treasury and Finance and the Public Trustee﻿ in the NT.\n\nLearn more about how to claim unclaimed money in WA here .﻿\n\nTasmania﻿\n\nThe Department of Treasury and Finance in Tasmania keeps track of the state's unclaimed money and provides information on how to claim on its website.\n\nLearn more about how to claim unclaimed money in Tasmania here .﻿",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/national/woman-dead-in-port-macquarie-information-sought/5f80f75d-5c7e-4e63-81e6-f4882ecca45e",
    "title": "Info sought after Port Macquarie woman dies with multiple injuries",
    "publish_date": "Tue, 06 Jan 2026 01:18:27 +0000",
    "category": "sports",
    "authors": [
      "Jan"
    ],
    "text": ": Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/national/queensland-weather-forecast-flood-affected-areas-set-for-rain-fears-fresh-cyclone/8fb16cb1-9c5c-4ac6-8d45-aaaed6252357",
    "title": "Queensland set for monsoonal rain as fears fresh cyclone could develop",
    "publish_date": "Mon, 05 Jan 2026 21:54:10 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "This was the case for Cowley Bay, which had 1284mm of rain in seven days, whilst\n\nTownsville\n\ncopped 500mm in the week ending on Monday.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/national/northcote-mcdonalds-fast-food-giant-quietly-files-vcat-action-to-appeal-council-decision/dde8a91d-54df-49c1-91e6-4c196fdf9bed",
    "title": "Macca's fights back after council blocks new 24-hour joint on trendy street",
    "publish_date": "Tue, 06 Jan 2026 01:34:28 +0000",
    "category": "finance",
    "authors": [
      "Jan"
    ],
    "text": "M﻿cDonald's Australia has quietly launched proceedings in the Victorian Civil and Administrative Tribunal (VCAT) after a Melbourne council rejected its bid to build a 24-hour restaurant on a trendy inner-city street.\n\nResidents and businesses in Northcote fiercely opposed the﻿ plan to transform a fire-damaged and vacant building at 323 High Street into a McDonald's .\n\nDarebin councillors in November voted 6-3 in opposition to the planning motion, but the proposal has returned to the table as McDonald's ﻿makes a bid to challenge this decision in VCAT.\n\nMcDonald's has launched proceedings in VCAT to appeal a council decision to block a 24-hour restaurant in Northcote's High Street. (Getty)\n\nDocuments seen by nine.com.au reveal the fast food giant has made an﻿ application to review a refusal of a permit.\n\nMcDonald's said in the application that a restaurant would \"not result in unacceptable traffic flow\" nor would it \"detrimentally impact on the presentation of the building\".\n\nIn a statement to nine.com.au, a McDonald's Australia spokesperson said the Northcote location had \"potential\".\n\n﻿\"We see strong potential in Northcote and initiated proceedings to ensure the application is fairly assessed on its merits,\" the spokesperson said.\n\n\"The Northcote site is appropriately zoned for commercial use, and our application meets all planning requirements.\n\n\"The proposed restaurant represents an investment of more than $2 million and will mean more than 100 new local jobs, as well as more support for local community groups in the area.\n\n\"We've been part of Melbourne communities since 1973, employing thousands of people, serving up a locally sourced menu and providing convenient destinations for customers looking for great everyday value and those iconic Macca's moments.\"\n\nIn its initial planning application, McDonald's said converting the site to a restaurant would create more than 100 local jobs and help the Northcote community.\n\nThere will be a compulsory conference on January 14 and it is listed for a hearing on﻿ April 14.\n\nNorthcote resident Salar Tavakoli told nine.com.au he filed a statement of grounds slightly too late but still planned to object the appeal bid.﻿\n\nHe was among 110 people who lodged a formal objection before the council vote.﻿\n\nA view of High Street in Northcote, in Melbourne's inner-north. (Nine)\n\nA petition against the proposal also garnered more than 11,000 signatures.\n\n\"High Street is special because of the hardworking local businesses that built its unique vibe and global reputation. Dropping a massive McDonald's into that ecosystem does not fit,\" Tavakoli said.\n\n\"It is a single lane street shared with trams, already congested, and adding delivery traffic will make it unsafe for cyclists and pedestrians.\n\n\"Parking is scarce, especially for people with disabilities. McDonald's is hiding behind an old permit never intended for a 24/7 outlet like this. It would be the only shop open all night, inviting anti-social behavior.\"\n\nTavakoli said he was disappointed the VCAT appeal was lodged over the holiday break.\n\nHe worries the timing may have resulted in missed opportunities for the community to push back.\n\nDarebin Council said it was party to the appeal.\n\n\"The applicant and objectors were notified in writing. The applicant has appealed the decision at VCAT and council is party to the appeal,\" the council said.\n\n\"A VCAT Compulsory Conference is scheduled for January 2026 and the hearing date is scheduled for 14–17 April 2026.\"",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-06/bluescope-13-billion-takeover-bid-by-stokes-sgh-us-steelmaker/106202730",
    "title": "BlueScope shares rocket higher on $13 billion Stokes bid",
    "publish_date": "Tue, 06 Jan 2026 01:39:10 +0000",
    "category": "finance",
    "authors": [],
    "text": "Shares in Australia's biggest steelmaker, BlueScope, rocketed on Tuesday after the Kerry Stokes-controlled SGH launched a $13.2 billion takeover bid for the company.\n\nBy 11:45am AEDT on Tuesday morning, BlueScope shares were up more than 20 per cent to $29.51 — just shy of the offer price of $30 a share.\n\nIf the takeover is successful, SGH (formerly Seven Group Holdings) plans to offload BlueScope's North American businesses, which make flat rolled and coated steel products, to its partner in the bid, US company Steel Dynamics.\n\nIt is the third time in two years that Steel Dynamics, which is the US's fourth-largest steel producer, has tried to take control of BlueScope's North American operations.\n\nThe $30 offer price is the most generous yet and values BlueScope shares at well over target prices of between $24 and $26 set by a majority of analysts, Bloomberg data shows.\n\nIn a statement released to the stock exchange late on Monday, SGH chief executive Ryan Stokes said BlueScope's Australian business \"is a strong strategic fit\" for his company, which owns a portfolio of businesses, including the country's biggest construction materials supplier, Boral.\n\nSGH also owns Caterpillar dealer Westrac, industrial hire group Coates, 30 per cent of oil and gas company Beach Energy and 40 per cent of struggling media company Seven West, which is in the process of merging with radio group Southern Cross Austereo.\n\n\"We have a proven track record of driving performance improvement in domestic industrial businesses,\" Mr Stokes said.\n\n\"We intend to leverage our disciplined operating model and capital allocation approach to deliver better outcomes for stakeholders.\"\n\nRyan Stokes is the chief executive of SGH and Kerry Stokes is the major shareholder. (AAP: Mick Tsikas)\n\nBlueScope said its board and management were considering the offer.\n\nThe company said it rejected the three previous bids involving Steel Dynamics because they \"significantly undervalued BlueScope and its future prospects, and presented significant execution risk in relation to regulatory outcomes\".\n\nIt said that in late 2024, a consortium led by Steel Dynamics made two offers to buy BlueScope for cash, offering $27.50 before increasing the price to $29 a share.\n\nBlueScope said that in early 2025, Steel Dynamics returned with a third, more complex, offer in which it would take control of the North American assets and distribute everything else back to existing BlueScope shareholders.\n\nThis offer valued the company at $31 a share — $24 for the North American assets and $9 for the rest, BlueScope said.\n\nBlueScope said the current offer was subject to conditions, including due diligence and regulatory approval, and also depended on the consortium being able to borrow money to fund the deal.\n\nSGH shares also rallied on the news, up about 4.9 per cent. Kerry Stokes is the major shareholder in SGH.",
    "source": "ABC",
    "cluster_id": 4
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-06/three-nfl-teams-sack-coaches-browns-raiders-cardinals/106202876",
    "title": "Three coaches sacked on NFL's traditional Black Monday",
    "publish_date": "Tue, 06 Jan 2026 01:23:32 +0000",
    "category": "sports",
    "authors": [],
    "text": "For struggling NFL teams, the end of the regular season triggers an annual exercise in bloodletting known around the league as Black Monday.\n\nThis year proved no exception.\n\nAfter failing to make the 14-team play-off series that will culminate with next month's Super Bowl, the Cleveland Browns, Las Vegas Raiders and Arizona Cardinals showed their coaches the door on Monday, local time.\n\nThe Browns parted ways with Kevin Stefanski after six seasons, one day after the team put the finishing touches on a 5-12 win-loss campaign that left them in last place in the AFC North division for a second consecutive year.\n\nStefanski led Cleveland to two play-off appearances and became only the second coach in team history to record multiple seasons with at least 11 regular-season wins.\n\nHe was also named NFL Coach of the Year twice.\n\n\"We appreciate all his (Stefanski) hard work and dedication to our organisation,\" Browns managing and principal partners Dee and Jimmy Haslam said in a statement.\n\n\"But our results over the last two seasons have not been satisfactory and we believe a change at the head coaching position is necessary.\"\n\nThe Raiders sacked Pete Carroll after he went 3-14 in his first season with the team, which was tied for the worst mark in the league with the Cardinals, New York Jets and Tennessee Titans.\n\nCarroll, who won a Super Bowl as head coach of the Seattle Seahawks in 2014, had signed a three-year deal with the Raiders last January.\n\nRaiders owner Mark Davis said general manager John Spytek and minority owner Tom Brady would be in charge of identifying the team's next coach.\n\nThe Cardinals moved on from Jonathan Gannon after three losing seasons and one day after their dreadful 3-14 campaign ended with a nine-match losing streak.\n\nGannon went 15-36 during his tenure and the team missed the play-offs each year.\n\nA day before the Browns, Raiders and Cardinals sacked their coaches, the Atlanta Falcons got the ball rolling.\n\nThe Falcons parted ways with head coach Raheem Morris and general manager Terry Fontenot after the team extended its play-off drought to eight seasons.\n\nThe head coaches of the Tennessee Titans and New York Giants, Brian Callahan and Brian Daboll, respectively, were both fired during the season.\n\nReuters",
    "source": "ABC",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-06/paringa-bridge-future-uncertain-river-murray/106197800",
    "title": "Historic Murray River bridge future uncertain as it nears its centenary",
    "publish_date": "Tue, 06 Jan 2026 00:58:51 +0000",
    "category": "finance",
    "authors": [],
    "text": "Concern for the future of river and road traffic is mounting along a stretch of the Murray River as a historic bridge undergoes its second round of repairs within an 18-month period.\n\nThe 99-year-old Paringa Bridge is located in South Australia's Riverland and forms part of the Sturt Highway, which connects travellers from Adelaide to Sydney.\n\nThe bridge was built in 1927 and was considered an engineering marvel at the time, as it was designed to rise in the middle to allow paddle-steamers and other large river vessels to pass underneath.\n\nThis function largely continued until December 27, 2025, when the lift stopped, coinciding with the region's peak summer tourist season.\n\nThe South Australian Department for Infrastructure (DIT) said a faulty gearbox output shaft was to blame for the issue, and it would be conducting a full structural assessment on the entire bridge on Tuesday.\n\nIt is the only vertical-lift bridge in South Australia. (ABC Riverland: Amelia Walters)\n\nHouseboat operator Rob Hughes said it meant some families, who booked multiple boats 12 months in advance, were separated for the Christmas and New Year period.\n\n\"We have boats on either side of the bridge, so we are not quite sure how to handle [those bookings],\" he said.\n\nHouseboats located next to Lock 5 are unable to travel to Renmark due to the malfunction. (ABC Riverland: Amelia Walters)\n\n\"It's our busiest time of the year, and we do more than 40 per cent of our yearly turnover just in December and January.\n\n\"It's the equivalent of our harvest for the year.\"\n\nMr Hughes said while he understands things can break or malfunction, he was in the same predicament in July 2024.\n\nRob Hughes said three local houseboat operators have been impacted by the malfunction. (ABC News: Will Hunter)\n\n\"[The bridge] was out for three weeks; now, 18 months later, in the busiest week of the year, it's happened again, and there's still nothing in place to resolve it when things break,\" he said.\n\n\" I would like to ask the department if it was the other way around and the bridge was stuck up [blocking road users], would it take three weeks? \"\n\nWhen operating, the bridge vertically lifts twice a day to allow bigger vessels to travel through. (ABC Riverland: Amelia Walters)\n\n'At the end of its life'\n\nRenmark Paringa Community Museum is located next to the bridge, and its chair, Wayne Howell, estimated more than 1,000 heavy vehicles use the bridge each day.\n\nHe said a new bridge was inevitable.\n\n\"In my 25 years of living locally, we've gone from single semis [truck and trailers] to doubles to triples, so the actual volume of traffic in weight is a lot more, \" he said.\n\nWayne Howell says he is not opposed to a new bridge site to be located where the museum currently stands. (ABC Riverland: Amelia Walters)\n\n\" I believe the bridge is getting to the end of its life, and it should be looked at now, rather than waiting until the thing falls apart. \"\n\nMr Howell believed a new bridge built next to the existing structure would keep the historical value of the Paringa Bridge alive and the economy of the local townships too.\n\nWayne Howell says if the current bridge lift was removed and a new structure was built, houseboat travel would be guaranteed. (ABC Riverland: Amelia Walters)\n\nMember for Barker Tony Pasin proposed a new structure be built at Spring Cart Gully, near the town of Lyrup, in 2019, to provide an alternate river crossing.\n\nSix years later, Mr Pasin still backs the idea and said \"bold thinking and decision making\" is needed by policymakers.\n\n\"It was blue sky thinking in 2019, and it is still now, but I think it's something that would be significantly productive for the whole nation,\" he said.\n\nTony Pasin says a bridge at Spring Cart Gully would deliver a \"significant productivity benefit\" to the road network. (ABC South East SA: Eugene Boisvert)\n\n\"The Paringa Bridge has served us well, but it's the tightest bottleneck on the Sturt Highway … and it's the only stretch of road where motorists have to travel 30 kilometres an hour.\n\n\" This is something our nation will do at some point. I just hope it's in my lifetime. \"\n\nCounting current and future costs\n\nDIT chief executive Jon Whelan said in the past four years, it had spent about $700,000 on repairs.\n\nHe estimated the current gearbox issue would cost more than $80,000 to fix.\n\nJon Whelan says traffic restrictions will be in place when the gearbox is reinstalled. (ABC Riverland: Amelia Walters)\n\n\"I've sent our structural engineers out there today to inspect [the bridge] … and have asked for a thorough, detailed assessment,\" he said.\n\n\"We want to continue to keep this operating into the future as we know how important it is to the Riverland and to houseboat operators.\"\n\nMr Whelan said the repaired gearbox is set to be reinstalled on Saturday, depending on weather conditions.",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-06/edge-early-learning-plympton-childcare-centre-reopens-mp-says/106202142",
    "title": "SA childcare centre shut over supervision concern allowed to reopen",
    "publish_date": "Tue, 06 Jan 2026 00:29:24 +0000",
    "category": "finance",
    "authors": [],
    "text": "An Adelaide childcare centre forced to close following an investigation into concerns relating to the inadequate supervision of children has now been allowed to reopen, the state education minister says.\n\nEdge Early Learning in Plympton was ordered to shut for 90 days in October after the Education Standards Board (ESB) investigated the site.\n\nThat shutdown came after the centre had already been told to close for a fortnight following claims children were left unsupervised.\n\nEducation Minister Blair Boyer said the Plympton centre had been allowed to reopen on Monday by the ESB \"under some pretty strict conditions\".\n\n\"One of them is a smaller number of enrolments,\" he said.\n\n\"That means the ratio, in terms of the number of staff to children, is higher.\n\n\"I am 100 per cent confident knowing the people in the ESB like I do that they would not be allowing Edge Early Learning to reopen unless they were completely satisfied that they had changed their practices and it was appropriate to do so.\"\n\nEducation Minister Blair Boyer said the centre was without enrolments, but had been allowed to reopen on Monday. (ABC News: Justin Hewitson)\n\nMr Boyer said the centre did not currently have any enrolments but was reopened to allow \"parents and families to come and have a look\".\n\nIn October, ESB chief executive Benn Gramola said the board considered the Plympton centre \"unsuitable to open\", citing \"a number of incidences relating to inadequate supervision\".\n\nWhile he would not comment on the number of supervision incidents, nor the investigation, he said that if the required improvements were not made within 90 days, the board could either extend the closure or permanently close the centre.\n\nBut he said Edge Early Learning would \"have the opportunity to rectify any concerns\" during the Plympton centre's closure and had been \"proactive\" in working with the board.\n\nState government MP Jayne Stinson says monitoring of the site will continue. (ABC News: Carl Saville)\n\nSpeaking to ABC Radio Adelaide this morning, local MP Jayne Stinson, whose electorate includes the Plympton centre, said conditions of reopening included a cap \"of 25 children at the centre to start with\".\n\n\"There were some issues around supervision — that children had been left for very brief periods of time, but obviously should not be left alone whatsoever or not with people who are not fully qualified,\" she said.\n\n\"There were red flags being raised but I know that they've taken it very seriously. Obviously, there'll be monitoring of the centre.\"",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-06/koolewong-cat-sassy-injured-in-nsw-bushfires-on-road-to-recovery/106202244",
    "title": "Good news for cat burnt in bushfire after $50K spent on vet care",
    "publish_date": "Tue, 06 Jan 2026 00:08:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "After dozens of skin grafts and upwards of $50,000 in specialist veterinary care, a beloved cat injured in bushfires that razed homes along New South Wales's Central Coast is on the road to recovery.\n\nSiew Lee Seow had been living in her dream home in Koolewong for three years with her cats Sassy, Bodhi and Pixie when the property was gutted in last month's blaze.\n\nMs Seow had been in Sydney for a medical appointment at the time, leaving the cats inside with the air conditioning on to keep them cool.\n\nSiew Lee Seow's much-loved cat Sassy was lucky to survive. (Supplied)\n\nShe said it took less than 15 minutes for her house to be destroyed in the blaze.\n\n\"I had a plan for when I was there to evacuate the cats. I didn't necessarily have a plan when I'm not there,\" she said.\n\nWhen she was allowed to return home, she found a critically injured Sassy sheltering under a neighbouring property.\n\nSassy was found sheltering under a neighbouring property after the fire. (Supplied)\n\nShe had been badly burnt and was suffering from smoke inhalation when she arrived at the emergency veterinary hospital in Gosford.\n\nThere, specialists amputated her tail and inserted a feeding tube while her condition stabilised.\n\nThe home was one of a number destroyed in the blaze along NSW's Central Coast. (ABC News: Liam Patrick)\n\nMs Seow was told to prepare for the worst, but she said she felt compelled to give Sassy a fighting chance.\n\n\"She fought for herself to get out, and the least we can do is to fight for her now,\" she said.\n\n\"She's been through quite a lot and in her resilience, I'm finding strength as well.\"\n\n'Touch and go'\n\nSassy was then moved to Sydney's Animal Referral Hospital in Homebush, where she underwent the amputation of some toes and the removal of the tips of her ears.\n\nSpecialist animal surgeon Sarah Goldsmid said the two-year-old cat arrived in rough shape and it was unknown whether she would survive.\n\nMs Seow and Sassy the cat pictured before the fire which destroyed their home. (Supplied: Siew Lee Seow)\n\n\"For the first couple of weeks, it was really touch and go,\" she said.\n\n\"We had to one by one remove her toes, as they were killed off by the burns.\"\n\nDr Goldsmid worked hard to restore cat Sassy to health. (Supplied)\n\nDr Goldsmid last week began the painstaking process of reconstructing Sassy's feet using grafts from the cat's healthy skin.\n\n\"It took quite a while to do it, but we managed to reconstruct skin over all her remaining feet,\" she said.\n\n\"She's going to have pretty hairy feet, it's going to be like hobbit feet … and she won't have any pads.\n\n\" The aim is to get her back to freely moving around and comfortable on her feet and able to still enjoy life. \"\n\nCost of care crowdfunded\n\nThe treatment was heavily discounted but the cost of care totalled upwards of $50,000, much of which was covered by crowdfunding.\n\nSassy's treatment cost more than $50,000. (Supplied)\n\nDr Goldsmid said quality of life concerns have been key in navigating Sassy's treatment.\n\n\"If we, at any point, thought it wasn't right for her, for her quality of life or the amount of pain she was in, that sort of thing, we would've called it then,\" she said.\n\n\"She is the happiest cat, despite all of this. She is so smoochy, she will roll over for a tummy tickle.\n\nMs Seow says she is inspired by Sassy's resilience. (Supplied: Siew Lee Seow)\n\n\"It's a huge deal, a huge, huge expense and a huge lot of effort to go through for her, but gosh, she's worth it.\n\n\" I think she's been through probably eight of her nine lives … she really did push the limits of survival. \"\n\nMs Seow said she had been overwhelmed by the generosity of donors.\n\n\"It blew my mind ... Most of these people never met me,\" she said.\n\nLong road to recovery\n\nSassy is due to be discharged from the veterinary hospital on Tuesday, but she and Ms Seow have a long way to go to rebuild their lives.\n\nMs Seow has no family in Australia and the fate of her other two cats remains a mystery.\n\nShe has been couchsurfing with friends for the past four weeks, and will be moving into more stable accommodation at the end of the month.\n\nMs Seow said it would take years to rebuild her home. (ABC News: Liam Patrick)\n\nAfter returning to the pile of rubble that was once her home, Ms Seow said she felt compelled to rebuild at the same location.\n\n\"I am going to start meeting with some builders and specialists to provide advice and understand how [rebuild] better to today's fire-rating code,\" she said.\n\n\"I've seen it as a marathon. It's going to be a two-year work, from rebuilding my life to rebuilding the home.\n\n\"I'm slowly recovering important facets of my life.\"",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-06/nrl-keaon-koloamatangi-signs-with-dragons-from-rabbitohs/106202500",
    "title": "Dragons sign star Rabbitohs forward on massive five-year deal",
    "publish_date": "Mon, 05 Jan 2026 23:47:20 +0000",
    "category": "sports",
    "authors": [],
    "text": "Keaon Koloamatangi has declared he wants to be a driving force in St George Illawarra's next era after being unveiled as the Dragons' best signing in years.\n\nDragons officials confirmed on Tuesday that Koloamatangi would join the club on a five-year deal from South Sydney in 2027, keeping him at the Red V until 2031.\n\nIn announcing Koloamatangi's recruitment, the Dragons described it as \"one of the biggest signings in the club's recent history\".\n\nThe move will give St George Illawarra some much-needed power up front, with the deal believed to be in the vicinity of $5 million across the five years.\n\nSt George Illawarra has unearthed a host of good, young forwards in the past two years, including the likes of Dylan Egan, Hamish Stewart and the Couchman twins, Ryan and Toby.\n\nBut the Dragons will have a genuine star in their pack when Koloamatangi joins the club.\n\nThe 27-year-old has played State of Origin for NSW and 14 Tests for Australia and Tonga.\n\nEels sign potential replacement for Lomax Parramatta makes a move in the player market as it looks to lifts its fortunes.\n\n\"I've been watching the [Dragons] squad they're building and the young forwards coming through, and I want to be part of driving that next era,\" Koloamatangi said in a Dragons statement.\n\nKoloamatangi is understood to have attracted interest from several parties, with top-tier forwards at a premium in the current market.\n\nAfter playing most of his career in the second row, Koloamatangi was one of the NRL's best front rowers last season after moving into the middle at the Rabbitohs.\n\nKoloamatangi's 2025 form was rewarded with a call-up for the Kangaroos' tour of England.\n\n\"This is a transformative moment for our club and our future,\" Dragons chief executive Tim Watsford said.\n\n\"Keaon is one of the premier forwards in the NRL and a proven leader. He's someone who drives standards every single day.\n\n\"He had significant interest elsewhere, so the fact that he chose to join the Dragons — and commit for five years — tells you everything about where we are heading.\n\n\"We have a group of exceptional young forwards coming through our system, and bringing in a leader of Keaon's calibre to guide and inspire them is critical for us.\"\n\nAAP",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-06/scenic-rim-farmer-considers-selling-up-due-to-camping-red-tape/106138010",
    "title": "Farmer considers selling up because of red tape on hosting campers",
    "publish_date": "Mon, 05 Jan 2026 23:04:28 +0000",
    "category": "finance",
    "authors": [],
    "text": "Scenic Rim farmer Robert Roberts says he has been running a side hustle to keep his cattle property afloat.\n\nHe said he had listed his 200-hectare Sarabah property on Hipcamp, an online booking platform, to earn extra income.\n\nThe 54-year-old said he set up about six campsites along a creek that runs through the Gold Coast hinterland property and charged travellers about $30 a night in 2020.\n\nThat was until the council stepped in last year and told him and his neighbours he needed a development permit or would have to shut the operation down.\n\nHigh cost\n\nOne of six campsites on the property. (Supplied: Hipcamp)\n\nMr Roberts said he was now considering selling his property because of what he said was a costly permit process.\n\nThat is because his farm is in a bushfire, flood and environmental area, which means he would need multiple expensive reports.\n\n\"They're saying that it's unsafe for anyone unless we pay a specialised person to come and do a report on each one of those overlays which could cost tens of thousands of dollars for each report,\" Mr Roberts said.\n\nIn addition to the reports, he said he would also need to make development applications to change the use of his land.\n\nThe creek makes it an idyllic location for campers. (Supplied: Hipcamp)\n\nMr Roberts said the whole process could cost more than $100,000 and it would not guarantee that he would get a permit.\n\n\"You just don't get the return. No businessperson would ever look at that as being a viable option,\" he said.\n\nHe said the loss of the camping revenue meant it would be unsustainable to manage the land and now he was looking to sell the farm that has belonged to his family for more than half a century.\n\n\"It would take me five years to 10 years to pay all of the council fees and all the extra costs associated with reports and everything to pay it all back — and it's not worth it.\n\n\"If we can't run small businesses on our own land to sustain the farm. What do you do then? You can't make money out of nothing.\"\n\nRobert Roberts says his family has owned the property since 1971. (ABC Gold Coast: Danielle Mahe)\n\nChange on the horizon\n\nThe Queensland government has since released new planning guidance to help bring in new laws to allow private camping on properties.\n\nThe government said it wanted to boost agritourism ventures and farm-based enterprises, like Mr Roberts's small camping business, across the state.\n\nMr Roberts's local council, the Scenic Rim Regional Council, said it was now reviewing its local planning laws.\n\nA spokesperson said the council wanted to find a solution for camping operators while also balancing safety and environmental concerns.\n\nGetting a permit to host campers is costly. (Supplied: Hipcamp)\n\nBut in the meantime they said property owners would still need to apply for a permit, regardless of the review.\n\n\"It is important to be aware that the regulations around the ability of landowners to host campers on their properties have not changed and will remain in the short-term,\" the spokesperson said.\n\nMr Roberts said he welcomed the state government's position.\n\nHowever, Bond University associate law professor Tammy Johnson said farmers in the region would likely have to wait for years before any proposed amendments became law.\n\n\"If council decide to proceed, then you've got to get it into the legislative process to get the amendments done through parliament and it's just time consuming,\" Ms Johnson said.\n\nTammy Johnson says illegal camp operators risk hefty fines. (ABC Gold Coast: Glenn Mullane)\n\nShe said farmers who continued to operate illegally could be fined up to $33,000 or sued if someone was injured while on their property.\n\n\"They're putting themselves in a really precarious legal and financial position,\" Ms Johnson said.\n\n\"My words of advice to any of the property owners would be, how much is it really worth to you to be able to let these people come in and camp for a few dollars a night versus what the potential costs are?\"\n\nQueensland Deputy Premier Jarrod Bleijie said in a statement the government would undergo community consultation with any proposed changes.\n\nHipcamp spokesperson Mitch Coveney said the Scenic Rim was one of the most popular destinations for bookings in Australia, attracting tens of thousands of visitors to the region each year.\n\nHe said the camping experiences could be important for farmers seeking to diversify income and also to boost the regional economy.\n\n\"With its natural beauty and proximity to major population centres, the region is well-placed to benefit from growing demand in low-impact camping on farming and rural land,\" he said.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-06/plans-pushed-back-for-desalination-site-the-lower-great-southern/106189738",
    "title": "Desalination site decision in WA's south delayed as community reacts",
    "publish_date": "Mon, 05 Jan 2026 22:32:29 +0000",
    "category": "finance",
    "authors": [],
    "text": "The Water Corporation's plans for a desalination plant near Albany in Western Australia have been pushed back after initial claims that a final location would be announced by the end of 2025.\n\nThe state-owned utility is battling the clock to establish a new drinking water source for the Lower Great Southern by 2030, when it is estimated demand will exceed supply.\n\nAlbany, Mount Barker, Kendenup, Denmark and nearby areas are supplied by the Lower Great Southern Towns Water Supply Scheme.\n\nChanging rainfall patterns and a growing population prompted the Water Corporation to begin investigating seawater desalination several years ago.\n\nBut securing a location for the plant has not been straightforward, with multiple sites drawing ire from local communities.\n\nKing George Sound was scrapped as a proposed location for a desalination plant. (Supplied: Brad Harkup)\n\nThe sound ruled out\n\nIn 2024, a proposal for a desalination plant with an outlet into King George Sound at Frenchman Bay generated pushback from commercial fishers, aquaculturalists, and tourism operators.\n\nThey said the environmental and industry values of the sound would be at risk if the highly saline brine by-product was released into its waters, and Premier Roger Cook ruled out the sound as a location in January 2025.\n\nSandpatch was one of several locations under consideration. (ABC News: Benjamin Gubana)\n\nIn July last year, the Water Corporation announced it was investigating Nanarup and Sandpatch as alternative locations — a suggestion that has received backlash from both communities.\n\nCommunity pushback\n\nAn e-petition to remove Nanarup from the shortlist has garnered more than 700 signatures, highlighting the area's environmental and cultural significance to the community.\n\nNanarup beach is a much-loved surfing, fishing and family recreation spot. (ABC News: Asha Couch)\n\nAlbany Coastal Waters Working Group's Robert Ernst said additional locations should be considered.\n\n\"When they diverted from Frenchman Bay on the back of the government's decision not to go into that area, they selected two sites,\" he said.\n\n\"They didn't go back to the drawing board and look at all the other sites … what we're asking for is, why are you not thinking about these other areas?\"\n\nThe Water Corporation said it considered around eight sites, taking into account environmental and community impact, before Nanarup and Sandpatch were selected for additional modelling and technical studies.\n\nNanarup Beach is about 30 kilometres east of Albany. (ABC News: Asha Couch)\n\nUniversity of Sydney School of Civil Engineering head professor Stuart Khan said the dispersal of wastewater back into the ocean was a key concern for the community.\n\n\"You've got the same amount of salt in half the volume of water going back out, so it's twice as concentrated as seawater,\" he said.\n\n\"There are implications of that, and one is that it's going to be a lot denser than seawater.\n\n\"If we don't disperse it properly, it will sink to the bottom and it will cause a stratified layer on the bottom of the water body, which won't mix with water further up, and that can cause problems around deoxygenation.\"\n\nWater to survive\n\nWater Corporation Great Southern regional manager Adrian Stewart said it was imperative for the project to progress, with drinking water sources in the area already under pressure.\n\nAdrian Stewart says the community needs a new drinking water source to survive. (Supplied)\n\n\"This community simply will not be able to survive if we do not have a new drinking water source established,\" he said.\n\n\"We have a source that's already constrained — in order for Albany to continue to grow, we have to actually have access to new, fresh drinking water to supply our community.\n\n\"It won't matter where you choose, there will be a sector of the community that will say they don't want it there.\"\n\nThe Water Corporation initially planned to finalise a site by the end of 2025, but said the work required to make the decision would continue in the first quarter of 2026.",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-06/ashes-live-scg-test-day-three-australia-england/106202206",
    "title": "Live: Head passes 150 as England toils in horror first session on day three",
    "publish_date": "Mon, 05 Jan 2026 22:24:04 +0000",
    "category": "sports",
    "authors": [
      "Jon Healy",
      "Henry Hanson"
    ],
    "text": "Matthew Potts is back and he starts short and down leg again. Look, Travis Head has shown he can get out in bizarre ways, but Potts needs to get these bouncers at his body.\n\nWhoa. Head stays leg side of the ball rather than stepping into the line of the stumps and Potts fires a short one at his head. He stumbles backwards as he gets out of the way.\n\nFOUR! Head clips high and handsome over the leg side, albeit a little off the top edge, and it's just wide of a diving Harry Brook at deep backward square leg.\n\nThe photographers are in the firing line on the bounce and one of them's gone down like a sack of spuds. Looks like he's OK though as Jacob Bethell checks on him.\n\nThere's a normal response to a bouncer, just a regulation hook shot along the ground to deep fine leg for a single.\n\nPotts's first ball at Steve Smith is down leg.\n\nSmith spies a bit of pink on the sightscreen, with a spectator helpfully crawling across the seats to grab it. It's a \"6\" sign and the fan points to it, calling for Smith to do what it says, but he doesn't, instead defending the second ball behind point.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-06/australian-open-novak-djokovic-out-of-adelaide-international/106202328",
    "title": "Djokovic withdraws from Australian Open lead-up event in Adelaide",
    "publish_date": "Mon, 05 Jan 2026 22:12:54 +0000",
    "category": "sports",
    "authors": [],
    "text": "Novak Djokovic has withdrawn from next week's Adelaide International but remains focused on contesting the Australian Open.\n\nDjokovic, ranked number four in the world, wrote on Instagram he did not feel prepared to return to competition in Adelaide ahead of the year's first major.\n\nDjokovic quits players body he co-founded Novak Djokovic is stepping away from the Professional Tennis Players Association citing concerns over transparency and governance within the organisation.\n\n\"To all my fans in Adelaide, unfortunately I'm not quite physically ready to compete in the Adelaide International next week,\" the former world number one wrote.\n\n\"It's personally very disappointing to me, as I have such great memories of winning the title there [in 2023].\n\n\"I was really excited about returning as it truly felt like playing at home.\n\n\"My focus is now on my preparation for the Australian Open and I look forward to arriving in Melbourne soon and seeing all the tennis fans in Australia.\"\n\nABC Sport will have live coverage of the Australian Open from January 18.\n\nDjokovic, 38, has not played an official match in nearly two months.\n\nHe defeated Lorenzo Musetti in the Hellenic Championship final in Athens on November 8 and later pulled out of the ATP Finals for the second year in a row, citing a shoulder injury.\n\nDjokovic has won 10 Australian Opens among his record 24 major singles championships.\n\nHe reached the semifinals in his past two visits to Melbourne Park.\n\nThe Australian Open main draw begins on January 18.\n\nAP",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-06/council-criticised-for-removing-illegal-trees-from-dunes/106174826",
    "title": "Rebel tree planters' work removed after beachfront poisonings",
    "publish_date": "Mon, 05 Jan 2026 22:03:02 +0000",
    "category": "finance",
    "authors": [],
    "text": "Not too long after dozens of trees were poisoned in front of homes on a central Queensland beach, saplings of native plants mysteriously appeared.\n\nBut a council has decided to remove the work of rebel planters with concerns the illegal trees could also be doing harm to fragile sand dunes.\n\nAround 20 young trees on Shelly's Beach at Emu Park, east of Rockhampton, have recently been pulled out by Livingstone Shire Council amid a long-running vegetation battle.\n\nLivingstone Shire Council is calling on the community to respect the foreshore dune area at Emu Park. (Supplied: Livingstone Shire Council)\n\nDozens of native trees including mature casuarinas have been poisoned or damaged along the foreshore over the past year and nobody has been found responsible.\n\nAuthorities have not found those responsible for the rogue plantings either.\n\nDozens of trees have been poisoned or damaged along the beachfront over the past year. (Supplied: Cr Rhodes Watson)\n\nCouncil criticised\n\nBut councillor Rhodes Watson said he suspected the saplings uprooted by officers last month were clandestinely planted by community members to replace the trees potentially poisoned to enhance ocean views of nearby properties.\n\n\"I think they are replacing the ones that have been poisoned,\" Cr Watson said.\n\n\"Obviously, some people do own their views and it's just not right … you have one rule for everyone.\"\n\nRhodes Watson has criticised the local government's response to the vegetation issue. (Supplied: Livingstone Shire Council)\n\nHe said he disagreed with council's response to the issue which has flared on occasion over decades.\n\n\"It sends a message to the community that anyone can go and pull out trees that they want now, because council's done it so everyone else can do it,\" Cr Watson said.\n\nHe said vegetation can help stabilise coastlines and combat erosion.\n\n\"That's what upsets me because all of the work that's been done previously to protect the dunes can effectively be undone by that one move.\"\n\nCr Watson says native vegetation can help stabilise coastlines and combat erosion. (Supplied: Livingstone Shire Council)\n\nDarumbal elder Aunty Sally Vea Vea said it was disturbing to hear that anyone would remove native trees and labelled the council's response 'ridiculous'.\n\n\"Why would you want to remove native trees that volunteers are putting in to keep the dunes together?\" Aunty Sally said.\n\n\"We teach all the children to plant trees and yet when volunteers come and plant trees on the foreshore, council comes along in what they consider to be their wisdom and remove them.\"\n\nDarumbal elder Aunty Sally Vea Vea says it is disturbing that anyone would remove native trees from dunes. (ABC News: Jasmine Hines)\n\n'Zero tolerance'\n\nCouncil installed temporary signage for a few months last year warning vandals of penalties for destroying vegetation.\n\nLivingstone Shire Mayor Adam Belot defended the decision to remove the saplings and said the organisation had zero tolerance for any unauthorised activity in the sensitive area.\n\n\"People going in there illegally and clearing vegetation will be shut down by council … it won't be tolerated,\" he said.\n\n\"And nor will people going into the dunal area and carrying out illegal plantings as well.\n\n\"Council must authorise what goes on in there, not members of the public thinking that they have the responsibility to do it.\"\n\nDeputy Mayor Pat Eastwood and Mayor Adam Belot inspected damage to native trees at Emu Park in July 2025. (Supplied: Livingstone Shire Council)\n\nCr Belot said weeds or other contaminants could be introduced in the soil of the plants.\n\n\"[This is] absolutely not council pandering to residents that want to see a view,\" he said.\n\n\"It's more than just the concern of getting authorised, it's also what can be introduced which can be very negative to that natural environment as well.\n\n\"Weed infestation can come through with the introduction of species which haven't been scrutinised or vetted by council.\"\n\nCapricorn Conservation Council coordinator Sophie George said she understood why the trees were removed by council.\n\nBut she said it was unfortunate because trees were needed in the area.\n\n\"With that particular coastal ecosystem, that is really providing quite a bit of stability and the trees are needed to maintain that ecosystem,\" she said.",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2026-01-06/united-cup-us-coco-gauff-taylor-fritz/106202112",
    "title": "Gauff goes from cold to hot as US makes United Cup quarterfinals",
    "publish_date": "Mon, 05 Jan 2026 20:34:05 +0000",
    "category": "sports",
    "authors": [],
    "text": "The US has secured a United Cup quarterfinal berth after Coco Gauff made up for a shock singles loss by helping win the deciding mixed doubles rubber against Spain.\n\nWorld number four Gauff recorded 54 unforced errors and served 14 double faults en route to a 6-1, 6-7 (3-7), 6-0 loss to Spain's Jéssica Bouzas Maneiro in Perth on Monday.\n\nTaylor Fritz came to the rescue for the US in the men's singles rubber, producing an epic 7-6 (7/4), 3-6, 7-6 (8/6) triumph over world number 38 Jaume Munar in a match lasting three hours and 13 minutes.\n\nIn a titanic battle, Fritz blew two match points on Munar's serve while leading 6-5 in the third set.\n\nMunar had a match point in the tiebreak, but Fritz pulled out a huge serve to save himself, before holding his nerve down the stretch to seal the win.\n\nIt meant the tie would come down to the mixed doubles, and Gauff teamed up with Christian Harrison to produce a 7-6 (7/5) 6-0 victory over Yvonne Cavallé-Reimers and Íñigo Cervantes.\n\n\"I was happy to get back out there on court and get a point for my team today,\" Gauff said.\n\n\"Obviously [my singles loss] wasn't a great match for me.\n\n\"Once it was over, I just sat in the bathroom for a little bit. I had a lot of confidence in Taylor, so I was just trying to make sure that I was ready for the mixed.\n\n\"That's the beauty of this event, that you have other people who can pick you up on your off days.\"\n\nABC Sport will have live coverage of the Australian Open from January 18.\n\nFritz has been battling knee tendonitis since last year and has already conceded it will be an injury he will have to manage at the Australian Open.\n\n\"Injury-wise, today was really positive for me,\" Fritz said.\n\n\"I started feeling my knee towards the end of the first set. But in the past, when I've started feeling it, it gets worse and worse and worse from that point on.\n\n\"[Today] I felt like my pain level stayed kind of at that starting point, so I was able to continue playing the whole match and it never really became an issue.\"\n\nGreece also booked a quarterfinal slot with a 2-1 defeat of Great Britain in Perth on Monday.\n\nSwitzerland became the first team to secure its spot in the quarterfinals after posting a 2-1 win over Italy in Sydney on Sunday night.\n\nAAP",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.smh.com.au/culture/music/universal-music-parts-ways-with-singer-dean-lewis-just-months-after-misconduct-allegations-20260106-p5nryb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Universal Music parts ways with singer Dean Lewis just months after misconduct allegations",
    "publish_date": "Tue, 06 Jan 2026 13:05:06 +1100",
    "category": "entertainment",
    "authors": [
      "Nell Geraets"
    ],
    "text": "Universal Music Group has parted ways with Australian singer Dean Lewis, ending a decade-long partnership just months after the pop star became embroiled in misconduct allegations.\n\n“We can confirm that Dean Lewis is no longer signed to Universal Music Australia or any Universal Music Group label,” a Universal Music Australia (UMA) spokesperson told this masthead on Tuesday.\n\nDean Lewis is no longer signed to Universal Music Group after a decade-long partnership.\n\nNo reason was given as to why the partnership ended. While Lewis’ management did not immediately respond to this masthead’s request for comment, a spokesperson told Rolling Stone Australia that while there are no immediate plans to talk to other music labels, Lewis was looking forward to working as an independent artist and intended to release new music this year.\n\nThe decision to part ways comes about two months after several female fans from around the world alleged that the ARIA Award-winning musician upset or unsettled them through text messages or in-person interactions. They also shared phone recordings and screenshots of the text chains between themselves and the singer.",
    "source": "SMH",
    "cluster_id": 16
  },
  {
    "url": "https://www.smh.com.au/business/companies/wa-solar-project-reboot-puts-pilot-in-data-centre-power-race-20260106-p5ns0j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA solar project reboot puts Pilot in data-centre power race",
    "publish_date": "Tue, 06 Jan 2026 13:04:40 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Pilot Energy has taken another decisive step in its clean energy transition, striking a binding agreement with renewables partner SN Energy to jointly develop a hybrid solar and battery storage project at its Three Springs site in Western Australia.\n\nUnder a binding heads of agreement, the parties will co-develop a hybrid solar and battery energy storage system (BESS) at the solar development site, located just north of Perth. The project has also been designed to support a proposed 50-megawatt (MW) data centre, positioning the site as a future-ready clean energy hub.\n\nPilot Energy’s solar site at Three Springs in Western Australia.\n\nAs part of the deal, SN Energy will fund the acquisition of land near Three Springs that was originally earmarked for a state government-approved stand-alone solar project. Pilot will receive total consideration of $10.75 million in upfront and milestone payments for the land acquisition. The funds will also cover the costs associated with progressing grid connection works and lodging a new development application for the hybrid solar BESS and data centre project.\n\nThe hybrid strategy reflects a growing market demand for deliverable green energy solutions, particularly from energy-hungry data centres. Globally, data centres already consume an estimated 2–3 per cent of electricity output, with demand accelerating rapidly due to artificial intelligence and cloud computing. In some regions, data centre power usage is forecast to account for up to 15 per cent of national electricity demand.",
    "source": "SMH",
    "cluster_id": 17
  },
  {
    "url": "https://www.smh.com.au/business/markets/investors-pull-money-from-australia-on-rate-risks-weak-profits-20260106-p5nrwr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Investors pull money from Australia on rate risks, weak profits",
    "publish_date": "Tue, 06 Jan 2026 12:47:00 +1100",
    "category": "finance",
    "authors": [
      "Matthew Burgess",
      "Carmeli Argana"
    ],
    "text": "A pullback from Australian assets is accelerating as investors shift capital toward hot markets globally that promise returns far outpacing the muted prospects at home.\n\nMLC Asset Management and JPMorgan Asset Management are among those expecting stronger equity returns offshore, while T. Rowe Price is betting the Reserve Bank’s hawkish stance will flatten the yield curve for bonds.\n\nThe message for investors chasing upside in Australian assets is clear: look elsewhere. The benchmark S&P/ASX 200 Index lagged peers in 2025, while bond prices dropped as the central bank weighs pivoting back to tightening monetary policy.\n\nInternational investors are walking away from the Australian sharemarket. Credit: Louie Douvis\n\n“We’re under-allocated to Australia” shares as it’s hard to see them outperform in 2026, said Patrick Nicoll, head of asset allocation at MLC. “We’re also short duration in Australia, expecting [bond] yields to rise” as the RBA lifts rates again.",
    "source": "SMH",
    "cluster_id": 18
  },
  {
    "url": "https://www.smh.com.au/culture/celebrity/game-of-thrones-star-sophie-turner-s-marriage-blew-up-suddenly-then-it-got-nasty-20260106-p5nrxc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Game of Thrones star Sophie Turner’s marriage blew up suddenly. Then it got nasty",
    "publish_date": "Tue, 06 Jan 2026 12:46:26 +1100",
    "category": "entertainment",
    "authors": [
      "Bronte Gossling"
    ],
    "text": "Sophie Turner turns 30 next month, and for her birthday, she wants nothing more than “some peace”.\n\nThe British actress was 13 when she was cast in Game of Thrones, the juggernaut that would dominate global television for nearly a decade. But the scrutiny that followed her into adulthood intensified in September 2023, when her split from ex-husband Joe Jonas prompted wild and unfounded speculation on her fitness to parent their two children. The shame and guilt from that period, Turner has said in a new interview, still lingers.\n\nJoe Jonas and Sophie Turner split in September 2023 after four years of marriage. In the weeks that followed, Turner was plagued by accusations that she “likes to party” and Jonas “likes to stay home”, which she later disputed. Credit: Getty\n\n“It’s a total fishbowl. And people take so much as fact these days,” Turner said in a new cover interview for Net-A-Porter’s digital magazine Porter.\n\n“You feel like you’re gagged because silence is always the way to let something die out. But it means that you can’t stand up for yourself ever, so there’s a feeling of helplessness and shame.”",
    "source": "SMH",
    "cluster_id": 19
  },
  {
    "url": "https://www.smh.com.au/lifestyle/morgan-riddle-tries-her-hand-at-aussie-slang-20260106-p5ns02.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Morgan Riddle tries her hand at Aussie slang",
    "publish_date": "Tue, 06 Jan 2026 12:40:26 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Morgan Riddle tries her hand at Aussie slang\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 20
  },
  {
    "url": "https://www.smh.com.au/goodfood/melbourne-eating-out/beloved-mornington-ice-creamery-opens-second-outpost-in-black-rock-20260106-p5nryz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Beloved Mornington ice creamery opens second outpost in Black Rock",
    "publish_date": "Tue, 06 Jan 2026 12:25:31 +1100",
    "category": "finance",
    "authors": [
      "Haymun Win"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nOkay Lucy is scooping flavours like raspberry meringue just a short walk from Half Moon Bay.\n\n1 / 3 A scoop of raspberry meringue gelato at Okay Lucy in Black Rock. Eddie Jim 2 / 3 Mornington’s Okay Lucy has expanded to Black Rock. Eddie Jim 3 / 3 Okay Lucy Gelato - a boutique gelateria in Mornington. Supplied. Previous Slide Next Slide\n\nCafe$$$$\n\nBeloved by Mornington regulars since 2019, Okay Lucy has opened a second coastal store close to several popular Melbourne beaches. Red velvet, cookie dough and raspberry meringue are among the more nostalgic flavours. A dedicated pastry team elevates them by baking all elements from scratch.\n\nMust-try scoop: Specked with crushed espresso beans and swirled with house-made caramel, a salted piccolo will perk you up after a day at Sandringham Beach or Half Moon Bay.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "SMH",
    "cluster_id": 21
  },
  {
    "url": "https://www.smh.com.au/business/companies/locksley-adds-high-grade-silver-punch-to-us-critical-minerals-play-20260106-p5nrzs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Locksley adds high-grade silver punch to US critical minerals play",
    "publish_date": "Tue, 06 Jan 2026 12:22:15 +1100",
    "category": "finance",
    "authors": [
      "James Pearson"
    ],
    "text": "Locksley Resources has delivered another eye-catching result in California, uncovering a significant high-grade silver corridor at its Mojave project, adding a powerful new dimension to the company’s critical minerals story.\n\nThe company has identified a consistent northwest–southeast trending mineralised corridor stretching almost three kilometres across the North Block of its project after a detailed surface sampling campaign delivered high-grade silver hits and robust base metal credits.\n\nRock chips collected from a historic stockpile at Locksley Resources’ Mojave project in California returned 409 g/t silver, displaying gossanous textures indicative of weathered sulphides.\n\nManagement says the discovery has materially extended the footprint of mineralisation well beyond Locksley’s original silver find and pushes the project firmly into “district-scale” territory.\n\nRock chip sampling has returned silver grades of up to 409 grams per tonne (g/t), with multiple samples exceeding 30g/t, reinforcing the continuity and strength of the system.",
    "source": "SMH",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/cbd/albanese-wells-no-shows-at-the-scg-for-mcgrath-foundation-high-tea-20260105-p5nrt7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Albanese, Wells no-shows at the SCG for McGrath Foundation high tea",
    "publish_date": "Tue, 06 Jan 2026 11:53:41 +1100",
    "category": "sports",
    "authors": [
      "John Buckley"
    ],
    "text": "Over the past two decades, Australian prime ministers have become reliable guests of the McGrath Foundation’s high tea, the high-powered annual fundraiser on day three of the Pink Test at the Sydney Cricket Ground. But Prime Minister Anthony Albanese is one of two glaring omissions from those who showed at Tuesday’s function.\n\nAlbanese, along with his Communications and Sport Minister Anika Wells, steered clear of the SCG, amid mounting pressure on Labor to launch a federal inquiry into last month’s Bondi Beach terror attack. Instead, Albanese travelled to flood-ravaged far north Queensland.\n\nHappier times: Anthony Albanese at the Pink Test last year. Credit: Dion Georgopoulos\n\nThe Prime Minister’s Office declined to comment on his absence. Wells, meanwhile, didn’t even respond to requests for comment.\n\nAlbanese would not have had to look far for a reason to avoid the SCG on Tuesday. He only had to think back to the immeasurable failure of his predecessor, Scott Morrison, to read the mood of the nation in 2020, as large sections of the community were engulfed in flames.",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/business/markets/asx-set-to-open-higher-wall-street-gains-after-us-raid-on-venezuela-20260106-p5nrwe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Big four banks send ASX lower; BlueScope Steel shares rally",
    "publish_date": "Tue, 06 Jan 2026 11:33:44 +1100",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "The Australian sharemarket edged down in early trade on Tuesday, led lower by banks and consumer staples, which wiped out gains for the market from the mining giants. BlueScope Steel shares rallied after the nation’s biggest steelmaker confirmed it has received a $13 billion takeover offer.\n\nThe S&P/ASX 200 was down 25.7 points, or 0.3 per cent, to 8702.90 at 11.02am AEDT, ignoring a 0.4 per cent jump in ASX futures, which had suggested a strong morning. Nine of the market’s 11 industry sectors were in the red. The decline comes after a stagnant session on Monday, where the S&P/ASX 200 ended flat. The Australian dollar traded at US67.13¢.\n\nBlueScope’s steelworks at Port Kembla in NSW. The company confirmed it had received a $13 billion takeover offer. Credit: Louise Kennerley\n\nBlueScope shares soared 20.5 per cent to $29.47, approaching the $30 price offered by billionaire Kerry Stokes’ industrial and media group SGH Ltd and US steelmaker Steel Dynamics in their joint takeover bid for the company. The steelmaker’s board said it’s assessing the “highly conditional” proposal, which would require board and shareholder approval. SGH shares climbed 3.9 per cent.\n\nBHP – the nation’s biggest miner – was up 1.1 per cent and its rival, Rio Tinto, rose 1.4 per cent after copper resumed its scorching rally to surpass $US13,000 a tonne for the first time, as a renewed rush to ship metal to the US fired up bullish traders and investors. Benchmark prices on the London Metal Exchange surged as much as 4.7 per cent overnight, the latest in a series of leaps higher that have lifted copper about 20 per cent since mid-November.",
    "source": "SMH",
    "cluster_id": 4
  },
  {
    "url": "https://www.smh.com.au/national/nsw/as-sydney-s-5-million-population-grows-rapidly-how-will-we-live-20260106-p5nrwh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "As Sydney’s 5 million population grows rapidly, how will we live?",
    "publish_date": "Tue, 06 Jan 2026 11:30:00 +1100",
    "category": "finance",
    "authors": [
      "Aidan Elwig Pollock"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Sydney is growing, fast. The state’s population is expected to climb to 10 million in the next 15 years. Housing, climate change, liveability, congestion, healthcare and social cohesion will represent a nexus of challenges for our city. Natalia Krysiak wants Sydney to become a more playful city. But Sydneysiders have a way of seeing problems as opportunities. Next month’s annual Sydney Summit, hosted by the Committee for Sydney with the support of this masthead, allows Sydneysiders to pitch big ideas to meet these challenges. Green, liveable laneways replete with climate-proof drainage systems. Residential high-rise development, minus the car parks. Games and puzzles on every street corner. Small primary care clinics in every community, powered by rent-free spaces for GPs. These are four big ideas for Sydney’s neighbourhoods. Living laneways How can we climate-proof Sydney, increase housing affordability, and make sure our neighbourhoods remain liveable amid higher-density living? Landscape architect and UNSW urbanism researcher Melissa Cate Christ proposes “living laneways” as one answer.\n\nAdvertisement\n\nFor Cate Christ, this means expanding laneway housing (granny flats), supporting community-led greening initiatives, upgrading laneway surfaces and implementing improved drainage through water-sensitive urban design and revitalisation through art. An artist’s impression of what a living laneway might look like. Bringing living laneways to Sydney is not without its challenges, Cate Christ said. “We have multiple councils, and [each] have different rules. And there are multiple companies that build granny flats” she said, along with NSW Government legislation about secondary dwellings. A collaborative effort involving local and state governments, developers, architects and urban planners, and the communities themselves would bring these living laneways to life. Examining foreign examples – such as Chicago’s laneway project, “a municipally funded strategy where they do one laneway … per district, per year” - is crucial for learning how to implement living laneways, said Cate Christ. Melbourne also offers lessons. Whilst laneway activation there focused on festivals and nightlife, Melbourne’s “great study of greening laneways” would be useful. Car-free residential high-rises NSW could reach 10.1 million residents in the next 15 years, according to NSW Government estimates. Without reducing car dependency, we are headed for overburdened infrastructure and huge amounts of CO₂.\n\nAdvertisement\n\nLandcom chief executive Alex Wendler proposes parking-free residential high-rise development as one solution. “When we remove the mandate for car parking, it on one hand reduces construction costs [and] speeds up delivery,” he said, “but it also breaks the cycle of mandated car parks leading to more cars, which then lead to more congestion”. Imagine high rises in our city without car parking. Credit: Wolter Peeters With billions of dollars invested in the expansion of public transport in recent years, Wendler believes now is the time to act. “It needs to be a well-located area … well serviced by public transport, active transport, and amenities,” he said. “It’s really for particular people,” he said, “people who prioritise location affordability over car ownership … people who embrace that idea and who want to live in a less-car dependent way.” When cars are needed, car-share arrangements could fill the gap. Wendler pointed to Europe as an example of functional car-free development. Amsterdam, Berlin and Paris, he said, were good examples. “In Paris, they even converted … big roads into active transport corridors, where people walk and cycle,” facilitated by high-density, car-light development. The world’s most playful city\n\nAdvertisement\n\nArchitect and play consultant Natalia Krysiak thinks Sydney should become “the most playful city in the world”. An impression of how a neighbourhood could be designed to incorporate playful spaces. This would involve “shared public play opportunities”. Think council libraries building “a mini theatre … to create opportunities for acting out the books” and play-based gardening programs. It could even mean “games [and] puzzles … implemented in our public spaces,” such as bus stops and pedestrianised streets. “Play is often seen as quite a frivolous sort of behaviour, something that we observe only in children,” Krysiak said. But, she said, play “really promotes physical activity, both in children and adults … we also know that it’s very good for our mental health.” Play also combines “people of different ages, different socioeconomic backgrounds, different cultural backgrounds,” she said, “coming together to create … social connections”. This, Krysiak said, fosters social cohesion and innovation. Krysiak has a three-point plan. First, devising a “play strategy” encompassing Sydney and its local governments and community groups. Second, “a few pilot play districts within the city” to create community-specific exemplars. Third is “creating a playful city toolkit – a sort of pre-approved toolkit of things that communities could do to improve their streets and their public spaces.” Krysiak pointed to Barcelona as an example of a playful city. There, she said, intergenerational play spaces on street corners incorporate chess sets, comfortable seating, umbrellas, community gardens and playgrounds.\n\nAdvertisement\n\nFree rent for GPs An ageing population, increasing incidence of complex health conditions, and growing healthcare costs are straining Sydney’s primary healthcare system. Alison Huynh, an architect who specialises in wellbeing and urban design, has a solution: free rent for GPs to set up clinics in urban developments. “When you actually look into the reasons why GPs can’t offer services,” Huynh said, “a lot of it comes down to their basic costs”. Loading Incentivising developers to give small spaces to GPs for free would reduce that burden, she said. These spaces would increase “access to primary care in areas where populations are growing,” Huynh said. Additionally, “extended hours or part-time models that better reflect how today’s workforce operates” would make these rent-free clinics more accessible. The rent-free clinics would also support car-free neighbourhoods, Huynh said, taking sick people off public transport by creating primary care within walking distance.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/politics/victoria/the-man-in-the-cage-15-years-inside-melbourne-s-most-famous-nightclub-20251027-p5n5le.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The man in the cage: 15 years inside Melbourne’s most famous nightclub",
    "publish_date": "Tue, 06 Jan 2026 11:29:00 +1100",
    "category": "finance",
    "authors": [
      "Sophie Aubrey"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size ″I was so nervous this morning, I made the mistake of looking at a bunch of other Lunch Withs and just went, ‘Oh my god, what the f--- are we going to talk about?’” I’ve just finished a near two-hour lunch with Mike Callander, a resident DJ of 15 years at Revolver Upstairs, and this comment throws me. Whether you’ve been a “Revs” club rat or have never hiked up its foreboding staircase, Melburnians have an enduring fascination with the institution that has come to define the city’s nightlife and one which, fortunately for me, Callander thinks of as a second home. In other words, there is plenty to talk about. Callander, 45, has held a residency at Revolver since 2010 – more than half of the club’s 28-year history in Chapel Street, Prahran. Today he plays for partygoers in the early hours of Saturday mornings, often from 2am to 5am. We’re sitting at Cookie, a Thai restaurant and bar established by Revolver founder Camillo Ippoliti in the Melbourne CBD’s Curtin House. The lotus root salad with sweet potato, watercress, cashew and cherry tomato. Credit: Joe Armao The lotus root salad is a must, Callander says. The dish is beloved among his clubbing friends and is also served at Revolver’s Colonel Tan’s restaurant, which runs five nights a week on the venue’s rotating roster of vintage couches.\n\nAdvertisement\n\nRevolver evokes different meanings. On the one hand, it is a respected stalwart of Melbourne’s electronic music scene, attracting international headliners such as Fatboy Slim, Fred Again and Bicep. It’s also seen as a rite of passage and safe space for Melburnians who want to let loose among like-minded techno lovers. On the other, it holds a rare 24-hour liquor licence, which has fuelled stories of the Revs vortex that absorbs dedicated pill-poppers for three-day benders. The Revolver staircase. Credit: Joe Armao Callander has seen it all, and he’s quick to squash urban myths that people have been found dead beneath the pool table or behind a couch. “It’s absolute rubbish,” he says. “There’s a lot going on there and you can choose what to focus on: people taking drugs one night, the amazing restaurant, the art on the walls. I’ve seen a chamber orchestra playing there, a BMX competition, I’ve done DJ lessons.” Callander first experienced Revolver as a fledgling club kid in 1998, a year after it opened. “The funny thing is, it’s almost exactly the same,” he says.\n\nAdvertisement\n\n“I just could not believe how random it was, the whole club full of people sitting down, or dancing on the tables, and the tables were covered in ash. “It was just awesome … the place felt a bit lawless … It just felt like you could have been in Berlin and you were doing something cool.” Callander’s love of dance music came from his older brother. He recalls being 13 and hearing a DJ-mixed CD for the first time. “It became an important little totem for me, going, ‘How is the music never stopping?’” Mike Callander at lunch at Cookie in the CBD. Credit: Joe Armao Callander started making music as a teenager on his keyboard and, in the late ’90s, dove into Melbourne’s rave scene. “It was just like another world,” he says. “Pretty quickly, I was like, ‘I’ve got to be part of this somehow’.” At 18, he bought a set of turntables using money from his parents intended for a car. “They were totally pissed [off],” he says.\n\nAdvertisement\n\nHis dad eventually embraced Callander’s career choice after he started getting paid gigs in 2001. For his mum, he says, it remained “a symbol of unrealised potential” until he got a PhD in music three years ago. A 2001 photo of Mike Callander, believed to have been taken at the former Sub Club on Commercial Road, South Yarra, where the nightclub Circus now is. Callander says his first big break was getting a job DJing in 2005 at Honkytonks, a CBD nightclub that contributed heavily to Melbourne’s laneway culture before it shut in 2007. “That was like receiving a trophy,” he says. “For people of my vintage, Honkytonks was legendary. You would walk down a laneway, no idea where you’re going, and walk into a tiny club, 300 people max, with the best music.” Callander went on to play 10 summers in a row in Berlin (“the first time, I felt like I was going to the Olympics”) and has worked with Australian artists The Presets and The Avalanches. But it’s Revolver that has been his biggest career constant. It’s even where he forged a romance with his now-wife in 2012 after meeting her in a German club a year earlier. Callander plays in the back room, the best-known of the club’s two rooms with its quirky smattering of old couches and a floor-to-ceiling cage protecting the DJ booth.\n\nAdvertisement\n\n“It’s actually a really hard room to DJ at. The crowd is transient; it’s not a focused DJ-dance floor topography, it’s just people floating around everywhere. The chaos of that is what makes it awesome as well.” Vegetarian red curry with tofu, snow peas, tomato and pineapple. Credit: Joe Armao When things aren’t quite clicking, his manoeuvre is to deliver a surprise – like mixing The Nutbush or a Billie Eilish song with heavy, minimalist techno. “You may as well get more risky rather than safe,” he says. You’d be hard-pressed to find Callander’s music online. His Spotify feed is limited and, unlike most DJs, he doesn’t upload his sets to SoundCloud. “Music’s so disposable now. I’m not diluting the value of this by going, everyone can have it,” he says. “I’m so fortunate that I established myself before the influencer phenomenon ... I want to just do it and I want the room to be full.” Callander believes the secret to Revolver’s long-standing success is that between Friday night and Monday morning, party-seekers can count on the club being open.\n\nAdvertisement",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/jacks-drops-head-with-a-shocker-20260106-p5nrz5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jacks drops Head with a shocker",
    "publish_date": "Tue, 06 Jan 2026 11:25:11 +1100",
    "category": "finance",
    "authors": [],
    "text": "Jacks drops Head with a shocker\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.sbs.com.au/news/article/why-these-women-are-hitting-the-road-alone/8s90kij2x",
    "title": "'One of the biggest travel trends': Why these women are hitting the road alone",
    "publish_date": "Mon, 5 Jan 2026 18:31:06 +0000",
    "category": "sports",
    "authors": [],
    "text": "Judi Tarn was halfway up a \"treacherous\" mountain trail in the French Alps when the grief hit with full force.\n\n\n\n\n\nHer ankles were twisting on loose rock. Small creeks cut across the path. In the quiet air, she suddenly felt the absence of her husband, Alan, more sharply than she had in months.\n\n\n\n\n\n\"I really felt Alan with me there — I was going, 'What the hell, Alan? What am I doing here? I can't do this,'\" the 69-year-old told SBS News.\n\n\n\n\n\nFor a moment, she thought about turning back. But instead, she spoke to him.\n\n\n\nREAD MORE I went on my first solo holiday since becoming a mum\n\n\"I just kept going up the mountain saying, 'Get me through this',\" she said. \"It was hard. But I did feel that Alan was with me, encouraging me and going, 'This is fantastic. You're doing well.'\"\n\n\n\n\n\nIt was the kind of moment she could have never predicted when Alan died this year — and she found herself navigating life, and eventually travel, without him.\n\n\n\n'I was absolutely terrified'\n\nThe couple had been married for 45 years. Travelling was central to their lives together; they cycled across Europe, backpacked through Vietnam, and travelled through France and Spain.\n\n\n\n\n\n\"We did a lot of cycling together,\" Tarn said. \"It was our thing.\"\n\n\n\n\n\nAfter he passed, she filled journal pages with thoughts she couldn't say out loud. On one page, she wrote: \"I want to go on a really good holiday in a lovely place.\"\n\n\n\n\n\nSoon after, she heard about a singing-and-walking tour in the French Alps and knew that was it. She had travelled solo before, but this would be her first trip by herself since Alan passed.\n\n\n\nJudi Tarn and Alan shared 45 years of marriage, with travel at the heart of their life together. Source: Supplied / Judi Tarn \"This was the first trip where I didn't know what I was going into,\" Tarn said. \"I was absolutely terrified.\"\n\n\n\n\n\nThat fear started to dissipate when she finally arrived in Lyon, the third-largest city in France, after over 24 hours of travel. She sat in a cafe, ordered a meal in French, and was alone for the first time in decades.\n\n\n\n\n\n\"It was confirmation of the fact that I could do this,\" she said.\n\n\n\n\n\n\"I live on my own. I've got a lot of stuff going on. I might as well be lonely in France.\n\n\n\n\n\n\"My eyes were all filled with tears and I really wanted to cry because I was so proud of myself and I was just going, 'You go girl'. If I had a mirror, I would have high-fived myself in it.\n\n\n\n\n\n\"Travel is fantastic. You shouldn't go just because you're going to be on your own.\"\n\n\n\nWhy more older women are travelling on their own\n\nThis trend of older, bereaved, or newly single women travelling solo isn't unique to Tarn.\n\n\n\n\n\nBrett Mitchell, managing director Australia and New Zealand at Intrepid Travel, said the company has seen a 21 per cent year-on-year jump in travellers aged over 50 choosing to travel alone.\n\n\n\n\n\n\"It reflects a growing trend of older women looking for meaningful travel experiences, and they're turning to small-group trips as a safe and supportive way to explore the world on their own terms with other like-minded travellers,\" Mitchell told SBS News.\n\n\n\nTwo-thirds of travellers on Intrepid's women's expeditions are solo. Morocco is the most popular destination for older solo women.\n\n\n\n\n\n\"It's an incredibly rewarding place to visit, but it can also be challenging to navigate independently, from language barriers to busy medinas and complex transport,\" he said.\n\n\n\n\n\n\"Destinations like Morocco resonate with group travel because they offer a sense of adventure without sacrificing comfort or safety.\"\n\n\n\n\n\nSafety is the number one concern Mitchell hears from older women.\n\n\n\n\n\n\"Senior solo female travellers often place greater emphasis on feeling safe, having dependable logistics, and knowing support is available if something doesn't go to plan,\" he said.\n\n\n\n\n\nCarolyn Ray, CEO of JourneyWoman, a global resource hub for solo women travellers, said bereaved women are a huge and overlooked demographic.\n\n\n\n\n\n\"This is one of the biggest trends in travel that has largely been ignored,\" she told SBS News.\n\n\n\nThe emotional whiplash of travelling after loss\n\nMelbourne-based psychologist Carly Dober said travel can be profoundly therapeutic for grieving women — but emotionally complex.\n\n\n\n\n\n\"[Widowed travellers] might experience joy and excitement that they're able to still travel and see places at their own pace,\" Dober told SBS News.\n\n\n\n\n\n\"But they might feel deep sorrow their partner isn't there to enjoy it with them … and might experience some loneliness.\"\n\n\n\nREAD MORE These two women travelled to every country in the world but kept one thing secret\n\n\"Grief can feel weird sometimes, and there are a lot of ups and downs on the rollercoaster. You may feel quite lonely — lonelier than you thought,\" Dober said.\n\n\n\n\n\nA 2025 study by Monash University found loneliness is the most significant challenge for widowed people, describing it as \"common and potentially unavoidable\". Another study published in The Journals of Gerontology found widowed women experienced a two-fold increase in loneliness in the first year.\n\n\n\n\n\nDober said instead of pushing grief away, travel can create small, healthy moments of connection with the person you've lost.\n\n\n\n\n\n\"You can keep your deceased spouse alive in your mind,\" she said. \"If you see a beautiful cafe that your deceased loved one would have loved — go there. Speak out loud to them. Don't bottle it up.\"\n\n\n\nThere are more women like Judi Tarn, with data from Intrepid Travel showing a 21 per cent jump year on year in travellers aged 50+ choosing to travel alone. Source: Supplied / Judi Tarn For Tarn, that's become instinctive.\n\n\n\n\n\n\"I can almost feel as if he's pedalling along behind me, going, 'Look at this – isn't it wonderful?',\" she said.\n\n\n\n'It made me feel like an Amazon'\n\nWhile Tarn's trip had moments that knocked her sideways emotionally, she said those five weeks alone changed her sense of what is possible.\n\n\n\n\n\n\"It made me feel like an Amazon,\" she said. \"It just made me think: I can do anything now. It made me feel different when I got back.\"\n\n\n\n\n\nMitchell said this transformation is common.\n\n\n\n\n\n\"Many women in this age group describe solo travel as a personal milestone,\" he said. \"Some want the space to rediscover their independence or pursue interests they've long put off.\"\n\n\n\n\n\nResearch shows solo travel can boost feelings of freedom, self-development, and contentment. For widowed women, Dober said the effect can be even more powerful.\n\n\n\n\n\n\"There can be a sense of achievement and self-sufficiency when older women realise that they can do this on their own — and have enjoyable moments on their own, too,\" she said.\n\n\n\nIt just made me think: I can do anything now. It made me feel different when I got back. Judi Tarn, solo traveller\n\n'There's still life to be lived'\n\nTarn isn't sure exactly what trip comes next — but she's certain there will be one.\n\n\n\n\n\n\"Life does go on,\" she said. \"I just felt like I can do anything now. And I've got to do it because at 69, I could drop dead at any minute.\"\n\n\n\n\n\nShe hopes other widowed women know that strength can return in unexpected ways.\n\n\n\n\n\n\"There's still life to be lived,\" she said. \"You've got to honour that person by living your life in the best way possible.\"\n\n\n\n\n\n\"I feel as though I've got to live my life on the double because Alan couldn't live his life.\"\n\n\n\n\n\nAnd what would Alan think of her newfound independence?\n\n\n\n\n\n\"He'd be so proud of me. He was my biggest champion.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 27
  },
  {
    "url": "https://www.sbs.com.au/news/video/childcare-subsidy-expanded-to-three-days-raising-access-and-cost-concerns/7rlkclalc",
    "title": "Childcare subsidy expanded to three days, raising access and cost concerns",
    "publish_date": "Mon, 5 Jan 2026 08:58:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Childcare subsidy expanded to three days, raising access and cost concerns\n\nPublished 5 January 2026, 7:55 am\n\nParents using childcare are now guaranteed a subsidy for three-days a week, without completing an eligibility test. The government says more than 100,000 families will benefit from the new initiative. But critics point to the limited number of available pre-school places, with the potential of higher demand leading to a hike in childcare centre fees.",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/three-day-childcare-subsidy-now-in-place-but-will-it-help-families/9vi2dc7er",
    "title": "Three-day childcare subsidy now in place - but will it help families?",
    "publish_date": "Mon, 5 Jan 2026 07:14:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nMelbourne mother Marita Tilleraas knows first-hand the struggle of paying for childcare.\n\n\n\n\n\n\"Our childcare fees have been equivalent of our mortgage and more. The more I earn, like say I get a 5 per cent pay rise due to inflation, then my childcare fee will go up because I'm earning the next bracket and then my pay rise actually is less because all my money and more ends up going to childcare.\"\n\n\n\n\n\nThe mother of two works full time and has long called for the \"Activity Test\" to be scrapped, an eligibility measure introduced by the Coalition back in 2018 that requires parents to work, study or volunteer a certain amount of hours each week.\n\n\n\n\n\nThe goal of scrapping the test is shared by The Parenthood, an advocacy organisation that is also campaigning for a capping of childcare fees.\n\n\n\n\n\nCampaign Director Maddy Butler says the test has made the lives of many parents more difficult.\n\n\n\n\n\n\"We have heard stories that parents and carers have had to really quickly try and find some volunteering that they could do, in order to be able to access early learning and care so that then they could - with a bit more time - go out and get some paid work as well.\"\n\n\n\n\n\nStarting this week, the Albanese government have guaranteed access for parents to a 90 per cent subsidy for three days a week of child care.\n\n\n\n\n\nTreasurer Jim Chalmers says this will help parents across the country.\n\n\n\n\n\n\"We expect about 100,000 Australian families will benefit from the Albanese Labor Government's three day guarantee. Now we work on the basis of if it's good for kids, if it's good for families, if it's good for the education system - then it's good for the economy as well. And that's why as Treasurer I'm really proud to have helped secure the funding for this three-day guarantee.\"\n\n\n\n\n\nThe government says these three days will not require the Activity Test, however the test will still apply if parents want to access the child care subsidy for additional days.\n\n\n\n\n\nNesha Hutchinson, owner of Cressy Road Early Learning centre, says removing the test for the three days is a good first step to make the care more affordable for parents.\n\n\n\n\n\n\"We've had families that have had four children in care with us at the same time, this is not cheap. Scrapping this means that they don't have to do these sums as much and they can just make decisions in the best interest of families, of their own family and of their children.\"\n\n\n\n\n\nThe Parenthood's Campaign Director, Maddy Butler, says these subsidies from the government will not fix the issue of cost on their own.\n\n\n\n\n\n\"Whenever these subsidy increases have been introduced they've then soon been followed by fee hikes from many service providers. So that's why we're calling on the Federal Government for a fixed fee model, to reform the system and ensure that's its really simple for families to use.\"\n\n\n\n\n\nBut the Childcare subsidy does not guarantee admission with a provider.\n\n\n\n\n\nFamilies will still need to secure a place with their chosen child care service, and may need to pay a gap fee.\n\n\n\n\n\nMother of two Jen Fleming says it's been incredibly difficult to secure her daughter a place at a child care centre.\n\n\n\n\n\n\"I put my first daughter's name down when I was 20 weeks pregnant. She is 4-and-a-half (years) and has still not been offered a place in that centre.\"\n\n\n\n\n\nAfter facing this struggle, Ms Fleming has been advocating for the government's new subsidy to also cover alternatives to childcare.\n\n\n\n\n\n\"It could be a nanny or a grandparent, it could be an au pair, it could be a co-working space that allows a mum to go back to work sooner, but continue to breastfeed. There needs to be this broadening of the system to acknowledge all types of care.\"\n\n\n\n\n\nOpposition Leader Susan Ley says the subsidies don't fix the issue of a lack of childcare options and removing the test may make matters more difficult for some working parents.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 28
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/what-venezuela-means-for-petrol-prices-and-oil/zqik39cxq",
    "title": "What Venezuela means for petrol prices and oil",
    "publish_date": "Mon, 5 Jan 2026 06:26:47 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.sbs.com.au/news/article/china-beef-tarriffs-australia-explained/l9c5gzq37",
    "title": "Why has China introduced new tariffs on Australian beef?",
    "publish_date": "Mon, 5 Jan 2026 05:25:40 +0000",
    "category": "finance",
    "authors": [],
    "text": "In December 2024, China lifted a ban on two Australian beef producers, signalling the end of a four-year trade dispute between the two countries.\n\n\n\n\n\nHowever, when China announced new trade restrictions on Australian beef last week, concerns — from both Australia and the red meat industry — have been raised around whether China is plotting another trade war against Australia.\n\n\n\n\n\nChina's commerce ministry introduced a quota on beef exports, and exporters who exceed the quota will be subject to a 55 per cent tariff.\n\n\n\n\n\nAs Australian beef is protected by the China-Australia Free Trade Agreement (ChAFTA), the commerce ministry also announced that it would pause compliance with the relevant measures in the agreement.\n\n\n\n\n\nThe tariff is set to last three years, starting 1 January 2026.\n\n\n\nTrade Minister Don Farrell said the government was \"disappointed by this decision\", calling on China to respect Australia's status as a \"valued free trade agreement partner\".\n\n\n\n\n\nWhile Australia's red meat industry is yet to estimate the potential impacts of the tariffs, Australian exporters may be better prepared in comparison to previous trade changes.\n\n\n\nHow China's domestic beef crisis triggers tariffs\n\nWhile trade disputes between Australia and China in 2020 stemmed from geopolitical tensions amid the COVID-19 pandemic, China's most recent tariff announcement is mainly aimed at appeasing China's domestic producers.\n\n\n\n\n\nChinese media reports — dating back to 2023 — found the country's red meat sector has been facing an oversupply crisis, which has led to a drastic price drop in Chinese beef.\n\n\n\n\n\nHowever, the overall import of beef into China has been rising, sparking concerns and complaints from China's red meat sector.\n\n\n\n\n\nIn December 2024, the China Animal Agriculture Association submitted a request to China's commerce ministry, in partnership with nine other agricultural organisations, urging China to investigate the damage caused by red meat exports to domestic products and sectors.\n\n\n\nInternational Markets at Meat & Livestock Australia general manager Andrew Cox said Australia had participated in the investigation.\n\n\n\n\n\n\"We were invited to be an interested party, and we put forward what we thought was a very strong case against damages [on Chinese sectors] caused by Australian beef,\" he told SBS News.\n\n\n\n\n\nChina had also been cautious about the investigation, as it extended the investigation's deadline by another three months, citing the need to review a large volume of materials due to the case's complexity.\n\n\n\nHow will tariffs impact Australian exporters?\n\nWhile China is Australia's second largest destination for exported beef, Australia was only a \"small player in the Chinese beef game\", Cox said.\n\n\n\n\n\n\"We tend to focus on the higher-end, more premium quality products,\" he said.\n\n\n\n\n\nData from TradeMap indicate Brazil and Argentina were the top two beef importers to China in 2024, with Brazil accounting for approximately half of the overall imported value of the products.\n\n\n\n\n\nDue to the large amount of Australian beef exported to China — which was over 295,000 tonnes in the first 11 months of 2025 — the impact of the tariffs is \"hard to assess\", Cox said.\n\n\n\n\n\n\"The quota that's been set is some way below the volumes that we've been exporting to China recently,\" he said.\n\n\n\n\n\nIn recent years, as the demand for Australian beef has grown, Australian exporters have triggered more safeguard provisions — a mechanism that allows importing countries to restrict imports to protect their domestic sectors.\n\n\n\nIn July 2025, before the tariff, Australia already triggered the beef safeguard in the ChAFTA.\n\n\n\n\n\nTwo months later, South Korea — which had also signed a free trade agreement with Australia and was Australia's third-largest export destination in 2024 — also had the beef safeguard triggered.\n\n\n\nExporters have learned the China lesson\n\nDespite the safeguard provisions, Cox said it's good news that Australian beef was popular in international markets.\n\n\n\n\n\n\"In 2025, we had record shipments to a number of different markets, and that's because of the strong demand for Australian beef and also some tight global suppliers of the product,\" Cox said.\n\n\n\n\n\nAfter a five-year trade dispute with China that had hit Australia's red meat industry, exporters have learned an important lesson, according to Cox.\n\n\n\n\n\n\"Australian exporters thrive when they have diversified markets. China has presented some wonderful opportunities for the Australian beef industry over the years, but of course, it's also come with a certain amount of volatility.\"\n\n\n\nREAD MORE Albanese invites Arab 'hypermarket' to compete with Coles and Woolworths\n\nOver the past few years, Australian beef exporters have cultivated relationships with markets outside China.\n\n\n\n\n\n\"There's a lot of great opportunities across many different markets for Australian beef in 2026 and beyond,\" Cox said.\n\n\n\n\n\nBut, 2025 had been a year of uncertainty for international trade, with Australia also being caught in a tariff dispute with the United States, which was formerly its biggest beef import destination.\n\n\n\n\n\nIn November, following rounds of negotiations, the US lifted the 10 per cent tariffs on Australian beef. However, there was still a 17 per cent increase in exported Australian beef to the US in the first 10 months of 2025 compared to 2024.\n\n\n\nIn an interview with the ABC on Monday, Opposition spokesperson for trade Kevin Hogan said China's tariff announcement indicated \"a bigger picture\" for Australian exporters.\n\n\n\n\n\n\"[Australia] is advantaged by rules, by trade in order, and in the last 12 months, we've seen both the United States and now China again — like they did a few years ago — start to not play by the rules,\" Hogan said.\n\n\n\n\n\n\"And I don't think that's good for world trade, absolutely not good for Australia, and I think countries like Australia and other middle trading nations need to push back on the big guys that you have to play by the rules.\"\n\n\n\n\n\nVolatility is common in international trade: \"Of course, the market, the trade environment, has its risks and it also has its opportunities,\" Cox said.\n\n\n\n\n\n\"So whilst this decision from China is disappointing, there are still tremendous opportunities in other markets and in China, long term for Australian industry.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 30
  },
  {
    "url": "https://www.sbs.com.au/news/creative/behind-the-rise-in-shark-attacks-australia/nu35kj93n",
    "title": "Sharks are closer than we think. Here are the telltale signs they're nearby",
    "publish_date": "Sun, 4 Jan 2026 18:38:41 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/culture/music/universal-music-parts-ways-with-singer-dean-lewis-just-months-after-misconduct-allegations-20260106-p5nryb.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Universal Music parts ways with singer Dean Lewis just months after misconduct allegations",
    "publish_date": "Tue, 06 Jan 2026 13:05:06 +1100",
    "category": "entertainment",
    "authors": [
      "Nell Geraets"
    ],
    "text": "Universal Music Group has parted ways with Australian singer Dean Lewis, ending a decade-long partnership just months after the pop star became embroiled in misconduct allegations.\n\n“We can confirm that Dean Lewis is no longer signed to Universal Music Australia or any Universal Music Group label,” a Universal Music Australia (UMA) spokesperson told this masthead on Tuesday.\n\nDean Lewis is no longer signed to Universal Music Group after a decade-long partnership.\n\nNo reason was given as to why the partnership ended. While Lewis’ management did not immediately respond to this masthead’s request for comment, a spokesperson told Rolling Stone Australia that while there are no immediate plans to talk to other music labels, Lewis was looking forward to working as an independent artist and intended to release new music this year.\n\nThe decision to part ways comes about two months after several female fans from around the world alleged that the ARIA Award-winning musician upset or unsettled them through text messages or in-person interactions. They also shared phone recordings and screenshots of the text chains between themselves and the singer.",
    "source": "TheAge",
    "cluster_id": 16
  },
  {
    "url": "https://www.theage.com.au/business/companies/wa-solar-project-reboot-puts-pilot-in-data-centre-power-race-20260106-p5ns0j.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "WA solar project reboot puts Pilot in data-centre power race",
    "publish_date": "Tue, 06 Jan 2026 13:04:40 +1100",
    "category": "finance",
    "authors": [
      "Rowena Duckworth"
    ],
    "text": "Pilot Energy has taken another decisive step in its clean energy transition, striking a binding agreement with renewables partner SN Energy to jointly develop a hybrid solar and battery storage project at its Three Springs site in Western Australia.\n\nUnder a binding heads of agreement, the parties will co-develop a hybrid solar and battery energy storage system (BESS) at the solar development site, located just north of Perth. The project has also been designed to support a proposed 50-megawatt (MW) data centre, positioning the site as a future-ready clean energy hub.\n\nPilot Energy’s solar site at Three Springs in Western Australia.\n\nAs part of the deal, SN Energy will fund the acquisition of land near Three Springs that was originally earmarked for a state government-approved stand-alone solar project. Pilot will receive total consideration of $10.75 million in upfront and milestone payments for the land acquisition. The funds will also cover the costs associated with progressing grid connection works and lodging a new development application for the hybrid solar BESS and data centre project.\n\nThe hybrid strategy reflects a growing market demand for deliverable green energy solutions, particularly from energy-hungry data centres. Globally, data centres already consume an estimated 2–3 per cent of electricity output, with demand accelerating rapidly due to artificial intelligence and cloud computing. In some regions, data centre power usage is forecast to account for up to 15 per cent of national electricity demand.",
    "source": "TheAge",
    "cluster_id": 17
  },
  {
    "url": "https://www.theage.com.au/business/markets/investors-pull-money-from-australia-on-rate-risks-weak-profits-20260106-p5nrwr.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Investors pull money from Australia on rate risks, weak profits",
    "publish_date": "Tue, 06 Jan 2026 12:47:00 +1100",
    "category": "finance",
    "authors": [
      "Matthew Burgess",
      "Carmeli Argana"
    ],
    "text": "A pullback from Australian assets is accelerating as investors shift capital toward hot markets globally that promise returns far outpacing the muted prospects at home.\n\nMLC Asset Management and JPMorgan Asset Management are among those expecting stronger equity returns offshore, while T. Rowe Price is betting the Reserve Bank’s hawkish stance will flatten the yield curve for bonds.\n\nThe message for investors chasing upside in Australian assets is clear: look elsewhere. The benchmark S&P/ASX 200 Index lagged peers in 2025, while bond prices dropped as the central bank weighs pivoting back to tightening monetary policy.\n\nInternational investors are walking away from the Australian sharemarket. Credit: Louie Douvis\n\n“We’re under-allocated to Australia” shares as it’s hard to see them outperform in 2026, said Patrick Nicoll, head of asset allocation at MLC. “We’re also short duration in Australia, expecting [bond] yields to rise” as the RBA lifts rates again.",
    "source": "TheAge",
    "cluster_id": 18
  },
  {
    "url": "https://www.theage.com.au/culture/celebrity/game-of-thrones-star-sophie-turner-s-marriage-blew-up-suddenly-then-it-got-nasty-20260106-p5nrxc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Game of Thrones star Sophie Turner’s marriage blew up suddenly. Then it got nasty",
    "publish_date": "Tue, 06 Jan 2026 12:46:26 +1100",
    "category": "entertainment",
    "authors": [
      "Bronte Gossling"
    ],
    "text": "Sophie Turner turns 30 next month, and for her birthday, she wants nothing more than “some peace”.\n\nThe British actress was 13 when she was cast in Game of Thrones, the juggernaut that would dominate global television for nearly a decade. But the scrutiny that followed her into adulthood intensified in September 2023, when her split from ex-husband Joe Jonas prompted wild and unfounded speculation on her fitness to parent their two children. The shame and guilt from that period, Turner has said in a new interview, still lingers.\n\nJoe Jonas and Sophie Turner split in September 2023 after four years of marriage. In the weeks that followed, Turner was plagued by accusations that she “likes to party” and Jonas “likes to stay home”, which she later disputed. Credit: Getty\n\n“It’s a total fishbowl. And people take so much as fact these days,” Turner said in a new cover interview for Net-A-Porter’s digital magazine Porter.\n\n“You feel like you’re gagged because silence is always the way to let something die out. But it means that you can’t stand up for yourself ever, so there’s a feeling of helplessness and shame.”",
    "source": "TheAge",
    "cluster_id": 19
  },
  {
    "url": "https://www.theage.com.au/lifestyle/morgan-riddle-tries-her-hand-at-aussie-slang-20260106-p5ns02.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Morgan Riddle tries her hand at Aussie slang",
    "publish_date": "Tue, 06 Jan 2026 12:40:26 +1100",
    "category": "lifestyle",
    "authors": [],
    "text": "Morgan Riddle tries her hand at Aussie slang\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 20
  },
  {
    "url": "https://www.theage.com.au/goodfood/melbourne-eating-out/beloved-mornington-ice-creamery-opens-second-outpost-in-black-rock-20260106-p5nryz.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Beloved Mornington ice creamery opens second outpost in Black Rock",
    "publish_date": "Tue, 06 Jan 2026 12:25:31 +1100",
    "category": "finance",
    "authors": [
      "Haymun Win"
    ],
    "text": "Add articles to your saved list and come back to them anytime.\n\nSave this article for later\n\nRemove items from your saved list to add more.\n\nYou have reached your maximum number of saved items.\n\nOkay Lucy is scooping flavours like raspberry meringue just a short walk from Half Moon Bay.\n\n1 / 3 A scoop of raspberry meringue gelato at Okay Lucy in Black Rock. Eddie Jim 2 / 3 Mornington’s Okay Lucy has expanded to Black Rock. Eddie Jim 3 / 3 Okay Lucy Gelato - a boutique gelateria in Mornington. Supplied. Previous Slide Next Slide\n\nCafe$$$$\n\nBeloved by Mornington regulars since 2019, Okay Lucy has opened a second coastal store close to several popular Melbourne beaches. Red velvet, cookie dough and raspberry meringue are among the more nostalgic flavours. A dedicated pastry team elevates them by baking all elements from scratch.\n\nMust-try scoop: Specked with crushed espresso beans and swirled with house-made caramel, a salted piccolo will perk you up after a day at Sandringham Beach or Half Moon Bay.\n\nWant to visit this venue? Save it in the Good Food app.",
    "source": "TheAge",
    "cluster_id": 21
  },
  {
    "url": "https://www.theage.com.au/business/companies/locksley-adds-high-grade-silver-punch-to-us-critical-minerals-play-20260106-p5nrzs.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Locksley adds high-grade silver punch to US critical minerals play",
    "publish_date": "Tue, 06 Jan 2026 12:22:15 +1100",
    "category": "finance",
    "authors": [
      "James Pearson"
    ],
    "text": "Locksley Resources has delivered another eye-catching result in California, uncovering a significant high-grade silver corridor at its Mojave project, adding a powerful new dimension to the company’s critical minerals story.\n\nThe company has identified a consistent northwest–southeast trending mineralised corridor stretching almost three kilometres across the North Block of its project after a detailed surface sampling campaign delivered high-grade silver hits and robust base metal credits.\n\nRock chips collected from a historic stockpile at Locksley Resources’ Mojave project in California returned 409 g/t silver, displaying gossanous textures indicative of weathered sulphides.\n\nManagement says the discovery has materially extended the footprint of mineralisation well beyond Locksley’s original silver find and pushes the project firmly into “district-scale” territory.\n\nRock chip sampling has returned silver grades of up to 409 grams per tonne (g/t), with multiple samples exceeding 30g/t, reinforcing the continuity and strength of the system.",
    "source": "TheAge",
    "cluster_id": 22
  },
  {
    "url": "https://www.theage.com.au/cbd/albanese-wells-no-shows-at-the-scg-for-mcgrath-foundation-high-tea-20260105-p5nrt7.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Albanese, Wells no-shows at the SCG for McGrath Foundation high tea",
    "publish_date": "Tue, 06 Jan 2026 11:53:41 +1100",
    "category": "sports",
    "authors": [
      "John Buckley"
    ],
    "text": "Over the past two decades, Australian prime ministers have become reliable guests of the McGrath Foundation’s high tea, the high-powered annual fundraiser on day three of the Pink Test at the Sydney Cricket Ground. But Prime Minister Anthony Albanese is one of two glaring omissions from those who showed at Tuesday’s function.\n\nAlbanese, along with his Communications and Sport Minister Anika Wells, steered clear of the SCG, amid mounting pressure on Labor to launch a federal inquiry into last month’s Bondi Beach terror attack. Instead, Albanese travelled to flood-ravaged far north Queensland.\n\nHappier times: Anthony Albanese at the Pink Test last year. Credit: Dion Georgopoulos\n\nThe Prime Minister’s Office declined to comment on his absence. Wells, meanwhile, didn’t even respond to requests for comment.\n\nAlbanese would not have had to look far for a reason to avoid the SCG on Tuesday. He only had to think back to the immeasurable failure of his predecessor, Scott Morrison, to read the mood of the nation in 2020, as large sections of the community were engulfed in flames.",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/business/markets/asx-set-to-open-higher-wall-street-gains-after-us-raid-on-venezuela-20260106-p5nrwe.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Big four banks send ASX lower; BlueScope Steel shares rally",
    "publish_date": "Tue, 06 Jan 2026 11:33:44 +1100",
    "category": "finance",
    "authors": [
      "Staff Writers"
    ],
    "text": "The Australian sharemarket edged down in early trade on Tuesday, led lower by banks and consumer staples, which wiped out gains for the market from the mining giants. BlueScope Steel shares rallied after the nation’s biggest steelmaker confirmed it has received a $13 billion takeover offer.\n\nThe S&P/ASX 200 was down 25.7 points, or 0.3 per cent, to 8702.90 at 11.02am AEDT, ignoring a 0.4 per cent jump in ASX futures, which had suggested a strong morning. Nine of the market’s 11 industry sectors were in the red. The decline comes after a stagnant session on Monday, where the S&P/ASX 200 ended flat. The Australian dollar traded at US67.13¢.\n\nBlueScope’s steelworks at Port Kembla in NSW. The company confirmed it had received a $13 billion takeover offer. Credit: Louise Kennerley\n\nBlueScope shares soared 20.5 per cent to $29.47, approaching the $30 price offered by billionaire Kerry Stokes’ industrial and media group SGH Ltd and US steelmaker Steel Dynamics in their joint takeover bid for the company. The steelmaker’s board said it’s assessing the “highly conditional” proposal, which would require board and shareholder approval. SGH shares climbed 3.9 per cent.\n\nBHP – the nation’s biggest miner – was up 1.1 per cent and its rival, Rio Tinto, rose 1.4 per cent after copper resumed its scorching rally to surpass $US13,000 a tonne for the first time, as a renewed rush to ship metal to the US fired up bullish traders and investors. Benchmark prices on the London Metal Exchange surged as much as 4.7 per cent overnight, the latest in a series of leaps higher that have lifted copper about 20 per cent since mid-November.",
    "source": "TheAge",
    "cluster_id": 4
  },
  {
    "url": "https://www.theage.com.au/national/nsw/as-sydney-s-5-million-population-grows-rapidly-how-will-we-live-20260106-p5nrwh.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "As Sydney’s 5 million population grows rapidly, how will we live?",
    "publish_date": "Tue, 06 Jan 2026 11:30:00 +1100",
    "category": "finance",
    "authors": [
      "Aidan Elwig Pollock"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size Sydney is growing, fast. The state’s population is expected to climb to 10 million in the next 15 years. Housing, climate change, liveability, congestion, healthcare and social cohesion will represent a nexus of challenges for our city. Natalia Krysiak wants Sydney to become a more playful city. But Sydneysiders have a way of seeing problems as opportunities. Next month’s annual Sydney Summit, hosted by the Committee for Sydney with the support of this masthead, allows Sydneysiders to pitch big ideas to meet these challenges. Green, liveable laneways replete with climate-proof drainage systems. Residential high-rise development, minus the car parks. Games and puzzles on every street corner. Small primary care clinics in every community, powered by rent-free spaces for GPs. These are four big ideas for Sydney’s neighbourhoods. Living laneways How can we climate-proof Sydney, increase housing affordability, and make sure our neighbourhoods remain liveable amid higher-density living? Landscape architect and UNSW urbanism researcher Melissa Cate Christ proposes “living laneways” as one answer.\n\nAdvertisement\n\nFor Cate Christ, this means expanding laneway housing (granny flats), supporting community-led greening initiatives, upgrading laneway surfaces and implementing improved drainage through water-sensitive urban design and revitalisation through art. An artist’s impression of what a living laneway might look like. Bringing living laneways to Sydney is not without its challenges, Cate Christ said. “We have multiple councils, and [each] have different rules. And there are multiple companies that build granny flats” she said, along with NSW Government legislation about secondary dwellings. A collaborative effort involving local and state governments, developers, architects and urban planners, and the communities themselves would bring these living laneways to life. Examining foreign examples – such as Chicago’s laneway project, “a municipally funded strategy where they do one laneway … per district, per year” - is crucial for learning how to implement living laneways, said Cate Christ. Melbourne also offers lessons. Whilst laneway activation there focused on festivals and nightlife, Melbourne’s “great study of greening laneways” would be useful. Car-free residential high-rises NSW could reach 10.1 million residents in the next 15 years, according to NSW Government estimates. Without reducing car dependency, we are headed for overburdened infrastructure and huge amounts of CO₂.\n\nAdvertisement\n\nLandcom chief executive Alex Wendler proposes parking-free residential high-rise development as one solution. “When we remove the mandate for car parking, it on one hand reduces construction costs [and] speeds up delivery,” he said, “but it also breaks the cycle of mandated car parks leading to more cars, which then lead to more congestion”. Imagine high rises in our city without car parking. Credit: Wolter Peeters With billions of dollars invested in the expansion of public transport in recent years, Wendler believes now is the time to act. “It needs to be a well-located area … well serviced by public transport, active transport, and amenities,” he said. “It’s really for particular people,” he said, “people who prioritise location affordability over car ownership … people who embrace that idea and who want to live in a less-car dependent way.” When cars are needed, car-share arrangements could fill the gap. Wendler pointed to Europe as an example of functional car-free development. Amsterdam, Berlin and Paris, he said, were good examples. “In Paris, they even converted … big roads into active transport corridors, where people walk and cycle,” facilitated by high-density, car-light development. The world’s most playful city\n\nAdvertisement\n\nArchitect and play consultant Natalia Krysiak thinks Sydney should become “the most playful city in the world”. An impression of how a neighbourhood could be designed to incorporate playful spaces. This would involve “shared public play opportunities”. Think council libraries building “a mini theatre … to create opportunities for acting out the books” and play-based gardening programs. It could even mean “games [and] puzzles … implemented in our public spaces,” such as bus stops and pedestrianised streets. “Play is often seen as quite a frivolous sort of behaviour, something that we observe only in children,” Krysiak said. But, she said, play “really promotes physical activity, both in children and adults … we also know that it’s very good for our mental health.” Play also combines “people of different ages, different socioeconomic backgrounds, different cultural backgrounds,” she said, “coming together to create … social connections”. This, Krysiak said, fosters social cohesion and innovation. Krysiak has a three-point plan. First, devising a “play strategy” encompassing Sydney and its local governments and community groups. Second, “a few pilot play districts within the city” to create community-specific exemplars. Third is “creating a playful city toolkit – a sort of pre-approved toolkit of things that communities could do to improve their streets and their public spaces.” Krysiak pointed to Barcelona as an example of a playful city. There, she said, intergenerational play spaces on street corners incorporate chess sets, comfortable seating, umbrellas, community gardens and playgrounds.\n\nAdvertisement\n\nFree rent for GPs An ageing population, increasing incidence of complex health conditions, and growing healthcare costs are straining Sydney’s primary healthcare system. Alison Huynh, an architect who specialises in wellbeing and urban design, has a solution: free rent for GPs to set up clinics in urban developments. “When you actually look into the reasons why GPs can’t offer services,” Huynh said, “a lot of it comes down to their basic costs”. Loading Incentivising developers to give small spaces to GPs for free would reduce that burden, she said. These spaces would increase “access to primary care in areas where populations are growing,” Huynh said. Additionally, “extended hours or part-time models that better reflect how today’s workforce operates” would make these rent-free clinics more accessible. The rent-free clinics would also support car-free neighbourhoods, Huynh said, taking sick people off public transport by creating primary care within walking distance.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/politics/victoria/the-man-in-the-cage-15-years-inside-melbourne-s-most-famous-nightclub-20251027-p5n5le.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The man in the cage: 15 years inside Melbourne’s most famous nightclub",
    "publish_date": "Tue, 06 Jan 2026 11:29:00 +1100",
    "category": "finance",
    "authors": [
      "Sophie Aubrey"
    ],
    "text": "Save Log in , register or subscribe to save articles for later. Save articles for later Add articles to your saved list and come back to them any time. Got it Normal text size Larger text size Very large text size ″I was so nervous this morning, I made the mistake of looking at a bunch of other Lunch Withs and just went, ‘Oh my god, what the f--- are we going to talk about?’” I’ve just finished a near two-hour lunch with Mike Callander, a resident DJ of 15 years at Revolver Upstairs, and this comment throws me. Whether you’ve been a “Revs” club rat or have never hiked up its foreboding staircase, Melburnians have an enduring fascination with the institution that has come to define the city’s nightlife and one which, fortunately for me, Callander thinks of as a second home. In other words, there is plenty to talk about. Callander, 45, has held a residency at Revolver since 2010 – more than half of the club’s 28-year history in Chapel Street, Prahran. Today he plays for partygoers in the early hours of Saturday mornings, often from 2am to 5am. We’re sitting at Cookie, a Thai restaurant and bar established by Revolver founder Camillo Ippoliti in the Melbourne CBD’s Curtin House. The lotus root salad with sweet potato, watercress, cashew and cherry tomato. Credit: Joe Armao The lotus root salad is a must, Callander says. The dish is beloved among his clubbing friends and is also served at Revolver’s Colonel Tan’s restaurant, which runs five nights a week on the venue’s rotating roster of vintage couches.\n\nAdvertisement\n\nRevolver evokes different meanings. On the one hand, it is a respected stalwart of Melbourne’s electronic music scene, attracting international headliners such as Fatboy Slim, Fred Again and Bicep. It’s also seen as a rite of passage and safe space for Melburnians who want to let loose among like-minded techno lovers. On the other, it holds a rare 24-hour liquor licence, which has fuelled stories of the Revs vortex that absorbs dedicated pill-poppers for three-day benders. The Revolver staircase. Credit: Joe Armao Callander has seen it all, and he’s quick to squash urban myths that people have been found dead beneath the pool table or behind a couch. “It’s absolute rubbish,” he says. “There’s a lot going on there and you can choose what to focus on: people taking drugs one night, the amazing restaurant, the art on the walls. I’ve seen a chamber orchestra playing there, a BMX competition, I’ve done DJ lessons.” Callander first experienced Revolver as a fledgling club kid in 1998, a year after it opened. “The funny thing is, it’s almost exactly the same,” he says.\n\nAdvertisement\n\n“I just could not believe how random it was, the whole club full of people sitting down, or dancing on the tables, and the tables were covered in ash. “It was just awesome … the place felt a bit lawless … It just felt like you could have been in Berlin and you were doing something cool.” Callander’s love of dance music came from his older brother. He recalls being 13 and hearing a DJ-mixed CD for the first time. “It became an important little totem for me, going, ‘How is the music never stopping?’” Mike Callander at lunch at Cookie in the CBD. Credit: Joe Armao Callander started making music as a teenager on his keyboard and, in the late ’90s, dove into Melbourne’s rave scene. “It was just like another world,” he says. “Pretty quickly, I was like, ‘I’ve got to be part of this somehow’.” At 18, he bought a set of turntables using money from his parents intended for a car. “They were totally pissed [off],” he says.\n\nAdvertisement\n\nHis dad eventually embraced Callander’s career choice after he started getting paid gigs in 2001. For his mum, he says, it remained “a symbol of unrealised potential” until he got a PhD in music three years ago. A 2001 photo of Mike Callander, believed to have been taken at the former Sub Club on Commercial Road, South Yarra, where the nightclub Circus now is. Callander says his first big break was getting a job DJing in 2005 at Honkytonks, a CBD nightclub that contributed heavily to Melbourne’s laneway culture before it shut in 2007. “That was like receiving a trophy,” he says. “For people of my vintage, Honkytonks was legendary. You would walk down a laneway, no idea where you’re going, and walk into a tiny club, 300 people max, with the best music.” Callander went on to play 10 summers in a row in Berlin (“the first time, I felt like I was going to the Olympics”) and has worked with Australian artists The Presets and The Avalanches. But it’s Revolver that has been his biggest career constant. It’s even where he forged a romance with his now-wife in 2012 after meeting her in a German club a year earlier. Callander plays in the back room, the best-known of the club’s two rooms with its quirky smattering of old couches and a floor-to-ceiling cage protecting the DJ booth.\n\nAdvertisement\n\n“It’s actually a really hard room to DJ at. The crowd is transient; it’s not a focused DJ-dance floor topography, it’s just people floating around everywhere. The chaos of that is what makes it awesome as well.” Vegetarian red curry with tofu, snow peas, tomato and pineapple. Credit: Joe Armao When things aren’t quite clicking, his manoeuvre is to deliver a surprise – like mixing The Nutbush or a Billie Eilish song with heavy, minimalist techno. “You may as well get more risky rather than safe,” he says. You’d be hard-pressed to find Callander’s music online. His Spotify feed is limited and, unlike most DJs, he doesn’t upload his sets to SoundCloud. “Music’s so disposable now. I’m not diluting the value of this by going, everyone can have it,” he says. “I’m so fortunate that I established myself before the influencer phenomenon ... I want to just do it and I want the room to be full.” Callander believes the secret to Revolver’s long-standing success is that between Friday night and Monday morning, party-seekers can count on the club being open.\n\nAdvertisement",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/jacks-drops-head-with-a-shocker-20260106-p5nrz5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Jacks drops Head with a shocker",
    "publish_date": "Tue, 06 Jan 2026 11:25:11 +1100",
    "category": "finance",
    "authors": [],
    "text": "Jacks drops Head with a shocker\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://au.news.yahoo.com/towns-cut-off-farmers-lose-163000593.html",
    "title": "Farmers count livestock losses as PM tours flood zones",
    "publish_date": "2026-01-06T01:17:55Z",
    "category": "finance",
    "authors": [],
    "text": "Anthony Albanese has touched down in the outback city of Mount Isa as he tours parts of Queensland hit by devastating flooding.\n\n\n\nThe prime minister will now travel to Cloncurry, where he will meet with emergency services personnel and local mayor Greg Campbell.\n\nParts of the runway at Cloncurry's airport have been destroyed by floodwaters.\n\nAbout 16,500 cattle are dead or missing in floodwaters according to farmers, sparking fears of major financial losses in the agriculture-heavy region.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe inundation has also claimed one life - a man in his 70s who was found dead in his car, surrounded by floodwaters.\n\nMr Albanese is expected to announce a multimillion-dollar rescue package for Queenslanders affected by the floods.\n\nParts of McKinlay Shire, east of Mount Isa, had seen worse flooding than in 2019, Mayor Janene Fegan said.\n\n\"A lot of locals are comparing it to the 1974 floods because of the length of time it has been going on,\" she said.\n\n\"There will be significant livestock losses and at the moment all access to roads to get out have been closed.\"\n\nLivestock stranded by floods in north-west #Queensland are being fed via emergency helicopter drops 🚁\n\n\n\nThis $2 million DRFA package from the Queensland and Australian Governments will support air delivery, backing farmers and protecting livestock. pic.twitter.com/TYQLzyTEnA — Queensland Reconstruction Authority (@QReconstruction) January 4, 2026\n\nFarmers faced a difficult wait to access flooded areas and count their lost cattle, Ms Fegan said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"It's a really difficult time mentally as well. It's not an easy task,\" she said.\n\n\"There have been a lot of choppers in the air to help move livestock to higher ground and feed them.where they can.\"\n\nFood damage to 794km of fencing and 1400km of private roads has also been reported to Queensland's Department of Primary Industries.\n\nThousands of cattle have been reported dead or missing in flood-affected areas. (James Gourley/AAP PHOTOS)\n\nRichmond Shire had not seen as big an impact as the 2019 flood but some farmers had been left with no source of income, Mayor John Wharton said.\n\n\"I've seen a lot of dead cattle. Some people have lost everything,\" he said.\n\nMeat and livestock analyst Simon Quilty said while the floods impacted livestock differently compared to the disaster of seven years ago, concerns remained of further losses.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"It's very localised, and very different to that January 2019 flood, which was far more widespread,\" he told ABC Radio.\n\n\"(The flood-affected area) is a breeding area ... they could die due to hypothermia and could take losses to greater than 50,000.\"\n\n⚠️Major Flood Warning for the Flinders and Final Flood Warning for the Cloncurry River\n\n\n\n🔴 MAJOR FLOODING CONTINUES AT RICHMOND AND WALKERS BEND\n\n\n\nWhile rainfall has eased, moderate to heavy rainfall may return toward the end of the week.https://t.co/OVuCQX3Zgu pic.twitter.com/IVueHnKgrL — Bureau of Meteorology, Queensland (@BOM_Qld) January 5, 2026\n\nHeavy rain has eased across northwest Queensland leaving widespread minor to major flooding across western and northern areas, the Bureau of Meteorology observed.\n\n\"However, even in these places where the rain might start to ease off we will continue to see riverine flooding,\" senior meteorologist Miriam Bradbury said.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n\"We may also see further rises with the arrival of upstream flows.\"\n\nNorth Queensland is also facing a potential tropical cyclone impact by the weekend.\n\nA tropical low is set to form in the northern Coral Sea and is a 35 per cent chance of developing into a cyclone on Saturday, the bureau forecast.",
    "source": "Yahoo",
    "cluster_id": 31
  }
]