[
  {
    "url": "https://www.9news.com.au/world/ranchers-in-southern-mexico-are-struggling-against-a-flesheating-parasite-infecting-livestock/4d160b20-7934-4100-b327-b832fe3566bb",
    "title": "Flesh-eating parasite hits Mexican cattle as Aussie ban on US beef lifted",
    "publish_date": "Fri, 25 Jul 2025 21:11:03 +0000",
    "category": "finance",
    "authors": [
      "Jul"
    ],
    "text": "Just as ﻿ Australia lifts its biosecurity ban on US beef , including cattle raised in Mexico and Canada but slaughtered in the States, ranchers in southern Mexico are fighting against a flesh-eating parasite infecting livestock.\n\nThe Albanese government insisted the decision was made purely for scientific reasons after a decade-long review, and not to appease US President Donald Trump, who had complained about Australia's restrictions.\n\nAt the same time, Mexican cattle has again been barred from the US ﻿over fears of the spread of the New World screwworm fly.\n\nA ranch worker drives cattle to a corral for inspection for New World screwworm at a ranch in southern Mexico. (AP)\n\nThe ﻿flesh-eating parasite burrows into animals and can cause serious to deadly damage, according to the US Department of Agriculture.\n\nIt can cause devastating impacts to livestock and is currently rapidly spreading across the southern Mexican ﻿state of Chiapas, which borders Guatemala and Central America.\n\nThe US Department of Agriculture has issued an alert about the outbreaks.\n\nMexico is building a plant with US support in Chiapas to produce sterile flies, which have proven effective at stopping the spread, but it won’t be ready until next year.\n\nMeanwhile, the price of medicines used to treat livestock infected with the screwworm has soared.\n\nThat has led some to fall back on home remedies like applying gasoline or lime to open wounds to coax out the worms.\n\nIn addition to the cost of the medicine, treatment requires careful monitoring and usually involves multiple courses.\n\nMacka's Angus Director Robert Mackenzie. (Nine)\n\nAny open wound, even very small ones, are an invitation to the fly to lay its eggs.\n\nThe outbreak comes as Australian farmers have been raising concerns about the risk of importing Mexican beef via the United States following the relaxation of biosecurity controls.\n\n\"I wouldn't think that Mexico would have the best biosecurity so why take that risk?\" Macka's Angus director Robert Mackenzie said on Thursday. ﻿\n\nThe Nationals and Cattle Australia have called for an independent scientific review of lifting the biosecurity ban.\n\n\"There is simply too much at stake when it comes to Australia's world-leading biosecurity status not to get a second opinion,\" Cattle Australia chief executive Will Evans said.\n\n\"If the department and the government are confident in that decision they've made, they have nothing to fear,\" Nationals leader David Littleproud said. ﻿\n\nUS companies wanting to export beef to Australia will need to apply for accreditation from the Department of Agriculture, which will assess whether they meet the nation's tough biosecurity standards.﻿\n\nA blanket ban was placed on beef imports from the US more than 20 years after an outbreak of mad cow disease.\n\nIn 2019, that ban was partially lifted for cattle raised and slaughtered in the US, but not for cattle raised in Canada and Mexico but slaughtered in the US – which effectively still barred American beef from Australia.﻿\n\nYesterday, the Albanese government confirmed it will lift the biosecurity restriction.\n\nAhead of Australia lifting its ban, the US has put improved cattle tracing protocols in place recently, allowing local authorities to better react to disease outbreaks.\n\nTrump reacted to the news by saying the US is going to \"sell so much to Australia\", but the Australian beef industry does not expect the foreign exports to have much impact on the domestic market. ﻿\n\nVeterinarian Alfredo Chávez is treating cases in Chiapas. (AP)\n\nMexican ranchers fight against outbreak ﻿of flesh-eating bacteria\n\nVeterinarian Alfredo Chávez left Chiapas to study in 1989, so he says he missed seeing the effects of that outbreak, but now he has seen cases multiply in his corner of the state over the past month.\n\nHe has heard of dozens of cases in the area now and treated about a dozen himself.\n\nIt’s not just cows either — sheep, pigs, cats, and dogs are targets as well.\n\nArmed with a pair of blue tweezers and an aerosol spray that helps draw the maggots out, Chávez moves from animal to animal.\n\nHe puts maggots in plastic tubes as samples, which he provides to agricultural authorities.\n\nBut beyond providing the tubes and encouraging ranchers to report cases, he said that the government hasn't provided much help.\n\n“We’ve faced it alone,” he said on Wednesday.\n\nThe US had just gradually started to reopen the border to cattle imports this month after an earlier suspension in May, when the Trump administration said that it would close it again after an infected animal was found in the Gulf coast state of Veracruz.\n\nArmed with a pair of blue tweezers and an aerosol spray that helps draw the maggots out, Chávez moves from animal to animal. (AP)\n\nWhile prevalent in Central America, the concern is that the fly is moving north.\n\nUS officials worry that if the fly reaches Texas, its maggots could cause large economic losses, something that happened decades ago.\n\nRanch caretaker Edi Valencia Santos said that Mexican government officials have come to his community to talk to people with livestock, but so far without resources.\n\nHe has had five infected animals on the ranch.\n\nDespite cattle in this region going to domestic consumption rather than to the US, the presence of the screwworm in Mexico has frozen cattle exports to the US nationwide.\n\nValencia said that he remembers the small planes distributing sterile flies during those earlier outbreaks, so is optimistic they will eventually help, but for now the costs are piling up on ranchers.\n\n“It’s a big, big problem in Chiapas,” he said.\n\nWill you buy beef imported from the US? Yes 1024 No 13700",
    "source": "9News",
    "cluster_id": 0
  },
  {
    "url": "https://www.9news.com.au/world/new-zealand-auckland-cat-leonardo-da-pinchy-stealing-underwear-clothing/c88ec1d0-bf0f-43b8-b7ea-6e887ec86f2b",
    "title": "This cat is stealing all his neighbours' undies",
    "publish_date": "Fri, 25 Jul 2025 06:49:06 +0000",
    "category": "finance",
    "authors": [
      "Jul"
    ],
    "text": "Most cat owners dread their pets bringing home mice or birds, but for the owners of one felonious feline in Auckland, New Zealand , there’s a worse shame: being the unwitting accomplice to an unstoppable one-cat crimewave.\n\nHis prolific laundry-pinching from clotheslines and bedrooms in the placid beachside neighbourhood of Mairangi Bay has turned 15-month-old Leo into a local celebrity and earned him a new moniker; he now goes by Leonardo da Pinchy.\n\nAnd he’s got expensive taste: his frequent hauls include silk boxer shorts, thick men’s work socks — preferably with clothespins still attached — and in one mortifying episode for his humans, a brand-new $NZ300 ($274) cashmere sweater.\n\nIn this photo provided by Helen North, Leo the laundry-stealing cat poses on July 24, 2024, at its home in Auckland, New Zealand. (Helen North via AP) (AP)\n\n“My daughter was at home sick and she rang me at work saying, ’It’s bad, it’s bad, this is the worst thing he’s brought in, it’s really bad,” Leo’s owner, Helen North, said\n\n“Because it was beautiful, I was like, ‘Ooh, can I keep that?’ But I couldn’t.”\n\nInstead, North turned to a neighbourhood WhatsApp group to return Leo’s stolen goods to their rightful owners; her usual message: “Are these your undies?”\n\nBut the pilfered stash kept piling up: socks (piles), underwear (loads) and even a 5-foot-long stuffed snake (bizarre).\n\nOn one record-setting day, Leo returned with nine items, enough for a full outfit if you didn’t mind a mix of everything from baby clothes to menswear.\n\n“He brought in a jersey this morning at 8:10,” North said.\n\n“The shops hadn’t even opened.”\n\nREAD MORE: Albanese launches strongest criticism yet against Israel\n\nSome of Leo's haul from his adventures. (AP)\n\nWith dozens of items unclaimed, the embarrassed owner took her search for Leo’s victims wider this month, posting photos of his hauls on a local Facebook page along with an apology and her address.\n\nThose who showed up to claim their belongings included a woman who recognised her pink and purple underpants and a boy whose beloved and missing sports jersey was helpfully identifiable by his name printed on the back.\n\nThe ire North expected over Leo's cat burgling antics didn’t eventuate — although one of his targets, who is allergic to cats, now dries her laundry indoors.\n\n“All of our neighbours think he’s amazing,” she said.\n\n“Some of them are quite put out that he hasn’t actually stolen anything of theirs.”\n\nStill, North has tried everything to curb her cat’s laundry obsession, from attempting to keep him indoors to leaving out clothes at home for him to steal. No luck.\n\nLeo sitting with some of his stolen items. (AP)\n\n“He only wants stuff that he shouldn’t have,” she said, adding that she was also unwilling to risk an online suggestion that Leo simply needed another playmate.\n\n“He might teach another cat to do this,” North said.\n\nLeo's life of crime began when he was first allowed outdoors a year ago, but his family hopes it’s just a juvenile phase.\n\n“I hope he grows out of it because I don’t want to do this for like, 15 years,” North said.\n\n“This is a lot of admin.”\n\nFor now, on the streets of Mairangi Bay, Leonardo da Pinchy remains at large.",
    "source": "9News",
    "cluster_id": 1
  },
  {
    "url": "https://www.9news.com.au/health/study-risk-broken-bones-menopause-treatment/48d2d77c-6981-46a7-8bd4-da8d40881e46",
    "title": "Stopping menopausal hormone therapy linked to increased risk of broken bones",
    "publish_date": "Fri, 25 Jul 2025 09:51:03 +0000",
    "category": "lifestyle",
    "authors": [
      "Jul"
    ],
    "text": "Women face an increased risk of broken bones in the years after stopping menopausal hormone therapy (MHT), according to a new study.\n\nMenopause, which typically occurs around the age of 51 in Australian women, marks the cessation of menstruation and can be accompanied by debilitating symptoms such as night sweats and mood changes.\n\nThe associated decline in hormone levels also elevates the risk of heart disease and osteoporosis.\n\nREAD MORE: Fresh charges laid against doctor accused of filming colleagues in toilet ﻿\n\nStopping menopausal hormone therapy linked to increased risk of broken bones (9News)\n\n\"Most women lose about 1 per cent of their bone mass per year, some can lose about 3 or 4 per cent which can eventually lead to hip fracture which can be nasty,\" Conjoint Professor John Eden from the University of New South Wales said.\n\nMHT is often prescribed to mitigate these effects.\n\nHowever, the new research, using patient data with 25 years follow-up, indicates that for many women, the risk of bone fractures increases significantly for about three years after stopping MHT, compared to women who never used the therapy.\n\n\"There was a trend a few years ago of giving bone drugs to women around menopause and they have their own side-effects and MHT is a safer option for these women,\" Eden said.\n\nStopping menopausal hormone therapy linked to increased risk of broken bones (9News)\n\nExperts say long-standing concerns about MHT and breast cancer risk are exaggerated.\n\n\"We know that MHT does not cause breast cancer, it may make an existing breast cancer appear a little bit sooner,\" Eden said.",
    "source": "9News",
    "cluster_id": 2
  },
  {
    "url": "https://www.9news.com.au/world/trump-and-powells-feud-just-exploded-into-the-public-and-then-trump-backed-off/8b4eedf0-e1b7-468f-b9c0-d025b1f3edda",
    "title": "Trump's feud just exploded into the public. And then Trump backed off",
    "publish_date": "Fri, 25 Jul 2025 02:32:13 +0000",
    "category": "finance",
    "authors": [
      "Jul"
    ],
    "text": "The look on Federal Reserve Chair Jerome Powell's face said it all.\n\nIn a press briefing Thursday afternoon, midway through a tour of the Fed's ongoing renovation project , President Donald Trump claimed that the work cost $3.1 billion — about $600 million more than its stated price tag.\n\nThe typically stoic Powell looked at Trump and began shaking his head.\n\nPresident Donald Trump, left, hands a document of cost figures to Federal Reserve Chairman Jerome Powell during a visit to the Federal Reserve, Thursday, July 24, 2025, in Washington. (AP Photo/Julia Demaree Nikhinson) (AP)\n\n\"Went up a little bit — or a lot,\" Trump said. \"And so the 2.7 is now 3.1.\"\n\nThat's when Powell couldn't hold it in any longer. The Fed chair shot Trump a quizzical look that appeared both aghast and confused.\n\n\"I'm not aware of that,\" Powell interrupted.\n\n\"Yeah, it just came out,\" Trump said, confidently, handing Powell a piece of folded paper from his inside jacket pocket.\n\nPowell donned his reading glasses and reviewed the document, trying to surmise what Trump was talking about.\n\n\"This came from us?\" Powell asked.\n\n\"Yes,\" Trump said.\n\nFederal Reserve Chairman Jerome Powell, right, and President Donald Trump look over a document of cost figures during a visit to the Federal Reserve, Thursday, July 24, 2025, in Washington. (AP Photo/Julia Demaree Nikhinson) (AP)\n\nSeven awkward seconds of silence followed, until Powell figured it out: \"Oh. You're including the Martin renovation,\" referring to a Fed building whose construction was completed in 2021. \"You just added — you just added a third building.\"\n\n\"It's a building that's being built,\" Trump said.\n\n\"No, it's been — it was built five years ago. We finished Martin five years ago,\" Powell corrected.\n\n\"It's part of the overall,\" Trump started.\n\n\"It's not new,\" Powell interjected.\n\nPresident Donald Trump, left, and Federal Reserve Chairman Jerome Powell visit the Federal Reserve, Thursday, July 24, 2025, in Washington. (AP Photo/Julia Demaree Nikhinson) (AP)\n\nThe tense moment, in which the heavily embattled Fed chair corrected the president in real time, marked an incredible show of force from a public official who has been the subject of Trump's increasingly personal attacks for years — and especially over the past several months, as Trump has lambasted Powell over high interest rates.\n\nTrump wasn't done. Asked what he'd do in his former capacity as a real estate developer when a project manager went over budget, Trump told reporters, \"I'd fire him!\"\n\nPowell, in his capacity as Fed chair, is overseeing the Fed's massive renovation.\n\nIt seemed as though Trump's scorn for Powell might have reached a tipping point. In an alpha moment, Trump even slapped Powell on the back asking him to lower rates, while chuckling. After another couple questions, the men continued their tour.\n\nBut, after the conclusion of the tour, Trump sounded a remarkably different tone. Trump said he didn't want to fire Powell because of the plan's cost overruns.\n\n\"Look, I would love to see it completed,\" Trump said when asked if he would fire Powell because of what he saw on the tour. \"I don't want to put this in that category.\"\n\nREAD MORE: At least 12 killed in deadly clashes as border dispute between Thailand and Cambodia escalates\n\nFederal Reserve Chairman Jerome Powell listens as President Donald Trump visits the Federal Reserve, Thursday, July 24, 2025, in Washington. (AP Photo/Julia Demaree Nikhinson) (AP)\n\nTrump said there was \"no tension\" between him and Powell on the tour, despite their obvious and awkward public feuding minutes earlier.\n\n\"I feel good about it,\" Trump said of the tour and his relationship with Powell.\n\n\"I mean, look I have one dispute,\" Trump added, urging Powell to lower interest rates.\n\nThe Fed has kept interest rates steady during Trump's term after lowering rates twice toward the end of former President Joe Biden's term as inflation fell.\n\nBut Powell has said that inflation may creep higher because of Trump's trade policy, and the Fed believes it is prudent to keep rates steady.\n\nCentral bank officials meet next week to discuss their next policy move.\n\nTrump has accused Powell of playing politics, an accusation that the Fed chair has routinely denied.\n\nBut Trump, in an possible show of support for Powell, said he had confidence in him.\n\n\"I believe that the chairman is going to do the right thing,\" Trump said.\n\nNevertheless, Trump maintained that he has plans to replace Powell when his term expires in May 2026.",
    "source": "9News",
    "cluster_id": 3
  },
  {
    "url": "https://www.9news.com.au/world/sydney-sweeney-us-retailer-stocks-soar-after-announcing-ad-campaign-with-euphoria-actress/dde7f694-48e6-464f-9083-f3f42d0d0fcf",
    "title": "Sydney Sweeney's Instagram post sends stock soaring",
    "publish_date": "Fri, 25 Jul 2025 02:07:01 +0000",
    "category": "finance",
    "authors": [
      "Jul"
    ],
    "text": "A US fashion brand's s﻿tock has soared after the company announced an advertising campaign with actress Sydney Sweeney.\n\nAmerican Eagle's stock jumped 12 per cent ﻿after the company announced the Euphoria actress would be featured in their new campaign.\n\nThe surge in stock added nearly $US228 million ($346 million) to its market capitalisation.\n\nREAD MORE: Australian tourist found dead in Thailand hotel\n\nA US fashion brand's s﻿tock has soared after the company announced an advertising campaign with actress Sydney Sweeney. (YouTube)\n\nSweeney announced her partnership with the brand in an Instagram post yesterday, which now has over 1 million likes. ﻿\n\nCompany shares closed more than 4 per cent higher. Financial analysts called the share price jump \"untethered from reality.\"\n\nThe brand's shares were down almost 50 per cent this year, prior to this week's pandemonium over the shares.\n\nSweeney will have her own jeans called \"The Sydney Jean\" as part of the brand's winter denim line, which will also include a limited-edition jacket.\n\nThe actress rose to fame after roles in HBO's Euphoria and Netflix's The White Lotus.\n\nAmerican Eagle stock saw a huge spike soon after the public release of the campaign. (Google Finance)\n\nSweeny has become one of the most recognisable actresses in the US. (YouTube)\n\nSweeny has become one of the most recognisable actresses in the US.\n\nShe recently broke the internet after releasing a line of soap, which contained a small amount of her bathwater.\n\nThe actress has been a part of many advertising campaigns, ﻿including for brands like Ford, Baskin-Robbins and luxury fashion brand Miu Miu.",
    "source": "9News",
    "cluster_id": 4
  },
  {
    "url": "https://www.9news.com.au/national/four-day-work-week-daniel-willis-owner-and-founder-claxon-agency-reveals-impact-of-three-day-weekends/daa0d049-1bc4-43f1-b748-6249bfb41eb0",
    "title": "'The new norm': How Daniel's staff work four days a week with no pay cut",
    "publish_date": "Fri, 25 Jul 2025 01:44:33 +0000",
    "category": "finance",
    "authors": [
      "Jul"
    ],
    "text": "Exclusive: ﻿ An Australian media boss who made the game-changing decision to permanently adopt a four-day week said job applications have skyrocketed since the news went public.\n\nDaniel Willis, founder and chief executive officer of media agency Claxon, allows his workers to take every single Friday off without lower salaries or reduced hours after a successful trial in late 2024.\n\nHe told 9news.com.au it has not only astronomically boosted interest in open roles but his employees are happier and just as productive – if not more.\n\nDaniel Willis, founder of media agency Claxon, and his team. (Supplied)\n\n\"When I get to the interview stage with candidates, one of the questions I ask them is, why Claxon, why did they apply for the role?\" Willis said in an update six months on.\n\n\"And always amongst their reasons is the four-day work week. So it's been great to help us attract new talent.\"\n\nWillis said he could only permanently introduce a Monday to Thursday week if he kept the hours the same.\n\nStaff at the independent growth agency, which has offices in Sydney, Melbourne, Brisbane and the Gold Coast, now condense their 38-hour work week across four days.\n\n\"Everybody does slightly longer days, but ultimately, because we're already a high-productivity business, it actually increases productivity,\" Willis explained.\n\n\"It allows us to keep that same amount of serviceable hours for clients, but with giving that additional day off for the team members.\"\n\nDo you have a story? Contact reporter April Glover at april.glover@nine.com.au\n\nPeople are very adaptable to new environments, Willis said.\n\nHe observed his staff become accustomed to three-day weekends quite quickly.\n\nAnd as for himself? Willis said he now couldn't imagine only having 48 hours of rest.\n\n\"It very quickly becomes a new norm and it can become hard to compare it to what they were like coming back after two days,\" he said.\n\nStudies have shown workers are happier and more productive when working four days a week. (Dion Georgopoulos)\n\n\"But I do know that everybody still loves it.\n\n\"I've never had a single staff member since we implemented the trial to ask to go back to five days. It wouldn't be a hard no, but not a single person has even murmured it or whispered it.\"\n\nAn anonymous survey during the trial period revealed some of the \"truly personal\" impacts of more time off on his employees and their families, Willis said.\n\nThe push for a nationwide four-day work week has once again gathered momentum after an international study found it made workers \"healthier, happier, more productive\".\n\nThe paper, published in Nature Human Behaviour, looked at the results of six-month trials of the shortened work week in 141 organisations in Australia, New Zealand, Canada, the UK, Ireland, and the US.﻿\n\nAn unsurprised Willis said there has been a positive outcome in every study he's seen in reducing the work week.\n\nWillis trialled a four-day week in January and permanently adopted it soon after. (Supplied)\n\n\"I haven't read one that says giving employees a four-day week makes them unhappier, makes them work less or have lower sort of productivity,\" he said.\n\n\"So that sounds exactly in line with what we've experienced at Claxon.\"\n\nAfter Finance Minister Katy Gallagher said a four-day week was \"not on our agenda\" as federal parliament returns, Willis admitted he knows why there's still a lot of resistance to this new-age model.\n\n\"I think there's still a lot of fear around it and I also believe that it's only really suitable for very structured businesses,\" Willis said.\n\n\"Trying to move a business that was fast and loose to four days might be a bit chaotic.\n\n\"But for businesses that have a strong operating rhythm and are able to effectively manage and measure the change and the impact on staff and clients, I think they've got nothing to be fearful of.\"\n\nWillis said he expects to see more and more businesses to test out four-day weeks because you \"can't put the genie back in the bottle\".",
    "source": "9News",
    "cluster_id": 5
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/wedding-record-returned-home-56-years-later/105555076",
    "title": "Vinyl record of 1969 wedding makes 10,000km journey home after 56 years",
    "publish_date": "Sat, 26 Jul 2025 01:26:52 +0000",
    "category": "finance",
    "authors": [],
    "text": "When Dorothy Nicholls married Max Samuel on January 25, 1969, a church full of friends and family heard them exchange their vows.\n\nBut there was someone else listening in the congregation that Saturday evening — a sound recordist who captured their entire wedding service on a vinyl record.\n\nNow, 56 years and 10,000 kilometres later, that record has come full circle and found its way back to the Samuel family in South Australia.\n\nMax and Dorothy's daughter, Heidi Samuel, who lives in Tailem Bend, had no idea her late parents had recorded their wedding service until she saw a Facebook post.\n\nMax and Dorothy Samuel's entire wedding service was recorded on vinyl. (Supplied: Heidi Samuel)\n\nThe post came from a stranger, Barney Tompkins, who lives in Western Australia's south west.\n\nBarney had found the vinyl recording of Max and Dorothy's nuptials in a Vinnies op shop while holidaying in Darwin.\n\nFascinated by his discovery, Barney took the record back to WA, and started his quest to locate the family of the couple whose vows were etched in vinyl.\n\n\"It piqued my interest because back in the day, long before video cameras were available, it must have been quite a special effort to have their service recorded for them,\" he said.\n\nMax and Dorothy Samuel on their wedding day in January 1969. (Supplied: Heidi Samuel)\n\nSocial media connection\n\nThanks to the power of social media, Barney was able to return the record to its rightful owner.\n\nA friend shared his original post in Adelaide, then a friend of theirs shared it, and so on, until it was eventually shared on a local residents' page and reached Heidi.\n\nWhen she saw the names of the married couple Barney was searching for — Dorothy K. Nicholls and Max S. Samuel — Heidi contacted him and claimed the record on behalf of her late parents.\n\nBarney Tompkins used social media to track down family members of the couple. (ABC South West: Jacqueline Lynch)\n\nBarney, who has a self-described passion for vinyl records, including curiosities like the Samuels' wedding recording, admitted to Heidi that he hadn't listened to it.\n\n\"It seemed a bit rude for some reason,\" he said.\n\n\"I don't know whether it's just me, but it didn't seem quite right.\"\n\nHowever, when Heidi gave him her blessing to play the record, he gave it a spin.\n\n\"It was just really, really lovely to hear the emotion in their voices, the nerves in their voices,\" Barney said.\n\n\" You can hear the children crying in the congregation. \"\n\nLoading...\n\nGetting the vinyl to South Australia presented some challenges, however.\n\n\"Sending records during the Australian summer is always a bit risky … but this one being so special, I would have hated for something to happen to it in transit,\" Barney said.\n\nHeidi hears parents' vows\n\nOnce the weather cooled down, Barney finally sent the record east.\n\nHeidi said hearing her parents saying their marriage vows was deeply emotional.\n\n\"The nervousness and the emotion in my parents' voices, it was very, very moving,\" she said.\n\nHeidi Samuel listened to the record for the first time this week. (ABC South West: Jacqueline Lynch)\n\n\"Sometimes you see your parents as a different sort of person, not actually as a young human, you know, with nerves and excitement and all that.\n\n\" With them not being around anymore, it made it even more special. \"\n\nHeidi said she planned to play the recording for her extended family.\n\n\"We'll be sharing it with my aunties. Both my mum's and dad's sisters are still alive, so we'll be sharing it with them,\" she said.\n\nMax and Dorothy Samuel's wedding record. (Supplied: Barney Tompkins)\n\nThe Darwin 'mystery'\n\nThe recording of wedding ceremonies onto vinyl records was most popular during the 1960s and 1970s, before the rise of video cameras.\n\nBut they were not commonplace, so Barney was thrilled when he found the Samuels' vinyl.\n\nAustin returns for season 2 Photo shows Characters of Austin in a pop-up book with a purple background with title Austin below in white. Tune in this Sunday at 7.30pm on ABC TV or on ABC iview.\n\nHowever, there remains a mystery about how and why the record ended up in Darwin.\n\nWhat is known is that the recording was made at the Strathalbyn Lutheran Church, about 55km south-east of Adelaide, where the Samuels were married at 6pm on Saturday, January 25, 1969.\n\nWhat happened to the record after that, and over the following 56 years, remains a mystery to Heidi.\n\n\"How it ended up in Darwin, of all places, I have no idea,\" she said.\n\n\"But it's lovely it was Barney who found it.\"",
    "source": "ABC",
    "cluster_id": 6
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/outback-air-race-mitchell-kym-purcell-honour-terry-gladstone/105543276",
    "title": "Mother-and-son duo take to the skies in honour of late father",
    "publish_date": "Sat, 26 Jul 2025 01:03:12 +0000",
    "category": "finance",
    "authors": [],
    "text": "Sitting in the pilot seat of his late father's shiny aeroplane, Mitchell Purcell is about to take off on an epic cross-country flight.\n\nHis dad, Terry, a businessman and proud grandfather, was just 53 when he died of cancer.\n\nHe had lived life to the full: riding motorbikes, travelling the world, and buying a 1980s Cessna aeroplane — the \"workhorse of the sky\".\n\n\"I first got my dad involved in flying with a Father's Day gift of a one-hour introductory flight, which he enjoyed and loved, and he ended up getting his pilot's licence,\" the 34-year-old said.\n\n\" Being in the plane next to him, I caught the flying bug and with him [now] not being around to pilot, I had to become a pilot if I wanted to enjoy the flying scene. \"\n\nIn the cockpit next to Mr Purcell is his mother, Kym.\n\nThe Purcells, from Gladstone in central Queensland, have entered the 3,881-kilometre Outback Air Race in honour of the late Mr Purcell, who competed in 2018.\n\nTerry Purcell was a loving dad and grandfather. (Supplied: Mitchell Purcell)\n\nThey are among more than 40 planes taking to the skies for the 18-day flying challenge to raise money for the Royal Flying Doctor Service (RFDS).\n\nBeginning in Yulara, in the Northern Territory, and ending in Carnarvon, in Western Australia, with pit stops in several small towns in between, competitors will cover more than 2,000 nautical miles.\n\nThe triennial event raised more than $750,000 when it was last held in 2022.\n\nKym and Terry Purcell on one of their many flying adventures. (Supplied: Mitchell Purcell)\n\nIn honour of Terry\n\nMs Purcell first took part in the competition in 2018 with her husband.\n\n\"Terry and I used to fly all over Australia,\" she said.\n\n\"When we went down past WA … to see the coastline is spectacular from a smaller aircraft because you obviously can't get as high as the big planes … and the views are magnificent.\"\n\nAt the Gladstone hangar, she held back tears as she remembered her beloved husband and explained the pride she had for her son.\n\n\"He's a good pilot and takes after his dad,\" Ms Purcell said.\n\n\"It's nice to spend that quality time … doing this together is really, really enjoyable.\"\n\nMother and son are both passionate about the Royal Flying Doctor Service cause. (ABC Capricornia: Jasmine Hines)\n\nUnder the team's name \"210 Fast & Furious\", the Purcells will fly together in Terry's Cessna 210, a six-seater single-engine plane that was built in the 1980s and has undergone a series of upgrades, including to the propeller and fuel tank.\n\n\"I can definitely see why Dad chose the Cessna … 'the workhorse of the sky' people call it,\" Mr Purcell said.\n\n\"There are newer planes you can buy that are very similar to the dimensions … but they can't carry as much.\"\n\nMr Purcell checking the aircraft's propeller. (ABC Capricornia: Jasmine Hines)\n\nMr Purcell uses the plane to travel with his young family and for work, transporting workers and equipment across central Queensland.\n\nHe is the managing director of an engineering business in Gladstone, which, among its work, services mines in the region.\n\nA passion for charity and flying\n\nOutback Air Race manager Stuart Payne said the two-week event was run by volunteers and took years of planning.\n\nHe first flew in a race in 2006 and was hooked.\n\n\"It allows you to go to places you wouldn't normally go in the outback, and you meet a lot of people both in the event and in the community,\" he said.\n\nMr Payne said, in the bush, the RFDS was life-changing for people who would otherwise not be able to access routine or emergency health care.\n\n\"We're very happy to be supporting the charity, but also as pilots and people in the aviation community, we get to tick the box of being able to indulge our passion to go flying,\" he said.\n\n\"We have a very, very high demand for the event; it sells out very quickly.\"\n\nThe Outback Air Race began in 1996 and has raised money for the RFDS ever since. (Supplied: Outback Air Race)\n\nMr Payne said the race was set up as a timed navigating trial, where pilots are challenged by having to locate and fly over particular points, such as the corner of a paddock or a tower.\n\n\"You're assessed on your ability to navigate accurately and to estimate how long it's going to take,\" he said.\n\n\"A lot of the legs are decided on the basis of a second or two of timing accuracy and typically less than 50 metres positional accuracy, so it's very competitive.\"\n\nMr Payne said, after the event, money was distributed to different RFDS divisions around the country, so participants could give back to their own region.\n\nMr Purcell said he wanted to fundraise for the RFDS as it was an important cause in Gladstone because many people in the community, including his own family, have used the service.",
    "source": "ABC",
    "cluster_id": 7
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/swimming-world-titles-australian-team-faces-new-test/105576542",
    "title": "Coach says new swimmers face 'resilience test' at world championships",
    "publish_date": "Sat, 26 Jul 2025 00:43:14 +0000",
    "category": "sports",
    "authors": [],
    "text": "The new wave of Australian swimmers faces an immediate resilience test at the world titles, head coach Rohan Taylor says.\n\nTaylor is overseeing a Dolphins team with a near-quarter of debutants, plus five new coaches, at the championships starting on Sunday in Singapore.\n\n\"We don't have a footy game every week, we go once this year,\" Taylor said.\n\n\"So we have got to make sure that they get the experience.\n\n\"Next year we will have a multiple competitions that they will be exposed to.\n\n\"But the first one is the one that will test their resilience.\"\n\nProven performers and gold-medal winners including Kaylee McKeown, Kyle Chalmers, Cam McEvoy and Mollie O'Callaghan form a core of a team including 10 world championship rookies including 16-year-old breaststroker Sienna Toohey.\n\nAnd the 10-strong coaching team under Swimming Australia's head coach Taylor has been revamped after last year's Paris Olympics with five fresh faces.\n\nTaylor was impressed with integration of the newcomers at the Dolphins' camp in Darwin before arriving in Singapore.\n\n\"Having new people come in — a quarter of the team, half the coaching staff — they slotted in really well, it was really nice to see. That is the first step,\" he said.\n\n\"The second step will be when they get into competition, obviously anything can happen.\n\n\"It's going to be how they manage themselves, manage the ups and downs that come with it.\n\n\"We have had a pretty consistent group of coaches and athletes over the last cycle that we worked with. This is just a new test for us as a leadership.\"\n\nThe titles were vital for Taylor's plans for the ultimate goal, the 2028 Olympics in Los Angeles.\n\n\"I want to be able to look at the next three years to ensure we're working on all the key things for LA,\" he said.\n\nABC Sport Daily podcast ABC Sport Daily is your daily sports conversation. We dive into the biggest story of the day and get you up to speed with everything else that's making headlines.\n\n\"I just want to know where are our gaps, where are our strengths … and what do we need to be doing about it as an organisation.\"\n\nAustralia will unveil a revamped women's 4x100m freestyle relay team on night one at the Singapore Sports Hub.\n\nThe retired Emma McKeon, and Shayna Jack, who missed selection, are missing from the relay team that won Olympic gold last year.\n\nAlso on night one, Paris silver medallist Elijah Winnington and a rejuvenated Sam Short renew rivalry with Germany's Olympic champion Lukas Martens in the men's 400m freestyle.\n\nAnd with Ariarne Titmus yet to return post-Olympics, Lani Pallister will fly the Australian flag in a highly-anticipated women's 400m freestyle boasting Canadian Summer McIntosh and American legend Katie Ledecky.\n\nMcIntosh, at Canada's trials last month, regained the 400m free world record from Titmus and also set global records in the 200m individual medley and 400m individual medley.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAAP",
    "source": "ABC",
    "cluster_id": 8
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/jy-farrar-calls-for-completion-of-halls-creek-oval-repairs/105572366",
    "title": "AFL player speaks out over delayed upgrades to Halls Creek oval",
    "publish_date": "Sat, 26 Jul 2025 00:21:04 +0000",
    "category": "sports",
    "authors": [],
    "text": "AFL player Jy Farrar has come out in support of the Halls Creek community and says it is \"ridiculous\" that the local football oval is unusable.\n\nFarrar's comments adds to mounting pressure on the Shire of Halls Creek over its incomplete football oval upgrade.\n\nThe prolonged closure of the oval, once dubbed the region's \"footy factory,\" has sparked concern from the Gold Coast Suns AFL player who got his start training on the Kimberley oval.\n\nAfter months of delays to planned works, the grounds have been left unsafe and unusable for two years.\n\nHalls Creek football star Jy Farrar made it from humble beginnings in the Kimberley town to the AFL. (Supplied: AFL Photos)\n\nFarrar grew up in Halls Creek and said there was \"no way\" he would have made it to the AFL without the oval or the community surrounding it.\n\n\"The love blossoms from there 'cause you still chase that same feeling you had when you first ran out on the ground with your mates,\" he said.\n\n\"Halls Creek, being a footy factory, we can't even do that at the moment.\"\n\nThe oval has launched the careers of more than 10 AFL and AFLW players over the past decade.\n\nThe oval reconstruction works have stalled since this photo was taken in February. (Supplied: Shire of Halls Creek)\n\nFarrar said it hurt knowing the oval had been abandoned for so long.\n\n\"It's ridiculous. With the amount of players from Halls Creek lucky enough to get on a list it's disheartening, it's a shame,\" he said.\n\n\"We want a safe area where people can come and enjoy football, and hopefully bring joy back to the town that's been missing for the last two years.\"\n\nBeyond sport, the oval has also been a hub of activity and a connection point for people.\n\n\"In Halls Creek and surrounding towns and communities, other than football there's not much going on so people look forward to footy on weekends,\" Farrar said.\n\n\"Youth crime is rising. I just think because there is no footy, kids are looking at other high adrenaline stuff to do.\"\n\nDelays 'unacceptable'\n\nThe delays are \"unconscionable\" according to former WA premier and member of the previously named North Province, Peter Dowding.\n\nThe Kimberley town of Halls Creek is obsessed with football. (ABC Kimberley: Hannah Murphy)\n\n\"[The state government] tipped half a million [dollars] into the Halls Creek council's coffers and they've not completed the job, and that's a great shame,\" he said.\n\n\" They've had problems with the contractor and … I understand contractors are not reliable but you've gotta resolve those matters promptly and not let them hang around for two years. \"\n\nThe WA government committed $595,758 to the project in 2023, as well as an additional $285,000 through the Club Night Lights Program.\n\nFormer premier Peter Dowding said it's essential the oval gets back up and running. (Supplied)\n\nMr Dowding said young people in remote areas needed activities to participate in.\n\n\"If you take away those opportunities you end up increasing levels of lawlessness,\" he said.\n\n\"I'm not saying that's applying to everybody, but it's part of the problem when young people have got nothing to do.\"\n\nMr Dowding said roll-on turf could be a \"viable alternative\" if the grass could not be grown.\n\n\"Look at Optus oval, every week there's a roll-on turf being put down there to make sure the surface is adequate,\" he said.\n\nDelay to upgrades 'disappointing'\n\nWA sport minister Rita Saffioti said she had instructed the department to work with the local shire to ensure upgrades to the oval could be delivered as soon as \"practically possible\".\n\n\"I have been made aware of the delayed progress which I understand is due to previous contractor disputes, under the work commissioned by the shire,\" she said.\n\n\"It's disappointing as the works were key in improving the grounds to the benefit of the broader community, which is why the WA government made a contribution.\"\n\nHalls Creek has developed a number of talented football players who have played in the AFL. (ABC Kimberley: Giulia Bertoglio)\n\nShire of Halls Creek CEO Sue Leonard said in a statement she understood the concerns raised by the minister regarding delays.\n\n\"We share the minister's disappointment. Unfortunately, earlier contractor disputes did impact timelines,\" she said.\n\n\"We have since taken decisive steps to address these issues and move the project forward.\n\n\"We welcome the minister's commitment to working collaboratively with the shire, and we remain focused on delivering the upgrades as soon as practically possible for the benefit of the Halls Creek community.\"",
    "source": "ABC",
    "cluster_id": 9
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/mercedes-benz-mini-citroen-australian-car-manufacturing-history/105542446",
    "title": "Back when even foreign luxury cars were Australian-made",
    "publish_date": "Fri, 25 Jul 2025 23:52:44 +0000",
    "category": "finance",
    "authors": [],
    "text": "When the final Commodore SS-V rumbled off Holden's Elizabeth production line in South Australia on October 20, 2017, it closed the book on 120 years of large-scale auto manufacturing in Australia.\n\nThe story of the Aussie-made car was most famously headlined by such celebrated names as Monaro, Torana, Falcon and Charger, along with familiar ones like Camry and Magna.\n\nThe final Holden Commodore (in Red Hot red) rolled off the factory floor at the Elizabeth plant in 2017. (Supplied: National Motor Museum)\n\nBut it was a story that also included machines often dismissed as foreign, welded and bolted together in places like Heidelberg (in Melbourne, not Germany) or Enfield (in Sydney, not Britain).\n\nFrench Citroëns, Renaults and Peugeots were assembled by Australian workers in Australian factories. So were German Volkswagens and Mercedes-Benzes.\n\nEven the comparatively less well-known Studebakers, Ramblers, Singers and Triumphs were built here in Australia as car makers sought to get around tariffs on fully imported vehicles designed to protect Australian industry.\n\nA Melbourne-assembled Renault. (Supplied: Mikee)\n\nFashionably French, from Heidelberg\n\nAmong these local \"foreign\" cars were specials unique to Australia, such as the Citroën ID19 Parisienne — a simplified version of the brand's famous DS model.\n\nMelbourne Citroën enthusiast Ferdi Saliba, who owns a black ID19 with a striking red interior, said many of his car's admirers were surprised it was essentially Australian rather than French.\n\nFerdi Saliba's Citroën ID19 was assembled in Australia. (Supplied: Citroën Car Club of Victoria)\n\n\"I recently returned from a 5,000-kilometre trip in the car to Maryborough in Queensland for a Citroën meeting,\" Mr Saliba said.\n\n\" When I stopped along the way a lot of people asked a lot of questions about it and they were really amazed it was an Australian-assembled car. \"\n\nThe ID19 was built in Heidelberg by a company called Continental & General from parts mostly produced in France but with some uniquely Australian touches.\n\nTo simplify production, and to save money, the ID19 had a traditional manual transmission (instead of the complex semi-automatic in foreign Citroëns), no power steering and locally sourced vinyl trim. It shared its assembly line with Peugeots and Studebakers well into the 1960s.\n\nThe Citroën ID19's vinyl upholstery was all Australian. (Supplied: Ferdi Saliba, Citroën Car Club of Victoria)\n\nCuriously, the simplicity of these Australian Citroëns (and their rarity) make the ID19s highly sought after by modern collectors.\n\n\"That particular model, without all those bells and whistles, is easier to maintain from an enthusiast perspective, and they are becoming rarer and rarer,\" Mr Saliba said.\n\n\"There aren't that many left in good condition.\"\n\nAnother Australian car maker, Australian Motor Industries, assembled Triumphs, Ramblers and Mercedes-Benz cars in Port Melbourne in the 1950s and 1960s from complete knock down (CKD) kits, comprising components delivered from suppliers worldwide.\n\nThe Benzes included flagship models such as the sophisticated 220S Ponton.\n\nNewcastle Benz enthusiast Ian Hemphill admitted he got a kick out of telling other Mercedes owners his was not put together in Stuttgart.\n\nIan Hemphill with his made-in-Melbourne Mercedes-Benz 220S Ponton. (Supplied: Ian Hemphill, Mercedes-Benz Classic Car Club Newcastle)\n\n\"People are always surprised to hear that this flagship Mercedes, the first of the S Class series, was actually assembled in Melbourne,\" Mr Hemphill said.\n\n\" At 66 years old, 'Bertha' as we call her, is still a delight to drive. \"\n\nA 'people's car' for Australia\n\nVolkswagens weren't merely assembled in Clayton, they were truly Australian-made cars, put together with Australian-made panels and parts between 1960 and 1967 before the brand reverted to CKDs in the late 1960s and early 70s.\n\nA Volkswagen Beetle built in Clayton, Victoria in 1966. (Supplied: Club VeeDub)\n\nClub VW editor Phil Matthews said older members of the official Australian Volkswagen car club were mostly aware of the brand's local history but younger enthusiasts were often very surprised.\n\n\"Aussie VWs of the 1960s were quite different from their German, American and British cousins,\" Mr Matthews said.\n\n\"In June 1954, Martin and King Pty Ltd of Clayton, Victoria, a railway carriage manufacturer and car body works, began assembly of the first VW CKD packs.\n\n\"The Victorian and federal governments of the time offered tax concessions for locally made cars, which would make any Australian-assembled VWs cheaper than full imports,\" Mr Matthews said.\n\n\"The Menzies government protected the local car industry with a new 30 per cent tax hike on fully imported vehicles so there were plans to add as many Australian-made parts as possible.\n\n\"By 1959 VW ended importing CKD kits as full-scale manufacturing began at Clayton [of] up to 90 cars per day with up to 75 per cent local content.\"\n\nCompetition from other brands (including Mini) and an inability to update new models out of Germany saw Volkswagen revert to assembly of CKD kits in 1968.\n\nNissan (then branded as Datsun in Australia) bought the Clayton plant in 1975, building its own cars alongside the Volkswagens and Volvos, the three brands' cars even sharing the same paint palette.\n\nHillmans, Hunters and Singers, meanwhile, were once built in the Melbourne suburb of Noble Park until 1965.\n\nGoggomobil Darts were made in Punchbowl, Sydney, from 1959 to 1961.\n\nPeugeot 403 assembled in West Heidelberg. (Supplied: Paul Watson, Peugeot Car Club of Victoria)\n\nEnd of the line\n\nUltimately, the comparatively small size of the Australian domestic car market and the high cost of manufacturing compared with many countries in Asia, combined with a steady reduction in import tariffs, doomed the Australian-made and assembled car.\n\nBrands like Toyota, Nissan, Mitsubishi, Chrysler and Ford maintain a strong sales and engineering presence in Australia long after car assembly ended here.\n\nFord Australia has a Regional Product Development Centre at the site of its former factory in Broadmeadows in Melbourne's north.\n\nThis centre developed the Ford Everest mid-size SUV, built in Thailand and sold throughout Asia.\n\nOthers brands have disappeared entirely.\n\nAll that remains of a national car manufacturing industry that once produced hundreds of thousands of cars, utes and SUVs each year, and which ranked in the top 10 car makers worldwide in the 1970s, are a handful of small-scale vehicle producers, defence vehicle manufacturers, and heavy vehicle brands (including: Kenworth, Mack and Volvo) which still assemble trucks in Australia.\n\nRenaults were once built in Heidelberg, Melbourne. (Supplied: Mikee)\n\nThose 'other' Aussie cars\n\nAmong the scores of brands and models once assembled in Australia are many rarely thought of as Aussie cars:\n\nCitroën\n\nFerdi Saliba's 1962 Citroën ID19 Parisienne was built in West Heidelberg in Melbourne. (Supplied: Ferdi Saliba, Citroën Car Club of Victoria)\n\nCitroën built a modified version of the classic DS in West Heidelberg, Melbourne, from 1960 to 1966.\n\nDatsun\n\nA 1974 Datsun 120Y coupe. (Wikimedia Commons: Datsun 120Y, OSX)\n\nNissan and Datsun-branded models were assembled in Sydney then built at Clayton, Melbourne, between 1960 and 1992 in the factory previously owned by Volkswagen.\n\nGoggomobil\n\nBill Buckle (Buckle Motors) with an orange Goggomobil Dart. (Supplied: Goggomobil Register of Australia)\n\nThe famous Dart was developed in Australia and produced by Buckle Motors in Punchbowl, Sydney, from 1959 to 1961. About 700 were built.\n\nHillman\n\nA 1957 Hillman Minx alongside a 1962 Hillman Australian Deluxe. (Supplied: Hillman Owners Club of Australia)\n\nRootes Australia was an affiliate of Rootes Group in Britain, which produced Hillmans, Hunters and Singers from CKD kits in Port Melbourne from 1946 until 1972.\n\nMercedes-Benz\n\nA Mercedes-Benz 220S Ponton assembled by AMI in Port Melbourne. (supplied: Ian Hemphill, Mercedes-Benz Classic Car Club Newcastle)\n\nAustralian Motor Industries assembled several Mercedes-Benz models from 1959 until 1965 in Port Melbourne, including the top-of-the-range 220S.\n\nMini Cooper\n\nA 1972 Leyland Mini Clubman. (Supplied: John Holloway)\n\nProduction of the Mini began in Enfield, Sydney, in 1961. An Australian Mini Cooper S won Bathurst in 1966. Production ended in 1978.\n\nPeugeot\n\nAn Australian-assembled Peugeot 403. (Supplied: Paul Watson, Peugeot Car Club of Victoria)\n\nPeugeot 203s were assembled in Sydney and Melbourne from 1953, along with the 403, 404 and 504 models. The 404, 504 and 505s were built alongside Citroen and then Renault models in Heidelberg.\n\nRambler\n\nA 1971 Rambler Hornet on display at the Gippsland Vehicle Collection. (Supplied: Chris Henry)\n\nVarious Rambler models were assembled by Australian Motor Industries at Port Melbourne between 1954 and 1978, well after the brand was retired in the United States in 1969.\n\nRenault\n\nA Renault 16. These small four-door cars were made in Heidelberg West. (Wikimedia Commons: Renault 16, OSX)\n\nRenault bought Continental & General's Heidelberg factory in 1966, building Renault 10, 12, 16 and 18 model cars there until 1981.\n\nStudebaker\n\nA 1964 Studebaker Cruiser wagon converted into an ambulance by Schubert and Staff in Sale. (Supplied: Chris Henry)\n\nAn American brand built first in Sydney and then in Heidelberg until 1966.\n\nVolkswagen\n\nA 1963 VW Deluxe Microbus. Volkswagen's Clayton factory produced the Kombi and Country Buggy. (Supplied: Club VeeDub)\n\nClayton was home of Volkswagen production from 1960 until 1976. Volkswagen was Australia's third-largest producer in the early 1960s behind only Holden and Ford.\n\nVolvo\n\nA 1978 Volvo 244 DL. (Wikimedia Commons: Volvo 244 DL, OSX)\n\nThe Swedish brand assembled cars alongside Volkswagens and Nissan-Datsuns at Clayton from 1972 until 1988, and still builds trucks in Wacol, Brisbane.",
    "source": "ABC",
    "cluster_id": 10
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/hottest-100-australian-songs-triple-j-live-updates/105568616",
    "title": "Live: Hottest 100 of Australian songs has begun, but who will be #1?",
    "publish_date": "Fri, 25 Jul 2025 23:29:06 +0000",
    "category": "entertainment",
    "authors": [
      "Dan Condon",
      "Velvet Winter",
      "Al Newstead"
    ],
    "text": "What's the best Australian song of all time?\n\nIt seems like an impossible question but it's the one triple j and Double J are asking the good people of this beautiful country.\n\nWill Powderfinger's happiness be slowly coming back? Maybe The Veronicas won't be untouched?\n\nJoin us as we count from #100 all the way down to the #1 Australian song, as voted by you!\n\nHow to listen:",
    "source": "ABC",
    "cluster_id": 11
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/banking-in-the-bush-regional-banking-solutions-community-banking/105573148",
    "title": "Regional towns look for solutions as Bendigo Bank closes agencies",
    "publish_date": "Fri, 25 Jul 2025 23:17:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Since Bendigo Bank announced it will be closing 28 agency services across the country, residents in the small town of Cunderdin, 160 kilometres east of Perth, face the prospect of a 120km round trip for some banking services.\n\nBendigo Bank's decision has left Cunderdin Shire president Alison Harris \"hugely concerned and deeply disappointed\".\n\nAlison Harris says banks are vital in small communities. (Supplied: Shire of Cunderdin)\n\nThe agency was run out of the town's co-op service and was set up after Westpac left town.\n\nCr Harris said many people transferred to Bendigo Bank at the time and now faced the prospect of having to transfer again.\n\n\"A bit like doctors and grocery shops, the bank is vital in a small community,\" she said.\n\n\" The crux of it is that Bendigo Bank markets itself as a community bank, and we just feel that this is not a community decision at all. \"\n\nIn a statement, Bendigo Bank said it would shut down its agency model across 28 locations by October, citing \"decreasing customer use\".\n\nThe bank's service in Cunderdin provided the community with cash, floats for the footy, and other general banking.\n\nResidents' closest branch will now be either the town of York or Northam — a nearly two-hour round trip.\n\nBendigo Bank said customers would be connected with their closest alternate service.\n\nThe Cunderdin Bendigo Bank agency is one of 28 set to shut its doors. (Supplied: Samantha Pimlott)\n\nCr Harris said the decision to shut the Bendigo Bank agency would have ripple effects despite the town being able to access post office banking services.\n\n\"And once people do travel out of town, they may shop out of town, they may go to the doctor out of town,\" she said.\n\n\" So it's just further pulling away services that we want to provide in town. \"\n\nCr Harris said that while some physical locations might be unprofitable for banks, she was concerned about elderly residents who lacked the digital know-how to conduct their banking online.\n\nBanking in the bush\n\nIt is a problem the founders of the Indigenous-owned Traditional Credit Union (TCU) encountered 30 years ago in the Northern Territory as the big banks started to leave.\n\nTraditional Credit Union is the only Indigenous-owned credit union in Australia. (Supplied: Traditional Credit Union)\n\n\"If you go into any community that has lost a bank, they will tell you exactly how devastating it is,\" TCU CEO Simon Lyons said.\n\nThe credit union was formed on the island of Milingimbi after remote communities in the Top End had no access to banking facilities.\n\nSimon Lyons with Traditional Credit Union staff on the Tiwi Islands. (Supplied: Traditional Credit Union)\n\n\"Big banks have got shareholders and they've got to answer to them,\" he said.\n\n\"It's costly to operate in remote communities.\n\n\"It's very difficult, particularly up here in the Northern Territory, where a number of these communities are cut off in the wet season and access to them is limited quite often to fly-in.\"\n\nThe Traditional Credit Union has a remote branch at Wurrumiyanga. (Supplied: Traditional Credit Union)\n\nMr Lyons said communities suffered when banks pulled out, and getting cash into those areas could become difficult for local businesses and groups.\n\n\"If you're trying to run a sausage sizzle at the football and you're collecting cash, you've got to have a place to put it, to be able to bank that cash,\" he said.\n\n\"It sounds like a minor thing, but it is actually a major thing, along with the ability to actually go and talk to someone.\"\n\nSimon Lyons with Bunug Galaminda, who is on the Traditional Credit Union board of directors. (Supplied: Simon Lyons)\n\nCash still essential\n\nMr Lyons said services, such as opening or cancelling accounts or handing deceased estates, could only happen in branches, and closing locations could impact local jobs.\n\nHe said the community banking model worked, but also needed support.\n\n\"We're the smallest bank in the country, but we're regulated in exactly the same way as a Commonwealth Bank or a National Australia Bank,\" he said.\n\n\"That regulation and compliance with that regulation come at a cost, and it isn't proportional.\"\n\nMr Lyons said smaller banks like TCU had the same regulatory requirements and the same cost impost without the same revenue flows and profit.\n\nIn February this year, Treasurer Jim Chalmers announced a moratorium on regional banking closures from the big four banks until July 2027.\n\nBanks were also asked to increase their \"commitment to and investment in regional banking\", with Bank@Post, that is banking at a post office, being one of the preferred options.\n\n\"I think government and others are recognising firstly that cash is an essential service and banking is also an essential service,\" Mr Lyons said.\n\n\"Communities, despite their remoteness or the fact that they are regional, shouldn't be deprived of that.\"\n\nBanks and councils\n\nOne solution that border communities in Victoria and New South Wales have adopted is the partnership between smaller banks and councils.\n\nHume Bank has partnered with Hume Council since 2005 and runs a branch inside the council office in Holbrook, New South Wales.\n\nHume Bank's CEO, Stephen Capello, said residents in Holbrook would have to drive 45 minutes to the next town after the last bank closed down.\n\nStephen Capello says regional Australia needs a socially responsible banking industry. (Supplied)\n\nHe said while customer behaviour was evolving, regional communities were seeking \"equitable banking services\" alongside their metro counterparts.\n\n\"[There is a] strong belief that these services are required to underwrite the future of these small towns,\" he said.\n\n\"I think regional Australia needs a socially responsible banking industry, and that needs to reflect some of the heavy lifting that small regional banks and community and customer banks are doing at the moment.\"\n\nIn a statement, the Finance Sector Union said it had \"deep concerns\" about banks \"unilaterally\" making significant cuts to their service and regional communities.\n\nThe union said it was continuing to pressure the federal government on the issue of regional banking.\n\nThe union's assistant national secretary, Nicole McPherson, said it had been 14 months since a Senate inquiry handed down a report calling for banking to be regulated as an essential service.\n\n\"It is critical that the federal government step in and protect bank workers and customers, given that the banks have proven themselves to be incapable of doing anything other than putting profits and shareholders first,\" she said.\n\nThe Australian Banking Association declined to comment.",
    "source": "ABC",
    "cluster_id": 12
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/tasmania-crossbench-minority-government-priorities/105573822",
    "title": "These crossbenchers will be key in deciding the next government of Tasmania",
    "publish_date": "Fri, 25 Jul 2025 22:51:19 +0000",
    "category": "finance",
    "authors": [],
    "text": "Tasmania has elected another large crossbench that once again might equal or outnumber Labor Party members.\n\nRegardless of which major party forms government, they will need support from some or most of these politicians.\n\nDean Winter and Jeremy Rockliff will have to listen to the views of the crossbench if they are to successfully form a minority government. (ABC News)\n\nThe Liberal Party has the easier job when it comes to making up the numbers, but Labor has more in common with them.\n\nWith negotiations underway, most of the independents are keeping tight-lipped on what they might be seeking, so what do we know about their priorities?\n\nKristie Johnston\n\nKristie Johnston was first elected as an independent in the 2021 election.\n\nThis time around, she's had a massive swing towards her.\n\nMs Johnston has been a fierce anti-stadium critic and has regularly raised concerns about the impact of pokies on her constituents.\n\nShe even introduced a bill to the last parliament that would've forced gambling companies to repay money that had been stolen to put through poker machines.\n\nKristie Johnston wants to see a 'realistic plan' from both leaders. (ABC News: Kate Nickels)\n\nShe's also used her time in parliament to raise awareness about the greyhound racing industry, and push for greater transparency and accountability around a range of issues including the budget and the stadium.\n\nMs Johnston said the state has some very big decisions in front of it, and she wants to understand what the leaders are offering, particularly when it comes to budget repair.\n\n\"What I want to see is someone after the election, after listening to what the people have said, is to come up with a clear plan,\" she said.\n\n\"Treasury in their own PEFO report have indicated that we need to look at a number of factors to address the budget crisis.\n\n\"The expenditure side, but also the revenue side, and they simply said looking at economic growth is not going to be enough to fix the issue.\n\n\" I want to see a realistic plan from both leaders. \"\n\nCrossbench MPs expected to hold power after Tasmanian election Photo shows A Parliament House in the early morning sun. All published polls indicate a hung parliament is the most likely result of Saturday's Tasmanian state election — who are the potential crossbenchers and what do they want?\n\nSpeaking on election night, Ms Johnston said she wanted the major parties to do a better job at listening to and collaborating with the crossbench.\n\n\"I want to be seeing a change in attitude. We can't have a minority parliament where the governing party try to pretend that they're in majority. That does not work,\" she said.\n\n\"We need to see a respectful mature parliament that's respectful of everyone's voices.\"\n\nShe has confirmed she would not want a ministry in a power-sharing government.\n\nPeter George\n\nPeter George is best known as an anti-salmon campaigner, having been the spokesperson for Neighbours of Fishfarming for years.\n\nWhile he leant into his anti-salmon reputation during the campaign, it certainly wasn't the only thing he spoke about.\n\nHe was vocal in his opposition to the proposed Macquarie Point AFL stadium, and rolled out a variety of policies addressing concerns about health, housing and education.\n\nPeter George is known for his opposition to salmon farming. (ABC News: Ebony ten Broeke)\n\nLike most of the independents and The Greens, Mr George wants to see a strengthened Integrity Commission with public hearings.\n\nHe also wants to end native forest logging, crack down on short-stay accommodation, and address the state's soaring debt.\n\n\"We have 5,000 people in this very small state … waiting to get decent roofs over their heads, we have a health system that's sort of tottering and teetering under the weight of demand, and we have an education system that's turning out functional illiteracy of somewhere close to 50 per cent.\n\n\"Those are important things that we need to deal with.\n\n\"I want to hear about that, and I want to see a parliament of 35 people roll up their sleeves and do some serious work across political lines.\"\n\nAnother bizarre election night result in Tasmania Photo shows Caucasian man in suit with short hair stands at podium making speech with family behind him, looks optimistic In another strange election night result, the Liberals claim victory while Labor, despite a poor showing, could still negotiate its way to government.\n\nMr George said he wants to hear what the parties' plans are for \"rebuilding Tasmania's future\" but so far his dealings with them have not won him over.\n\n\"One area of concern is that Labor and Liberal seem to have drawn lines in the sand saying we won't talk about this, we're going to insist on that,\" he posted on a video on Facebook.\n\n\"Well, that's not how minority government works, that's certainly not how collaboration works, so slight warning there, but we'll deal with this down the track.\"\n\nCraig Garland\n\nNorth West coaster Craig Garland received a massive jump in his primary vote this election.\n\nThe fisherman was perhaps best known for his views on salmon farming before he was elected to parliament in 2024 — and he has certainly peppered the government with a lot of questions about the industry.\n\nBut he has also spoken out on integrity and was so concerned about the budget, he was prepared to vote against it.\n\nCraig Garland wants to be a part of budget repair and policy development. (ABC News: Ebony ten Broeke)\n\nThis time around, Mr Garland wants a seat at the table. He wants to be included in budget repair and the development of policy.\n\nSpeaking on election night, Mr Garland said \"the focus has to flip\".\n\n\"The most essential basic services for the most needy organisations are being ignored. I'm not going to back down on that,\" he said.\n\n\"The domestic violence in the North West Coast. We have four beds to deal with women fleeing domestic violence. One hundred and fifty women turned away, 147 children, and we're talking about building the biggest stadium.\"\n\nLoading...\n\nMr Garland has spoken to both leaders but has yet to discuss any sort of policies or requests.\n\n\"There's a lot of talk, and then in the same breath I hear, 'We're not moving on salmon, we're not moving on native forest logging,'\" he said.\n\n\" That's not how you come into conversations. Compromises and finding common ground is just that. \"\n\nMr Garland is opposed to Hobart's waterfront stadium, which likely helped his vote in the seat of Braddon, and he is no fan of the proposed undersea electricity and data interconnector between Tasmania and Victoria, known as Marinus Link.\n\nDavid O'Byrne\n\nA Labor Party veteran turned independent, David O'Byrne managed to make it work during the last parliament with Liberal leader Jeremy Rockliff's minority government.\n\nHe was one of the few crossbenchers who did not support the no-confidence motion in the premier.\n\nSpeaking after the election about his dealings with the leaders, Mr O'Byrne said he is \"not a transactional politician\".\n\nDavid O'Byrne has called on his fellow crossbenchers to respect the major parties and the vote they received. (ABC News: Luke Bowden)\n\nHe does not have \"a shopping list of issues\" and is instead focused on who could offer the most functional parliament.\n\n\"My view is we need to get on with governing, we need to find someone who can not only get the numbers on the floor of parliament for the first vote, but can sustain those numbers for a long period of time,\" he said.\n\n\" Independents need to be respectful of the fact that close to 70 per cent of people voted for one of the three major parties, so it's not about coming to the table demanding X and Y. It's about how can we make this work. \"\n\nIn terms of his core issues, they are unsurprisingly Labor core issues — health, housing and the cost of living.\n\nIn the last parliament, he spent a lot of time questioning the government about the ongoing staffing and reliability issues facing Metro Tasmania, various women's healthcare issues, and TasNetworks' wage negotiations.\n\nHis bill to amend the Family Violence Act to include the abuse of animals passed parliament last year. He also tabled a bill to introduce Industrial Manslaughter laws, but it was superseded by Labor.\n\nMr O'Byrne is the only crossbencher who supports the stadium.\n\nThe Greens\n\nThe Greens are the party neither the Liberals, nor Labor, wants to deal with — but having won five seats, they may not be easily ignored.\n\nGreens leader Rosalie Woodruff has made it clear that in a balance of power situation, she would do all she could to stop the stadium from being built.\n\n\"The Greens have stood so strongly to fight for people to oppose the stadium, put the money into health and housing and protect the environment, that is where we're going into any conversation to talk about those issues,\" Dr Woodruff said.\n\n\"We've been really strong. We're going to fight and do everything we can to pile on the pressure to stop this stadium.\n\n\"We know that's what's needed. The budget's in a desperate situation. We will not support cuts to essential services.\"\n\nGreens leader, Rosalie Woodruff says the party will do everything it can to stop the proposed stadium. (ABC News: Owain Stia James)\n\nOther things on the Greens' agenda include a strengthened Integrity Commission, something Labor has voiced support for in the past, and they want to see a Treaty with Tasmania's First Nations, another policy Labor is on board with.\n\nThey are also likely to try and seek some improvement for renters while clamping down on short stay accommodation.\n\nThe party also wants to keep pushing the major parties to find new revenue for the budget. They would like to see salmon farming companies pay some royalties for the use of Tasmania's waterways, and increased mining royalties to bring Tasmania into line with other jurisdictions.\n\nThe Greens will not hold the balance of power if the Liberals form a minority government as there will be at least four other crossbenchers they could rely on to get votes through.\n\nLabor will likely have to deal with the Greens, if it wants to govern with just 10 of its own MPs, but it will need some form of confidence and supply guarantee from the minor party.\n\nThat does not mean there will necessarily be any trade on policy or concessions from Labor, but the two parties did combine forces several times in the last parliament to pass their own legislation, including introducing Industrial Manslaughter laws and lowering the political disclosure threshold to $1,000.\n\nCarlo Di Falco\n\nAs counting continues in the state election, Shooters, Fishers and Farmers candidate Carlo Di Falco does not even know if he has been elected in the seat of Lyons, but that hasn't stopped him from getting calls from the two major party leaders.\n\nHe describes himself as a \"former blue collar worker\" and \"not much of a public speaker\".\n\nMr DI Falco said that, like the name suggests, he will be fighting for the rights of rural Tasmanians.\n\nCarlo Di Falco says the lack of reliable phone coverage is a big issue. (ABC News: Andrew Walton)\n\n\"The phone coverage of a lot of the Tasmanians that are missing out. Even where I live in Forcett, not that far from Sorell, I've got really patchy coverage where I am,\" he said.\n\n\"We need to improve that.\"\n\nMr Di Falco said there were also a lot of issues with \"social cohesion\".\n\n\"That's why I'm pushing for more funding for Neighbourhood Houses because sometimes when people's lives go to custard, probably the best place to go is somewhere where you can talk to somebody in the community.\"\n\nMr Di Falco is pro development but he is not too keen on the proposed AFL stadium on Hobart's waterfront.\n\n\"I think it's a bad idea, and as far as I'm concerned if the stadium's being sold on the basis that it's going to be a money-making exercise, and economists have said no it won't be, I believe we should wait for due process,\" he said.\n\n\"I'd be taking that money and increasing Hydro storage. If you want to increase wealth, that comes off the back of cheap, reliable energy.\"",
    "source": "ABC",
    "cluster_id": 13
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/venezuelan-baseball-team-denied-entry-to-compete-in-usa/105576414",
    "title": "'It is a mockery': Champion junior baseball team denied entry to the US",
    "publish_date": "Fri, 25 Jul 2025 22:41:21 +0000",
    "category": "sports",
    "authors": [],
    "text": "A Venezuelan junior baseball team was denied visas into the United States and will miss this year's Senior Baseball World Series, Little League International confirmed on Saturday morning (AEST).\n\nThe Cacique Mara team, from Maracaibo in Venezuela, was scheduled to participate in the tournament after winning the Latin American championship in Mexico.\n\n\"The Cacique Mara Little League team from Venezuela was unfortunately unable to obtain the appropriate visas to travel to the Senior League Baseball World Series,\" Little League International said in a statement, adding that it was \"extremely disappointing, especially to these young athletes\".\n\nThe Venezuelan team travelled to Colombia two weeks ago to apply for their visas at the US embassy in Bogotá.\n\nThe embassy did not immediately respond to an Associated Press request for comment.\n\n\"It is a mockery on the part of Little League to keep us here in Bogotá with the hope that our children can fulfil their dreams of participating in a world championship,\" the team said in a statement.\n\n\"What do we do with so much injustice, what do we do with the pain that was caused to our children?\"\n\nVenezuela is among a list of countries with restrictions for entering the US or its territories. President Donald Trump has banned travel to the US from 12 other countries, citing national security concerns.\n\nEarlier in the month, the Cuban women's volleyball team was denied visas to participate in a tournament in Puerto Rico, while a high-profile Mexican boxer was arrested by ICE and deported.\n\n\"They told us that Venezuela is on a list because Trump says Venezuelans are a threat to the security of his state, of his country,\" said Kendrick Gutiérrez, the league's president in Venezuela.\n\n\"It hasn't been easy, the situation; we earned the right to represent Latin America in the World Championship.\"\n\nThe Senior League Baseball World Series, a tournament for players aged 13-16, is played each year in Easley, South Carolina. It begins Saturday night (AEST).\n\nThe tournament organisers replaced the Venezuelans with the Santa Maria de Aguayo team from Tamaulipas, Mexico, the team that was a runner-up in the Latin American championship.\n\n\"I think this is the first time this has happened, but it shouldn't end this way. They're going to replace us with another team because relations have been severed; it's not fair,\" Gutiérrez added.\n\n\"I don't understand why they put Mexico in at the last minute and left Venezuela out.\"\n\nConcerns are rising about how the US will treat visiting countries for the 2025 FIFA World Cup and the 2028 Olympics.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 14
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/taswater-price-hike-pros-and-cons/105574366",
    "title": "What benefits will Tasmanians see from a controversial hike in water bills?",
    "publish_date": "Fri, 25 Jul 2025 22:27:55 +0000",
    "category": "finance",
    "authors": [],
    "text": "Water is the \"lifeblood\" of Mowbray Golf Club's popular greens and fairways.\n\nSo a new proposal to hike the cost of water bills across Tasmania has only added to general manager Hayden Roberts's list of concerns.\n\n\"It is a large budget line every year and we're constantly looking at ways of saving water,\" he said.\n\nMowbray Golf Club's Hayden Roberts is \"pretty concerned\" about the price rises. (ABC News: Emily Smith)\n\nThe economic regulator is set to assess a controversial proposal by TasWater to increase water bills by about 35 per cent between 2026 and 2030.\n\nPitched as an overdue revenue raiser to improve the state's deteriorating sewerage network, the bid has been criticised by residents, politicians and the peak body for social services.\n\nHowever, the move has been supported by leaders of local government.\n\nSouthern Midlands Councillor Tony Bisdee said the \"end game\" would be worthwhile.\n\n\"It might be a decade or more away, but there's so many plants to be replaced and modernised, and make them compliant with the modern-day standards,\" he said.\n\nA member of the TasWater Owners' Representative Group, Cr Bisdee said he sympathised with residents and business owners who were concerned about the proposal, which comes during a cost-of-living crisis.\n\nTony Bisdee says inflation has made the proposed hikes larger than expected. (Supplied)\n\nBut he said inflation had effectively forced the company's hand, with material costs soaring in recent years.\n\n\"This is something that's higher than I expected,\" Cr Bisdee said.\n\n\"But it just reflects the period which we've gone through, and which TasWater has to go through to make their treatment, plants, water and sewage compliant with EPA and community standards.\"\n\nThe company said it needed to make $1.7 billion worth of upgrades for its infrastructure to be up to scratch.\n\nWhat will the $1.7 billion be spent on?\n\nTasWater said dozens of treatment plans were of \"high-risk\" to the environment, with only 9 per cent compliant with \"all environmental licence conditions\".\n\nIt also pointed to failing and underperforming water and sewerage infrastructure across the state.\n\nMore than $600 million has been flagged for environmental protection, including the Selfs Point Sewer Transformation Project in Hobart and the Launceston Sewerage Transformation Project.\n\nUpgrades underway at TasWater's Self's Point sewerage treatment plant in Lutana. (ABC News: Luke Bowden)\n\nTasWater said these projects will \"greatly improve environmental outcomes in the Derwent and Tamar estuaries\".\n\nMore than $360 million will be invested in upgrading Hobart's Ridgeway Dam and Pet Dam in Burnie, with $100 million earmarked for a dedicated program to reduce water leakage.\n\nThe company's general manager of customer and community, Matt Balfe, said it was aiming to \"short-circuit a cycle of underinvestment\" into key infrastructure which, prior to July 2009, was managed by Tasmania's local governments.\n\nWork continues on TasWater Self's Point sewerage treatment plant. (ABC News: Luke Bowden)\n\nCr Bisdee said, at the time, many of these councils were \"not in a financial position\" to fund the upgrades, the consequences of which were now being felt.\n\n\"And if they did, the rates would have been gone through at a much higher regime than even what's proposed at the moment,\" he said.\n\nIf 'development is wanted, infrastructure is needed'\n\nThe state government has a 10 per cent stake in TasWater, which is majority owned by the 29 local councils.\n\nLiberal MP Felix Ellis said the proposed price rise was \"very disappointing\" and \"not acceptable\" given the rising cost of living.\n\nHowever, questions about the possibility of a Liberal government legislating a cap on price increases went unanswered.\n\nLocal Government Association of Tasmania president Mick Tucker supported the TasWater proposal, saying it was necessary to boost the state's housing supply.\n\n\"We've got infrastructure around Tasmania that was built for another era,\" he said.\n\nMick Tucker, the President of the Local Government Association of Tasmania says the hikes are needed for the state to increase development. (ABC News: Emily Smith)\n\n\"If we want large developments of housing, we have to have the infrastructure.\"\n\nHowever, the thought of higher water bills looms large in the mind for many across the state.\n\nGolf club and restaurateur shocked by proposal\n\nMowbray Golf Club's Mr Roberts already pays TasWater about $18,000 every year.\n\nHe said the club's fixed line connection was an \"insurance policy\" in the event of drought, with most of the club's water sourced from dams.\n\nAs he wades through the TasWater proposal, Mr Roberts said he was \"pretty concerned\" by the prospect of any price increase.\n\nMr Roberts said, after relocation, cost-of-living was the second largest reason for members leaving the club.\n\n\"Rates have recently gone up, water looks like it's going to go up, insurance goes up,\" he said.\n\n\"The golf club is currently in a good spot, but these things are very tenuous.\"\n\nLaunceston business woman Karen Burbury says planning should have been done better to avoid such significant hikes. (Supplied)\n\nLaunceston restaurant owner Karen Burbury said she was \"definitely shocked\" by the proposal.\n\nMs Burbury said she now faced the prospect of having her $9,000 annual water bill rise by almost $3,600 by 2030.\n\n\"I absolutely understand the infrastructure needs to be upgraded,\" she said.\n\n\"But they should have been able to look at their business more thoroughly and plan it so the rate hike wouldn't hit consumers as hard.\"",
    "source": "ABC",
    "cluster_id": 15
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/romance-was-born-photo-installation-national-portrait-gallery/105575726",
    "title": "Gallery installation pays tribute to Aussie fashion house loved by celebs",
    "publish_date": "Fri, 25 Jul 2025 22:04:44 +0000",
    "category": "lifestyle",
    "authors": [],
    "text": "Two Australian fashion designers are the focus of a new \"opulent, big, and unique\" photographic installation at the National Portrait Gallery in Canberra.\n\nAnna Plunkett and Luke Sales are the minds behind Romance Was Born, a fashion house founded in 2005 and loved by the likes of Cate Blanchett and Niki Minaj.\n\nIn the 20 years since it was founded, the brand's garments have been shown at the Metropolitan Museum of Art in New York and are held in several national costume and textile collections.\n\nAnna Plunkett and Luke Sales founded Romance Was Born 20 years ago. (ABC News: Callum Flinn)\n\nThe duo also value sustainability in their work, having held shows using offcuts of material and workshops teaching how to tailor clothes so they last longer.\n\n\"Before I even knew Anna, I used to go to op shops and buy secondhand clothing, unpick them, sew them back together and make new things out of them,\" Sales said.\n\n\" I guess it's just who we are as designers, and how we've always worked. \"\n\nPlunkett agreed, adding that they had a genuine appreciation for vintage textiles and upcycling.\n\nRomance Was Born's 20th anniversary collection 'it's in the trees' was shown at AFC Australian Fashion Week in May. (Facebook: Romance Was Born)\n\n\"It's a part of our work and our DNA,\" Plunkett said.\n\n\" We're quite nostalgic with our inspirations, and this is just an extension of that. \"\n\nLong-term friend of Sales and Plunkett, artist Samuel Hodge, used photographs from his own collection to encompass the minds of the pair.\n\nThe process took months of sifting through thousands of photographs he'd taken over their two decades of friendship.\n\nCreating a 'very extra' portrait\n\nIncorporating different mediums including paint, dye, and photography, Hodge said he hoped to echo the coming together of fashion and art which was central to Plunkett and Sales's work.\n\nSamuel Hodge says a single portrait would not have done justice to Plunkett and Sales's work. (ABC News: Callum Flinn)\n\n\"Every time I see them do a show or a collection, it's never what you expect,\" Hodge said.\n\n\"I wanted to match that way of working, to push everything to be bigger and bolder.\n\n\"I could have just done a single portrait, but it wouldn't have really done justice to everything that they've done.\"\n\nSales said Hodge's piece embodied who he and Plunkett were as designers, along with the spirit of the brand.\n\nPlunkett agreed and said the work taking up a whole wall was appropriate to the dramatic nature of their work.\n\nAnna Plunkett says the installation taking up a wall is fitting with her and Sales's \"extra\" nature. (ABC News: Callum Flinn)\n\n\"It's so extra, and me and Luke are both very extra — we always want to shoot for the stars with what we do,\" she said.\n\n\" It's just so us to have a multiple-framed, multi-everything happening at one moment. \"\n\nNational Portrait Gallery Director Bree Pickering said the brand was unique in the Australian fashion industry, so their portrait had to be equally unconventional.\n\n\"They burst onto the scene with a really distinct and bold voice, and they've maintained that voice over 20 years,\" Ms Pickering said.\n\n\"Every time they do a show, there's something unexpected, but absolutely so Romance Was Born. It's very Australian, but it's globally influential.\n\n\"And, of course, it's Romance Was Born so … the portrait had to evoke them — it had to be opulent, big, and unique, and noisy.\"\n\nBree Pickering says the piece had to be big, opulent and unique to capture the essence of the brand. (ABC News: Callum Flinn)\n\nShe said Sydney in the mid-2000s, when Romance Was Born began, was a productive moment for art and fashion that Hodge's piece had captured.\n\n\"[Romance Was Born] were there at that moment, and what's super exciting is Sam Hodge, the artist, was also there at that moment,\" Ms Pickering said.\n\n\"So what we see in this portrait is actually almost a portrait of Sydney's creative scene at that time, as well as a portrait of Luke, a portrait of Anna, a portrait of Romance Was Born.\"\n\nMs Pickering said the piece was \"overwhelmingly beautiful\", which spoke to the brand itself.\n\n\"What is wonderful about the work is the layers,\" she said.\n\n\"What Sam [Hodge] does that is so lovely is that he kind of collapses time together.\n\n\"So when you look at the work you'll see 20 years of Romance Was Born, but it's absolutely them now. And the more you look at it the more you get.\"",
    "source": "ABC",
    "cluster_id": 16
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/council-rejects-lgbtqia-event-due-to-nrl-grand-final-clash/105560232",
    "title": "Council rejects LGBTQIA+ event due to NRL grand final clash 80km away",
    "publish_date": "Fri, 25 Jul 2025 22:01:50 +0000",
    "category": "sports",
    "authors": [],
    "text": "Organisers of the Central Coast's biggest diversity and inclusion festival say they are \"devastated\" after being told the event cannot go ahead this year because it clashes with a sporting event being held almost 80 kilometres away in Sydney.\n\nCoastal Twist Fair Day is a family-friendly LGBTQIA+ arts and culture festival that is held annually at Umina, featuring live music, cabaret, and drag story time.\n\nThe event started in 2019 and has always been held on the October long weekend.\n\nBut the Central Coast Council has knocked back the development application (DA) to hold the festival this year as it coincides with the NRL Grand Final being hosted at Sydney Olympic Park.\n\nNot being an NRL follower himself, festival producer Juan Iocco said he initially thought the council was referring to a local sporting event.\n\n\"I think we asked [the council] about seven times over a period of almost two months for clarification,\" Mr Iocco said.\n\n\" We finally got a response saying that it was the NRL Grand Final in Sydney … but that has been going every year on that same date [as our event] … it doesn't make sense. \"\n\nCoastal Twist invites all community members and visitors to celebrate diversity and inclusion. (Supplied: Lisa Haymes)\n\nThe council said the proposed location of the event, Umina Beach, would already be at capacity due to the NRL Grand Final and long weekend visitors, and the festival would result in \"unacceptable traffic and parking impacts\".\n\nMr Iocco is seeking a report into potential traffic and pedestrian impacts in the area at a cost of $30,000 in an effort to have the DA rejection overturned.\n\nBut with less than eight weeks until the event was due to go ahead, he was worried it might not come in time.\n\n\"Trying to keep our headliners and our main artists when we really don't know if we are going ahead with it or not is really quite stressful,\" he said.\n\nCreating a safe space\n\nGlitta Supernova is the festival's creative director and said the event was initially launched because there was nothing else like it on the Central Coast.\n\nCreating a safe space for diversity in a public area was a big driver.\n\nA development application for the Coastal Twist Fair Day has been rejected because visitor numbers are already expected to be high due to the long weekend. (Supplied: Lisa Haymes)\n\n\"We've been offered [by council] all these little backyard places to hold the festival, apart from the one we want to do it in,\" Ms Supernova said.\n\n\"We could easily do it and tuck ourselves away, and that visibility piece wouldn't be happening in our community because we're all tucked away … no-one sees it and no-one is part of it.\n\n\" [But] it's just really important that people see and get to be part of an inclusive society. \"\n\nMs Supernova said she was surprised by the decision because she thought the NSW government was taking steps to make it easier for events like festivals to go ahead.\n\nCommunity impact\n\nKristy Cartan has attended the festival every year and said the community would be heartbroken if it could not go ahead.\n\n\"And I'm not just talking about the queer community. I'm talking about the whole community on the Central Coast,\" Ms Cartan said.\n\n\"I had my 85-year-old neighbour there and my eight-year-old at the time, dancing together … it's just a beautiful expressive space.\"\n\nKristy Cartan attends the Coastal Twist Fair Day with her son, Dash, every year. (Supplied: Kristy Cartan)\n\nMs Cartan said it was important that the queer community had a space where they felt safe and accepted.\n\n\"[At the festival] you are wildly safe because there are so many of us all being together,\" she said.\n\n\"It brings hope, it brings life, it brings community together … it brings the opportunity to be seen for who you are … for self-expression in its most radical and beautiful form.\"\n\nIn a statement, Central Coast Council said the extra criteria the festival needed to meet this year, including addressing concerns about traffic and pedestrians, as well as a bushfire risk assessment, were due to new planning guidelines from the Department of Planning, Housing and Infrastructure.\n\n\"Council is keen for the event to proceed and is very supportive of it, having provided funding for it,\" it said.",
    "source": "ABC",
    "cluster_id": 17
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/and-just-like-that-season-three-sex-and-the-city/105529296",
    "title": "Who are these women and what have you done to Sex and the City?",
    "publish_date": "Fri, 25 Jul 2025 22:00:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "When Howard Hawkes's now-classic comedy, His Girl Friday, was released in 1940 starring Rosalind Russell and Cary Grant, the film critic of The New York Times, Frank Nugent, savaged lead character Hildy Johnson — a divorcee newshound chasing one last scoop before she heads off to re-marry — as \"a wild caricature which should not be taken seriously\".\n\nHe was wrong, of course. Two years earlier, Katherine Hepburn had gone up against Grant at warp speed in the immortal Bringing Up Baby, and the idea of the fast-talking, ambitious, well-dressed, somewhat madcap woman had been a commercial success ever since Claudette Colbert hitched her skirt to hitch a ride with Clark Gable in It Happened One Night.\n\nThese movies created a female character lead who became an American cultural classic. Every film and TV show that came afterwards featuring a headstrong, smart-mouthed woman owed a debt to what became known as the \"screwball comedies\" of the 30s and 40s.\n\nTheir lineage is undeniable. You wouldn't have The Mary Tyler Moore Show, or Golden Girls, or 30 Rock, or Parks and Recreation without these films and this type of female character.\n\nThe four women of Sex and the City were each other's \"love of their lives\". (Reuters: STR New)\n\nEnter Sex and the City\n\nLena Dunham's Girls is the genre's granddaughter, but the HBO smash Sex and the City was the golden child of the \"screwball comedy\": it took all those romantic misunderstandings, outlandish scenarios, and the traditional \"battle of the sexes\" and wrapped them in enviable designer clothes and unapologetic sexual appetite.\n\nLike the classic films that defined the genre, SATC delivered strongly written female characters, handed them sharp dialogue and clever repartee and dropped them in situations just a few degrees south of what any romantically exhausted bachelorette might encounter in 1998: weird men with oral sex fetishes; married men who were compulsive liars and a dating roster of the odd, angry and addicted. Just another Friday night in Manhattan.\n\nThis is a long run-up to where I know you suspect I'm going with all this but bear with me, because the horror of the present really only makes the most sense when you place it in its correct historical context.\n\nThese previously gimlet-eyed women are presented as stammering, stuttering idiots, fumbling basic social cues. (Supplied: Max)\n\nSATC was a success because the madcap was served with a withering millennial scepticism about love and sex, and the show made one key change from the screwball original: it switched out the male romantic lead for several female ones. The four women of SATC were each other's \"love of their lives\" as the toxic Mr Big finally figured out. And it made the romantic follies of single NY women bearable that, in the end, they always had each other.\n\nOK — we can't avoid it anymore: here we are, in 2025, and deep into the mystery confounding viewers worldwide: what the hell happened to these women? What the hell happened to the TV show that millions loved?\n\nAnd just like that… it turned awful\n\nWe are now in series three of And Just Like That, the reboot of SATC, and this strange show has become without question the most awful, cringeful, embarrassing television most of us have probably ever persisted with. Don't take my word for it. And yet, we can't stop watching it.\n\nThis bunch of smart, successful young women apparently grew up and lost everything — their sense, intelligence, social radars, insight, ability to read a room, their furniture and — in one case — apparently all their money.\n\nI must admit, I probably always hate-watched SATC — Carrie really was the most awful person — but my dread-watch of its bizarre reboot, And Just Like That, sits now at abysmal levels.\n\nMy discomfort grows as I watch erstwhile capable women presented as bumbling fools. (Supplied: Max)\n\nMost of the great screwball comedies were, unsurprisingly, written by straight, white men (notably, except for Bringing Up Baby) and yet those blokes seem to have had a truer grasp of what drives a woman in love, or drives her mad, than do the ultra-hip writers' room of this show.\n\nThis quintet of hand-waving hysterics seem to have forgotten how to negotiate an introduction, deal with an attractive co-worker or manage a pernickety neighbour, and have even forgotten their own personal histories.\n\nAustin returns for season 2 Photo shows Characters of Austin in a pop-up book with a purple background with title Austin below in white. Tune in this Sunday at 7.30pm on ABC TV or on ABC iview.\n\nWhy is Miranda, a woman who was for years a senior partner in a New York law firm, homeless and living in Airbnbs? Why does Seema, another former partner but of a real estate firm, have no savings at all? Why did Lisa apparently forget that her father was already dead in season one?\n\nThese previously gimlet-eyed women are presented as stammering, stuttering idiots, fumbling basic social cues, agreeing to a five-year hiatus in their relationship and contradicting their own character arcs. In one episode, Carrie is bewildered and unable to ask her boyfriend even the basic meaning of his text messages; in another, she becomes a stone-cold bitch to her closest friend, Miranda, when she bells the obvious cat of Carrie's flirtation with her neighbour.\n\nI'm sorry for the repetition, but: who are these women?\n\nIn this strange show, in which nothing ever happens (Seinfeld should sue for IP infringement), the women of SATC have devolved into the kind of unflattering caricatures of befuddled older women that would never have flown in the Golden Girls days.\n\nEveryone is asking but no one seems to know why. And Just Like That features several writers who also worked on the original Sex and the City, including Julie Rottenberg and Elisa Zuritsky, and showrunner Michael Patrick King continues to play a significant role in the writing and creative direction of And Just Like That, and of course, Sex-meister Darren Star, the original showrunner, is at the helm.\n\nIn one of the most popular television shows in the world right now, the depiction of women has gone backwards. (Supplied: Max)\n\nCherished characters become absurd\n\nYou have to assume that the original writers and the newbies cherish these characters as much as their legions of fans do — and yet they twist them into strange and ludicrous shapes that are at the least insulting and, for me, verge on the misogynistic. I can't name a single female character from all my decades of consuming film and television as absurd as these women.\n\nMy discomfort grows as I watch erstwhile capable women presented as bumbling fools, without the reassurance of well-written comedy or clever satire. Instead, the writing is woefully banal and the women are simply presented as unexplained absurdities.\n\nSign up for Weekend Reads in your inbox Photo shows Virginia Trioli in a stylish suit on a set with lighting behind her Start your weekend with the best of the ABC's journalism, presented by Virginia Trioli. Discover compelling features, big ideas and revealing analysis to understand the stories that matter to Australians.\n\nIt feels as if it's all a bit of a send-up, as if depicting women in their 50s navigating their version of love, dating, marriage and romantic failure and success simply isn't worthwhile unless you turn them into idiots. Even the (male) titans of Hollywood's so-called \"Women's Pictures\" knew that'd be a folly: their audiences were smart; their female characters had to be smarter.\n\nInstead, in keeping with the general devolution of civilisation, in one of the most popular television shows in the world right now, the depiction of women has gone backwards.\n\nKate Hepburn would smack them all over the back of the head.\n\nThis weekend, the life of a working woman from a very different perspective: why is it so hard to get a job that provides enough to just live a life and enjoy it?\n\nHave a safe and happy weekend and don't forget to listen to the Hottest 100 of Australian music this weekend from 10am on Triple J It's going to be the biggest party in town.\n\nConsider this a frantic, last-minute vote: go well.\n\nVirginia Trioli is presenter of Creative Types and a former co-host of ABC News Breakfast and Mornings on ABC Radio Melbourne.",
    "source": "ABC",
    "cluster_id": 18
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/sex-offender-time-keeps-at-white-hills-junior-match/105572712",
    "title": "Club allowed convicted sex offender to time-keep at junior football match",
    "publish_date": "Fri, 25 Jul 2025 21:30:46 +0000",
    "category": "sports",
    "authors": [],
    "text": "A regional Victorian football club allowed a convicted sex offender to volunteer at a junior game in what it now admits was a \"gap\" in child safety processes.\n\nBendigo father Sonny Middleton served six months in prison after pleading guilty in 2024 to the indecent assault of an 18-year-old woman.\n\nEarlier this month, multiple parents saw Middleton time-keeping at a White Hills Junior Football Club match in Bendigo and told the ABC they were concerned the club was allowing a sex offender to participate in children's sport.\n\nMiddleton, who is a former White Hills footballer himself, confirmed to the ABC he attended his son's game on July 20 and volunteered as a time keeper but said he did nothing wrong.\n\n\"I'm a good person,\" he said.\n\n\"I'm a family man, I'm a businessman.\"\n\nMiddleton was unable to confirm whether he held a valid Working with Children Check which volunteers at sporting clubs must hold under Victoria's Child Safe Standards.\n\nOnus on clubs\n\nThe White Hills Junior Football Club declined to respond to questions from the ABC about whether it checked Middleton's Working with Children Check status.\n\nThe White Hills Junior Football Club plays in the Heathcote and District Football Netball League, based in Bendigo. (ABC Central Victoria: Emile Pavlich)\n\nIn a statement drafted with the assistance of the AFL, a club spokesperson said it was \"currently investigating a matter relating to a parent who assisted the team by running the time clock at a recent match\".\n\n\"The parent filled in when the normal time clock person was unavailable and the parent had no interaction with the playing group on the day,\" it said.\n\n\"While this situation revealed a gap in our processes we wish to reassure our members and the broader community that no incidents occurred as a result of the parent's involvement on the day,\" the club spokesperson said.\n\n\"Our club, run by volunteers, takes its commitment to the safety and wellbeing of everyone extremely seriously, and especially the safety of children and young people.\"\n\nSporting clubs in Victoria are required to meet the Victorian Children's Commissioner's Child Safe Standards which include a current Working with Children Check for volunteers.\n\nThe Commission for Children and Young People's guide to the Child Safe Standards states that \"failing to properly check references can compromise child safety\".\n\nClubs on notice\n\nThe White Hills Junior Football Club is now reviewing its policies and procedures and promised to \"implement any necessary corrective actions immediately.\"\n\n\"Our focus remains on ensuring strong safeguards and ongoing compliance to maintain a safe and supportive environment for all players, families, and spectators,\" a spokesperson said.\n\nAFL Victoria and AFL Central Victoria did not respond to questions.\n\nWhite Hills Junior Football Club has both juniors and seniors, often training and playing at similar times. (ABC Central Victoria: Emile Pavlich)\n\nThe White Hills Junior Football Club plays in the Australian Football League (AFL) Central Victoria region, which is managed by Cameron Tomlins.\n\nIn a phone call with the ABC, Mr Tomlins repeatedly said it was his job to \"protect\" the junior football club because it was run by volunteers.\n\nSport Integrity Australia (SIA) safeguarding director Lisa Purves disagreed.\n\n\"I would say it's his role to protect his members, not necessarily the club,\" Ms Purves said.\n\nShe said every level of sport, including volunteer-run clubs, had a legislative requirement to check volunteers' backgrounds including a valid Working with Children Check.\n\n\"Where they do know of a risk, and they do know of a person having a conviction, then they do need to take steps to ensure that … all members are provided with a safe environment,\" Ms Purves said.\n\n\"They [clubs] have a responsibility to do this. If they don't do it then what happens is the next royal commission, we have opportunities for children and young people … to be harmed in sport, and that's not what we want.\n\n\"It's not just about turning up to play your sport.\"\n\nMs Purves also observed that governing bodies could be reluctant to police volunteers because people were giving up their time to run the sport.\n\n\"I want to recognise the difficulty that people running these clubs might have. Yes, more needs to be done, and the sport itself needs to help the grassroots clubs manage this better.\"",
    "source": "ABC",
    "cluster_id": 19
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/whyalla-port-pirie-bedford-bailouts/105575258",
    "title": "Steel, lead and Bedford want life support — but how much help is harmful?",
    "publish_date": "Fri, 25 Jul 2025 21:18:48 +0000",
    "category": "finance",
    "authors": [],
    "text": "Who deserves a lifeline?\n\nThat's the awkward question Premier Peter Malinauskas has been fielding during an eventful first week back from annual leave.\n\nIn the government's view, the Whyalla steelworks and its more than 1,000 employees certainly fall into the deserving category.\n\nOn Wednesday, the Premier announced the state government would stump up another $137.5 million to keep the steelworks running through its government-enforced administration process.\n\nThat's on top of $192 million the government had already allocated to keep the steelworks afloat, bringing the total state contribution to $329.5 million. The Commonwealth has pledged an equal amount.\n\nThe state and federal governments combined for a $2.4 billion Whyalla rescue package in February. On Wednesday, another $275 million ($137.5 million each) was added to that funding pool. (ABC News: Che Chorley)\n\nWednesday's extra funding, while lower than expected, is still a hefty chunk for a state government that's flagged it has limited capacity to fund major projects due to rising debt levels.\n\nAnd the steelworks are not the only ones in need of help.\n\nPort Pirie and Bedford on the brink\n\nThe multi-metal smelter in Port Pirie has been operating for more than a century. (ABC News)\n\nThe Port Pirie lead smelter, which employs about 900 people on the Spencer Gulf, is losing tens of millions of dollars a month, according to owner Nyrstar Australia.\n\nThe company, which also owns a zinc smelter in Hobart, is negotiating with the state and federal governments over a support package that could be worth hundreds of millions of dollars.\n\nThen, on Thursday, it was revealed SA's largest disability employment provider, Bedford Industries, was on the brink of administration — raising fears for the future of 1,400 people with disability.\n\nPremier Peter Malinauskas addressing the media with Bedford board chair Janet Miller after it was revealed the disability employment firm could go into administration. (ABC News: Tim Morris)\n\nIn both situations, the SA Premier has indicated the state government is ready to help with public money if need be.\n\nBut does this set a precedent for every business or industry that is struggling? Asked this on Wednesday, the Premier said: \"Well, what choice do we have?\"\n\n\"I think we have to be balanced and careful in the approach that we take and deliberate in our considerations,\" he said.\n\n\"But I don't think there's anybody seriously suggesting that we should allow Port Pirie or Whyalla or our farmers or for people operating our coastline [affected by the algal bloom] just to be left to rack and ruin — that's not my view.\n\n\"Governments have always played a role. Whenever there's been a crisis or a challenge, people turn to government, and that's a responsibility you have to be willing to take on.\"\n\nOn Friday, after the Bedford situation came to light, Mr Malinauskas said: “It’s not my DNA just to sit back and watch a group of vulnerable people potentially be left in a situation where they’re more vulnerable than they are already\".\n\n'There's no easy answer'\n\nJames Hancock, deputy director of the University of Adelaide's SA Centre for Economic Studies, said the situations with Whyalla, Port Pirie and Bedford had left the government \"between a rock and a hard place\".\n\nHe said government intervention to save a business meant \"you then potentially have a queue of other businesses approaching you for support when they're in difficulty\".\n\n\"The state budget can afford to do it for an extended period, but the real issue is if you're doing this for an extended period, what are you doing for other sectors that come under pressure?\" he said.\n\n\"If it's not just Whyalla [and] you sort of end up with five, 10 sectors that need a lot of help on an ongoing basis, then that actually starts to become a really large budget burden.\n\n\"There's a tension there and there's no easy answer.\"\n\nWhat if we didn't intervene?\n\nSouth Australia is not short of examples of what happens when a long-standing industry collapses and there is no white knight to save it.\n\nThe death of the car manufacturing industry left its mark on Adelaide following the closure of Mitsubishi in 2008 and Holden in 2017.\n\nMeanwhile, the end of coal mining in Leigh Creek in 2015 saw that town's population shrink from 2,000 residents to just 100.\n\nLeigh Creek residents optimistic after coal mine closure Photo shows Two big tyres with the words Leigh and Creek next to a road sign. Leigh Creek's residents are more optimistic for their future eight years after the coal mine closed.\n\nMr Hancock said the stakes were particularly high for regional cities that were reliant on a major employer.\n\n\"Holden was located in the Adelaide metropolitan area … and people that were displaced from Holden in many instances were able to get employment elsewhere,\" he said.\n\n\"If you think about the house values of those workers, there was no sort of real impact of any significance.\n\n\"If you compare that with Whyalla, and if you had a situation where half the town was out of work and having to leave a job, it becomes almost impossible for people to sell housing.\n\n\"The human consequences of a Whyalla closure would really be very large.\"\n\nThat's the case Port Pirie Mayor Leon Stephens is now making amid the troubles associated with the Nyrstar plant.\n\nMr Stephens, who is also a Liberal Party candidate at the 2026 state election, said the closure of the Port Pirie smelter would cause economic \"devastation\".\n\n\"My perception of what a government should be doing, it should be looking after all sectors of community,\" he said.\n\nPremier Peter Malinauskas speaking to workers at the Whyalla steelworks following the state and federal government's intervention in February. (ABC News: Che Chorley)\n\n\"When you've got … a major employer in a city and that person is struggling and it looks like it will bring the city to its knees, I think there's definitely a catalyst [for intervention].\"\n\nThe Premier was asked on Wednesday where he drew the line on whether to give an industry a bailout.\n\nHe said it depended on \"whether or not there's a future\" for the industry in question.\n\n\"While it is true that there's creative disruption in the marketplace all the time and we see businesses that's better years are past, the question is what are the years in front of us,\" he said.\n\n\"Unless you can see a future, then maybe you have to say, 'look, something hit the fence and that's life'.\n\n\"But for steelmaking … we know this country needs steel, for critical minerals [like at Port Pirie], the demand is going up not down.\n\n\"So, there are futures there that are worthy of contemplation.\"",
    "source": "ABC",
    "cluster_id": 20
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/tour-de-france-19th-stage-thymen-arensman-wins/105576368",
    "title": "Dutch rider slumps to the ground after Tour de France stage victory",
    "publish_date": "Fri, 25 Jul 2025 21:18:47 +0000",
    "category": "sports",
    "authors": [],
    "text": "Dutch rider Thymen Arensman launched a daring solo attack on a long final climb and held on grimly to win the 19th stage of the Tour de France.\n\nAlthough race leader Tadej Pogačar took a step closer to a fourth Tour title, the Slovenian star could not catch Arensman. He finished the stage in third place behind Dane Jonas Vingegaard, who just beat Pogačar to the line.\n\nIt was a rare success for the two-time Tour winner Vingegaard over Pogačar in this year's race but ultimately made little difference, since Pogačar is 4 minutes and 24 seconds ahead of Vingegaard with two stages left.\n\nVingegaard could not drop Pogačar on the shortened stage, which featured a 19.1km finish up to the ski resort of La Plagne.\n\nArensman had shown his climbing ability with a stunning solo effort last weekend to win a mammoth mountain stage.\n\nHe made his move this time with 13km left. Pogačar and Vingegaard marked each other at first and chose not to follow.\n\nBy the time they did, it was too late and Arensman won the stage by two seconds.\n\n\"Tadej and Jonas are the strongest in the world, almost aliens, and I'm human,\" the 25-year-old Arensman said.\n\n\"I can't believe I beat them today. I tried to not look behind.\"\n\nMoments after crossing the line, Arensman put his hands on his face and wept as he sat on the ground against a crash barrier, panting heavily with exhaustion.\n\n\"I'm absolutely destroyed, I can't believe it. To win one stage from the breakaway was already unbelievable,\" he said.\n\n\"But now to do it against the strongest riders in the world, it feels like I'm dreaming.\"\n\nStage 19 was shortened after cows infected by a contagious disease were culled in an area along the mountainous route.\n\nIt was meant to be 129.9km long but trimmed to 93.1km. Two of five climbs were removed, including the 13.7km Col des Saisies — where an outbreak of nodular dermatitis (lumpy skin) affected a herd of cows.\n\n\"The discovery of an outbreak of contagious nodular dermatitis affecting cattle in a herd located specifically in the Col des Saisies necessitated the culling of the animals,\" race organiser ASO said.\n\n\"It was decided, in agreement with the authorities, to modify the route.\"\n\nHowever, the stage still featured two Hors catégorie ascents — the hardest level of climbing — with a 12.6km ascent up Col du Pré followed by the trek up La Plagne.\n\nPrimož Roglič, the 2020 Tour runner-up and a record-equalling four-time Spanish Vuelta champion, attacked near the top of Col du Pré but then faded well away.\n\nTonight's 20th stage is a hilly 184.2km route through eastern France finishing in Pontarlier.\n\nThe 21st and final stage sees three climbs up Montmartre hill — a short, sharp ascent which featured at the Paris Olympics last year — before a traditional finish on the Champs-Élysées.\n\nAround 3,000 police officers will be deployed to ensure security.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 21
  },
  {
    "url": "https://www.abc.net.au/news/2025-07-26/england-vs-india-fourth-test-joe-root-second-greatest-run-scorer/105576354",
    "title": "'A moment in history': Ponting pays tribute to Root as records tumble",
    "publish_date": "Fri, 25 Jul 2025 21:13:59 +0000",
    "category": "sports",
    "authors": [],
    "text": "Just one man stands in the way of Joe Root and cricketing history.\n\nWith his latest batting masterclass of 150 overnight, the England star became the second-highest run-scorer in Test cricket behind India great Sachin Tendulkar.\n\n\"Just one more to go,\" said Ricky Ponting, who Root leapfrogged on day three of the fourth Test against India at Old Trafford.\n\nEngland leads by 186 runs after reaching 7-544 at stumps.\n\nThat commanding position was largely thanks to Root's brilliance on a day when he took his career run total to 13,409.\n\nAnd despite having a long way to go to overtake Tendulkar (15,921), Ponting, who watched from the commentary booth, is backing the Englishman to become the number one batter.\n\n\"The way his career has gone over the last five years, there's absolutely no reason why not,\" Ponting said before adding that the crowd had \"witnessed a moment in history\".\n\nWith Tendulkar in his sights, it was fitting that the 34-year-old Root's charge up the rankings came against India.\n\n\"He's not a big one for landmarks, but I think that's a pretty cool one, second-highest test runs is incredible,\" England vice-captain Ollie Pope said.\n\n\"I'm sure he knew what the number was [that he needed] but he's not a guy who wants to shout about it.\n\n\"The hunger he has, I wouldn't be surprised if he chased him [Tendulkar] down.\"\n\nOn the brightest day yet of this Test, Root lapped up the adulation of the crowd, which rose to applaud as he checked off one personal achievement after another.\n\nThere was a half-century at lunch, which saw Root move up to third on the runs list, surpassing greats Rahul Dravid and Jacques Kallis.\n\nHis 38th Test century came next and soon he was passing Ponting. Just when thoughts might have been turning towards a double century, he was stumped by substitute keeper Dhruv Jurel off Ravindra Jadeja.\n\nThere was more applause and chants of \"Rooooot\" as he walked to the pavilion, having helped England take control of a match it was hoping to win to clinch the five-match series, which it led 2–1.\n\n\"The way he goes about his cricket, the way he trains, the amount of runs he's got, is amazing. He's a joy to watch and to see how he goes about his stuff. He keeps getting better and better,\" Pope said.\n\nThe day could have gone very differently had Root not survived nearly being run out on 22, following a miscommunication with Pope that left him way out of position when Jadeja tried to capitalise.\n\nBefore that, he narrowly avoided being out leg before wicket. But that was long forgotten as Old Trafford stood to applaud his latest outstanding performance.\n\nRoot was not the only one who impressed as England carried on its brilliant batting from day two, when the opening partnership of Zak Crawley and Ben Duckett put on a blistering 166 in reply to India's first innings 358.\n\nEngland resumed on 2-225 and Pope joined Root with a half-century at lunch as the visitors struggled to have any impact with the ball.\n\nPope eventually went for 71 when caught by KL Rahul off Washington Sundar. And Sundar soon had his second wicket when Harry Brook (3) was stumped by Jurel.\n\nEngland overcame that wobble when Ben Stokes (77 not out) came out to join Root.\n\nThe pair looked impenetrable as the England captain reached 66 not out and Root continued to score freely.\n\nIt was only when Stokes retired hurt with cramp in the evening session with England on 4-491 that the partnership was eventually broken. Then India began to have some joy on a difficult day.\n\nRoot was stumped to make it 5-499. Smith (9) was caught by Jurel off Jasprit Bumrah and Chris Woakes (4) was bowled by Mohammed Siraj.\n\nWickets fell so quickly that Stokes was back at the crease before stumps to join Liam Dawson (21 not out).\n\nMoving a lot more comfortably, Stokes added 11 runs to his score as England headed for a substantial first-innings lead.\n\nThe ABC of SPORT Sports content to make you think... or allow you not to. A newsletter delivered each Saturday.\n\nAP",
    "source": "ABC",
    "cluster_id": 22
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/the-one-origin-change-johns-wont-cop-20250726-p5mhzc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The one Origin change Johns won't cop",
    "publish_date": "Sat, 26 Jul 2025 12:09:38 +1000",
    "category": "finance",
    "authors": [],
    "text": "The one Origin change Johns won't cop\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 23
  },
  {
    "url": "https://www.smh.com.au/national/root-surpasses-ponting-on-all-time-test-runs-leaderboard-20250726-p5mhz9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Root surpasses Ponting on all-time Test runs leaderboard",
    "publish_date": "Sat, 26 Jul 2025 11:49:04 +1000",
    "category": "sports",
    "authors": [],
    "text": "Root surpasses Ponting on all-time Test runs leaderboard\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 24
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/broncos-to-calm-walsh-down-as-loss-rocks-finals-hopes-20250726-p5mhz5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Broncos to ‘calm’ Walsh down as loss rocks finals hopes",
    "publish_date": "Sat, 26 Jul 2025 11:38:09 +1000",
    "category": "sports",
    "authors": [
      "Joel Gould"
    ],
    "text": "Brisbane must find patience and composure in their play or risk becoming cannon fodder in the finals – if they get there.\n\nThe Broncos’ top-four hopes are on the rocks after their 22-20 loss to a superb Parramatta on Friday night at Suncorp Stadium.\n\nThey still need three wins from their remaining six matches to even be assured of finishing in the top eight and playing in the finals.\n\nThe Broncos started the match against the Eels with a determination to get through their sets, which they initially did, and earn their points.",
    "source": "SMH",
    "cluster_id": 25
  },
  {
    "url": "https://www.smh.com.au/national/king-dismissed-by-owen-20250726-p5mhz4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King dismissed by Owen",
    "publish_date": "Sat, 26 Jul 2025 11:23:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "King dismissed by Owen\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 26
  },
  {
    "url": "https://www.smh.com.au/sport/aussie-runners-scary-collapse-20230303-p5cp2q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie runner's scary collapse",
    "publish_date": "Sat, 26 Jul 2025 10:37:37 +1000",
    "category": "sports",
    "authors": [],
    "text": "Aussie runner's scary collapse\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 27
  },
  {
    "url": "https://www.smh.com.au/culture/music/triple-j-hottest-100-australian-songs-hilltop-hoods-favourite-for-number-one-20250726-p5mhyl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Triple J Hottest 100 Australian songs: Hilltop Hoods favourite for number one",
    "publish_date": "Sat, 26 Jul 2025 10:16:02 +1000",
    "category": "entertainment",
    "authors": [
      "Thomas Mitchell"
    ],
    "text": "Well, the day is finally here: Triple J is set to announce the Hottest 100 Australian songs of all time.\n\nTypically, the Hottest 100 is an annual countdown of the best songs of the year from all over the world. But to celebrate the youth station’s 50th anniversary, Triple J is staging a countdown of the greatest ever home-grown tracks.\n\nThe Hilltop Hoods, Daniel Smith, Matthew Lambert and Barry Francis, are the bookies’ favourite. Credit: Dominic Lorrimer\n\nAudiences have been voting for months to unearth Australia’s favourite song.\n\nEven Prime Minister Anthony Albanese got in on the act, nominating The Angels’ Am I Ever Gonna See Your Face Again and Cold Chisel’s Flame Trees in his list.",
    "source": "SMH",
    "cluster_id": 28
  },
  {
    "url": "https://www.smh.com.au/lifestyle/hottest-100-aussie-songs-20250726-p5mhyv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hottest 100 Aussie songs",
    "publish_date": "Sat, 26 Jul 2025 10:08:34 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Hottest 100 Aussie songs\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 11
  },
  {
    "url": "https://www.smh.com.au/national/victoria/community-anger-after-losing-six-year-battle-against-beachside-fast-food-outlet-20250724-p5mhjn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Community anger after losing six-year battle against beachside fast-food outlet",
    "publish_date": "Sat, 26 Jul 2025 09:52:00 +1000",
    "category": "finance",
    "authors": [
      "Tom Cowie"
    ],
    "text": "A controversial new fast-food outlet less than 100 metres from a Mornington Peninsula beach has won approval after almost six years of resistance from hundreds of residents and the local council.\n\nA BP service station on the foreshore at Safety Beach, along the Nepean Highway, will be redeveloped to include a 24-hour convenience food store and drive-through after a successful appeal to the Victorian Civil and Administrative Tribunal.\n\nResidents have fought plans for a new McDonald’s on the Mornington Peninsula site for almost six years. Credit: Justin McManus\n\nMornington Peninsula Shire Council twice rejected applications by the site owners, AA Holdings, for a larger service station and new takeaway outlet after both bids drew a total of about 1500 objections from the community.\n\nVCAT also previously blocked the proposal until ultimately approving it this month. The applicants first sought council permission for their plan in 2019.",
    "source": "SMH",
    "cluster_id": 29
  },
  {
    "url": "https://www.smh.com.au/national/east-coast-bracing-for-wet-and-gloomy-weekend-20250726-p5mhys.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "East Coast bracing for wet and gloomy weekend",
    "publish_date": "Sat, 26 Jul 2025 09:44:39 +1000",
    "category": "finance",
    "authors": [],
    "text": "East Coast bracing for wet and gloomy weekend\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 30
  },
  {
    "url": "https://www.smh.com.au/sport/three-time-olympian-sues-sporting-body-over-false-imputations-of-paedophilia-20250725-p5mhw3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Three-time Olympian sues sporting body over ‘false imputations of paedophilia’",
    "publish_date": "Sat, 26 Jul 2025 09:36:41 +1000",
    "category": "sports",
    "authors": [
      "Frances Howe"
    ],
    "text": "A three-time Olympic figure skater is suing NSW’s ice skating association for defamation, claiming it made “false imputations of paedophilia and child molestation” against him in an email to members.\n\nDocuments released by the NSW Supreme Court on Friday reveal Brendan Kerry, 30, is seeking damages and an order permanently restraining the sporting body from repeating the claims in the email, sent to members on May 16 last year.\n\nBrendan Kerry skates during the Beijing 2022 Winter Olympic Games at Capital Indoor Stadium. Credit: Getty Images\n\nKerry was on the board of the NSW Ice Skating Association (NSWISA) until May 2024 but stood down when he received a lifetime coaching ban from the US Centre for SafeSport, which found he had engaged in “sexual misconduct involving a minor”.\n\nIn the statement of claim, Kerry’s lawyers say the finding by the US Centre for Safe Sport “involved a female [in California] who was 17 years old when Kerry was 21”.",
    "source": "SMH",
    "cluster_id": 31
  },
  {
    "url": "https://www.smh.com.au/sport/swimming/a-chinese-swimmer-born-in-2012-is-ready-to-break-an-89-year-old-record-20250725-p5mhvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A Chinese swimmer born in 2012 is ready to break an 89-year-old record",
    "publish_date": "Sat, 26 Jul 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "A 12-year-old Chinese swimmer who took up the sport in 2019 after being approached at an amusement park pool is hoping to become the youngest medallist at an international meet in 89 years next week.\n\nYu Zidi, born in October 2012, will become one of the youngest swimmers ever to contest a major international meet when she lines up in three events at the World Aquatics Championships from July 27 to August 3.\n\nYu made headlines last year as an 11-year-old after falling two seconds short of making the cut to represent China at the Paris Olympics.\n\nJust over a year later, Yu has earned selection on China’s national team and will compete in three events in Singapore – the women’s 200m butterfly, 200m individual medley and 400m individual medley races.",
    "source": "SMH",
    "cluster_id": 32
  },
  {
    "url": "https://www.smh.com.au/sport/motorsport/piastri-surprised-by-big-lead-20250726-p5mhyq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Piastri 'surprised' by big lead",
    "publish_date": "Sat, 26 Jul 2025 09:09:19 +1000",
    "category": "finance",
    "authors": [],
    "text": "Piastri 'surprised' by big lead\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "SMH",
    "cluster_id": 33
  },
  {
    "url": "https://www.smh.com.au/sport/nrl/alex-johnston-is-about-to-become-rugby-league-s-don-bradman-20250725-p5mhp0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Alex Johnston is about to become rugby league’s Don Bradman",
    "publish_date": "Sat, 26 Jul 2025 09:00:00 +1000",
    "category": "sports",
    "authors": [
      "Malcolm Knox"
    ],
    "text": "Asking rugby league to come together can be like inviting cannibals to a family Christmas, but some time soon, every member of every club should pause and give an ovation for Alex Johnston.\n\nThe South Sydney winger is orbiting the game’s version of the moon landing: Ken Irvine’s record of 212 tries. If Johnston maintains his current rate – as prolific at age 30 as it was at age 20 – and if he stays fit, he will reach the record before Mad Monday.\n\nIrvine’s 212, like Wilt Chamberlain’s 100-point NBA game or Jerry Rice’s 22,895 receiving yards and 1549 pass receptions in the NFL, is one of those freakish individual feats in a team sport that was never meant to be broken.\n\nHere’s some perspective. When Irvine retired after winning the 1973 grand final with Manly, the next-highest try scorer in rugby league was the North Sydney Bears’ Harold Horder, whose record of 152 dated from 1920. When Irvine passed away from leukaemia in 1990, Terry Lamb was the only other player to have passed Horder’s total. The Back-Up Man ended up with 164 tries. Lamb played 350 games during 16 years and retired at age 35; he would have had to play on well into his 40s to challenge Irvine’s record.",
    "source": "SMH",
    "cluster_id": 34
  },
  {
    "url": "https://www.sbs.com.au/news/article/australias-favourite-day-to-tie-the-knot-and-how-long-marriages-are-lasting/i65m5seyx",
    "title": "Australia's favourite day to tie the knot — and how long marriages are lasting",
    "publish_date": "Sat, 26 Jul 2025 01:23:49 +0000",
    "category": "finance",
    "authors": [],
    "text": "Key Points A total of 1,773 couples married on 24 February, or 24/02/24.\n\nAustralia recorded a 2 per cent increase in marriages in 2024 from the previous year.\n\nIn 2024, the rate of divorce was 2.1 per 1,000 people.\n\nAndy and Anh Tran were not too bothered about the exact date of their wedding, but it turns out they tied the knot on what was the most popular wedding date in Australia last year.\n\n\n\n\n\nWhile some couples may have wanted an easy-to-remember wedding anniversary, Tran said his mum chose 24 February or 24/02/24.\n\n\n\n\n\n“She's a bit kind of auspicious,\" he said.\n\n\n\n\n\n\"We gave her the possible dates because I work FIFO [fly-in fly-out], and said these are our options, and she said this would be a nice day, so that's why we picked the 24th.\"\n\n\n\n\n\nAustralian Bureau of Statistics (ABS) data on marriages in Australia in 2024, released this week, showed 1,773 marriages took place on the last Saturday of the 2023/2024 summer.\n\n\n\nSave the date\n\nIt also showed the nation recorded a 2 per cent increase in marriages from the previous year, with a total of 120,844 marriages taking place.\n\n\n\n\n\nWhile more than 1 per cent of couples who wed in 2024 did so on 24 February, it was not the only popular matrimonial date.\n\n\n\nThe most popular date to get married last year was 24 February 2024, with 1,773 marriages. Source: SBS News Another easy-to-remember or numerically satisfying date that was popular was 24/04/24. Although Fridays and Saturdays were most popular for weddings, one Thursday recorded a spike in wedding numbers in 2024.\n\n\n\n\n\nMore than 450 marriages were recorded on the Thursday that was, 29 February, a date that only appears in calendars once every four years\n\n\n\nMarriages in Australia in 2024\n\nWhile the Trans may share an anniversary date with many others who got married in 2024, having had a summer wedding means theirs actually fell outside of the most common seasons to tie the knot in Australia.\n\n\n\n\n\nAccording to the data on marriages, most took place during spring or autumn.\n\n\n\n\n\n\n\nThe national statistics showed Australians who get married typically do so in their early 30s.\n\n\n\n\n\nThe median age for women to marry remained steady at 31.2 years, while the median age for men was 32.8 years.\n\n\n\nThere were 120,844 marriages registered in Australia in 2024, a 2 per cent increase from those registered in 2023. Source: SBS News Same-sex or gender-diverse couples made up almost 4 per cent of the marriages recorded last year.\n\n\n\n\n\nWhile more marriages took place in 2024 in Australia than in the previous year, the recent marriage statistics represent a 5 per cent drop from the record high of 127,161 marriages registered in 2022, following the easing of pandemic restrictions.\n\n\n\n\n\nThe ABS describes 2024 marriage figures as \"comparable to the pre-pandemic rate in 2019 of 5.6 marriages per 1,000 people\".\n\n\n\nWhile NSW recorded the most marriages in 2024 (32,050), Victoria experienced the highest increase in marriages, with an additional 2,234, representing a 7.5 per cent increase.\n\n\n\n\n\nIncreases in the numbers of marriages recorded in those two states and in Western Australia accounted for the increase recorded nationally in last year's figures, with decreased marriage rates in all other states and territories.\n\n\n\nCorrection may not continue into 2025\n\nCelebrant and WA Wedding Association secretary Candice Bydder said while 2024 had witnessed a slight increase in the number of marriages recorded nationally, it was likely a continuation of the 'correction' that started in the industry in 2022, post-COVID-19.\n\n\n\nCelebrant Candice Bydder, who married Andy and Anh Tran on 24 February last year, said while there was an increase in marriages recorded last year, it appeared as if the industry may have slowed down a little during the first half of 2025. Source: Supplied / BKD Media Bydder said anecdotally it appeared as if that correction may be slowing in 2025, and the weddings taking place so far this year have shown a trend towards \"lighter spending\".\n\n\n\n\n\n\"I'm seeing far more paperwork-only weddings, so there's a trend towards smaller, legal-only weddings,\" she told SBS News.\n\n\n\n\n\n\"That might be a bit about the cost of living, but also just people wanting to spend that money elsewhere,\" Bydder said.\n\n\n\nDivorce in 2024\n\nA total of 47,216 divorces were granted in Australia, which was a 3 per cent decrease from the 48,700 divorces granted in 2023.\n\n\n\nA total of 47,216 divorces were granted in Australia, down 3 per cent from the 48,700 divorces granted in 2023. Source: SBS News The crude divorce rate was 2.1 divorces per 1,000 people, down from 2.3 in 2023.\n\n\n\n\n\nThe median length of marriages that ended in divorce in 2024 was 13.2 years.\n\n\n\n\n\nThe median age at divorce has remained unchanged compared to 2023, at 47.1 years for males and 44.1 years for females.\n\n\n\n",
    "source": "SBS",
    "cluster_id": 35
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/its-electric-celebrating-disability-pride-in-australia/6w9ejrgvf",
    "title": "'It's electric': Celebrating Disability Pride in Australia",
    "publish_date": "Fri, 25 Jul 2025 21:30:00 +0000",
    "category": "entertainment",
    "authors": [],
    "text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\n\n\n\n\n\nTRANSCRIPT:\n\n\n\n\n\nUsing humour to challenge perceptions of what it is like to live with a disability - it's an approach writer and performer Emily Dash uses in her storytelling, in theatre and film, to dismantle stigma and stereotypes.\n\n\n\n\n\nA full-time wheelchair user, she lives with cerebral palsy - a disability that affects movement and posture.\n\n\n\n\n\nShe says her art takes inspiration from real life.\n\n\n\n\n\n\"My mission when it comes to artistic works is to reveal truth about me and my life - and my lived experience - in the way that serves not only me, but also inspires other people to reveal something about theirs. That would be my mission and to break down attitudinal barriers so that disability will just be front and centre in society and not in the margins.\"\n\n\n\n\n\nWhat you're about to hear is how that came together in her short film 'Groundhog Night'.\n\n\n\n\n\nIt explores the family dynamics between carer Gary, his disabled daughter Jess, played by Emily Dash, and the in-laws who visit unexpectedly.\n\n\n\n\n\nIn this scene, Gary is kissing his date goodnight outside the door of his home when he is interrupted by daughter Jess.\n\n\n\n\n\nAnd for Emily, no topics are off the table - including relationships, as heard on-stage at this year's Adelaide Fringe Festival.\n\n\n\n\n\nEmily is among disability advocates featured at this year's Disability Pride Sydney festival.\n\n\n\n\n\nOrganiser Hannah Solomons says the event is being held for the fourth year, and it centres disability inclusion and accessibility, with sign language support, audio description and mobility access.\n\n\n\n\n\n\"We're making some progress, but we still need desperately need it (a Disability Pride festival). The amount of hate we're getting on our Facebook page is proof of that. The discussions around the NDIS (National Disability Insurance Scheme). There is still this idea that we're not a valuable part of society and we should just go away. So if you are shamed and rejected, the best antidote to that is to find your tribe and get together and celebrate yourself in public. We're taking up the space and demanding to be included.\"\n\n\n\n\n\nThe festival is part of a broader global movement of Disability Pride first marked in an event 35 years ago in the United States city of Boston, to mark the passage of the Americans with Disabilities Act.\n\n\n\n\n\nGlobally, an estimated 1 billion people have a disability - or 15 per cent of the total population.\n\n\n\n\n\nIn Australia that number is 5.5 million people - more than 20 per cent of the population.\n\n\n\n\n\nThe census shows the number of people with a disability is growing across all age groups below the age of 70 - at that point the number stabilises.\n\n\n\n\n\nIt also shows that disability discrimination affects one in 10, with that number increasing to 1 in 5 for those with a more severe disability.\n\n\n\n\n\nIt affects all arenas in society: the workplace, hospitality venues and interactions with strangers in the street.\n\n\n\n\n\nHannah Solomons says despite the size of the disability community, the diversity of it is poorly understood.\n\n\n\n\n\n\"The responsibility is on all of us to not have a lazy brain. Because if there is a person that is different to us and we don't have experience of our lives, our brain will take the easy way out; and try to box them - and give them a two-dimensional picture in our heads. And that leads to horrible behaviour like you're lying if you have invisible disability; or you're worthless if you have a visible disability; or both. And none of that is okay. I don't know why our society is still so ableist (discrimination against people with a disability). But it is. I could cite statistics that could make your hair curl. The stigma is still there. We're not accepting it. We're not okay with that any more.\"\n\n\n\n\n\nDancing her way on stage and suspended in the air by hanging on a pole with one arm is Deb Roach.\n\n\n\n\n\nThe three-time world pole dancing champion has performed at multiple editions of the Disability Pride Sydney festival.\n\n\n\n\n\nBorn without most of her left arm, Deb has always cultivated a positive mindset, but it hasn't been without it challenges - including bullying in her younger years.\n\n\n\n\n\nDance and DJ-ing proved to be important outlets for self-expression, but it was her introduction to pole dancing that really solidified her self-confidence as an artist and advocate.\n\n\n\n\n\nIt all started 18 years ago, when she watched a performance at a gothic carnival-themed event - and was absolutely mesmerised.\n\n\n\n\n\n\"And these two pole dancers - they were Missy and Suzie Q - did a doubles routine where they were marionette puppets who broke free from the puppet master's strings. And they I had never seen pole in a circus context and the storytelling, the theatre, the athleticism. My mind was absolutely blown. I was backstage with those girls and I said: 'You are amazing with your two arms and your poledancing. That was mindblowing. I wish I could do what you do.' And their response to that was: 'Have you tried?' And I am a little bit like Marty McFly from (the film) 'Back to the Future' in the sense that if I am challenged I show up.\"\n\n\n\n\n\nFive years later she won her first pole champion title, going on to win two more.\n\n\n\n\n\nNow as a pole dance studio owner, she guides others in redefining the idea of what is possible.\n\n\n\n\n\nShe has also been involved in the movement to increase the representation of Australians with disability in advertising from less than 1 per cent - and towards population parity.\n\n\n\n\n\nLed by the Dylan Alcott Foundation, the Shift 20 campaign is already having an impact, with more and more events that are access-first and access-forward.\n\n\n\n\n\nDeb Roach credits events like the Disability Pride Festival with building a strong sense of community.\n\n\n\n\n\n\"It's electric - I love it! I really struggled growing up. I am a feisty individual and I didn't claim the disability - my label as a person with a disability - until I was until I was well into my late twenties. I refused to interact with it. You know, I just wanted to be a person who was a good athlete - and a good human being. But it was the disability pride movement that really helped me lean into the belonging and that sense of healing that I didn't even know that I needed in the community connection - in the space and in that room - and in that togetherness.\"\n\n\n\n\n\nAlso featured at this year's festival is songwriter and performer Dean Nash.\n\n\n\n\n\nThese days he sings and speaks frankly about living with cerebral palsy, but it wasn't always that way.\n\n\n\n\n\n\"So the way that I walk is difficult. And I don't have a lot of function of my left arm and my left hand. I can't move my fingers all that independently. But I have learnt to play the piano - in my opinion, quite well - with the use of just six fingers. When I first started playing, the general feedback would be: 'oh, you don't play like everybody else does'. But once I got good at what I was doing, the narrative shifted to: 'oh, nobody plays that like you do'. And so to me that is a real highlight that a different approach to something doesn't necessarily mean a lesser one. It simply means a different one.\"\n\n\n\n\n\nHe says he has found the arts to be a powerful medium to start conversations.\n\n\n\n\n\n\"Art has a tendency to be the cornerstone of changing hearts and minds. I think cultural change really starts with the stuff that we're putting out in our media. We are the largest minority group in the world because anybody can join this group at any time. And I think that is a really confronting thought for a lot of people. I have a joke in my show where I say there are only two kinds of people in the world: there are disabled people and pre-disabled people. And the disabled audience members cackle at that; and the rest of the audience has a slow intake of breath.\"\n\n\n\n\n\nEmily Dash says she hopes her advocacy makes the path easier for others, moving disability from the shadows to centre stage.\n\n\n\n\n\n\"I am grateful for all the people that have not only come before me but will come after me to get this mission off the ground. The latest statistics show that only four per cent of main characters onscreen have disability in drama. So there is a really long way to go yet. And even when there is representation, it is important to make sure that that representation is done authentically putting people's lived experience at the centre.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 36
  },
  {
    "url": "https://www.sbs.com.au/news/article/tour-de-france-stage-19-results/npsvye93p",
    "title": "Tour de France: Arensman wins stage 19 as Pogačar keeps yellow",
    "publish_date": "Fri, 25 Jul 2025 20:59:54 +0000",
    "category": "sports",
    "authors": [],
    "text": "Thymen Arensman claimed his second victory in this year's Tour de France when he benefited from the top guns' waiting game to prevail in the 19th stage, the last mountain trek of the race.\n\n\n\n\n\nThe Dutch Ineos Grenadiers rider, whose team have been facing doping questions related to their glorious days as Team Sky, went solo in the final climb to La Plagne before crossing the line two seconds ahead of Jonas Vingegaard and Tadej Pogačar, who were second and third respectively.\n\n\n\n\n\n\"I'm absolutely destroyed. I can't believe it,\" Arensman said.\n\n\n\n\n\n\"Already one stage on the Tour was unbelievable, from a breakaway, but now from the GC (general classification) group, against the strongest riders in the world, it feels like I'm dreaming.\"\n\n\n\n\n\nSlovenian Pogačar retained the overall leader's yellow jersey and leads Vingegaard by 4:24 going into the final two stages and is widely expected to win a fourth title if he avoids a major incident.\n\n\n\nGerman Florian Lipowitz took fourth place on the shortened stage to cement his third place overall, stretching his advantage over fourth-placed Oscar Onley of Britain by 41 seconds to 1:03.\n\n\n\n\n\nIt would have taken a colossal coup from Vingegaard to topple Pogačar on the final mountain test in the Alps, but the Visma-Lease a Bike rider only tried within the last 100 metres to take two seconds off of the Slovenian's lead, with Pogačar emerging as the puppet master of the peloton.\n\n\n\n\n\nA leading trio featuring France's Lenny Martinez and Valentin Paret Peintre as well as former Tour runner-up Primoz Roglic, reached the Col du Pre with a small gap of a chasing group after a brutal 12.2-km ascent at 7.7 per cent.\n\n\n\n\n\nThe peloton, controlled by Pogačar's UAE Emirates-XRG, trailed by less than a minute.\n\n\n\nWith two kilometres left in the climb up to the Cormet de Roselend (5.9km at 6.9 per cent), Paret Peintre and Roglic shook off Martinez, but only briefly as the Bahrain-Victorious rider clawed his way back.\n\n\n\n\n\nRoglic was then swallowed two kilometres before the final climb and spat out immediately.\n\n\n\n\n\nAustrian Felix Gall, gunning for a top five finish in Paris, accelerated 14.5km from the finish with Arensman, Pogačar and Vingegaard reacting.\n\n\n\n\n\nPogačar made his own move 14km from the top with Vingegaard and Arensman the only riders able to get into his slipstream.\n\n\n\n\n\nPogačar eventually let Arensman go and seemed content with setting a decent tempo to keep the Dutchman within reach, but the Slovenian eventually did not make the effort to go for a fifth stage win this year.\n\n\n\n\n\nAustralia's Ben O'Connor, who brilliantly won Thursday's 18th stage, was placed 12th, ensuring he kept his overall 10th position in the GC. South Australian Callum Scotson (Decathlon Ag2r La Mondiale) was placed 24th.\n\n\n\n\n\nFor the latest from SBS News, download our app and subscribe to our newsletter .\n\n\n\n",
    "source": "SBS",
    "cluster_id": 21
  },
  {
    "url": "https://www.sbs.com.au/news/article/australian-music-industry-under-pressure/v1iiw53jg",
    "title": "The industry wants us to 'show up'. But can we afford Aussie music anymore?",
    "publish_date": "Fri, 25 Jul 2025 20:35:01 +0000",
    "category": "finance",
    "authors": [],
    "text": "Triple J's Saturday debut of its Hottest 100 of Australian songs has prompted many to reflect on the state of the local music industry — and the sobering reality that perhaps the biggest hurdle is cost.\n\n\n\n\n\nAn April report from Creative Australia found 62 per cent of Australians say music is really important to them — but cost is the main barrier to attending live shows.\n\n\n\n\n\nWhile 66 per cent said they want to hear more local music, many still prioritise saving up their dollars to see international acts — simply because they’re rarer.\n\n\n\n\n\nFBi Radio’s Tyson Koh says people tightening their hip pockets are having a direct flow-on effect on the industry, especially community radio, which has long been considered a cornerstone of the Australian music scene.\n\n\n\n\n\nFBi Radio — where Koh is managing director — has been an institution in the inner-Sydney suburb of Redfern since 2003, bolstered mostly by community memberships.\n\n\n\nBut in June, it had to cut half its permanent staff after entering a period of \"extreme financial distress\". It still isn't out of the woods.\n\n\n\n\n\n\"We found that in this brave new world of digital streaming and social media, a few people had taken our service for granted,\" Koh said.\n\n\n\n\n\n\"They were still listening to the station — but because they already had several other subscription-based services to keep up with, we'd gotten lost in the mix.\"\n\n\n\nTyson Koh says the cost of living crisis and growth of algorithmic music streaming is affecting community radio stations such as FBi, which could close its doors if not enough funding is secured. Source: Supplied / John Feder As cost-of-living pressures linger, Koh says discretionary spending — such as going to live gigs or subscribing to community radio stations — is becoming harder to justify.\n\n\n\n\n\n\"We really need our listeners to show up for us if we are to survive.\"\n\n\n\n\n\n\"I think we have to decide as a society whether music is important … if we can agree on that, then the question comes down to support and participation.\"\n\n\n\nLess disposable income, fewer ticket sales\n\nJoe Draffen, bassist for Melbourne band Floodlights, says the rising cost of living is also affecting artists.\n\n\n\n\n\n\"The current economic climate has made it harder to sell tickets, as many people just don’t have as much disposable income right now due to the rising cost of living,\" Draffen said.\n\n\n\n\n\n\"On top of that, our own expenses have gone up, which meant ticket prices had to increase too.\"\n\n\n\nMelbourne-based band Floodlights say the cost of living crisis has put pressure on musicians, leading to slower ticket sales and higher touring costs. Source: Supplied / Matt Shaw \"Touring’s gotten a lot more expensive — flights, accommodation, gear hire, crew — it all adds up.\"\n\n\n\n\n\nThe band has also been impacted by the closure of several music festivals across the country, which would typically bring more exposure and broaden their fan base.\n\n\n\n\n\nMore than 25 music festivals across Australia have been cancelled since 2022, according to data from the Australian Festival Association.\n\n\n\nCommunity-led efforts still not enough\n\nCaitlin Welsh and Joe Hardy run SydneyMusic.net, a manually curated gig guide born from the loss of local music press and the lingering effects of Sydney’s lockout laws.\n\n\n\n\n\nThe guide briefly shut down in June due to a lack of funds, before a flurry of one-off donations and sponsorships allowed Welsh and Hardy to keep going — for now.\n\n\n\n\n\n\"People hugely underestimate the amount of time and human labour it takes to manually research and compile the gig guide, as well as put together playlists and post daily lists to socials,\" Welsh told SBS News.\n\n\n\n\n\n\"It’s made by a small team of humans — including musicians and creatives who work with us as researchers — who need to be compensated for the amount of labour we’re all doing in order to continue living in one of the most expensive cities in the world.\"\n\n\n\nCaitlin Welsh and Joe Hardy founded gig guide SydneyMusic.net after frustrations with the diminishing Sydney music scene. But the cost of living is making it difficult for them to continue operating. Source: Supplied / Caitlin Welsh But live music spaces are becoming increasingly rare as venues face even more pressure to keep the doors open.\n\n\n\n\n\nIndia Wallis is a Brisbane-based musician and head of youth-focused record label Starving Kids, which runs a dedicated 150-capacity all-ages venue in Brisbane, serving musicians who are often booking their first show.\n\n\n\n\n\n\"The gap between local acts and established acts seems to be getting wider,\" she told SBS News.\n\n\n\n\n\n\"Brisbane is home to some great large-scale venues, but with more and more small venues closing, there are noticeably less opportunities for artists to cut their teeth.\"\n\n\n\nREAD MORE The $50,000 reason some Australian music festivals are calling it quits\n\nMore than 1,300 live music venues and stages across Australia have been lost since the COVID-19 pandemic, according to a 2023 report from music rights management organisation APRA AMCOS.\n\n\n\n\n\nWelsh added: \"Venues are being bled by insurance premiums and rent and the alcohol excise, and they can’t afford to run all-ages shows because they rely on bar sales to support putting on music at all, and punters can’t afford to buy as many drinks as they used to because their rent is too damn high.\"\n\n\n\n\n\n\"The narrowing of music participation to people who can afford to treat it as a hobby, or who are forced to accept poverty to keep doing it, is just as creatively flattening as the algorithm.\"\n\n\n\nAlgorithms placing pressure on industry\n\nAt the same time, streaming platforms such as Spotify are continuing to grow, with over nine million users in Australia. Date from market research firm Roy Morgan found Spotify had doubled its Australian user base between 2017 and 2020.\n\n\n\n\n\nSince 2017, the platform has moved towards algorithmically creating personalised music recommendations, informed by a user's listening history and preferences.\n\n\n\n\n\nKoh says this means that people are more likely to value platforms like these instead of community radio, which was traditionally a hub for music discoverability.\n\n\n\n\"People lead such busy lives, so the amount of time that people can devote to going on their own musical journey and discovering new artists is getting more and more limited,\" he said.\n\n\n\n\n\nKoh says this convenience is creating a \"giant homogenous culture\".\n\n\n\n\n\n\"One thing that social media and algorithms can't replace is the experience and joy of seeing a band. That's often where artists find their audiences and the people who they can take on the journey with them throughout their careers.\"\n\n\n\n\n\nDespite coming off their largest Australian tour so far, Floodlights say it’s become harder to be discovered organically — even in the midst of a breakout moment.\n\n\n\n\n\n\"There’s so much music coming out every day, and unless you’re backed by major playlists or algorithms, it’s easy to get lost in the noise,\" Draffen said.\n\n\n\nShould Triple J be doing more?\n\nIn the face of so many obstacles, musicians such as Ben Lee — who is expected to chart in Saturday's countdown for his hits Cigarettes Will Kill You and Catch My Disease — have called for the ABC's Triple J to do more to support Australian music, including restricting all Hottest 100 countdowns to only spotlight Australian songs.\n\n\n\n\n\n\"At a time when there are so many platforms for international music discovery, I just don't see the logic in a taxpayer-funded station using their platform to promote international acts, many on major labels,\" Lee told SBS News.\n\n\n\n\n\nHe said it was being run like a \"commercial station that's constantly bending over backwards to increase listenership\", primarily through bigger international artists. Lee added that it should move to play only Australian music across the board.\n\n\n\n\n\n\"They could single-handedly lead the way to revitalising the Australian music industry if they wanted to. But it would mean stopping thinking of themselves as a commercial radio station, but rather as a mission-driven government utility,\" he said.\n\n\n\n\n\nThe station has a mandated quota of 40 per cent for Australian music, but typically plays closer to the 50 per cent mark.\n\n\n\n\n\nLast week, Lee made similar remarks on both social media and to The Sydney Morning Herald.\n\n\n\n\n\nHead of Triple J Lachlan Macara told the Herald seeing local artists next to international names was what made the Hottest 100 \" so special\".\n\n\n\n\n\nHe said the program \"would love to see even more people and platforms supporting and prioritising Australian artists\".\n\n\n\nAustralian musician Ben Lee has called for Triple J to do more to support Australian music. Source: Getty / Martin Philbey But members of the industry are still conflicted over the best path forward.\n\n\n\n\n\nWhile Floodlights recently played their biggest headline shows across the country, Draffen said it’s still difficult to cut through without support from Triple J.\n\n\n\n\n\n\"We’ve really had to double down on staying connected with our audience and finding new ways to reach people but it's hard as Triple J doesn’t really play us, which obviously makes it tougher to reach a wider audience in Australia,\" he said.\n\n\n\nWallis said that while artists at her record label have seen \"great support\" from Triple J Unearthed, which features unsigned local acts, she wanted to see more.\n\n\n\n\n\n\"I strongly believe Triple J should be focusing more on a diverse range of homegrown acts, rather than commercial, international acts that already have a platform.\"\n\n\n\n\n\nWelsh agrees the Hottest 100 should be all-Australian each year, but stopped short of supporting that across the board. \"Nobody does more for Australian music than Triple J,\" she said. \"The ones who are letting down Australian music are the commercial stations … There has been zero accountability for commercial radio formats to meet their local music quotas.\"\n\n\n\n\n\nKoh agreed: \"We know that we're doing our bit, and I think Triple J does as well.\"\n\n\n\n\n\nFBi Radio also operates under a 50 per cent Australian music mandate, with half of that coming from Sydney.\n\n\n\n\n\n\"I think it's important to see Australian music in a global context and that local artists just don't exist in a silo.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 37
  },
  {
    "url": "https://www.sbs.com.au/news/article/growing-support-for-four-day-work-week/1g8v1fyd0",
    "title": "Why working less could be better for you — and your employer",
    "publish_date": "Fri, 25 Jul 2025 20:34:46 +0000",
    "category": "finance",
    "authors": [],
    "text": "By the time mother-of-two Anna Dadic gets into the office in the morning, she already feels like she's \"fought three wars\".\n\n\n\n\n\nThe 42-year-old lives in the inner-west Sydney suburb of Marrickville, works full-time and is still breastfeeding her youngest child. She says she's constantly exhausted.\n\n\n\n\n\nOn weekdays, her routine starts at 5.30am so she can ready herself for work and drop her kids off at childcare.\n\n\n\n\n\nShe describes the process as \"rinse and repeat\".\n\n\n\n\n\n\"We are regimented in our routine and if anything upsets the order of things [such as someone falling sick] everything gets a lot harder,\" she says.\n\n\n\nREAD MORE The male breadwinner is gone. Why working from home is necessary for modern families\n\nDadic's husband does childcare pick-ups in the evenings, but then there's dinner to prepare, bathtime and the battle to put her children to bed.\n\n\n\n\n\nWinter is dreadful, she says, because the kids pick up various bugs from childcare.\n\n\n\n\n\n\"We are pretty socially isolated. Evening plans feel impossible, and we are usually too tired anyway, so they happen rarely.\"\n\n\n\n\n\nIn Australia, Dadic's situation is not unique.\n\n\n\n\n\nMost women now work and continue doing so even after having children.\n\n\n\nModern working conditions due for an update?\n\nNext year will mark 100 years since US carmaker Henry Ford pioneered a five-day work week for employees in his factories, which was a reduction from the six days generally worked.\n\n\n\n\n\nSwinburne University associate professor of management John Hopkins believes modern working conditions are again due for an update, including the possibility of working fewer hours.\n\n\n\nHenry Ford pioneered the five-day work week in his US factories almost 100 years ago. Source: Getty / PhotoQuest While the concept of a four-day work week has been discussed for more than 50 years, in the past decade, there has been a noticeable uptick in demand for more flexible work arrangements.\n\n\n\n\n\nHopkins says that over the past century, new technologies such as the internet have sped up the rate at which people can work, but this hasn't necessarily freed up time for workers.\n\n\n\n\n\n\"It's actually worked the opposite. They are just required to do more work in the same amount of time,\" he says.\n\n\n\n\n\nHopkins says technology has even led to people working longer hours because it allows them to check emails or be available after work.\n\n\n\nWe've had this intensification of work over the last 100 years where we're doing a lot more work in those eight hours per day than we were ever doing before ... and our brains are becoming overloaded.\n\n\"We need more time to rest [and] recover.\"\n\n\n\nThe benefits of working less\n\nJapan, which is struggling with record-low birth rates, is shortening working hours as a way of encouraging parenthood.\n\n\n\n\n\nIn April, the Tokyo Metropolitan Government introduced a flexible work system that allows its employees to take three days off per week while maintaining the same total working hours over a four-week period.\n\n\n\nIn a statement to SBS News, a spokesperson says the program allows employees to balance work and childcare responsibilities, and also helps those without children care for family members or pursue personal development.\n\n\n\n\n\nAn additional program specifically for parents of young children allows them to shorten their working hours by up to two hours per day.\n\n\n\n\n\n\"These hours do not need to be made up at a later date,\" the spokesperson says.\n\n\n\n\n\nHopkins says his research has found significant benefits to allowing workers to reduce their work hours — with no drop in salary — including a reduction in sick days, staff turnover, burnout and work-related stress.\n\n\n\nJapan has announced measures to ease the pressures of working life as it attempts to improve its low birth rate. Source: Getty / Tomohiro Ohsumi/Bloomberg As part of Hopkins' recent research project in Australia, 10 senior managers were interviewed about their experiences with introducing the four-day work week.\n\n\n\n\n\nA preview report released in 2023 showed that 70 per cent of employers observed increased productivity, while the other 30 per cent reported no change. None reported a drop.\n\n\n\n\n\nPositive results included reduced sick days and better ability to compete for talent and retain staff.\n\n\n\n\n\nWorkers found they had time to complete life admin tasks, take weekends away (including visiting family) and invest in self-care activities, such as exercise, massages and doctor visits. They also had more time to participate in hobbies.\n\n\n\nREAD MORE The harsh reality of trying to be a mum and work in law\n\nThis week, a paper published in the scientific journal Nature Human Behaviour also reported that employees who trialled a four-day work week were less likely to suffer burnout, had a higher rate of job satisfaction, and better mental and physical health.\n\n\n\n\n\nMore than 2,800 employees across 141 organisations in Australia, Canada, New Zealand, the UK, Ireland and the US were surveyed. Ahead of the six-month trial, low-value activities such as \"unnecessary meetings\" were eliminated to prepare people for working reduced hours.\n\n\n\n\n\nThe four-day work week is just one of several flexible work arrangements that are becoming increasingly popular, including hybrid work, remote work, unlimited leave, gender-neutral parental leave and flexible public holidays.\n\n\n\n'You need time to rest and recover'\n\nHopkins says one of the reasons Henry Ford dropped the number of work days from six to five was because he realised productivity didn't drop.\n\n\n\nTo perform at your best, to be the most productive, most efficient, you need time to rest and you need time to recover.\n\nHopkins points to AFL players as an example, noting they only play games once a week for six months of the year.\n\n\n\n\n\n\"If they were to play twice a week or three times a week, what would happen? They'd start to get more injuries, their performance would drop off.\"\n\n\n\nJust as athletes can get physical injuries if they push themselves too hard, other workers are susceptible to burnout. Source: Getty / Morgan Hancock He says some of the people interviewed for the four-day week survey said they no longer experienced the \"Sunday scaries\" before the start of the working week, when they would usually feel scared or apprehensive.\n\n\n\n\n\nIt also gave people more time to reflect on their work, Hopkins says, and identify ways of improving.\n\n\n\n\n\n\"You never have a good idea when you're working, you have a good idea when you're in the shower or when you're taking the dog for a walk, because your brain is thinking about different things and allows you to be creative,\" he says.\n\n\n\n\n\n\"So it is about striking that right balance between work and rest and recovery to optimise performance.\"\n\n\n\nYoung and middle-aged workers are feeling exhausted\n\nHopkins believes that work hours will be reassessed, partly because workers are feeling burnt out.\n\n\n\n\n\nA 2023 Melbourne University study on the State of the Future of Work found that 33 per cent of young and middle-aged workers reported difficulty concentrating at work because of their responsibilities outside of work. This compares to just 11 per cent of mature workers (aged 55 years or older).\n\n\n\n\n\nThe study looked at data from 1,400 Australian workers and found prime-aged workers (between 18 and 54 years old) were also twice as likely to feel like they didn't have enough time to do everything they needed to do compared to older workers.\n\n\n\nREAD MORE Feeling depleted by work? This is how Melanie beat burnout without quitting her job\n\nMore than half of the workers without access to flexible work surveyed reported feeling exhausted (55 per cent) compared to 45 workers who had access to flexible conditions. They also felt less motivated while at work.\n\n\n\nUnions push for four-day work week\n\nThis week, both the Australian Manufacturing Workers Union (AMWU) and the Australian Nursing and Midwifery Federation (ANMF) issued statements calling for a shorter working week to be introduced, ahead of the federal government's productivity roundtable next month.\n\n\n\n\n\nSteve Murphy, national secretary of the AMWU, says gains from improved productivity over the past decade have gone to bosses and not to workers.\n\n\n\n\n\n\"The best and most logical way to fairly share the gains of productivity is for workers to not have to work as many hours, and to move to a shorter working week,\" he says.\n\n\n\nProductivity cannot be at the expense of the wellbeing of workers.\n\nThe most recent data from the Australian Bureau of Statistics shows labour productivity fell by 1 per cent in the year to March, even though the number of hours worked rose by 2.3 per cent.\n\n\n\n\n\nA Productivity Commission bulletin in June noted productivity growth over the past decade had stagnated.\n\n\n\n\n\n\"In the absence of a growing productivity dividend, the dream of a more balanced life ... risks slipping out of reach for many Australians,\" it says.\n\n\n\nREAD MORE Anthony Albanese announces new move to tackle Australia's productivity problem\n\nSince 1980, Australians have used about 23 per cent of their productivity dividend — the savings from increasing productivity via automation and technological advancements — to work less, and banked the other 77 per cent as higher income.\n\n\n\n\n\nThe report notes that Australians have opted to use those savings to upgrade their lifestyles, such as buying fancier coffee and taking more expensive holidays, rather than further shortening their workdays.\n\n\n\n\n\nIt's hoped artificial intelligence (AI) will drive further productivity improvements, and unions want these benefits to be shared with workers.\n\n\n\n\n\nANMF federal secretary Annie Butler says the union believes shorter working weeks will promote gender equality because it will allow caring responsibilities to be more easily shared between partners, as noted in a 2023 report by the Senate Select Committee on Work and Care.\n\n\n\nAustralian Nursing and Midwifery Federation federal secretary Annie Butler says the union supports shorter working hours. Source: AAP / Mick Tsikas \"By changing the definition of 'full-time' work and encouraging a culture shift away from a focus on hours to that of productivity and work quality, the reduced hour model may lead to the removal of some of the barriers to women's professional advancement,\" the committee's report says.\n\n\n\n\n\nPart-time jobs may also be better paid because working for two days would be considered \"half a full-time equivalent\".\n\n\n\n\n\nButler says shorter working weeks would have a positive effect on women's workforce participation, increase the number of hours workers have to balance their well-being and care responsibilities, and ultimately improve retention.\n\n\n\nCould a four-day week be backed by government?\n\nThe Greens also support the introduction of a four-day work week.\n\n\n\n\n\n\"[It's] a better way to work and one that puts the health and happiness of workers first, while allowing the productivity of businesses to soar,\" Greens spokesperson for jobs and employment, Senator Barbara Pocock, says.\n\n\n\nIt’s a win for workers and a win for workplaces.\n\nAs part of its election campaign, the Greens supported bringing a test case to the Fair Work Commission and establishing a national institute to guide implementation of a four-day work week.\n\n\n\n\n\nPocock says the Greens remain committed to the policy.\n\n\n\n\n\nPrime Minister Anthony Albanese told The Australian newspaper this week he would support practical measures from the productivity roundtable that had broad support from business, unions and civil society.\n\n\n\nPrime Minister Anthony Albanese says he is looking for productivity measures that have broad support. Source: AAP / Mick Tsikas The Coalition, which walked back a proposal to force Canberra public servants back into the office five days a week during the federal election campaign , appeared non-committal when asked whether it supported the four-day work week.\n\n\n\n\n\n\"Liberals believe in agency and empowerment,\" Coalition spokesperson for industrial relations and employment Tim Wilson said in a statement to SBS News.\n\n\n\n\n\n\"Improving standards of living comes from partnerships to get ahead through salaries, startups, shareholdings and small business, and we are going to back Australians to back themselves.\"\n\n\n\n\n\nWhile there are benefits to a shorter working week, Hopkins' research on the four-day work week also identified several challenges.\n\n\n\n\n\nThis includes overcoming scepticism about its potential to increase productivity, making changes to roster systems so that staff can maintain services over five days, and the management of part-time workers.\n\n\n\nHopkins says moving to a four-day work week is not easy; it takes planning and piloting, but the businesses that have introduced the policy have stuck with it and seen the benefits, including being better able to attract and retain talented staff.\n\n\n\nFamilies have changed since the 1950s\n\nDemographer Liz Allen, from the Australian National University, says providing extra workplace flexibility could help couples manage the stresses of family life, but it was only one part of the puzzle if authorities want to boost Australia's declining birthrate , which is now at a record low of 1.5 babies per woman.\n\n\n\n\n\nIssues such as housing affordability, economic security, gender equality and climate change also need to be addressed.\n\n\n\n\n\nShe says many Australians are struggling to raise families within systems that have been developed based on outdated gender norms.\n\n\n\n\n\n\"When it comes to unpaid household work, men are not doing their fair share, and that's not the fault of men, that's how we've been conditioned,\" she says.\n\n\n\nOur tax system, our workplace system, all manner of things, are trapping us in this 1950s model of the perfect family.\n\n\"Family doesn't look like that anymore, family has changed, and the structural supports have not kept [up] with the times.\"\n\n\n\n\n\nAllen says it may be time to go back to the drawing board rather than continue \"trying to fit a square peg into a round hole\".\n\n\n\n\n\n\"We keep beating ourselves up because we can't get it to work.\n\n\n\n\n\n\"We lack the vision to do something different.\"\n\n\n\nPeople want a share of the time saved by AI\n\nWhile arrangements such as working from home have delivered time savings for some workers, not everyone benefits from this.\n\n\n\n\n\nHopkins says only about a third of jobs are remote-capable.\n\n\n\n[Some] people feel like they've been left behind. Their white collar colleagues have all of a sudden gained all this flexibility and ability to work from home over the last few years and they haven't gained anything.\n\nHowever, improved rostering and better access to holidays could help these workers, says Hopkins.\n\n\n\n\n\nThere may also be scope to consider whether a worker can perform some elements of their role at home, such as a train driver who may also have administrative tasks and logbooks to complete.\n\n\n\n\n\nAI may help employees work faster and Hopkins says \"people want a share in the time that's saved\".\n\n\n\nWorkers want a share of the time saved by new technology such as AI. Source: Getty / Oscar Wong \"They don't want to be working the same number of hours that people were working 100 years ago.\"\n\n\n\n\n\nBut he says this will ultimately come down to the management of technology and business owners.\n\n\n\n'A miserable feeling'\n\nDadic works from home two days a week, and her husband works a four-day week a couple of times a month. Her mother also helps out when her children — aged three and 16 months — are sick or something urgent comes up.\n\n\n\n\n\nShe worries that she and her husband are too tired to be fully present with their kids and are missing the joyful moments.\n\n\n\n\n\n\"I worry that, over time, that could have an impact on [the kids].\"\n\n\n\nAnna Dadic says she is exhausted due to juggling the demands of full-time work and being a mother to two children. Source: Supplied Dadic's aware of how lucky she is and how much worse things could be, but worries she's not living life to the fullest because she's constantly stressed and running on empty.\n\n\n\n\n\n\"That's a miserable feeling,\" she says.\n\n\n\n\n\n\"It's this constant cycle of guilt, worry, and self-criticism that's hard to break.\"\n\n\n\n\n\nAdditional reporting by AAP\n\n\n\n",
    "source": "SBS",
    "cluster_id": 38
  },
  {
    "url": "https://www.sbs.com.au/news/video/swim-programs-helping-new-australians-feel-confident-in-the-water/868xp32ck",
    "title": "Swim programs helping new Australians feel confident in the water",
    "publish_date": "Fri, 25 Jul 2025 10:11:29 +0000",
    "category": "sports",
    "authors": [],
    "text": "Swim programs helping new Australians feel confident in the water\n\nPublished 25 July 2025, 9:02 am\n\nCommunity groups say swim programs designed to address the needs of culturally and linguistically diverse communities are gaining popularity. Teachers hope to bring down the drowning death toll during Australia's Summer months. This story was produced in collaboration with SBS Dari.",
    "source": "SBS",
    "cluster_id": 39
  },
  {
    "url": "https://www.sbs.com.au/news/video/the-plan-to-make-australian-workers-14-000-richer/ifeqltc8t",
    "title": "The plan to make Australian workers $14,000 richer",
    "publish_date": "Fri, 25 Jul 2025 10:05:32 +0000",
    "category": "finance",
    "authors": [],
    "text": "The plan to make Australian workers $14,000 richer\n\nPublished 25 July 2025, 9:01 am\n\nThe Productivity Commission is urging the government to prioritise economic growth to fix Australia's decades-old productivity problem. The Commission's latest report found that for the last twenty years governments had arguably ignored or minimised economic growth, when making policy choices.",
    "source": "SBS",
    "cluster_id": 40
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/miners-drag-asx-down-cbas-horror-week/tp6i3qg26",
    "title": "Miners drag ASX down; CBA’s horror week",
    "publish_date": "Fri, 25 Jul 2025 08:31:16 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/podcast-episode/epstein-fallout-gaza-crisis-japans-far-right-surge/m4budlv92",
    "title": "Epstein fallout, Gaza crisis & Japan’s far-right surge",
    "publish_date": "Fri, 25 Jul 2025 07:13:13 +0000",
    "category": "finance",
    "authors": [],
    "text": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
    "source": "SBS",
    "cluster_id": 41
  },
  {
    "url": "https://www.sbs.com.au/news/article/trump-fact-checked-by-federal-reserve-boss-in-awkward-exchange-during-renovation-tour/ply92926c",
    "title": "Trump fact-checked by Federal Reserve boss in awkward exchange during renovation tour",
    "publish_date": "Fri, 25 Jul 2025 01:54:42 +0000",
    "category": "finance",
    "authors": [],
    "text": "Donald Trump was fact-checked by the man he has suggested firing during a tense meeting as the United States president toured the Federal Reserve's headquarters in Washington, DC.\n\n\n\n\n\nTrump visited the site of a US$2.5 billion ($3.79 billion) renovation with Federal Reserve chair Jerome Powell on Thursday — a project that has drawn repeated criticism from the US president in recent months because he believes it is overpriced.\n\n\n\n\n\nHe has also taken aim at Powell for not lowering interest rates and earlier this week referred to him as a \"numbskull\". Trump has said he wants to remove Powell but likely lacks the legal authority to do so.\n\n\n\n\n\nAn awkward exchange played out in front of reporters when Trump claimed the price tag for the renovation at the US' central bank was US$3.1 billion ($4.7 billion). Powell closed his eyes and shook his head before responding: \"I haven't heard that from anybody.\"\n\n\n\n\n\nTrump produced a sheet of paper apparently listing construction costs and was told curtly he was including work on the William McChesney Martin Jr Building which was not part of the project.\n\n\n\n\"You just added in a third building,\" Powell said, adding it was a renovation completed five years ago.\n\n\n\n\n\nTrump went on to ask Powell if he expected additional cost overruns, to which he replied: \"Don't expect them.\"\n\n\n\n\n\nAsked by a reporter what, in his career as a real estate developer, he would do if a project manager went over budget, Trump said: \"Generally speaking ... I would fire them.\"\n\n\n\n\n\nBut this week, Trump has toned down his threats to fire Powell. When calling him a \"numbskull\" who had \"done a bad job\" earlier this week, Trump said he would be out in eight months. That, however, would still be a couple of months out from the end of his term in May 2026. It was unclear why Trump picked that time frame.\n\n\n\nFederal Reserve chair Jerome Powell said Donald Trump had factored in the cost of a previously completed project after the US president claimed there had been a cost blowout in the renovation of the central bank's headquarters. Source: AAP, AP / Julia Demaree Nikhinson And after the visit, Trump said he did not intend to fire Powell.\n\n\n\n\n\n\"To do so is a big move and I just don't think it's necessary,\" he told reporters.\n\n\n\n\n\nElevated by Trump to the top Fed job in 2018 and then reappointed by former president Joe Biden four years later, Powell last met with the president in March when Trump summoned him to the White House to press him to lower rates.\n\n\n\n\n\nTrump has criticised Powell for months over his insistence on keeping the short-term interest rate at 4.3 per cent this year, after cutting it three times last year, when Biden was in office.\n\n\n\nREAD MORE What would the fallout be if Donald Trump tries to fire the Federal Reserve chief?\n\nThe visibly tense interaction between the pair comes less than a week before the central bank's 19 policymakers are due to gather for a two-day rate-setting meeting, where they are widely expected to leave their benchmark interest rate in the 4.25 to 4.50 per cent range.\n\n\n\n\n\nTrump has repeatedly demanded Powell slash rates by 3 percentage points or more.\n\n\n\n\n\n\"I'd love him to lower interest rates,\" Trump said as he wrapped up the tour, as Powell stood by, his face expressionless.\n\n\n\n\n\n— With reporting by the Agence France-Presse and Reuters news agencies\n\n\n\n",
    "source": "SBS",
    "cluster_id": 3
  },
  {
    "url": "https://www.sbs.com.au/news/article/the-top-public-school-premium-australian-homebuyers-are-paying/2cxpvp819",
    "title": "Up to $1.3 million: The top public school premium Australian homebuyers are paying",
    "publish_date": "Fri, 25 Jul 2025 01:43:56 +0000",
    "category": "finance",
    "authors": [],
    "text": "Families are spending thousands — and in some cases, over a million dollars — to buy homes within the catchment zones of top-performing public high schools, according to new research.\n\n\n\n\n\nBut the analysis by property data firm Cotality also suggests that paying more upfront does not necessarily mean greater long-term price growth.\n\n\n\n\n\nThe report looked at house prices in nine popular school catchment zones across Sydney and Melbourne.\n\n\n\n\n\nIn seven of those zones, homes inside the catchment were more expensive than similar homes nearby but outside the boundary.\n\n\n\n\n\nHowever, six of those catchments recorded weaker capital growth over the past 15 years.\n\n\n\nEliza Owen, head of residential research at Cotality, said the results confirm what many buyers already suspect, that popular school zones often come with a hefty housing premium.\n\n\n\n\n\n\"These premiums may reflect the value placed on getting into top public schools, but it could also reflect an array of other factors like proximity to train stations, or the high incomes of those living inside the catchment area,\" she said.\n\n\n\nThe economics of catchment area homes\n\nHomes in the combined catchments of Killara High, Willoughby Girls and Lindfield Learning Village in Sydney's North Shore held a median value of nearly $1.3 million higher than homes nearby but outside the catchment.\n\n\n\n\n\nDespite this, houses in the catchment recorded lower long-term growth of 126 per cent over the past 15 years, compared to 150 per cent in neighbouring areas.\n\n\n\nIn Melbourne, the premium for homes in the catchments of Princes Hill and University High School reached $357,000.\n\n\n\n\n\nCapital growth was again weaker than that of the surrounding suburbs, with in-catchment homes growing by 82.6 per cent over 15 years, compared to 106 per cent in nearby areas.\n\n\n\n\n\nOwen said as affordability has worsened in many good school catchment areas, this may have contributed to a spill-over in demand outside of the zones, leading to lower total capital growth.\n\n\n\n\n\n\"In many cases, that means the premium has trended lower over time,\" she said.\n\n\n\nNot all school zone homes cost more\n\nThe report also found areas where homes inside a high-performing catchment were actually cheaper than those outside.\n\n\n\n\n\nHouses in Sydney's Cherrybrook Technology High School catchment were $155,000 lower than those outside the boundary in the same suburbs.\n\n\n\n\n\nIn Melbourne, houses in the Doncaster Secondary College catchment were $48,000 lower than those outside the zone.\n\n\n\n\n\n\"For many families, buying into a strong public school zone may still be a more affordable alternative to private education,\" a statement from Cotality said.\n\n\n\n\n\nAccording to Futurity Investment Group, the average cost of 13 years of private education in Australia was estimated at $349,000 in 2022, with significantly higher costs in Sydney and Melbourne.\n\n\n\n\n\n\"In six of the nine regions we analysed, the house price premium within public school zones was at least 100,000 dollars,\" Owen said.\n\n\n\n\n\n\"While that’s a significant upfront cost, it could end up saving families money when compared to paying for private schooling over many years.\"\n\n\n\n",
    "source": "SBS",
    "cluster_id": 42
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/the-one-origin-change-johns-wont-cop-20250726-p5mhzc.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "The one Origin change Johns won't cop",
    "publish_date": "Sat, 26 Jul 2025 12:09:38 +1000",
    "category": "finance",
    "authors": [],
    "text": "The one Origin change Johns won't cop\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 23
  },
  {
    "url": "https://www.theage.com.au/national/root-surpasses-ponting-on-all-time-test-runs-leaderboard-20250726-p5mhz9.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Root surpasses Ponting on all-time Test runs leaderboard",
    "publish_date": "Sat, 26 Jul 2025 11:49:04 +1000",
    "category": "sports",
    "authors": [],
    "text": "Root surpasses Ponting on all-time Test runs leaderboard\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 24
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/broncos-to-calm-walsh-down-as-loss-rocks-finals-hopes-20250726-p5mhz5.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Broncos to ‘calm’ Walsh down as loss rocks finals hopes",
    "publish_date": "Sat, 26 Jul 2025 11:38:09 +1000",
    "category": "sports",
    "authors": [
      "Joel Gould"
    ],
    "text": "Brisbane must find patience and composure in their play or risk becoming cannon fodder in the finals – if they get there.\n\nThe Broncos’ top-four hopes are on the rocks after their 22-20 loss to a superb Parramatta on Friday night at Suncorp Stadium.\n\nThey still need three wins from their remaining six matches to even be assured of finishing in the top eight and playing in the finals.\n\nThe Broncos started the match against the Eels with a determination to get through their sets, which they initially did, and earn their points.",
    "source": "TheAge",
    "cluster_id": 25
  },
  {
    "url": "https://www.theage.com.au/national/king-dismissed-by-owen-20250726-p5mhz4.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "King dismissed by Owen",
    "publish_date": "Sat, 26 Jul 2025 11:23:49 +1000",
    "category": "finance",
    "authors": [],
    "text": "King dismissed by Owen\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 26
  },
  {
    "url": "https://www.theage.com.au/sport/aussie-runners-scary-collapse-20230303-p5cp2q.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Aussie runner's scary collapse",
    "publish_date": "Sat, 26 Jul 2025 10:37:37 +1000",
    "category": "sports",
    "authors": [],
    "text": "Aussie runner's scary collapse\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 27
  },
  {
    "url": "https://www.theage.com.au/culture/music/triple-j-hottest-100-australian-songs-hilltop-hoods-favourite-for-number-one-20250726-p5mhyl.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Triple J Hottest 100 Australian songs: Hilltop Hoods favourite for number one",
    "publish_date": "Sat, 26 Jul 2025 10:16:02 +1000",
    "category": "entertainment",
    "authors": [
      "Thomas Mitchell"
    ],
    "text": "Well, the day is finally here: Triple J is set to announce the Hottest 100 Australian songs of all time.\n\nTypically, the Hottest 100 is an annual countdown of the best songs of the year from all over the world. But to celebrate the youth station’s 50th anniversary, Triple J is staging a countdown of the greatest ever home-grown tracks.\n\nThe Hilltop Hoods, Daniel Smith, Matthew Lambert and Barry Francis, are the bookies’ favourite. Credit: Dominic Lorrimer\n\nAudiences have been voting for months to unearth Australia’s favourite song.\n\nEven Prime Minister Anthony Albanese got in on the act, nominating The Angels’ Am I Ever Gonna See Your Face Again and Cold Chisel’s Flame Trees in his list.",
    "source": "TheAge",
    "cluster_id": 28
  },
  {
    "url": "https://www.theage.com.au/lifestyle/hottest-100-aussie-songs-20250726-p5mhyv.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Hottest 100 Aussie songs",
    "publish_date": "Sat, 26 Jul 2025 10:08:34 +1000",
    "category": "lifestyle",
    "authors": [],
    "text": "Hottest 100 Aussie songs\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 11
  },
  {
    "url": "https://www.theage.com.au/national/victoria/community-anger-after-losing-six-year-battle-against-beachside-fast-food-outlet-20250724-p5mhjn.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Community anger after losing six-year battle against beachside fast-food outlet",
    "publish_date": "Sat, 26 Jul 2025 09:52:00 +1000",
    "category": "finance",
    "authors": [
      "Tom Cowie"
    ],
    "text": "A controversial new fast-food outlet less than 100 metres from a Mornington Peninsula beach has won approval after almost six years of resistance from hundreds of residents and the local council.\n\nA BP service station on the foreshore at Safety Beach, along the Nepean Highway, will be redeveloped to include a 24-hour convenience food store and drive-through after a successful appeal to the Victorian Civil and Administrative Tribunal.\n\nResidents have fought plans for a new McDonald’s on the Mornington Peninsula site for almost six years. Credit: Justin McManus\n\nMornington Peninsula Shire Council twice rejected applications by the site owners, AA Holdings, for a larger service station and new takeaway outlet after both bids drew a total of about 1500 objections from the community.\n\nVCAT also previously blocked the proposal until ultimately approving it this month. The applicants first sought council permission for their plan in 2019.",
    "source": "TheAge",
    "cluster_id": 29
  },
  {
    "url": "https://www.theage.com.au/national/east-coast-bracing-for-wet-and-gloomy-weekend-20250726-p5mhys.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "East Coast bracing for wet and gloomy weekend",
    "publish_date": "Sat, 26 Jul 2025 09:44:39 +1000",
    "category": "finance",
    "authors": [],
    "text": "East Coast bracing for wet and gloomy weekend\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 30
  },
  {
    "url": "https://www.theage.com.au/sport/three-time-olympian-sues-sporting-body-over-false-imputations-of-paedophilia-20250725-p5mhw3.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Three-time Olympian sues sporting body over ‘false imputations of paedophilia’",
    "publish_date": "Sat, 26 Jul 2025 09:36:41 +1000",
    "category": "sports",
    "authors": [
      "Frances Howe"
    ],
    "text": "A three-time Olympic figure skater is suing NSW’s ice skating association for defamation, claiming it made “false imputations of paedophilia and child molestation” against him in an email to members.\n\nDocuments released by the NSW Supreme Court on Friday reveal Brendan Kerry, 30, is seeking damages and an order permanently restraining the sporting body from repeating the claims in the email, sent to members on May 16 last year.\n\nBrendan Kerry skates during the Beijing 2022 Winter Olympic Games at Capital Indoor Stadium. Credit: Getty Images\n\nKerry was on the board of the NSW Ice Skating Association (NSWISA) until May 2024 but stood down when he received a lifetime coaching ban from the US Centre for SafeSport, which found he had engaged in “sexual misconduct involving a minor”.\n\nIn the statement of claim, Kerry’s lawyers say the finding by the US Centre for Safe Sport “involved a female [in California] who was 17 years old when Kerry was 21”.",
    "source": "TheAge",
    "cluster_id": 31
  },
  {
    "url": "https://www.theage.com.au/sport/swimming/a-chinese-swimmer-born-in-2012-is-ready-to-break-an-89-year-old-record-20250725-p5mhvt.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "A Chinese swimmer born in 2012 is ready to break an 89-year-old record",
    "publish_date": "Sat, 26 Jul 2025 09:30:00 +1000",
    "category": "sports",
    "authors": [
      "Tom Decent"
    ],
    "text": "A 12-year-old Chinese swimmer who took up the sport in 2019 after being approached at an amusement park pool is hoping to become the youngest medallist at an international meet in 89 years next week.\n\nYu Zidi, born in October 2012, will become one of the youngest swimmers ever to contest a major international meet when she lines up in three events at the World Aquatics Championships from July 27 to August 3.\n\nYu made headlines last year as an 11-year-old after falling two seconds short of making the cut to represent China at the Paris Olympics.\n\nJust over a year later, Yu has earned selection on China’s national team and will compete in three events in Singapore – the women’s 200m butterfly, 200m individual medley and 400m individual medley races.",
    "source": "TheAge",
    "cluster_id": 32
  },
  {
    "url": "https://www.theage.com.au/sport/motorsport/piastri-surprised-by-big-lead-20250726-p5mhyq.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Piastri 'surprised' by big lead",
    "publish_date": "Sat, 26 Jul 2025 09:09:19 +1000",
    "category": "finance",
    "authors": [],
    "text": "Piastri 'surprised' by big lead\n\nWe’re sorry, this feature is currently unavailable. We’re working to restore it. Please try again later.\n\nDismiss",
    "source": "TheAge",
    "cluster_id": 33
  },
  {
    "url": "https://www.theage.com.au/sport/nrl/alex-johnston-is-about-to-become-rugby-league-s-don-bradman-20250725-p5mhp0.html?ref=rss&utm_medium=rss&utm_source=rss_feed",
    "title": "Alex Johnston is about to become rugby league’s Don Bradman",
    "publish_date": "Sat, 26 Jul 2025 09:00:00 +1000",
    "category": "sports",
    "authors": [
      "Malcolm Knox"
    ],
    "text": "Asking rugby league to come together can be like inviting cannibals to a family Christmas, but some time soon, every member of every club should pause and give an ovation for Alex Johnston.\n\nThe South Sydney winger is orbiting the game’s version of the moon landing: Ken Irvine’s record of 212 tries. If Johnston maintains his current rate – as prolific at age 30 as it was at age 20 – and if he stays fit, he will reach the record before Mad Monday.\n\nIrvine’s 212, like Wilt Chamberlain’s 100-point NBA game or Jerry Rice’s 22,895 receiving yards and 1549 pass receptions in the NFL, is one of those freakish individual feats in a team sport that was never meant to be broken.\n\nHere’s some perspective. When Irvine retired after winning the 1973 grand final with Manly, the next-highest try scorer in rugby league was the North Sydney Bears’ Harold Horder, whose record of 152 dated from 1920. When Irvine passed away from leukaemia in 1990, Terry Lamb was the only other player to have passed Horder’s total. The Back-Up Man ended up with 164 tries. Lamb played 350 games during 16 years and retired at age 35; he would have had to play on well into his 40s to challenge Irvine’s record.",
    "source": "TheAge",
    "cluster_id": 34
  },
  {
    "url": "https://au.news.yahoo.com/big-change-sydney-nye-fireworks-010944558.html",
    "title": "Big change for Sydney’s NYE fireworks",
    "publish_date": "2025-07-26T01:09:44Z",
    "category": "finance",
    "authors": [
      "Duncan Evans"
    ],
    "text": "Sydney’s New Year’s Eve fireworks show is a major tourist attraction for the city. Picture: NewsWire / Flavio Brancaleone\n\nRevellers taking in Sydney’s legendary New Year’s Eve fireworks show could soon have to shell out $50 to access a prime viewing spot in a major shake-up to how tourists and locals experience the beloved event.\n\nNorth Sydney councillors will decide next week whether to implement “ticketed access” to Blues Point, a popular vantage point that fronts Sydney Harbour and the Harbour Bridge.\n\nThe council area boasts three renowned vantage points for the show, namely Bradfield Park, Lavender Bay and Blues Point, with thousands of punters descending on the spots on December 31 to take in the party.\n\nBut a new report, which will be debated at the council’s Monday night meeting, recommends councillors establish an introductory $50 ticket price for Blues Point to recoup costs associated with New Year’s Eve.\n\nADVERTISEMENT\n\n“The current budget for NYE is $1,086,000,” the report states.\n\n“To introduce ticketing at Blues Point only, additional costs of approximately $95,000 would be incurred including contract staff, equipment, and additional communications support. This would result in a total cost of $1,181,000.\n\nSydney’s NYE fireworks shows draws in huge crowd numbers across the CBD and North Sydney. Picture: NewsWire / Flavio Brancaleone\n\n“If 8000 tickets were sold to access Blues Point at $50 per ticket, this would generate $400,000 in revenue, reducing council’s net expenditure to manage NYE crowds to circa $781,000.”\n\nAt the moment, access to all three sites is free.\n\nCouncil costs for the event include providing toilets and bins and crowd and traffic management.\n\nBradfield Park sits just below the northern end of the Harbour Bridge, close to Kirribilli House, while Lavender Bay sits between the park and Blues Point.\n\nThe report acknowledges introducing tickets could cause some consternation in the community.\n\nADVERTISEMENT\n\n“Ticketing for an event which has been free of charge could see large numbers of non-ticket holders arriving at the sites, potentially manifesting in unsettled behaviour near entry gates, dissatisfaction voiced to staff on the ground or complaints to council’s customer service centre,” the report states.\n\nNorth Sydney Council takes in the densely populated parts of Sydney immediately north of the Harbour. Picture: Supplied\n\n“This can be managed by regular, targeted communications in the lead-up to the event, along with well-planned operations and thorough briefing of staff prior to the event.”\n\nThe countdown and fireworks is a hugely popular draw for both Sydneysiders and tourists from across the world.\n\nBritish tourist Ben Scammell, speaking after the 2023-24 show, told NewsWire that he was overawed and did not have words for the spectacle he witnessed.\n\n“That was just … I don’t have words for it,” he told said.\n\n“It made the whole coming to Australia so much worth it … it was the pinnacle.\n\nADVERTISEMENT\n\n“That moment will last my whole lifetime.”\n\nThe first batch of fireworks to mark the start of a new year explodes over Sydney Harbour at 9pm, with a second batch at midnight.\n\nEarlybird fireworks devotees grab the best spots early in the day. Picture: NewsWire/ Monique Harmer\n\nHundreds of thousands of people cram into the CBD and North Sydney to witness the show.\n\nThe report to North Sydney Council outlines three options for the 2025-26 event.\n\nOption 1 involves ticketing across all three spots to achieve “full cost recovery”.\n\nOption 2 involves “partial cost recovery”, with ticketing limited to Blues Point, and Option 3 involves continuing with “free managed access”.\n\nThe report recommends the councillors trial option 2.\n\n“Subject to community consultation and feedback following NYE 2025-26, council could then decide whether to change the ticket price for future NYE managed access, expand or maintain the number of ticketed locations or return to free-access options for all managed sites,” the report states.\n\nNewsWire reached out to North Sydney Mayor Zoe Baker for comment, but she didn’t respond by the time this article was published.",
    "source": "Yahoo",
    "cluster_id": 43
  },
  {
    "url": "https://au.news.yahoo.com/warning-issued-to-aussies-over-game-changing-wheelie-bin-hack-235613855.html",
    "title": "Warning issued to Aussies over 'game-changing' wheelie bin hack",
    "publish_date": "2025-07-25T23:56:13Z",
    "category": "finance",
    "authors": [],
    "text": "It may look like the genius bin hack we've all been waiting for, but one waste management company has issued a caution to those who attempt it.\n\nThe wheelie bin hack shared by one Aussie has left thousands in awe. Source: TikTok/e.l.o.wheeze\n\nWheeling two bins to the kerb and back every bin day can be a tricky juggle, especially if you have a long driveway and little kids in tow. But one Aussie woman has recently revealed the 'game-changing' bin hack she uses to solve a common household problem faced by families across the country.\n\nIn the video, the mum demonstrates how to join the red bin to the yellow bin to pull both at the same time easily. She even uses her car's tow bar to pull them back up the driveway.\n\n\"Just chuck the first lid inside the second, close the second lid, yank it up so it's sitting like a little piggyback back and off you go,\" she said, as she uses her 4WD to maneuver the two empty bins up the driveway of her rural property.\n\nThousands of viewers came forward to express their delight with the clever hack, with Aussies describing it as \"game-changing\" and \"genius\".\n\nADVERTISEMENT\n\nHowever, not everyone has heaped praise on the shortcut. Leading waste management company Veolia told Yahoo News \"bins are designed to be used in the 'normal' way\".\n\n\"That's what we recommend to keep yourself safe and the place tidy,\" a spokesperson said.\n\nWaste management company reveals more wheelie bin hacks\n\nThe company told Yahoo that it's seen a host of hacks residents use to manoeuvre their wheelie bins over the years.\n\n\"It’s not uncommon for people with long driveways to hitch their bins to the towbar of their vehicles, but we have also seen bins towed by bicycles, propelled by leaf blowers, and even guided by electric skateboards,\" the spokesperson said.\n\nBut Veolia advises Aussies' safety is the utmost priority.\n\n\"Get a neighbour to help if you're struggling, check on any neighbours who need help and operate as a community.\n\nADVERTISEMENT\n\n\"We all love our bins, but instead of giving them a tow take the opportunity to get those steps in and walk them to the kerb ― just watch out for your shins,\" he said.\n\nIt's understood that standard bins are designed to be lightweight and should not weigh more than 70kg when full of waste to ensure that the sidearm collection trucks can easily and safely pick them up.\n\nThe viral hack is being tried and tested all over the world, with the trick seemingly working on different sized bins. Source: TikTok/@cadegrier\n\nBin hack gains traction worldwide\n\nThe bin hack used by the Aussie woman this week was first posted by a US social media creator last year, which has since been seen over 17 million times.\n\nWhile the earlier videos demonstrate the same concept, the bins in the US and Canada are quite different from Australian bins. Aussies were quick to jump on the trend and confirm it works here too.\n\nADVERTISEMENT\n\n\"The lid of the bin that’s being towed should be pushed inside of the other, the plastic bends fine, and if it does deform a day in the sun puts it right back,\" one person confirmed.\n\nDo you have a story tip? Email: newsroomau@yahoonews.com.\n\nYou can also follow us on Facebook, Instagram, TikTok, Twitter and YouTube.",
    "source": "Yahoo",
    "cluster_id": 44
  }
]